{
  "fuentes": [
    {
      "url": "https://www.charlotteharborecc.com/p/about/community",
      "email": "clare.riggs@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about",
      "email": "clare.riggs@charlottecountyfl.gov"
    },
    {
      "url": "https://wateroakcc.com/contact-us/",
      "email": "customerservice@mhi.org"
    },
    {
      "url": "https://www.charlotteharborecc.com/contact.aspx",
      "email": "clare.riggs@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "close_side_menu@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "close_side_menu_dark@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "cw-logo-reverse@2x-300x98.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "cw-logo-reverse@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "cw-logo-stacked@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "cw-logo@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "frame_arrow_left@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "frame_arrow_left_hover@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "frame_arrow_right@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "frame_arrow_right_hover@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "info@charlotteworks.com"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "minus@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "plus@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "portfolio_list_button@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "portfolio_list_button_hover@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_cross@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_cross_black@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_cross_white@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_minus@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_minus_black@2x.png"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "email": "vertical_menu_minus_white@2x.png"
    },
    {
      "url": "https://www.charlotteharborecc.com/sitemap.aspx",
      "email": "clare.riggs@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "paula.estrada@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "clare.riggs@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "halie.thompson@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "janet.emmett@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "jim.finch@charlottecountyfl.gov"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "michelle.maldonado@charlottecounty.fl"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "email": "michelle.maldonado@charlottecountyfl.gov"
    },
    {
      "url": "https://www.eventective.com/port-charlot-fl/meeting-venues/",
      "email": "laurend@elementsrq.com"
    },
    {
      "url": "https://www.charlotteharborecc.com/events/2020/public-safety-appreciation-night-2023",
      "email": "clare.riggs@charlottecountyfl.gov"
    }
  ],
  "mails": [
    "clare.riggs@charlottecountyfl.gov",
    "close_side_menu@2x.png",
    "close_side_menu_dark@2x.png",
    "customerservice@mhi.org",
    "cw-logo-reverse@2x-300x98.png",
    "cw-logo-reverse@2x.png",
    "cw-logo-stacked@2x.png",
    "cw-logo@2x.png",
    "frame_arrow_left@2x.png",
    "frame_arrow_left_hover@2x.png",
    "frame_arrow_right@2x.png",
    "frame_arrow_right_hover@2x.png",
    "halie.thompson@charlottecountyfl.gov",
    "info@charlotteworks.com",
    "janet.emmett@charlottecountyfl.gov",
    "jim.finch@charlottecountyfl.gov",
    "laurend@elementsrq.com",
    "michelle.maldonado@charlottecounty.fl",
    "michelle.maldonado@charlottecountyfl.gov",
    "minus@2x.png",
    "paula.estrada@charlottecountyfl.gov",
    "plus@2x.png",
    "portfolio_list_button@2x.png",
    "portfolio_list_button_hover@2x.png",
    "vertical_menu_cross@2x.png",
    "vertical_menu_cross_black@2x.png",
    "vertical_menu_cross_white@2x.png",
    "vertical_menu_minus@2x.png",
    "vertical_menu_minus_black@2x.png",
    "vertical_menu_minus_white@2x.png"
  ],
  "nombre_sitio": "charlotteharborecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.charlotteharborecc.com/p/about/community",
      "text": "Community skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Home > About Us > Community Community of Transcript of Transcript Pedestrian and Bicycle Friendly Aside from the fact that downtown Punta Gorda offers prime meeting space and high quality lodging options, the charming historic district provides many amenities and entertainment choices to ensure a memorable experience for all visitors.  There is little to no need for hiring ground transportation as there are over two dozen dining establishments along with a variety of shops and entertainment venues within a 3 block radius to which attendees can leisurely walk.  Or to explore the destination further take advantage of Punta Gorda’s Free Bike Loaner Program . Culinary Scene Whether it’s an upscale dining experience offered by Carmelo's Italian Ristorante or authentic Fish & Chips featured at the Celtic Ray, downtown Punta Gorda will surprise your palate with creative, talented chefs cooking up delectable dishes spanning an array of cuisines.  Can you beat Bobby Flay?  Chef Jeanie Roland, a five- time James Beard Foundation Best Chef of the South semi-finalist, did and you can sample her spectacular recipes at The Perfect Caper.  If seafood is what you’re craving, try the crab legs or sushi bar at Laishley Crab House which also features a private dining room capable of accommodating up to 150.  For smaller groups, several other downtown restaurants offer private dining as well including River City Grill and F.M. Don's. And save room for dessert so you can visit Harborwalk Scoops & Bites, ranked the #1 ice cream shop in the U.S. by TripAdvisor reviewers. Unique Attractions/Offsite Group Activities Regardless of your purpose for visiting the Charlotte Harbor Event & Conference Center, there is a myriad of unique attractions that can be experienced as part of a group activity or during your individual free time.  For casual networking consider a golf outing at one of our highly rated courses such as Riverwood Golf Club, recently ranked the #15 course in the entire state of Florida. Discover the Peace River Botanical & Sculpture Gardens or the Visual Arts Center can customize a group workshop offering an art medium of your choice.  Interested in something a little more passive?  Punta Gorda is home to Peace River Wildlife Center, the Military Heritage Museum and the Vietnam Memorial of Southwest Florida…or check the event schedule to see what festival or activity may be occurring at Laishley Park or Gilchrist Park.  Also, just a mile down the road is the must-see Fishermen’s Village which has something for everyone:  over 30 specialty/boutique shops, a variety of sightseeing cruises as well as fishing charters through King Fisher Fleet, boat/jet ski/kayak rentals, four restaurants, live entertainment and the above-mentioned Military Heritage Museum. Bragging Rights What makes Punta Gorda the perfect meeting spot?  Here are just a few things that separate us from the competition: #1 Place in the World for Tarpon Fishing—Sport Fishing Magazine 3rd Best Place in America to Live & Play Golf—Golf Digest Top Ten Places to Sail in the U.S.—SAIL Magazine 2014 Best Spring Training Venue—USA Today 2nd Safest City in Florida—Background Checks.org One of the Best Healthy Places to Retire—US News & World Report Learn More Need more general information about the destination or assistance in bringing your meeting, conference or other event to the area?  Contact the Charlotte Harbor Visitor & Convention Bureau at 941-743-1900 or visit www.pureflorida.com . Come. Take advantage of our good nature. of Transcript What To Do of Transcript Where To Stay of Transcript What To Eat of Transcript Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about",
      "text": "About skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Home > About Us About Us As our name implies, our facility was built for two main purposes, first to be an event center for the local community and second, to be a conference center for both local and regional groups and organizations. Upon its opening in January of 2009 the Charlotte Harbor Event and Conference Center has hosted small meetings, large galas, sporting events, concerts, expos and just about anything else you can think of. For a facility that is just over 44,000 square feet, it stays very busy. We have a small dedicated staff that feels that every event, no matter how small or large, deserves the same amount of support and attention. We are an ideal location for those events that don’t want to get lost in a large expansive facility as well as those smaller local events, that at one time had to go to a larger city, we can now cater to you in your own backyard. We believe in partnering with you, our customer, to make your event the most memorable that it can be. We listen to your comments and needs, and strive to make your event as worry-free as possible and to exceed your expectations. A small example of what the Charlotte Harbor Event and Conference Center has to offer: 240 FREE parking spaces on site 7 flexible meeting spaces 1000 person dining capacity; 1800 general session capacity Close proximity to I-75 and US-41 (Tamiami Trail) High speed internet access and Free Wi-Fi throughout the facility 11 theatrical line-sets in main meeting space along with diverse in-house audio-visual services Exclusive food & beverage services provided by Savor…Charlotte Harbor 2 Loading docks and ramp provide easy-load-in and load-out ADA accessibility of Transcript Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://wateroakcc.com/contact-us/",
      "text": "Contact Us - Water Oak Conference Center Home Room Types Amenities Gallery Location Contact Us Home Room Types Amenities Gallery Location Contact Us Make A Reservation Home Contact Us Contact Us CONTACT US We're always ready to help you plan your next event! No matter if you have a short-term need for a meeting place or an extended amount of time for a conference, Water Oak Conference Center is here to help. Address MHI Building 8720 Red Oak Blvd, Charlotte, NC 28217 Phone (704) 714-8705 Email customerservice@mhi.org Home Book Your Event About Water Oak Room Types Amenities Gallery Location Contact Linkedin Copyright © 2022 - Water Oak Conference Center Home Room Types Amenities Gallery Location Contact Us"
    },
    {
      "url": "https://www.charlotteharborecc.com/contact.aspx",
      "text": "Contact skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Skip Navigation Links Home > Contact Contact Charlotte Harbor Event and Conference Center 75 Taylor Street, Punta Gorda, Florida 33950 941-833-5444 Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://www.charlotteworks.com/about/board-of-directors/",
      "text": "Board of Directors - Charlotte Works Donate Our Services Business Engagement Career Services Youth & Young Adults Training Providers Workforce Data Labor Market Information Construction Finance Healthcare Hospitality Information Technology Manufacturing Transportation & Logistics My Career Career Services Career Maps About Us Board of Directors Staff Annual Report News and Blog Events Calendar Compliance Community Partners Contact Our Services Business Engagement Career Services Youth & Young Adults Training Providers Workforce Data Labor Market Information Construction Finance Healthcare Hospitality Information Technology Manufacturing Transportation & Logistics My Career Career Services Career Maps About Us Board of Directors Staff Annual Report News and Blog Events Calendar Compliance Community Partners Contact Board of Directors Home › About Us › Board of Directors Our Commitment is Key Our Board of Directors charts a path to support the mission and vision of Charlotte Works. These committed community members hail from a variety of backgrounds, representing a broad range of the region’s businesses, industries, educational institutions, and organizations. Whether through our business services, community partnerships, youth and young adult programs, or data resources, our dedicated staff follows through on the objectives and initiatives determined by our Board. Our Board of Directors Raki McGregor (Chairman) SYDKIMYL Educational Consulting Brandi Newman (Vice Chair) Atrium Health, now a part of Advocate Health Cassandra Triggs-Tucker (Treasurer/Secretary) Hearst Communications Monica Allen City of Charlotte Melissa Balknight Charlotte Mecklenburg Schools Sparkle Douglas Truist Bank Veronica Grantham NC Department of Commerce Chris Hage Duke Energy Christine Hollanshead PSA Airlines William Haygood Boundary Street Advisors Heather Hill Central Piedmont Community College Stephanie Hurren Hornets Sports & Entertainment Chris Jackson Goodwill Industries of the Southern Piedmont Roger Johnson Mecklenburg County Office of Economic Development David Leonardi UA Local 421 A. Fulton Meachem INLIVIAN Thomas Ray Groninger USA, LLC Tonja Reeder Division of Employment and Independence for People with Disabilities, NC Department of Health and Human Services Chad Schuchmann Polypore International Blair Stanford Charlotte Executive Leadership Council Cheryse Terry Archive CLT Scott Thrower Southern Piedmont Central Labor Council What started as a subcommittee of our board has grown to become a broader workforce initiative. The Charlotte-Mecklenburg Workforce Development Providers Council (WPC) is comprised of 15 organizations that serve job seekers and businesses in the Charlotte-Mecklenburg area. The WPC is an advisory committee to the Charlotte Works Workforce Development Board that provides leadership for local workforce development efforts and collaborates to develop talent, respond to business needs and ultimately increase economic opportunity. The names of our WPC partners are featured on this page. To learn more about the WPC and how it supports our Talent Source Network (TSN), click here . Board of Directors Meetings Regular Board of Directors Meetings Friday, September 5, 2025 10:00 a.m. – 12:00 p.m. Location: NCWorks Career Center Friday, November 7, 2025 10:00 a.m. – 12:00 p.m. Location: Zoom Friday, January 23, 2026 10:00 a.m. – 12:00 p.m. Location: NCWorks Career Center Friday, April 17, 2026 10:00 a.m. – 11:00 a.m. Location: Zoom Friday, May 29, 2026 10:00 a.m. – 11:00 a.m. Location: Zoom *Unless noted, all of the NCWorks Career Center Board of Directors meetings are at 8601 McAlpine Park Drive, Suite 110 Charlotte, NC 28211 Contact us at info@charlotteworks.com for more information. Sign up for our newsletter to stay in the loop on local workforce initiatives! Leading the development of a skilled and in-demand workforce by engaging businesses, aligning community partners, empowering and connecting job seekers to meaningful employment, and fostering inclusive economic growth. Sign Up Equal Opportunity Employer/ Program Auxilary Aids & Services Available to Individuals with Disabilities. Terms & Conditions Privacy Policy Compliance Contact For detailed funding information, please visit our compliance disclosure. © Copyright 2025 Charlotte Works"
    },
    {
      "url": "https://www.charlotteharborecc.com/sitemap.aspx",
      "text": "Site Map skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Skip Navigation Links Home > Site Map Site Map Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://www.charlotteharborecc.com/p/about/contact-us",
      "text": "Contact Us skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Home > About Us > Contact Us Contact Us Contact us today to book your next event: Charlotte Harbor Event and Conference Center 75 Taylor Street, Punta Gorda, Florida 33950 941-833-5444 of Transcript Jim Finch General Manager 941-833-5445 Clare Riggs Assistant General Manager 941-833-5442 Michelle Maldonado Senior Event Services and Sales Manager 941-833-5443 Halie Thompson Operations Manager 941-833-5449 Janet Emmett Food and Beverage Director 941-833-3896 Paula Estrada Director of Finance/HR Designee 941-833-5446 of Transcript of Transcript Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://www.eventective.com/port-charlot-fl/meeting-venues/",
      "text": "Meeting Venues in Port Charlotte, FL - 180 Venues | Pricing | Availability Toggle navigation Party Wedding Meeting List Your Business Sign In Find a Venue Port Charlotte Meeting Venues Meeting Venues near Port Charlotte, FL Filter Sort Price (Low - High) Price (High - Low) Most Recommended Most Popular Capacity (Low - High) Capacity (High - Low) Map List The Grill at 1951 Port Charlotte, FL 32 Capacity $250 / Meeting Elegant Private Room. Separate entrance and parking located in back of building. Seats 32 guests. We also have a projector/screen and AV  equipment. We host a variety of events including medical seminars, wedding dinners, company parties, w Banquet/Event Hall Life Celebration Center of Punta Gorda Serving the Port Charlotte, FL Area 150 Capacity $525 to $1,200 / Meeting From corporate events to baby showers, bridal showers, and more, our team is dedicated to bringing your vision to life while providing the support and guidance you need throughout the planning process. Life Celebration Center of Punta Gorda Banquet/Event Hall River Edge Club Serving the Port Charlotte, FL Area 200 Capacity $1,100 to $1,300 / Meeting At the River Edge Club, we strive to offer a versatile and vibrant space perfect for any occasion. Formerly known as the Arcadia Women's Club, this building has been a staple in the community for gatherings and many last memories for reside Banquet/Event Hall Fast Response The Event Center Serving the Port Charlotte, FL Area 420 Capacity $2,500 / Meeting The Event Center is an elegant multi- functional event space located in Port Charlotte, FL. It has a guest capacity that ranges from 1-384 (320 with 20’ x 40’dance floor) with 60” round tables of eight. Additional features include a full co Banquet/Event Hall Boca Royale Golf & Country Club 14 miles\r\n                                            from Port Charlotte, FL 120 Capacity $1,900 to $4,750 for 50 People Your special day, exactly as you've dreamed.\nBeautiful, amazing and unforgettable...\n\nWeddings at Boca Royale are as unique and distinctive as the bride & groom.\n\nEnglewood, Florida is the perfect location for your wedding with warm tempera Country Club Ready to find the perfect venue? Match Me With Venues Fast Response Hotel Venezia 10 Serving the Port Charlotte, FL Area 500 Capacity $15 to $3,000 for 50 People Hotel Venezia, a Ramada Boutique Hotel by Wyndham, is a resort style property and an ideal location, minutes from the beach and downtown main street. When hosting a meeting, wedding, or any type of event in Sarasota county we offer professi Ballroom (+2) Plantation Golf and Country Club 1 Serving the Port Charlotte, FL Area 1,000 Capacity $750 to $5,000 for 50 People Host Your Next Unforgettable Event at Plantation Golf & Country Club\nAt Plantation Golf & Country Club, we don’t just host events—we help you create extraordinary memories. Whether you're planning a wedding, corporate event, birthday, quinc Country Club The Event Groupie Venue 4.9 miles\r\n                                            from Port Charlotte, FL 80 Capacity Let’s elevate your vision and celebrate in the moment. This luxury and modern event venue will surpass all your party needs! Banquet/Event Hall Heron Creek Golf and Country Club 7.0 miles\r\n                                            from Port Charlotte, FL 200 Capacity Heron Creek Golf & Country Club offers the finest facility in the area. The Dining Room is available for wedding receptions, galas and gatherings at a limited capacity. The Private Dining Room can accommodate rehearsal dinners, small dinner Country Club The Wyvern Hotel 1 6.6 miles\r\n                                            from Port Charlotte, FL 50 Capacity Whether you are planning a business meeting, family reunion or wedding reception, the 431-square-foot River Room on the lobby level of The Wyvern Hotel is perfect for intimate gatherings of all types. From full catering and event design ser Hotel/Resort/Lodge Ready to find the perfect venue? Match Me With Venues Charlotte Harbor Event and Conference Center 1 6.5 miles\r\n                                            from Port Charlotte, FL 1,517 Capacity Located in the beautiful Punta Gorda, the Charlotte Harbor Event and Conference Center offers 44,000  square foot of flexible multi purpose spaces, top food service management and the best waterfront vistas in the area. Conference/Meeting Silver Bullet Venue 19 miles\r\n                                            from Port Charlotte, FL 300 Capacity At Silver Bullet, we provide a rustic, chic atmosphere with breathtaking views - perfect for Weddings, Birthdays, or any Private Events. We also offer Horse Boarding and overnight RV Camping for all your destination needs. Banquet/Event Hall Oaks of Devonaire 2 21 miles\r\n                                            from Port Charlotte, FL 150 Capacity Rustic elegance is found at our authentic converted horse barn. Imagine starting your Happily Ever After journey walking over a wooden bridge, under 200 year-old oak trees draped in Spanish moss, with  butterflies and hummingbirds flitting Barn/Farm/Ranch Escape Resort and Marina 22 miles\r\n                                            from Port Charlotte, FL 65 Capacity Brand new luxury accommodations and event space in Nokomis, Florida.  Escape Coastal Resort & Marina offers guests access to the private beaches of Nokomis Casey Key, The local North Jetty Park is 1 mile south of Escape. Escape’s prime loca Hotel/Resort/Lodge Town Square Sarasota 1 Serving the Port Charlotte, FL Area 125 Capacity $750 to $2,500 / Meeting Town Square Sarasota is an 11,000 sq.ft event space that was built to resemble a 1950's main street. The interior includes 10 storefronts surrounding a park - storefronts include a theater, diner, game room, and more. The kitchen does not h Community Center Ready to find the perfect venue? Match Me With Venues Casey Key Resorts Serving the Port Charlotte, FL Area 300 Capacity $1,500 to $3,000 / Meeting For the perfect wedding venue, Casey Key Resorts offers style and luxury for the special day. Planning the wedding will be a combination of stress, work, and full-on excitement. But not to worry, let our Event Specialists take the strain! F Hotel/Resort/Lodge Fast Response Splendor Event Banquet Hall 1 26 miles\r\n                                            from Port Charlotte, FL 160 Capacity $2,700 / Meeting Located in Cape Coral, Splendor Event has two luxury banquet halls available for your next event. Perfect for weddings, quinceaneras, and other private events.\n\nOur largest hall, accommodating up to 160 guests, features a modern bar and bea Banquet/Event Hall Lake Kennedy Center 2 Serving the Port Charlotte, FL Area 160 Capacity $200 to $900 / Meeting The Lake Kennedy Center has three (3) rooms that can be rented for  special occasions (i.e. weddings, birthdays, baby showers, anniversaries, seminars, fundraisers, etc and/or meetings). The Ballroom features a welcoming reception area, soa Ballroom (+2) Saddlewood Hall Serving the Port Charlotte, FL Area 75 Capacity $1,250 to $1,750 / Meeting Host your next celebration with rustic flair right in the heart of Cape Coral! Saddlewood Hall can fit up to 75 guests comfortably, perfect for wedding receptions, birthday parties, and more!\nCreate Unforgettable Memories at Our Rustic Part Banquet/Event Hall Crowley Museum and Nature Center 23 miles\r\n                                            from Port Charlotte, FL 60 Capacity Crowley Museum and Nature Center is a unique and beautiful location for rustic country wedding ceremonies. The porch of the Historic Tatum House is a favorite spot for exchanging vows. Crowley’s 190 acres of wild and scenic landscape offers Park/Garden (+4) Ready to find the perfect venue? Match Me With Venues Fast Response Celebrations Venue Sarasota Serving the Port Charlotte, FL Area 141 Capacity $1,000 / Meeting Celebrations Venue LLC is a distinguished event space renowned for its blend of elegance and versatility, catering to a wide array of gatherings including weddings, corporate functions, salsa, ballroom and swing dance lessons, parties, and Ballroom (+4) Fleamasters Music Hall 1 30 miles\r\n                                            from Port Charlotte, FL 450 Capacity The Music Hall is available for rent for your next meeting, conference, concert, or special event. We have the flexibility to fit almost any budget, with packages that include sound, audio visual and catering or just the basic space. Please Theater/Auditorium Hampton Inn Sarasota - I-75 Bee Ridge 29 miles\r\n                                            from Port Charlotte, FL 80 Capacity $200 to $500 for 50 People Whether you are planning an important business meeting or a special Sarasota, FL event, Hampton Inn Sarasota I-75 Bee Ridge offers everything you need for a successful event. Make use of two flexible meeting rooms, totaling 1,200 sq. ft., a Hotel/Resort/Lodge Sacred Love Temple 30 miles\r\n                                            from Port Charlotte, FL 50 Capacity $200 to $300 / Meeting A Magical Sanctuary for Transformative Events\n\nOur Magical Sanctuary for Transformative Events is an enchanting space available for rent, perfect for hosting your next event. Our venue can comfortably accommodate up to 50 people in a classr Conference/Meeting (+4) Calusa Nature Center and Planetarium 2 Serving the Port Charlotte, FL Area 277 Capacity $360 to $1,000 / Meeting Our 105-acre site is home to many rescue animals, butterfly and bird aviaries, two nature trails, SWFL's only planetarium theater, and much more!\n\nHold your event in one of Florida's most unique venues. Indoor and outdoor spaces available. Park/Garden (+4) Ready to find the perfect venue? Match Me With Venues Hilton Garden Inn Fort Myers 1 Serving the Port Charlotte, FL Area 100 Capacity $650 to $1,500 for 50 People Host your corporate meeting or special occasion (rehearsal dinner; anniversary dinner; birthday party) anywhere from 10 to 100 people at our venue in Fort Myers, Florida.  Our flexible space accommodates a variety of seating arrangements fo Ballroom (+3) Cypress M Ranch 26 miles\r\n                                            from Port Charlotte, FL Let Cypress M Ranch Western Weddings and Special Events be the backdrop to accentuate your perfect day and bring a feel of western elegance. Barn/Farm/Ranch The Founders Golf Club 29 miles\r\n                                            from Port Charlotte, FL 250 Capacity $500 to $2,500 / Meeting The Founders Golf Club provides a perfect setting for any wedding ceremony and reception! Country Club The Coral Club at Laguna Caribe 31 miles\r\n                                            from Port Charlotte, FL 250 Capacity $1,200 to $4,500 / Meeting If you're dreaming of a tropical setting for your next event, The Coral Club delivers it all! This stunning outdoor, poolside venue is located in the heart of Laguna Caribe, and features a full-service restaurant, tiki bar, sparkling pool, Country Club The Landings Yacht Golf & Tennis Club 1 33 miles\r\n                                            from Port Charlotte, FL 154 Capacity $100,000 for 50 People From elaborate weddings to personal celebrations or business meetings, The Landings Yacht, Golf & Tennis Club is the perfect venue to accommodate your special gathering!\n\nOur enchanting location, overlooking the Caloosahatchee River and jus Country Club Ready to find the perfect venue? Match Me With Venues Oasis Collective 1 32 miles\r\n                                            from Port Charlotte, FL 40 Capacity $500 to $700 / Meeting Welcome to our warm and inviting venue, perfect for creating lasting memories and connections. Imagine your baby shower, bridal shower, birthday party, grad party, or any small event in our space. (Max. 30-40 people) Banquet/Event Hall Residence Inn Fort Myers Sanibel 2 Serving the Port Charlotte, FL Area 75 Capacity $500 to $1,600 for 50 People Enjoy luxury and value at Residence Inn Fort Myers Sanibel. Our Fort Myers hotel features one and two-bedroom suites. \n\nOur beautiful hotel is located just minutes from the Gateway into Sanibel & Captivia Islands, minutes to Fort Myers Beac Hotel/Resort/Lodge 'Tween Waters Island Resort & Spa 33 miles\r\n                                            from Port Charlotte, FL 135 Capacity $500 to $30,000 / Meeting 'Tween Waters Island Resort & Spa is a unique wedding venue on Captiva Island, Florida. This classic and coastal location has been helping couples make special wedding memories for almost 90 years. This charming, romantic venue has a breath Hotel/Resort/Lodge (+1) Fairfield by Marriott Fort Myers 1 Serving the Port Charlotte, FL Area 35 Capacity $300 to $500 / Meeting Located in the heart of Fort Myers, the Fairfield Inn & Suites Fort Myers/Cape Coral hotel is the perfect base to explore the city as it is minutes from Lee Health Hospitals and Campus, Lee County Sports Complex, and the pristine Fort Myers Conference/Meeting (+1) Stillwater Grille 1 33 miles\r\n                                            from Port Charlotte, FL 75 Capacity $750 to $5,000 for 50 People Sit back and let the outside world melt away as you enter into a world of relaxation and luxury. This is private dining at its finest, we offer a highly trained professional staff to cater to your every need. The perfect meeting spot for sp Banquet/Event Hall (+1) Ready to find the perfect venue? Match Me With Venues EVEN Hotel Sarasota Lakewood Ranch 33 miles\r\n                                            from Port Charlotte, FL 95 Capacity $550 to $2,500 for 50 People EVEN Hotel Sarasota - Lakewood Ranch hotel is Sarasota's award-winning jewel located near miles of white, sandy beaches, great golf, polo matches and amazing shows. Located just off I-75, our Sarasota, FL, hotel puts everything within your Conference/Meeting (+4) The Westin Cape Coral Resort at Marina Village 32 miles\r\n                                            from Port Charlotte, FL 800 Capacity Connect and collaborate at The Westin Cape Coral Resort at Marina Village, and let our Gulf Coast Florida hotel set the stage for an energizing business function or social event. With more than 50,000 square feet of modern meeting rooms, ba Ballroom (+4) Premier Executive Center - Ft. Myers 32 miles\r\n                                            from Port Charlotte, FL 18 Capacity Conference Rooms and Presentation Facilities We provide several professionally appointed conference rooms at both locations. Our executive board rooms feature large custom tables with seating for twelve and room for an additional twelve con Conference/Meeting AMF Gulf Gate 29 miles\r\n                                            from Port Charlotte, FL Where good times become great. And great parties become legendary. Bowl, drink, eat, hit the arcade,\nset your phone to selfie-mode, and get ready for one epic celebration.\n\nZero Hassle. All Fun. And a total crowd-pleaser! Our office parties Bowling/Fun Zone Fleming’s Prime Steakhouse & Wine Bar - Sarasota 32 miles\r\n                                            from Port Charlotte, FL 70 Capacity $1,900 to $6,450 for 50 People Close to downtown, the resorts on Siesta and Longboat Keys and Sarasota Memorial Hospital, Fleming's of Sarasota is an exceptional location for private dining. Our rooms are available for lunch and dinner, and can accommodate events ranging Restaurant/Bar/Pub Ready to find the perfect venue? Match Me With Venues Hideaway Country Club Serving the Port Charlotte, FL Area 150 Capacity $400 to $7,500 for 50 People Located in Fort Myers, Florida, The Hideaway Country Club is a newly renovated banquet venue available to host weddings and other special occasions. Offering a gorgeous event space with large windows and a patio overlooking the golf course, Country Club Lani Kai Resort 1 Serving the Port Charlotte, FL Area 100 Capacity $2,000 to $20,000 / Meeting The Lani Kai Island resort is a full-service resort with 400 feet of sandy white beach for your guests to enjoy. It’s ideal for beach events or venues with breath taking ocean views.\n\n Looking for the perfect venue to host your event? Our r Hotel/Resort/Lodge Fast Response The Club at Renaissance 2 Serving the Port Charlotte, FL Area 130 Capacity Whether you envision your wedding as a lavish affair, or a simple gathering, allow the staff at Renaissance Country Club to take care of every detail! With breathtaking views of our golf course, a wrap around porch that gives that Southern Country Club Bavaros 34 miles\r\n                                            from Port Charlotte, FL 150 Capacity $500 to $2,000 / Meeting Bavaro’s Sarasota offers a versatile and inviting space for morning meetings and private events, available exclusively between 7 AM and 12 PM. With a spacious outdoor patio, an intimate upstairs loft, and a warm, modern ambiance, it’s the p Banquet/Event Hall Embassy Suites by Hilton Sarasota 35 miles\r\n                                            from Port Charlotte, FL 200 Capacity $2,000 to $6,000 for 50 People The Ringling Ballroom is a sanctuary of sophistication, offering a spacious and versatile environment perfect for various events. Whether you're hosting a wedding reception, a corporate gala, or a milestone celebration, the backdrop of Sara Conference/Meeting (+2) Ready to find the perfect venue? Match Me With Venues VOCO Sarasota 35 miles\r\n                                            from Port Charlotte, FL 70 Capacity $1,900 to $2,450 for 50 People Situated adjacent to the beautiful Sarasota Bay, the Hotel Indigo® Sarasota is an award-winning property in Downtown Sarasota. With a romantic atmosphere and tropical decor, we are the hotel of choice for intimate events. Coupled with unpar Hotel/Resort/Lodge Turmeric Indian Bar and Grill Serving the Port Charlotte, FL Area 100 Capacity $2,000 to $3,500 for 50 People Turmeric is one of the finest dining restaurants in Sarasota. We bring to life some of the most iconic dishes from the rich culture of India, with our unique twist.\n\nWith three whole floors of restaurant space, Turmeric offers guests a vari Banquet/Event Hall (+1) The Club at Pelican Preserve Serving the Port Charlotte, FL Area 250 Capacity $1,750 to $5,000 for 50 People Pelican Preserve is the perfect backdrop for your special day! From the pristine outdoor preserve to the spacious and elegant reception halls, Pelican Preserve can make your dreams come true! Country Club Aloft Sarasota Serving the Port Charlotte, FL Area 120 Capacity $500 to $1,500 / Meeting Transform any stay into a vibrant getaway at Aloft Sarasota, where open spaces, open thinking and open expression flourish. Your stay begins the moment your plane lands. Additionally, our boutique hotel offers unparalleled access to several Hotel/Resort/Lodge Brio - University Town Center 34 miles\r\n                                            from Port Charlotte, FL 136 Capacity $1,400 for 50 People Planning an unforgettable event and group dining experience is easy at Brio! We offer delectable lunch, dinner, and brunch menus specially designed for group dining, warm and inviting spaces for semi-private and private events, and attentiv Banquet/Event Hall Ready to find the perfect venue? Match Me With Venues Stoneybrook Country Club 2 26 miles\r\n                                            from Port Charlotte, FL 200 Capacity Stoneybrook Golf and Country Club is the perfect place for a wedding reception as well as every-day dining! The dining room is elegant, spacious and provides a beautiful setting for any event and can be reserved to accommodate parties of (5 Country Club P.F. Chang's Sarasota 34 miles\r\n                                            from Port Charlotte, FL 200 Capacity $1,250 for 50 People P.F. Chang’s is the first internationally recognized multi-unit Asian culinary brand to honor and celebrate wok cooking as the center of the guest experience. With roots in Chinese cuisine, today’s menu spans across all of Asia, honoring cu Restaurant/Bar/Pub DoubleTree by Hilton Sarasota Bradenton Airport 1 38 miles\r\n                                            from Port Charlotte, FL 250 Capacity $950 to $2,950 for 50 People Discover the spectacular DoubleTree by Hilton Sarasota Bradenton Airport, with the stunning six-story skylight atrium–one of the only ones of its kind in the region, glass elevators, and lobby waterfall.\n\nConveniently situated in the heart Hotel/Resort/Lodge Fleming’s Prime Steakhouse & Wine Bar - Sarasota/UTC 34 miles\r\n                                            from Port Charlotte, FL 54 Capacity $1,900 to $6,450 for 50 People Close to UTC, Fleming's of Sarasota is an exceptional location for private dining. Our rooms are available for lunch and dinner, and can accommodate events ranging from intimate wine dinners to large business presentations. Restaurant/Bar/Pub Longboat Key Club And Resort 36 miles\r\n                                            from Port Charlotte, FL 250 Capacity Events to remember begin at the Resort at Longboat Key Club. With 12,000 square feet of sophisticated event space, we’re ready to host your next conference, meeting, special event, or wedding of a lifetime. Our expansive indoor and outdoor Hotel/Resort/Lodge Ready to find the perfect venue? Match Me With Venues Fast Response La Gran Mansión Serving the Port Charlotte, FL Area 240 Capacity $1,000 to $9,999 / Meeting Located in the heart of Sarasota FL, we are a unique and glamorous event venue for: Weddings, Quinceañeras, Sweet 16, Bridal Showers, Baby Showers and any type of celebration! \n\nWe just don’t host events, we create unforgettable memories! W Banquet/Event Hall The Lounge at element 35 miles\r\n                                            from Port Charlotte, FL 50 Capacity $2,000 to $5,000 / Meeting *****PLEASE EMAIL TO GET MORE INFORMATION - laurend@elementsrq.com\n\nSarasota has a glamorous new destination space. It’s The Lounge at Element, located at 1409 Main Street, right next to and a part of element.\n\nA modern take on a classic ur Nightclub/Lounge (+1) Gateway Golf & Country Club 1 37 miles\r\n                                            from Port Charlotte, FL 150 Capacity Congratulations and thank you for considering The Club at Gateway as host for your upcoming event! We are a full-service event venue committed to providing top-notch, personalized service and attention to detail. Our catering menus feature Country Club Golden Host Resort & Bahi Hut Cocktail Lounge Serving the Port Charlotte, FL Area 500 Capacity $500 to $2,500 / Meeting Newly Renovated in 2020!\n\nWith a midcentury modern themed campus, we have a large outdoor space. Our lawn features 40,000 sq ft of green space and a 50 ft pool with a large sundeck. For interior space, we offer our Bahi Hut Cocktail Lounge Hotel/Resort/Lodge Pink Shell Beach Resort & Marina 38 miles\r\n                                            from Port Charlotte, FL 150 Capacity $12,000 to $14,500 for 50 People Say 'I Do' at our Beach Wedding Resort\nLet your destination wedding dreams come true and discover a romantic oceanfront resort to host your special day. From stunning outdoor venues on our secluded beach to daily activities for wedding gues Hotel/Resort/Lodge Ready to find the perfect venue? Match Me With Venues Show More 1 2 3 » There are 180 Meeting Venues in and around Port Charlotte at Eventective.com.  Use the filter options to find your Perfect Port Charlotte Meeting Venue. Ready to find the perfect venue? Match Me With Venues Follow Eventective Quick Links About Us Support Terms of Use Terms for Event Businesses Privacy Quick Links About Us Support Terms of Use Terms for Event Businesses Privacy Plan An Event How it works Party Planning 101 Plan an event now Create an Event Website Market My Business How it works Why Eventective Eventective blog Pricing List Your Business © 2025 Eventective, Inc.  |  All Rights Reserved"
    },
    {
      "url": "https://www.charlotteharborecc.com/events/2020/public-safety-appreciation-night-2023",
      "text": "Public Safety Appreciation Night 2023 skip to main content Area Weather Hours & Directions My Account View My Account Search Website Search Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Events Event Calendar Events Concert Directions Parking Prohibited Items Plan Your Event Event Planning Guide Meeting Planners Weddings Celebrations Promoters Catering/Menus Request for Proposal Virtual 360 Tour About Us Charlotte Harbor Event & Conference Center Community Contact Us Employment Opportunities Legends Global Charlotte County Facility Rules Tickets & Deals Skip Navigation Links Events > Events > Public Safety Appreciation Night 2023 Public Safety Appreciation Night 2023 Date: May 26, 2023 Time: 6:00 PM Location(s): Charlotte Harbor Event & Conference Center - 941-833-5444 Category(s): Events Be A Fan Back for another epic night of honoring our Public Safety Personnel! Advance tickets are required. The Charlotte County Sheriff's Explorer Post 29 and Do The Right Thing of Charlotte County, Inc. invite you to our 2023 Public Safety Appreciation Night in recognition of our Charlotte County Public Safety Personnel. This event will be held on Friday, May 26th, 2023 at the Charlotte Harbor Event and Conference Center, beginning at 6:00pm. It will include a cocktail hour (credit card only), dinner, and a program honoring our public safety personnel. Your support and generosity will provide for a successful event recognizing Charlotte County Public Safety personnel and support Charlotte County youth with all proceeds benefitting Do the Right Thing of Charlotte County Inc., and Charlotte County Sheriff’s Office Explorer Post 29; two programs that have a positive impact on our youth and their future. For questions or more information about sponsorships, please contact Skip Conroy, Sponsorship Chair, at (941) 575-5252. For information about the event please visit our facebook page: @PSANcharlottecounty. 1 of 2 Upload of Transcript Home | Events | Plan Your Event | About Us | Contact | Site Map | Privacy Policy | Cookie Preferences | Do Not Sell or Share My Info 941.833.5444 75 Taylor Street, Punta Gorda, FL 33950 clare.riggs@charlottecountyfl.gov EMAIL SIGNUP Sign up for email updates from Charlotte Harbor Event & Conference Center Email Get Updates Copyright ©2025, Charlotte Harbor Event & Conference Center. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Tickets & Deals Do Not Sell or Share My Info Hours & Directions Contact Site Map Privacy Policy Purchase Policy"
    }
  ]
}