{
  "fuentes": [
    {
      "url": "https://www.cheers.org/contact/",
      "email": "help@cheers.org"
    },
    {
      "url": "https://www.altamonte.org/387/Cheerleading",
      "email": "cityclerk@altamonte.org"
    },
    {
      "url": "https://www.altamonte.org/387/Cheerleading",
      "email": "jbright@altamonte.org"
    },
    {
      "url": "https://cherre.com/contact-us/",
      "email": "soc2-badge-black@2x.png"
    },
    {
      "url": "https://cherre.com/contact-us/",
      "email": "contact@cherre.com"
    },
    {
      "url": "https://www.orlandograce.org/about-us",
      "email": "office@orlandograce.org"
    },
    {
      "url": "https://www.graciejiujitsualtamonte.com/page/about-us",
      "email": "info@graciejiujitsualtamonte.com"
    }
  ],
  "mails": [
    "cityclerk@altamonte.org",
    "contact@cherre.com",
    "help@cheers.org",
    "info@graciejiujitsualtamonte.com",
    "jbright@altamonte.org",
    "office@orlandograce.org",
    "soc2-badge-black@2x.png"
  ],
  "nombre_sitio": "cheers-altamonte.site",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cheers.org/contact/",
      "text": "Contact Us | CHEERS Contact Us | CHEERS Skip to content About CHEERS Getting Started Homeowners Energy Consultants & Architects Builders & Contractors HERS Raters Building Departments Products California Energy Code Registry EPA ENERGY STAR EPA WaterSense DOE Zero Energy Ready Homes MRO – ENERGY STAR & ZERH Pricing Training & Resources HERS Rater Training EPA 608 Certification Videos, Articles & Branding Find a Pro Job Board Submit a Complaint Register Sign In CHEERS Registry HERS Training Contact Juanita Garcia 2025-05-14T12:32:03-07:00 Get in touch! Quick Contact We’re here to answer your HERS questions. Fill out this form to contact CHEERS and we’ll be in touch soon! Name Email Message Thanks for contacting CHEERS! We'll be in touch shortly. × There was an error trying to send your message. × Submit Contact Info 1.800.424.3377 help@cheers.org Have a Rater complaint? Our Location 1610 R St, Ste 200 Sacramento, CA 95811 Catch Us On Social Media CONTACT (800) 424 – 3377 help@cheers.org 1610 R Street, Ste 200 Sacramento, CA 95811 © 2025 CHEERS. All rights reserved. Terms of Use Privacy Policy The California Energy Commission certifies HERS providers. This certification does not imply endorsement, recommendation, or affiliation. Page load link Go to Top"
    },
    {
      "url": "https://www.altamonte.org/387/Cheerleading",
      "text": "Cheerleading | Altamonte Springs, FL - Official Website Skip to Main Content Search Adults Aquatics Recreation Centers Seniors Special Needs Youth Home Departments Recreation Youth Sports Cheerleading Cheerleading The Altamonte Springs Recreation Cheerleading Program offers a fantastic opportunity for participants ages 5 to 14 to cheer alongside the Altamonte Flag Football League during the fall season. Our program focuses on safely introducing cheerleading fundamentals while instilling important values like sportsmanship and teamwork. Program Details: Season Length : 8 weeks Games Begin : Saturday, September 6 Location : Westmonte Recreation Center Multipurpose Field Cost : $120 (includes uniform and pom-poms) Registration: Begins May 27 First-year 5 to 8-year-old participants who reside in Altamonte Springs can join at no cost! This offer is available for first-time participants only and can be applied to one program. Uniform Fittings August 11 & 12 | 3:30 - 7 p.m.| Westmonte Recreation Center Activity Room Contact Us Activity Manager Email Location: Westmonte Recreation Center 624 Bills Lane Altamonte Springs, FL 32714 Ph: (407) 571-8761 Fx: (407) 571-8451 Activity Cancellations: (407) 571-8783 Flag Football Cheer Sponsorships Facility Rental Forms & Docs Get Involved Park Locator Register Stay Connected Helpful Links Contact Us Calendar FAQs Site Map Employee Access /QuickLinks.aspx Quick Links City Magazine Jobs Permits Flood Information Public Notices Non-Discrimination Policy /QuickLinks.aspx Stay Connected Facebook Twitter Instagram Email Signup Under Florida Law, email addresses are public records. If you do not want your email address released in response to a public-records request, do not send electronic mail to this entity. Instead, contact the City by phone or in writing: City of Altamonte Springs | 225 Newburyport Avenue, Altamonte Springs, FL 32701 | Phone: (407) 571-8000 Persons with disabilities needing documents in an alternate format should contact (407) 571-8122 (Voice), (407) 571-8126 (TTY) or CityClerk@altamonte.org (Email). Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://cherre.com/contact-us/",
      "text": "Contact Us Products Solutions Marketplace Resources Meet Cherre Login Menu Menu Login Products Overview Platform Workflows Agent.STUDIO Solutions Overview Asset Management Investment Management Marketplace Connections Resources Blog Security Policies Help Center Meet Cherre About Cherre Press Careers Overview Platform Workflows Agent.STUDIO Overview Asset Management Investment Management Connections Blog Security Policies Help Center About Cherre Press Careers Contact Us Let us know how we can help. Sales We’d love to learn how we can help you drive immediate value. Contact Sales Support We’re here to help you with any support needs. Contact Support Media Get in touch with our PR team and download our media kit. Download Media Kit Still not sure who to reach out to? Fill out our general contact form and the right team will get in touch. Anonymous Feedback If you need to report any unethical behavior experienced in the work place and/or during a third party engagement, please use this form to send in an anonymous confidential notice. Products Overview Platform Workflows Agent.STUDIO Solutions Overview Asset Management Investment Management Marketplace Connections Resources Blog Security Policies Help Center Contact Us Service Status Support Meet Cherre About Cherre Press Careers Cherre, Inc. 575 8th Avenue, New York, NY 10018 © 2025 Cherre Inc. All rights reserved. Cherre Email Communications Subscribe Certificates and Partnerships"
    },
    {
      "url": "https://www.orlandograce.org/about-us",
      "text": "Orlando Grace Church: Altamonte Springs, FL > About Us IMPORTANT: On October 19th, our first service time will change to 9:00 AM Home About Who We Are Statement of Faith Staff Elders Annual Report Annual Goals 2025 Annual Goals Breakdown Church Planting Pastoral Residency Ministry Internship Sermons Ministries Community Groups Children's Ministry Student Ministries Women's Ministry Equipping Hour Global Missions Mercy Ministry Need Practical Help OGC Community Resource Binder Florida Health Partners Community Resource Guide Help Request Form Give Connect Weekly E-News Discover OGC Connect Card Events Events Calendar Host an Event at OGC Register for Upcoming Events New Here Home About Who We Are Statement of Faith Staff Elders Annual Report Annual Goals 2025 Annual Goals Breakdown Church Planting Pastoral Residency Ministry Internship Sermons Ministries Community Groups Children's Ministry Student Ministries Women's Ministry Equipping Hour Global Missions Mercy Ministry Need Practical Help OGC Community Resource Binder Florida Health Partners Community Resource Guide Help Request Form Give Connect Weekly E-News Discover OGC Connect Card Events Events Calendar Host an Event at OGC Register for Upcoming Events New Here Home About Who We Are Statement of Faith Staff Elders Annual Report Annual Goals 2025 Annual Goals Breakdown Church Planting Pastoral Residency Ministry Internship Sermons Ministries Community Groups Children's Ministry Student Ministries Women's Ministry Equipping Hour Global Missions Mercy Ministry Need Practical Help OGC Community Resource Binder Florida Health Partners Community Resource Guide Help Request Form Give Connect Weekly E-News Discover OGC Connect Card Events Events Calendar Host an Event at OGC Register for Upcoming Events Home About Who We Are Statement of Faith Staff Elders Annual Report Annual Goals 2025 Annual Goals Breakdown Church Planting Pastoral Residency Ministry Internship Sermons Ministries Community Groups Children's Ministry Student Ministries Women's Ministry Equipping Hour Global Missions Mercy Ministry Need Practical Help OGC Community Resource Binder Florida Health Partners Community Resource Guide Help Request Form Give Connect Weekly E-News Discover OGC Connect Card Events Events Calendar Host an Event at OGC Register for Upcoming Events New Here About Us About Who We Are Statement of Faith Staff Elders Annual Report Annual Goals 2025 Annual Goals Breakdown Church Planting Pastoral Residency Ministry Internship WHO WE ARE We're Orlando Grace Church. We hope that you feel at home from the first time you walk in the door. We exist to grow in Christ, bless our city, and send to the world. Whether you're just beginning or have known God for years, we're glad you're here and excited for what God is doing in your life. Our Core Values Blessing Our City - Seeking the welfare of our city by engaging Orlando with the Gospel in word and deed. (Matt. 28:16-20; Jer. 29:1-7) Equipping Our People - Equipping the saints for the work of the ministry. (Eph. 4:12-16) Contextualizing Our Mission - Appropriately and Biblically contextualize the ministries of OGC for maximum gospel impact. (Acts 17) Stewarding Our Resources - Steward our time, talent, treasure, facilities, and other resources for maximum kingdom impact. (Luke 14:28-30) Sending Our Best - Resolving to send out church planters, missionaries, interns, and pastors. (Acts 11:19-30) STATEMENT OF FAITH We subscribe to the Second London Baptist Confession of Faith . CHURCH BYLAWS Our church bylaws can be found here . Staff Jim Davis Teaching Pastor Jim Davis serves as the Teaching Pastor at Orlando Grace Church. Jim was born in Orlando, FL and went to Florida State University. He is married to his wife, Angela, and they have four children. Jim is the host of the As In Heaven podcast on the TGC Podcast Network and co-author of The Great Dechurching. Jim also serves on the council of The Gospel Coalition. Jim and Angela speak for Family Life's Weekend to Remember marriage conferences and at Pine Cove Family Camp. Jim received his Mdiv at Reformed Theological Seminary in Orlando. For speaking inquiries, please fill out this form . Robert Jackson Executive Pastor Robert serves as Executive Pastor at OGC. In the past, he has worked as a project manager and systems director for both commercial and Christian non-profit organizations and has served multiple churches in various vocational and volunteer ministry roles. He, his wife, Julianne, and their two children live in Altamonte Springs. Robert loves books and hates even short walks on the beach. Click here to schedule a meeting with Robert . Matt Kenyon Worship & Technology Director Matt serves as the Worship & Technology Director at OGC. He lives in Winter Springs with his wife Courtney and two boys Lincoln and Silas. When he's not leading worship he can be found geeking out over music theory or enjoying a quality cup of coffee. Preferably both at the same time. Ragan Bartholomew Ministry Operations Director Ragan serves as the Ministry Operations Director at OGC. She graduated from the University of Mississippi and spent time working in both the consulting and non-profit sectors before joining the staff at OGC. She and her husband, Clark, live in Oviedo. She is currently pursuing her MA in Biblical Studies from Reformed Theological Seminary. Click here to schedule a meeting with Ragan . Amanda Walton Family Ministry & Discipleship Program Director Amanda serves as the Family Ministry & Discipleship Program Director at OGC. She is a graduate of Rollins College. She and her husband Rodney are the proud parents of Grant, Rosie, Clara, and Blake. Click here to schedule a meeting with Amanda . Ben Alderman Student Ministry Director Born and raised in Central Florida, Ben now serves as the Student Ministry Director at OGC. He holds a degree in Biblical Studies from Southeastern Baptist Theological Seminary and is currently a M.Div student at Reformed Theological Seminary. Ben and his wife, Allison, live in Oviedo. Click here to schedule a meeting with Ben . Jen Bruner Children's Ministry Coordinator Jen serves as the Children's Ministry Coordinator at OGC. She and her husband Steven, along with their two children Dylan and Olivia, reside in the Winter Springs area. Jen is a former homeschooling mother and enjoys bike rides with her kids and husband when it's not 100 degrees! Click here to schedule a meeting with Jen . Clark Bartholomew Pastoral Resident Clark graduated from the University of Mississippi in 2020, where he met his wife, Ragan. They were married in July of 2021. They moved from Jacksonville, where they worked in anti-money laundering. Clark is seeking his M.Div from RTS Orlando. Click here to schedule a meeting with Clark. Brendan Kirkland Pastoral Ministry Intern Brendan graduated from Tennessee Wesleyan University in 2016. He worked in logistics and hospitality management until moving to Florida where he met his wife, Jessica. They served together in college campus ministry at Florida Gulf Coast University until September of 2022. Brendan is seeking his M.Div from RTS Orlando and is currently a Chaplain Candidate Officer in the Navy Reserves. Elders Jim Davis Elder Jim Davis is Teaching Pastor at Orlando Grace Church. Jim was born in Orlando, FL and went to Florida State University. He is married to his wife Angela and they have four children (Turner, Collins, Ivey and James). Jim and Angela speak for Family Life’s Weekend To Remember marriage conferences. Jim received his Mdiv at Reformed Theological Seminary in Orlando. Robert Jackson Elder Robert serves as Executive Pastor at OGC. In the past, he has worked as a project manager and systems director for both commercial and Christian non-profit organizations and has served multiple churches in various vocational and volunteer ministry roles. He, his wife, Julianne, and their two children live in Altamonte Springs Kurt Bowerman Elder Kurt Bowerman serves as an elder at Orlando Grace Church. Kurt has served in the past as Associate National Director at Cru Global (Campus Crusade for Christ) and now is co-owner of two construction businesses. Kurt is married to Wendy and they have four children. Ryan Cunningham Elder Ryan serves as an elder at Orlando Grace Church. Ryan and his wife Sherry have four daughters. He is a graduate of University of Central Florida and is the Principal Engineer at Kittelson and Associates and works primarily in transportation engineering. Ryan and Sherry co-lead the Wekiva Community group. Dan Humbert Elder Dan Humbert serves as an elder at Orlando Grace Church. Dan became a Christian while attending Michigan State University where he met his wife Carrie. They were married in the MSU campus chapel in 1987. They have four kids. Dan has lead small group bible studies since his early Christian days, was part of a church plant in Chicago, and leads the Oviedo Community Group at OGC. Dan’s prior job relocated him to the Orlando area in 1999. He currently works as a Senior Project Manager for SCS Cloud. Fred Langer Elder Fred Langer serves as an elder at Orlando Grace Church. Fred was born in Orlando and attended the University of Central Florida. He married Barbara, his high school sweetheart. They have two grown daughters, Kristin and Kara, and one granddaughter, Maggie. Fred has worked at AdventHealth since 1980 as a cardiac critical care nurse and educator, and as a nursing analyst in IT since 2012. Fred and Barbara co-lead the South Apopka Community Group. Fred enjoys serving on the worship team many Sundays. Dan Van Nada Elder Dan Van Nada serves as an elder at Orlando Grace Church. Dan was raised in the Midwest and attended the University of Florida. Dan and his wife, Liz, have two kids and one on the way and reside in Maitland. Dan has worked in commercial real estate at First Capital Property Group since 2012. Dan and Liz co-lead the Maitland Community Group, and have been attending Orlando Grace Church since 2011. Rodney Walton Elder Rodney serves as an elder at Orlando Grace Church. Rodney and his wife Amanda have four children. He is a graduate of University of Central Florida and is a Financial Services Account Executive with the Florida League of Cities. Rodney and Amanda lead the Longwood Community group. They have worshiped at Orlando Grace Church since 2005. Tweet New Here? What to Expect About Us Staff Elders Mission & Values Affiliation Church Planting Pastoral Internship Pastoral Residency Statement of Faith Ministries Community Groups Children's Ministry Student Ministries Equipping Hour Global Missions Mercy Ministry Other Give Events Church Center As In Heaven Podcast Worship Services at 9:15am and 10:45am 872 Maitland Ave, Altamonte Springs, FL 32701 (407)660-1984 office@orlandograce.org Powered by Church Plant Media © 2025 Orlando Grace Church: Altamonte Springs, FL"
    },
    {
      "url": "https://www.graciejiujitsualtamonte.com/page/about-us",
      "text": "About Us - Gracie Jiu-Jitsu Altamonte Springs Martial arts for children and adults! email Info@GracieJiuJitsuAltamonte.com phone 407-335-4149 Programs Gracie Combatives - Adult & Teens Co-Ed Program Gracie Bullyproof - Youth Program Master Cycle - Advanced Co-ed Program Women Empowered - Women’s Program About Schedule Instructors Book About Us Contact Login Gracie Jiu-Jitsu Altamonte Springs proudly empowers Altamonte Springs families. Gracie Jiu-Jitsu Altamonte Springs has beginner to advanced jiu-jitsu classes in Altamonte Springs for men, women, and children. Who We Are and Why You Should Train Here At Gracie Jiu-Jitsu Altamonte Springs, we believe Gracie Jiu-Jitsu is for EVERYONE, regardless of age, gender, athleticism, or ability. We are proud to say we are continuing the legacy of Grandmaster Hélio Gracie who believed jiu-jitsu should empower the weak to be able to defend against the strong. This is why we offer structured martial arts curriculums specific to the self-defense needs for any demographic or skill level, with programs created for beginner adults, women, and children. We take pride in creating a safe, comfortable, and welcoming learning environment for all students and family members in Altamonte Springs. We are passionate about what we do because, simply put, we believe confident humans make kinder humans. Welcome to the Family Whether it’s teaching you how to tie your first jiu-jitsu belt, or guiding you through your first technique, our team’s priority is to make you feel at home from the moment you walk into Gracie University. Should you have any questions, call our number above to speak to one of our Student Experience representatives. Get Started Schedule Instructors Contact Book In-Person Classes Gracie Combatives - Adult & Teens Co-Ed Program Gracie Bullyproof - Youth Program Master Cycle - Advanced Co-ed Program Women Empowered - Women’s Program Contacts phone 407-335-4149 location_on 249 W State Road 436 Suite 1085 Altamonte Springs FL 32714 US Facebook Instagram This Certified Gracie Jiu-Jitsu Training Center® is independently owned and operated.\n                Gracie Jiu-Jitsu®, Gracie Combatives®, Gracie Bullyproof®, Women Empowered®,\n                Master Cycle®, and Certified Gracie Jiu-Jitsu Training Center® are registered\n                trademarks used under license from Gracie University®. Copyright © 2025"
    }
  ]
}