{
  "fuentes": [
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "diana@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "jordan@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "peyton@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "coupons@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "edith@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "finance@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "jessica@massfarmersmarkets.org"
    },
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "email": "memberservices@massfarmersmarkets.org"
    },
    {
      "url": "https://visitlevy.com/?eventDisplay=venue&tribe_venue=chiefland-farmers-flea-market&post_type=tribe_venue",
      "email": "sistrunk-catrina@levycounty.org"
    },
    {
      "url": "https://visitlevy.com/?eventDisplay=venue&tribe_venue=chiefland-farmers-flea-market&post_type=tribe_venue",
      "email": "whitehurst-tisha@levycounty.org"
    },
    {
      "url": "https://chieflandfarmersfleamarket.com/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://chieflandfarmersfleamarket.com/",
      "email": "vicki@chieflandfarmersfleamarket.com"
    },
    {
      "url": "https://www.durhamfarmersmarket.com/staff-board",
      "email": "info@durhamfarmersmarket.com"
    },
    {
      "url": "https://fleamarketpro.com/flea-market/chiefland-farmers-flea-market-2/",
      "email": "fleamarketpro@yahoo.com"
    },
    {
      "url": "https://www.portlandfarmersmarket.org/our-staff/",
      "email": "contact@portlandfarmersmarket.org"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/home",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/home",
      "email": "vicki@chieflandfarmersfleamarket.com"
    },
    {
      "url": "https://unitedfleamarkets.com/leadership",
      "email": "inquiries@unitedfleamarkets.com"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jillian@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "julie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalief@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "allyson@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "breanne@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "caroline@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "cassidee@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "charreese@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "delite@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "genevieve@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "info@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jesse@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "john@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kellie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kiffen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kristen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "lily@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "madeleine@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "molly@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "paula@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "rob@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "sean.kontos@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "stephanie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "susan@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "taylor@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "thea@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "turon@farmfreshri.org"
    },
    {
      "url": "https://chieflandfleamarket.com/contact-us/",
      "email": "vicki@chieflandfarmersfleamarket.com"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/Become-A-Vendor",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/Become-A-Vendor",
      "email": "vicki@chieflandfarmersfleamarket.com"
    }
  ],
  "mails": [
    "allyson@farmfreshri.org",
    "breanne@farmfreshri.org",
    "caroline@farmfreshri.org",
    "cassidee@farmfreshri.org",
    "charreese@farmfreshri.org",
    "contact@portlandfarmersmarket.org",
    "coupons@massfarmersmarkets.org",
    "delite@farmfreshri.org",
    "diana@massfarmersmarkets.org",
    "edith@massfarmersmarkets.org",
    "finance@massfarmersmarkets.org",
    "flags@2x.png",
    "fleamarketpro@yahoo.com",
    "genevieve@farmfreshri.org",
    "info@durhamfarmersmarket.com",
    "info@farmfreshri.org",
    "inquiries@unitedfleamarkets.com",
    "jesse@farmfreshri.org",
    "jessica@massfarmersmarkets.org",
    "jillian@farmfreshri.org",
    "john@farmfreshri.org",
    "jordan@massfarmersmarkets.org",
    "julie@farmfreshri.org",
    "kellie@farmfreshri.org",
    "kiffen@farmfreshri.org",
    "kristen@farmfreshri.org",
    "lily@farmfreshri.org",
    "madeleine@farmfreshri.org",
    "memberservices@massfarmersmarkets.org",
    "molly@farmfreshri.org",
    "natalie@farmfreshri.org",
    "natalief@farmfreshri.org",
    "paula@farmfreshri.org",
    "peyton@massfarmersmarkets.org",
    "rob@farmfreshri.org",
    "sean.kontos@farmfreshri.org",
    "sistrunk-catrina@levycounty.org",
    "stephanie@farmfreshri.org",
    "susan@farmfreshri.org",
    "taylor@farmfreshri.org",
    "thea@farmfreshri.org",
    "turon@farmfreshri.org",
    "vicki@chieflandfarmersfleamarket.com",
    "whitehurst-tisha@levycounty.org"
  ],
  "nombre_sitio": "chieflandfarmersfleamarket.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.massfarmersmarkets.org/staff",
      "text": "Our Staff & Team — Mass Farmers Markets MFM Markets For Farmers & Vendors For Shoppers For Market Managers Support Events | Projects | Nutrition Assistance | MFM News | About MFM | Gift Certificates | Subscribe Back Central Sq Farmers Market Copley Sq Farmers Market Davis Sq Farmers Market Fish & Farm Market at Boston Fish Pier Kendall Sq Farmers Market Back Mission The Team Partners Board Careers Contact Us MFM Markets Central Sq Farmers Market Copley Sq Farmers Market Davis Sq Farmers Market Fish & Farm Market at Boston Fish Pier Kendall Sq Farmers Market For Farmers & Vendors For Shoppers For Market Managers Support Events | Projects | Nutrition Assistance | MFM News | About MFM | Mission The Team Partners Board Careers Contact Us Gift Certificates | Subscribe Our STAFF Edith Murnane Executive Director edith@massfarmersmarkets.org | 781-893-8777 From farm to farmers markets, from restaurant kitchens to food enterprises, from school food to city government, Edith has worked to develop food systems that support farmers, food businesses and all enterprises along the food chain while creating food access for Massachusetts residents. While a part of Mayor Thomas M Menino's administration, Edith established the Office of Food Initiatives. Under her stewardship, various food programs were launched including Boston’s Micro Urban Farming Initiative, the City’s Urban Agriculture Re-zoning work, the city's Restaurant Roadmap, the Food Truck Initiative, and the city's Food System Resiliency Initiative. While at the city, Edith streamlined the permitting process for vendors at farmers markets, brought about permitting changes at Boston’s Inspectional Services Department, Health Division, that has allowed local, day-boat fish to be sold at Boston’s Farmers’ Markets, for the first time in decades, and launched the city's composting pilots. On the national stage, Edith was integral in launching the US Conference of Mayors' Food Policy Task Force, positioning Mayor Menino as its chair. The task force successfully lobbied Congress, leveraging the voice of the entire US Conference of Mayors to affect policy changes in the US Farm Bill. These policies will generate a broad economic impact on cities and towns across the United State while fostering better public health. Edith joined the Mayor's office from Community Servings, a local not-for-profit food and nutrition program that provides services throughout Massachusetts to individuals and families living with critical and chronic illnesses. While at Community Servings, Edith built a farmers' market, inaugurated the first Community Supported Fish (CSF) program in Boston, established a UN-supported demonstration garden, and oversaw the organization's school and senior meals programs. In addition to her work in at Community Servings, Edith has worked at a variety of restaurants and catering establishments, was the chef/ owner of The Cantata in Jamaica Plain, was a frequent vendor at a number of local farmers' markets and sat on the Board of the now newly opened Boston Public Market. Since leaving the Mayor’s Office,  Edith has consulted on a number of statewide initiatives, such as Big Picture Beef , the Local Tomato Sauce Project , Women in Meat Northeast , and the Worcester Public Market . Barbara Slattery Director of Finance finance@massfarmersmarkets.org | 781-893-8666 Barbara is a graduate of University of Massachusetts, Amherst with a degree in Business and leadership studies. Before joining MFM, she worked for Bank of America/Merrill Lynch and its New England predecessors in both investment operations and as a registered Investment Sales Assistant. She has extensive capital markets experience working with large corporate, middle market, government, non-profits, and sophisticated investors. As a solution focused team member, she considers herself a lifelong learner looking to gain knowledge whenever and wherever she goes.  Always asking the questions:  How can I help? Why do we do it this way? and Is there a way to improve? In her free-time, Barbara enjoys photography, travel, live music and raising funds for homeless veterans. MFM joins Barbara's desires to help others and make an impact on our communities. Joe McIlwain Coupon Programs coupons@massfarmersmarkets.org | 781-893-8222 x 1003 Joe McIlwain has been celebrating Coupon Christmas (the first two weeks of November when submission volume is highest) since 2017, when he joined MFM during a lull in his high tech career. Even though he has a full time software job elsewhere, he continues to run the coupon verification work at MFM. He enjoys the satisfaction of a job well done, loves working with the farmers, and truly believes in these nutritional programs. Rick Grudzinski Director of Member Services memberservices@massfarmersmarkets.org  | 781-893-8222 x 1006 Prior to joining MFM, Rick spent almost twenty-five years in the finance and software industries; most recently, he worked for a private software company in its Boston and London offices. Rick is on the board of the Cambridge Community Foundation and volunteers with various food-related organizations. Rick is passionate about food access and is excited to support the role farmers markets play in a healthy regional food system. Rick lives in Cambridge with his wife and daughter, and in his spare time enjoys hiking and cooking his way through CSA boxes and farmers markets' finds. Jessica Dreschel Market Manager jessica@massfarmersmarkets.org | 781-893-8222 Jessica was grateful to join the MFM team in summer 2024. She is excited to bring her career experience in non-profit communications to bear in supporting food access at farmers markets. Her favorite thing about working at MFM is the personal connections she makes with her community. In her off-time, she can be found maximizing the varied bounty from her favorite market vendors in her home kitchen, finding new winding walking routes in her Boston neighborhood, or spending time as loving auntie to her two precocious nieces. Diana Ortiz Assistant Market Manager Diana@massfarmersmarkets.org | 781-893-8222 Diana Hurtado Ortiz joined Mass Farmers Markets in 2025 and is grateful to support access to fresh, local food. With a background in floral design and a passion for food systems, she loves helping create welcoming spaces for farmers and communities. She studies Biochemical Engineering with a focus on sustainable agriculture, volunteers in social movement education, and enjoys gardening, cooking, and caring for her community and the environment. Jordan Roach Assistant Market Manager Jordan@massfarmersmarkets.org | 781-893-8222 Jordan Roach joined the MFM staff in May 2025 as Assistant Market Manager and Food Access Coordinator for the Kendall Square and Central Square markets. Originally from Vermont, he is passionate about building strong local food systems and increasing food access in the community. Jordan has a B.A. from Tufts University in Music and Environmental Studies with a focus in Food Systems. He is currently working towards his M.A. in Music from Tufts as well with a thesis focusing on public, participatory performances. Peyton McConnell Assistant Market Manager and Food Access Coordinator Peyton@massfarmersmarkets.org | 781-893-8222 Peyton joined the MFM team in June 2025 as Assistant Market Manager and Food Access Coordinator for the Fish and Farm and Davis Sq. Markets. She graduated from UNC Chapel Hill in May 2025 with a B.A. in Sociology and minors in Food Studies and Social and Economic Justice, completing an honors thesis on how gender shapes the experiences of female chefs. Passionate about improving food access and building a just food system, Peyton is excited to make a difference at MFM. Outside of work, she enjoys cooking, exploring Boston, watching movies, and live music. Loki Office Mascot The MFM team mascot is Loki. He is 9 years old, enjoys road trips, and his favorite food is chicken. Mass Farmers Markets 240 Beaver Street, Waltham, MA, 02452, United States 781-893-8222 hello@massfarmersmarkets.org Hours Mon 8 am - 5 pm Tue 8 am - 5 pm Wed 8 am - 5 pm Thu 8 am - 5 pm Fri 8 am - 5 pm Sat Closed Sun Closed In Partnership With Cummings Foundation Cambridge Community Foundation Farm Credit East The Fletcher Foundation Alfred E. Chase Charity Foundation, Bank of America, N.A., Trustee DONATE About MFM Contact Us Sponsorship Market Jobs Coupon Programs Submitting Coupons or Vouchers Volunteering Gift Certificates Loyalty Cards"
    },
    {
      "url": "https://visitlevy.com/?eventDisplay=venue&tribe_venue=chiefland-farmers-flea-market&post_type=tribe_venue",
      "text": "Levy County Tourism | Visit Levy | Levy County, FL HOME CONTACT NEWSLETTER EVENTS THINGS TO DO ANTIQUES AND SHOPPING ARTS | MUSEUM | HISTORY ATTRACTIONS & GOLFING BOAT RAMPS | FISHING PIERS & MARINAS FISHING | BAIT | GUIDES HORSE ACTIVITIES PARKS & TRAILS SNORKELING & DIVING TOURS & TRANSPORTATION ABOUT COAST OF LEVY AIRPORTS HISTORICAL PRESS EAT STAY U PICK COMMUNITIES BRONSON CEDAR KEY CHIEFLAND FANNING SPRINGS GULF HAMMOCK INGLIS MORRISTON OTTER CREEK ROSEWOOD SUMNER WILLISTON YANKEETOWN INTERACTIVE MAP CONTACT THINGS TO DO ARTS | MUSEUM | HISTORY ANTIQUES AND SHOPPING ATTRACTIONS & GOLFING BOAT RAMPS | FISHING PIERS & MARINAS FISHING | BAIT | GUIDES HORSE ACTIVITIES PARKS & TRAILS SNORKELING & DIVING TOURS & TRANSPORTATION BIG BEND SHELLFISH TRAIL CEDAR KEY CLAM TRAIL ABOUT COAST OF LEVY AIRPORTS HISTORICAL PRESS EAT STAY U PICK COMMUNITIES BRONSON CEDAR KEY CHIEFLAND FANNING SPRINGS GULF HAMMOCK INGLIS MORRISTON OTTER CREEK ROSEWOOD SUMNER WILLISTON YANKEETOWN EVENTS CONTACT NEWSLETTER INTERACTIVE MAP More To Explore in Levy County, FL START EXPLORING Visit Levy County, Florida Discover your next adventure in a world of natural wonders far beyond the hustle and noise of man-made attractions. Outdoor enthusiasts and sportsmen have long found a wealth of opportunities within the boundaries of Levy County. Word has spread about this diverse, unspoiled region known as “Florida’s Natural Paradise” where the human population is dwarfed by the multitude of birds and wildlife that call the area home. Its scenic beauty, wildlife and outdoor recreational opportunities make Levy County the perfect destination. With nearly one fifth of the county set aside for state and national wildlife areas, Levy is blessed with numerous parks, preserves, springs and wildlife refuges where visitors can discover rest and recreation in abundance. In fact, there are over 25 nature-based recreational sites in Levy. Events & Festivals Upcoming Festivals and Events View All Upcoming Events & Festivals Places to Stay Stay where nature meets comfort Find the Perfect Place Places to Eat All locations to eat, drink, and socialize. Start Exploring Explore Levy County WHERE IS LEVY COUNTY? Levy County Visitors Bureau 607 SW 1st Avenue, Williston, FL learn more > Our Partners Breathtaking colors of our planet Button Portraits of people from around the globe Button Stark beauty of desolate dunes Button Explore Florida’s Nature Coast in Levy County Levy County’s Chambers of Commerce Button Button Button Button #VisitLevYcounty Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button View more Levy County Visitors Bureau 607 SW 1 st Avenue, Williston, FL 32696 Office: (352) 528-4030 Tisha Whitehurst Division Director Economic Development & Tourism whitehurst-tisha@levycounty.org Catrina Sistrunk Tourism Manager sistrunk-catrina@levycounty.org FOLLOW US #LoveLevy THINGS TO DO ARTS | MUSEUM | HISTORY ANTIQUES AND SHOPPING ATTRACTIONS & GOLFING BOAT RAMPS | FISHING PIERS & MARINAS FISHING | BAIT | GUIDES HORSE ACTIVITIES PARKS & TRAILS SNORKELING & DIVING TOURS & TRANSPORTATION BIG BEND SHELLFISH TRAIL CEDAR KEY CLAM TRAIL ABOUT COAST OF LEVY AIRPORTS HISTORICAL PRESS EAT STAY U PICK COMMUNITIES BRONSON CEDAR KEY CHIEFLAND FANNING SPRINGS GULF HAMMOCK INGLIS MORRISTON OTTER CREEK ROSEWOOD SUMNER WILLISTON YANKEETOWN EVENTS CONTACT NEWSLETTER INTERACTIVE MAP EAT STAY U PICK HORSE ACTIVITIES © 2025 All Rights Reserved | Visit Levy County Florida Photo Credit: Pat Bonish & Jesse Sampley Made By Meridian Pursuit Marketing"
    },
    {
      "url": "https://chieflandfarmersfleamarket.com/",
      "text": "Chiefland Farmers Flea Market HOME ABOUT FAQ's Featured Vendors TESTIMONIAL CONTACT US Become A Vendor Vendor Application Our Vendors Marketplace Welcome to Chiefland Farmers Flea Market Discover Unique Finds and Support Local Businesses Visit Us Celebrate Community, Shop Local, Support America Visit Us About Us Experience the Heart of Chiefland Nestled in the heart of Levy County, Chiefland Farmers Flea Market is a vibrant gathering place where community, tradition, and commerce come together. Our market offers a diverse array of vendors with unique finds, fresh produce, antiques, and handmade crafts. Join us every weekend to experience the welcoming atmosphere and support local businesses. Business Hours Friday: 8:00 AM - 3:00 PM Saturday: 8:00 AM - 3:00 PM Sunday: 8:00 AM - 3:00 PM Address: 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 A Unique Shopping Experience Discover a treasure trove of unique finds and handmade crafts at Chiefland Farmers Flea Market, Our diverse range of vendors offers everything from fresh produce and antiques to local art and specialty foods. Each visit is a new adventure, with one-of-a-kind items you won't find anywhere else. Visit Us Community Events and Activities Join us every weekend for a variety of fun and engaging events. From live music and food festivals to family-friendly activities and holiday celebrations, there’s always something happening at the market. Our events bring the community together, creating a vibrant and welcoming atmosphere for all. Visit Us Support Local Businesses By shopping at Chiefland Farmers Flea Market, you’re supporting local entrepreneurs and small businesses. Our vendors are passionate about what they do, offering high-quality products and personal service. Your visit helps sustain the local economy and fosters a sense of community pride. Visit Us Upcoming Events Chiefland Farmers Flea Market Events Coming Soon Grab the kids, bring your baskets, and hop on over for a morning of Easter fun at the Chiefland Farmers Flea Market! Tons of eggs to find FREE admission for kids Parents can shop with our awesome vendors while the little ones hunt for goodies! It’s going to be a festive day full of smiles, surprises, and springtime fun We can’t wait to see you there! Visit Us Chiefland Farmers Flea Market Events Coming Soon Grab the kids, bring your baskets, and hop on over for a morning of Easter fun at the Chiefland Farmers Flea Market! Tons of eggs to find FREE admission for kids Parents can shop with our awesome vendors while the little ones hunt for goodies! It’s going to be a festive day full of smiles, surprises, and springtime fun We can’t wait to see you there! Visit Us Meet Our Vendors Featured Vendors Support local businesses and discover unique products from our talented vendors at Chiefland Farmers Flea Market. Healthy Phone Tech Fast screen, battery, and software repairs to restore your phone’s functionality and ensure reliability. The Fluffy Butt Hut Check out The Fluffy Butt Hut at Chiefland Farmers Flea Market! Offering healthy and vibrant spider plants, this booth is a great stop for anyone looking to add some greenery to their home or garden. If you love easy-care plants, come explore what The Fluffy Butt Hut has to offer and take home a beautiful addition to your space! Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Become A Vendor Fresh Produce Debby's Veggies Open Tuesday, Wednesday, and Friday-Sunday 9:00 am - 4:00 pm POPULAR QUESTIONS Get Answers to Your Questions Have questions about the Chiefland Farmers Flea Market? Find answers to the most commonly asked questions about our market, vendors, and more. What are the operating hours of the Chiefland Farmers Flea Market? The flea market is open every Friday, Saturday, and Sunday from 8:00 AM to 3:00 PM. Where is the Chiefland Farmers Flea Market located? We are located at 1206 N Young Blvd US HWY 19, Chiefland, FL 32626. For directions, click here How can I become a vendor at the Chiefland Farmers Flea Market? To become a vendor, please visit our \"Become a Vendor\" page for application details and booth rental information. What types of products can I find at the flea market? Our market features a diverse range of products including fresh produce, handmade crafts, antiques, collectibles, and specialty foods. Are pets allowed at the flea market? Yes, well-behaved pets on leashes are welcome at the flea market. Please ensure your pets are friendly and considerate of other visitors. Additionally, we kindly ask that you pick up after your dog to help keep the market clean and enjoyable for everyone. TESTIMONIALS What Visitors Say Discover Unique Finds and Support Local Businesses Quick Links Home About Us FAQ's Testimonials Blog-Coming soon Quick Links 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 (352) 493-2022 [email protected] Powered By James Lynch Marketing Privacy Policy | Term & Condition | FAQ Copyright © 2024 Designed by James Lynch Marketing. All rights reserved."
    },
    {
      "url": "https://www.durhamfarmersmarket.com/staff-board",
      "text": "staff & board — Durham Farmers Market 0 Skip to Content About about location & hours staff & board rules and by-laws Our Programs food programs sprouts club bipoc vendor program goals and impacts recipes Get Involved Vendors our vendors become a vendor vendors only this week's vendors Newsletter Sign up Open Menu Close Menu About about location & hours staff & board rules and by-laws Our Programs food programs sprouts club bipoc vendor program goals and impacts recipes Get Involved Vendors our vendors become a vendor vendors only this week's vendors Newsletter Sign up Open Menu Close Menu Folder: About Back about location & hours staff & board rules and by-laws Folder: Our Programs Back food programs sprouts club bipoc vendor program goals and impacts recipes Get Involved Folder: Vendors Back our vendors become a vendor vendors only this week's vendors Newsletter Sign up staff and board Kaitlyn Breedlove MARKET MANAGER Vanessa Handy ASSISTANT MANAGER Tom Hurtgen PRESIDENT Hurtgen Meadows Grant Ruhlman VICE PRESIDENT Homebucha Matt Clayton TREASURER Wild Scallions Farm Danielle White SECRETARY Chocolatay Confections Noah Ranells Fickle Creek Farm Ingrid Fricks Fricks Apiaries Erasmo Flores Harland’s Creek Farm Amy Sugg Bonlee Grown Farm Alice White Bluebird Meadows Thank you to our sponsors CURRENT HOURS LOCATION 501 Foster Street Durham, NC 27702 Saturdays, 8am - 12pm Wednesdays, 3pm - 6pm PROGRAMS Food programs BIPOC Vendor Program Sprouts Club GET INVOLVED Donate Sponsorships Volunteer CONTACT info@durhamfarmersmarket.com (919) 667-3099"
    },
    {
      "url": "https://fleamarketpro.com/flea-market/chiefland-farmers-flea-market-2/",
      "text": "Chiefland Farmers Flea Market | FleaMarketPro fleamarketpro@yahoo.com Markets Search to Buy Advantages of FMP Vendor Login Vendor Signup Blog FAQ Contact Markets Search to Buy Advantages of FMP Vendor Login Vendor Signup Blog FAQ Contact Name: Chiefland Farmers Flea Market Address: 1206 N Young Blvd Chiefland, FL 32626 Market Phone: 352-493-2022 Market Manager: Website: http://www.ChieflandFleaMarket.com/ Contact us. Click on the icon below and visit our Facebook page and let us know if you are a seller or a buyer and which flea market you are going to. Follow Follow Follow Information links Markets Search to Buy Advantages of FMP Vendor Login Vendor Signup Blog FAQ Contact Contact us Name Email Address Message Send message © Droits d’auteur 2022 FleaMarketPro. Tous droits réservés"
    },
    {
      "url": "https://www.portlandfarmersmarket.org/our-staff/",
      "text": "Our Staff & Board Of Directors - Portland Farmers Market Skip to content Choose a language × 中文 成为供应商 Portland State University Market Kenton Market King Farmers Market Lents International Market Shemanski Park Market 日本語 ベンダーになる Portland State University Market Kenton Market King Farmers Market Lents International Market Shemanski Park Market Español Conviértase en un Proveedor Portland State University Market Kenton Market King Farmers Market Lents International Market Shemanski Park Market Pусский Как стать продавцом Portland State University Market Kenton Market King Farmers Market Lents International Market Shemanski Park Market Tiếng Việt Trở thành Người bán hàng Portland State University Market Kenton Market King Farmers Market Lents International Market Shemanski Park Market Subscribe to our Newsletter Our Markets PSU Farmers Market Shemanski Park Farmers Market King Farmers Market Kenton Farmers Market Lents International Farmers Market At Market What’s in Season Filming and Photographing at Markets Vendors Find Our Vendors Outside of Market Become a Vendor For Vendors Matthew Choi Farmers Market Vendor Grant Programs & Events Double Up Food Bucks Our Programs & Partnerships Music At The Market Events Calendar Get Involved Volunteer Donate Sponsorship & Exhibitor Community Groups At The Markets About Us Mission, Strategy & Values Our Staff Blog Careers FAQs Search Search Our Staff & Board Of Directors Staff Portland Farmers Market (PFM) is managed by a dedicated team of experienced individuals in local food systems and related fields, committed to the mission and success of the organization. Amber Operations Director Read Amber's Bio Expand Amber (she/her) was born and raised in the Willamette Valley and loves what this part of the world has to offer for food and play. She began working with Portland Farmers Market in 2007 while attending graduate school at Portland State University, earning a Master’s in Public Administration in 2009. In addition to her passion for well curated markets and rain gear, Amber is particularly proud of PFM’s progress in reducing waste and creating inclusive community gathering spaces for Portland residents and visitors. Eamon Accounting & Office Manager Read Eamon's Bio Expand Eamon (he/him) was born in New York City and grew up on Long Island. After moving to Rochester, NY for college, he spent 18 years there, immersing himself in food justice and local agriculture through work in restaurants, food cooperatives, and regional food networks. In 1995, Eamon and his family moved to Portland, Oregon, where he became deeply involved in the city's local food community. From 2004 to 2022, he served as the Market Manager at the Hillsdale Farmers Market, playing a key role in supporting local farmers and fostering community connections. Eamon briefly took on the role of General Manager at Food Front Cooperative in 2016 and 2017. After nearly two decades of operational market management, he transitioned to an office-based position, continuing his work in food access and sustainability. Eliza Accounting & Administrative Assistant Read Eliza's Bio Expand Eliza (she/her) was born and raised in Rio de Janeiro, Brazil, where she also received her Bachelor of Science Degree in Economics from Universidade Federal Fluminense. Eliza moved to the US in 2010 to work as a bookkeeper for a non-profit publishing company. Attracted by the fantastic food this city offers, she moved to Portland in March 2024. Now, she works as an Accounting and Administrative Assistant, and her main reason for joining Portland Farmers Market is to be part of its wonderful community. Eliza loves to cook new recipes and hang out with her partner, Ben, and her cat, Morris. Helena Community Engagement Manager Read Helena's Bio Expand Through her hometown of Chicago and large family, Helena (she/they) fostered a love of food and how it connect us as humans and neighbors. While studying international relations and economics in Minneapolis, she started a food pantry at her college after seeing how much of the community was struggling with access. Since then, she’s lived and learned in Namibia, D.C., Denver, Hawaii, and Eugene working in various facets of the food system. Her experience in sustainable agriculture, food justice, grassroots organizing, and nutrition education has shown the many ways that we can dream up a more holistic and joyful food system. Helena is inspired by democratic workplaces and collective management structures, and believes that when power is shared the best decisions are made. Nowhere has felt more at home than Oregon, and Helena’s excited to be part of an organization that connects us to food and each other. When not in the office, you can find her crafting, cooking, frolicking with her chihuahua, and binge-watching trash TV. Jacquelyn Market Manager, Programs & Volunteers Read Jacquelyn's Bio Expand Jacquelyn (she/her) grew up in the Willamette Valley and has always had a deep appreciation for connecting with and honoring the land. She is a food justice advocate and is passionate about sustainable and equitable food systems and believes that everyone should have access to culturally appropriate and locally grown nutritious foods. Jacquelyn began working with the Portland Farmers Market in 2024 and brings with her experience working in local food banks and pantries, mental healthcare, and education. She graduated from Portland State University in 2023 with a Master’s in Leadership for Sustainability Education and is excited to join the Portland Farmers Market team and contribute to thriving local food systems. When Jacquelyn is not working she enjoys spending time outside and connecting with the seasons, birding watching, forest bathing, cuddles with her dogs and cat, and rewatching her favorite childhood show the X-Files. Katy Executive Director Read Katy's Bio Expand Katy (she/her) is a seasoned nonprofit executive with a passion for sustainable agriculture, equitable food access, and environmental justice. To Portland Farmers Market she brings fourteen years of director-level experience in nonprofit management, a depth of knowledge around local food systems, and a strong background in advancing diversity, equity and inclusion within organizations and beyond. Katy is the founder of Portland Fruit Tree Project, where she served as executive director for 10 years. Most recently, she was executive director for Families for Climate, and Interim Executive Director for 350PDX. In addition, Katy has a background in community engagement, program development, agriculture, and advocacy through past work with Growing Gardens, Cully Farmers Market, WSU Extension, and the Portland/Multnomah Food Policy Council. Her work has earned her numerous awards, including the Skidmore Prize from Willamette Week and the Innovators award from 1000 Friends of Oregon. Katy was born and raised in Baltimore, and has lived in Portland for over two decades. When not working she enjoys spending time with her kids, and finds particular joy in gardening, biking, and exploring natural areas together. Sarah Market Manager, Communications & At-Market Presence Read Sarah's Bio Expand Sarah (she/her) is a native Texan that at eighteen fled to the east coast as she was desperate for genuine seasons. After earning her degree in Psychology from Brandeis University and working in Higher Education Administration, she decided to shift gears in order to fully embrace her true passion of food. This shift brought her to Portland in 2015 to attend Oregon Culinary Institute where she earned a degree in Baking and Pastry Arts and Restaurant Management. While baking professionally in Portland, she continued her education at Portland State University earning a graduate certificate in Sustainable Food Systems. Sarah is thrilled to be a part of the Portland Farmers Market team in their mission of growing an equitable, healthy, and sustainable local food system. When not excelling at spreadsheets, Sarah enjoys cooking with and for loved ones, exploring the natural wonders of the PNW and staring lovingly at other people’s dogs. Stephanie Communications & Marketing Manager Read Stephanie's Bio Expand Stephanie (she/her) brings her passion for local food & community and numerous years of marketing experience to her role at Portland Farmers Market. Calling Portland home for over 20 years, Stephanie grew up in coastal San Diego, where she enjoyed an overabundance of locally grown avocados & citrus and learned an appreciation for all the ocean has to offer. She attended Humboldt State University, where she obtained a Bachelor of Arts degree and experienced a farmers market for the first time. This sparked a lifelong interest in good, clean, and fair food for all. When she is not at the farmers markets, Stephanie loves exploring the Pacific Northwest with her dog, drinking hoppy IPAs, and dabbling in the domestic sciences (cooking, baking, fermenting, preserving, knitting, sewing, painting watercolors, and weaving). Board PFM is governed by a volunteer-run board composed of community leaders, farmers market vendors, professionals and entrepreneurs from diverse backgrounds. Nikki Guerrero, President Owner Hot Mama Salsa Dan Rodgers, Treasurer Director of Finance New Seasons Market Chris Roehm Owner & Founder Square Peg Farm Matt Brown Executive Director & Organic Farmer FoodWaves Anna Goldrich Executive Director Hoyt Arboretum Friends Michael Jonas Owner & Principal Attorney Narwhal Nonprofit Consulting Francis Kungu Co-Founder & Owner Exilior Coffee Company Holly Ong Co-Founder & Chief Maker Sibeho Rich Schwartz Principal Consultant Alder Street Consulting Lisa Sedlar Sustainable Food Systems Leader Sabina Urdes Executive Director East Portland Collective Diversity in Hiring We believe that to be an effective leader at growing an equitable, healthy, and sustainable local food system, we need to reflect those principles internally. It all starts with a strong foundation. Embracing equity as a guiding principle, we encourage employment applications from candidates with diverse backgrounds and from underrepresented groups. We believe that when our staff represents a diversity of perspectives and life experiences, we can be most responsive to the needs of our vendors and shoppers, and better reflect the communities which our markets call home. Equal Employment Statement Portland Farmers Market is an equal opportunity employer.  We welcome all qualified individuals in accordance with the law without regard to their race, color, creed, religion, age, gender, sexual orientation, marital status, military status, political opinion, sex, national origin, familial status, mental and physical disability, gender identity, source of income, disability or any other status protected by federal, state, or local law in all personnel actions including recruitment, evaluation, selection, promotion, compensation, training, and termination. We will provide reasonable accommodation unless it creates an undue hardship on the operation of our organization. Any applicant needing reasonable accommodation should notify us as soon as possible. Follow Us on Instagram portlandfarmers Berries! Stone fruit! Shelling beans! Eggplant!  P Fall and Summer are colliding at market, in the be Greens! Peppers! Stone fruit! Sausages! Flowers! B It’s a gorgeous day here at the Shemanski Park F PSU Farmers Market made Food & Wine's list of Must A gorgeous day for a market stroll - don't ya thin THEY’RE BACK! 🌶️ 🌶️ 🌶️🌶️🌶 Visit PSU Farmers Market this Saturday, one of NYT Load More Follow on Instagram Contact Our Office Call us! (503) 241-0032 View us on Google Maps 240 N Broadway, Suite 129 Portland, OR 97227 Email us! contact {at} portlandfarmersmarket {dot} org Newsletter Sign up for monthly and/or weekly email communications about our markets, scheduled vendors lists, upcoming events, and more! Subscribe © 2025 Portland Farmers Market. All Rights Reserved. Terms | Privacy | Cookies This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT Scroll To Top"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/home",
      "text": "Chiefland Farmers Flea Market HOME ABOUT FAQ's Featured Vendors TESTIMONIAL CONTACT US Become A Vendor Vendor Application Our Vendors Marketplace Welcome to Chiefland Farmers Flea Market Discover Unique Finds and Support Local Businesses Visit Us Celebrate Community, Shop Local, Support America Visit Us About Us Experience the Heart of Chiefland Nestled in the heart of Levy County, Chiefland Farmers Flea Market is a vibrant gathering place where community, tradition, and commerce come together. Our market offers a diverse array of vendors with unique finds, fresh produce, antiques, and handmade crafts. Join us every weekend to experience the welcoming atmosphere and support local businesses. Business Hours Friday: 8:00 AM - 3:00 PM Saturday: 8:00 AM - 3:00 PM Sunday: 8:00 AM - 3:00 PM Address: 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 A Unique Shopping Experience Discover a treasure trove of unique finds and handmade crafts at Chiefland Farmers Flea Market, Our diverse range of vendors offers everything from fresh produce and antiques to local art and specialty foods. Each visit is a new adventure, with one-of-a-kind items you won't find anywhere else. Visit Us Community Events and Activities Join us every weekend for a variety of fun and engaging events. From live music and food festivals to family-friendly activities and holiday celebrations, there’s always something happening at the market. Our events bring the community together, creating a vibrant and welcoming atmosphere for all. Visit Us Support Local Businesses By shopping at Chiefland Farmers Flea Market, you’re supporting local entrepreneurs and small businesses. Our vendors are passionate about what they do, offering high-quality products and personal service. Your visit helps sustain the local economy and fosters a sense of community pride. Visit Us Upcoming Events Chiefland Farmers Flea Market Events Coming Soon Grab the kids, bring your baskets, and hop on over for a morning of Easter fun at the Chiefland Farmers Flea Market! Tons of eggs to find FREE admission for kids Parents can shop with our awesome vendors while the little ones hunt for goodies! It’s going to be a festive day full of smiles, surprises, and springtime fun We can’t wait to see you there! Visit Us Chiefland Farmers Flea Market Events Coming Soon Grab the kids, bring your baskets, and hop on over for a morning of Easter fun at the Chiefland Farmers Flea Market! Tons of eggs to find FREE admission for kids Parents can shop with our awesome vendors while the little ones hunt for goodies! It’s going to be a festive day full of smiles, surprises, and springtime fun We can’t wait to see you there! Visit Us Meet Our Vendors Featured Vendors Support local businesses and discover unique products from our talented vendors at Chiefland Farmers Flea Market. Healthy Phone Tech Fast screen, battery, and software repairs to restore your phone’s functionality and ensure reliability. The Fluffy Butt Hut Check out The Fluffy Butt Hut at Chiefland Farmers Flea Market! Offering healthy and vibrant spider plants, this booth is a great stop for anyone looking to add some greenery to their home or garden. If you love easy-care plants, come explore what The Fluffy Butt Hut has to offer and take home a beautiful addition to your space! Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Vendor Business Name Your business description here, highlighting unique offerings and local charm for visitors. Become A Vendor Fresh Produce Debby's Veggies Open Tuesday, Wednesday, and Friday-Sunday 9:00 am - 4:00 pm POPULAR QUESTIONS Get Answers to Your Questions Have questions about the Chiefland Farmers Flea Market? Find answers to the most commonly asked questions about our market, vendors, and more. What are the operating hours of the Chiefland Farmers Flea Market? The flea market is open every Friday, Saturday, and Sunday from 8:00 AM to 3:00 PM. Where is the Chiefland Farmers Flea Market located? We are located at 1206 N Young Blvd US HWY 19, Chiefland, FL 32626. For directions, click here How can I become a vendor at the Chiefland Farmers Flea Market? To become a vendor, please visit our \"Become a Vendor\" page for application details and booth rental information. What types of products can I find at the flea market? Our market features a diverse range of products including fresh produce, handmade crafts, antiques, collectibles, and specialty foods. Are pets allowed at the flea market? Yes, well-behaved pets on leashes are welcome at the flea market. Please ensure your pets are friendly and considerate of other visitors. Additionally, we kindly ask that you pick up after your dog to help keep the market clean and enjoyable for everyone. TESTIMONIALS What Visitors Say Discover Unique Finds and Support Local Businesses Quick Links Home About Us FAQ's Testimonials Blog-Coming soon Quick Links 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 (352) 493-2022 [email protected] Powered By James Lynch Marketing Privacy Policy | Term & Condition | FAQ Copyright © 2024 Designed by James Lynch Marketing. All rights reserved."
    },
    {
      "url": "https://unitedfleamarkets.com/leadership",
      "text": "United Flea Markets Menu × Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact A balance of corporate prudence, practical experience, capital, resources and flexibility. A balance of corporate prudence, practical experience, capital, resources and flexibility. A balance of corporate prudence, practical experience, capital, resources and flexibility. About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team The United Flea Markets Team The United Flea Markets team balances its corporate prudence, practical flea market experience, capital and resources with a more flexible structure and perspective to create best-of-class, streamlined operations with an always-evolving and creative approach. dots Robert Sieban Executive Chairman and Owner, United Flea Markets Rob now serves as Executive Chairman of United Flea Markets, where his focus is on mergers and acquisitions to support the company’s continued growth and expansion. He also serves as Chairman of the National Flea Market Association Board of Directors. Rob earned his on-the-ground credentials in 2011 when he assumed leadership as CEO and operator of Denver’s Mile High Flea Market, the third-largest outdoor flea market in the nation. With more than 30 years of experience in the retail and flea market industries, Rob has held leadership roles in buying, merchandise planning and allocation, and has worked extensively with both large and small private-equity firms. He has also served as an officer of publicly traded companies. His executive background includes leadership in the direct-to-consumer space with a focus on scalable platforms, including key roles at Sunglass Hut International and Lids Corp during periods of significant global growth. Additionally, Rob held positions as Executive Vice President at BriteSmile and Director of Operations at Pier 1 Imports. Staunton Golding Co-Founder, MBHE Holdings LLC and Owner, United Flea Markets Staunton handles overall strategy, management and growth of MBHE and its operating companies, with a particular emphasis on mergers and acquisitions, capital formation and strategic relationships. Prior to forming MBHE, he led all capital markets efforts and growth initiatives as the executive vice president and director of a national hotel investment, management and development company. Lincoln Hoffman CEO, United Flea Markets Lincoln joined United Flea Markets in 2018 as Director of Field Services and quickly demonstrated his strong operational skill set, successfully running the business and helping scale the United Flea Markets portfolio. He was later promoted to President and, in 2025, elevated to Chief Executive Officer. As CEO, Lincoln continues to lead the company’s growth, overseeing all aspects of operations, strategic initiatives, and portfolio development. Prior to joining United Flea Markets, Lincoln served as Director of Property and Asset Management for a real estate management company, where he oversaw more than one million square feet of commercial and medical office space across 35 locations in three states. He also held leadership roles in Las Vegas, where he managed operations for luxury retail centers, casinos, convention centers, and resorts. In these positions, he directed key departments including facilities, housekeeping, environmental services, shipping and receiving, and security. Lincoln joined the United States Marine Corps in 2004, graduating as Company Honor Man in both recruit training and MOS school. Gene Berry Chief Financial Officer, United Flea Markets Gene joined the company in October of 2014 after 25 successful years with Hewlett-Packard (HP) as controller for the state of Colorado. During his time with HP, he held various positions primarily focused in finance with a strong emphasis on business development and operations. In addition, Gene is a Certified Business Coach and has worked side-by-side with entrepreneurs to build businesses and has assisted various members of management to achieve performance excellence. Lisa Povich Vice President of Human Resources and IT, United Flea Markets Lisa joined Mile High Flea Market, a subsidiary of United Flea Markets, over 30 years ago with a background in administrative management. During her tenure, she has played a key role in the formation and development of the United Flea Markets platform. In her role at United Flea Markets, Lisa works directly with the individual leadership teams at each subsidiary market. Jessica Jeffers Vice President of Marketing, United Flea Markets In her role as Vice President of Marketing for United Flea Markets, Jessica has mastered the art of attracting both buyers and sellers. Always full of fresh ideas, she understands how to bring the unique and fun flea market experience to life through marketing and on-pavement experiences. Previously, Jessica was a sales executive for a large law firm, and her position at at United Flea Markets has been a welcome and exciting change of pace. Consultants dots Michael Lynch Owner, President, MLPA Realty Inc. Michael has three decades of experience as a commercial real estate broker. He currently represents United Flea Markets as an exclusive buyer’s broker for the United States, in conjunction with Premier Commercial of Naples, Florida. Prior to his real estate career, he was an airline transport pilot and accident investigator, organizing the FAA, serving as a labor management relations specialist and performing pro bono disaster relief air deliveries for the American Red Cross. Michael served in the Illinois Air National Guard and was honorably discharged. Dougall McCorkle Premier Commercial, Inc. Dougall provides a wide range of services for individuals and major companies in commercial real estate. With more than 40 years of experience, he has deep knowledge in all aspects of retail and office development, leasing, marketing and management. Dougall has negotiated over two million square feet of office and retail leases and over 500 transactions for clients ranging from national chains to start-up businesses. He is an active member of the International Council of Shopping Centers. Home About Markets News/Blog Contact inquiries@unitedfleamarkets.com • 720.592.0260 7007 E. 88th Ave., Henderson, CO 80640 ©2025 United Flea Markets. Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "text": "Staff & Board Farm Fresh Rhode Island A hub for local food since 2004 VISIT US Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT Mission History Staff & Board Job Opportunities SUPPORT Donate Asparagus Fest Local Food Fest Volunteer NEWS STAFF & BOARD All Staff Board Members Paula Gill Director of Business & Administration ☓ Paula Gill Paula is a local urban gardener with a love for growing and eating fresh, organic produce. A trip to Italy sparked a desire to change the way she feeds herself, after being deeply impacted by Italians’ passionate relationship to food and the Slow Food movement there. Since that impactful trip, she has dreamt of farming in Tuscany. By joining the Davis Park Community Gardens, as well as becoming a beekeeper, she has been able to make this dream a reality right here in Providence. Paula brings with her a first-hand knowledge of running a small business, in addition to her knack for numbers. She is excited about all that Farm Fresh RI is accomplishing and being an active member of the sustainable food movement in Rhode Island. Natasha Brotherns Market Mobile Inventory Manager ☓ Natasha Brotherns Natasha was born and raised in Providence, RI. She explains, “Growing up my family always kept a small farm and that’s where we ate most of our vegetables and fruit from as well. My interest in food and how it’s grown and distributed comes from my deep roots. My great grandmother being 100% Filipino, fresh produce has always been a part of our dinner table — grown and picked right in our backyard. Having spent most of my working years in the food industry, it’s opened my eyes to such varieties of food and also different cultures. I’d love to continue getting educated on our food system and how we can make it better, safer, and healthier!” Genevieve Primeau Market Mobile Sales Coordinator ☓ Genevieve Primeau Genevieve’s interest in food systems began while working in the local culinary scene in Providence. It was a formative experience to see first-hand all the moving parts in restaurant operation, while being surrounded by food-oriented people! Then there was a great moment of reckoning during the lockdown of 2020, when she was left to reflect on both the interconnectedness and the vulnerabilities of those systems. Nowadays, she is drawn to the agricultural tech space and particularly moved by the issue of food waste. She is pleased to have found marvelous company working on the Market Mobile team. As for her free time, she’s still searching for a “creative” hobby — suggestions are welcome! Cheryl Zecchin Farmers Market Associate ☓ Cheryl Zecchin Breanne Penkala Hope's Harvest Operations Manager ☓ Breanne Penkala Breanne is a RI native with a passion for fresh, local, and affordable food. After working on organic farms for the last 7 years in Upstate New York, Breanne is happy to finally return to the Ocean State. Breanne is excited to join the Hope’s Harvest team, building connections with local farmers and other food related organizations, while recovering produce from local farms and improving food security. In her free time, Breanne enjoys gardening, trying out all of the local ice cream shops, spending time by the ocean, and hiking with her dog. Kellie Beretta Assistant Director of Development ☓ Kellie Beretta As the daughter of a chef, food has been a major part of Kellie’s life since birth. Originally from New York, she studied Baking & Pastry Arts/ Food Service Management at Johnson & Wales University (North Miami), and spent several years managing bakeries. After leaving kitchens and graduating with a Masters in Public Administration from Suffolk University, she knew she wanted to work with food in a different way, which led her to pursue a career at food focused non-profits. Previously she was Senior Development Manager at Project Bread, a Massachusetts based anti-hunger organization and Director of Individual Giving at Chef Ann Foundation, focusing on scratch cooking in schools. A lover of all things local and devoted farmers market shopper, Kellie is thrilled to be at Farm Fresh RI! When not training for a marathon, quahogging, or on a boat, Kellie can be found relaxing at home in Jamestown with her husband and rescue puppy, Princess Leia. Susan Clausen Director of Facilities ☓ Susan Clausen After graduating from the University of Illinois and spending a year giving back to the community as a CETA worker for a grassroots recycling program (before everybody recycled!), Susan worked as a studio assistant for several glass artists. For well over a decade, she continued working in the jewelry industry, living in North Carolina, Pennsylvania, Maine, and Rhode Island. In 1985, she was a founding member of the unjuried, uncensored arts organization in Providence called AS220, and spent countless hours volunteering and eventually being employed by AS220 as Property Manager — a role she held for 16 years. Her commitment to building community and working in the nonprofit sector then led her to Farm Fresh RI, where she hit the ground running to help complete and launch our brand-new facility Providence (during a pandemic!). All throughout her career, Susan has maintained an art studio where she continues to produce mixed media artworks and dabbles in music. She sees cooking as another creative practice, and has found great pleasure cooking healthy foods from local farms. Brayden Puddington Board of Directors Vice President - Commercial Banker, J.P. Morgan Chase & Co. ☓ Brayden Puddington Quote Coming Soon! Allyson Jennings Assistant Director of  Hunger Relief ☓ Allyson Jennings Ally is a Rhode Island native with a passion for environmental sustainability and community engagement. After graduating from Johnson & Wales University in 2018 with degrees in Business Administration and Event Management, she served a year with the AmeriCorps National Civilian Community Corps (NCCC). Following her NCCC term, Ally joined Farm Fresh as the Farm to Food Pantry AmeriCorps VISTA. Now serving as the Assistant Director of Hunger Relief, Ally is excited to continue working with growers/producers, hunger relief agencies, and state agencies to help support the local food system. In her spare time, Ally enjoys hiking, camping, dancing, and baking. Onyx Sanchez Market Mobile Packhouse Associate ☓ Onyx Sanchez Turon Williams Market Mobile Operations Manager ☓ Turon Williams Turon moved to Providence at a very early age. He has attended the community college of RI. Turon also has been dealing in produce since 2005, when he was a manager for multiple wholesale companies. He firmly believes that building a successful team starts with great leadership and communication. In Turon’s spare time, he officiates basketball games for the kids across the east coast. Turon is very excited to join the Farm Fresh RI team, and believes that he can teach and learn from his coworkers, as well as associates. Natalie Varrallo Managing Director ☓ Natalie Varrallo Natalie is a food scientist, advocate, and educator focused on improving sustainability and food security, primarily within marginalized communities. She has a Bachelor of Science in Botany and Sustainable Agriculture, a Sustainable MBA, a Master of Science in Food Justice, and a Master of Science in Sustainable Food Systems. Natalie has spent her career working in many different facets of the food system. Her approach to work seeks to combine social justice and education while simultaneously increasing nutrition and food security within communities. Food is a foundational human right, and Natalie believes food can be used as a bridge to emphasize a compassionate and continual progression toward a more sustainable world. Delite Primus Director of Advancement ☓ Delite Primus Delite grew up in Steamboat Rock, Iowa, on her family’s corn, soybean, and dairy farm, learning early on the importance of food origin, food security, and the hard work and dedication needed to grow a passion from seed. After receiving her bachelor’s degree in Business Administration from Wartburg College (Waverly, IA) she began her career in Development with United Way of Central Iowa where she gained a strong foundation in donor relations and fundraising. After stops at Habitat for Humanity in Minnesota and Heifer International in California, she landed in Moab, Utah, at a food-based nonprofit called the Youth Garden Project (YGP). As Associate Director and later Executive Director of YGP, Delite led the organization and staff team, while having a specific focus on fundraising efforts — increasing individual donors, corporate partnerships, and grant awards during her tenure. Her 10 years at the organization nurtured her interest in being connected to community food systems and increasing healthy food access. Most recently, Delite served as a Proposal Development Specialist with Utah State University, working directly with faculty as well as state and federal agencies to secure funding for Agriculture and Natural Resource programs. Delite and her partner relocated to Rhode Island in 2019 to be closer to family. She was thrilled to find an organization like Farm Fresh RI that is the perfect merger of her personal passions and professional experience. Away from work, Delite enjoys working in her own garden, riding her bike, hiking a trail, traveling, and any day that involves more hours outside than less. And of course, she enjoys relaxing at one of South County’s amazing beaches. Angel Mendez Board of Directors Executive Director, Red Tomato ☓ Angel Mendez Natalie Faragon Food Access Operations Manager ☓ Natalie Faragon Natalie (she/her/hers) is from Long Island, New York. From a young age, she helped tend her family’s vegetable garden and learned to cook with whole, fresh produce. Her passion for food and service inspired her to move to Providence in 2015 to attend Johnson & Wales University, where she earned a degree in Restaurant, Food, and Beverage Management. Natalie is a part time yoga instructor at two local studios and enjoys connecting with her students by teaching mindfulness and movement practices. She lives in Providence with her partner, and in her free time, she enjoys hiking, reading, eating ramen, and playing video games. Kristen (KD) Dayton Harvest Kitchen Program Support ☓ Kristen (KD) Dayton Kristen (KD) Dayton is an enthusiastic communicator, a lifelong learner, and an advocate for connecting people through food. A recent graduate of the Sustainable Food Systems program at Johnson & Wales University, she enjoys facilitating information exchange and instructing people of all ages and backgrounds in how to appreciate food. In addition to her degree from Johnson & Wales, KD also holds a Master’s degree in International Relations from the University of Kent and dual Bachelor’s degrees in Political Science and Philosophy. She worked for several years in strategic communications for the international development sector of the federal government, and this experience grew her passion for travel and learning about other cultures. KD is delighted to work with Farm Fresh RI, shifting her career towards supporting the future of our global and local food systems. Jillian Caruso Harvest Kitchen Education Manager ☓ Jillian Caruso Jillian was born and raised in Warwick, RI; recently, she moved to Canterbury, CT. She attended and recently graduated the Culinary Institute of America in Hyde Park, NY with a BPS in Applied Food Studies. She has worked her entire life in kitchen and this is a refreshing new beginning for her. Jillian is passionate about her garden, reading, and her two nieces. Jillian is excited to start her career in nonprofits at Farm Fresh RI. Jesse Rye Executive Director ☓ Jesse Rye Jesse Rye is the Executive Director of Farm Fresh Rhode Island. He has been with Farm Fresh RI since 2012, and in that time has helped to scale and support the work of Farm Fresh both in Rhode Island and New England. In the last few years, Jesse helped the organization to navigate the major changes necessitated by the COVID-19 pandemic while moving the organization to a newly constructed food hub facility adjacent to downtown Providence. Jesse has experience on the community level as nonprofit manager; statewide as program director and communications specialist; and nationally as a researcher and advocate. Jesse as a part of Farm Fresh is determined to grow a local food system that values the environment, health, and quality of life of farmers and eaters. In addition to his work at Farm Fresh, Jesse has volunteered his time as a board member for Farm to Institution New England, Food Solutions New England, the Rhode Island Food Policy Council, and Red Tomato. Rob Andreozzi Board of Directors Owner, Pizza Marvin ☓ Rob Andreozzi As a restaurant owner, Farm Fresh makes it possible to connect with local farmers in a meaningful way. Utilizing Market Mobile allows me to focus on growing my restaurant and building my team while still being able to support the best local farms at the same time. While Market Mobile is the program I interact with most frequently, I look forward to contributing my energy and passion into supporting and advocating for the success of each of the initiatives that Farm Fresh has to offer the community. Stephanie Pike Farm and Sea to School Director ☓ Stephanie Pike Stephanie was born and raised in Rhode Island and loves to be surrounded by good food and good people. She is a Registered Dietitian who received her training from URI and Keene State College, and has always focused her efforts on community nutrition and food insecurity. Stephanie’s career and personal paths have led her to work, volunteer, and educate in many community-based settings with a variety of groups. She believes in the power of food to create lasting change and strives to support communities in meaningful food and food systems exploration and learning. Molly Ellis Assistant Director of Business & Administration ☓ Molly Ellis Molly is a lifelong Rhode Islander. She started out as a volunteer for Farm Fresh RI at the Wintertime Farmers Market in Pawtucket in 2008, and continued through various work study programs and AmeriCorps VISTA terms before becoming a full-time staff member in 2013. Since then, she has managed at least six different farmers markets, become an expert in tent repair, and helped to administer our federal FINI grant that provides funding for the Bonus Bucks program. In her free time, Molly enjoys folk music and dance as well as gardening. Jane Sabatini Board of Directors, Co-Chair Retired Certified Public Accountant ☓ Jane Sabatini “The mission of Farm Fresh RI is powerful to me — bringing local food to all communities and making fresh, local, healthy food affordable. I’m also impressed with its emphasis on nutrition education for all age groups from children to seniors; I believe this outreach is vital if we are to address the growing obesity and related health issues in our society. I hope to be able to help in advancing these objectives.” Thea Upham Nutrition Incentive Projects Director ☓ Thea Upham Thea moved to Providence in 2004 to attend Johnson & Wales University and graduated with a degree in Food Service Entrepreneurship. She has spent the past 10 years working with food in different capacities — as a chef, farmers market vendor, and farm hand — and has always been mindful of linking her work to the larger local food system. She firmly believes that the decisions we make about what we eat and where it comes from can have great impacts on the health and welfare of our local community. Thea ties these ideals into her work at Farm Fresh RI every day. Aoife Lee Bird Events and Administrative Associate ☓ Aoife Lee Bird Aoife Bird loves the woods, the plants, and all things food. Born and raised in New England, wild foraging in the woods and waters alongside her mom, she spent the last many years communing with the plants and wilds of the Pacific Northwest. Over the years she has been a caterer, a bookseller, a baker, an archivist, a (very) small-scale farmer, and a healer. Aoife earned her culinary degree from the New England Culinary Institute a million years ago and has since gone on to earn a degree in archaeology from the University of Oregon focusing on people’s use of plants, foods, and ritual. She continued on to gain a Master’s degree in East Asian Medicine from the Oregon College of Oriental Medicine as well as another in Nutrition from the National University of Natural Medicine. In addition, she has graduate certificates in Ecopsychology and in Sustainable Food Systems. She has extensive training in Western herbalism from the Arctos School of Botanical Medicine in Portland, OR, and loves to make medicine. She earned her Permaculture Design Certificate from the Permaculture Women’s Guild and is a member of the American Herbalist Guild, The American Anthropology Association, the American Nutrition Association, and the International Association of Culinary Professionals. Aoife recently returned to her home state of Rhode Island and brought with her a teenager daughter, a Newfoundland named Jeff, a Chihuahua named Sunny, a black kitty named Bitsie, and a baby kitten named Kiki. She loves to walk in the woods, talk to the plants, and explore all the grocery stores everywhere. Virginia Branch Board of Directors Principal Owner, Branch Architects ☓ Virginia Branch Jason Evans, Ph.D. Board of Directors Dean, Johnson & Wales University ☓ Jason Evans, Ph.D. Branden Lewis Board of Directors Chef & Professor, Johnson & Wales University ☓ Branden Lewis Kristine Merz Board of Directors Founder and CEO, Orange Square ☓ Kristine Merz “As board chair, I get to live my values that locally grown food is not only nutritious and delicious, but creates important economic opportunities, provides health benefits and community engagement, and reduces environmental impact. I am grateful for the opportunity to support leadership and staff in any way so that together we can achieve the mission and vision of this very important organization.” Taylor Jacobs Assistant Director of Grants & Data ☓ Taylor Jacobs Taylor grew up surrounded by family gardens — her grandparents even housed some chickens in their backyard. Always hearing her mother pine for the first tomatoes of the season, it wasn’t until a trip to Italy a few years ago that Taylor truly got it. On that trip, she spent five months volunteering on farms in Italy, Greece, and Japan. While trying her hand at making goat cheese, caring for emus, and milking cows, she lived the connection between farmers, animals, the land, and the food that we eat. After returning stateside, she began her Farm Fresh RI journey, first serving as an AmeriCorps VISTA member, and now acting as our Nutrition Education Associate. In her spare time, she loves illustrating, playing with her pet rats, and learning about cheesemaking. Rodolfo Lucero Market Mobile Driver ☓ Rodolfo Lucero Madeleine Pugsley Data Management Community Education AmeriCorps Direct Service Member ☓ Madeleine Pugsley Madeleine grew up in Los Angeles, cooking, singing, and staging elaborate home theatricals with their little sister. They moved to New Mexico to study philosophy and the history of science at St. John’s College, graduating in 2022. An avid bibliophile, they have worked as a private tutor, a college housing coordinator, and four years as a library assistant. In 2023, Madeleine was caught by the siren song of small-scale sustainable agriculture, moving to Maine to be a farm apprentice with MOFGA. They are thrilled to combine their passion for cooking, community, and mother earth’s gifts at Farm Fresh Rhode Island. Lily Harding Lead Community Educator ☓ Lily Harding Lily grew up in California, but she got attached to Providence while getting her Biology degree from Brown University. She believes that food is central to community, just and sustainable food systems are essential, and education should be accessible, relevant, and fun. Lily has loved working with kids at summer camps, and is so excited to engage youth in understanding food systems as part of the Community Education team at Farm Fresh RI! Outside of work, you’ll find Lily running, cooking, and doing crossword puzzles. Kelley McShane Board of Directors Managing Partner, The Granny Squibb Company ☓ Kelley McShane “It is an honor to work with people who are passionate about the Rhode Island food and beverage industry, supporting local business and farmers, and making sure that healthy food is accessible to all Rhode Islanders. Their work is more important now than ever. I am thrilled to be a part of Farm Fresh Rhode Island’s Board of Directors.” Andrea Aguilar Farmers Market Associate ☓ Andrea Aguilar Andrea grew up in New York and came to Providence to study culinary arts at Johnson & Wales University. After graduation, she took a gap year and went to work with her mom at her bakery, decorating cakes and then went to work at a bank. Now, Andrea wants to go back to school to pursue a Bachelor’s degree in children’s nutrition. In her free time, she likes to cook and bake for her family, tend to her garden, and have picnics in the park. Kiffen Ratkevich Market Mobile Sales Manager ☓ Kiffen Ratkevich A native of Newport, RI, Kiffen has long been passionate about food and his community. After cooking professionally for 10 years, he moved on to program and project management. Kiffen is excited to join Farm Fresh RI and be an active member of the sustainable and equitable food movement in Rhode Island. He enjoys cooking for his friends and family and spending time with his wife at the beach. Sean Kontos Harvest Kitchen Program Director ☓ Sean Kontos Sean is a native of Dover, NH, who has been working in the food service industry for 13 years. After graduating from Johnson & Wales University with a degree in culinary arts in 2011, he went on to cook around Nantucket and the seacoast of New Hampshire, focusing on local and sustainable cooking particularly tied to whole animal butchery. After backpacking through Europe, he and his now wife, moved to Providence where he worked at Local 121, eventually becoming head chef. Most recently, he helped open Farm & Coast Market in South Dartmouth, MA, as a butcher and chef. Sean started out as a volunteer with our RI Farm to School program until moving on to work with Harvest Kitchen. Caitlyn Goeden Farmers Market Associate ☓ Caitlyn Goeden Originally from Massachusetts, Caitlyn moved to Rhode Island in 2015 to attend Roger Williams University where she graduated with a degree in Criminal Justice. She loved Rhode Island so much, she decided to make it her home! While she works full time in field of victim services, Caitlyn wanted to become more involved and engaged in the greater-Providence community. She thought no better way to do that than to join the Farm Fresh Farmer’s Market Team! In her free time, Caitlyn enjoys cooking dinner, trying out new recipes, eating ice cream, and spending time in the sunshine. She is frequently making meals out of the random findings from the pantry and having themed picnics in the park with friends. Julie Rondot Farmers Market Program Manager ☓ Julie Rondot Originally from France, Julie Rondot moved to Rhode Island and joined Farm Fresh RI motivated by her desire to make healthy, local food accessible to everyone. With a degree in Communication and Human Resources, she previously worked as a communications manager and events coordinator in France. Eager to make a real impact and passionate about nature, she pivoted her career to the environmental sector where she campaigns for equitable access to local food. Outside of her professional pursuits, she finds pleasure in hiking, camping, and exploring nature. She hopes to help others rediscover and reconnect to nature’s natural beauty and bounty! John Auger Board of Directors, Co-Chair Managing Director IT projects, Blue Cross & Blue Shield of Rhode Island ☓ John Auger “I believe access to fresh and local food is key to addressing many of the health, economic, and environmental issues we face in our communities and our nation. Farm Fresh RI has been on the leading edge of tackling these challenges for years. The organization’s focus on availability of local and affordable foods, its nutrition education programs, and efforts to improve the impact of food production on our environment are critical steps to achieving a healthy farm to fork community. I’m appreciative of the opportunity to be part of the Farm Fresh RI team, and I look forward to participating in advancing the values and mission they represent.” Caroline Grand Associate Director of Marketing ☓ Caroline Grand A native of New Orleans, Louisiana, Caroline was raised with a love for both the culinary arts and local ecosystems. She grew up duck hunting, fishing, beekeeping, raising chickens, and tending to her family garden, where she developed a deep appreciation for both cultivated crops and wild flora. After graduating with a Master of Arts in English Literature from Northeastern University, Caroline honed her skills in both writing and pedagogy to develop marketing initiatives for an alternative educational retreat in New York City. As an adoptive New Englander, she is thrilled to marry her professional skills and personal passions at Farm Fresh Rhode Island for the betterment of the community she lives in and loves. In her free time, Caroline enjoys reading, cooking, knitting, plant foraging, and printmaking. Nancy Reiter Board of Directors Retired, Former Senior Technical Director and Lean/Six Sigma Black Belt, AT&T ☓ Nancy Reiter I came to Farm Fresh RI as a volunteer gleaner with Hope’s Harvest.  The concept of eliminating food waste at the source and making fresh, local produce available to all Rhode Island residents became my passion.  Understanding the larger picture, I am proud to devote my time, hands, knowledge, and skills to Farm Fresh to further the vision of a robust local food chain accessible to all. Rob Glover Farmers Market Technology Specialist ☓ Rob Glover Rob’s introduction to agriculture came about through working on small farms in the WWOOF program, where they discovered their love for the field. Their eventual goal is to run their own farm to help provide wholesome food for their community and help foster a love of farming in others. They have worked throughout many different levels of the production chain in local food enterprises, building skills to help them realize this dream. Rob is excited to bring those skills to Farm Fresh RI, where they strive to support local farmers and help strengthen a sustainable, resilient, and equitable food system in Rhode Island. Allison Fleet Board of Directors Partner, Partridge, Snow & Hahn LLP ☓ Allison Fleet Diego Juarez Building Security & Maintenance Events Associate ☓ Diego Juarez Hurricayne Cabral Market Mobile Program Director ☓ Hurricayne Cabral Hurricayne has lived in the Providence area his whole life, graduating from Shea High School in Pawtucket. He started working at Farm Fresh RI in 2018, and since then has grown a strong appreciation for local farmers — in particular, for all the hard work they do every day. Cayne loves working at Farm Fresh and getting products from those local farmers and producers out into the community in many different ways — from delivery to some of the top restaurants in Rhode Island to bringing fresh food right to someone’s front door. When he’s not working hard at Farm Fresh, Cayne enjoys spending quality time with family and friends. He also loves to travel, having visited several different countries and states… and counting! Charreese Braxton Harvest Kitchen Production Manager ☓ Charreese Braxton Charreese was born and raised in Philadelphia, PA. She moved to Providence to attend Johnson & Wales University in 2016. She graduated with a B.S. in Food Service Management with a focus in Food Sustainability in 2020. Since moving to Providence she has worked in various restaurants, getting her feet wet in the industry, which got her involved in working with local products from farms in the New England area. Sheila Brush Board of Directors, Secretary Retired, Former Director of Programs, Grow Smart RI ☓ Sheila Brush “Farm Fresh Rhode Island does two things that I care deeply about — supporting and strengthening our local farms and working to ensure that all Rhode Islanders, regardless of income, can enjoy the benefits of healthy local food. I have long admired the way Farm Fresh uses resources creatively, effectively, and efficiently to achieve its mission. As Farm Fresh launches new and exciting initiatives, I welcome the opportunity to help advance its work.” Mathew Lamoore Market Mobile Fleet and Facilities Manager ☓ Mathew Lamoore Rigoberto Ogubando Market Mobile Driver's Assistant ☓ Rigoberto Ogubando Cassidee Jones Community Education Manager ☓ Cassidee Jones Native to Alabama, Cassidee grew up spending time outside with family, from fishing to gardening to demolishing a watermelon daily (or so it seemed). Everything about life in rural AL was centered around agriculture and poverty, resulting in a food desert. Cassidee decided that there had to be more, so she went in search of an answer at Auburn University, receiving a degree in history as well as political science focusing on African history and food politics, with a minor in sustainability. Her studies combined with five years in the service industry led her to pursue a Masters in Food Security and International Development from the University of Sussex in England. She began working with international organizations to support access to products to treat malnutrition, but involvement in her community garden and a desire to tackle root causes of food injustice led her to Farm Fresh RI. Now she pursues her passion by day and her million hobbies by night, including pottery, tufting, home renovation, cycling, swimming, and more. Danielle Demers Harvest Kitchen Markets & Cafe Coordinator ☓ Danielle Demers Danielle, Dani for short, was born and raised in Attleboro, MA, and now is a native of Warwick, RI. Before joining the Farm Fresh RI team, she worked for Sodexo food services for six years as a rounds chef and caterer. Danielle loves cooking with a passion. She also loves the outdoors, her houseplants. and her three dogs!  Danielle looks forward to helping out the community and working with the Farm Fresh family at Harvest Kitchen. John Gray Community Events Director & Co-Locator Liaison ☓ John Gray Whether in Iowa where he was born and raised, New York city where he cut his teeth in the hospitality industry or now in Providence where he’s laid roots, connecting with people through food has always been at the center of the table in John’s life. Over the past two decades, John developed a deep appreciation for serving the highest quality ingredients with the highest quality service while working for some amazing restaurant groups including the Momofuku group in NYC and The Eddy here in PVD. His last foray in the service industry provided the opportunity to achieve a lifelong passion as an owner/operator of Saint Monday on the west side. Most recently, John worked in the Development office of College Unbound, located right up the street on Federal Hill. He hopes to utilize all those varied skills (maybe add a little song and dance from his theater days) in building community and connections through Farm Fresh RI. Farm Fresh Rhode Island is an Equal Opportunity Provider CONTACT 401–312–4250 10 Sims Ave, unit 103 Providence, RI 02909 LOCAL FOOD RESOURCES RI Farmers Markets Guide Double Your SNAP/EBT Order Local Food Volunteer with Us Ag Exchange Public Forum GET WEEKLY NEWS © 2025 · Farm Fresh Rhode Island · Credits · Design & Development by // DESIGN AGENCY // VISIT US ▼ Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS ▼ Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT ▼ Mission History Staff & Board Job Opportunities SUPPORT ▼ Donate Asparagus Fest Local Food Fest Volunteer NEWS"
    },
    {
      "url": "https://chieflandfleamarket.com/contact-us/",
      "text": "Contact Us – chieflandfarmersfleamarket.com Add Listing 0 You have no bookmark. Your Wishlist : 0 listings Sign In Home About US FAQ’s Testimonial Contact Us Become a Vendor Marketplace Talk to a Human We promise, your message won’t disappear into the abyss. We’re standing by and ready to help with any questions, comments, or thoughts you may have. Address 1206 N Young Blvd US HWY 19 Chiefland, FL 32626 Phone 352-493-2022 Business Hours: Friday: 8:00 AM - 3:00 PM Saturday: 8:00 AM - 3:00 PM Sunday: 8:00 AM - 3:00 PM Discover Unique Finds and Support Local Businesses Home About Us FAQ’s Home About Us FAQ’s Testimonial Contact Us Marketplace Testimonial Contact Us Marketplace Quick Links 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 (352) 493-2022 vicki@chieflandfarmersfleamarket.com Facebook Privacy Policy | Term & Condition | FAQ Copyright © 2024 Designed by James Lynch Marketing. All rights reserved. Welcome to Chiefland Hub . Login Register Username or Email Address * Password * Log In Remember me Lost Your Password? Account details will be confirmed via email. Username * You can use letters, numbers and periods and at least 6 characters or more Email Address * Make sure to enter all lowercase letters for your email address Register as author By using the website, you accept the terms and conditions Consent to processing of personal data Register or Reset Password Username or Email Address * Get New Password"
    },
    {
      "url": "https://www.chieflandfarmersfleamarket.com/Become-A-Vendor",
      "text": "HOME ABOUT FAQ's Featured Vendors TESTIMONIAL CONTACT US Become A Vendor Vendor Application Our Vendors Marketplace Welcome to Become a Dealer at Chiefland Farmers Flea Market Join our vibrant community and showcase your products to a wide audience Apply Now Celebrate Community, Shop Local, Support America Visit Us About Us Why Become a Dealer? At Chiefland Farmers Flea Market, we offer a unique platform for vendors to reach a diverse group of customers. Whether you’re selling handmade crafts, fresh produce, antiques, or specialty goods, our market provides the perfect environment for your business to thrive. Join us and become part of our lively and supportive community. Business Hours Friday: 8:00 AM - 3:00 PM Saturday: 8:00 AM - 3:00 PM Sunday: 8:00 AM - 3:00 PM Address: 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 Benefits of Becoming a Dealer Access to a large and diverse customer base Affordable booth rental rates Opportunities for promotion through our marketing channels Supportive and friendly vendor community Regular events and activities to boost foot traffic Steps to Become a Dealer How to Become a Dealer. Follow these simple steps to join our vibrant community and start showcasing your products at Chiefland Farmers Flea Market. Steps 1). Fill Out the Application Form: Complete the online application form with your business details and product information. 2). Submit Required Documents: Provide any necessary documentation, such as business licenses or permits. 3). Review and Approval: Our team will review your application and get back to you within a few business days. 4). Set Up Your Booth: Once approved, you can set up your booth at the market and start selling! Apply Now POPULAR QUESTIONS Get Answers to Your Questions What are the requirements to become a dealer? You need to fill out the application form and provide any necessary documentation, such as business licenses or permits. How much does it cost to rent a booth? Booth rental rates are affordable and vary depending on the size and location. Starting price is $14 Contact us for specific pricing. What types of products can I sell? We welcome a wide range of products, including handmade crafts, fresh produce, antiques, collectibles, and specialty goods. When can I set up my booth? Once your application is approved, you can set up your booth during our market operating hours. How do you promote the market and its dealers? We promote the market through our website, social media channels, email newsletters, and local advertising. Dealers also have the opportunity to be featured in our vendor spotlight videos. TESTIMONIALS What Vendors Says About Us Discover Unique Finds and Support Local Businesses Quick Links Home About Us FAQ's Testimonials Blog-Coming soon Quick Links 1206 N Young Blvd US HWY 19, Chiefland, FL 32626 (352) 493-2022 [email protected] Powered By James Lynch Marketing Privacy Policy | Term & Condition | FAQ Copyright © 2024 Designed by James Lynch Marketing. All rights reserved."
    }
  ]
}