{
  "fuentes": [
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room/connect",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room/connect",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://broadbrookbrewing.com/about/",
      "email": "info@broadbrookbrewing.com"
    },
    {
      "url": "https://broadbrookbrewing.com/about/",
      "email": "info@broadbrookbrewing.com"
    },
    {
      "url": "https://broadbrookbrewing.com/about/",
      "email": "info@broadbrookbrewing.com"
    },
    {
      "url": "https://flacarshows.com/events/venues/great-chicago-fire-brewery-tap-room-20161124134740/",
      "email": "info@flacarshows.com"
    },
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://leesburgbikefest.com/venue/great-chicago-fire/",
      "email": "specialevents@leesburgflorida.gov"
    },
    {
      "url": "https://leesburgbikefest.com/venue/great-chicago-fire/",
      "email": "specialevents@leesburgflorida.gov"
    }
  ],
  "mails": [
    "directory@guidetoflorida.com",
    "info@broadbrookbrewing.com",
    "info@flacarshows.com",
    "name@yoursite.com",
    "specialevents@leesburgflorida.gov"
  ],
  "nombre_sitio": "chifibrew.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room/connect",
      "text": "Contact Great Chicago Fire Brewery & Tap Room, Food & Drink in Leesburg, Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Leesburg Food & Drink Great Chicago Fire Brewery & Tap Room Send a Message Contact Great Chicago Fire Brewery & Tap Room Name * Email Phone Number Preferred Reply Day Preferred Reply Day As soon as possible Sunday Monday Tuesday Wednesday Thursday Friday Saturday ?> Preferred Reply Time Preferred Reply Time As soon as possible 12:00 am 1:00 am 2:00 am 3:00 am 4:00 am 5:00 am 6:00 am 7:00 am 8:00 am 9:00 am 10:00 am 11:00 am 12:00 pm 1:00 pm 2:00 pm 3:00  pm 4:00 pm 5:00 pm 6:00 pm 7:00 pm 8:00 pm 9:00 pm 10:00 pm 11:00 pm * Location Message The security check was not completed successfully. Back to Listing Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://broadbrookbrewing.com/about/",
      "text": "About Us | Broad Brook Brewing Co. | Brewery | Tap Room | Patio Dining ↓ Skip to Main Content Broad Brook Brewing Company 915 South Street Suffield, CT 06078 860.623.1000 info@BroadBrookBrewing.com Hours of Operation: Mon: Closed Tues: Closed Wed: 4 PM – 9 PM Thu: 4 PM – 9 PM Fri: 11:30 AM – 9 PM Sat: 11:30 AM – 9 PM Sun: 11:30 AM – 8 PM Main Navigation Menu Home About Us Beers From Our Kitchen On Tap Brewery Contact News About Us Facebook Twitter Instagram Youtube About Broad Brook Brewing Company Born out of a garage in Broad Brook, Connecticut – Broad Brook Brewing Company got its start as a weekend hobby at Tom’s house. Home brewing was the perfect excuse to invite friends to watch sports and tinker with recipes. Eventually these gatherings became quite large and brews such as Broad Brook Ale became popular around town. After much insistence from friends and family to open an actual brewery, Tom and Eric teamed up with other home-brewing childhood pals and began entering beer competitions… and they started winning. By the time Broad Brook Brewing made it’s official debut in East Windsor in October 2013, we had already built a loyal fan base. After a few years “on tour” with a handful of award winning beers at Beer Festivals around Greater Hartford and Springfield, we opened our first brewery and taproom location in Sofia’s Plaza. Grand Opening Day was met with a line of local fans stretching out the door, ready to sample our beer in a real tap room. 241 Mug Club Memberships sold out the very first day. Soon the “beer boom” hit. It took only two and a half years to smash our ten year projections, outgrowing the facility. We simply couldn’t brew beer fast enough to keep up with demand from customers, bars, and distributors. In order to keep all of Connecticut & Western Mass stocked with our 30+ styles, we had to expand. After an exhaustive search for a larger facility in our home town, it was clear we needed to construct a brand new brewery. We found a property just across the CT River, and quickly began construction in Suffield, CT. Met with a multitude of challenges during construction, forces beyond our control led us to leave our first location in December 2017, prior to completion of the new building. More delays demanded that we get creative to stay alive. Our friends at Stony Creek Brewery were gracious enough to brew our three most popular styles and keep shelves stocked while we completed the project. The owners and staff had to return to their day jobs, and there were sometimes doubts that we would ever return. But after 30 months of being the brewery without a home, we hammered the final nails and opened for business in June 2020. (Right in the middle of a global pandemic.) Thanks to the support of our community, customers, and loyal beer fans, we have returned! Our new brewery and taproom at 915 South St, Suffield CT is now open for limited indoor + patio seating, just North of Bradley Airport. Our new facility is capable of brewing over 13,000 barrels a year, and packaging 300% more cans than previously possible. Our Mug Club has expanded to 300 members and we now have a full kitchen. Our new Executive Chef, Derek, has created a brand new menu offering brick oven pizzas, sandwiches, wings, charcuterie plates, and more. Our food menu changes frequently and many items are made with our current beers infused into the recipe. When the lock-downs lift, we plan to have beer dinners, breakfast, live music, yoga, comedy, and private parties. We are so excited just to be brewing beer again and can’t wait for you to visit the new taproom. Follow our social media pages for details on phased re-opening, food offerings, beer releases, events, and expanding hours. You can also sign up for our Newsletter .  Thank you for all of your patience and support. It wouldn’t have been possible without you. We are back, cheers! Our state of the art facility features two brewing systems, a 30 Barrel production system where we make almost 1000 gallons in a batch along with our 3 Barrel pilot system that makes 90 gallons in a batch. Quick Links About Us On Tap From Our Kitchen Beers Brewery Contact News About Us On Tap From Our Kitchen Beers Brewery Contact News Contact Us 915 South Street Suffield, CT  06078 860.623.1000 Info@BroadBrookBrewing.com Facebook Twitter Instagram Youtube ©  2025 Broad Brook Brewing Company"
    },
    {
      "url": "https://flacarshows.com/events/venues/great-chicago-fire-brewery-tap-room-20161124134740/",
      "text": "Great Chicago Fire Brewery & Tap Room | FLA Car Shows Navigation Menu Home Shows & Cruises Central Florida East Coast Florida Northeast Florida Northwest Florida Southeast Florida Southwest Florida West Coast Florida Event Regions Map Cars and Coffee Sort By Day Monday Tuesday Wednesday Thursday Friday Saturday Sunday Classics For Sale Sell Your Classic Submit Event Advertise Info Clubs Submit Your Club AACA Camaro Corvette Mopar Mustang Central Florida East Coast of Florida Northeast Florida Northwest Florida Southeast Florida Southwest Florida Statewide West Coast of Florida Odds N’ Ends FCS Monthly Car Show in a Box My Location My Events Contact Follow us on Facebook Follow us on Instagram Home » Great Chicago Fire Brewery & Tap Room Top Leaderboard Top Leaderboard PC 2 Top Leaderboard Mobile 2 Top Leaderboard 3 Featured Events at: Great Chicago Fire Brewery & Tap Room Cool Cars Under the Stars September 18, 2025 5:00 pm Venue: Great Chicago Fire Brewery & Tap Room Categories: Central Florida , Recurring , Thursday Every month on the third Thursday.  The event is in a well lit and spacious parking lot. There is also great exposure from Main Street in historic downtown Leesburg on the corner of 3rd and Magnolia Street.  Open to all cars & trucks.  Our live entertainment plays all the hits you love and we have prizes for the best cars and trucks in several different categories. Great Chicago style food, pizza, full bar, Indoor and outdoor seating and more. Cool Cars Under the Stars October 16, 2025 5:00 pm Venue: Great Chicago Fire Brewery & Tap Room Categories: Central Florida , Recurring , Thursday Every month on the third Thursday.  The event is in a well lit and spacious parking lot. There is also great exposure from Main Street in historic downtown Leesburg on the corner of 3rd and Magnolia Street.  Open to all cars & trucks.  Our live entertainment plays all the hits you love and we have prizes for the best cars and trucks in several different categories. Great Chicago style food, pizza, full bar, Indoor and outdoor seating and more. Cool Cars Under the Stars November 20, 2025 5:00 pm Venue: Great Chicago Fire Brewery & Tap Room Categories: Central Florida , Recurring , Thursday Every month on the third Thursday.  The event is in a well lit and spacious parking lot. There is also great exposure from Main Street in historic downtown Leesburg on the corner of 3rd and Magnolia Street.  Open to all cars & trucks.  Our live entertainment plays all the hits you love and we have prizes for the best cars and trucks in several different categories. Great Chicago style food, pizza, full bar, Indoor and outdoor seating and more. Cool Cars Under the Stars December 18, 2025 5:00 pm Venue: Great Chicago Fire Brewery & Tap Room Categories: Central Florida , Recurring , Thursday Every month on the third Thursday.  The event is in a well lit and spacious parking lot. There is also great exposure from Main Street in historic downtown Leesburg on the corner of 3rd and Magnolia Street.  Open to all cars & trucks.  Our live entertainment plays all the hits you love and we have prizes for the best cars and trucks in several different categories. Great Chicago style food, pizza, full bar, Indoor and outdoor seating and more. Search Events Search for: Event Calendar September 2025 S M T W T F S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 « Aug Oct » Featured Events (click on banner for details) Sunset & Plantation Walk Shows Sponsored Search Events Search for: Event Calendar September 2025 S M T W T F S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 « Aug Oct » Featured Events Featured Experts Sponsored Featured Event Featured Expert Advertise With Us Want to promote your car show or automotive business? With 2 MILLION page views per year, advertising with us is a great way to reach your local target audience. Interested in getting started? Email us at info@flacarshows.com or call us at (407) 617-4201 Promote My Business Copyright © 2025 | FLACarShows.com | Sitemap Pin It on Pinterest"
    },
    {
      "url": "https://guidetoflorida.com/leesburg/food-drink/great-chicago-fire-brewery-tap-room",
      "text": "Great Chicago Fire Brewery & Tap Room - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Leesburg Food & Drink Great Chicago Fire Brewery & Tap Room Great Chicago Fire Brewery & Tap Room Share Breweries 311 W Magnolia St., Leesburg, Florida, 34748 Send Message 352-474-2739 Vote for Us! | Breweries Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Great Chicago Fire Brewery & Tap Room Visit Website https://chifibrew.com/ Online Social Profiles Phone Number 352-474-2739 Location 311 W Magnolia St. Leesburg , Florida , 34748 United States About Great Chicago Fire Brewery & Tap Room LEESBURG BREWERY WITH A CHICAGO FLAIR COME JOIN US……. The Great Chicago Fire Brewery & Tap Room, Leesburg Florida This a fun, friendly place to hang with friends and to me new ones. Our Chicago/Firefighter themed Tap Room offers 10 of our own hand-crafted beers brewed on premise. Enjoy our spacious outdoor beer garden and street side outdoor seating. Our daily menu can be compared to any one of a 100 hot dog joints in Chicago. Real Italian Beefs with Giardiniera peppers. Italian Sausage with sweet peppers. Maxwell Street Polish Sausage with grilled onions. Gyros off the spit with tomatoes, onions, and fresh tzatziki sauce. I can’t forget the original Chicago Hot Dog. All beef with onions, neon green relish, tomatoes, mustard, a pickle slice, sport peppers and celery salt. (Never any ketchup!) Meatball Subs with I Italian meatballs, our homemade marinara, topped with melted fresh mozzarella cheese, Pizza Puffs. Chicago Pizza goodness all wrapped up in dough and fried to perfection and last but not least, real Tom Tom Brand Tamales. We have added a true Thin Crust Chicago Pizza to our menu. A cracker thin crust with our own pizza sauce to the edge. We add your favorite toppings like Italian Sausage or Pepperoni and then cover it all with fresh Mozzarella Cheese. The crust and the cheese are baked to a golden brown and it is cut into squares, not slices. (Tavern cut) Now let’s talk about our beer. We brew “drinkable” beers. Simple beers that everyone can enjoy because we realize not everyone is a craft beer aficionado. Brewing in small batches, we can be creative, but not crazy in our beer choices. Craft beer not your thing? We also have many domestic beers, full liquor, and a selection of wines for your enjoyment. There is our \"Cool Cars Under the Stars\" cruise in on the Third Thursday of every month and our Downtown Leesburg Bike Night sponsored by our great friends @ GATOR HARLEY-DAVIDSON on the second Thursday of every month. We have plenty of parking and we are located in Historic Downtown Leesburg, which offers a great shopping experience with specialty shops, antique stores, and a host of unique food and drink establishments. It’s definitely worth the trip from Orlando or the Villages. Out on your motorcycle and need a bite to eat or to wet your whistle, this is the place! × Map View Get Directions Cancel FEATURED LISTINGS! LIME Fresh Mexican Grill Plantation, FL 33324 Website (407) 383-5015 Cherry Pocket Steak & Seafood Shak Lake Wales, FL 33898 Website 8634392031 Two Guys To Go Bradenton, FL 34207 Website 941-806-85-72 READ AND REAP! Dinner with a View (And Maybe a Gator) Therapy That Feels Human, Not Scripted Bon Voyage Without the Baggage MORE TO EXPLORE! Best of Florida Voting Best Breweries in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://leesburgbikefest.com/venue/great-chicago-fire/",
      "text": "Great Chicago Fire Brewery Stage - Leesburg Bikefest 2026 Skip to content Toggle Navigation VENDORS 2025 EVENTS Budweiser Main stage Gator Harley Stage on Market St. Other Events LODGING HOTELS MOTELS CAMPING & RV PARKS SHOP BIKEFEST Toggle Navigation INSURANCE INFO & GUIDES VIP ACCESS ANCHORED IN HEALTH EVENT MAP LEESBURG BIKEFEST SHUTTLE MAP PARKING & STREET CLOSURES BIKEFEST MEDIA LOCAL PARTNERS CONTACT LEESBURG BIKEFEST NEWSLETTER Toggle Navigation LEESBURG BIKEFEST 2025 SHOP BIKEFEST EVENTS BUDWEISER MAIN STAGE GATOR HARLEY OM MARKET ST OTHER EVENTS VIP ACCESS LOCAL PARTNERS LEESBURG BIKEFEST VENDORS INSURANCE LODGING HOTELS & MOTELS CAMPING & RV PARKS INFO & GUIDES EVENT MAP ANCHORED IN HEALTH LEESBURG BIKEFEST SHUTTLE MAP PARKING & STREET CLOSURES CONTACT US LEESBURG BIKEFEST NEWSLETTER akersadmin 2025-09-10T00:00:00-04:00 0 events found. 2024 Events Notice There are no upcoming events. Notice There are no upcoming events. Great Chicago Fire Brewery Stage Events Venues Great Chicago Fire Brewery Stage Address 311 W Magnolia Leesburg , FL 34748 United States Get Directions Phone 3524742739 Website https://chifibrew.com/ Brewery & Tap Room Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file 2025 Sponsors If you have questions, inquiries or please contact us. SHOP BIKEFEST Leesburg Special Events 401 W. Magnolia St Leesburg, FL 34749 (352) 365-0053 specialevents@leesburgflorida.gov The Bikefest logo is a protected trademark and is owned by the city of Leesburg, Florida. Any unauthorized use, reproduction, or modification of the logo for commercial purposes, advertising, or sales without prior written consent is strictly prohibited. We take trademark infringement seriously, and legal action will be pursued against any unauthorized use. To request permission to use the logo, please contact us at SpecialEvents@LeesburgFlorida.gov Your Name Your Email Subject Message Submit Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × © Copyright 1997 - 2025 |   Design by Akers Media |   All Rights Reserved Page load link Go to Top"
    }
  ]
}