{
  "fuentes": [
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "andrew.junker@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "d.s.wu@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "john.frisbie@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "katherine.rosenberg@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "leslie.stone@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "michelle.averitt@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "richard.czekalski@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "theresa.mcdonald@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "y.lin@yale.edu"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-boston@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-chicago@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-dc@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-hongkong@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-newhaven@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-newyork@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-sf@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-singapore@yalechina.org"
    },
    {
      "url": "https://www.yalechina.org/who-we-are",
      "email": "ys-twincities@yalechina.org"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "bg_contactus@2x.f840b616.png"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "contact@jet-logistics.com"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "group-marketing@jtexpress.com"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "hr@jtexpress.com"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "image_china@2x.82b7de43.png"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "legal@jtexpress.com"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "pc_banner_contactus@2x.0b008e3f.png"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "pr@jtexpress.com"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "email": "yuncangkhzc@jtexpress.com"
    },
    {
      "url": "https://www.research-china.org/who-we-are",
      "email": "brianstuy@research-china.org"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "carson.lokey@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "kayla.lewis@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "alyssa.perry@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "amanda.clegg@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "austen.bowman@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "benjamin.cadigan@wmtv15news.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "brandon.terry@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "christopher.wolf@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "cody.butler@graymedia.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "daja.clayton@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "jacob.rongholt@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "kayla.lewis@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "madison.glaser@wctv.tv"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "mistie.webb@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "olivia.eisenhauer@gray.tv"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "ryan.turbeville@gray.tv"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "vincent.mutone@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com",
      "email": "wyatt.turbeville@wcjb.com"
    }
  ],
  "mails": [
    "alyssa.perry@wcjb.com",
    "amanda.clegg@wcjb.com",
    "andrew.junker@yale.edu",
    "austen.bowman@wcjb.com",
    "benjamin.cadigan@wmtv15news.com",
    "bg_contactus@2x.f840b616.png",
    "brandon.terry@wcjb.com",
    "brianstuy@research-china.org",
    "carson.lokey@wcjb.com",
    "christopher.wolf@wcjb.com",
    "cody.butler@graymedia.com",
    "contact@jet-logistics.com",
    "d.s.wu@yale.edu",
    "daja.clayton@wcjb.com",
    "group-marketing@jtexpress.com",
    "hr@jtexpress.com",
    "image_china@2x.82b7de43.png",
    "info@reception-plus.de",
    "jacob.rongholt@wcjb.com",
    "john.frisbie@yale.edu",
    "katherine.rosenberg@yale.edu",
    "kayla.lewis@wcjb.com",
    "legal@jtexpress.com",
    "leslie.stone@yale.edu",
    "madison.glaser@wctv.tv",
    "michelle.averitt@yale.edu",
    "mistie.webb@wcjb.com",
    "olivia.eisenhauer@gray.tv",
    "pc_banner_contactus@2x.0b008e3f.png",
    "pr@jtexpress.com",
    "publicfile@wcjb.com",
    "richard.czekalski@yale.edu",
    "ryan.turbeville@gray.tv",
    "theresa.mcdonald@yale.edu",
    "vincent.mutone@wcjb.com",
    "wyatt.turbeville@wcjb.com",
    "y.lin@yale.edu",
    "ys-boston@yalechina.org",
    "ys-chicago@yalechina.org",
    "ys-dc@yalechina.org",
    "ys-hongkong@yalechina.org",
    "ys-newhaven@yalechina.org",
    "ys-newyork@yalechina.org",
    "ys-sf@yalechina.org",
    "ys-singapore@yalechina.org",
    "ys-twincities@yalechina.org",
    "yuncangkhzc@jtexpress.com"
  ],
  "nombre_sitio": "chinaexpressalachua.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.yalechina.org/who-we-are",
      "text": "Staff — Yale-China Cart 0 About Programs Give 中文 Back Staff Trustees Trustee Resources What we do Contact Us Back All Programs Arts Education Health Back Donate Special Funds Back 关于我们 雅礼项目 雅礼35基金 Cart 0 About Staff Trustees Trustee Resources What we do Contact Us Programs All Programs Arts Education Health Changing lives since 1901 Give Donate Special Funds 中文 关于我们 雅礼项目 雅礼35基金 Mission Yale-China (雅礼协会) bridges the United States and China through collaborative partnerships in education, healthcare, and the arts. We believe in global citizens who have experienced daily life and language, friendships, professional cooperation and insights in a very different culture—as a way to discover commonality and respect for people who seem different from ourselves. We believe that developing a community of such global citizens on both sides is crucial to a prosperous, healthy and safe 21st century, in which the U.S.—China relationship is one of the most important engines of cooperation, growth and peace. The Yale-China community has modeled this vision for 120 years. Staff John Frisbie President John Frisbie joined Yale-China as President in 2021. Prior to that, he worked at Hills and Company, established by Yale alumna and former US Trade Representative Carla Hills, where he was one of five principals advising corporate clients on global trade issues. Before that, for fourteen years John was President of the US-China Business Council (USCBC), America’s premier trade association for assisting American companies who trade with or invest in China. In that role John was responsible for USCBC’s overall strategic direction and its operations in Washington, Beijing, and Shanghai while reporting to a board of directors composed of Fortune 500 CEOs. John’s relationship with China long predates his leadership of USCBC. He first visited China as a student in 1981 and has traveled widely throughout the country. He lived in Beijing from 1988 to 1996, first directing USCBC’s China operations and then joining General Electric. He subsequently moved to Singapore for GE for four years, covering China and the Asia-Pacific region before returning to the United States in 2000. John graduated magna cum laude/Phi Beta Kappa from the University of Texas at Austin, from which he also received his MBA with concentrations in finance and international business. John is proficient in Mandarin Chinese and has many years of experience managing and working with American and Chinese partners and staff. John met his wife, Tricia, in Beijing, where she had also been a student and then worked in sales and marketing roles for American companies. They have two teenage children and are happy with the move to the New Haven area and being closer to Tricia’s family in New England. john.frisbie@yale.edu Michelle Averitt Manager of Branding & Communications Michelle Averitt is the caretaker of Yale-China’s visual identity. Michelle creates Yale-China’s visual content and communications, working with the staff to tell the stories of the past 100 years and stories of today. Michelle joined Yale-China in 2007. Michelle’s diverse background includes experience in retail, customer service, administrative assistance, desktop publishing, and she proudly served in the United States Air Force. Michelle is an experienced graphic designer and photographer, and her freelance photography has appeared in local Connecticut media and online. michelle.averitt@yale.edu Rich Czekalski Director of Finance & Operations Rich joined Yale-China in 2022 and currently serves as the Director of Finance and Operations. In this role, Rich provides leadership and accountability for financial and administrative functions in support of the mission and work of Yale-China. His responsibilities include managing the annual budget, implementing internal controls, maintaining the accounting records and financial reporting function, and providing administrative support and guidance for the proper operational maintenance of Yale-China. Prior to joining Yale-China, Rich served in various roles at Yale New Haven Health System in Corporate Finance. While there, he assisted in financial reporting and budget functions, including revenue maximization. During his time, Rich also provided guidance to finance leadership on strategic initiatives, process improvements, and local volunteering activities. Rich holds a Bachelor of Science in Business Administration with a concentration in accounting, as well as a Master’s in Business Administration from Southern Connecticut State University. When not working, Rich loves to play tennis and basketball, and is an active member within his community, supporting organizations such as the local YMCA and Polish National Alliance Club. richard.czekalski@yale.edu +1 203 432 8460 Andrew Junker Regional Director, Mainland China and Hong Kong SAR Andrew Junker (Yale PhD) joined Yale-China as the Hong Kong Director in 2018 and brings extensive experience both in academia and the NGO sector. He has strong ties to Yale and wide-ranging work experience in China, Hong Kong and other parts of Asia. Prior to his current role as Hong Kong Director, Andy worked for Yale-China in the New Haven office, serving as Director of Teaching Programs and Exchanges from 2000 to 2005. In addition to his PhD (2012) in sociology from Yale University, Andy also has an MA in religious studies from Indiana University and BA in East Asian studies from Wesleyan University. Prior to returning to Yale-China in January 2018, Andy taught sociology for more than five years, including four years at the University of Chicago. Andy is the author of Becoming Activists in Global China: Social Movements in the Chinese Diaspora (Cambridge University Press, 2019). His articles have appeared in Mobilization , Sociology of Religion , the American Journal of Cultural Sociology , and elsewhere. Andy’s work at Yale-China includes leading our collaborations with New Asia College at The Chinese University of Hong Kong (CUHK), teaching in the CUHK sociology department, overseeing the Yale-China Fellowship in Hong Kong and China, and developing Yale-China’s partnerships and programmatic opportunities in western Hunan, especially Yuanling County. andrew.junker@yale.edu +852 3943 1751 (HK) Yin Lin Program Officer, Health and Education Yin Lin joined Yale-China in 2025 as a Health Programs Officer. In this role, she supports the development and implementation of ongoing and new health programs in China and New Haven. Yin brings four years of experience in international education and exchange, specifically between the U.S. and China. In her previous role as an international student coordinator, Yin has successfully guided hundreds of students from around the world in their pursuit of high school education in the U.S. Northeast. Yin holds a BS from Syracuse University and an MS in Nutrition from the University of Southern Mississippi, and she received graduate training in Epidemiology at the Medical University of South Carolina. Originally from Taiyuan, Shanxi, Yin moved to the United States in 2008. She is a proud mom of two and enjoys spending quality time with her family. Her children have been actively involved in Yale-China's Lunarfest in previous years. y.lin@yale.edu +1 203 436 8363 Theresa McDonald Administrative Assistant and Office Manager Theresa McDonald joined Yale-China in 2024 to provide administrative support for the organization’s overall operations. Prior to Yale-China, Theresa developed proficiency in administrative support, customer service, team management, and data entry. Theresa’s connection to China was established when she was born in Zhejiang, China. She was adopted and grew up in an Irish household. A few years later, she returned to China with her mother to adopt her sister. Theresa has always felt a pull towards learning more about the country and its people. In 2017, she studied at Peking University in Beijing to complete CIEE’s Summer Intensive Chinese Language Program. Theresa holds a Bachelor of Fine Arts in Animation, as well as a minor in Chinese Language from Rochester Institute of Technology. theresa.mcdonald@yale.edu +1 203 432 0884 Kate Rosenberg Deputy Director of Education Programs Kate Rosenberg joined the Yale-China staff in August 2022 and works as a Senior Program Officer supporting Yale-China’s education programming. Prior to this, she served as a Yale-China Fellow teaching English in China at Xiuning High School Anhui from 2018-2020, and at Yali High School in Changsha from 2021-2022 as the Doug Murray Senior Fellow. In the interim, she worked as the Director of Delivery Fulfillment for the Covid-response non-profit Invisible Hands Deliver. Kate also previously served as a Yale-China Chinese Teaching Fellow, teaching Chinese to middle school students in New Haven public schools. She holds a B.A. in linguistics from Yale University. katherine.rosenberg@yale.edu +1 203 432 3866 Leslie Stone Vice President and Director of Education Programs Leslie Stone joined Yale-China in 2011 to manage the portfolio of fellowships, exchanges and internships that comprise Yale-China’s Education Program. Prior to joining Yale-China, she served for ten years as executive director of the Lingnan Foundation where she is most proud of supporting the development of liberal education in South China and establishing the W.T. Chan Fellowships Program. She earlier held positions at the Institute of International Education (IIE), WorldTeach, Inc., Prince George’s County Public Schools, and the Nanjing Aeronautical Institute. Leslie serves as a member of the advisory board for Lingnan University’s Office of Service Learning in Hong Kong. She holds an MA in Chinese Studies from the University of Michigan and a BA from Bowdoin College. leslie.stone@yale.edu +1 203 432 1771 Di Wu Director of Health Programs Di Wu joined Yale-China in 2024 as the Director of Health Programs, bringing her experience in medical humanities research and global nonprofit practice. She holds a PhD in medical anthropology from the Massachusetts Institute of Technology (MIT), specializing in disability studies, health equity, rehabilitation and assistive technology, and qualitative research methods. Prior to joining Yale-China, Di led the disability portfolio at the United Nations Development Programme (UNDP) in China, where she supported China’s efforts to implement the United Nations Convention on the Rights of Persons with Disabilities (UNCRPD) and scaled up a train-the-trainer program on disability competence for key decision-makers. She later served as the principal investigator for a national baseline study on disability inclusion in China commissioned by UNESCO, assessing the health system, accessibility, and social services for people with disabilities and chronic conditions. Her scholarly work has been funded by the National Science Foundation, the Wenner-Gren Foundation, and the American Ethnological Society, and has been published in Technology and Culture , IEEE Annals of the History of Computing , and Review of Disability Studies , among others. Di is a native of Jiangsu Province and holds a BA from Nanjing University and an MSc from the University of Oxford. d.s.wu@yale.edu                         +1 203 432 7766 Meet our Board of Trustees Board of Trustees Advisers, Consultants, and Volunteers Michael Leibenluft Consultant, Arts Program Hannah Yuan Chen Program Assistant Dr. CAO Ya Advisor to the Yale-China Board Mark Sheldon Roving Ambassador Chris Young Yali Society Co-Chair AJ Chen Yali Society Co-Chair Yali Society Regional Coordinators Veronica Zhang Boston Coordinator Caroline Grossman Chicago Coordinator Hugh Sullivan D.C. Area Coordinator Andrew Fennell Hong Kong Coordinator Brendan Woo New Haven Coordinator Jeremy Kutner and Jonathan Lowet New York Co-Coordinators John Tang San Francisco Coordinator Adam Click Singapore Coordinator Jan Kleinman Yali Society Twin Cities Coordinator A Condensed Yale-China History Since 1901, the Yale-China community has been devoted to bridging our two countries through respectful service, immersive learning, teaching, training, institution-building, and ambitious collaborations. The 120-year history of the Yale-China Association —called “Yale-in-China” for much of the 20th century—represents a rare, inspirational, and ongoing commitment by hundreds of thousands of American and Chinese people to improve the world together. Representatives of the two parties to innovative Xiang-ya Agreement: Doctors. F.C. Yen and Edward Hume (first and second from right) representing Yale-in-China, with officials from the Hunan government Early Yale-China Founded in 1901 by Yale graduates and faculty in response to the suffering of the Boxer Rebellion, the early goals of Yale-in-China were to bring modern education and medicine to China. Choosing a more remote area unfamiliar with foreigners, Hunan Province, in order to have a deeper impact, Yale representatives arrived in 1903 and rapidly began to build trust and a reputation for practical and modern education and medical care. In a few years, partnering with their Chinese colleagues and local officials, Yale-in-China established a series of remarkable educational institutions. In 1906, they founded the Yali Union Middle School, which became the famous Yali High School. In the same year, they opened central China’s first Western Medicine clinic, which became the “Xiang-Ya” or “Hunan-Yale” Hospital. They founded China’s first Nursing College, followed by Xiangya School of Medicine, and then a full campus of Yale College in Hunan that lasted for a decade. In the late 1920s, they co-founded Huazhong Normal University in Wuhan. Historian Reuben Holden wrote: “The establishment of Yale-in-China was a logical outgrowth, and its purpose was to provide an education which would be the equivalent of that secured at Yale in New Haven, an education which would also be based in part on the best of the ancient culture of the East.” By the start of the 20th Century, Yale had well-established connections with China. Yale graduate Dr. Peter Parker had founded the first Western-style hospital, the Ophthalmic Canton Pok Tsai Hospital, in 1835. The first Chinese graduate of any American college was Rong Hong (Yung Wing) 容閎 who graduated with honor from Yale in 1854. He was followed by young men of the Chinese Educational Mission (1872-1881), who traveled to New England to attend American colleges, especially Yale. Most returned to China to become leading scholars, engineers and officials; prominent among them were diplomat Liang Cheng 梁誠, Republican Premier Tang Shaoyi 唐紹儀, Admiral Cai Tinggan 蔡廷幹, and the father of China’s railroads, Zhan Tianyou 詹天佑. During the 20th century, Yale’s engagement with China deepened through the educational and medical work of the Yale-China Association, and the frequent flow of faculty and graduates between the New Haven and Changsha campuses. The Yale-in-China education and health institutions in Central China grew and flourished despite the tremendous tumult of the first half of the 20th century. The Yale-China community witnessed and survived the fall of the Qing Dynasty in 1911, political and xenophobic movements and warlords, the May Fourth Movement, rise of communism, the worldwide Depression, fires and epidemics in Hunan, the invasion by Japan in the 1930s, the devastation of World War II (including the destruction of Changsha by a massive fire in 1938 (文夕大火)), and finally the 1949 revolution that resulted in “New China.” Throughout these upheavals and dangers, Americans and Chinese worked alongside each other, graduating tens of thousands of students, nurses and doctors, rising to national prominence, and encountering Mao Zedong and Chiang Kai-shek—both of whom praised Xiangya Hospital. One of the most extraordinary developments of “this on-going idealistic enterprise” was the intentional transfer by the late 1920s of leadership of the educational and health institutions from Americans to local Chinese; fundraising and overall guidance remained the responsibility of a board based in New Haven. In the words of Ruth and Phillips Greene, who spent nearly thirty years at Yale-in-China (as an educator and surgeon, respectively): “From the beginning of his association with Yale-in-China, Dr. Edward Hume (胡美 ) had seen and stressed the importance of a shared responsibility between Chinese and Americans. He had lived it out in his close association with his colleague, Dr. Yan Fuqing (颜福庆). Together they had formulated the policies by which the medical work was largely locally self-supporting and, by 1926, the Governing Board of the Medical School was entirely Chinese. Yale-in-China and its first president were well ahead of their time.” “Sister Schools”—Students and teachers from Yali High School and New Haven’s Foote School, visit Yale-China Yali High School 雅礼中学 Founded in 1906, Yali (the name is an early transliteration of “Yale,” derived from the Analects of Confucius) graduated its first class in 1912. Over the following century, 70,000 more graduates followed. In recent years, Yali has ranked among China’s top high schools, with students regularly accepted to Tsinghua and Peking Universities, Oxford, Stanford, Yale, and other top universities. One long-running institution at Yali has been the placement of recent Yale graduates to serve as teachers of English language and American culture and society. More than 150 of these teachers—first called “Bachelors” and later “E.L.I.s” (English Language Instructors) and currently “Yale-China Fellows”—have added to Yali’s campus culture, high level of English language fluency, and international educational outlook. In the 21st century, Yali has grown into network of middle and high schools in Hunan. The partnership between Yale-China and Yali High School has expanded to include the establishment of four “sister school” relationships between Yali schools and schools in New Haven, including the Foote School, the Hopkins School, the John C. Daniels International School, and the ACES Educational Center for the Arts. Starting in 2014, Yale-China has coordinated for young faculty of Yali schools to come teach Chinese language and culture in New Haven public schools. Serving for the year, the Chinese Teaching Fellows parallel the long-running tradition of Yale-China Fellows going to schools in the Chinese mainland and Hong Kong, making the exchange of teachers fully two-directional. Xiangya Hospital and Xiangya Medical School (中南大学湘雅医院) Established in 1906 by Dr. Edward Hume and Yale-in-China, the “Yali Clinic” was one of the earliest Western medicine hospitals in China.  In 1910, Shanghai-born Dr. Yan Fuqing—the first Chinese graduate of Yale Medical School—joined Hume to run the hospital and build its local reputation. By 1915, a new hospital, the distinctive red building of Xiangya Hospital, was constructed outside the north gate of Changsha to house the combined hospital and Xiangya Medical College. This brought together medical education, medical care and nursing training. In October 1915, the Governor of Hunan, Tan Yankai, declared the new building “Xiangya Hospital.” Two years later, the American College of Surgeons accredited the hospital. In the ensuing decades of growth, Xiangya’s reputation was said to match that of the Rockefeller-supported Peking Union Medical College—a success captured by the phrase “In the South Xiangya, in the North Union.” During wartime (1937-1945), Xiangya cared for thousands of casualties, soldiers, officials and refugees, before moving in 1938 to escape the bombing and invasion of the city to Yuanling in western Hunan, and to Guiyang, Guizhou Province. Americans and Chinese on the hospital staff survived the vicissitudes of war together. American-trained medical staff, like Maude and Winston Pettus, nurse and chief surgeon respectively, worked alongside their Chinese colleagues, like Hospital Director Dr. H.C. Chang, managing to provide care, staff and medical supplies despite the constant dangers and uncertainties. When Xiangya Hospital and Medical College staff returned to Changsha in 1945, they found most of the campus destroyed by Japanese bombing. Hospital care resumed and continued throughout the period of revolution and the establishment of the People’s Republic in 1949. An American fundraising campaign led by Yale-educated magazine founder Henry Luce enabled the rebuilding of the hospital and campus, which was completed in 1951—just as the Korean War began. The new war meant that Americans and Chinese were now enemies, and all Americans had to depart China. The Xiangya Hospital and Medical School were nationalized and the long-time Chinese and American partners tragically lost communication with each other for three decades. Maude Pettus with two volunteers at the International Red Cross station in Guiyang In 1979, as soon as it was possible to do so with the re-establishment of Sino-American diplomatic ties, the Xiangya Hospital and Medical School and the Yale-China Association reached out to each other. Then called Hunan Medical College, the school had continued to grow, serve the population of Hunan, and advance its reputation with many famous medical professionals and many research and clinical firsts in China. Building on their earlier friendships and professional successes, the renewed Yale—Hunan partnership identified new forms of cooperation to meet China’s late-20th century needs. These included extensive training of medical professionals through lectures and short courses taught by Yale professors in Changsha and study by Xiangya physicians and professors who came to Yale. English-language training, provided by Yale-China Bachelors/ E.L.I.s/Fellows also played an important role, since English proficiency opened doors for study abroad and professional advancement. Areas of cooperation included pediatric cardiology, HIV/AIDS training, cooperation to create a manual for SARS care after the 2003-04 epidemic, and creation of the Yale-China Medical Journal. During the 2010s Yale and Xiangya medical faculty formed a special collaborative team to create a new Medical Residency Training curriculum and implementation program for China (a level of medical training that China had never had before). The new model that this team created was tested and implemented at Xiangya, then selected to be the official training program for Hunan, and finally was adopted for China’s national model—with an impact on China’s tens of thousands of MDs completing the final stages of their medical training each year. The creation of the model also ended up impacting Yale. Some of the evaluation criteria were incorporated into Yale’s own residency training program—a wonderful example of the increasingly two-directional, and mutually-beneficial relationship between Yale and Xiangya medical communities in the 21st century. Xiangya School of Nursing (中南大学湘雅护理学院) Ranked today as China’s number one school of nursing, and among the top 100 in the world, the introduction of nursing training began in 1909—prior to the founding of the Medical School, and the School was officially established in 1911, in the midst of the revolution that ended the Qing Dynasty. Yale-in-China’s establishment of the nursing school met an urgent need for assistants and attendants in the rapidly-growing Xiangya Hospital. There had been no equivalent role in traditional Chinese medicine, so the introduction of Western-style nursing essentially created a new profession in China. The Chinese word for nursing was coined at Xiangya. Both men and women made up the early classes, and soon Xiangya-trained nurses were in high demand across China. Yale-trained Nina Gage became the first dean of the School in Changsha, and later founded the Chinese Society of Nursing. By the time Maude Pettus served alongside her Chinese colleague nurses during World War II, the nursing profession was well-established and crucial to the expansion of Western medicine across China, and care for millions of patients throughout the war and subsequent years of revolution. After thirty years of isolation, when Yale-China and Xiangya re-connected in the 1980s and 90s, nursing again became a focus for collaboration and training. During the Era of Reform and Opening, exposure to modern American-style nursing was a revolutionary concept. Xiangya sought to catch up to world standards of medicine, which it swiftly accomplished. American and Chinese nurses led the way in the 1990s and 2000s when Yale-China introduced its highly-effective HIV/AIDS Train-the-Trainer Program in cooperation with Xiangya and Hunan Health authorities, eventually training tens of thousands of health professionals all across China. Following the school motto “Diligence, Honesty, Precision and Fortitude,” Xiangya today offers three levels of nursing education programs: baccalaureate, graduate, and doctorate nursing, with 30 full-time faculty ,168 part-time instructors, and practical learning in Xiangya’s three affiliated hospitals. Started in the late 1990s, Yale-China’s Chia Fellows Program provides an opportunity for women in the nursing and medical professions to study and engage in research at Yale—an effective launching pad for many of these women to rise to positions of leadership. Today, the School of Nursing is one of the 32 professional schools of Central South University in Changsha and continues to build its national and global reputation. In 2020, Xiangya nurses have been among leaders on the front lines of the fight against the coronavirus pandemic in Wuhan and nationwide. Yale College in China and Huazhong Normal University (华中师范大学) From 1917, Yale College had a flourishing academic campus in Hunan for a decade that was accredited by the state of Connecticut. The College included a high school preparatory department (Yali High School) and shared an American-style campus with the hospital and medical and nursing schools. New York-based architects Murphy and Dana rendered drawings for the campus design and the Yale-educated American philanthropist Edward Harkness provided funding for the modern Hospital building. In 1927, at a moment when turmoil in China briefly shut down the Yale-in-China enterprise, the Yale College in China came to an end. The “Yale College department” of Yale-in-China, with its faculty of mostly science and engineering professors, transferred to Wuhan one province to the north, and merged with several other universities ( Hua Chung College (华中大学), Chunghua University (私立武昌中华大学), and the Pedagogical College of Zhongyuan University)) to form Huazhong University. Huazhong University’s founding president was the legendary educator, Dr. Francis C.M. Wei, who served from 1924 to 1951. Huazhong went on to become one of China’s top universities—known as “Hua Shi”—and became a productive partner of Yale-China again in the 1980s and 90s, when the Yale-China Fellows program formed an exceptional English-language and American culture teaching program and produced an influential textbook, known as “Basic Training,” and later hosted the Guizishan Fellows program. Yale-in-China Bachelor Nelson Thayer teaching a class of undergraduates at New Asia College in Hong Kong, 1959. Observing from the back are, from left” Yang J-mei; Chien Mu, founder and president of the college;Alex Wu, a New Asia trustee; Tang Chun-I, dean ofthe college; British government official; C.L. Chien New Asia College (新亞書院) and Chinese University of Hong Kong (香港中文大學） In the early 1950s, the Yale-China Association embarked on a new partnership in Hong Kong, a territory then engulfed in a refugee crisis. No longer able to work in the mainland since the start of the Korean War, Yale-China was seeking a new way to fulfill its mission. The organization was introduced to a group of refugee scholars, led by eminent Confucian scholar Ch’ien Mu, who had launched a promising Chinese-language college that was in urgent need of connections and resources. Partnering with Yale-China, New Asia College began a rapid rise, growing five-fold in the next decade, and moving to new buildings in Farm Road in downtown Kowloon with funding from Yale-China and The Ford Foundation. Yale-China brought its “Bachelors” program of young American teachers to New Asia to promote English-language proficiency and student life activities. In the mid-1960s, New Asia joined with two other local colleges to become the Chinese University of Hong Kong at a new campus over the mountains at Shatin, in Hong Kong’s New Territories. Yale-China became an enthusiastic supporter and donor to the new university, contributing a health clinic, student life center, visitors’ hostel, language-teaching center, and supporting the internationalization of the campus through the launch of the “International Asian Studies Program” to bring foreign students to study at the campus. The special bond with New Asia College also continued. Bachelors (later called “E.L.I.s” and today known as “Fellows”) have taught English literature and American cultural studies now for nearly seven decades. Yale-China has sponsored scholarships and other opportunities for New Asia students, and Yale-China’s Hong Kong Director is resident on campus, teaching and engaging in campus life. In the mid-1990s, Yale-China launched the “American Studies Summer Institute” that ran at both the Chinese University and Yale campuses. And for more than 20 years, students at both New Asia and Yale College have competed for places on the popular annual exchange program known as “YUNA” (Yale University New Asia), which brings undergraduates to each other’s campuses for two weeks mid-year to experience different academic lives and cities. These brief but deep experiences have changed the course of many college careers and built lasting friendships. Going forward, Yale-China will find new paths and continue to deepen this transformative partnership with New Asia College, Chinese University, and Hong Kong. Yale-China’s Changing Names When the Association was founded in 1901 by Yale graduates and faculty, it was first envisioned as a missionary enterprise, part of a nation-wide movement seeking to improve the world through evangelism. Launched in memory of a classmate killed in the Boxer Rebellion, the ambitious endeavor to establish a Yale presence in China was first named “The Yale Mission.” However, by the time funds had been raised, a location decided upon (Changsha) and arrangements negotiated with both American and Chinese leaders, the goals had shifted from missionary work to education according to an early pamphlet: “In setting up an offshoot of Yale in the center of China, we leave the active evangelical work to the missionary bodies with which we are in hearty competition.” In December 1903, The New York Times reported that, “An entirely new idea in American foreign mission work is behind the venture which an association of well-known Yale alumni has just planned for China. Instead of preaching, the Yale China Mis­sion will limit its efforts to teaching. In­stead of going out among the Chinese armed with the Bible, the men who have taken up the venture will go armed with textbooks, grammars, histories. volumes on economics, on medical science, mer­cantile life, and natural science.”  By 1911, the Association changed its name to “College of Yale-in-China” to emphasize the strictly educational objective. While Christianity remained a part of the school’s “Yali Spirit,” it represented part of the ideal of moral behavior rather than efforts to make conversions. Yang Hao, one of Yale-China’s inaugural HKETONY Arts Fellows, leads a modern dance workshop with New Haven Ballet in 2015 During the subsequent four decades, the campus and Yale presence in Hunan grew rapidly and thrived, serving thousands of students, staff and patients throughout periods of unrest, warlords, student movements, invasion, and war. During these decades, Yale’s presence went by several names. Sometimes the entire Yale enterprise was known after the translation for Yale that referred more to its educational work, Ya-Li (雅礼) and sometimes better known for the Hospital and health schools, called Xiang-Ya (湘雅). In 1934, the organization officially changed its name to the Yale-in-China Association, and in 1975 it changed again to the Yale-China Association. The hyphen is significant, implying the equality of the American and Chinese partners, and the word “Association” speaks to the united community of Chinese and American people who have been touched and changed by the organization’s work. Today the organization and the community are often known simply as Yale-China. Yale-China in the New Century As both China and the United States change, Yale-China’s programs have adjusted to rapidly-shifting urgent needs—while maintaining the organization’s unbroken mission and “Yali Spirit.”  Our role as a positive and enthusiastic bridge between Chinese and American people seems more important than ever—in the present era of diplomatic tensions. Yale-China’s expertise in promoting medical and nursing excellence and collaborating to improve public health and build medical capacity has given us an extraordinary platform for doing still more. Through immersive learning experiences, voluntary service, and teaching language and culture, our education work transforms thousands of lives and trains global citizens. Today, Yale-China is exploring new ways to achieve its mission, bring people together, deepen tolerance and understanding, and solve societal problems together. To increase our impact, and to meet the urgent needs and changed circumstances of the 21st century, Yale-China has launched new collaborations, fellowships and exchanges. Our work is now envisioned as partnerships in New Haven, Hong Kong, Changsha, Kunming, and Xiuning with the benefits flowing in both directions across the Pacific. These include a growing arts program with Hong Kong artists and arts activators in residence at Yale, designed to support Hong Kong’s rising arts scene and new arts institutions. A Chinese Teaching Fellows Program also brings young professional teachers from Changsha and Hong Kong to New Haven to teach Chinese language and culture in American classrooms. Our annual Lunarfest celebration in New Haven now attracts close to 4,000 attendees across ten venues—the largest celebration of Lunar New Year in Connecticut. New health initiatives build capacity in public health, nursing and medical ethics in China, and support women in the health professions through the Chia Fellows programs at Yale and Xiangya. Since 2018, a new Autism Training initiative brings American expertise from the Yale Child Study Center and the Center for Children with Special Needs to our partner organizations in Hunan to meet an urgent need for a growing number of families with children on the autism spectrum. Our Residency Training program has now expanded beyond Hunan to become the national model for training of physicians across China, and the model has changed how residents are trained at Yale, too. During the COVID-19 pandemic, Yale-trained physicians and doctors were among the hundreds of Xiangya medical staff on the front lines caring for patients in Wuhan, and members of our community sent encouragement and PPEs to each other in both directions. Now we are starting an ambitious focus on solving health inequity in the villages and townships of China’s rural areas through a public health collaboration bringing together the resources and innovations of Xiangya, Yale, Jishou University (in Western Hunan) and the Hunan Health Commission—a new initiative called the Western Hunan Initiative to Improve Services at the Local Level—WHISL.   These are the initiatives that match needs and resources in our chosen areas of work—education, health, and arts—in Yale-China’s second century. Yale-China remains nimble and responsive to change, even as our core values have remain consistent across 120 years of partnership, service, and learning. Subscribe Sign up for our quarterly newsletter and special announcements. First Name Last Name Email Address Sign Up Thank you! About Staff Trustees What we do Financials News & Publications Careers Yali Society Xiangya Alumni 2019 Rebrand Contact Us Give Donate Special Funds 中文 关于我们 雅礼项目 雅礼35基金"
    },
    {
      "url": "https://www.jtexpress.com/en/contactUs",
      "text": "J&T Express - J&T Express J&T Express J&T Express 极兔速递 About Us Business Newsroom Sustainability People Investor Relations Contact Us English Country/Region arrow_drop_down Contacts Contact Us Customer Cooperation group-marketing@jtexpress.com Media Contact pr@jtexpress.com Human Resources hr@jtexpress.com Legal Compliance legal@jtexpress.com International Logistics contact@jet-logistics.com Cloud Warehouse yuncangkhzc@jtexpress.com For other issues such as ordering, checking or customer service, please visit the official website of the corresponding country. Offices China Indonesia Vietnam Malaysia Philippines Singapore Cambodia Thailand UAE Saudi Arabia Mexico Brazil Egypt China Address Room 1001, Block A, Building 5, No. 1777, Hualong Road, Huaxin, Qingpu District, Shanghai Telephone (+86)956025 About Us Business Newsroom Sustainability People Investor Relations Privacy Terms of Use ©2021-2023 J&T Global Express Limited (极兔速递环球有限公司) 沪ICP备2020025698号-1 沪公网安备 31011802004477号"
    },
    {
      "url": "https://www.research-china.org/who-we-are",
      "text": "Who We Are | Research-China.Org top of page The premier organization for obtaining information about the histories of children adopted from China Home About What We Do Who We Are Our Websites Services Finding Ads Orphanage Data Books Adoptee Assistance Birth Parent Search Analysis Orphanage Reliability Analysis Foster Family Location Program DNA Connect Blogs Contact Us More Use tab to navigate through the menu items. W ho We Are Brian & Longlan Stuy Brian is the owner of Research-China.Org, which he founded in 2001. He and his wife Longlan (Lan) have three daughters from China: Meikina, Meigon, and Meilan. Brian was actively involved in Families with Children from China-Utah for a number of years, including as president of the chapter. He has had many articles about adoption research appear in the Cumberland Law Review , Adoption Today Magazine, and various FCC publications. Aside from the research on China adoptions, Brian has had many historical articles published in literary journals and anthologies. Lan has worked with Brian since the inception of Research-China. She owned \"Longlan's Place\" on Shamian Island from 1996 until her marriage to Brian. She shares her vast knowledge and love of her home country with each family who works with Research-China, and is passionate about assisting the children who remain in China's orphanages. They also have many friends both in the United States and in China who help them out with various services, and they are grateful for their assistance. 801-766-1736 brianstuy@research-china.org 2001-2025 Research-China.Org Home | Contact Us | Terms of Use USA Mountain Time Zone Web Design and Maintenance by Wide Open Skies bottom of page"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * First E-Mail Nachricht E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.wcjb.com",
      "text": "WCJB | TV20 Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Archaeologists dig up more human remains at Cedar Key home Archaeologists have been sifting through dirt at a historic Cedar Key home, and they say they’ve already found three different sets of human remains. News Fans, players wear purple in honor of 16-year-old Dixie County student killed in US 19 wreck News Marion County School Board members hire search firm to help find next superintendent A Look Inside The Lodge, Ocala’s Rehab and Care Center Sponsored News Man found guilty of attempted murder of law enforcement set to serve three life sentences TOP HEADLINES News Reddick-Collier VPK scores highest in the state Updated : 7 hours ago | By Daja Clayton With 6,095 VPK programs across the state, Reddick-Collier Elementary School was ranked number one in Florida. Sports The Chomp List: Who is your Gator athlete of the week? Updated : 4 hours ago | By Jake Rongholt , Olivia Eisenhauer and Carson Lokey Vote for your favorite Gator athlete of the week. News Car crashes into restaurant in Starke, sends two to hospital Updated : 12 hours ago | By Ryan Wyatt Turbeville Emergency crews responded to a restaurant in Starke after a car crashed into the building News Live Oak veteran turns struggle into service with nonprofit Pop Smoke K9s for Veterans Updated : 13 hours ago | By Madison Glaser Elisha Perkins, a combat veteran, founded Pop Smoke K9s for Veterans, a nonprofit dedicated to training and donating service dogs to veterans battling PTSD, military sexual trauma, or traumatic brain injuries. News Hippodrome kicks off upcoming season Updated : 10 hours ago | By WCJB Staff From the cinema to the mainstage, The Hippodrome is gearing up for its upcoming season. News Firefighters repair gas leak in Marion County neighborhood after tree falls on large tank Updated : 10 hours ago | By WCJB Staff Marion County firefighters say a tree fell on a 120-gallon propane tank on Tuesday morning, causing a leak 7 DAY FORECAST LATEST VIDEO News Archaeologists dig up more human remains at Cedar Key home News Man found guilty of attempted murder of law enforcement set to serve three life sentences News Marion County school board members hire search firm to help find next superintendent News Community comes together to mourn Savannah Langford, reads one of her poems MORE NEWS News Suspected arsonist arrested for attempting to burn down a house in Lake City Updated : 14 hours ago | By WCJB Staff A month after a home was intentionally set on fire in Lake City, officers say they’ve arrested the man responsible News Gator defensive lineman Brendan Bett apologizes to USF player, team after spitting incident Updated : 19 hours ago | By WCJB Staff Bett apologized to USF player Cole Skinner as well as his teammates and fans in an Instagram post for his actions. News New RV and boat storage facility opens in Ocala Updated : 9 hours ago | By WCJB Staff Beacon RV and Boat Storage held its ribbon-cutting on Tuesday morning at its location on Southwest 38th Street near the airport. News Habitat for Humanity rebrands, expands to Levy County Updated : 11 hours ago | By WCJB Staff Habitat for Humanity of Citrus County is rebranding as Habitat for Humanity of the Nature Coast as it expands its geographic service area to include Levy County. Features University of Florida students created an application to help college students connect Updated : 9 hours ago | By WCJB Staff The app makes it easier for college students to get involved with organizations on campus. State Florida bear harvest permit applications open Friday Updated : 14 hours ago | By WCTV Staff Applicants can submit as many applications as they want during the submission period. News Community honors 16-year-old Dixie County student with volleyball game who died on US 19 Updated : 18 hours ago | By Alyssa Perry The community will honor her memory at the volleyball game. JV plays at 5:30 p.m. and varsity plays at 6:30 p.m. News Gainesville assistant principal receives Yale Educator Award Updated : 15 hours ago | By WCJB Staff Mallory Becker, assistant principal at Gainesville High School, received the 2025 Yale Educator Award. News Vehicle flips on I-10 in Live Oak, lanes blocked Updated : 19 hours ago | By WCJB Staff According to Florida 511, the crash happened on I-10 west just before mile marker 288. News 9-year-old arrested for bringing loaded gun on school bus in Ocala Updated : Sep. 8, 2025 at 6:14 PM EDT | By Ryan Wyatt Turbeville and Mistie Webb TV20 has obtained the arrest report for a 9-year-old accused of bringing a loaded gun on a school bus in Marion County on Monday morning Local Santa Fe High senior dies in motorcycle crash; hundreds show for memorial Updated : Sep. 8, 2025 at 6:02 PM EDT | By WCJB Staff Troopers say Jonathan “JP” Prior, 17, rear-ended an SUV in Union County, throwing him off his motorcycle Sports We Need To Vent: Steve Russell and Jake Rongholt breaks down the bizarre USF loss Updated : Sep. 8, 2025 at 10:13 PM EDT | By Jake Rongholt Why Jake Rongholt and Steve Russell are trying to solve the continued mystery of the disjointed Gator offense MORE NEWS News ‘We’ll miss it’: Bradford County WEAG radio show team announces retirement Updated : Sep. 8, 2025 at 8:27 PM EDT | By Kayla Lewis Chuck Kramer is retiring, and his show is ending later this fall. Sports Monday Night Volleyball: Buchholz earns a three-set sweep at Branford Updated : 14 hours ago | By Jake Rongholt The Buchholz volleyball team is making strides at Branford, winning its 2nd match of the year. News Newberry charter school to receive multi-million dollar loan from city Updated : Sep. 9, 2025 at 12:07 AM EDT | By WCJB Staff Newberry city leaders decided they will give a $2,000,000 loan to Newberry Community School. Sports TV20 Play of the Week Nominees for Week 3 Updated : Sep. 8, 2025 at 7:58 PM EDT | By WCJB Staff Cast your ballot for six nominees for the TV20 Play of the Week. News Putnam County man arrested after attacking son with knife Updated : 22 hours ago | By WCJB Staff Sheriff’s deputies say Shawn Tennant, 57, cut his son multiple times with a knife on Tuesday. Sports Russell Report: Does losing to USF in the Swamp derail the Gator chances of making the CFP? Updated : Sep. 8, 2025 at 3:52 PM EDT | By WCJB Staff Florida committed 11 penalties for a total of 103 yards after no penalties the week before. News Grand Jury issues indictments in 2 Baker County cases Updated : 22 hours ago | By WCJB Staff A grand jury issued indictments in two Baker County cases, one for the death of a teen and another for child sexual battery. News Houses could be built in downtown Lake City under new proposal Updated : Sep. 9, 2025 at 12:07 AM EDT | By WCJB Staff Homes would be built on 12 pieces of property owned by the Lake Shore Hospital Authority by a proposed “Lake City Housing Authority.” News Marion County man dies after deputy-involved shooting Updated : Sep. 8, 2025 at 4:02 PM EDT | By WCJB Staff Marion County sheriff’s deputies say the man they shot after a traffic stop died in the hospital. Sports Florida’s Brendan Bett planning to apologize to fans and the USF player he spit at during loss Updated : Sep. 8, 2025 at 4:37 PM EDT | By The Associated Press and MARK LONG Florida defensive lineman Brendan Bett was planning to apologize to teammates, fans and the player he spit at during an 18-16 loss to South Florida News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    }
  ]
}