{
  "fuentes": [
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "email": "7735302-en@2x.png"
    },
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "email": "map-poi@2x.png"
    },
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "email": "map@2x.jpg"
    },
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "email": "sales@routeyou.com"
    },
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "email": "settings-en@2x.png"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://www.sfpublicpress.org/about/",
      "email": "info@sfpublicpress.org"
    },
    {
      "url": "https://www.sfpublicpress.org/about/",
      "email": "inn-member-badge@2x.jpg"
    },
    {
      "url": "https://www.southernrailway.com/help-and-support/contact-us",
      "email": "customer.relations@nationalrail.co.uk"
    },
    {
      "url": "https://www.southernrailway.com/help-and-support/contact-us",
      "email": "info@railombudsman.org"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.washcomall.com/chipley",
      "email": "info@washcomall.com"
    },
    {
      "url": "https://www.wjhg.com/2025/04/26/chipley-station-celebrates-its-grand-opening/",
      "email": "jake.lynch@gray.tv"
    },
    {
      "url": "https://www.wjhg.com/2025/04/26/chipley-station-celebrates-its-grand-opening/",
      "email": "emmaleigh.clegg@gray.tv"
    },
    {
      "url": "https://www.wjhg.com/2025/04/26/chipley-station-celebrates-its-grand-opening/",
      "email": "news@wjhg.com"
    },
    {
      "url": "https://www.wjhg.com/2025/04/26/chipley-station-celebrates-its-grand-opening/",
      "email": "publicfile@wjhg.com"
    },
    {
      "url": "http://www.pmcgroup.biz/contactus.html",
      "email": "mchipley@pmcgroup.biz"
    },
    {
      "url": "http://www.pmcgroup.biz/contactus.html",
      "email": "pchipley@pmcgroup.biz"
    },
    {
      "url": "https://washingtoncounty.news/2025/04/22/chipley-station-to-host-grand-opening-april-25/",
      "email": "info@chipleystation.com"
    },
    {
      "url": "https://www.chipleypawnshop.com/contactus/",
      "email": "sales@chipleypawnshop.com"
    }
  ],
  "mails": [
    "7735302-en@2x.png",
    "contact@staffboard.de",
    "customer.relations@nationalrail.co.uk",
    "emmaleigh.clegg@gray.tv",
    "info@chipleystation.com",
    "info@railombudsman.org",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@sfpublicpress.org",
    "info@washcomall.com",
    "inn-member-badge@2x.jpg",
    "jake.lynch@gray.tv",
    "map-poi@2x.png",
    "map@2x.jpg",
    "mchipley@pmcgroup.biz",
    "news@wjhg.com",
    "pchipley@pmcgroup.biz",
    "publicfile@wjhg.com",
    "sales@chipleypawnshop.com",
    "sales@routeyou.com",
    "settings-en@2x.png"
  ],
  "nombre_sitio": "chipleystation.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.routeyou.com/en-us/location/view/51370806",
      "text": "Chipley station - Trainstation | RouteYou Take the tour RouteYou for professionals Language Log in Upgrade Search for a route Plan a route Nodes Offline Chipley station Source: Ebyabe Copyright: Creative Commons 3.0 Places of interest » United States » Washington » Chipley station Share Edit Share Save Add to route Copy link QR code Facebook Twitter Messenger WhatsApp Email Edit Classify Create Add data Route planner Description Chipley station is a former intercity railroad station in Chipley, Florida. It is currently the headquarters of the Washington County Historical Society. The grounds include two former train stations: the Louisville and Nashville Depot and Bill Lee Station. The station was served by Amtrak's Sunset Limited train until service was suspended after Hurricane Katrina struck in 2005. Amtrak has proposed reopening the station as part of a restored Sunset Limited route in the future. Chipley, Florida, named for William Dudley Chipley, came into existence as a stop on the Pensacola and Atlantic Railroad around 1882. The P&A was absorbed by the Louisville and Nashville Railroad, who built the Louisville and Nashville Depot in downtown Chipley. Later, rail service was moved to a smaller building close to the tracks, Bill Lee Station. This served as Chipley's stop on Amtrak's Sunset Limited until 2005, when Amtrak suspended the Sunset Limited east of New Orleans after Hurricane Katrina. The old L&N depot became a farmers' market and the headquarters of the Washington County Chamber of Commerce. In 2010, the Washington County Historical Society acquired the site, including both buildings, and adapted them as a museum and headquarters. Source Source: Wikipedia.org Copyright: Creative Commons 3.0 More information Wikipedia | | Public | German Contact information Statistics Quickly to Activities to do in surrounding Sights nearby Destinations close by Looking for routes that pass here? Nearby routes Advertisement Activities to do in surrounding Show all Select one of the most popular activities below or refine your search. - RouteYou Selections - Discover the most beautiful and popular trails in the area, carefully bundled into appropriate selections. Advertisement Source: Ebyabe Copyright: Creative Commons 3.0 Sights nearby Show all Select one of the most popular categories below or be inspired by our selections. - RouteYou Selections - Discover the most beautiful and popular attractions in the area, carefully bundled in appropriate selections. Destinations close by Advertisement Source: Ebyabe Copyright: Creative Commons 3.0 Plan your route With RouteYou, it's easy to create your own customised maps. Simply plot your route, add waypoints or nodes, add places of interest and places to eat and drink, and then easily share it with your family and friends. Route planner Route planner This place of interest on your website <iframe src=\"https://plugin.routeyou.com/poiviewer/free/?language=en&amp;params.poi.id=7735302\" width=\"100%\" height=\"600\" frameborder=\"0\" allowfullscreen></iframe> Create an account and keep exploring! Want to continue enjoying RouteYou? Log in or create a FREE account and get the most out of RouteYou. Features Guest Account Unlimited access to all routes Last viewed routes Plan your own routes Saving routes Log in with RouteYou account No RouteYou account yet? Register here PLUS The first 30 days are on us! Experience the freedom of exploration with RouteYou. Enjoy 30 days of plus features, absolutely free – no strings attached! Start your free trial No credit card required. Your trial ends automatically. No hassle, no risk! Features FREE PLUS Plan & search for a route Navigation instructions Export routes (GPX) No ads Offline navigation Show all Plus advantages Log in Choose a language Last viewed Upgrade Search for a route Plan a route Create a route Upload a route Record a route Places of interest Search for a place of interest Add a place of interest News Search for a news item Add a news item Events Search for an event Add an event Groups Search for a group Add a group Install the RouteYou app Partner channels Take the tour RouteYou for professionals Help About us Privacy policy Terms of use Advertise Become partner © 2006-2025 RouteYou Search for a route Near me My routes Saved routes Best rated routes Most popular routes Node routes Signposted routes Nature routes Classics Cultural routes City walks Partner routes Create a route Upload a route Record a route Hiking nodes Cycling nodes More than 10,100,000 routes More than 15,000,000 users More than 4,500,000 points of interest Plan a route Search for a route Upgrade Log in Address Kerkstraat 108 9050 Gentbrugge, Belgium Follow us Download the free app Contact Marketing & sales sales@routeyou.com General queries Contact our customer service team or visit our help center . © 2006-2025 RouteYou - www.routeyou.com"
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://www.sfpublicpress.org/about/",
      "text": "About Us - San Francisco Public Press Close Newsletter Donate Search for: Search News Open dropdown menu By Date Civic (Podcast) Homelessness Housing Health Environment Government & Politics More Categories Special Reports Open dropdown menu Exposed: The Human Radiation Experiments at Hunters Point November 2024 Voter Guide Overdose Crisis March 2024 SF Election Guide Reparations Coercive Control: Abuse That Leaves No Marks Left Out – Supportive Housing Public Housing in Private Hands Driving Home: Surviving the Housing Crisis Ride-Hailing’s Dark Data Data Privacy Renters vs. Veritas Remaking Rent Control Solving Homelessness: Part 2 Solving Homelessness: Ideas for Ending a Crisis Navigating Homelessness: Which Way Home? Bilingual Schools Sea Level Rise Open dropdown menu Sea Level Rise: First in a Series Sea Level Rise: 2nd in a Series Past Elections Projects Open dropdown menu November 2022 Election Guide June 2022 SF Election Guide February 2022 Voter Guide November 2020 SF Voter Guide 2019 Nonpartisan Election Guide Fall 2018 Election Special Election, June 2018 More Special Reports Civic (Podcast) KSFP Radio Newsletter Ways to Give About Open dropdown menu What We Do Who We Are Supporters Ethics Statement Diversity Statement From the Newsroom Newspaper (on hiatus) Open dropdown menu Back Issues Where to buy the newspaper Contact BlueSky YouTube Instagram Mastodon Linkedin Facebook Page X Threads Close Skip to content BlueSky YouTube Instagram Mastodon Linkedin Facebook Page X Threads San Francisco Public Press Independent, Nonprofit, In-Depth Local News Newsletter Donate Open Search Search for: Search Donate Menu News Open dropdown menu By Date Civic (Podcast) Homelessness Housing Health Environment Government & Politics More Categories Special Reports Open dropdown menu Exposed: The Human Radiation Experiments at Hunters Point November 2024 Voter Guide Overdose Crisis March 2024 SF Election Guide Reparations Coercive Control: Abuse That Leaves No Marks Left Out – Supportive Housing Public Housing in Private Hands Driving Home: Surviving the Housing Crisis Ride-Hailing’s Dark Data Data Privacy Renters vs. Veritas Remaking Rent Control Solving Homelessness: Part 2 Solving Homelessness: Ideas for Ending a Crisis Navigating Homelessness: Which Way Home? Bilingual Schools Sea Level Rise Open dropdown menu Sea Level Rise: First in a Series Sea Level Rise: 2nd in a Series Past Elections Projects Open dropdown menu November 2022 Election Guide June 2022 SF Election Guide February 2022 Voter Guide November 2020 SF Voter Guide 2019 Nonpartisan Election Guide Fall 2018 Election Special Election, June 2018 More Special Reports Civic (Podcast) KSFP Radio Newsletter Ways to Give About Open dropdown menu What We Do Who We Are Supporters Ethics Statement Diversity Statement From the Newsroom Newspaper (on hiatus) Open dropdown menu Back Issues Where to buy the newspaper Contact About Us What We Do The San Francisco Public Press is a nonprofit, noncommercial news organization that publishes independent public-interest journalism about under-covered topics, with a focus on historically under-served audiences. Online and on community radio station KSFP-FM and our “Civic” podcast, we offer local investigative and solutions reporting. Coverage areas include environmental protection, housing affordability, public health, transportation safety, homeless services, digital privacy, immigration and elections. Our values: We are a noncommercial publication and independent from corporate influence. We question those in power and amplify voices from underserved communities. We believe in bold storytelling, risk-taking and context-rich nonpartisan coverage that is free from political advocacy or institutional spin. We are conveners, bringing together diverse communities to listen, learn and collaborate on ways to address problems and effect change. “The mission of the San Francisco Public Press is to enrich civic life by producing investigative and solutions journalism that engages diverse audiences and promotes public accountability.” See also: “ Ethics and Business Practices ” and “ Doing Our Part to Dismantle Discrimination and Racism .” We are a proud member of the Institute for Nonprofit News, Local Independent Online News Publishers and the Association for Alternative Newsmedia. Who We Are BOARD OF DIRECTORS Lila LaHood — Executive Director, San Francisco Public Press Michael Stoll — Senior Editor & Co-Founder, San Francisco Public Press Patricia Bovan Campbell — Attorney (Board Secretary) David Cohn — Senior Director, Advance Digital (Board President) Neal Gorenflo — Founder, Shareable.net Lawrence Groo — Impact Investor Jaya Padmanabhan —Editor, USC Annenberg Center for Health Journalism Ricardo Sandoval Palos — Public Editor, PBS Peter Scheer — Director Emeritus, First Amendment Coalition STAFF Madison Alvarado — Reporter John Angelico — Web Producer Laura Wenus — Editor Mel Baker — KSFP Programming Director & “Civic” Producer Audrey Mei Yi Brown — Reporter, Report for America corps member Lisa Rudman — Development Director Sylvie Sturm — Reporter Liana Wilcox — “Civic” Associate Producer Zhe Wu — Reporter, California Local News fellow EDITORIAL CONTRIBUTORS Contributing journalists: Noah Arroyo , Rebecca Bowe, Kristi Coale , Yuri Nagano, Chris Roberts, Seth Rosenfeld , Viji Sundaram , Emily Wilson Research editor: Ambika Kandasamy Archival researcher: Stacey Carter Project editor: Steve Jones Copy editors: Michele Anderson, Richard Knee, Sherman Turntine Newspaper designer: Brooks Mencher Graphic artist: Reid Brown Crossword constructor: Andrea Carla Michaels BUSINESS & OPERATIONS Audio studio consultant: Phil Hartman Radio station consultants: William Ruck, Jeff Shaw Fundraising consultant: George Koster Supporters The San Francisco Public Press is a 501(c)3 nonprofit organization funded by donations from the public, community foundations and institutions focused on journalism and civic engagement. The Reva and David Logan Foundation is a Chicago-based family foundation that provides strategic grants to support social justice, the arts and investigative journalism both in Chicago and around the world. Dedicated to lasting support for the founders’ powerful and eclectic mix of grants. loganfdn.org The California Local News Fellowship program is a multi-year, state-funded initiative to support and strengthen local news reporting in California, with a focus on underserved communities. Each year, the program places up to 40 early-career journalism fellows in newsrooms throughout the state for two-year, full-time reporting positions. fellowships.journalism.berkeley.edu/cafellows/ Report for America is a national service program that places journalists in local newsrooms to report on undercovered issues and communities. It is an initiative of The GroundTruth Project, a nonprofit media organization, and is structured to harness the skills and idealism of an emerging group of journalists plus the creative spirit of local news organizations. reportforamerica.org The Nicholas B. Ottaway Foundation makes contributions to journalism programs and projects that improve the quality of journalism in all of its forms. It also supports programs that defend freedom of the press globally. nbofoundation.org Craig Newmark Philanthropies’ goal is to support and connect people and drive broad civic engagement, working to advance grassroots organizations that are effective and getting stuff done in areas that include: trustworthy journalism & the information ecosystem, voter protection, women in tech, and veterans & military families. craignewmarkphilanthropies.org The Pulitzer Center U.S. Local News Reporting Grants initiative is designed to help local U.S. newsrooms cover the big, underreported stories that affect us all — and through education and other outreach promote the public engagement that is essential if our democracy is to thrive. pulitzercenter.org The USC Annenberg Center for Health Journalism supports using journalism as a way to address the impact of systemic inequities on health and well-being. The center’s mission is to empower and equip journalists to tell stories in collaboration with communities, with depth, humility and rigor, not just to spur more enlightened policy or remedy long injustice, but as a means of helping communities to shape their own futures. centerforhealthjournalism.org Fund for Nonprofit News at the Miami Foundation administers the News Match , a national campaign to encourage grassroots support for nonprofit news organizations. The fund was established with grants from Democracy Fund, the John S. and James L. Knight Foundation, the John D. and Catherine T. MacArthur Foundation, the Jonathan Logan Family Foundation, Facebook Journalism Project and Ethics & Excellence in Journalism Foundation. miamifoundation.org & newsmatch.org The Fund for Investigative Journalism has helped to finance exposes of harmful and wrongful conduct, such as corruption at all levels of government; corporate, governmental and press nonfeasance, misfeasance and malfeasance; abuses of civil and human rights and of the environment; unsafe medical technologies; and improper donor influence on research in academe. fij.org The Institute for Nonprofit News consists of more than 450 nonprofit media organizations in North America. Our community shares best practices, collaborates on stories, pools resources and receives cutting-edge training in professional, organizational and business development. inn.org Past institutional funders have included the San Francisco Foundation, the James Irvine Foundation, ProPublica, Inasmuch Foundation, the Jay Pritzker Foundation, Investigative Editing Corps, Local Independent Online News Publishers, the Puffin Foundation, the Solutions Journalism Network, the California Endowment, the Ida B. Wells Fellowship sponsored by Type Investigations, the Society of Environmental Journalists, and the Jonathan Logan Family Foundation. Our members Media Reformer and Publisher Members ● $1,000 and above Annie Akin ● David and Keli Amann ● Eric Arbanovella ● Doug Beeferman ● Jennifer Braun and Raymond J. Ryan ● Camille Campbell ● Lydia Chavez and Mark Rabine ● Alex Christopher ● Mary Clayton ●  Mark and Suzanne Colodny ● Jake Donham and Katherine Hodge ● Susan Goldstein and Andy Kivel ● Lawrence Groo ● Sarah and Richard Hardy ● Scott James and Jerry Cain ● The Justice Fund donor advised fund ● Mary Jane Kelly ● Derek Kerr ● James LaHood ● Lila LaHood ● Marquita Bedway and Alger LaHood ● Michael LaHood and Elizabeth Pontikes ● Betsy Morris ● Sally Nunn Newson ● Howard and Jan Oringer ● Ricardo Sandoval Palos ● Elizabeth and Yassen Roussev ● Laurie Schecter ● Peter Scheer ● Stephen Silha ●  Judith and Stephen Stoll Family Fund ● Corey Stoll ● Smita Topolski ● Marty and Barbara Winter ● Alder Yarrow Editor Members ● $500 to $999 Laura Belzer ● Jean Bogiages ● Patricia Bovan Campbell ● Anna Budayr ● Mary Carp ● David and Megan Cohn ● Ronald Fisher ● William Fitzgerald ● Moritz Fliedner ● Tracy Freedman ● Golden Spertus Fund ● Neal Gorenflo ● Marge Harburg ● Oliver Hickman ● Ellison Horne ● Don H. ● Todd Katz ● David Cay Johnston and Jennifer Leonard ● Jennifer Loomis ● Mack Lundstrom ● Sharon O’Connor ● Jaya Padmanabhan ● David and Kelly Pascal ● Patricia and Rowland Rebele ● Bill and Andrea Robb ● Michael Siani-Rose ● Seth Rosenfeld ●  Vikram Krishnan and Mona Tekchandani ● Jamie Whitaker ● Julia Young Columnist Members ● $250 to $499 Ashford Family Charitable Fund at Fidelity ● Lee Azus ● Susan Adams ● Jean Amos ● Barbara and Richard Asche ● Elaine Beale and Suse Herting ● Emily Beaver ● Jennifer Betti ● Larry Bush ● Richard Champion ● Cyber Cat Catalyst Donor Advised Fund ● Richard DeLeon ● Jim Dupont and Pat Lamborn ● Michael Dowd ● Edward and Yukari Franzwa ● Monica Gandhi ● Deborah Gordon ● William B. Grant ● Tracy Grubbs and Richard Taylor ● David Hover ● Geri Koeppel ● Carol Kocivar and Terry Norbury ● John Meyer ● Jaya Padmanabhan ● The Marianne Palmer Donor Fund ● Nate Parsons ● Lawrence Patrick ● Leslie Guevarra and Richard Pestorich ● L.Ray Solidarity Fund ● Dennis Richards ● Kristina Rizga ● Josh Schiller ● Leslie David Schwabacher ● Julie Flynn Siler and Charlie Siler ● Yves Averous and Marc Smolowitz ● The Weisman Foundation ● Bruce Wilcox ● Dan Wood Beat Reporter Members ● $100 to $249 Anna Asebedo ● Michele Anderson ● Dennis and Kathleen Arroyo ● Mark Backman ● Peter Barnes ● Stella Barton ● Berit Baumberger ● Molly Bierman (Ryan)● Umbreen Bhatti and Kaizar Campwala ● Lisa Burger ● Nicole Carlson ● Martin Chai ● Timothy Covington ● Jennifer Cray ● Gerald Davidson ● Phyllis Deets ● Frances Dinkelspiel and Gary Wayne ● Peter Dragovich ● Jennifer Dunlop Fletcher ● Deirdre English ● Liz Enochs ● Osborn Erickson ● Steve Fainaru ● Jon Funabiki ● Julia Gallyot ● Daniel Gelfand Gregor ● Gentschev ● Birgitte and Art Gilliland ● Ted Glasser ● Catherine Hagan ● Elyce Haut ● Ariel Herm ● Sue Hestor ● Linda Himelstein ● Nicholas Hobbs ● Judith Hulka ● Laura Impellizzeri ● Ambika Kandasamy ● Diane Keaton ● Dorothy Kidd ● Max Klee ● Tatiana Kyriakides ● Connie Krosney ● Gregory LaHood ● Leah Levy ● Pat Lamborn ● Marie Libeson ● Paul Lin ● Ethan Lindsey ● Jeffrey Johnson and Jaime Lockwood ● Janet Lohr ● Robert Lowrey ● Sam Luks ● Roger Macdonald ● Christin Evans and Praveen Madan ● Sasha Magee ● Sheila Malkind ● Joe Mathewson ● Pat May ● John McManus ● Mark and Sara Meltzer ● Andrew Meranus ● Geri Migielicz ● Jennifer Miller ● Herbert F. Mintz II ● Auzie Mirhashemi ● Carmen Monedero ● Miranda Morris ● Sandra Neubauer ● David Keenan and Alice Mosley ● Judy Nadel ● Amy O’Hair ● John and Sara O’Neill ● Teresa Palmer ● Jennifer and Jerome Perarnaud ● Fran Petris ● Yesica Prado ● Deborah Quick ● Roberto Rondero De Mosier● Lisa Roth ● Stephen Sagar ● Joseph Gratz and Dinah Sanders ● Sadik Huseny and Doniece Sandoval ● Pamela Satterthwaite ● George Koster and Carol Savary ● Caroline Sayre ● David V. Johnson and Victoria Schlesinger ● Karen Schulkin ● Jane Shabaker ● Jacob Sigg ● Mike Skalnik ● Ellen Spertus ● Jacob Snow ● Ivy Marsh and Frank Stoll ● Peter Sussman ● John Swartley ● Diane Tate ● Dana Taylor ● Tina Chiu and Jonathan Toma ● Claire Veuthey ● Luis Villa ● Rafael Vranizan ● Glen Van Lehn and Teresa Welborn ● James Wheaton ● Selma Wilson ● Stacy Wolf ● Roland Wong ● Ellen Zhou ● Scott Zimmermann Cub Reporter Members ● $50 to $99 Anonymous (2) ● Arienne Adamcikova ● Nancy Aldrich-Ruenzel ● Holly Allen ● Mindy Aronoff ● Cristina Azocar ● Cortney Balzan ● Jake Barlow ● Nina Barron ● Steve Beatty ● Lynda Beigel ● Charles Belov ● Anne Bluethenthal ● Rachel Brahinsky ● Louis Bryan ● Y’Anad Burrell ● Raymond Buscemi ● Chorel Centers ● Chris Clayman ● Bradley Cleveland ● Nathan Collins ● Julie Connery ● Arthur Corbin ● Aaron Cowdin ● Jonté Craighead ● Richard Darrough ● Catherine De Heer ● Erin Diehm ● Judy and Thomas Dunworth ● Laurie Earp ● Shary Eiser ● Kathy Emery ● Killian Escobedo ● Richard Everhart ● Jennifer Farris ● Tzipporah Z Fischer ● Cullen Frandsen ● Maureen Futtner ● Lisa Galli ● Max Garrone ● Adi Givens ● Cole Goins ● Thomas Hayden ● Paula Hendricks ● Amanda Hickman ● Patrick Hillas ● Matthew Hirsch ● Christopher Ho ● Frank Holland ● Peter Hosey ● Amy Huang ● Lewis Hurwitz ● Bill Barry and Joan Jacobson ● Patty Jaundzems ● Linda Jue ● Jo Ellen Kaiser ● Joshua Kalven ● Joel Kamisher ● Yukari Kane ● Leslie Katz ● Hye-Jin Kim ● Jordan Klein ● Paul Kleyman ● Carolyn and Richard Knee ● Mary Anne LaHood ● Joanne Ladolcetta ● Rosa Lara-Fernandez ● Dhyana Levey ● Jean Lindgren ● Alexis Linton ● Zak Long ● Andy Lynch ● Donna and Marty Mackowski ● Mary Magee ● Viki Maxwell ● Marianne McCarthy ● Robert McClure ● Erika McDonald ● Nicolas Menard ● Daniel Merer ● Mary Miller ● David Mitchell ● Janet Monaghan ● Laura Moorhead ● Prashanth Mundkur ● Jo Marie Munnich  ● Alicia Neumann ● Mabel Ng ● Henry Norr ● Mary Catherine O’Connor ● Cherilyn Oshiro ● Andrew Page ● Hoa Phan ● Yvonne Pingue ● Dolores Piper ● Mary Catherine Plunkett ● Rebecca Pontikes ● Jason Prado ● Megan Prelinger ● Clare Prowse ● Elizabeth Rapp ● Stephen Revilak and Julie Rioux ● Mary Ellen and Anthony Riff ● Regina Rivard ● Rebecca Rosen Lum ● San Francisco Public Library ● Rahmin Sarabi ● Elena Schmid ● Felisa Preskill and Zachary Scholz ● Elijah Selby ●  Kai Seymour ● Joseph Stokes ● Jeremy Smith ● Jackson Solway ● Lance Starin ● P-R Stark ● Denise Stavis Levine ● Carl Stein ● Tom Stites ● Anne Suskind ● Ruth Tam ● Lisa Tehrani ● Jason Tester ● Darby Thomas ● Sarah Twitchell ● Lorri Ungaretti ● Giselle Velazquez ● Rina Weisman ● Laura Wenus ● Bob Weston ● Joseph Wetzel ● Leon Barnard and Shinwha Whang ● Brenda White ● Robert Wilson ● Danny Yadegar ● Yao Yue ● Olga Zilberbourg Newsie Members ● Up to $49 Gina and Tyler Alioto ● Serena Allen ● Susan Atwood ● Joel Aufrecht ● Mary Baca ● Christopher Berry ● Simon Bertrang ● Leigh Biddlecome ● Sue Blankman ● Deetje Boler ● Stacy Bond ● Bruce Bowen ● Mary Bugnon ● Judith Calson ● Ann Campbell ● James Campbell ● Marc Capobianco ● Lage Carlson ● Chris Carlsson ● Janet Carpinelli ● Jui Chakravorty ● Doria Charlson ● Krisann Chasarik ● Marian and Charlie Chatfield-Taylor ● Michael Childs ● Hae Min Cho ● Linda Christenson ● Jessica Closson ● Alison Cohen ● Kathleen Coll ● Karen Coppock ● Joseph R. Coriz ● Paul Cox ● Karlotta Bartholomew and Aubrey Cramer ● Sue Cross ● Jennelle Crothers ● James Custer ● James Dahlgren ● Kevin Davis ● Neil DeJong ● Mary DeLapa ● Lucas Della Bella ● Nicole Diaconoff ● Jon Diamond ● John Diehl ● Emmy Diep ● Joy D’Ovidio ● Sharon Eberhardt ● Mechanics’ Institute Library ● London Elise ● Adam Elman ● Alice Estrup ● Anthony Fest ● Michelle Fitzhugh-Craig ● Catherine Foo ● Michael Freeman ● Amanda Fried ● Daren Garshelis ● Judy Goddess ● Francine Goodwin ● Kari Gray ● David Greene ● Justine Gubar ● Delphine Halgand ● Jackie Hasa ● Steven Hendrix ● Bonnie Hobbs ● Adnan and Amy Iftekhar ● Cecil Jack ● KR Jacks ● Michael Joe ● Lisa Kadyk ● Paul Kagawa ● Stephen Koch ● Rajesh Krishnan ● Alfie Kulzick ● Deborah Kwan ● Jerry and Mary Caye Lagomarsino ● Jennifer Lane ● Robin Larsen ● Eric Lukoff ● Mary Magee ● Patrick Maley ● Ellen Manchester ● Eric Mar ● Wendy Marlatt ● Paul Marking ● Eduardo Martinez ● Rob McLean ● Michael Melez ● Andrea Carla Michaels ● Gayle and George Mills ● Eleanor Molloy ● Deborah Nagle-Burks ● Don Neuwirth ● Katrina Olds ● Terry Oxford ● Tracey Pettis ● Frank Ploof ● John Purdie ● Amy Pyle ● Victoria Python ● Paul Reeberg ● Edward and Allyson Ritger ● Martin Bennett and Claudia Robbins ● Barbara Roos ● Richard Rothman ● Paul Rubin ● Bill Ruck ● Max Sadrieh ● Adam Schweigert ● Joseph Sciarrillo ● Thea Selby and Robert Johnstone ● Eleanor Selfridge-Field ● Sheryl-Lyn Shelley ● Rebecca Skinner ● Alex Spiliotes ● Agata Sulczyńska ● Chris Sulots ● Eric Talbert ● Christian Taylor ● Kimberly Christensen and Richard Tsai ● Gabriel Turner ● Christian Utzman ● Eileen Wampole ● Rob Waters ● David Watterson ● Michael Weber ● Corey Weinstein ● Mary Whitten ● Denese and Tom Willey ● Philip Williams ● Joseph Wirt ● Leslie Arita and Adam Wooley ● Sonya Worthy ● Suzanne Yada ● Tom Honig and Louise Yarnall ● Yucky Yencken Thanks to generous support from community members, it is hard to keep this page updated. If you don’t see your name where it should be, please let us know at info@sfpublicpress.org . The San Francisco Public Press publishes investigative reporting online and in print, and produces audio journalism through podcasts and on KSFP, 102.5 FM. As a 501(c)3 nonprofit organization, we have received funding from national and local foundations and thousands of individuals. Donations are tax deductible to the extent allowed by law. We depend on your support. A generous gift in any amount helps us continue to bring you this service. Donate Sections Special Reports Homelessness Housing Health Environment Government & Politics More Topics About Us About Us Contact Us © 2025 San Francisco Public Press Powered by Newspack Ethics and Business Practices BlueSky YouTube Instagram Mastodon Linkedin Facebook Page X Threads Loading Comments... You must be logged in to post a comment."
    },
    {
      "url": "https://www.southernrailway.com/help-and-support/contact-us",
      "text": "Contact us | Southern Railway Skip to Buy Tickets Skip to Content Skip to Footer Loading A circular icon that animates to indicate a loading state. Loading service updates... Live train times Assisted travel Delay Repay Buy tickets Account Menu Menu Service updates Travel information Tickets Travel inspiration Discounts & offers Accessibility Help & support Live train times Assisted travel Delay Repay Buy tickets Service updates Service updates Travel updates Latest travel information and updates Timetables Find Southern timetables by station and download train times Planned engineering work Details of planned engineering work on our network Live map Real-time service status and route display Alternative route maps Alternative train, bus and tube maps Temporary planned service changes Industrial action Information about upcoming train strikes and industrial action Redhill to Tonbridge closure Engineering work between Redhill and Tonbridge from Saturday 16 August to Monday 25 August Sutton lift renewal project Network Rail is replacing lifts at Sutton station. There will be no lift access to or from the platforms from Monday 16 June until late-September. Travel information Onboard travel Bikes & scooters Storage of bikes and scooters on board Baby on board Priority seating for new and expectant parents Luggage Guidelines and support for carrying luggage on board Travelling with pets Policies for travelling with pets Find a quieter train Want to have the best chance of getting a seat? Wi-Fi on board Keeping you connected Station information Car parking Parking availability and information across our stations All stations (A-Z) Facilities, addresses, maps and more, for all stations Getting to the station Find out about taxis, buses and how to get to the station Tickets Find the right train ticket Choose the right ticket type for your journey Tickets Advance tickets Discounted tickets booked ahead of travel Off-Peak Reduced fares during off-peak hours Super Off-Peak Reduced fares during off-peak weekdays Anytime Tickets valid for travel at any time Child tickets Child fares and discounts for young people Season tickets Discounted long-term tickets for regular commuters Flexi Season Flexible season ticket options for part-time commuters First Class Enhance your journey with First Class DaySave Cost-effective day pass for unlimited off-peak travel Unizone Discounted ticket for students in Brighton and Worthing Bus links Combined train, bus and tram tickets Smart travel The Key Smartcard The smarter alternative to paper tickets Pay as you go Keygo, Contactless and Oyster cards Mobile app Travel smarter with the best fares and real-time train updates Your tickets and account details Ticket collection and delivery All you need to know about getting your train tickets Your online account How to buy and manage your train tickets online with Southern Travel inspiration Travel inspiration Explore destinations and things to do across the Southern network Popular destinations Brighton Portsmouth Eastbourne Inspire me Hove Lagoon Visit Hove Lagoon for beginner watersports & family fun Exploring a true hidden historic gem in South London Crystal Palace Park is full of historic and cultural treasures including plenty of activities and sites for families and children such as a maze, dinosaurs and cafes Explore Epsom and Ewell by train Epsom offers all the buzz and convenience of a vibrant town centre while you can try some unique tipples on Ewell’s thriving indie high street. Explore coastal adventures Exploring Winchelsea beach, Glyne Gap beach, and Camber Sands Exploring Lewes in a day Visit this charming town in East Sussex Discounts & offers Discounts & offers Railcards Save up to 1/3 off tickets with railcards GroupSave Off-peak savings for 3-9 adults travelling together 2FOR1 offers 2-for-1 entry at attractions in London, Brighton and more Kids for £2 Cheaper child fares starting from just £2 Accessibility Accessibility Book assistance Our online form for booking assistance for your journey Assisted travel Assistance for those with access needs Priority seat card A card for those who require priority seating Support whilst you're travelling Information and guidance on accessing our trains Wheelchairs & mobility scooters Guidelines for wheelchairs and mobility scooters Help & support Help & support Contact us Need help? Find out how to get in touch Delay Repay Compensation for unexpected delays and cancellations Refunds & amendments How to refund and change your ticket Money back guarantee Plans can change, and it's fine to change your mind Penalty fares Information on penalty fares and prosecutions Failed to carry Submit proof of your ticket or railcard Lost property Lost property services, collection and enquires First Class claim form First class claim form for reimbursement Live train times Assisted travel Delay Repay Buy tickets Home Help & Support Contact us Contact us Need help, have a question or want to tell us what you think? Get in touch with Southern here. Compensation for a delay Delayed by 15 minutes or more? Find out how to claim compensation . Refunds Can I get a refund on my ticket? Different tickets have different terms and conditions. For all information regarding refunds and change of journeys for all ticket types, please visit our refunds page .\nWhen you apply for a refund, we aim to process this in 20 working days. Will I be charged an admin fee? We offer a money back guarantee for certain ticket types where you will receive a full refund. There may be occasions where you will need to pay a £5 admin fee. For more information please visit our refunds page . Assisted travel Need to book help with your journey? Book assisted travel . Our Accessible Travel Policy documents are available here in alternative formats including audio and large print versions . Printed copies of our Making Rail Accessible document will shortly be available from all staffed stations across our network. Lost property Left something on the train or at the station? Find your lost items . Contact us Southern https://www.southernrailway.com/contact-us-submission Use our online form below and we'll get back to you as soon as possible - we aim to respond within five working days, but at very busy periods it may take us up to 20 working days What would you like to contact us about? I would like to make a complaint I would like to give some feedback I would like to report a fault I would like to make an enquiry Other contacts National Rail Enquiries For assistance to plan you journey, you can contact National Rail Enquiries. The contact details and hours of operation are below: Website: www.nationalrail.co.uk Telephone: 03457 48 49 50 Email: customer.relations@nationalrail.co.uk Twitter: @nationalrailenq Post: National Rail Enquiries Customer Relations Team PO BOX 8626 Swadlincote DE11 1JA The contact centre team are available 24 hours every day (except on Christmas Day) Transport for London Further information for London Underground, London Buses, London Trams, Docklands Light Railway, Elizabeth Line and London Overground can be found on the TFL Website (tfl.gov.uk) . Rail Ombudsman Please give us the opportunity to try to resolve your complaint. If you’re unhappy with the response you receive, you have the right to appeal to the Rail Ombudsman. The Rail Ombudsman is there to help resolve on going complaints between us and our passengers. It’s free to use their services and they are independent of the rail industry. Contact details for and hours of operation are below: Website (including online chat): www.railombudsman.org Telephone: 0330 094 0362 Textphone: 0330 094 0363 Email: info@railombudsman.org Twitter: @RailOmbudsman Post: FREEPOST – RAIL OMBUDSMAN The Contact Centre team are available Monday to Friday 09:00 - 17:00. What we do with your feedback We review every single comment we receive, and those that need action are passed on to the right manager straight away. Find out more about how our feedback process works. Complaint performance Period Percentage of complaints responded to in 10 working days Percentage of complaints responded to in 20 working days Average time to respond to complaints (working days) Period 1 01/04/2024 - 27/04/2024 91.97% 98.99% 4.43 Period 2 28/04/2024 -  25/05/2024 92.92% 98.66% 4.37 Period 3 26/05/2024 - 22/06/2024 92.03% 98.69% 3.93 Period 4 23/06/2024 - 20/07/2024 89.35% 99.01% 5.21 Period 5 21/07/2024 - 17/08/2024 86.80% 98.96% 5.88 Period 6 18/08/2024 - 14/09/2024 79.08% 97.14% 7.29 Period 7 15/09/2024 - 12/10/2024 75.40% 97.39% 7.56 Period 8 13/10/2024 - 09/11/2024 71.33% 96.06% 8.43 Period 9 10/11/2024 - 07/12/2024 74.84% 94.34% 8.25 Period 10 08/12/2024 - 04/01/2025 74.11% 96.64% 8.29 Period 11 05/01/2025 - 01/02/2025 77.08% 93.11% 8.08 Period 12 02/02/2025 - 01/03/2025 79.45% 96.34% 6.84 Period 13 02/03/2025 - 31/03/2025 74.61% 95.30% 8.28 Improvements as a result of customer feedback Improvements as a result of customer feedback The key reasons for complaints in 24/25 were; Online ticket-buying facilities Punctuality and reliability Smartcards Delay compensation schemes Attitudes and helpfulness of staff Our commitment is to use all customer feedback as a launchpad for improvement. We value the feedback we receive as it allows us to identify areas where positive changes can be made to the service we offer across many departments. The following key improvements have been undertaken in the last year as a result of customer feedback: We introduced a new ‘Voice of the Customer’ survey, which is sent out to our customers when their case is closed. This allows us to gather insight into our handling in real time and encourages our customers to feel confident in providing feedback. Additionally, this helps us take further action where needed, including follow-up contact to resolve any outstanding issues. We’ve enhanced our complaints handling process, particularly within the retail experience, contributing to a 15% reduction in retail-related complaints year-on-year. Updates to our delay compensation process were made based on common themes in feedback. This included the introduction of new ticket types (such as Paper Roll Tickets) and a refreshed Delay Repay webpage with more helpful guidance in areas in which customers previously reported confusion. We continue to review and enhance our back-office processes. As we’re aware many of our Key Smartcard customers may have a smartcard due to expire, we’ve taken steps to introduce a proactive communication process to forewarn of upcoming expiries. This has resulted in a notable reduction in contacts received about this. We responded to concerns around missing PayPal confirmation emails by updating information during the purchasing journey to clearly explain that these will be sent to the PayPal-registered email address. We introduced KeyGo capping in partnership with South Western Railway (SWR), responding to customer requests for more flexible and capped fare options. We’ve rolled out new apps, including the introduction of the Great Northern app – allowing passengers to easily access information when on the go whilst also making journey planning and ticketing more accessible for our customers. The Head of Customer Relations now attends quarterly contract reviews with suppliers and has a dedicated slot to discuss customer issues so we can make sure that customer concerns are raised, addressed and considered in any decisions. Following a review of payment methods, we removed Amazon Pay due to it being a less efficient option, in line with customer preferences and usage data. Rather than giving customers too many options, we’re taking on board feedback and making efforts to give customers the options they want. Improvements were made to tone of voice, knowledge sharing, and colleague training, delivered to those who handle customer contacts. As a result, we’ve seen a positive uplift in customer satisfaction with complaint handling. We are dedicated to leveraging customer feedback, including complaints, to drive continuous improvement in accessible travel. We regularly review customer satisfaction survey data to monitor progress on journey bookings and assistance provision, sharing these insights with internal stakeholders to inform service enhancements. Initiatives delivered based on customer feedback include: Aira: A visual interpretation app supporting blind and partially sighted customers with wayfinding around stations. SignLive: A British Sign Language interpretation app assisting deaf and hard of hearing customers in interactions with frontline and contact centre staff. We created a new section on our Assisted Travel webpage with information on how to provide feedback or make a complaint. This includes a link to our Easy Read Feedback Guide, making the process more inclusive and accessible We collaborated with our Access Advisory Panel on the latest Accessible Travel Policy (ATP) renewal, incorporating their feedback to enhance accessibility. Changes include: Removal of railway jargon for clearer English. Improved explanations for the use of our on-train passcomm. Enhanced clarity for customers completing our satisfaction survey . Complaints related to assisted travel are logged by the Accessibility Team in our internal reporting system and assigned to relevant managers for investigation. This includes incidents reported by frontline staff, allowing us to capture a broader scope of accessibility issues. Data is analysed to identify trends and target areas for improvement. We also conduct targeted accessibility mystery shopping throughout the year, focusing on locations with increased complaints or negative feedback. Insights from these exercises are integrated into our reporting system and analysed to create specific action plans as needed. For example, a rise in assistance-related complaints at St Pancras station—specifically concerning the non-provision of bridging platform ramps—triggered a collaborative review between GTR and Network Rail. This resulted in a comprehensive training initiative for station staff on ramp deployment, which has since been completed and addressed the issue. These feedback mechanisms are central to improving our complaints processes and enhancing the customer experience for disabled passengers, ensuring concerns are translated into tangible service improvements . Explore Contact us How we act on your feedback Social media Complaints handling procedure Passenger Panel Access Advisory Panel Phone To find train times or for any other queries: Call 03451 27 29 20 (open 07:00-20:00). We aim to answer calls as quickly as possible with most of them answered within 5 minutes. When this is not possible, we may arrange to call you back. Post Write to us at: Govia Thameslink Railway PO BOX 8644 Derby DE1 9RQ Stay up-to-date Subscribe to email updates. Get travel inspiration, journey updates and exclusive offers delivered straight to your inbox. We will not pass on your personal information to any organisation outside of Southern. Should we no longer operate the Southern franchise, please be aware that we will pass your details to the Successor franchise or Secretary of State for Transport to allow you to continue receiving service and/or marketing emails if you have consented to them. *Must be over the age of 16 Your details First name * Last name * Email * Sign up for: Travel and service updates I am 16+ and would like exclusive promotions and inspiration Subscribe We will not pass on your personal information to any organisation outside of Southern. Should we no longer operate the Southern franchise, please be aware that we will pass your details to the Successor franchise or Secretary of State for Transport to allow you to continue receiving service and/or marketing emails if you have consented to them. *Must be over the age of 16 Subscription confirmed Thank you for subscribing to our email updates. You'll now receivetravel inspiration, journey updates, and exclusive offers delivered straight to your inbox. You can update your preferences or unsubscribe at any time by clicking the link at the bottom of our emails. Okay Subscription Failed Something went wrong with your submission, please try again later. Okay Quick Links Contact us Careers Media centre Accessibility Travel inspiration All destinations Popular routes Artful journeys Top 10 family staycations by train Explore coastal adventures 3 wonderful walking tracks to take in Hastings Explore the history of Rye Exploring Lewes in a day Sustainable shopping in the south east The 1066 Country Walk Contact us Get in touch Passenger panel Access advisory panel Media centre Social media About us Who we are Company information Our commitments National Rail Conditions of Travel Procurement policy Rail Passenger Rights and Obligations Safety on the railway Performance Service quality How we're performing Train service punctuality and reliability Customer information pledges Corporate & social responsibility Corporate and social responsibility Young people Charities Communities Mental Health Homelessness Environment Tiktok Follow us on Facebook Follow us on Twitter Instagram Follow us on LinkedIn Subscribe to our YouTube channel Copyright © Govia. All rights reserved worldwide. Southern is a trading names of Govia Thameslink Railway Ltd. Registered in England under number: 06574965. Registered office: 2nd Floor, 55 Degrees North, Pilgrim Street, Newcastle upon Tyne, NE1 6BL Govia Thameslink Railway Ltd is a wholly owned subsidiary of Govia Ltd. Terms Privacy policy Cookie policy Cookie preferences Modern slavery statement Corporate governance Site accessibility Recite Me"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * First Nachricht E-Mail Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.washcomall.com/chipley",
      "text": "Chipley - Washington County Chamber of Commerce - FL, FL Pages Members Categories Quicklinks Events Home Contact Toggle navigation Home Member Directory The Chamber About Us Foundation LEAD Washington Board of Directors Ambassadors Committee Chamber Membership Join Today Contact Us Map Economic Development Economic Development Council Key Incentives State Legislators Communities Caryville Chipley Ebro Green Head New Hope Sunny Hills Vernon Wausau Our County County Information History Recreation Lifestyle & Faith Area Church Info Education Heath Dept. Services Utilities & Taxes Links Events Member Login Store Chipley Chipley - Founded In 1882 In 1882, the community of Orange was founded and renamed Chipley.   It was the year the Pensacola & Atlantic (later L & N) Railroad was completed beyond the town site. Ironically, since Washington is still a dry county today, the first business enterprise was a wine shop that had been established on the site in 1881 by B. W. Berry, who also operated a pre-Prohibition Era whiskey distillery on land that nearly a century later would become Falling Waters State Park Recreation Center, just south of Chipley on Hwy 77. Berry's business however came to an end in 1899, when the Washington County electors voted by a narrow margin to prohibit the manufacture or sale of alcoholic beverages within its boundaries. Construction of a railway siding was completed in 1882 beside what was to become known as Tank Pond, near today's Agricultural Center and City Hall.  Water was pumped from the pond into an elevated tank, where the steam-driven locomotives stopped to re-supply.  The locomotives also obtained supplies of wood for fuel. The original name of Orange, was probably for Orange Hill, the most prominent neighboring community. Initial plans called for a town to be platted beside the railroad on a hill perhaps three or four miles east of Tank Pond, near the future site of the National Egg-Laying Test Site (Poultry Experiment Station).  That site was then in Jackson County, a circumstance that prompted some of the Orange Hill and other Washington County promoters to seek a site in their county.  They visualized county seat status for the proposed town, but they realized it could not be achieved in Jackson County.  Marianna, then the largest town on the railroad east of Pensacola, had been well-established as the seat of government for Jackson County for half a century. So the prospective promoters of the new town - Col D. H. Horne, Capt. Angus McMillan, Capt. G. W. Cook, Maj. W. J. Vankirk and J. M. Callaway, among others- approached Col. W. D. Chipley, manager of the new railroad,  with the idea of moving the proposed town site into Washington County. Col. Chipley, persuaded by his friends, some of them former fellow-Confederate Army officers, accepted their proposal.  Maj. Vankirk acquired title to 80 acres of land, which was then surveyed by Col. Horne, and would become the town's basic business district. Soon after the site decision was made, the men named the town Chipley in honor of the railroad builder.  As the town developed, however, its northern and eastern sections spread into Jackson County.  That created problems, particularly for law enforcement and school officials, and that led to a border adjustment in 1915 that gave Chipley more Washington County \"elbow room.\" The Town Is Built Chipley's railway station and post office were originally located in railway box cars. Chipley's first school was called Limestone, named for Limestone Church about half a mile from town.  The school's name was changed to Chipley just after the town was established in 1886.  It was located near the site of today's county jail and about the same time, the Methodist Church that now stands at the top of the hill on Jackson Street, was  built around the same time. Among Chipley's first merchants were William Tiller and a Mr. Matthew.  H.D. Feagan was the town's first druggist.  Dr. R. B. Bellamy was the first physician and Dr. A. D. Brown was the town's first dentist.  A Mr. Thompson was Chipley's first lawyer. Major Vankirk started selling lots from his 80-acre parcel.  Lots facing the railroad were 50 feet wide and 140 feet deep and sold for $40 each, while the residential, or back lots, were sold for $20 each.  Among the first residents of Chipley were William Tiller, Capt. McMillan, and Ed Daniel.  Other early settlers included T. J. Jones, Sol Ellis, Dr. Bellamy, Dave Farrior, Henry Faust, J. M. Callaway, Daniel Williams and Billy Williams.  A Baptist church was built in 1889 on a lot later occupied by G. M. Meyers. The Collier House, a boarding house, was in existence prior to 1890 near today's Chipley Motel.  The Chipley Hotel was completed in 1890. Dekle & Company, private bankers, brought Chipley its first banking services in 1899.  The First National Bank was organized in 1905, and the Chipley State Bank was formed a year later. When Chipley was reincorporated in 1901, the city authorized the issuance of $10,000 in bonds to finance the construction of a municipal water system and a school building.  In 1902, the Presbyterian Church was built. In 1905, the Birmingham Columbus & St. Andrews Bay Railroad started construction from Chipley southward.  In 1910, a $22,000 bond issue was sold to finance improvements to the water system, and in 1913 the city approved a franchise to Chipley Light & Power Company for the installation and operation of an electric light system.  CL&PC later added an ice making plant. In 1919, a $60,000 bond issue financed the installation of a sewer system and improvements to the existing water system.  A few downtown streets were paved in 1922 a year later, sidewalks were installed over a wider area of town.   In 1926 Gulf Power Company acquired CL&PC and was granted a franchise to furnish electricity within the city. Chipley became the Washington County seat of government in 1927, then a courthouse and jail were built within a few years. History Sources: E. W. Carswell's book, Washington, Florida's Twelfth County.  Copyright 1991, E.W. Carswell. All Rights Reserved. And the Chipley Centennial, 1982.  Published by The Washington County News and the Chipley Centennial Committee. Contact Info: Address : 1442 W Jackson Ave, Chipley, FL 32428 Hours : 8 am ⋅ Closes 4PM Phone : (850) 638-6350 Quicklinks Weather Map Links Events Contact Info Washington County Chamber of Commerce - FL P.O. Box 457, Chipley, FL 32428 850. 638.4157 info@washcomall.com © Copyright 2025 Washington County Chamber of Commerce - FL. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://www.wjhg.com/2025/04/26/chipley-station-celebrates-its-grand-opening/",
      "text": "Chipley Station celebrates its grand opening Skip to content Watch Live News Your County We the People National Weather Sports Chapter Chat WJHG Apps Submit Photos & Video Shop Local Homepage News State Regional National International Crime Politics Watch Live Your County Bay Calhoun Gulf Franklin Holmes Jackson Liberty Okaloosa Walton Washington Weather Closings & Delays Hurricane Hurricane Michael: 5 Years Later Live Doppler Radar Map Room Severe Weather Guide Weather Cameras Wildfire Forecast Sports Headlines Friday Night Overtime Scoreboard Share Your Highlights Student Athlete Of The Week Sports Talk Community Community Calendar Golden Apple Award Summertime Learning 850 Student Of The Week Chapter Chat NewsChannel 7 Today Live Shots with Shaun Morning Interviews Medical Monday Foodie Friday Time Travel Tuesday We the People Contests Contact Us Advertise with Us Find a Job Internship Opportunity Meet the Team Meet the Sales Team Election Results Newsletter Discover Northwest Florida Shop Local Submit Photos & Video WJHG 7+ Time Travel Sports Talk Faces and Places 7 @ 7 Community Extra Programming Schedule NextGen TV Zeam - News Streams Circle Country Gray DC Bureau InvestigateTV Watching Your Wallet PowerNation My NetworkTV Digital Marketing Chipley Station celebrates its grand opening Chipley Station is the city’s newest taphouse and food truck pavilion. By Emmaleigh Clegg Published : Apr. 25, 2025 at 9:08 PM CDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn CHIPLEY, Fla. (WJHG/WECP) - Chipley Station is the city’s newest taphouse and food truck pavilion. Complete with five food carts, beverages on tap, lots of TVs, and both indoor and outdoor seating, Chipley Station aims to be a community hub, with something for everyone. The business also wants to become a hub for entertainment in the area by hosting game nights or live music. The owners of Chipley Station tell NewsChannel 7 that creating this space has been a dream, and they chose to open in Chipley because of the people who live there. “It’s a very enduring, friendly community,” said one of the owners, Steven Storlie. \" I married a local gal, and we really wanted to build something that said thank you to all the nice people that are here, and that deserve a great place to come celebrate life.” Storlie tells NewsChannel 7 that a lot of hard work went into perfecting Chipley Station, including an advanced tap system that ensures all drinks are served cold. With the location being in the heart of Downtown Chipley, the owners were sure to integrate the town’s history into its decor. They say that they hope this benefits everyone. “Everything we’ve done is about asking the community what they want,” said owner Jeff Dexter. “It’s not really about us, it’s about providing something for the community.” Chipley Station is located at 684 7th St, Chipley, FL 32428. To stay up to date on all the latest news as it develops, follow WJHG on Facebook , Instagram and X ( Twitter ). Have a news tip or see an error that needs correction? Email news@wjhg.com . Please include the article’s headline in your message. Keep up with all the biggest headlines on the WJHG News app , and check out what’s happening outside using the WJHG Weather app . Copyright 2025 WJHG. All rights reserved. Most Read Former Sneads High softball coach pleads guilty after sexual misconduct with player Florida’s first-ever hunting, fishing and camping sales tax holiday begins Panama City Beach Walking Club bringing local women together through movement Flesh-eating bacteria brings together two survivors FBI searching for woman accused of stealing $34 million in COVID relief funds Investigation targeting online child predators leads to arrest of 7 Virginia man missing, last seen at Ponce de Leon Springs State Park Local businesses burn in Cape San Blas fire Latest News NBH gets road volleyball win Tuesday Three team 9-hole tournament Bay County TDC talks upcoming Gulf Coast Salute Air Show Bay County TDC will be spending more public safety money in 2026 Updated fire service assessment passed Panama City’s access to heart health care grows Groundbreaking held for Apalachicola African American Museum Franklin County EOC distributes water to residents News Sports Weather Contact Us Advertise with Us Programming Shop Local Submit Photos & Video Find a Job Hurricane Facebook Twitter Instagram WJHG 8195 Front Beach Road Panama City Beach, FL 32407 (850) 234-7777 Public Inspection File publicfile@wjhg.com - (850) 234-7777 Closed Captioning/Audio Description Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "http://www.pmcgroup.biz/contactus.html",
      "text": "The PMC Group LLC The PMC Group LLC Home Services Cybersecurity Workshops Cybersecurity Resources Infrastructure IT and OT Management and Business Real Estate Clients and Projects About Us Contact Us Engineering a better tomorrow today Contact Us The PMC Group LLC is located in the Washington DC National Capital Region, but operates globally with associates and consultants. The PMC Group LLC 14812 Sun Meadow Ct Suite 101 Centreville, VA 20120-1226 Michael Chipley PhD PMP LEED AP President mchipley@pmcgroup.biz Phone: 571-232-3890 Paula Chipley CBA Vice President pchipley@pmcgroup.biz Phone: 703-400-3371 Engineering a better tomorrow today 2019 The PMC Group LLC Website Protection powered by SiteLock™"
    },
    {
      "url": "https://washingtoncounty.news/2025/04/22/chipley-station-to-host-grand-opening-april-25/",
      "text": "Chipley Station to host Grand Opening April 25 | Washington County News Skip to content Category Announcements Business Columns Community Crime Education Entertainment Events Faith Faith Columns Government Letters to the Editor Lifestyle Local News Michael Reagan Mugshots News Opinion Opinion Columns Panama City Ron Hart Special to the News Sports Staff Report State News Statewide Top Stories Uncategorized Archive September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 Wed. Sep 10th, 2025 Washington County News Home News Local News Statewide Business Education Crime Sports Opinion Faith Columns Community Announcements Lifestyle Entertainment Events Legals E-Edition Pick Up Locations Calendar Subscribe Business Top Stories Chipley Station to host Grand Opening April 25 By CAROL KENT SMITH Apr 22, 2025 0 Comments Chipley Station will host its grand opening April 25 at 4 pm. [HANNAH COLLINS | The News] CAROL KENT | The News After more than a year of anticipation, Chipley Station will officially roll out Grand Opening festivities Friday, April 25. The official ribbon cutting will take place outside at 4 p.m., and the doors will open to the public at 6 p.m., with live music performed by Brett Stafford and six food trucks available to serve up a variety of cuisine options. Founded by three friends who grew up playing sports together for decades, Chipley Station was created to celebrate the friendly people, great weather, and rich traditions of Northwest Florida. “We want Chipley Station to be the go-to spot, whether you’re grabbing a drink with friends, enjoying a family night out, or celebrating after the big game,” said co-founder Steven Storlie. The Station will be a unique addition to the state of Florida, featuring a food truck pavilion with a 24-tap craft beer bar, as well as a place to watch key sporting events, and cozy outdoor seating that offers a firepit and a place create memories. “We are the newest and oldest tap house in Chipley,” joked Storlie. “Please come visit. There’s a lot of Chipley magic inside, from 100” televisions to the coldest beer in Florida.” “The coldest beer in Florida” is made possible by the most advanced tap system ever installed in North Florida. Designed with input from top tap designer Dan Walker, the system has a monitor for each tap to measure its pressure, temperature, and humidity. “Our goal is to deliver the most consistent craft beer with the coldest beer in Florida,” said Storlie. “We built the cooler and tap system around that goal.” With more than 30 years of experience in developing community-driven spaces and real estate projects, the Chipley Station team says it is dedicated to creating an inviting atmosphere where friends, families, and neighbors can gather. Chipley Station also emphasizes that while it is a tap house that serves a variety of domestic and award-winning craft beers and wine, it is family friendly and appropriate for all ages, serving sodas, sweet tea, and frozen drinks while keeping an atmosphere focused on food, family, and fun. There will be a theme for each night, as well as a variety of family activities, such as “BYOT (Bring Your Own Turtle) Night” when teams can race a turtle for a good cause or a chance to win prizes. Storlie also states Chipley Station plans to host events such as festivals and a “movie date night” on the green at the train depot, during which a nearby, secure Kids Zone with entertainment such as bounce houses that will be closely supervised and managed by vetted local teens and other volunteers using a wrist band system. There will be numerous award-winning food trucks in rotation to offer something for everyone’s palate, with new food trucks, music, and beers dropped every Sunday night. Chipley Station also hopes to foster young musical artists by frequently featuring those who reach out at info@chipleystation.com . “At our core, we are in ‘The People Business’ – building places where meaningful experiences happen,” they stated. The taphouse is also helping build the community, creating 16 new local jobs and hiring only local contractors to perform its construction. The team additionally gathered input from the public to ensure the experience was tailor-made for Chipley and the surrounding area. “Many of our inspirations and insight came from the community on what they wanted for food and experience,” said Storlie. “We were motivated to do this project because Chipley is a wonderful place to raise a family and to live. We felt all it was missing was a little variety in food and experience. We hope the community will continue to communicate their wants and needs.” Storlie also expressed appreciation for those who helped make the vision become reality. “Thank you to Mayor Tracy Andrews, Chipley City Council, Community Redevelopment Agency, our incredible construction partners, the Washington County Chamber of Commerce, and of course, our amazing family and friends. Your support, encouragement, and hard work have meant the world to us. This isn’t just a project – it’s a community effort, and we couldn’t have done it without you. Here’s to building something special – together. We are very excited to watch the City of Chipley continue to grow and very grateful to all the people who contributed.” Designed as a hub for locals and visitors alike, Chipley Station will be a place where people come together to enjoy great food, refreshing drinks, and a welcoming atmosphere. Chipley Station is located at 684 7th Street in Chipley and will open at 11 a.m. daily, closing at 9 p.m. Monday through Thursday; 11 p.m. Friday and Saturday and at 4 p.m. on Sundays. # business # ChipleyStation # WCN Post navigation Brock makes a ‘light’ request WCSO arrests two after foot pursuit By CAROL KENT SMITH Related Post Announcements Community Education News Top Stories Washington County School District ranked #1 in growth for state AMBER PATINO Sep 9, 2025 Government News Special to the News Statewide Top Stories DeSantis pushes again for open carry Staff Report Sep 9, 2025 Announcements Community Education Local News News Top Stories Carmichael retires after 29 years of service to school district AMBER PATINO Sep 9, 2025 Search Search Weather Please set your valid city name and country code. Weather from OpenWeatherMap You Missed Announcements Community Education News Top Stories Washington County School District ranked #1 in growth for state Government News Special to the News Statewide Top Stories DeSantis pushes again for open carry Announcements Community Education Local News News Top Stories Carmichael retires after 29 years of service to school district Announcements Community News Top Stories Washington County students recognized for perfect scores Education Top Stories Chipola to offer ACT test on October 18 [insta-gallery id=\"0\"] © Copyright 2024. All Rights Reserved by the Kent Smith Group. About Share Your News & Events Obituary Order Careers Apply Today! Contact Us"
    },
    {
      "url": "https://www.chipleypawnshop.com/contactus/",
      "text": "Contact Us Menu HOME ABOUT SPECIALS FIREARM FAQ PAWN FAQ MYTHS CONTACT test Contact Chipley Gun & Pawn Located In Historic Downtown Chipley, Florida Thank you for your interest in contacting Chipley Gun & Pawn, Inc. We are conveniently located at 1222 Jackson Avenue, in Chipley, Florida - 2 blocks east on Highway 90 in the old FRM feed store. Please feel free to call, e-mail or you are invited to come by during regular business hours - Monday thru Friday 9 a.m. to 5 p.m CST. and Saturday 9 a.m. to 1 p.m. CST. Chipley Gun & Pawn, Inc. 1222 Jackson Avenue Chipley, Florida 32428 For a FFL transfer please e-mail : chipleypawnshop@gmail.com e-mail : sales@chipleypawnshop.com Have Questions? Call Us 850-638-8987 Need Assistance? Cash, Checks, Trade and Most Major Credit Cards Accepted. Chipley Gun & Pawn, Inc 850-638-8987 Driving Directions chipleypawnshop@gmail.com Mon-Fri 9 - 5 & Sat 9 - 1 © 2025, Chipley Gun & Pawn, Inc | john warren, llc"
    }
  ]
}