{
  "fuentes": [
    {
      "url": "https://chivemediagroup.com/about-us/",
      "email": "img-logo@2x.png"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "email": "dmca@2x.png"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "email": "img-logo@2x.png"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "email": "other@2x.png"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "email": "sales@2x.png"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "email": "tech@2x.png"
    },
    {
      "url": "https://chive.com/pages/contact-us",
      "email": "info@chive.com"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "email": "dmca@2x.png"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "email": "img-logo@2x.png"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "email": "other@2x.png"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "email": "sales@2x.png"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "email": "tech@2x.png"
    },
    {
      "url": "https://vchiefs.com/",
      "email": "info@virtualchiefofstaff.com"
    },
    {
      "url": "https://www.thechivery.com/blogs/the-chivery-herald/a-word-from-chivery-customer-service",
      "email": "black-chivery-logo_150x@2x.png"
    }
  ],
  "mails": [
    "black-chivery-logo_150x@2x.png",
    "dmca@2x.png",
    "img-logo@2x.png",
    "info@chive.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@virtualchiefofstaff.com",
    "other@2x.png",
    "sales@2x.png",
    "tech@2x.png"
  ],
  "nombre_sitio": "chiveverobeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://chivemediagroup.com/about-us/",
      "text": "About Us – Chive Media Group About Us Press Brand Guidelines Careers Contact Us Press & media inquiries? Contact us here. About Us How a couple brothers started a global movement Play video Close The Founders Leo Resig CEO & Co-Founder Leo Resig CEO & Co-Founder Family has always come first with Leo. A proud father to a beautiful daughter, Paris and his amazing wife, Tiffany. Hailing from Fort Wayne, Indiana, Leo Resig is the second of four children. He has an older brother, John, who is the co-founder and business partner in Chive Media Group. He also has two younger sisters, Emily and Megan who run theCHIVE’s sister destination, TheBerry.com. Leo’s parents instilled a work ethic at a young age and they found child labor loopholes for him to caddy at the tender age of 13. He has since had over 50 jobs where he learned what he loved but mostly what he did not. His array of experience swayed him to be an entrepreneur and control his own destiny. He learned the facts of life through some startup failures but has always lived life with his blinders off and considers himself a futurist and a generally lucky dude. He is famous for having at least one bad idea every day. A graduate of Indiana University’s with a SPEA degree in Management in 2003, Leo learned nothing about business. His post college professional careers consisted of a bartender, server, screenplay writer and a personal banker at Wells Fargo. It wasn’t until he moved to LA in 2005 where he landed a job as an office manager at a creative agency in Hollywood that he got the bug for digital advertising. He was promoted to the company’s first Ad Ops manager of their newly established digital media department where he learned there was more to online advertising than pop up ads. His job at the agency led him to another adops job at Gorilla Nation (now Evolve Media), on the publisher side. This is where Leo learned how websites were monetized. At the tail end of his tenure at Gorilla Nation, Leo and his brother John started a celebrity gossip blog, Derober.com to capitalize on the celeb gossip trend. At the same time, Leo transferred from Venice Beach to Chicago with Gorilla Nation to find a nice midwestern girl to settle down with (which he did). John and Leo quickly realized they hated celebrity gossip and found themselves constantly cruising foreign viral photo blogs for a quick laugh. So they switched gears and started a photo blog in November 2008 as a one stop shop for curated viral photos in long scroll gallery form. With Leo living in Chicago and John living in Venice, they combined the CHI from Chicago and VE from Venice to form theCHIVE.com. (Fun fact, theCHIVE was almost named DarbyGunpowder.com) It was an instant hit and Leo moved back to Venice to build the business with John. Their first hire was their cousin Bob who they saved from his serving career at CPK. It started as two brothers blogging on the couch, drinking beer with Top Gear playing in the background. Chive Media Group has grown to nearly 100 employees strong with a thriving e-comm business, nationwide beer line, a multi-city music festival and a charity that has raised millions of dollars and changed hundreds of peoples lives. Leo and his family now reside in Austin, TX where they relocated the company from Venice in August, 2013. Close John Resig President & Co-Founder John Resig President & Co-Founder John Resig is the co-owner and President, and I use the title loosely, of theCHIVE.com and TheBerry.com and is the oldest and most immature Resig, which says a lot. John lives in here in paradise (Venice, CA) with his idiot cousin, Rick. If John ever turns up dead, Rick did it. John landed the role of Deputy Kevin Ellis on the hit HBO vampire drama, True Blood, in 2008. He is currently filming the 3rd season and, yes, it’s totally badass. John thinks he’s Peter Pan and has no plans to leave an emotional state exceeding that of a college Freshman, ever. Close On the first day... Brothers John Resig and Leo Resig founded Chive Media Group and its flagship site, theCHIVE.com,\n\t\t\t\t\t\tin\n\t\t\t\t\t\tNovember 2008 with no capital and a lot of hustle. Leo was living in Chicago (CHI) and John was\n\t\t\t\t\t\tliving in Venice (VE) and that’s how theCHIVE was born. More than a decade later, theCHIVE has\n\t\t\t\t\t\tevolved into a one-of-its-kind lifestyle brand with a variety of business lines including\n\t\t\t\t\t\tdigital\n\t\t\t\t\t\tmedia, e-commerce, community building, and charity. Chive Media Group currently has 40+\n\t\t\t\t\t\temployees\n\t\t\t\t\t\theadquartered in Austin, TX. In 2014, John and Leo and their CMG executive team pioneered CHIVE TV, single-handedly creating\n\t\t\t\t\t\tthe\n\t\t\t\t\t\tstreaming TV-for-business category. This led them to create Atmosphere, the world’s first and\n\t\t\t\t\t\tonly\n\t\t\t\t\t\tstreaming platform for businesses. Atmosphere can be seen on televisions in over 50,000\n\t\t\t\t\t\tbusinesses\n\t\t\t\t\t\tworldwide and continues to grow its global footprint rapidly. Chive Media Group Empire Sitemap About Us Press Brand Guidelines Careers Contact Us Our Properties theCHIVE CHIVE TV theCHIVERY CHIVE Charities Buy me Brunch William Murray Golf TERMS OF USE • COPYRIGHT\n\t\t\t© 2025 CHIVE MEDIA GROUP, LLC. ALL RIGHTS\n\t\t\tRESERVED"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Surname E-Mail First First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.chivemediagroup.com/contact",
      "text": "Contact Us – Chive Media Group About Us Press Brand Guidelines Careers Contact Us Press & media inquiries? Contact us here. Contact Us WHAT DO YOU WANT TO TALK ABOUT? Select a topic below, and we'll direct your message to the right person If you're having issues with a site or are experiencing any bugs, use this form. Use this form for any complaints regarding intellectual property or DMCA notices. Doesn't fit in a category? Use this form for any random messages. Want to make money with us? Reach out here! Chive Charities-related questions and comments can be submitted on their site by clicking here. Need customer support for something you bought from The Chivery? Click here to get in touch with\n                        us. REPORT SITE ISSUES OR BUGS Sometimes we make mistakes. If you're experiencing an issue with one of our sites please use this\n                        form to help us track it down. Please note that while we appreciate your feedback and use it to improve our websites and applications, we are unable to individually respond to tickets. —Please choose an option— theCHIVE CHIVE TV Chive Media Group Upload a screenshot Δ COPYRIGHT & DMCA Please fill out the following form and we will respond promptly. Δ Other Let us know what you'd like to talk about. Please note that while we appreciate your feedback and use it to improve our websites and applications, we are unable to individually respond to tickets. Δ Sales and Partnerships Interested in working with us? Fill out this form and we'll reach out if we think there is a good fit! Δ Sitemap About Us Press Brand Guidelines Careers Contact Us Our Properties theCHIVE CHIVE TV theCHIVERY CHIVE Charities Buy me Brunch William Murray Golf TERMS OF USE • COPYRIGHT\n\t\t\t© 2025 CHIVE MEDIA GROUP, LLC. ALL RIGHTS\n\t\t\tRESERVED"
    },
    {
      "url": "https://chive.com/pages/contact-us",
      "text": "Contact Us Skip to content Facebook Instagram TikTok Pinterest Ceramic Flowers Buy 3 Get 1 Free Country/Region United States (USD $) United States (USD $) Search Shop All Ceramic Flowers Shido Seeds Pots Vases & Terrariums Accessories & Tools Gifts Chive Story Sale Blog Account Search Cart Shop All Ceramic Flowers Curated Collections Ceramic Flower Gift Boxes English Garden Collection France Collection Japan Collection Coastal Collection Nantucket Collection Classic Collection Sets of Ceramic Flowers All Ceramic Flowers Shido Seeds Vegetable Seeds Flower Seeds Herb Seeds Pots Small Pots Medium Pots Large Pots Pots with Drainage Pots without Drainage Animal Pots All Pots Vases & Terrariums Pooley Vases Ceramic Vases Glass Vases Terrariums All Vases and Terrariums Accessories & Tools Gardening Tools/Watering Cans Plant Supplements Faux Plants All Accessories and Tools Gifts Ceramic Flower Gift Boxes Shido Candles Christmas Ornaments Niyuki Puzzles Paper Greeting Cards Gift Cards Ceramic Flowers Single Flowers France Collection English Garden Collection Japan Collection Coastal Collection Classic Collection Birth Flowers All Ceramic Flowers Curated Collections English Garden Collection France Collection Japan Collection Coastal Collection Ceramic Flower Gift Boxes All Curated Collections France Collection English Collection Japan Collection Shido Seeds Shop By Seed Type Flower Seeds Herb Seeds Vegetable Seeds All Seeds Flower Seeds Vegetable Seeds Herb Seeds Pots Small Pots Medium Pots Large Pots Pots with Drainage Pots without Drainage Animal Pots All Pots Liberte Minute Virago Vases & Terrariums Pooley Vases Ceramic Vases Glass Vases Terrariums All Vases and Terrariums Pooley Caterpillar Loft Bud Vase Accessories & Tools Sprayers & Watering Cans Plant Supplements Faux plants Kenzan Ikebana Floral Frogs and Dishes All Accessories and Tools Gifts Ceramic Flower Gift Boxes Shido Candles Niyuki Puzzles Paper Greeting Cards Ornaments Gift Cards Chive Story Sale Blog Contact Us You will receive an automated email shortly with instructions on how to proceed with your request. If you do not see it in your inbox, please check your junk or spam folder. Name Email Message Send Anything but Ordinary Our mission is to keep you on the edge of your gardening seat with mind-blowing, avant-garde designs that will leave your plants wondering if they've stumbled into an art gallery. Facebook Instagram TikTok Pinterest Get to Know Us Our Story In The Press Blog Plant Care Locations Wholesale Inquiries Chive International Stores Chive Canada Chive UK Chive UK Wholesale Chive Wholesale Customer Care Help / FAQ Privacy Policy Shipping Policy Refund Policy Terms of Service Message Us American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa Chive Canada Chive UK Chive UK Wholesale Chive Wholesale Country/Region United States (USD $) United States (USD $) © 2025 Chive Ceramics Studio . Powered by Shopify Your cart Close Checkout Close Your cart is empty Start shopping"
    },
    {
      "url": "https://chivemediagroup.com/contact-us/",
      "text": "Contact Us – Chive Media Group About Us Press Brand Guidelines Careers Contact Us Press & media inquiries? Contact us here. Contact Us WHAT DO YOU WANT TO TALK ABOUT? Select a topic below, and we'll direct your message to the right person If you're having issues with a site or are experiencing any bugs, use this form. Use this form for any complaints regarding intellectual property or DMCA notices. Doesn't fit in a category? Use this form for any random messages. Want to make money with us? Reach out here! Chive Charities-related questions and comments can be submitted on their site by clicking here. Need customer support for something you bought from The Chivery? Click here to get in touch with\n                        us. REPORT SITE ISSUES OR BUGS Sometimes we make mistakes. If you're experiencing an issue with one of our sites please use this\n                        form to help us track it down. Please note that while we appreciate your feedback and use it to improve our websites and applications, we are unable to individually respond to tickets. —Please choose an option— theCHIVE CHIVE TV Chive Media Group Upload a screenshot Δ COPYRIGHT & DMCA Please fill out the following form and we will respond promptly. Δ Other Let us know what you'd like to talk about. Please note that while we appreciate your feedback and use it to improve our websites and applications, we are unable to individually respond to tickets. Δ Sales and Partnerships Interested in working with us? Fill out this form and we'll reach out if we think there is a good fit! Δ Sitemap About Us Press Brand Guidelines Careers Contact Us Our Properties theCHIVE CHIVE TV theCHIVERY CHIVE Charities Buy me Brunch William Murray Golf TERMS OF USE • COPYRIGHT\n\t\t\t© 2025 CHIVE MEDIA GROUP, LLC. ALL RIGHTS\n\t\t\tRESERVED"
    },
    {
      "url": "https://vchiefs.com/",
      "text": "vChief | Interim Executives | Remote Placements Get your monthly cost for fractional leadership—instantly. Start Your Estimate WHO WE SERVE ALL INDUSTRIES CHARTER SCHOOLS COMMUNITY DEVELOPMENT EDUCATION & EDTECH HEALTHCARE NONPROFITS POLITICAL ORGANIZATIONS PROFESSIONAL SERVICES OTHER INDUSTRIES OUR TALENT FRACTIONAL EXECUTIVES ROLES WE FILL OUR COMPANY ABOUT OUR PROCESS RESOURCES PRICING CALCULATOR FAQS BLOG NEWS CASE STUDIES TESTIMONIALS WHO WE SERVE ALL INDUSTRIES CHARTER SCHOOLS COMMUNITY DEVELOPMENT EDUCATION & EDTECH HEALTHCARE NONPROFITS POLITICAL ORGANIZATIONS PROFESSIONAL SERVICES OTHER INDUSTRIES OUR TALENT FRACTIONAL EXECUTIVES ROLES WE FILL OUR COMPANY ABOUT OUR PROCESS RESOURCES PRICING CALCULATOR FAQs BLOG NEWS CASE STUDIES TESTIMONIALS Hire a vChief Get the Right People on Your Team, Right Now Flexible & remote executive staffing solutions that add capacity, fill gaps, and drive growth. How We Work Meet Our Talent Fractional Executive Talent Tailored to Your Needs We specialize in nonprofit, education, political, healthcare, and professional services. Learn about vChief’s experience in your industry. Chief of Staff Associate Chief of Staff Chief Operating Officer Chief of Staff Associate Chief of Staff Chief Operating Officer HR Business Partner Chief Financial Officer Integrator Chief Financial Officer Integrator HR Business Partner Experience the vChief Difference  Custom Talent Matching Get strategic, remote support tailored to your needs without the headache of creating a job description. Our placement process begins with a comprehensive needs assessment to understand the best way our talent can support you and your organization.  Strategic Leadership & Support Expand the capacity of your leadership team with a thought partner whose skills and experience fill your organization’s gaps. Our talent brings industry expertise and expert leadership skills honed through an average of 12 years of management experience.  Immediate Impact Offload strategic business initiatives and large scale projects onto a capable leader. vChiefs make themselves indispensable from day one. Learn why 88% of clients recommend our services. Try vChief for 20 hours, risk-free—with any new engagement. Love our support, or your money back. Read Our Success Stories Meet Top Candidates in One Week  1. Needs Assessment Our team evaluates your organization’s strengths, understands your objectives, and identifies gaps.  2. Talent Matching Within one week, we recommend 2 to 5 candidates from our network of 400+ leaders whose skill sets and industry expertise meet your needs. vChief works with and recruits remote candidates.  3. Candidate Selection You interview your top 2 or 3 candidates with no obligation to sign a contract. Selected candidates can start within 2 weeks. Meet Our Talent Positioning Leaders for Success Everywhere Get Fractional Leadership with Measurable ROI Chief of Staff | Community Development Nonprofit Secured nearly $8M in funding to attract tens of millions in private investment for small businesses in the US’s most impoverished county—a 4,794% ROI Associate Chief of Staff | Professional Services Supported a co-founder with 10 hours/week during a leader’s parental leave freed up the co-founder’s time to focus on sales, leading to $50K in closed deals Chief of Staff | Charter School Drove 12,505% ROI by exceeding the ambitious enrollment target, resulting in $4.8M in additional revenue in less than 7 months Chief of Staff | Community Development Nonprofit Hired, onboarded, and mentored over 10 new team members Chief Operating Officer | Political Organization Realized $200K in cost savings and increased efficiency by driving change management during a transition period, implementing collective bargaining, new contracts, and HR systems This help is ridiculously good. Very high quality. My chief of staff Kara has a great willingness to do anything, provide advice as a thought partner, and get involved and invested to the level she feels like a teammate. I just wish I had even more of her time. I love working with her and regularly recommend vChief services to other leaders I know. - Akshai Patel CEO, Phoenix Collegiate Academy Alissa was a joy to work with. Her work ethic and expertise was invaluable to the organization as we navigated staffing and programming changes emerging out of the pandemic. - Nicole Hebert Operations Manager, Davis Art Center Alexis was amazing. She quickly got up to speed and added value across many different areas. Her project management and people skills allowed her to quickly build trust across the org and become a seamless member of the team. - Debra Kurshan Chief Operating Officer, Propel America Due to her strong skills and experience, Brenda was able to quickly assess our needs and offer deliverables to meet our needs. She was a delight to work with and very supportive. - Yvonne Campbell Therapist, ZoeRVA Health vChief has been a vital source of talent for chief of staff needs for our organization. The chiefs of staff we have worked with have all brought expertise and commitment to advancing our work and culture. We would not be making the progress we are in our mission or in our organization without this support! - Joe Doctor Chief Operating Officer, National Board of Teaching Professionals The vChief Client Success team is highly professional, efficient, and responsive, providing us with invaluable insights and strategic guidance. I highly recommend VChief to any organization looking to enhance their executive capabilities and achieve their goals more effectively. - Olu Ibrahim Founder and President, Kids In Tech Yinnie is a true professional, she was systematic in her approach to her projects, communicative every step of the way, and thoughtful both about what she was proposing and my ability to implement her recommendations across the organization. I would highly recommend her work, and that of vChief, to others! - Sara Bokhari Chief Operating Officer, Build.Excel.Sustain vChief’s HR consulting services have been a game-changer for our organization. Their expertise in strategic planning, employee engagement, and talent management has transformed our HR processes, making them more efficient and effective. The vChief team brought a wealth of knowledge and customized solutions that addressed our unique challenges, resulting in improved employee satisfaction and retention. Their proactive and professional approach has not only helped us navigate complex HR issues but also fostered a positive and productive workplace culture. We highly recommend vChief to any organization seeking top-notch HR consulting services. - Erol Yildirim Chief Operating Officer, The Center for Regional Economic Competitiveness (CREC) Our vChiefs deep knowledge of operations and know-how in growing businesses were impressive to experience. She listened well, asked clarifying questions and got to work quickly. She produced actionable ideas, frameworks and insights to help us gain clarity on what we wanted and/or needed to do. Where she didn’t have direct experience, she was thorough and timely with research to provide data or contacts for support. Our vChief was easy to work with, kept communication lines open and ensured our needs were met. She exceeded our expectations, and we are grateful for her partnership. - Christine Noffz Founder, BenchStrength Coaching, LLC Kerry was fantastic. We easily got on a productive and efficient cadence. She seamlessly jumped into our workflow given her extensive background in the field, and her senior leadership experience. In addition to all of the technical and operational support, Kerry also served as a senior advisor to me, supporting strategic decision-making. 10/10 overall! - Andrea Zayas Executive Director, Journey into Education & Teaching Brittany was incredible! She first supported us as part of the pro-bono project, and we continued working with her beyond this timeframe because she added so much value to our small and growing non-profit. She was incredibly meticulous, a powerful thought partner, and she was able to foresee challenges and find solutions. - Priya Iyer Founder & CEO, Our Roots vChief set me free to be the start-up entrepreneur I needed to be in a fast paced logistics & supply chain industry. My chief of staff was able to help build the behind the scenes strategy and execute on key processes (payroll, scheduling, employee relations, etc.) so that I could be the outward face of the organization. Our launch at Stubbs Logistics simply wouldn’t have been as successful without Alex. - Dr. Annis Stubbs Founder & CEO, Stubbs Logistics I can not say enough positive things about the experience of working with vChief! OPEN Madison – Out Professional Engagement Network was so fortunate to have been awarded this pro bono service program! This has been a game changer for us! To everyone at vChief, we have not taken this opportunity for granted and we thank you for your confidence in us! I don’t know what I am going to do w/o our CoS, who is the most amazingness of all! We appreciate you! - Heidi Duss Board President, OPEN My vChief has helped me to be able to breathe and then accomplish a variety of strategic business development goals that I have been putting off for years! Very different than a subcontractor accomplishing tasks, I feel like I have a strategic partner invested in my business’ growth. - Deb Hanmer Breakthrough Leadership Consulting The SkillUp leadership team likes to debate and ponder, deliberately. But decision making has occasionally proven slow and cumbersome, because no one individual was coordinating and facilitating across all of SkillUp’s work streams. Edith helped us to coordinate in a much more effective manner, which allowed us to make decisions quickly and with more clarity. It’s been a huge benefit to the organization. We’ve loved having Edith on the team. She’s a quick learner, and after only a couple of months part time, has already provided tremendous value. - Steven Lee Executive Director Working with Meghan has been great, she’s helped us create our Board Charter and build out our Strategic Plan both have been a huge help. Meghan has been a sounding board for me and I think we collaborate really well together. - Jessica Hatem Executive Director Kate consistently takes projects on from start to finish, ensuring completion, with very little direction. I can turn projects over to her and she runs with them, freeing up my time considerably and taking items off of my plate. She is also a valued team member and has taken the time to get to know each of the work styles of all of the members of our team. - Jessica de Barros Education - Charter Schools, Washington State Charter School Commission Jenn was a huge asset to me personally and to TFA Baltimore during a period of transition between Chiefs of Staff. She was incredibly fast at getting up to speed on context and building relationships and able to add value almost immediately. I was so grateful to have her support during a critical period for our organization and team. - Courtney Cass Executive Director, Teach For America Baltimore Our consultant from vChief has brought valuable experience and perspectives, enabling me to handoff key projects with confidence. - Monisha Kapila Co-CEO, Pro-Inspire I was often told that if I got a Chief of Staff my life would change, but now I know it from experience. My days are spent the way a CEO should spend them now, and our business is booked farther in advance then we ever had bookings before. We’re a more efficient, well-run business because of her addition. - Heather Mason Founder & CEO, Caspian Agency vChief matched us with executive strategy support and thought partnership that has added significant capacity to our leadership team. - Elissa Salas CEO, College Track Not Sure What Support You Need? Let our team of expert business consultants uncover the perfect solution for your unique pain points. In your complimentary needs assessment, we’ll evaluate which role will best meet your needs. Need some peace of mind? Every new engagement includes 20 hours, risk-free. Love our support, or your money back. Take Your Needs Assessment Start Hiring Become a vChief Our Company Press Blog Contact Us Follow Follow Follow Follow Follow Stay in the Know Leadership, productivity, and future of work topics delivered to your inbox Subscribe Privacy Policy | Terms of Use | Copyright 2025 vChief, LLC, All Rights Reserved. Contact us: info@virtualchiefofstaff.com × Curious What Fractional Leadership Costs? Answer 5 quick questions and get your estimate instantly. It takes less than 1 minute. No strings and no sales call required. Get Your Instant Estimate"
    },
    {
      "url": "https://www.thechivery.com/blogs/the-chivery-herald/a-word-from-chivery-customer-service",
      "text": "The Chivery Customer Service | Get To Know The Chivery Crew Skip to content Men Apparel T-Shirts Sweatshirts & Hoodies Accessories Hats Stickers, Pins, & Patches Wall Art & Flags Drinkware Collections Halloween Christmas Drinking Best Sellers Football Movies & TV The Shack Coffee Dogs St Patrick's Day Father's Day Brand Busch Buy Me Brunch Chive Tees Chive Nation Chris Farley Natural Light theCHIVE Women Apparel All Women's Cut Apparel Women's & Unisex T-Shirts Women's Tank Tops Women's & Unisex Sweatshirts & Hoodies Accessories Hats Stickers, Pins, & Patches Wall Art & Flags Drinkware Collections Halloween Christmas Drinking Best Sellers Football Movies & TV The Shack Coffee Dogs St Patrick's Day Father's Day Brand Busch Buy Me Brunch Chive Tees Chive Nation Chris Farley Natural Light theCHIVE Best Sellers Rare Coins Brand All Chive Rare Coins Bill Murray Rare Coins theCHIVE Rare Coins Miscellaneous Display Case Challenge Coins New Sale Account Track my Order Contact/Help Chive Points Cart Spend $75.00 more and get free shipping! Your cart is empty PUT YOUR BEST FOOT FORWARD WITH OUR BEST SELLERS FREE SHIPPING ON ORDERS OVER $75 *EXCLUSIONS APPLY 📦 SHIPPING AND PRODUCT INFO PUT YOUR BEST FOOT FORWARD WITH OUR BEST SELLERS FREE SHIPPING ON ORDERS OVER $75 *EXCLUSIONS APPLY 📦 SHIPPING AND PRODUCT INFO Men Men Apparel T-Shirts Sweatshirts & Hoodies Accessories Hats Stickers, Pins, & Patches Wall Art & Flags Drinkware Collections Halloween Christmas Drinking Best Sellers Football Movies & TV The Shack Coffee Dogs St Patrick's Day Father's Day Brand Busch Buy Me Brunch Chive Tees Chive Nation Chris Farley Natural Light theCHIVE Women Women Apparel All Women's Cut Apparel Women's & Unisex T-Shirts Women's Tank Tops Women's & Unisex Sweatshirts & Hoodies Accessories Hats Stickers, Pins, & Patches Wall Art & Flags Drinkware Collections Halloween Christmas Drinking Best Sellers Football Movies & TV The Shack Coffee Dogs St Patrick's Day Father's Day Brand Busch Buy Me Brunch Chive Tees Chive Nation Chris Farley Natural Light theCHIVE Best Sellers Best Sellers Rare Coins Rare Coins Brand All Chive Rare Coins Bill Murray Rare Coins theCHIVE Rare Coins Miscellaneous Display Case Challenge Coins Challenge Coins New New Sale Sale Search Track my Order Contact/Help Chive Rewards Now reading: A Word From Chivery Customer Service Share Prev Next August 15, 2016 A Word From Chivery Customer Service The Chivery's customer care team is available five days a week, from 9 a.m. to 5 p.m. CT, to assist you. We are REAL-LIFE, BREATHING, HUMAN BEINGS who live theCHIVE culture. We're here to answer your questions as quickly as possible  — within 24 hours! — and do so with a smile and an ol' spring in our step. Because we understand regular office hours can be limiting (bosses, amiright?), we offer a ton of ways to get in touch. MEET THE TEAM! Patrick “Patty” McManis is Director of Customer Experience. Blessed with the best customer service team in the business, he has been with theCHIVE for almost 5 years and has seen just about everything. Patrick wants to be a beekeeper on Venus when/if he retires. Patrick’s Favorite Tee: Beer Hunt Tee Jessica is a veteran of the customer service industry having worked and managed multiple customer service departments over the years. Her experience and expertise are unmatched in the industry! Jessica’s Favorite Tee: Whiskey Made Me Do It Kyle is another veteran of the customer service industry. Personable and friendly, Kyle is always here to help a customer with any questions they may have. Kyle is also a big fan of the Chicago Cubs so if you get him on chat, make sure to say “Go Cubs Go!\" Kyle’s Favorite Tee: Windy City Keep Calm and Chive On Chicago Emily is our customers’ favorite! Chivers are always asking for Emily because of her diligence in taking care of their issues and her personable attitude. Watch out for Emily! She’s quick with the right answers and always shoots from the hip! Emily’s Favorite Tee: Polite As Fuck At the end of the day, The Chivery Customer Care team is committed to improving your experience in any way we can. We promise to listen to your feedback and constantly get better. We know the best ideas come from you, our wonderful customers! LET US KNOW YOUR THOUGHTS!!! Written by Abra Clark-Van Brunt theCHIVE Cribs Presents: New FlexFit Hats Go for the Gold with The Chivery's USA gear! WELCOME TO THE CHIVERY At The Chivery we’ve made it a mission to become the backbone of your wardrobe. You’ve got enough dressy sh*t for work and for impressing a date. But we both know you don’t have enough comfortable t-shirts. What do you do when you finally get some down time and all your favorite shirts are dirty? You definitely don’t want to be wasting all your time doing laundry. The Chivery is here to make sure you’re prepared for anything; for a day of chill, a night out with friends, a booty call, or the inevitable day when NASA calls on you to save the planet. The Chivery is a U.S. Registered trademark of Resignation Holdings, LLC. All Rights Reserved. Copyright © 2025 Stay up to date on everything CHIVE related Make sure to sign up for our newsletter to stay up to date. Subscribe © The Chivery One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. × Congratulations on converting your CHIVE Trivia points to CHIVE Rewards! You can now use these points to get\n          coupons and discounts on probably the best ecommerce site in the world. Redeem Now or Keep Shopping × Congratulations! Your discount coupon has been successfully applied to your cart. Continue"
    }
  ]
}