{
  "fuentes": [
    {
      "url": "https://www.giftly.com/gift-card/chops-hops-axe-throwing-lodge-fort-lauderdale",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/chops-hops-axe-throwing-lodge-fort-lauderdale",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://nicelocal.com/fort-lauderdale/entertainment/chops_plus_hops_axe_throwing_lodge/",
      "email": "corp@zoon.ru"
    }
  ],
  "mails": [
    "corp@zoon.ru",
    "corporate@giftly.com",
    "merchants@giftly.com"
  ],
  "nombre_sitio": "chopsandhopsfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.giftly.com/gift-card/chops-hops-axe-throwing-lodge-fort-lauderdale",
      "text": "Chops + Hops Axe Throwing Lodge Gift & Greeting Cards - Email, Text or Print - 115 NW 6 St, Fort Lauderdale, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Fort Lauderdale Going Out Chops + Hops Axe Throwing Lodge Chops + Hops Axe Throwing Lodge Gift Card Chops + Hops Axe Throwing Lodge Giftly A beautiful gift card alternative for Chops + Hops Axe Throwing Lodge Chops + Hops Axe Throwing Lodge 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Chops + Hops Axe Throwing Lodge (227) Categories Axe Throwing, Venues & Event Spaces, Cocktail Bars Location 115 NW 6 St, Fort Lauderdale, FL Gift Tips Try the MF Margarita for a refreshing and flavorful cocktail experience. The espresso martinis are highly recommended for a delicious and creamy treat after some axe throwing. Engage with the staff as they provide helpful tips and techniques for throwing axes and ensuring a fun time. Enjoy the upbeat environment with music that keeps the energy high while competing with friends. Consider booking a private cage for parties or group events, as this is a fantastic way to celebrate any occasion. Click here to send a gift up to $1,000 with the suggestion to use it at Chops + Hops Axe Throwing Lodge. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Chops + Hops Axe Throwing Lodge Price $$ Ambience Classy Year Established 2018 Hours Thursday: 4PM-12AM Friday: 4PM-2AM Saturday: 12PM-2AM Sunday: 12PM-12AM Chops + Hops Axe Throwing Lodge offers a unique blend of excitement and relaxation in Fort Lauderdale. This venue caters to both thrill-seekers and casual drinkers, featuring bright and welcoming spaces where guests can enjoy axe throwing under the guidance of skilled instructors. With an emphasis on creating a memorable experience, patrons can indulge in craft cocktails while enjoying friendly competition with friends or celebrating special occasions. Though food options may vary, guests can rely on a lively ambiance enriched by upbeat music and the camaraderie that comes from sharing the thrill of throwing axes. Whether it's a team-building event, a fun night out, or a date night, Chops + Hops provides a distinctive atmosphere and an enjoyable outing for everyone. Great Alternatives Gift $100 for Axe Habits : Axe Habits in Palmetto Bay offers a thrilling experience for axe throwing enthusiasts of all skill levels, making it the perfect destination for a fun and unique outing. Buy a Gift & Greeting Card for Delirium Axe Throwing : Delirium Axe Throwing in Miami delivers a thrilling and unique experience where customers can unleash their inner lumberjack while enjoying a fun-filled evening of axe throwing with friends and family. Updated: September 08, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Chops + Hops Axe Throwing Lodge gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Chops + Hops Axe Throwing Lodge. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Chops + Hops Axe Throwing Lodge or anywhere else they like! Top Related Gifts Amerant Bank Arena Where the Excitement Comes Alive 1 Panther Pkwy, Sunrise, FL 3.7 (51) • Music Venues E11EVEN Elevate Your Night Out in Miami 29 NE 11th St, Miami, FL 3.4 (613) • $$$ • Dance Clubs Elbo Room Catch Live Vibes on the Beach 241 S Ft Lauderdale Beach Blvd, Fort Lauderdale, FL 3.4 (392) • $ • Dive Bars Casa Florida Classic Cocktails, Timeless Miami Charm 437 SW 2nd St, Miami, FL 3.6 (308) • $$ • Cocktail Bars 321 Slammer Where Fun and Friends Come Together 321 W Sunrise Blvd, Fort Lauderdale, FL 3.6 (28) • $$$ • Gay Bars Stache Drinking Den Sips of History, Tastes of Today 109 SW 2nd Ave, Fort Lauderdale, FL 4.1 (251) • $$ • Whiskey Bars Rhythm & Vine Good Times, Great Music, Chill Vibes 401 NE 5th Ter, Fort Lauderdale, FL 4.1 (350) • $$ • Music Venues Rooftop @1WLO Garden in the Sky, Sips and Bites 1 W Las Olas Blvd, Fort Lauderdale, FL 4.1 (529) • $$ • Cocktail Bars More Nearby Businesses Twice Removed 3301 NE 33rd St, Fort Lauderdale, FL 4.6 (296) • $$ • Cocktail Bars The Federal 800 NE 8th St, Fort Lauderdale, FL 3.9 (69) • $$ • Cocktail Bars Milk Money Bar & Kitchen 815 NE 13th St, Fort Lauderdale, FL 4.1 (1.3k) • $$ • Cocktail Bars Booze Garden 111-A SW 2nd Ave, Fort Lauderdale, FL 3.6 (106) • $$ • Cocktail Bars Terrace 555 Restaurant and Bar 555 NW 62nd St, Fort Lauderdale, FL 4.0 (10) • $$ • Cocktail Bars Maass 525 N Fort Lauderdale Beach Blvd, Fort Lauderdale, FL 4.0 (67) • Wine Bars Sparrow 299 N Federal Hwy, Fort Lauderdale, FL 3.5 (316) • Cocktail Bars Plum Lounge 1 Seminole Way, Fort Lauderdale, FL 4.1 (13) • $$ • Lounges Lucky's Tavern 214 SW 2nd St, Fort Lauderdale, FL 3.7 (51) • $$ • Dive Bars O Lounge 333 Las Olas Blvd, Fort Lauderdale, FL 3.7 (49) • $$ • Lounges Blue Jean Blues 3320 NE 33rd St, Fort Lauderdale, FL 3.7 (273) • $$ • Jazz & Blues No Man's Land 666 N Federal Hwy, Fort Lauderdale, FL 4.1 (159) • Cocktail Bars Players Sports Bar & Grill 5280 N State Rd 7, Fort Lauderdale, FL 3.2 (64) • $$ • Sports Bars The Field Irish Pub & Eatery 3281 Griffin Rd, Fort Lauderdale, FL 4.3 (979) • $$ • Pubs The Wharf Fort Lauderdale 20 W Las Olas Blvd, Fort Lauderdale, FL 3.8 (419) • $$ • Cocktail Bars 511 Bar & Lounge 511 NE 3rd Ave, Fort Lauderdale, FL 4.9 (14) • $$ • Cocktail Bars Marina 84 2440 W State Rd 84, Fort Lauderdale, FL 3.2 (251) • $$ • Sports Bars Apothecary 330 330 SW 2nd St, Fort Lauderdale, FL 4.1 (288) • $$ • Cocktail Bars Blue Martini Lounge 2432 E Sunrise Blvd, Fort Lauderdale, FL 3.1 (434) • $$ • Lounges Nubé Rooftop 505 N Fort Lauderdale Beach Blvd, Fort Lauderdale, FL 4.0 (267) • Lounges Swizzle Rum Bar & Drinkery 4 W Las Olas Blvd, Fort Lauderdale, FL 4.7 (23) • Cocktail Bars Laser Wolf 901 Progresso Dr, Fort Lauderdale, FL 4.3 (236) • $$ • Dive Bars Revolution Live 100 SW 3rd Ave, Fort Lauderdale, FL 3.1 (209) • $$ • Music Venues BalQony 505 N Fort Lauderdale Beach Blvd, Fort Lauderdale, FL 3.1 (8) • Cocktail Bars The Etna Rosso 3354 N Ocean Blvd, Fort Lauderdale, FL 4.7 (545) • $$ • Wine Bars Bamboo Beach Tiki Bar & Cafe 4040 Galt Ocean Dr, Fort Lauderdale, FL 3.4 (413) • $$ • Tiki Bars Capone's 310 Himmarshee St, Fort Lauderdale, FL 2.7 (146) • $$ • Dance Clubs Euro Night Club 120 SW 3rd Ave, Fort Lauderdale, FL 2.6 (75) • $$ • Dance Clubs Palm Room 825 E Las Olas Blvd, Fort Lauderdale, FL 4.2 (54) • $$ • Cocktail Bars The Hub Spark 828 NE 4th Ave, Fort Lauderdale, FL 4.8 (101) • $$ • Lounges Laudy Bar 433 NW 1st Ave, Fort Lauderdale, FL 4.5 (77) • $$ • Cocktail Bars Kiki's 455 State Rd 84, Fort Lauderdale, FL 3.2 (54) • $$ • Cocktail Bars Cigar Republic USA 3337 E Oakland Park Blvd, Fort Lauderdale, FL 4.6 (73) • $$ • Lounges Vinos On Las Olas 901 E Las Olas Blvd, Fort Lauderdale, FL 4.3 (270) • $$ • Wine Bars Bokampers Sports Bar & Grill 100 Terminal Dr, Fort Lauderdale, FL 3.3 (208) • $$ • Sports Bars The Easton Rooftop Pool & Lounge 721 N Federal Hwy, Fort Lauderdale, FL 3.7 (60) • $$ • Lounges Original Fat Cat's 320 SW 2nd St, Fort Lauderdale, FL 4.3 (242) • $$ • Bars The Den Sports Bar and Lounge 201 SW 2nd St, Fort Lauderdale, FL 4.2 (98) • $$ • Sports Bars Slackers Bar & Grill 995 Marina Mile Blvd, Fort Lauderdale, FL 3.4 (322) • $$ • Sports Bars Hunters 2232 Wilton Dr, Fort Lauderdale, FL 3.8 (122) • $$ • Gay Bars America's Backyard 100 SW 3rd Ave, Fort Lauderdale, FL 3.0 (249) • $$ • Dance Clubs Ebar Club 13 209-215 SW 2nd St, Fort Lauderdale, FL 2.1 (43) • $$ • Dance Clubs See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Axe Throwing Venues & Event Spaces Cocktail Bars 4.7 200-299 4 single place gcdp gift_and_greeting_card_in_title_tag Fort Lauderdale, FL XL L Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://nicelocal.com/fort-lauderdale/entertainment/chops_plus_hops_axe_throwing_lodge/",
      "text": ""
    }
  ]
}