{
  "fuentes": [
    {
      "url": "https://christianagaudet.com/tarot-news/2022/4/20/a-legit-mystical-experience",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2022/4/20/a-legit-mystical-experience",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://www.gaudet-luce.co.uk/contact-us/",
      "email": "golfshop@gaudet-luce.co.uk"
    },
    {
      "url": "https://christianagaudet.com/missing-content",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/missing-content",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/-tarot-reader-in-the-news",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/-tarot-reader-in-the-news",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/private-readings",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/private-readings",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "charity@eventbrite.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "ebhelp@eventbrite.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "installments@eventbrite.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "nonprofit@eventbrite.ca"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "orders@eventbrite.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "press@eventbrite.com"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "email": "sales@eventbrite.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "email": "constl8@aol.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "email": "jeanne@tarotworks.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "email": "ne@tarotworks.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/events/2021/7/23/tarot-masters-conference-at-omega-institute-in-rhinebeck-new-york",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/events/2021/7/23/tarot-masters-conference-at-omega-institute-in-rhinebeck-new-york",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/events/2024/10/26/tarot-workshop",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/events/2024/10/26/tarot-workshop",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://christianagaudet.com/news",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/news",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://www.christiancareercenter.com/",
      "email": "andrea@bethanybible.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2019/11/6/managing-our-resources",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2019/11/6/managing-our-resources",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/events",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/events",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/introducing-christiana",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/introducing-christiana",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://tarotbychristiana.com/tarot-news/2021/1/6/seeking-clarity",
      "email": "cgaudet@staarcon.com"
    },
    {
      "url": "https://tarotbychristiana.com/tarot-news/2021/1/6/seeking-clarity",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://tarotbychristiana.com/tarot-news/2021/1/6/seeking-clarity",
      "email": "tarot@christianagaudet.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2021/11/17/the-inside-and-the-outside",
      "email": "cgaudet@staarcon.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2021/11/17/the-inside-and-the-outside",
      "email": "christiana@tarotbychristiana.com"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2021/11/17/the-inside-and-the-outside",
      "email": "tarot@christianagaudet.com"
    }
  ],
  "mails": [
    "andrea@bethanybible.com",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "cgaudet@staarcon.com",
    "charity@eventbrite.com",
    "christiana@tarotbychristiana.com",
    "constl8@aol.com",
    "ebhelp@eventbrite.com",
    "golfshop@gaudet-luce.co.uk",
    "info.nairobi@skanem.com",
    "installments@eventbrite.com",
    "jane@skanem.ke",
    "jeanne@tarotworks.com",
    "ne@tarotworks.com",
    "njogu@skanem.com",
    "nonprofit@eventbrite.ca",
    "olive.kunihira@skanem.com",
    "orders@eventbrite.com",
    "press@eventbrite.com",
    "sachen.gudka@skanem.com",
    "sales@eventbrite.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "tarot@christianagaudet.com"
  ],
  "nombre_sitio": "christianagaudet.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://christianagaudet.com/tarot-news/2022/4/20/a-legit-mystical-experience",
      "text": "A Legit Mystical Experience — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account A Legit Mystical Experience Tarot Topics Newsletter Apr 20 Written By John Gaudet Have you ever had an experience that felt mystical, psychic, or spiritual to you, but you were not sure if it might have been your imagination? Have you ever acted on something that you felt spiritually led to do, only to find the outcome was not what you expected? Have you wondered if the dream you had of your deceased loved one was a visitation, or simply a dream? These are questions that most people have asked. It can be difficult to discern what a valid spiritual experience is. Sometimes we feel as if we receive a sign from the Universe, but then we wonder if that sign was sent by Spirit, or something we just thought of ourselves. Experiences that we categorize as spiritual, mystical, or psychic can include receiving messages from Spirit or having precognitive vision or insight. These can happen in our waking hours or in sleep. They can happen when we ask for guidance in meditation or divination, or they can come unbidden. Psychic experiences can include physical sensations. Sometimes we write off a health indicator as a spiritual phenomenon, when really our body is telling us to go see a doctor. It is possible, too, for a person who is having a psychotic experience to believe they are in contact with Spirit. It is important to seek out medical advice if you are unsure about something you are experiencing, either physically or mentally. Is there a sure-fire way to tell if the experience we are having is a true spiritual experience? The simple answer is no. But there are some important things to consider. The validity of an experience is entirely in the value of the information we receive. If we receive knowledge, comfort, insight, or sound advice, the source of the guidance is less important. Sometimes, we can do divination after the fact to discern the source of the guidance and find even greater insight and comfort in that knowledge and process. Here is a place where the phrase ‘As Above, So Below’ can be helpful. This is a reminder that the mundane and the spiritual can work together and can sometimes be one and the same. Even if helpful insight and guidance comes from your own intelligence and imagination, there is something truly spiritual about that process. It may not be the same a receiving information from a deceased loved one, but it is still a valuable spiritual experience. There are some messages that we receive that are not mystical, spiritual, or psychic. If you receive a ‘message’ that guides you in a way that is unhelpful, you must do some discernment. Does the ‘message’ you received confirm something you fear or desire? Does the ‘message’ you received offer you an action plan that does not make sense? It can be easy to convince ourselves that we are receiving mystical knowledge that tells us to stay in a bad relationship, for example, or that wonderful things will be bestowed upon us with no effort from ourselves. A good rule to follow is this. If the message you receive is unhelpful or illogical, it may not be legit. Take time to meditate and perform divinations on the messages you receive to discover their source, and their legitimacy. True spirituality can stand up to scrutiny. The StaarCorner: StaarCon 2023 For the past two years at StaarCon, our Friday program has been a preconference intensive with a single presenter. For StaarCon 2023 we are going to create an intensive experience with more learning opportunities. On Friday, January 20, we will offer several intensive classes with exciting instructors. For example, on Friday morning, Nancy Hendrickson will teach a three-hour intensive entitled Digging Up the Royals. in this class you will be using the tarot Court Cards to work the with Ancestors or Beloved Dead and divine the future. As with all StaarCon classes, you will have access to recordings of all the intensive classes during the thirty-day AfterGlow on Accelevents. We are excited with all the ways StaarCon is growing in 2023! Join the StaarCon Mailing List! Vet Your Messages with Tarot Divination with tarot can help you understand the messages that you receive throughout your day, as well as from your dreams. If you have received a sign that seems important, ask some questions of your cards to get further insight. The first question you can ask is, “Was this a legit message?” You can also ask, “Was this a message from my mother in spirit?” You can ask things like, “How should I act on this message?” and “What do I need to know about this message?” Tarot can help us stay grounded as we interact with the Universe. Northeastern Spring Tarot Tour I will be in Connecticut May 26 through June 5. I will be offering private readings at True Bikram Yoga in Madison, Ct. I am available for house calls and psychic house parties throughout Connecticut. I am also able to travel to Rhode Island, Massachusetts, and New York. As always, my available time will book quickly. Please call or text me at 561-655-1160 to schedule your appointment. I am so excited to see my northeastern friends this spring! The Week in Review Did you catch my class on Monday, “How to Say What You See”? In tarot reading, communication is everything! Watch the replay to learn ways to communicate about the cards when you read for others. From Around the Web In keep with our topic this week, here is an article about being a skeptical believer in tarot . It is smart to be discerning, even as we are spiritual. Here is an article on Patheos about discerning mystical experiences . Here is an new study from the University of New England about the differences between spiritual emergence and psychosis. Tarot Class: Personal Healing with Tarot On Thursday, April 28, from 7 pm to 9 pm, I will be teaching a special class in person in Palm City and live on Zoom. Have you ever thought that your tarot deck, and your tarot practice, could help nurture your well-being? Using the special techniques you will learn in this class, your cards can become a tool of healing, as well as a source of wisdom. This class is appropriate for any level of tarot knowledge, from beginner to expert. Tickets are $40 and are available on EventBrite to attend in person in our office in Palm City, or virtually using Zoom. Please allow 2 business days for your Zoom links to arrive in your email if you are attending virtually. The recorded workshop will be available on cardandcraftacademy.com after May 5th if you can’t attend on April 28th Please visit ChristianaGaudet.com for more information! Sign Up Now on EventBrite! Guidance on the Journey When you have received a profound dream, an insightful reading, or a sign from the Universe, take your time to interpret it and reflect on it. Go for a walk and allow the insight to sit with you. Ask for further guidance. When a flash of insight comes, it can be easy to take that at face value. Yet, any insight of value can and should stand up to some thought, some digging and some delving. Take your time to unfold and unwrap the information you receive. It is in this process that information of little value will fall apart, and information of great value will become cemented in your foundation. Join Christiana's YouTube Members Only Channel! Events and Tours Featured Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Schedule an Appointment with Christiana! Card and Craft Academy Classes presented by Christiana are available right now at Card and Craft Academy! Christiana’s Candle Magick Christiana’s Eleven-Card Celtic Cross Finding Meaning in the Minor Arcana The Major Arcana, Magical and Mundane Practical Tarot Techniques Psychic Tarot Personal Tarot: Reading for Yourself Sharing Wisdom: Reading for Others The Meaning and Magic of Tarot Reversals Journey Through the Major Arcana Your Journey Through the Minor Arcana: Numbers, Elements and Truth Tarot Beyond the Veil Your Journey Through the Tarot Court Tarot Stories, Trends, and Blends Tarot Readings for Personalities and Relationships Clarity in Every Tarot Card Tarot Flow Workshop Making Magick with Tarot Fearless Wisdom Tarot Workshop Tarot Keywords and Interpretations Workshop Tarot Spreads Tools and Techniques Workshop Tarot for Magic and Mediumship Tarot Communication for Clarity and Depth Weaving the Tarot Reading Story The Elemental Major Arcana Minor Arcana Numbers, Elements, and Truth Catch up on your missed Zoom webinars and more! cardandcraftacademy.com About Christiana Gaudet Card and Craft, Inc. Southeastern Tarot Artists and Readers, LLC. Christiana Gaudet 3559 SW Corporate Parkway Palm City, Florida 34990-8152 On the web www.christianagaudet.com Online classes www.cardandcraftacademy.com StaarCon information www.staarcon.com Private telephone, Skype, FaceTime and in person readings and instruction are available by appointment. Tarot parties at your home or office are available throughout Florida. Call or text toll free 866-99TAROT (866-998-2768) Palm City 772-301-0232 or call or text 561-655-1160 for more information or to schedule your event. Agent inquiries are welcome. Tarot Topics Newsletter Volume 5 Issue 16 April 20, 2022 Connecticut Tour Nancy Hendrickson Mystical Experience John Gaudet http://johngaudet.consulting Previous Previous In Tune With the Moon Next Next The Language of Dreams Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://www.gaudet-luce.co.uk/contact-us/",
      "text": "Contact Us | Get in touch with us | Gaudet Luce Golf & Leisure Get in touch with us 01905 796375 golfshop@gaudet-luce.co.uk ✕ Home Golf Phoenix Course Phoenix Course Guide Open Events Membership Societies Lady Captain’s Away Day Hadzor Course FootGolf & DiskGolf Driving Range Corporate Golf Golf Coaching Inclement Weather Shop Online Shop Droitwich Pro Shop Grip Shack & Repairs Junior Hardware Custom Fitting Service Members Members Area Booking Apps & Online Accounts Junior Hub Junior Safeguarding The 19th Functions & Events Meetings & Conferences Celebrations Of Life Contact Us News T&C’s Home Golf Phoenix Course Phoenix Course Guide Open Events Membership Societies Lady Captain’s Away Day Hadzor Course FootGolf & DiskGolf Driving Range Corporate Golf Golf Coaching Inclement Weather Shop Online Shop Droitwich Pro Shop Grip Shack & Repairs Junior Hardware Custom Fitting Service Members Members Area Booking Apps & Online Accounts Junior Hub Junior Safeguarding The 19th Functions & Events Meetings & Conferences Celebrations Of Life Contact Us News T&C’s BOOK A TEE TIME GIFT VOUCHERS 0 £0.00 BOOK A TEE TIME GIFT VOUCHERS Get in touch with us If you have any questions about our facilities, courses or our services, please don't hesitate to get in touch! Gaudet Luce Golf Club Middle Lane, Hadzor Droitwich Worcestershire WR9 7JR 01905 796375 golfshop@gaudet-luce.co.uk GET IN TOUCH NOW Phoenix Course Course Open, Buggies On Hadzor Course Course Open Opening Hours Pro Shop Monday - Sunday 7:30am - 4:30pm The 19th Kitchen Monday - Sunday 9am - 4:30pm The 19th Clubhouse Monday - Sunday 9am - 5:30pm Gaudet Luce Golf & Leisure Club Middle Lane Hadzor, Droitwich Worcestershire WR9 7JR 01905 796375 golfshop@gaudet-luce.co.uk Services Home Phoenix Course Hadzor Course Driving Range FootGolf & DiskGolf Golf Coaching Useful links Members Area Contact Us World Handicapping System Booking Apps & Online Accounts Privacy Policy Inclement Weather Policy © 2025 Gaudet Luce Golf Club | All Rights Reserved ✕ BOOK FOR MEMBERS BOOK FOR VISITORS This website uses cookies to improve your experience. By using this website you agree to our Privacy Policy . Read more Accept all"
    },
    {
      "url": "https://christianagaudet.com/missing-content",
      "text": "Missing Content — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Oh Sugar! Something Went Wrong Lots of things might have gone wrong.  The page might have been moved or deleted.  Something on the site might not be working as expected.  Maybe the content is temporarily unavailable. If you think the page might be moved you can search for it using the search form. If you find something wrong with the site you can submit a trouble ticket for my webmaster . If all else fails you can start again from Home or News . Search Form Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/-tarot-reader-in-the-news",
      "text": "Tarot Reader in the News — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Tarot Reader in the News Tarot Topics Newsletter Apr 30 Written By Christiana Gaudet Often it seems that whenever we see a tarot reader in mainstream news, it is a crime story or an offbeat piece. When I first started my business in 1993, I sent press releases to all the local papers announcing classes and charity events I was hosting.  The number of times my stories ran actually surprised me.  I became a go-to person for some of the local reporters.  When they needed a pro psychic's take on something, they called me. The internet has changed things somewhat since then.  I don't mail typewritten press releases anymore.  In fact, most of us just Tweet our daily accomplishments.  The rise of the Blogosphere has blurred the lines between the press and the public.  We communicate with our friends across the globe as easily as our friends down the street. An article, dated April 29, 2011, from the business section of the Beacon-News, a publication of the Chicago Sun-Times caught my eye.  It’s a simple business piece.  Likely, the exposure was part of a package deal for advertising, or it was a really slow news week.  That’s not what matters. What matters is that a professional tarot reader had the business sense to get herself in the news in a positive way. It is in every tarotists’ best interest that the press represents tarot as acceptable and accessible.  It's good for tarot professionals trying to feed their families.  It's good for tarot enthusiasts trying to avoid ridicule and discrimination on the job. A thing of note is that there are absolutely no reader comments on the on-line edition of the article.  There are no protests, no jeers, no jokes.  Many of my peers keep their tarot interest as part of a secret double life.  They think it will scare the neighbors.  Sometimes it does.  But, apparently, not always. Here is the article in its entirety, and a link.  Kudos and good luck, Leah Mueller! Tarot Card Reader Comes to West Downer in Aurora Tarot cards and astrology charts might seem mystical and “out there” to many people, but Leah Mueller assures that she is not in an outer realm. Mueller recently moved Sacred Lotus Astrology and Tarot into a room upstairs at Annie’s Om Towne Fitness at 14 W. Downer Place in downtown Aurora. Mueller, of Aurora, started playing with Tarot cards as a kid after her parents got a deck of cards in the early 1970s. “I could tell there was something really powerful about them,” she said. Mueller went back to reading cards in her mid-20s, mostly for fun. She dabbled in a variety of noncorporate jobs and then started doing professional readings in her 30s once she had more confidence in her abilities. “A lot of it is practice; eventually it is intuitive,” Mueller said about reading Tarot cards. The cards can be read different ways and becomes kind of like a game of chess, she said. “I can give them a comprehensive portrait of what is going on in their life.” Her astrology readings and birth charts help people to know how they fit into the cosmos, she said. But it’s all very grounded, said Mueller, who has a degree in social and human services. She previously had offices in Chicago, Portland, Ore., and Tacoma, Wash. Most recently, she kept busy giving readings on the festival and expo circuit. Mueller still works with out-of-state clients and hopes to now build up her business with local clientele. She offers mini readings starting at $20 and goes up from there. “It’s not that different than doing therapy sometimes. I’m just using different techniques,” she said. “I see my role as that of a counselor.” Mueller will have a grand opening celebration and open house from 2 to 6 p.m. Saturday with refreshments and mini readings. Contact Sacred Lotus Astrology and Tarot at 206-910-6861 or via Facebook. Professional Tarot Press Release Leah Mueller Tarot Business Christiana Gaudet Christiana has been a full-time tarot professional for more than twenty years, and is the author of two books about tarot. In 2008, Christiana was granted the title of Tarot Grandmaster by the Tarot Certification Board of America. Christiana provides readings by phone, Facetime and Skype, and in her office in Palm City, Florida. https://christianagaudet.com Previous Previous And the Flowers Bloom Like Madness in the Spring Next Next Themes Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/private-readings",
      "text": "Private Readings — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Private Readings Call or text 561-655-1160 to schedule your reading with me. My local Palm City Area number is 772-207-1852. My toll free number is 866-99TAROT (866-998-2768). I perform private readings via phone, Skype,  FaceTime, Google Hangout or in person in my office in Palm City, Florida.  I include a recording of your reading at no extra charge. I can mail you a CD or email you a link to download your recording. I offer private readings for individuals and couples. I am also happy to offer consultation for businesses and organizations seeking direction, harmony and growth. My rates start at $40 for a 10-minute session. During your reading, you will have the opportunity to ask questions. I prefer to begin the reading with my first impressions of you, your situations and the energies around you, prior to hearing your questions. You’ll find that I address many of your concerns in this opening segment. I have the ability to discover specific information that can be helpful in career planning, family dynamics, relationships and spiritual growth. I can often receive messages from those who have passed on, and can give you a new perspective that is helpful and healing. As we look to the future, I can offer insight that will help you reach your goals and manifest your dreams. Please call, text or email to schedule your private reading. I offer appointment times  seven days a week at your convenience. Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://www.eventbrite.ca/o/christiana-gaudet-18221039653",
      "text": "Christiana Gaudet Events - 4 Upcoming Activities and Tickets | Eventbrite Eventbrite Eventbrite Find my tickets Log In Sign Up Find Events Create Events Solutions Solutions Event Ticketing Event Marketing Platform Eventbrite Ads Payments Industry Industry Music Food & Beverage Performing Arts Charity & Causes Retail Event Types Event Types Concerts Classes & Workshops Festivals & Fairs Conferences Corporate Events Online Events Blog Blog Tips & Guides News & Trends Community Tools & Features Create Events Contact Sales Get Started Help Center Help Center Find your tickets Contact your event organizer Search events Choose a location autocomplete Contact Sales Create Events Help Center Find my tickets Log In Sign Up Find Events Create Events Solutions Solutions Event Ticketing Event Marketing Platform Eventbrite Ads Payments Industry Industry Music Food & Beverage Performing Arts Charity & Causes Retail Event Types Event Types Concerts Classes & Workshops Festivals & Fairs Conferences Corporate Events Online Events Blog Blog Tips & Guides News & Trends Community Tools & Features Create Events Contact Sales Get Started Help Center Help Center Find your tickets Contact your event organizer Christiana Gaudet Contact A full-time tarot professional for more than twenty years, Christiana Gaudet offers readings and mentoring by phone, webcam and in-person from her office in Palm City, Florida. Â Christiana has been a popular psychic entertainer on radio and television, and at parties and special events. She is a headlining speaker at festivals and conferences throughout the country. Â The author of two books so far, Christiana has been teaching and organizing events for many years. As an organizer and teacher, her priorities include building community, sharing knowledge, and offering opportunities for personal growth and healing. Facebook profile Twitter profile Organizer website Christiana Gaudet Events About Upcoming (4) Past (394) Show more Christiana Gaudet About Events Events Upcoming (4) Past (394) Show more Site Navigation Use Eventbrite Create Events Pricing Event Marketing Platform Eventbrite Mobile Ticket App Eventbrite Check-In App Eventbrite App Marketplace Event Registration Software Community Guidelines FAQs Sitemap Plan Events Sell Tickets Online Performing Arts Ticketing Software Sell Concert Tickets Online Event Payment System Solutions for Professional Services Event Management Software Halloween Party Planning Virtual Events Platform QR Codes for Event Check-In Post your event online Find Events Montreal Health Events Ontario Holiday Events Vancouver Music Events Things to do in Ottawa Things to do in Montreal Things to do in Edmonton Things to do in London Things to do in Halifax Virtual Events All Cities Connect With Us Contact Support Contact Sales X Facebook LinkedIn Instagram TikTok Â© 2025 Eventbrite How It Works Pricing Contact Support About Blog Help Careers Press Impact Investors Security Developers Status Terms Privacy Accessibility Cookies Manage Cookie Preferences Locale Canada (EN) Argentina Australia BelgiÃ« Belgique Brasil Canada (EN) Canada (FR) Chile Colombia Denmark Deutschland EspaÃ±a Finland France Hong Kong Ireland Italia MÃ©xico Nederland New Zealand Ãsterreich PerÃº Portugal Schweiz Singapore Suisse Sverige United Kingdom United States"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/content/conversation-jeanne-fiorini-0",
      "text": "A Conversation with Jeanne Fiorini — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account A Conversation with Jeanne Fiorini Tarot Topics Newsletter Sep 22 Written By Christiana Gaudet Every time I drive through Portland, Maine, I always find myself thinking the same thing.  “I bet this would be a great place to have a tarot business.”  According to Jeanne Fiorini, of Tarotworks.com , it most certainly is. I spoke with Jeanne on the phone a few days ago.  It is always a pleasure to meet a tarot professional who seems like the real deal.  By that, I mean really intelligent, really gifted, really dedicated and really sincere.  Jeanne is all of this, and more. I asked Jeanne how she got started as a tarot professional. Like me, she started her tarot journey in the 1980s.  While going through personal transition, she spent time with a friend who had a tarot deck, and a tarot book.  Those first experiences with tarot impressed Jeanne.  “There’s a lot in my life that doesn’t seem real,” Jeanne thought, “But this does seem real.”  What did she like about tarot?  “Tarot seemed to tell the truth,” she told me.  What an authentic way to start a lifelong relationship with the sacred cards. The book her friend had was Mary K Greer’s “ Tarot for Yourself .”  I had that book too.  I wonder if Mary K Greer, in all her humble grace, really gets how much she has shaped modern tarot, and our experience of it.  Arguably, without her trailblazing work, neither Jeanne nor I would now have a career. This year, Jeanne became a published tarot author herself.  Her new book, \" Tarot Spreads and Layouts: A Users Manual for Beginning and Intermediate Readers ,\" from Schiffer Publishing, has received great reviews from the tarot community. Here’s the part that makes my spine tingle.  Mary K Greer herself gave the book a great review, and actually blogged about it.  What synchronicity and success, to have the author of one’s first tarot book praise your own first tarot book! If that were the end of Jeanne’s tarot story, it would be a happy story indeed.  But Jeanne is moving forward every day.  Her tarot work includes private readings, phone readings, Skype readings, podcasts, webinars, classes, and workshops. Jeanne is getting ready to present a very interesting day-long workshop entitled “Embodying the Symbols of Tarot.”  This is a “Jung and Tarot Workshop,” and will take place in Portland on October 22. Jeanne presents the workshop with Rick Bouchard.  Rick is a clinical social worker and Stage II Candidate at the C.G. Jung Institute in Boston. His in-progress diploma thesis is related to the use of tarot in Jungian analysis. Of course, Jeanne pointed out in our conversation, to tarot folk the connection between Jungian thought and tarot is a no-brainer.  In academia, it is a bit of a courageous step Rick is taking.  Both the Jungian world and the tarot world will be richer for it, I’m sure. This will be the third time Jeanne and Rick have presented this workshop; the first in Portland.  The workshop runs from 10 am -5 pm.  No prior knowledge of Jungian thought or tarot is required to enjoy the workshop. A brief description and contact information for the workshop is available below. Tarot is a field that has many pioneers.  Those pioneers are expanding the ways we work with tarot, and the ways tarot can work for us.  Jeanne Fiorini is such a pioneer. Embodying the Symbols of the Tarot Location:  222 St. John Street, Suite 240  Portland, Maine Cost:   $85.  CEU's 5.5 Minimum participants 10, maximum 25. To Register Mail Full Tuition Payment To: Tarotworks P.O. Box 6873 Scarborough, Maine  04070 If you have questions about Registration, Contact Jeanne Fiorini at: Jean ne@tarotworks.com For More Information and Inquiries About the Workshop Content and Format, Contact Rick Bouchard at: CONSTL8@aol.com COURSE DESCRIPTION: This program will explore the juxtaposition of the Tarot's four suits (pentacles, swords, cups and wands), the four psychological functions (sensation, thinking, feeling, and intuition) and the four corresponding elements (earth, air, water and fire) with various aspects of Jungian psychology (including archetypes and complex theory). Through \"live tarot readings,\" in which participants step into and speak for the cards and images that appear in specially-selected layouts, this day-long workshop will allow participants the opportunity to expand and deepen their practical understanding of Jungian psychology and the Tarot. Several different layouts, techniques and readings throughout the day will allow for a wide variety of opportunities by which to engage in the \"live reading\" process. Prior knowledge of the Tarot and Jungian psychology may be useful, but is not required. Christiana Gaudet Christiana has been a full-time tarot professional for more than twenty years, and is the author of two books about tarot. In 2008, Christiana was granted the title of Tarot Grandmaster by the Tarot Certification Board of America. Christiana provides readings by phone, Facetime and Skype, and in her office in Palm City, Florida. https://christianagaudet.com Previous Previous Purple Pianos, Unicorns and Killer Hot Tubs - A New TV Season Has Begun Next Next The Redemption of Charlie Sheen? Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/events/2021/7/23/tarot-masters-conference-at-omega-institute-in-rhinebeck-new-york",
      "text": "Tarot Masters Conference at Omega Institute in Rhinebeck, New York — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Back to All Events Tarot Masters Conference at Omega Institute in Rhinebeck, New York Friday, July 23, 2021 10:00 AM Sunday, July 25, 2021 5:00 PM Omega Institute 150 Lake Drive Rhinebeck, New York 12572 United States (map) Google Calendar ICS Christiana is delighted to be one of the five presenters for the annual Tarot Masters conference at Omega Institute. Christiana will be joining Mary K. Greer, Rachel Pollack, Madam Pamita, and Shaheen Miro to discuss how we find meaning in the seventy-eight tarot cards. For more information, and to get your tickets, contact the Omega Institute . Source: https://www.eomega.org/discover Posted In: Christiana on Tour Tagged: Omega Institute , New York Events Previous Previous July 19 Tarot Meetup Live on YouTube Next Next July 26 Christiana's Northeastern Summer Tarot Tour Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/events/2024/10/26/tarot-workshop",
      "text": "Tarot Workshop at Mandel Public Library of West Palm Beach — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Back to All Events Tarot Workshop at Mandel Public Library of West Palm Beach Saturday, October 26, 2024 1:00 PM 2:00 PM Mandel Public Library of West Palm Beach 411 Clematis Street West Palm Beach, FL, 33401 United States (map) Google Calendar ICS Christiana Gaudet Presents Tarot 101 Workshop, Saturday, October 26th @ 1 pm at the Mandel Public Library in West Palm Beach. Christiana is excited to offer a free tarot class at the Mandel Library of West Palm Beach four times yearly. Everyone is welcome to attend, regardless of your experience with tarot. Together, we will explore the cards and deepen our understanding of tarot. You don't need to register in advance, so show up and join us!  Bring your tarot deck, but if you don't have one, don't worry; you can borrow one at the workshop. For more information, contact Mandel Public Library . Source: https://wpbcitylibrary.libcal.com/event/13168041 Posted In: Free Event , Tarot Meetup Tagged: Tarot Workshop , Free Class , Mandel Public Library Previous Previous October 13 Psychic Gallery with Christiana Gaudet Next Next October 29 Messages from Spirit Members-only Livestream on YouTube Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://christianagaudet.com/news",
      "text": "News — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Welcome to Tarot by Christiana, the website of Certified Tarot Grandmaster Christiana Gaudet. News Find me on YouTube ! Join us at StaarCon 2025 , Jan 24-26, in person in West Palm Beach or virtually online on Accelevents . Sessions are available by Skype, phone, FaceTime, or Zoom. Call or Text 561-655-1160, or book online . Check out my Linktree ! Book, Deck and Movie Reviews Mar 6, 2021 Plugging in to Electric Lenormand Mar 6, 2021 This psychedelic Lenormand deck brings me back to my youth! With bright colors and clever images, this deck will entertain you and inspire your Lenormand practice. Mar 6, 2021 Oct 31, 2020 The Mahabharata Oracle: Sacred Text, Archetypes, and Universal Truth Oct 31, 2020 From Gita Rash comes a ground-breaking oracle. Here is my review. Oct 31, 2020 Sep 24, 2020 The Tarot Book You Need to Read Sep 24, 2020 Here is my review of Theresa Reed's new book. I love it, and so will you. Sep 24, 2020 Jul 5, 2019 A Review of Tarot for Troubled Times Jul 5, 2019 Tarot for healing the self and the world! Jul 5, 2019 May 21, 2019 A Review of The Moonchild Tarot May 21, 2019 The Moonchild Tarot is exquisite. Check out my review! May 21, 2019 Oct 9, 2018 Creative Divination: Read Tea Leaves & Develop Your Personal Code Oct 9, 2018 Tabitha Dial has written a book that makes tea leaf reading accessible, fun and insightful! Oct 9, 2018 Jun 27, 2018 The Death of Mrs. Westaway, a Thriller Starring Tarot Jun 27, 2018 Tarot’s on the Bestseller List in this great new mystery by Ruth Ware. But did she portray tarot readers accurately? Jun 27, 2018 Jun 24, 2016 A Review of Joe Lee's  LeGrande Circus and Sideshow Tarot Jun 24, 2016 Here's a review of Joe Lee's LeGrande Circus and Sideshow Tarot. Jun 24, 2016 Dec 22, 2010 Holiday Open House 2010 Recap Dec 22, 2010 A review of the Holiday Open House fundraiser held in 2010 in downtown West Palm Beach at the Harvey Building. Dec 22, 2010 Mar 5, 2010 Fantastical Creatures Tarot Review Mar 5, 2010 Christiana reviews the Fantastical Creatures Tarot by Lisa Hunt. Mar 5, 2010 Tarot Topics Newsletter Sep 10, 2025 Is it Courage if You Didn’t Choose It? Sep 10, 2025 This week, we are exploring the courage we all must choose when things don't go our way. Read More → Sep 10, 2025 Sep 3, 2025 Sell It with Your Face Sep 3, 2025 Sometimes facial expressions tell a greater truth, and sometimes they tell a dangerous lie. Read More → Sep 3, 2025 Aug 27, 2025 It’s Getting Hot in Here Aug 27, 2025 How do we cope when things get too hot to handle? Read More → Aug 27, 2025 Aug 20, 2025 Poke It with a Stick Aug 20, 2025 I learn something from my grandkids each time I see them. This week I was reminded of the importance of sticks. Read More → Aug 20, 2025 Aug 13, 2025 Acceptance with a Side of Gratitude Aug 13, 2025 When we face a disappointment or hurt, we must ultimately find acceptance and gratitude in order to move on. Read More → Aug 13, 2025 Aug 6, 2025 On the Road Again Aug 6, 2025 This week, I am heading to the Tampa Bay Area to spend a few days. Travel is often a good, uplifting reset. Read More → Aug 6, 2025 Jul 30, 2025 Accidental Guidance Jul 30, 2025 This week the newsletter is about the ways that spirit guides us, even when we do not know what questions to ask. Read More → Jul 30, 2025 Jul 23, 2025 Looking for Love Jul 23, 2025 Love is always on our minds, and this week it is the main topic of the newsletter. We explore the importance of self-love and more. Read More → Jul 23, 2025 Jul 16, 2025 The Biggest Mystery Jul 16, 2025 This week, we ask the question, 'Who am I?' Self-discovery is necessary for healing and for living authentically. Read More → Jul 16, 2025 Jul 9, 2025 Depth and Definition Jul 9, 2025 This week, we discuss the need for depth and the challenges of discovering what is okay at a surface level and what requires more effort. Read More → Jul 9, 2025 Sign Up to Receive the Tarot Topics Newsletter Upcoming Events Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Facebook YouTube Instagram Meetups Connecticut Tarot Study Grou p Tarot is a wonderful tool for personal growth and introspection, as well as divination and building community and fellowship. Join us for local, in person, workshops, meetings, classes and events, as well as occasional webinars and online events. Christiana Gaudet is the author of Fortune Stellar and Tarot Tour Guide, and has presented at Northwest Tarot Symposium and other prominent tarot conferences. Don't miss this opportunity to meet and work with one of the leading names in tarot today! Join Connecticut Tarot Study Group on Meetup.com South Florida Tarot Meetup Join us for classes, workshops and other events in South Florida, as well as occasional webinars and online events. Join South Florida Tarot Meetup on Meetup.com Tampa Bay Area Tarot Meetup We have been meeting in the Tampa Bay Area since the end of 2014. We meet to share knowledge, techniques, readings, practice and fellowship. We also study Lenormand, astrology and other esoterica. Anyone with an open mind and an interest in divination is welcome! We are lucky to have a great number of experienced tarotists, astrologers and intuitives in our group. People at any level of experience are welcome to join us; we are all always learning. Each meeting is full of laughter, sharing, insight and knowledge. Join Tampa Bay Area Tarot Meetup on Meetup.com Tarot Circle of the Treasure Coast Based in Palm City Florida. Join us for meetings, classes and events, as well as occasional webinars and online events. Join Tarot Circle of the Treasure Coast on Meetup.com Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://www.christiancareercenter.com/",
      "text": "Christian Jobs, Ministry Jobs/Employment & Church Staffing Search Christian Jobs Christian Teaching Jobs Missionary-Mission Jobs Church Jobs Ministry Jobs Add Resume Resume Help Resume & LinkedIn Writing Job Seeker Products Career Counseling Christian Career Coach: Faith-Based Guidance Career Counseling/Testing Career Checkup Free Career Services Consultation Client Testimonials Career Tools Free Career Checkup Career Advice & Insights Christian Career Counseling Job Search Coaching Career Fit Test Live Your Calling For Employers Features & Benefits Pricing Testimonials Post a Job Resume Search Login Free 30-Minute Hiring Consultation About Us Contact Us Sign in Sign up Search Christian Jobs Christian Teaching Jobs Missionary-Mission Jobs Church Jobs Ministry Jobs Add Resume Resume Help Resume & LinkedIn Writing Job Seeker Products Career Counseling Christian Career Coach: Faith-Based Guidance Career Counseling/Testing Career Checkup Free Career Services Consultation Client Testimonials Career Tools Free Career Checkup Career Advice & Insights Christian Career Counseling Job Search Coaching Career Fit Test Live Your Calling For Employers Features & Benefits Pricing Testimonials Post a Job Resume Search Login Free 30-Minute Hiring Consultation About Us Contact Us Christian Jobs, Ministry Employment and Church Staffing Search ministry jobs, church jobs, and pastor jobs with Christian employers. Fast & Easy Christian staffing - One click to post Christian jobs on ChristianCareerCenter.com and the Internet's top job sites, including Indeed, ZipRecruiter, Glassdoor, LinkedIn, and others. Location Find Jobs About Us Are you searching for a calling and not just a job? Then you have come to the right place! Here at the Christian Career Center, you can find Christian jobs, ministry openings, nonprofit employment, and church staffing positions that include church jobs, pastor jobs, mission/missionary jobs, school jobs, house parent jobs, teaching jobs, sales jobs, administrative jobs, management jobs and more. You can find even more Christian jobs through our Christian job boards Church Jobs Online , and Christian Job Fair . Are you a Christian ministry HR manager, pastor search committee member, or ministry recruiter?  If so, you will find unmatched exposure for hiring the right Christian staff member, Christian teacher, or pastor. With one click, you can post ministry jobs at ChristianCareerCenter.com and on Indeed, LinkedIn, Glassdoor, ZipRecruiter, and many others.  For church jobs, we also provide options to be posted on our divisions ChurchJobsOnline.com and ChristianJobFair.com. Ministries, churches, and Christian nonprofits who are seeking Christian candidates can also search for thousands of quality candidates in our resume bank. We also offer faith-based career counseling for Christian job seekers, including our career test , resume writing, job search assistance, and interviewing/salary negotiation guidance. Job Seekers: Post Your Resume – It only takes a couple of minutes Employers: Post Christian Jobs, Ministry Jobs & Church Jobs Featured Jobs Sep 11, 2025 Housekeeping Manager Featured We are looking for someone with a strong work ethic and a desire to live and work in a close community to serve in the much-needed role of Housekeeping Manager. We are passionate about our mission statement and are looking for a like-minded person who is willing to serve alongside us. Please thoughtfully consider each part of our mission statement, job description, and description of our ministry and community before applying.   \n  MISSION STATEMENT   \n  To inspire Christ-like change through   Outdoor Adventure,   Authentic Relationships,   and Biblical Truth.   \n  COMMUNITY     The makeup of our community determines a large part of what it is like to live and work here. We have about 120 people who live on-site year-round, comprised of full-time staff, families, and seasonal staff. Glorieta is a beautiful place with many natural resources but calls for a somewhat remote living.     \n  JOB DESCRIPTION   \n  ●   Title: Housekeeping Manager   \n  ● Department: Guest Services  \n  ●... Glorieta Adventure Camps Glorieta, NM, USA Full time Sep 11, 2025 Retail Manager Featured Glorieta’s Guest Services team is seeking an experienced food and beverage professional to oversee our diverse retail, vending, and concession operations. This position requires a strategic thinker who can drive revenue growth while maintaining exceptional guest experiences across multiple outlets. If you are looking to grow into general food service and merchandising management, you may be suited for this position.  \n  MISSION STATEMENT  \n  To inspire Christ-like change through   Outdoor Adventure,   Authentic Relationships, and   Biblical Truth  \n  COMMUNITY  \n  The makeup of our community determines a large part of what it is like to live and work here. Many employees who live on-site consisting of full-time staff, seasonal staff, and staff families.  \n  Job Scope   \n  The Retail Manager is responsible for overseeing all year round retail operations while maximizing profitability, ensuring exceptional guest experiences, and contributing to the overall camp community and mission... Glorieta Adventure Camps Glorieta, NM, USA Full time Sep 11, 2025 Maintenance Technician - Journeyman Electrician Featured Maintenance Technician - Journeyman Electrician   \n  Glorieta Camps, Glorieta, New Mexico   \n  We are looking for someone with a strong work ethic and a desire to live and work in a close community to serve in the much-needed role of Maintenance Technician - Licensed Electrician. We are passionate about our mission statement and are looking for a like-minded person who is willing to serve alongside us. Please thoughtfully consider each part of our mission statement, job description, and description of our ministry and community before applying.   \n  \n  MISSION STATEMENT   \n  To inspire Christ-like change through   Outdoor Adventure,   Authentic Relationships,   and Biblical Truth   \n  COMMUNITY     The makeup of our community determines a large part of what it is like to live and work here. We have about 120 people who live on-site year round, consisting of full-time staff and families. Glorieta is a beautiful place with many natural resources but calls for somewhat remote living.... Glorieta Adventure Camps Glorieta, NM, USA Full time Sep 11, 2025 Family Camp Assistant Featured $14.00 - $15.75 hourly We are looking for someone with a strong work ethic and a desire to live and work in a close community to serve in the much-needed role of Family Camp Assistant. We are passionate about our mission statement and are looking for a like-minded person who is willing to serve alongside us. Please thoughtfully consider each part of our mission statement, job description, and description of our ministry and community before applying.   \n  MISSION STATEMENT   \n  To inspire Christ-like change through   Outdoor Adventure,   Authentic Relationships, and   Biblical Truth   \n  COMMUNITY   \n  The makeup of our community determines a large part of what it is like to live and work here. We have about 120 people who live on-site year-round, comprised of full-time staff and their families and seasonal staff. Glorieta is a beautiful place with many natural resources but calls for somewhat remote living.   \n  Job Purpose:   \n  To fulfill our mission by supporting all aspects of the Family Camp... Glorieta Adventure Camps Glorieta, NM, USA Full time Sep 11, 2025 Development Assistant Featured $15.39 hourly On-site · Glorieta, NM   \n  Full Time  · Year-round  \n  Hourly pay plus housing and benefits  \n  Development Department    \n    \n  Job Description  \n  The Entry-Level Fundraiser will help bring Glorieta Camps’ mission to life by supporting the day-to-day operations of the Development Team and participating in outreach that inspires generosity. This position will assist with growing our monthly giving program, campaign planning, donor communications, and scholarship stewardship while keeping our donor records accurate and up to date. They will also engage directly with donors—sharing stories of impact, articulating specific needs, and inviting them to be part of the work God is doing through Glorieta Camps. Success in this role means building genuine connections, making confident requests for support, and helping support the team with administration. [Complete job description can be found on our  website ]  \n  Qualifications  \n \n \n  Strong passion for the mission, coupled with the... Glorieta Adventure Camps Glorieta, NM, USA Full time Sep 09, 2025 Communications Manager Featured Summary of Position   \n  The Communications Manager will lead communications and public relations efforts, ensuring that the mission and impact of Bethesda Mission are communicated clearly and effectively to donors, partners, the media, and the broader community.  This role combines creativity with strategy, requiring excellent written and oral communication skills, strong relationship-building ability, and proven grant writing experience.  \n      All Bethesda Mission staff must:   \n  Provides a biblically sound testimony of having accepted Jesus Christ as Lord and Savior and leads a life worthy of that profession.  Actively engages in private and corporate prayer, Bible Study, regular church attendance, and holy living.  \n  Agree with and carry out responsibilities in accordance with the Mission’s policies, including our Code of Conduct, Statement of Faith, Document on Sexual Sin and Brokenness, Value Statement and Narratives, and Mission Statement.  These can be reviewed at... Bethesda Mission Harrisburg, PA, USA Full time Sep 09, 2025 Dean of Academics Featured $65,000 - $75,000 yearly Dean of Academics \n Job Description \n  Note: This position requires living in the greater Seattle, WA area for regular in person leadership team meetings.      \n Date:             September 2, 2025 \n Status:           Full Time, Exempt \n Reports to:    President \n  Mission  \n Northpoint University empowers missional leaders to spread the gospel.     \n  Description  \n The Dean of Academics is a senior administrator responsible for providing strategic leadership and direction for academic programs, developing and implementing academic policies and procedures, overseeing faculty and staff, and working to ensure the success of students. \n  Duties & Responsibilities  \n \n Provide leadership and direction for academic department \n Collaborate and coordinate with the Director of Admissions for the handover of admitted students and student files     \n Oversee the students’ experience from admittance through to graduation \n Develop and implement academic policies, procedures, and... Northpoint University Hybrid (Seattle, WA, USA) Full time Sep 09, 2025 Family Pastor/Director Featured $70,000 - $85,000 yearly Position description : \n The Family Pastor/director will manage and grow the established family ministry with the goal of encouraging and resourcing parents in the discipleship of their children; managing the Christian education program for children from nursery through 5th grade; and developing a youth ministry program to disciple the middle school and high school youth of our church.    70% of work hours should be focused on youth ministry and 30% on managing children’s programs. \n  Job Responsibilities : \n Plan and oversee children’s Sunday School.    Choose a curriculum, recruit, train, and encourage volunteer teachers. \n Coordinate and oversee Vacation Bible School \n Communicate regularly with parents to inform and encourage.    Provide resources for the Christian education of their children taking place at home. \n Provide support and encouragement to preschool.    Lead a weekly devotion for our teachers an organize discipleship opportunities for our student’s parents... Church By The Sea Fort Lauderdale, FL, USA Full time Sep 09, 2025 Part-Time Associate Pastor with Administrative Responsibilities Featured $20.00 - $25.00 hourly Location:  First Baptist Church, North Platte, NE  Employment Type:  Part-Time (20-25 hours/week), Bi-Vocational Option Available  Compensation:  $20–$25/hour   Job Description:   First Baptist Church, a growing congregation of ~100 attendees in North Platte, NE, seeks a dedicated associate pastor to join our team. This hybrid role supports our senior pastor, as he transitions toward retirement, focusing on ministry, preaching, and family time. Responsibilities include: \r\n \r\n Preaching, teaching, and leading small groups as needed. \r\n Assisting with evangelism and community outreach. \r\n Managing administrative tasks (office coordination, scheduling, helping with the day to day). \r\n Overseeing facility maintenance and operations. \r\n Supporting ministry expansion (e.g., youth, children’s programs) with fresh ideas. \r\n Planning for the church’s future with a long-term commitment to North Platte. \r\n \r\n Qualifications: \r\n \r\n Pastor with strong Bible knowledge and... First Baptist Church North Platte, NE, USA Part time Sep 08, 2025 Retail Brand Visionary Superstar Sought Featured $60,000 - $120,000 yearly Do you know and love retail? Do you have the horsepower to run and build a brand?  \n  Retail & Custom Team Shop General, Floor and Store Brand Manager desired.   \n  How would you like to have the opportunity to work for an amazing brand and make a real difference;   \n  To direct and help the brand expand from servicing a niche equestrian sports clientele  to becoming a mainstream global apparel brand as the only authentic genuine polo purveyor.   \n  35 year old PoloGear is transitioning from being an purveyor to the global polo, dressage and jumping community to supporting a global brand in providing access, content and authenticity to the global brand outreach.   \n  We are looking for an extremely experienced, intelligent, motivated manager and director to lead the shop in its supporting role of the brand while continuing to service and expand business in the global real polo market.   \n  This superstar will manage operations in our expanding shop in Wellington, Florida and... PoloGear Wellington, FL, USA Full time Sep 06, 2025 SuperThrift Donor Relations & Development Featured Job Summary:  The primary function of this position is to secure and grow donations for Teen Challenge SuperThrift stores \n  Essential Job Functions:  Develop and Maintain Donor Relationships: ● Actively seek out and develop relationships in the community that will be beneficial for acquiring donations for Teen Challenge Super Thrift stores. Organize and implement donor growth projects ● Generate ideas for donor growth strategies in the community ● Partner with local Teen Challenge programs for outreach and promotional projects ● Coordinate donor growth activities with local store managers ● Have the ability to operate the stores Google Calendars as they are used for the routing and scheduling of the trucks and for real time planning and scheduling of donation receiving ● Coordinate with store managers on truck dispatch schedules for donation acquisition ● Work with drivers for the purpose of troubleshooting donation receiving issues on the spot as they occur ● Adheres to Teen... Teen Challenge of Florida, Inc. Fort Myers, FL, USA Full time Sep 03, 2025 Electronics Technician Featured $60,000 - $80,000 yearly Here at SonSet Solutions, we use technology to spread the gospel of Jesus Christ worldwide. You could use your electronics expertise to help advance the gospel. Assemble, test, and maintain equipment that empowers our ministry partners to share Christ effectively, as well as support global outreach through technical service and hands-on collaboration.     \n \n \n  Who You Are   \n \n \n \n \n   Called to serve in missions     \n \n \n \n \n \n \n  Trained or experienced in electronics assembly, troubleshooting, and repair     \n \n \n \n \n \n \n  Proficient with electronic test tools and Microsoft Office Suite     \n \n \n \n \n \n \n  Organized, detail-oriented, and able to work independently     \n \n \n \n \n \n \n  Calm under pressure and dependable with deadlines     \n \n \n \n \n \n \n  A team player with strong communication skills     \n \n \n \n \n  How You Will Serve   \n \n \n \n \n  Assemble, test, and repair radio broadcast equipment     \n \n \n \n \n \n \n  Diagnose and resolve technical issues with electronic systems... SonSet Solutions Elkhart, IN, USA Full time Sep 02, 2025 Middle/High School Math Teacher (2025-2026) Featured Job description \n \n This position involves teaching Math to middle and high school students. The successful candidate will be a hardworking and enthusiastic teaching professional with excellent subject knowledge, coupled with the desire to encourage and inspire students to love learning and excel academically. A passion for Christian education is a must-have for this position. \n Job responsibilities include: \n \n Teaching middle and high school mathematics courses \n \n \n Teaching from a biblical worldview \n Maintaining a safe and disciplined environment for the students \n Creating and implementing daily lessons for students, incorporating Biblical integration in each lesson \n Maintaining a high level of classroom management \n Observing and evaluating the progress of each student \n Differentiating instruction as required \n Maintaining communication with parents \n Being available for parent conferences \n Working cooperatively with administrators, fellow teachers, and parents... Mount Zion Christian Academy Durham, NC, USA Full time Sep 02, 2025 Upper School Teacher Featured $22,000 - $30,000 yearly Thank you for your interest in teaching at Bethany Christian School. We follow Bob Jones University Press curriculum which teaches a literal 6-day creation, a recent earth, and justification by faith alone in Christ alone. Applicants would need to hold these beliefs and be able to teach advanced science classes. \n We will hire highly-qualified applicants with a high school diploma, but prefer a college degree. \n Due to the expansion of our staff in the secondary school, we are looking for a general-ed teacher that would have primary duties in our ESL Program. Salary for fully-qualified applicants is $30,000. If you are available to teach part time in the secondary school, the salary is $45 per class. The school is located at 3300 W. Parker Road, Plano, TX 75075 (south central Plano). \n More information is available by calling the school office at 972 596 5811. \n You may send a resume to Andrea@bethanybible.com, but you will also be asked to complete an employment application.... Plano Bethany Bible Church Plano, TX, USA Full time Sep 02, 2025 Executive Director | Cedar Springs Christian Retreat Center Featured $80,000 - $110,000 yearly Role Overview  \n  Cedar Springs Christian Retreat Center provides a quiet, peaceful, and natural environment for churches and Christian organizations to encounter God. Motivated by a heart for hospitality, the Director provides overall leadership for the retreat center, ensuring smooth operations, healthy staff culture, and stewardship of resources. Working with the board and experienced managers, the Director maintains a refreshing retreat environment for churches and ministries.      This role does not involve program development or fundraising but focuses on hospitality, operations, and staff leadership.  \n  Key Responsibilities  \n  Spiritual and Organizational Leadership:   Model a Christ-like culture of hospitality and ensure alignment with the mission of Cedar Springs. Supervise and support four department managers and oversee a team of ~30 FT and PT staff. Promote healthy culture and staff development.  \n  Operational and Administrative Oversight:   Ensure excellent guest... Cedar Springs Christian Retreat Center Sumas, WA, USA Full time SJ Sep 02, 2025 Director of Children and Families Ministries Featured $68,000 - $73,000 yearly DIRECTOR OF CHILDREN AND FAMILY MINISTRIES—FULL TIME, $68-73k plus benefits  \n  St. John’s Presbyterian Church – 11000 National Blvd., Los Angeles, CA    90064 – stjohnspres.org  \n     \n St. John’s, in the heart of West LA, is seeking a full time Director to lead our program for children from infants to 5th grade and their families.    We are a supportive, diverse church desiring to nurture our children’s faith and outreach to the neighborhood including our on-campus nursery school and elementary school next door. \n   \n If you like a challenge, are passionate to see God’s kingdom expand, want to be part of renewal, see yourself as a harvester of ripe fruit and can develop mature believers, we want you!    We want a creative leader with initiative who wants to build a bigger light on a hill in our hometown. \n   \n Reports to: \n   \n Pastor/Head of Staff and Growing in Faith Commission \n Works with: Student & Youth Ministries Team, Director of Student & Youth Ministries... St. John's Presbyterian Church Los Angeles, CA, USA Full time Aug 30, 2025 Residential Youth Care Specialist for Sex-Trafficked Youth (PART TIME WEEKEND DAYS - Saturday and Sunday - 10 Hour Shifts) Featured $20.00 - $22.50 hourly Residential Youth Care Specialist - Esther’s Home   \n  About Mirror Ministries   \n Mirror Ministries’ mission is to respond to domestic minor sex trafficking with the love of Christ through local education, intervention, restoration, and aftercare. This mission has led us to establish Esther’s Home, a place where up to five girls aged 11-17 can live for 12-24 months to achieve restoration from being trafficked. Esther’s Home provides comprehensive residential and therapeutic services through fostering and maintaining a trauma-informed, safe, clean, abuse-free home. Mirror Ministries is a Christian organization dedicated to serving people of all faiths and backgrounds . \n   \n  Residential Youth Care Specialist - Job Summary  Esther’s Home Residential Youth Care Specialists provide comprehensive residential services through meeting the residents’ basic needs, working with a team to build opportunities for their development, and fostering and maintaining a trauma-informed,... Mirror Ministries WA, USA Part time Aug 30, 2025 Facilities Maintenance Technician - (Rural) Part Time/Full Time Featured $20.00 - $21.00 hourly Facilities Maintenance Technician - Mirror Ministries  \n     \n  About Mirror Ministries   \n  Mirror Ministries’ mission is to respond to domestic minor sex trafficking with the love of Christ through local education, intervention, restoration, and aftercare. Mirror Ministries works throughout Benton and Franklin counties to provide training, education, and awareness to local schools, agencies and businesses. Mirror Ministries’ advocates do purposeful outreach to identify victims of trafficking hidden in our community, including a 24/7 sex-trafficking hotline. Mirror Ministries walks hand-in-hand with victims/survivors of sex trafficking, showing them that there is hope and help.  A team of advocates, counselors, and volunteers provides intensive case management through counseling, therapeutic services, mentors, and survivor support groups at the Mirror Ministries Outreach Center and Esther’s Home. Mirror Ministries is a Christian organization dedicated to serving people of all... Mirror Ministries WA, USA Part time Aug 30, 2025 Residential Youth Care Specialist for Sex-Trafficked Youth (PART TIME NIGHTS 10 Hour Shifts) Featured $20.00 - $22.50 hourly Residential Youth Care Specialist - Esther’s Home   \n  About Mirror Ministries   \n Mirror Ministries’ mission is to respond to domestic minor sex trafficking with the love of Christ through local education, intervention, restoration, and aftercare. This mission has led us to establish Esther’s Home, a place where up to five girls aged 11-17 can live for 12-24 months to achieve restoration from being trafficked. Esther’s Home provides comprehensive residential and therapeutic services through fostering and maintaining a trauma-informed, safe, clean, abuse-free home. Mirror Ministries is a Christian organization dedicated to serving people of all faiths and backgrounds . \n   \n  Residential Youth Care Specialist - Job Summary  Esther’s Home Residential Youth Care Specialists provide comprehensive residential services through meeting the residents’ basic needs, working with a team to build opportunities for their development, and fostering and maintaining a trauma-informed,... Mirror Ministries WA, USA Part time Aug 30, 2025 Counselor - Women's Shelter Featured Bethesda Mission has been serving as a place of hope and healing in Harrisburg for more than 100 years. We provide Christ-centered care and recovery support for women, children, and families experiencing homelessness, addiction, and crisis.  \n  We are seeking a compassionate  Counselor  to oversee the daily operations of the Women’s Shelter and provide Biblical counseling, case management, and recovery support to guests. This position combines leadership, counseling, and spiritual instruction in a supportive, mission-driven environment.  \n   Key Responsibilities   \n \n  Provide Biblical counseling and crisis intervention for women and children.  \n  Facilitate addiction recovery services, including assessments, treatment planning, and group programs.  \n  Manage casework, advocacy, and referrals to community resources.  \n  Develop life skills and spiritual growth programs.  \n  Supervise daily shelter operations, primarily evenings.  \n  Drive guests to appointments and support... Bethesda Mission Harrisburg, PA, USA Full time View all jobs Employers Post your jobs on the #1 Christian job and career site. Post a Job Featured Employers Foundations Early Learning & Family Center 3 job(s) Antrim Brethren in Christ Church 1 job(s) Palm Academy 2 job(s) SonSet Solutions 3 job(s) Bethesda Mission 3 job(s) Mount Zion Christian Academy 1 job(s) First Baptist Church 1 job(s) Sent Life Fellowship 1 job(s) PoloGear 3 job(s) Glorieta Adventure Camps 5 job(s) Sign up for Christian job alerts Your email Keywords Daily Weekly Monthly Jobs by Category Engineering 103 Education 96 Management 79 Nonprofit 31 Retail 27 Grocery 22 Ministry 19 Hospitality-Hotel 18 Facilities 17 Jobs by State North Dakota 480 Nebraska 244 Texas 244 South Dakota 240 Missouri 111 Minnesota 110 Colorado 60 Mississippi 51 Louisiana 46 Illinois 38 Follow @Christianjobs4u Christian Career Center Follow us on: Facebook Twitter Google Plus LinkedIn Home Contact About Us Terms & Conditions Employer Post Christian Jobs Search Resumes Sign in Job Seeker Find Christian Jobs Create Resume Sign in Partners Jooble JobInventory.com Jobsora Since 1997, ChristianCareerCenter.com has been the #1 Christian Career Center for Christian men and women online. If you are looking for work that fits your design and is not just a job but a calling, you have come to the right place. You can search for Christian jobs, church employment, and ministry openings that include nonprofit jobs, ministry jobs, mission/missionary jobs, church jobs, house parent jobs, teaching jobs, sales jobs, administrative jobs, media jobs, and more. Through our network of niche job boards ( ChristianJob.com , ChurchJobsOnline.com , and ChristianJobFair.com ) you can search for other ministry opportunities. We also offer career counseling, our career test , resume writing, job search assistance, and interviewing guidance for Christian job seekers. Are you in need of quality candidates for your job openings? The ChristianCareerCenter.com allows your Christian organization or ministry to post openings and view thousands of resumes.  With one click, in addition to posting jobs on ChristianCareerCenter.com, your featured jobs will be posted on Indeed.com, ZipRecuitor.com, LinkedIn.com, Glassdoor.com and others. Copyrights © 2018 Christiancareercenter | All Rights Reserved"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2019/11/6/managing-our-resources",
      "text": "Managing Our Harvest — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Managing Our Harvest Tarot Topics Newsletter Nov 6 Written By Christiana Gaudet Managing our Harvest Halloween was originally a celebration of the final harvest, as well as a time of communication with those in the spirit world. The concept of a ‘final harvest,’ asks us to recognize that sometimes our efforts have finality. Whatever we have grown and saved is what we will have to make it through the proverbial winter. There is a bit of an ominous, anxious feeling there. Of course, in our modern world, most of us are lucky enough to have food regardless of the season. Yet, this concept of final harvest is a good metaphor for many things that we deal with in life. Whatever we are preparing for, there will come a time when, ready or not, our preparations will either be enough, or they won’t. Either we have enough money for comfortable retirement, or we haven’t. Either we studied enough to pass the test, or we didn’t. Either we edited the book well enough, or it will be published full of errors. Different personalities handle this finality in different ways. Some people obsess and fret, much to their detriment. Others work diligently. Others act like they don’t really care about what happens. I think the key to managing our deadlines and maximizing our resources is to be proactive without being anxious. We need to plan for the future without fearing the future. We need to celebrate what we have done, feel pride in our accomplishments, and trust that we have done enough. If it becomes clear that we will not have what we need, we must avoid panic, and instead trust our ability to solve the problem. So often we think of our resources only in terms of money, or tangible assets. Yet, our resources also include our ingenuity, the good will we have fostered with others, the good people around us, and the ‘spiritual currency’ we generate when we help others, live with integrity, stay positive and cultivate good relationships. In the olden days, ‘harvest’ referred only to food, and the possibility of being able to eat. Now, our harvest is not only our money, our harvest is our talents, our time, our creativity and our relationships. Sometimes the things we work to harvest have limitations, sometimes they don’t. Yet, contemplating this concept of final harvest has bearing on our lives, both in terms of the way we plan and allocate our resources, the way we set our goals, and the way we appreciate the fruits of our labors. Christiana’s Annual Holiday Open House Make plans to attend the annual holiday psychic food-raiser! On Sunday, December 15, 12 noon to 6 pm, Join us at my new office, 3559 SW Corporate Parkway, Palm City, Florida 34990, for an afternoon of metaphysical holiday cheer for a good cause. I am so excited to be able to host this event at my office. This is something I have not been able to do since I was based in the Harvey Building in West Palm Beach! As we do every year, tarot readers, astrologers, psychics and healers will be on hand to provide free mini-sessions on a first-come, first-served basis in exchange for your donation of non-perishable food items to be given to the Treasure Coast Food Bank. Bring food to donate and work with our staff of talented professionals and students! Bring a holiday treat for the snack table! Card and Craft, Inc. will provide beverages (coffee, tea, hot chocolate and water). Are you a reader or healer? Volunteer your time and skills for this exciting event! Call or text Christiana at 561-655-1160 to get on the volunteer list. Readers and healers will volunteer in two shifts, 12-3pm and 3-6 pm. Sign up for the shift that is best for you. Bring your business cards to promote your business! Students are welcome to volunteer and practice their skills. Three Tarot Techniques for Managing Resources Here are three ways to use the cards to help you manage your harvest. Try them with a tarot deck, an oracle deck, or both. Relationship with Money Tarot Spread Here is a three-card tarot spread to help you sort out and shift your relationship with money. We all heard some messaging about money as we were growing up. Perhaps it was that one can’t be happy unless one is wealthy. Perhaps it was that it is noble to be poor. Perhaps it was that you will never be successful. Try this spread to help you explore your internal learned messaging about money, and shift into a more fitting relationship with your financial resources. Card One: My internal story about my relationship with money. Card Two: How that story has manifested in my life. Card Three: How I can shift that story to create better flow and happiness in my life. Resource Management Not all currency is financial, and not all resources can be stored in a bank. Ask the cards to show you information about all your resources, using a two-card technique. First, ask the cards to show you a resource, and pull one card. Now, ask, “How can I better manage this resource?” and pull another card. Use this two-card technique as many times as you like to discover and manage multiple resources in your life. Hidden Harvest Very often we are not aware of the resources around us. When you are feeling a sense of lack in your life, wether financial, emotional, social, creative or in any other way, simply ask the cards where you can find what you need. Try the follow four-card spread. Card One: Show me the resources I need. Card Two: Show me resources I already have of which I wasn’t aware. Card Three: Show me where I can find more of what I need. Card Four: Show me how I can cultivate more resources over time. The Week in Review This week I shared a blogpost and YouTube video on how tarot readers can use tarot to overcome shyness and other obstacles. In addition to my regular Three-Card Weekly Reading, I did a special video to share a tarot reading and tarot spread in honor of Halloween. The “thinning of the veil” that happens at Halloween can be felt for a few weeks, so you still have some time to take advantage of this energy and try this special spread. You can find this video, and the regular Three-Card Weekly Reading, archived on YouTube , Facebook and Instagram . Please subscribe, like and follow! From Around the Web The Tarot Blog Hop happened on Halloween. You can start with Jay Cassel’s post and then follow the links to see what each person had to say. I love Maddy Elruna’s tarot blog. She shares her personal journey in an eloquent, vulnerable way that helps us understand the cards. Here is her recent entry . It’s a new month, so here are some November 2019 Tarotscopes for you! Tarot Tells the Story: A Tarot Class On Sunday, November 24,from 4 to 6 pm, join me in the new office at 3559 SW Corporate Parkway, Palm City Florida 34990 for an exciting and insightful tarot class appropriate for readers of all levels of experience. Tarot Tells the Story will cover the nuances necessary to give a great reading. Topics included will be Court cards, reversals, card combinations, trends and blends and tarot spreads. You will learn to weave the card meanings together to create a cohesive story. Bring a tarot deck or purchase one at the class. Class fee is $37.50. You must pre-register on Eventbrite or by calling 561-655-1160. Cards for Your Consideration The tarot suit of Pentacles, related to the element of Earth, was originally called the suit of Coins. In some decks it is still called Coins, in others it is Disks or Stones. Yet, the association with the Earth element remains the same. The element of Earth is related to all physical and material things. This includes our well-being, our resources and our goods. Because the tarot suit of Earth is named “Coins,” it is easy to think of the cards in this suit as always relating to money. It is true that very often these cards will refer to our finances, and our work to create our living. Yet, the cards of suit of Pentacles can speak of all resources, not only financial ones. Pentacles cards can refer to our health, our sense of personal security, our home, our family, and our attitudes toward money, as well as our actual financial wealth. For example, the Ace of Pentacles can be a new job, or new money coming in. Yet the Ace of Pentacles can also indicate the root chakra, and the need to nurture one’s sense of personal security. The Nine of Pentacles was originally depicted as a wealthy woman secure in her father’s protection. Today, we often see this card as a sense of personal security, being comfortable being single, and being happy in one’s own skin. The Four and Six of Pentacles can sometimes speak of how we think about sharing resources, with the Six indicating sharing and the Four indicating selfishness. Yet, the Four of Pentacles can often speak of appropriate boundaries within family relationships. It’s important to understand how the cards of the suit of Pentacles speak about money, but it is equally important to understand the wise range of resource management to which these cards can refer. Upcoming Events and Tours Featured Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Tarot Topics Newsletter Volume 2 Issue 45 November 6, 2019 Pentacles Holidat Open House Christiana Gaudet Christiana has been a full-time tarot professional for more than twenty years, and is the author of two books about tarot. In 2008, Christiana was granted the title of Tarot Grandmaster by the Tarot Certification Board of America. Christiana provides readings by phone, Facetime and Skype, and in her office in Palm City, Florida. https://christianagaudet.com Previous Previous When Numbers Repeat in a Tarot Spread Next Next Overcoming Shyness and Other Obstacles as a Tarot Reader Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com",
      "text": "Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Tarot is a book of spiritual wisdom in picture form that tells the story of all human experience. With tarot, we connect with Spirit to discern wise guidance for the present, develop understanding of the past, and learn ways to work to manifest our goals and possibilities for the future. Introducing Christiana Gaudet Welcome Tarot is a book of spiritual wisdom in picture form that tells the story of all human experience. With tarot, we connect with Spirit to discern wise guidance for the present, develop an understanding of the past, and learn ways to work to manifest our goals and possibilities for the future. If you are interested in the tarot and other tools of divination please begin with my tarot news page ! Please leave this site if the practice of traditional methods of divination is not of interest to you. Enter christianagaudet.com What people are saying about Christiana Gaudet Featured Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/events",
      "text": "Events — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Sep 14 Free Event , Tarot Meetup Cards and Conversation Tarot Meetup Sunday, September 14, 2025 4:00 PM 6:00 PM Panera Bread (map) Google Calendar ICS Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. View Event → Sep 20 Free Event , Tarot Meetup All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Saturday, September 20, 2025 1:00 PM 2:00 PM Mandel Public Library of West Palm Beach (map) Google Calendar ICS Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. View Event → Sep 23 YouTube Members Only TarotScopes October 2025 Live for YouTube Members Tuesday, September 23, 2025 6:00 PM 7:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! View Event → Sep 28 YouTube Members Only Majors-Only Readings Members-Only Livestream on YouTube Sunday, September 28, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. View Event → Sep 9 Free Webinar Tarot and Tunes Talk Live Webinar Tuesday, September 9, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS This free live webinar will explore the connections between tarot and music. View Event → Sep 3 Free Event , Free Webinar Global Tarot Circle Live on YouTube, Twitch, Facebook & Instagram Wednesday, September 3, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS Join the Global Tarot Circle on YouTube Live for a mystical gathering where tarot enthusiasts from around the world come together. View Event → Aug 27 YouTube Members Only Oracle Card Exploration Members-Only Livestream on YouTube Wednesday, August 27, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for a discussion and some readings. We will work with a variety of oracle decks. View Event → Aug 25 YouTube Members Only TarotScopes for September 2025 Live for YouTube Members Monday, August 25, 2025 6:00 PM 7:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! View Event → Aug 19 Free Webinar Exploring the Major Arcana Live Webinar Tuesday, August 19, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS This free live webinar will explore the twenty-two cards of the Major Arcana. View Event → Aug 13 Free Event , Free Webinar Global Tarot Circle Live on YouTube, Twitch, Facebook & Instagram Wednesday, August 13, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS Join the Global Tarot Circle on YouTube Live for a mystical gathering where tarot enthusiasts from around the world come together. View Event → Aug 8 to Aug 10 Tampa Bay Florida , Christiana on Tour Christiana’s Tampa Area Tarot Tour Fri, Aug 8, 2025 10:00 AM Sun, Aug 10, 2025 5:00 PM Tampa, Florida United States (map) Google Calendar ICS Christiana will be available for a limited number of house calls and small parties in the greater Tampa area. View Event → Aug 3 Free Event , Tarot Meetup Cards and Conversation Tarot Meetup Sunday, August 3, 2025 4:00 PM 6:00 PM Panera Bread (map) Google Calendar ICS Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. View Event → Jul 30 YouTube Members Only Chakras and Tarot Members-Only Livestream on YouTube Wednesday, July 30, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for a discussion and some readings. Learn to use tarot to read and remedy chakras! View Event → Jul 25 YouTube Members Only TarotScopes August 2025 Live for YouTube Members Friday, July 25, 2025 6:00 PM 7:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! View Event → Jul 23 Free Webinar Wyrd Wednesday Live Webinar Wednesday, July 23, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore divination with the Elder Futhark runes. View Event → Jul 17 Free Webinar Tarot in Sections Live Webinar Thursday, July 17, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore how tarot can help you understand what feels best in your own tarot practice. View Event → Jul 13 Free Event , Tarot Meetup Cards and Conversation Tarot Meetup Sunday, July 13, 2025 4:00 PM 6:00 PM Panera Bread (map) Google Calendar ICS Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. View Event → Jul 9 Free Event , Free Webinar Global Tarot Circle on Live on YouTube, Twitch, Facebook & Instagram Wednesday, July 9, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS Join the Global Tarot Circle on YouTube Live for a mystical gathering where tarot enthusiasts from around the world come together. View Event → Jun 30 YouTube Members Only Intuitive Development Members-Only Livestream on YouTube Monday, June 30, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for a discussion about intuition, and some readings. View Event → Jun 25 Free Webinar Wyrd Wednesday Live Webinar Wednesday, June 25, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore divination with the Elder Futhark runes. View Event → Jun 16 YouTube Members Only TarotScopes July 2025 Live for YouTube Members Monday, June 16, 2025 6:00 PM 7:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! View Event → Jun 14 Free Event , Tarot Meetup Tarot 101 Workshop for Summer Solstice at Mandel Public Library of West Palm Beach Saturday, June 14, 2025 1:00 PM 2:00 PM Mandel Public Library of West Palm Beach (map) Google Calendar ICS Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop. View Event → Jun 11 Free Webinar Tarot Ethics Live Webinar Wednesday, June 11, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore how tarot can help you understand what feels best in your own tarot practice. View Event → Jun 8 Free Event , Tarot Meetup Cards and Conversation Tarot Meetup Sunday, June 8, 2025 4:00 PM 5:00 PM Panera Bread (map) Google Calendar ICS Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. View Event → Jun 4 Free Event , Free Webinar Global Tarot Circle on Live on YouTube, Twitch, Facebook & Instagram Wednesday, June 4, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS Join the Global Tarot Circle on YouTube Live for a mystical gathering where tarot enthusiasts from around the world come together. View Event → May 27 YouTube Members Only AITA Tarot Readings Members-Only Livestream on YouTube Tuesday, May 27, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for tarot readings about interpersonal difficulties. View Event → May 21 Free Webinar Wyrd Wednesday Live Webinar Wednesday, May 21, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore divination with the Elder Futhark runes. View Event → May 20 YouTube Members Only TarotScopes June 2025 Live for YouTube Members Tuesday, May 20, 2025 5:00 PM 5:30 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! View Event → May 13 Free Webinar Tarot Affirmations Live Webinar Tuesday, May 13, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore how tarot can help you create and use affirmations. View Event → May 11 Free Event , Tarot Meetup Cards and Conversation Tarot Meetup Sunday, May 11, 2025 4:00 PM 5:00 PM Panera Bread (map) Google Calendar ICS Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. View Event → May 5 Free Event , Free Webinar Global Tarot Circle on Live on YouTube, Twitch, Facebook & Instagram Monday, May 5, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS Join the Global Tarot Circle on YouTube Live for a mystical gathering where tarot enthusiasts from around the world come together. View Event → Apr 30 YouTube Members Only Tarot for Beltane Members-only Livestream on YouTube Wednesday, April 30, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc. (map) Google Calendar ICS Members are welcome to join us for in-depth readings and tarot study with a seasonal theme. View Event → Apr 22 Free Webinar Next Level Tarot Skills Live Webinar Tuesday, April 22, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore advanced tarot skills and how to acquire them. View Event → Apr 10 Free Webinar Reversed Cards Tarot Webinar on YouTube Live Thursday, April 10, 2025 7:00 PM 8:00 PM Everywhere Live from Card and Craft Inc (map) Google Calendar ICS This free live webinar will explore reversed tarot cards and what tarot reversals teach us about tarot reading. View Event → Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/introducing-christiana",
      "text": "Introducing Christiana Gaudet — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Welcome to Tarot by Christiana, the website of Certified Tarot Grandmaster Christiana Gaudet. Introducing Christiana Gaudet View fullsize Certified Tarot Grandmaster Christiana Gaudet I am Certified Tarot Grandmaster Christiana Gaudet.  From my office in Palm City, Florida, I serve a worldwide clientele. I am available for readings seven days a week. I can do your reading by telephone, on Skype,  FaceTime,  or Google Hangout. I can also see you in my office at Origins Spa and Wellness Center. I offer personal and professional tarot mentoring, instruction and coaching to select candidates by telephone, Skype, Google Hangout, or in person in Palm City. To schedule your session right now, call or text me at 561-655-1160, or email me . To learn more about me and the services I provide, and to learn more about tarot and personal growth, please spend some time looking through this website. Visit often, this site is always expanding and growing! What can you expect in a reading with me? A reading with me is insightful and powerful.  To each reading I bring my extensive knowledge of Tarot, my natural intuitive and spiritual talents, and more than twenty-five years of serious study and experience. While every reading is a unique experience, each client can expect to receive a new perspective on their past, a deeper understanding of self and loved ones (both living and passed), a clear agenda for personal and professional development, and a vision for goals and options for their future. I perform every reading with respect for each person's spiritual orientation, lifestyle choices and cultural perspective.  I strive to bring compassion, humor, and a positive message to each reading. Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://tarotbychristiana.com/tarot-news/2021/1/6/seeking-clarity",
      "text": "Seeking Clarity — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account Seeking Clarity Tarot Topics Newsletter Jan 6 Written By Christiana Gaudet As we begin a new year, we like to have clear vision for the months ahead. We like to have an expectation of what is coming. We like to have goals. We sometimes make resolutions about changes we want to make in our lives. The new year inspires us to begin new things, find new ways, and seek greater clarity. Over this past year it feels as though clarity has been hard to find because we have all been facing new and unknown things. That makes our dedication to seeking clear truth, thought, and vision even more vital. We need to be clear about our intentions as we move forward into a new year. We need to be clear about our skills and resources as we work to create our stability. Maybe most importantly, we need to be clear about what we know and what we trust. Perhaps the most important aspect of clarity is the ability to see oneself clearly. So often we see ourselves through a lens of low confidence. Sometimes our understanding of ourselves is distorted by expectations, either our own or of those around us. Meditation, divination and self-reflection are some of the best ways to find our own personal clarity. From there, it is easier to make sense of the world. The StaarCorner Our last podcast of 2020 was a blast! I was all set to interview Amie Mouser, who is our podcast producer and also a presenter at StaarCon. She shared with us a clear agenda for her exciting presentation, which is about using the power and cycles of the moon in manifestation work. Then she turned the tables on me and asked me some questions about my Preconference Intensive, Operational Tarot. Make sure you check out Moon Manifestation and Tarot Operation with Amie Mouser. You can watch it on YouTube , or listen wherever you get your podcasts. StaarCon is this month, so get your tickets now! Countdown to StaarCon It’s hard to believe that, after all these months of planning, StaarCon will happen this month. Making the pivot to an online conference for our first event has been challenging, but I think you will find the result is amazing. We are offering four tracks of classes, five discussion groups, three tarot art performances, a full-scale psychic fair and exhibition hall, and more. We have more than thirty presenters ready to inform, enlighten and inspire you. If you have questions about StaarCon, please call or text me at 561-655-1160, or email me . It is time to get your tickets for this amazing event . Remember that all classes will be recorded, and you will have thirty days to view them after the event. StaarCon begins on January 22 and ends on January 24. Please plan to join us! Clarity about Clarifying Cards in a Tarot Reading In tarot, there is a practice of using a clarifying card. The problem is that a lot of readers do not have clarity on what this means and how to use it. In a tarot reading, each card clarifies other cards that appear in the same spread. What does that mean? It means the way we interpret every card can be modified and understood when we take into account the cards that surround it. Why, then, would we need a specified clarifying card? The answer is, we often don’t. Often the card that is designated as a clarifier offers very little clarity. There are times, however, when a clarifying card is worth its weight in gold. I feel the best use of such a card is as follows. Do not use a clarifying card by rote. Only draw one if it is needed. When do you need a clarifier? You need a clarifier when a particular card has you stumped. What you need to do is either formulate a question about that card, or simply ask, “What are you trying to tell me?” and pull a card in answer. That card should clarify the meaning of the troublesome card for you. For more information about clarifying cards, and other ways to use them, read this blogpost I wrote about the topic a few years ago. The Week in Review This week my blogpost is a reflection on some things I learned in 2020. Join me on my Facebook business page , my YouTube channel and the StaarCon Facebook page for regular livestream events. From Around the Web Not only is it a new year, it is a new month. Symbolic Living has your tarotscopes ! Susan Miller has your astrology forecast . Theresa Reed’s Hit List comes out at the beginning of every month. It is always a great read. Cards for Your Consideration Which tarot card speaks most about our search for clarity? Since we very often use tarot in that search, we might find a way to let each of the seventy-eight cards speak to us of clarity. One of my favorite cards to speak of the eternal search for truth and clarity is the High Priestess. In a reading, the High Priestess can speak of many things. She is the card of perfection, balance, wisdom, intuition, and the subconscious. We say that she travels beyond the veil and knows the secrets of life and death. That she is a keeper of such knowledge makes her a source of truth. Very often her message to us that that we can only find the truth we seek by searching within ourselves. When the High Priestess appears, she may be beckoning you to sit in silence and look within to find your inner visions, and to seek your inner truth. It is in that process that we find clarity. Upcoming Events and Tours Featured Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Card and Craft Academy Classes presented by Christiana are available right now at Card and Craft Academy! Christiana’s Candle Magick Christiana’s Eleven-Card Celtic Cross Finding Meaning in the Minor Arcana The Major Arcana, Magical and Mundane Practical Tarot Techniques Psychic Tarot Personal Tarot: Reading for Yourself Sharing Wisdom: Reading for Others The Meaning and Magic of Tarot Reversals Journey Through the Major Arcana Your Journey Through the Minor Arcana: Numbers, Elements and Truth Tarot Beyond the Veil Your Journey Through the Tarot Court Tarot Stories, Trends, and Blends (New) Tarot Topics Newsletter Volume 4 Issue 1 January 6, 2021 High Priestess Christiana Gaudet Christiana has been a full-time tarot professional for more than twenty years, and is the author of two books about tarot. In 2008, Christiana was granted the title of Tarot Grandmaster by the Tarot Certification Board of America. Christiana provides readings by phone, Facetime and Skype, and in her office in Palm City, Florida. https://christianagaudet.com Previous Previous Tarot Art Is More Than Pictures Next Next Five Things I Learned Last Year as a Tarotist and as a Human Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    },
    {
      "url": "https://christianagaudet.com/tarot-news/2021/11/17/the-inside-and-the-outside",
      "text": "The Inside and the Outside — Christiana Gaudet Skip to Content Open Menu Close Menu Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Christiana Gaudet Appointments News Events Blog About Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Galleries Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Services Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account 0 0 Open Menu Close Menu Appointments News Events Blog Folder: About Back Bio Introducing Christiana Gaudet Location Meetups Global Tarot Circle References Help Desk Folder: Galleries Back Skill Share August 30, 2010 Holiday Open House 2010 Holiday Open House 2015 The Great HurriMiniCon of 2016 Holiday Open House 2016 Holiday Open House 2017 4th of July 2018 in Fort Pierce Holiday Open House 2019 Mayday 2005 Tarot Picnic in Connecticut 2007 Folder: Services Back Private Readings Psychic House Parties Corporate Events and Large Functions Speaking Engagements Learning Parties Tarot Mentoring Login Account The Inside and the Outside Tarot Topics Newsletter Nov 17 Written By Christiana Gaudet People can appear very differently on the outside than they are on the inside. This can be tricky in dating when someone seems like a potential partner on the outside. When we see what is really on the inside, we may be delighted, or disappointed. Social media causes us to see other people’s outsides in ways that can make us unnecessarily envious. We should never compare other people’s outsides with our own insides. The process of aging creates another difference between the outside and the inside. So often older people feel just like they did when they were twenty, until they look in the mirror! Sometimes we must intentionally put on a good face and show a stronger outside than we what we are feeling on the inside. When thinking about the relationship with self, we must be clear about what is happening on the inside, and what we want to project to the outside world. When thinking about relationships with others, we must remember that what we see is not everything that is there. Sometimes intuition and divination can fill in the missing pieces. Even more importantly, our spiritual tools can help us develop our inner strength, compassion, and courage. When we make the effort to develop on the inside, that growth will ultimately be visible on the outside. This will allow us to be more present and authentic in the way we interact with others. The StaarCorner StaarCon is just about two months away. If you have questions about StaarCon, call me at 561-655-1160, or email me . Whether you plan to attend online or in person, it is time to get your ticket! Learn more on the StaarCon website . If you would like to be involved in StaarCon, we still have room for vendors and sponsors. We also have the StaarCon Scholarship Fund , if you would like to donate or nominate a recipient. Our episode of StaarCast this week was so much fun to make. My conversation with John Hijatt was enlightening and interesting. I cannot wait for his presentation at StaarCon. You can enjoy this episode on YouTube , or wherever you get your podcasts. Get Your StaarCon Tickets Now! Special StaarCon Room Rates at the DoubleTree Tarot Communication for Clarity and Depth Hybrid Class Our next ‘Zoom and Room’ tarot class will be Tuesday, November 30, from 7 pm to 9 pm ET. Tarot is a tool of communication. With tarot, we can communicate and understand our feelings. We can build our relationships. We can brainstorm our projects. We can understand the needs of our body. We can connect with Spirit. Whether we are reading for ourselves or others, the secret to clarity and depth in tarot readings is to understand how tarot communicate with us, and how tarot helps us communicate with others. In this class you will learn solid techniques for using tarot to communicate your own feelings, understand what is going on with your body, work well within a group, communicate with spirit, and connect with your creativity. You will also learn how to do these things effectively when reading for others. Class fee is $40. Sign up now! I Want to Purchase a Ticket to Attend in Person in Palm City I Want to Purchase a Ticket to Attend Virtually Live on Zoom Inside Outside Tarot Reading Here is a tarot spread to help you sort out what is happening inside you, and outside you. Arrange the cards in whatever pattern feels right. Card 1 . What is true about your inner self right now. Card 2 . How you want to present to the world. Card 3 . How you are presenting to the world. Card 4 . How the world is affecting you right now. Card 5 . How you can more authentically be yourself in the world right now. The Week in Review This week I posted some musings about tarot on my blog . We had a great class on my YouTube channel, Tarot Context Bootcamp . If you are on Instagram, make sure you follow me , and StaarCon ! I have begun sharing card pulls, live tarot unboxings, and reels. This weekend is the World Divination Association Virtual Event 2021 on Facebook Live. I will be presenting on Monday. Learn more, and get your tickets . From Around the Web Here is a tarot spread to help you reconnect with your inner self . Here is a recently published article in Religion News about diversity in tarot, featuring Emilie Muniz and her Simplicity Tarot! Find your inner self in four easy steps . Major Arcana 18, the Moon, from Ciro Marchetti's Grand Luxe Tarot. Used with permission. Cards for Your Consideration One of the most complicated and confusing cards of all seventy-eight tarot cards is the Moon, Major Arcana 18. This is quite fitting, because the Moon can speak of confusion, and the complicated nature of seeking truth in all aspects of life. When we think about the differences between outside appearances and inner truths, the Moon is a good card to consider. One thing that is often true when the Moon appears in a reading is that things are not as they seem. This is neither a negative nor positive quality; the context of the situation can suggest that things are truly better or worse than we might think. The Moon asks us to use our intuition, and to employ spiritual wisdom, to discover what is true about ourselves, about our relationships, and about the world. Become a YouTube Channel Member! Upcoming Events and Tours Featured Sep 14 Sep 14, 2025 Cards and Conversation Tarot Meetup Sep 14, 2025 Join us for informal tarot study and fellowship at Panera Bread in Palm City, Florida. Sep 14, 2025 Sep 20 Sep 20, 2025 All-Levels Tarot Workshop at Mandel Public Library of West Palm Beach Sep 20, 2025 Join us at Mandel Public Library of West Palm Beach for a Tarot Workshop every level of interest. Sep 20, 2025 Sep 23 Sep 23, 2025 TarotScopes October 2025 Live for YouTube Members Sep 23, 2025 Members of Christiana's YouTube channel get an early peek at the monthly TarotScopes! Sep 23, 2025 Sep 28 Sep 28, 2025 Majors-Only Readings Members-Only Livestream on YouTube Sep 28, 2025 Members are welcome to join us for readings using only the Major Arcana of tarot, and discussion about how the Majors speak to us. Sep 28, 2025 Card and Craft Academy Classes presented by Christiana are available right now at Card and Craft Academy! Christiana’s Candle Magick Christiana’s Eleven-Card Celtic Cross Finding Meaning in the Minor Arcana The Major Arcana, Magical and Mundane Practical Tarot Techniques Psychic Tarot Personal Tarot: Reading for Yourself Sharing Wisdom: Reading for Others The Meaning and Magic of Tarot Reversals Journey Through the Major Arcana Your Journey Through the Minor Arcana: Numbers, Elements and Truth Tarot Beyond the Veil Your Journey Through the Tarot Court Tarot Stories, Trends, and Blends Tarot Readings for Personalities and Relationships Clarity in Every Tarot Card Tarot Flow Workshop Making Magick with Tarot Fearless Wisdom Tarot Workshop Tarot Keywords and Interpretations Workshop Tarot Spreads Tools and Techniques Workshop Tarot for Magic and Mediumship Catch up on your missed Zoom webinars and more! cardandcraftacademy.com ﻿ About Christiana Gaudet Card and Craft, Inc. Christiana Gaudet 3559 SW Corporate Parkway Palm City, Florida 34990-8152 On the web www.christianagaudet.com Online classes www.cardandcraftacademy.com StaarCon information www.staarcon.com Private telephone, Skype, FaceTime and in person readings and instruction are available by appointment. Tarot parties at your home or office are available throughout Florida. Call or text toll free 866-99TAROT (866-998-2768) Palm City 772-301-0232 or call or text 561-655-1160 for more information or to schedule your event. Agent inquiries are welcome. Tarot Topics Newsletter Volume 4 Issue 46 November 17, 2021 The Moon Christiana Gaudet Christiana has been a full-time tarot professional for more than twenty years, and is the author of two books about tarot. In 2008, Christiana was granted the title of Tarot Grandmaster by the Tarot Certification Board of America. Christiana provides readings by phone, Facetime and Skype, and in her office in Palm City, Florida. https://christianagaudet.com Previous Previous How Gratitude Heals Us Next Next Can Tarot Tell You More Than Your Higher Self Already Knows? Tarot Topics Weekly Newsletter Get my newsletter each Wednesday morning. I cover a different topic every week! Name * First Name Last Name Email * Thank you! Newsletter Cookie Policy Privacy Policy Terms of Use Contact Card and Craft Inc, 770 SE Indian Street, Stuart, Florida, 34997, United States 866-99TAROT 866-998-2768 (Toll Free) 561-655-1160 (Text or Call) 772-207-1852 (Stuart) tarot@christianagaudet.com Powered by Squarespace"
    }
  ]
}