{
  "query": "chwinery.com email",
  "fuentes": [
    {
      "url": "https://chwinery.com/contact/media",
      "email": "press@chwinery.com"
    },
    {
      "url": "https://chwinery.com/privacy-policy",
      "email": "dataprivacy@chwinery.com"
    },
    {
      "url": "https://chwinery.com/privacy-policy",
      "email": "info@chwinery.com"
    }
  ],
  "mails": [
    "press@chwinery.com",
    "dataprivacy@chwinery.com",
    "info@chwinery.com"
  ],
  "nombre_sitio": "chwinery.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://chwinery.com/contact/media",
      "text": "Media | Cooper's Hawk Skip to main content Careers (opens in new window) Order Carryout (opens in new window) Shop (opens in new window) Member Login (opens in new window) Join Wine Club (opens in new window) Cooper's Hawk Winery &amp; Restaurants Locations Restaurant Locator Coming Soon All Coming Soon Locations Woodbridge, VA Livonia, MI Avondale, AZ Greensboro, NC Madison, AL Green Township, OH Wellington, FL Alabama All Alabama Locations Madison, AL Arizona All Arizona Locations Avondale, AZ Chandler, AZ Gilbert, AZ Scottsdale, AZ Surprise, AZ Florida All Florida Locations Coconut Creek, FL Dania Beach, FL Doral, FL Fort Myers, FL Jacksonville - Big Island Drive, FL Jacksonville - Mandarin Landing, FL Naples, FL Orlando - International Drive, FL Orlando - Waterford Lakes, FL Palm Beach Gardens, FL Pembroke Pines, FL Sarasota, FL Tampa, FL Wellington, FL Wesley Chapel, FL Georgia All Georgia Locations Alpharetta, GA Illinois All Illinois Locations Algonquin, IL Arlington Heights, IL Bloomingdale, IL Burr Ridge, IL Downers Grove, IL Gurnee, IL Kildeer, IL Montgomery, IL Morton Grove, IL Naperville, IL New Lenox, IL Oak Lawn, IL Oak Park, IL Orland Park, IL Plainfield, IL South Barrington, IL Springfield, IL St. Charles, IL Wheeling, IL Indiana All Indiana Locations Avon, IN Indianapolis, IN Merrillville, IN Schererville, IN Iowa All Iowa Locations Clive, IA Maryland All Maryland Locations Annapolis, MD Rockville, MD Michigan All Michigan Locations Clinton Township, MI Kentwood, MI Lansing, MI Livonia, MI Troy, MI Missouri All Missouri Locations Kansas City - Northland, MO Kansas City - Plaza, MO Lee's Summit, MO St. Peters, MO Town and Country, MO North Carolina All North Carolina Locations Greensboro, NC Ohio All Ohio Locations Avon - Chester Road, OH Centerville, OH Cincinnati, OH Columbus, OH Green Township, OH Liberty Township, OH Orange Village, OH Toledo, OH Virginia All Virginia Locations Ashburn, VA Reston, VA Richmond, VA Virginia Beach, VA Woodbridge, VA Wisconsin All Wisconsin Locations Brookfield, WI Greenfield, WI Middleton, WI Menus Overview Dine-In & Carryout (opens in new window) Chef Recommendations Brunch & Bubbles (opens in new window) Wine O'Clock - Happy Hour Wine in Tasting Room Dessert Kids (opens in new window) Gluten Free (opens in new window) Catering (opens in new window) Food Allergen Guide (opens in new window) Gluten Free Food Allergen Guide (opens in new window) Our Food Our Wine Wine Portfolio All Wine of the Month Cooper's Hawk Lux Red Camille Sparkling White International Rosé Non/Low Alcoholic Sweet Red Specialty Sangria Spritz Fruit Dessert Spiced Previous Wines of the Month Large Format Awards Monthly Tasting (opens in new window) Wine Club Join Now (opens in new window) Membership Types Gift Memberships Benefits Pricing Special Events Overview Friends of Cooper's Hawk Wine Club Dinners Wine Trips Ambassador Club Wine Club Newsletter FAQ Tasting Room Tasting Room Tips from our Tasting Room Monthly Tasting Private Events Overview About Our Story Our Founder Our Chef Our Sommelier Our Roots News Contact Us Contact Media Donations Real Estate Offsite Event Inquiries Careers Search Careers (opens in new window) Benefits & Perks (opens in new window) Enriching Lives (opens in new window) Career Development (opens in new window) Mailing List Signup (opens in new window) Gift Cards (opens in new window) Shop (opens in new window) Reservations & Carryout Make a Reservation Car­ry­out is also available. Join our Wine Club and enjoy our exclu­sive Wine of the Month! Media Contact Media Donations Real Estate Offsite Event Inquiries Overview Website chwinery.com Proprietor Tim McEnery About Founded in 2005 by CEO Tim McEnery, Cooper’s Hawk Winery & Restaurants is built upon the passionate belief that food and wine hold the power to forge lasting connections. Cooper’s Hawk is a lifestyle brand centered around wine and focused on creating memorable moments that enrich lives. The concept is a fusion of familiar elements – modern casual restaurant, Napa-style tasting room and artisanal retail market – that has combined to create an entirely new hospitality experience. Wine Program The Cooper’s Hawk wine collection is designed to please a range of palates, and includes selections that are accessible for those new to the world of wine, as well as complex and full-bodied options for more seasoned drinkers. Thew winery sources the finest grapes from around the globe; their blends include grapes grown and harvested in both New World and Old World regions including Italy, France, California, Chile, New Zealand and Australia. The winemaking team works closely with growers, nurturing the fruit for each wine according to individual needs. Since open­ing in late 2005 , Cooper’s Hawk has received over 500 wine awards from var­i­ous local, nation­al, and inter­na­tion­al wine competitions. Food Program The restaurant’s contemporary American menu contains a carefully curated selection of food and wine pairings. Executive Chef Matt McMillin has created a 110-item menu of American-fusion dishes featuring flavors from around the world. All items are paired with a wine, labeled on the menu by bin number, as suggested by the winemaker. Every single menu item is made in the company’s scratch kitchen, and incorporates peak-of-season ingredients. Wine Club The Cooper’s Hawk Wine Club is a community of nearly 350,000 wine enthusiasts united by their love of wine, food and camaraderie. The Club, growing at an annual rate of 25 percent, offers members 12 limited-production specialty blends each year created exclusively for them. Members pick up their monthly wines at a Cooper’s Hawk restaurant location, which allows them to stay fully engaged with the brand. Wine Club members also receive rewards, members-only pricing, and domestic and international travel opportunities, along with access to private Friends of Cooper’s Hawk events, hosted by luminaries in wine making and food including Gail Simmons, Fabio Viviani, Tyler Florence, Jean-Charles Boisset, Todd Anderson and more. Tasting Room The tasting rooms that front each Cooper’s Hawk restaurant are a place for guests and Wine Club members to gather, share and explore Cooper’s Hawk wines. The goal is to offer guided tastings designed to help guests discover and learn, enhancing their own personal wine journeys. The Artisan Market Each Cooper’s Hawk location houses an artisan market featuring curated items for purchase that enable guests to share aspects of the Cooper’s Hawk experience with friends and family and bring lifestyle elements into their homes. With over 200 retail SKUs, selections include high-end decanters, wine accessories, a proprietary gourmet food line and a selection of curated seasonal gifts. Private Functions Each Cooper’s Hawk restaurant offers uniquely designed winery-inspired private party spaces. These spaces allow our guests the opportunity to experience the rich culture and timelessness of the winemaking world. Additionally, we feature special private party packages perfect for celebrations, business meetings and group dinners. Hours Restaurant Hours Monday – Thursday: 11am – 9pm Friday & Saturday: 11am – 9pm Sunday: 11am – 9pm Please note that some location hours may vary. Check a location for specific hours. For More Information Contact Now Wine Club (opens in new window) Wine Portfolio (opens in new window) AWARDS (opens in new window) Tasting Room (opens in new window) Our Story (opens in new window) Dining Guidelines & Dress Code (opens in new window) Purchase Gift Memberships Check Physical Gift Card Balance (opens in new window) Check egift card balance (opens in new window) Locations (opens in new window) Menus (opens in new window) Private Events (opens in new window) Media (opens in new window) Order Carryout (opens in new window) Contact Us (opens in new window) Shop (opens in new window) Join Mailing List (opens in new window) Careers (opens in new window) Terms of Use Privacy Policy Download\nOur App Download on the iOS App Store Download on Google Play image/svg+xml Reservations gift cards Instagram\n(Opens a new window) Twitter\n(Opens a new window) Facebook\n(Opens a new window) YouTube\n(Opens a new window) © 2025\nCooper's Hawk Winery & Restaurants All rights\nreserved. Privacy Policy . Cooper's Hawk Wine Club Cooper's Hawk Winery & Restaurants Piccolo Buco"
    },
    {
      "url": "https://chwinery.com/privacy-policy",
      "text": "Privacy Policy | Cooper's Hawk Skip to main content Careers (opens in new window) Order Carryout (opens in new window) Shop (opens in new window) Member Login (opens in new window) Join Wine Club (opens in new window) Cooper's Hawk Winery &amp; Restaurants Locations Restaurant Locator Coming Soon All Coming Soon Locations Woodbridge, VA Livonia, MI Avondale, AZ Greensboro, NC Madison, AL Green Township, OH Wellington, FL Alabama All Alabama Locations Madison, AL Arizona All Arizona Locations Avondale, AZ Chandler, AZ Gilbert, AZ Scottsdale, AZ Surprise, AZ Florida All Florida Locations Coconut Creek, FL Dania Beach, FL Doral, FL Fort Myers, FL Jacksonville - Big Island Drive, FL Jacksonville - Mandarin Landing, FL Naples, FL Orlando - International Drive, FL Orlando - Waterford Lakes, FL Palm Beach Gardens, FL Pembroke Pines, FL Sarasota, FL Tampa, FL Wellington, FL Wesley Chapel, FL Georgia All Georgia Locations Alpharetta, GA Illinois All Illinois Locations Algonquin, IL Arlington Heights, IL Bloomingdale, IL Burr Ridge, IL Downers Grove, IL Gurnee, IL Kildeer, IL Montgomery, IL Morton Grove, IL Naperville, IL New Lenox, IL Oak Lawn, IL Oak Park, IL Orland Park, IL Plainfield, IL South Barrington, IL Springfield, IL St. Charles, IL Wheeling, IL Indiana All Indiana Locations Avon, IN Indianapolis, IN Merrillville, IN Schererville, IN Iowa All Iowa Locations Clive, IA Maryland All Maryland Locations Annapolis, MD Rockville, MD Michigan All Michigan Locations Clinton Township, MI Kentwood, MI Lansing, MI Livonia, MI Troy, MI Missouri All Missouri Locations Kansas City - Northland, MO Kansas City - Plaza, MO Lee's Summit, MO St. Peters, MO Town and Country, MO North Carolina All North Carolina Locations Greensboro, NC Ohio All Ohio Locations Avon - Chester Road, OH Centerville, OH Cincinnati, OH Columbus, OH Green Township, OH Liberty Township, OH Orange Village, OH Toledo, OH Virginia All Virginia Locations Ashburn, VA Reston, VA Richmond, VA Virginia Beach, VA Woodbridge, VA Wisconsin All Wisconsin Locations Brookfield, WI Greenfield, WI Middleton, WI Menus Overview Dine-In & Carryout (opens in new window) Chef Recommendations Brunch & Bubbles (opens in new window) Wine O'Clock - Happy Hour Wine in Tasting Room Dessert Kids (opens in new window) Gluten Free (opens in new window) Catering (opens in new window) Food Allergen Guide (opens in new window) Gluten Free Food Allergen Guide (opens in new window) Our Food Our Wine Wine Portfolio All Wine of the Month Cooper's Hawk Lux Red Camille Sparkling White International Rosé Non/Low Alcoholic Sweet Red Specialty Sangria Spritz Fruit Dessert Spiced Previous Wines of the Month Large Format Awards Monthly Tasting (opens in new window) Wine Club Join Now (opens in new window) Membership Types Gift Memberships Benefits Pricing Special Events Overview Friends of Cooper's Hawk Wine Club Dinners Wine Trips Ambassador Club Wine Club Newsletter FAQ Tasting Room Tasting Room Tips from our Tasting Room Monthly Tasting Private Events Overview About Our Story Our Founder Our Chef Our Sommelier Our Roots News Contact Us Contact Media Donations Real Estate Offsite Event Inquiries Careers Search Careers (opens in new window) Benefits & Perks (opens in new window) Enriching Lives (opens in new window) Career Development (opens in new window) Mailing List Signup (opens in new window) Gift Cards (opens in new window) Shop (opens in new window) Reservations & Carryout Make a Reservation Car­ry­out is also available. Join our Wine Club and enjoy our exclu­sive Wine of the Month! Privacy Policy Effective: August 4, 2022 YOUR PRIVACY Cooper’s Hawk Intermediate Holding, LLC and its Cooper's Hawk Winery & Restaurants (“Cooper’s Hawk”, “we”, “us” or “our”) are committed to maintaining the confidence of our guests and visitors to our web site, mobile applications, software applications and/or other similar services (the “Services”). In particular, you should know that we are not in the business of selling, renting or trading email lists with other companies and businesses for marketing purposes. In this Privacy Policy we provide detailed information on when and why we collect your Personal Information, how we use it, when we may disclose it to others, and how we keep it secure. We understand that privacy disclosures are an ongoing responsibility, so from time to time we will update this Privacy Policy as our practices related to Personal Information change (as described below). We encourage you to look for updates and changes to this Privacy Policy by checking the “Effective” date when you access or use the Services. The Services are designed and intended for only users from the United States. The Services may not be available in all states and we do not intend to collect Personal Information from residents of those states. COLLECTION AND USE OF PERSONAL INFORMATION We use “Personal Information” throughout this Privacy Policy to mean any information that may be used to identify you. Certain activities on our Services require you to be registered. As part of the registration process, we collect the Personal Information that you share with us. Other activities on the Services require you to provide Personal Information to enter into a transaction with us. For example, we collect the following types of information on our Services. When you sign up for our Wine Club, we collect your name, birthdate, mailing address, phone number, email address and payment information, and as a Wine Club member we collect your account information, including but not limited transaction history. When you place an online order for carryout, curbside or delivery, we collect your name, email address, phone number, payment information, and, if applicable, Wine Club number. When you create an account on our retail site, place an order for retail products or place an order for a wine shipment, we collect your name, birthdate, email address, account password, mailing address, payment information and, if applicable, Wine Club number. When you make a reservation for a dining visit, we collect your name, phone number, and email address. When you sign up for our mailing list to receive news, updates and information, we collect your name, address and email address. If you have applied for a job with us, the Personal Information submitted with your application will be used to process your application. Wine Club Members have the ability to purchase a bottle of wine to gift to someone they know. In doing so, Members may provide Personal Information about the recipient including, but not limited to name, phone number, email address and physical address. When you send a gift card or similar purchase to another person, you may provide the name, address and email address of such individuals to whom you send a gift card or similar purchases. When you provide information to report a problem with our Services or other transaction with us by email, our site, telephone or through other means. When you provide information relating to your participation in a contest, promotion, or surveys that we may ask you to complete for research and/or marketing purposes. When you provide payment card, transaction or financial account information, if you make a purchase online or at one of our locations. When you use our Services, we automatically collect certain information about your use of the Services through cookies and other tracking technologies. Some of this may be linked to you personally to enable personalization of content that we display on our Services, personalization of your experience on our Services and to support our marketing efforts. When you interact with any Cooper’s Hawk page or account on a social media platform, we may collect the Personal Information that you or the platform make available to us on that page or account, including your social media account ID and/or user name associated with that social media service, your profile picture, email address, friends list or information about the people and groups you are connected to and how you interact with them, and any information you have made public in connection with that social media service. The information we obtain depends on your privacy settings on the applicable social media service; we comply with the privacy policies of the social media platform and only collect and store such Personal Information that we are permitted to collect by those social media platforms. When you access the Services through social media channels or when you connect to social media services, you are authorizing us to collect, store, and use such information and content in accordance with this Privacy Policy. When you use our Services we automatically collect information about your interaction with our website, including the Internet Protocol (IP) address used to connect your computer to the Internet, your geolocation and other information that may be inferred from your IP address, the address of referring websites, information about how you browse and use our Services, webpages you visit, view and click on when using the Services, and other information about your session on our Services. We may collect this information through cookies. We use your Personal Information for several general purposes: to tell you about products and services; to fulfill transactions; to customize, improve, and personalize our Services; to contact you if we need to obtain or provide additional information, respond to your comments or questions or otherwise provide customer service; to verify the accuracy of our records and your identity; to customize our advertising and marketing materials so that they are useful, relevant or otherwise of interest to you and to deliver targeted advertising; to save your user account, registration and profile data or other Personal Information (so you do not have to re-enter it each time you visit or use the Services); to send you marketing communications; to help us develop new products and services and improve our existing products and services; to ensure the Services function properly and to track logins; to contact you regarding customer satisfaction surveys; to perform research purposes and provide anonymous reporting for internal use and to external service providers to assist in our providing the Services; to process job applications; to enable our other business purposes, such as dispute resolution, audit and security, detection, prevention and mitigation of fraudulent or illegal activities and to enforce our other applicable policies; to perform any other purpose disclosed to you prior to you providing us your Personal Information or which are reasonably necessary to provide the Services or other related products and/or services requested. We use several software products to analyze traffic to the Services and patterns of use of the Services in order to understand our customer's and visitor's needs and to continually improve our Services for them. We may also use and share your Personal Information with our service providers to help us with providing the Services, including for purposes such as payment processing, customer service, email deployment, business analytics, marketing, performance monitoring and hosting. For example, we use tools like Google Analytics to measure traffic on our Services and how users interact with our Services. Google Analytics utilizes cookies to gather information regarding use of our Services, which Google uses to generate reports for us regarding our Services. Google Analytics collects information when you use the Services, such as time of visit, pages visited, and time spent on each page of the webpages, referring site details, type of web browser, type of operating system, screen resolution, and IP address. The data used by Google Analytics is anonymized and your IP address will not be associated with any other data held by Google. To find out more about how Google uses data when you use our Services and your options for controlling and limiting the information collected by Google from the Services, please click here https://policies.google.com/technologies/partner-sites . You may opt-out of having your activity on our Services made available to Google Analytics by installing the Google Analytics browser add- on, available here: https://support.google.com/analytics/answer/181881 . We may also use your Personal Information for certain regulatory, compliance and legal purposes. DATA SECURITY We implement and maintain a range of reasonable and appropriate, albeit not infallible, physical, electronic and procedural safeguards intended to maintain the confidentiality of your Personal Information. However, we do not guarantee that our safeguards will always work. The security of information transmitted through the internet cannot be guaranteed. We are not responsible for any interception or interruption of any communications or for changes to or losses of Personal Information through the internet. You are responsible for maintaining the security of any password, user ID or other form of authentication involved in obtaining access to our Services which require a password protected account. Any access to websites, mobile applications, or other services through your user ID and password will be treated as authorized by you, USE OF COOKIES When you visit our websites or use our mobile app, we may collect data through automated means, using technologies such as cookies. A cookie is a small text file containing information that a web site transfers to your computer's hard disk allowing a web site to recognize your browser. Analytics Cookies - We and our service providers use cookies (and other similar technologies such as web beacons, tracking pixels, and HTTP referrers) to analyze our site traffic patterns, operate the Services, personalize content that you see on the Services and monitor the performance of our marketing efforts and your response to those marketing efforts. Strictly Necessary Cookies – We may use these as needed for the Services to operate as reasonably expected by you. Preferences, Features and Services Cookies and Persistent Cookies – We may use persistent cookies, which remain on your device for a pre-defined period of time, or other cookies, to enable us, the Services and our third party service providers to remember your preferences and to tailor the Services to them, and to tell us your communications preferences, help you fill out forms and to provide you with features, insights, and customized content. They may also be used to track your activity and build a profile of your behavior for your use of the Services and for targeted advertising. Marketing Cookies – We may use cookies to show you relevant advertising or to tailor marketing to you. We may use cookies to learn whether you saw an ad and later took any action. Similarly, our third party service providers may use cookies to provide us with information about how you interact with the Services and how advertising that is shown performs. Security Cookies – We may use cookies to enable and support security features and/or to help us detect malicious activity or violations of applicable terms. Third Party Cookies - We may allow the use of third party cookies to incorporate elements from other sites or service providers (as defined below), such as plugins or advertising, and we may allow members to access carryout online ordering or related services, including through the mobile app, that may link to a third party carryout service or similar website in order to perform certain transactions, and your information may be passed to the third party, so they can access their account for purposes of processing orders and other similar purposes. Most web browsers automatically accept cookies; consult your browser's manual or visit www.allaboutcookies.org if you want information on restricting or disabling the browser's handling of cookies. If you disable cookies, you can still view the publicly available information on our web site, however certain features of the Services may not function properly if cookies are disabled or restricted. RETENTION OF PERSONAL INFORMATION We retain your Personal Information for a minimum of 12 months and as long as needed for the purposes for which it was collected and other permitted purposes, including retention of Personal Information pursuant to any applicable contract, law, or regulation. As such, our retention periods vary based on business, legal, and regulatory needs. If you would like us to delete any information that you have provided via the Services, please contact us at dataprivacy@chwinery.com and we will respond in a reasonable time. Please note that some or all of the Personal Information may be required for the Services to function properly, and we may be required to retain certain information by law. AGGREGATED AND DE-IDENTIFIED PERSONAL INFORMATION We may aggregate and/or de-identify your Personal Information so that it can no longer be linked to you. We may use and share aggregated/de-identified information for any purpose at our sole discretion. We will maintain this data in its de-identified form. HOW WE SHARE PERSONAL INFORMATION We may use vendors to provide services on our behalf (our “service providers”). For example, we use service providers to process or deliver orders, operate and provide analytics for our Services, and to carry out marketing and statistical testing of the Services. We provide service providers only the information they need to deliver the service. We may also disclose your Personal Information to our corporate affiliates, parents and/or subsidiaries; with respect to co-branded services and features, to our partners based on your participation in a co-branded service or feature; if required to do so by law or in the good faith belief that such action is necessary; in connection with a sale, merger, transfer, exchange or other disposition (whether of assets, stock or otherwise) of all or a portion of our business and/or our affiliates, parents or subsidiaries; to conform to legal requirements or comply with legal process served on us or respond to requests from public and government authorities; to protect and defend our rights or property, our affiliates, parents and/or subsidiaries, and/or the Services; to enforce our agreements with you, to act in urgent circumstances to protect personal safety, the public, our operations or our rights; or with your consent. EMAIL COMMUNICATIONS The CAN-SPAM Act gives recipients of commercial email the right to have emails stopped from being sent to them. You may unsubscribe from our marketing communications by clicking the “unsubscribe” link found in every commercial email we send, or (if you have an account with us) by sending us a request to unsubscribe. You may also email info@chwinery.com to unsubscribe. If you opt-out of receiving our marketing email communications, we may still send you email messages related to your account or specific transactions with us. Unsubscribing yourself from our marketing emails will not affect our service to you. Emails that we and our marketing service providers send may include tracking tools that provide us with information related to whether you have opened an email or clicked on a link contained in an email. CHILDREN AND PRIVACY Our Services are not intended to attract children or persons under the age of 18, and we do not knowingly solicit Personal Information from children. If we learn that we have collected Personal Information from a child or other person under the age of 18, we will delete that information from our records, unless we are legally required to retain it. If you believe that we have mistakenly or unintentionally collected information from a child or other person under the age of 18 please contact us via email at dataprivacy@chwinery.com . LINKS TO OTHER WEB SITES Our Services contain links to information on other web sites that we do not control. These websites have their own privacy policies and data collection and disclosure practices. We are not responsible for the protection and privacy of any information that you provide while visiting those sites. Those sites are not governed by this Privacy Policy, and if you have questions about how a site uses your information, consult that site's privacy statement. ACCESS TO YOUR PERSONAL INFORMATION If you have created an account with us, you can review and update the Personal Information that you have provided to us at any time by logging into your account and updating your profile, or if you do not have an account or otherwise want to review and update your Personal Information you may do so by using the following Contact Us form or emailing your request to info@chwinery.com . UPDATING YOUR PERSONAL INFORMATION You may update your information at any time by using the following Contact Us form or emailing info@chwinery.com . Your California Rights California residents have additional rights pursuant to the California Consumer Privacy Act. Right to Opt-Out of the Sale and Sharing of Your Personal Information. California residents may opt-out of the sale of their Personal Information or the sharing of their Personal Information for cross-context behavioral advertising. We do not sell your Personal Information. Email dataprivacy@chwinery.com to opt-out of the sharing of your Personal Information. [“Do Not Sell or Share My Personal Information.”] Right to Limit the Use of Your Sensitive Personal Information. Effective January 1, 2023 under the California Privacy Rights Act (“CPRA”), if you are a California consumer, you may direct us to limit the use of your sensitive Personal Information to uses that are reasonably necessary to provide our goods and services, or as needed: to ensure security and integrity; for short-term, transient use, including for non-personalized advertising; to maintain or service accounts, provide customer service, process or fulfill orders and transactions, verify customer information, process payments, provide financing, provide analytic services, provide storage, or other similar services; and to verify or maintain the quality or safety of a service or device owned, manufactured, manufactured for, or controlled by us, and to improve, upgrade, or enhance such services or devices. We do not use your sensitive Personal Information beyond the purposes necessary to perform functions of our business. As such, this right is not applicable. Right to Request More Information. This Privacy Policy discloses our practices with respect to the collection of your Personal Information. In addition to these disclosures, you may also submit a request to know the following information collected during the preceding 12 months: (1) the specific pieces of Personal Information we have collected about you; (2) the categories of Personal Information we collected about you; (3) the categories of Personal Information we sold or shared about you and the categories of third parties to whom each category of Personal Information was sold or shared; (4) the categories of Personal Information we disclosed about you for a business purpose and the categories of persons to whom it was disclosed; and (5) a list of all third parties to whom we have disclosed Personal Information, as defined under California Civil Code Section 1798.83(e) (a/k/a the “Shine the Light Law”), during the preceding year for third-party direct marketing purposes. Please note that due to the different requirements of the applicable laws, our response times may vary depending on the specific type(s) of information sought. We respond to all verifiable requests for information as soon as we reasonably can and no later than legally required. Right to Request Deletion of Your Personal Information. You have the right to request that we delete your Personal Information. Following receipt of a verifiable request, we will let you know what, if any, Personal Information we can delete from our records. Effective January 1, 2023 under the CPRA, we will also notify our service providers and contractors, and any third parties to whom we have transferred your information about your request to delete. If we cannot delete all of your Personal Information, we will let you know why. Right to Correct Inaccurate Information. Effective January 1, 2023 under the CPRA, if you believe that any of the Personal Information we maintain about you is inaccurate, you may submit a request for us to correct that information. Upon receipt of a verifiable request to correct inaccurate Personal Information, we will use commercially reasonable efforts to correct the information as you direct. Right to Non-Discrimination for the Exercise of Your Privacy Rights If you choose to exercise any of your California rights, you have the right to not receive discriminatory treatment by us. Submitting Requests Relating to Your California Rights California residents may submit requests relating to your Personal Information as described below by email to dataprivacy@chwinery.com , or by calling us at 1(888) 685-0056. To help protect your privacy and maintain security, we will take steps to verify your identity before granting you access to your Personal Information or complying with any of the requests described below. To verify your identity, we may require you to provide certain information we are likely to already have on-file about you based on the type of relationship you have with us. If you already have an account, we may require you to use that account as part of the verification process. If you exercise your right to request specific pieces of your Personal Information, we will require you to sign a declaration under penalty of perjury that you are the consumer whose Personal Information is the subject of the request. If you would like to designate an authorized agent to submit these requests on your behalf, please contact us by email to dataprivacy@chwinery.com , or by calling us at 1(888) 685-0056. UPDATES TO THIS PRIVACY POLICY AND YOUR CONSENT We may change this Privacy Policy from time to time and without notice. If we change our Privacy Policy, we will publish those changes on this page. The “Effective” date or “Last Updated” date at the top of this page indicates when this Privacy Policy was last revised. We encourage you to read this Privacy Policy periodically to stay up to date about our privacy practices. HOW TO CONTACT US If you have any questions or concerns about our collection, use or disclosure of your Personal Information, please contact us using the following Contact Us form or email info@chwinery.com . For more information about our Services, please email us at info@chwinery.com . Wine Club (opens in new window) Wine Portfolio (opens in new window) AWARDS (opens in new window) Tasting Room (opens in new window) Our Story (opens in new window) Dining Guidelines & Dress Code (opens in new window) Purchase Gift Memberships Check Physical Gift Card Balance (opens in new window) Check egift card balance (opens in new window) Locations (opens in new window) Menus (opens in new window) Private Events (opens in new window) Media (opens in new window) Order Carryout (opens in new window) Contact Us (opens in new window) Shop (opens in new window) Join Mailing List (opens in new window) Careers (opens in new window) Terms of Use Privacy Policy Download\nOur App Download on the iOS App Store Download on Google Play image/svg+xml Reservations gift cards Instagram\n(Opens a new window) Twitter\n(Opens a new window) Facebook\n(Opens a new window) YouTube\n(Opens a new window) © 2025\nCooper's Hawk Winery & Restaurants All rights\nreserved. Privacy Policy . Cooper's Hawk Wine Club Cooper's Hawk Winery & Restaurants Piccolo Buco"
    }
  ]
}