{
  "fuentes": [
    {
      "url": "https://circusarts.org/blog/portfolio-item/alexander-calder-and-newtons-laws-of-motion/",
      "email": "karen@circusarts.org"
    },
    {
      "url": "https://circusarts.org/blog/portfolio-item/alexander-calder-and-newtons-laws-of-motion/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/sailor-circus-academy/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/sailor-circus-academy/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/community-outreach/education-staff/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/performances/shows/sailor-performance/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "email": "register@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/blog/category/sailor-circus/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/about-us/our-board/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circesteem.org/",
      "email": "info@circesteem.org"
    },
    {
      "url": "https://circusarts.org/programs/sailor-circus-academy-home-2/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/about-us/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://www.necenterforcircusarts.org/",
      "email": "info@necenterforcircusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/",
      "email": "register@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/",
      "email": "register@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/sailorcircusgold/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://sarasotaarts.org/venue/sailor-circus-arena/",
      "email": "info@sarasotaarts.org"
    },
    {
      "url": "https://circusarts.org/contact-us/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/contact-us/",
      "email": "kelly@circusarts.org"
    },
    {
      "url": "https://circusarts.org/contact-us/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/contact-us/",
      "email": "sasa@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "register@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "register@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "email": "tonia@circusarts.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://circusliquor.com/contact-us/",
      "email": "info@circusliquor.com"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/arts/2024/12/21/sarasota-sailor-circus-marks-75-years-of-student-performances/76889367007/",
      "email": "jay.handelman@heraldtribune.com"
    },
    {
      "url": "https://www.circuscollective.com/contactus",
      "email": "info@circuscollective.com"
    },
    {
      "url": "https://issuu.com/srqme/docs/issuu_srqdec20_spiritofgiving/s/11426261",
      "email": "karenm@circusarts.org"
    },
    {
      "url": "https://www.eshcircusarts.com/our-staff/",
      "email": "info@eshcircusarts.com"
    },
    {
      "url": "https://circusarts.com.au/group-bookings/corporate-groups/",
      "email": "info@circusarts.com.au"
    },
    {
      "url": "https://circusarts.org/calendar/sailor-circus-holiday-shows/",
      "email": "info@circusarts.org"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/arts/2024/11/23/circus-sarasota-founders-shift-to-new-roles-in-long-planned-change/76495789007/",
      "email": "jay.handelman@heraldtribune.com"
    }
  ],
  "mails": [
    "info@circesteem.org",
    "info@circusarts.com.au",
    "info@circusarts.org",
    "info@circuscollective.com",
    "info@circusliquor.com",
    "info@eshcircusarts.com",
    "info@necenterforcircusarts.org",
    "info@sarasotaarts.org",
    "jay.handelman@heraldtribune.com",
    "karen@circusarts.org",
    "karenm@circusarts.org",
    "kelly@circusarts.org",
    "register@circusarts.org",
    "sales@finewineliquors.com",
    "sasa@circusarts.org",
    "tonia@circusarts.org"
  ],
  "nombre_sitio": "circusarts.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://circusarts.org/blog/portfolio-item/alexander-calder-and-newtons-laws-of-motion/",
      "text": "Alexander Calder and Newton’s Laws of Motion - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Community Outreach 2 / Alexander Calder and Newton’s Laws of Motion Alexander Calder and Newton’s Laws of Motion Ideal for, but not limited to science, art, technology, and math class students Ideal for, but not limited to science, technology, engineering, art and math students. This Project-Based Learning exploration, presented by The Circus Arts Conservatory’s Education Program, integrates Science and Art in the classroom.  Students are asked to choose and research a circus act.  Once the science of motion has been explained and understood, as well as information about the circus act, the students will demonstrate their knowledge of physics and engineering by creating a model of their circus act in the style of Alexander Calder. Ideal for grades 5-8. Program is off-campus at The Circus Arts Conservatory’s Sailor Circus Arena and in the classroom. For more information, contact Karen Bell at 941.355.9335, ext. 302 Email Us Teacher Resources Student Resources Educational Outreach Programs Overview Marvelous, Miraculous, Circus Machine Circus Science Alexander Calder and Newton’s Laws of Motion Mirette on the High Wire Build-A-Circus Education Staff & Task Force Meet Our Staff Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/programs/sailor-circus-academy/",
      "text": "Sailor Circus Academy - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Programs 2 / Sailor Circus Academy Previous Previous Previous Next Next Next 1 2 3 4 5 Sailor Circus Academy The Greatest Little Show on Earth! Sailor Circus Academy The Sailor Circus Academy is a circus arts training program for students in Sarasota and Manatee counties. Known worldwide as “The Greatest ‘Little’ Show on Earth,” the Sailor Circus Academy is the oldest youth circus in America, attracting over 1 million spectators to its annual performances. Located in Sarasota, Florida, the Academy offers after-school circus training where students can develop important life skills, gain self-discipline, build confidence, and commit to achieving their goals—all within a vibrant circus atmosphere. Created in 1949 as a high school gymnastics class, the Sailor Circus has grown into a spectacular circus school that is one of the top in the USA, serving students in grades 1 through 12 and beyond. Through rigorous interdisciplinary performing arts and psychomotor skills programs, students learn circus arts in a safe and nurturing atmosphere. Sailor Circus Academy students are recognized as future leaders and major contributors to the circus legacy in Sarasota. Scroll Through The Infographics Below for the Lastest Sailor Academy Updates Evaluations and Registration for the 2025–2026 Season Have Been Completed Check back in Spring 2026 for new information on Evaluations for the 2026-2027 season! Evaluations required for: New students Returning students who did not participate in the previous season Eligibility: Students must be at least six years old Must have completed kindergarten Eligible through the 12th grade (senior year of high school) For more than seven decades, thousands of students have completed the Sailor Circus training program. Each year, students train countless hours per week with dedicated coaches and volunteers to create Sailor Circus Performances that have become a major tourist attraction in the Southwest Florida region. Sailor Circus Academy students have the unique opportunity to work with international circus artists who travel to Sarasota from around the world to perform with Circus Sarasota . The professional performers deliver workshops and hands-on circus training in various disciplines to the Sailor Circus Academy youth. Support their Passion. Celebrate their Art. Your gift helps young artists shine. Join the Sailor Circus Alumni Group Help us build an all-access network connecting past, present, and future Sailor Circus Academy students. ~  Share stories and photos (link)                                     ~  Connect with teammates, coaches, staff, volunteers, and all involved                                     ~  Continue to uphold the Sailor Circus legacy Sailor Circus Alumni e-news Sign Up more information Contact Sailor Circus Alumni Group Sign-Up Join the Alumni Group Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/community-outreach/education-staff/",
      "text": "Meet Our Education Staff - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Community Outreach 2 / Meet Our Education Staff Education Staff Karen Bell Karen Bell has had a 36 year career as a Professional Circus clown. She is the only female clown with a solo ring gag on Ringling Bros. and Barnum & Bailey Circus. As a ‘Producing’ Clown for Ringling, Karen created material to perform for herself and other clowns on the show. She has toured the world clowning with Ringing and the Department of Defense. In 2005, Ms. Bell moved to Florida to work as Outreach and Education Manager for The Circus Arts Conservatory and has been instrumental in expanding the Humor Therapy outreach program, to include “Memories…Lost and Found” a program to aid dementia and late stage Alzheimer patients. Additionally, she is responsible for the design, development and implementation of The CAC’s Education Program. Creating and teaching circus curriculum for elementary and middle school students. Along with her partner, Robin Eurich, Karen has presented at the National Science Teacher Association’s STEM conference for two years in a row. One of Ms. Bell’s proudest accomplishments has been being a part of an amazing team that has created circus curriculum for Sarasota High School’s Circus Arts Magnet program and Booker Middle Visual and Performing Arts Circus Magnet program. Karen coaches clowns for the Sailor Circus Academy. Rikki Hettig-Rolfe Meaux Rikki Hettig-Rolfe Meaux is an educator and second generation professional circus artist from Sarasota, Florida. After spending her youth passionately training and performing with the Sailor Circus Academy, Rikki continued to learn and grow as a performer, through training and, in her opinion, one of the best ways, teaching. Rikki is a certified teacher in Florida and also has Montessori training and experience. She graduated from the University of South Florida and worked as an elementary school classroom teacher, reading specialist, and substitute for several years while also working as an aerial coach with the Sailor Circus Academy. Rikki continues to perform professionally and is so happy and proud to have a career combining her love of circus with her love for education and children! Members: Manatee Arts Education Council Sarasota County Arts Education Partnership Awarded the 2016 Arts Leadership Award: Arts in Education by the Arts and Culture Alliance Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/performances/shows/sailor-performance/",
      "text": "Sailor Circus The Greatest Little Show On Earth! - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu THE GREATEST “LITTLE” SHOW ON EARTH CELEBRATES 75 YEARS From its humble beginnings as a Sarasota High School gymnastics program, The Sailor Circus has grown into a premiere circus arts training program and the longest running youth circus in the world! To purchase tickets for our shows, click here . To learn more about having your child join the Sailor Circus, click here . To join our VIP mailing list and receive current Sailor Circus news and advance ticket privileges, click here . To usher , click here . Our youngest students share their skills in a thrilling, action-packed showcase of their newfound love of the circus arts. Coming April 2025 Tickets on Sale October 2025 Acrobats, clowns and a copious cast of colorful characters will dazzle in The Greatest Little Show on Earth: Origins. Comming May 2025 Tickets on Sale October 2025 SPREAD THE WORD! Share on Facebook Share on X Share on Pinterest Share by Mail Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/programs/circus-spring-break-camp/",
      "text": "Circus Spring Break Camp - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Circus Spring Break Camp A Fun & Unique Experience for Campers 6 – 15! Circus Spring Break Camp* A Fun & Unique Experience for Campers 6 – 15! Circus Spring Break Camp* A Fun & Unique Experience for Campers 6 – 15! Circus Spring Break Camp* A Fun & Unique Experience for Campers 6 – 15! Previous Previous Previous Next Next Next 1 2 3 4 Spring Break Camp March 17 – 21, 2025 Ages *6-15 Years Old JOIN US for the most unique Circus Spring Break Camp in our area, where youth campers can learn various circus arts disciplines. Campers will increase their coordination through acrobatics, test their balance on the low wire, and build their courage on the flying trapeze— all while having the time of their lives! At Circus Camp, participants will explore a variety of circus arts, including triple and single trapeze, globes, silks, Rolla Bolla, hula hoop, low wire, clowning, flying trapeze, juggling, and much more! Campers will enjoy a truly extraordinary experience. *Age requirement: Spring Break Camp is for those 6 year-olds that are CURRENTLY enrolled in or have COMPLETED kindergarten. Registration for 2025 is now  closed Spring Break Camp Information Guide Registration Form / Late Fees Registration Form (see below regarding late fees) The registration form can be found in the purchase receipt that was sent to your email address that is in your Mind Body account. A purchase receipt will be emailed to you after enrolling a child and paying the tuition. Please note that we do not accept registration forms that have been printed and filled out by hand. All registration forms must be completed digitally.. Registration Confirmation: After completing the form, you will receive an email containing a copy of your responses. This serves as your confirmation that the CAC has received your form. If you have received a confirmation email from Google Forms, kindly refrain from emailing the registrar inquiring whether the form has been received. Due to the large number of campers and high interest in camp, your email might not receive a response. Late Fees: You must complete and submit the Google Registration form immediately upon sign-up. If forms are not submitted at the time of purchase/enrollment, a $35 late fee per form will be applied and Group requests will not be considered. *Please note that only campers who are officially enrolled and registered for a specific session are allowed to attend that camp session. It is not allowed to switch or trade campers, nor attend a session a camper is not enrolled in. The camp staff requires all necessary documents and adequate time to prepare for the camp session before its commencement. Therefore, we cannot accept walk-ins, one-day drop-ins, or campers coming in place of another. Children who do not meet these requirements will not be able to attend camp. Before Care / After Care Before Care – Is not offered for Spring Break Camp Aftercare services are exclusively provided to campers enrolled in the program and unavailable to anyone not registered in the session. AFTERCARE Aftercare hours are 3:00 – 5:30PM Snack included 35 minutes of circus programming, movie time-schedule available upon request. Single-day rates for aftercare are $35 per day. Subject to availability. Campers not picked up by 5:30PM will incur a $5 dollar charge, per camper, for every one (1) minute past 5:30. While we understand that things can happen that are out of our control, it’s imperative that you have a reliable backup during those times, as late pick-ups will not be tolerated. Visitors To ensure the safety of all campers and staff, the CAC has implemented a policy that prohibits parents, guardians, and visitors from entering the arena during camp hours. Additionally, the doors and gates of the campus and arena will be securely locked from 9:30 AM to 2:30 PM every day. This measure is necessary to ensure the safety and protection of all individuals attending camp and will be enforced without exception. Once the camp begins, all parents or guardians are required to leave the campus. To contact the camp staff, use Remind. Review the Remind tab. Or call 941-355-9335 ex 300. Group Placements / Requests Group Requests We understand that you may prefer to be placed in a particular group, but we cannot guarantee that we can fulfill every request. Our team will do their best to accommodate your preferences, but please remember that it may not always be feasible. We strive to group campers with their friends, but our process may not always permit it. If your child is not assigned to their friend’s group, we apologize, but we cannot honor requests to switch groups due to the high number of campers we have each week; it would be impossible to make changes for everyone. Good to know: Throughout the day, all campers convene in the arena, a spacious open area. This means that your camper will still be near their friends even if your requests cannot be fulfilled. Campers are divided into two (2) groups: a home group and an act group. They will spend time in both groups during the day. ​ Home Group: Our camp organizes campers into home groups according to their age. Each group is led by one counselor and two to three junior counselors. We assign campers to their home group (by age) before camp begins, and they cannot be rearranged for any reason. ​ Showcase Act Group: Campers will be placed in an act group that matches their interests and abilities. The groups will include individuals of all ages and will be led by a counselor. This counselor may or may not be the same counselor as the camper’s home group counselor. The act group assignments will be given to campers at the end of the first day. *Requests to move to another group can not be granted. **Refund requests due to camper group placements will not be granted. ​ How To Register for Camp Click the link below to learn how to register for camp – HOW TO REGISTER FOR CAMP Location / Drop Off / Pick Up Location/Parking: 2075 Bahia Vista Street, Sarasota, FL 34239. The arena is located on the north side of Bahia Vista St. (Building with a blue and white metal roof). Enter and park in the Sarasota High School parking lot adjacent to the east side of the building. Drop Off/Pick Up: Parents / guardians, park and walk campers through the main doors located near the corner of the Sarasta High School parking lot and Bahia Vista Street. Doors are facing Bahia Vista Street. Students should not be dropped off or picked up in the staff parking lot, which is the small gated lot located on the west side of the arena. Wait outside the doors. Check in begins at 8;55am when staff opens the doors. Walk your child inside for check-in. Once camp begins parents/guardians will be required to leave the campus; we do not allow spectators or visitors during camp hours. For the safety and security of campers and staff the arena doors will remain locked from 9:30 – 2:30. For pick up, wait outside the same doors and a staff member will open the doors when check out begins. Late drop off / Early Pick Up – Use Remind to alert staff and they will bring your child to the main doors. Hours: R egular camp hours are 9am-3pm. (Drop off begins at 8:55am) After care hours are 3:10pm-5:30pm Dress Code / Meals & Snacks LUNCH & SNACKS Water Bottle: Campers need to bring a refillable water bottle with their name on it. Lunch and snacks: The CAC does not have refrigerators or microwaves for campers. Pack a ready to eat, non refrigerated lunch and two snacks each day. Campers will have three breaks daily, two for snacks and one for lunch. The CAC does not provide snacks or lunches. CAMP ATTIRE Shoes required, any type. Long hair: All campers must wear a hair tie or have their hair up if it’s long. (For both safety and performances.) No pajamas, cargo shorts, or jeans. Recommended Items: L eotards Biketards Leggings Shorts Tee shirts Gym shorts Sliders, or Leggings for all aerialists Campers should wear clothing that is easy to move in and appropriate for being upside down. SHOWCASE Tights: On the last day of the camp session, girl campers are required to wear skin-colored tights, either footed or footless, for the showcase. (not included in tuition) Tights may be purchased at Walmart, Target, Amazon, etc. Any brand No patterns allowed The color of the camper’s skin should be matched. Footed, footless, or convertible (google it) For campers attending multiple sessions, it is recommended that you purchase convertible tights. Footed tights may need to be cut by our staff depending on the act Please be advised that showcase items (tights, etc) must be dropped off on Friday morning of the showcase, along with the camper. It is imperative to understand that parents will not be granted access to the campus during the day for the purpose of dropping off items. PERSONAL ITEMS NO jewelry, watches, or other valuables are allowed at camp NO Electronics such as cell phones, laptops, mini computers, iPods, MP3 players, e-readers, money or checks, and portable game consoles. The CAC does not have secure lockers for personal storage. The CAC is not responsible for any lost, stolen, or damaged items brought to camp. HEALTH AND SAFETY Personal hygiene is very important for our health and safety. Body-to-body contact inevitably leads to the spreading of germs, so keep your child’s body clean. All cuts or open wounds must be covered with a bandage. Campers may not share clothes, hair ties, combs, or hair brushes. Campers may not share drinking containers. Campers must wash their hands often and use the hand sanitizers located throughout the facility. We do our best to keep the facility and equipment clean with regular sanitary maintenance. We ask our campers follow to do the same. Showcase Showcase : The Friday showcase is a private event exclusively for camper families and is not open to the public. Girls: Day of the showcase, girls are required to have tights matching their skin tone, No patterns. Can be purchased at Walmart, Target, Amazon, etc. Tights should be brought to camp on Friday morning at drop-off. Dress rehearsal will be in the morning. If the camper does not have their tights the parents CAN NOT drop them off later in the day. Boys: Camp staff will notify you if you need to bring anything on Friday. Bring any necessary items on Friday at drop off. Costumes: All costumes and costume pieces are the property of The CAC and may not be taken off campus. Includes all hair pieces, hats, and accessories. Doors open at 3:15, performance starts at 3:30, and lasts 45-60 Minutes. All campers are dismissed once they have changed out of their costumes.  (No aftercare on Friday) Refunds REFUNDS: Until 14 days before Spring Break Camp starts, refunds can be requested with a $75 admin fee deduction. There will be no refunds if the camp session is purchased within 14 days of the start of camp. There are no refunds for campers dismissed from the program due to disciplinary reasons, for campers found with evidence of lice (see our lice/nit policy), for campers who choose to withdraw early from a program already in session or for campers who choose to withdraw before the start of their scheduled session. Camper can not attend due to COVID: camper or family member has COVID no refunds will be given. If space is available in a Summer camp session the camper may be moved to a session with open spots. Cancellation requests must be emailed to Tonia Bichler at Tonia@circusarts.org No refunds will be given for: Purchases made within 14 days of the start of camp. Campers dismissed from the program due to disciplinary reasons Campers found with evidence of lice (see our lice/nit policy) Campers who choose to withdraw early from a program already in session Campers who choose to withdraw before the start of their scheduled session. Campers sick with a flu or virus. Camper can not attend due to COVID Camper or family member has COVID Camper or family member has COVID-If space is available in another session the camper may be moved to a session with open spots (one time). Camper or family member has COVID-If all remaining sessions are full or the camper can not attend another / open session for any reason, no refunds will be given. MEDICAL REFUNDS : If a camper leaves due to an injury incurred at camp , a prorated portion of the tuition may be refunded. If a camper is injured prior to attending a scheduled session or is injured during the session outside of camp and it prohibits them from participating, we will consider a refund upon review of the doctor’s note.  A doctor’s note must be received prior to the start of the camp session in order to be considered for a refund. Any tuition refunded will incur a $50 admin fee . Camp reserves the right to make exceptions to this rule without setting precedent. Camper can not attend due to COVID(camper or family member)  or any other illness,  no refunds will be given. If space is available in another session the camper may be moved to a session with open spots. If all remaining session are full or camper can not attend another session for any reason, no refunds will be given. Scholarships Need-Based Scholarships Scholarships may be available to local campers whose families meet the financial need criteria. To apply for a need-based scholarship, please click here . Applications are open through February 7, 5:00 Pm. Applications will accepted till February 2 or until allotted scholarship funds are disbursed. Policies and Procedures CAMP ENROLLMENT Is secure once payment in full is collected, and all forms are completed and returned to the Circus Arts Conservatory REGISTRATION FEE No Registration Fees: Failure to complete the registration form at the time of purchase will result in a $25 late fee per form. CAMP HOURS Camp hours are 9 a.m. to 3 p.m. Campers should arrive at 8:55 am and must be picked up by 3:10 pm BEFORE CARE Not offered for Spring Break camp. AFTERCARE Aftercare is only available to campers enrolled in the session. Aftercare hours are 3:15 – 5:30PM Monday – Thursday You can enroll for the entire week or opt for single-day rates. However, please note that single-days are subject to availability. Campers not enrolled in After Care : Campers not picked up by 3:10 pm will automatically be charged the drop-in fee of $35 per camper. Campers enrolled in After Care / Late pick up: Campers not picked up by 5:30 PM will incur a $5 charge per camper for every one (1) minute past 5:30. While we understand that things can happen that are out of our control, it’s imperative that you have a reliable backup during those times, as late pick-ups will not be tolerated. ENROLLMENT Campers are enrolled on a first-come, first served basis as per the date of receipt of the registration application in Mindbody and the Google R egistration Form. Confirmation of enrollment and receipt will be sent via email through MindBody. WAITING LIST You may enroll on the waitlist through MindBody when a camp session fills.  Applicants will be notified if space becomes available by email/phone. Tuition fees are not processed until applicants are placed in a session. If a spot becomes available, you will be notified via email and have 24 hours to reply. After 24 hours, the spot will be given to the next camper on the waitlist. REFUNDS Refunds may be requested up to 10 days before the start of the camp session, and a $75 admin fee will be deducted. After ten days, there will not be any refunds. Cancellation requests must be emailed to Tonia Bichler at Tonia@circusarts.org . There are no refunds for campers dismissed from the program due to disciplinary reasons, or for campers found with evidence of lice (see our lice/nit policy), or for campers who choose to withdraw early from a program already in session. Refunds will not be given or days prorated due to inclement weather or any other reason the CAC would need to close the campus. Refunds will not be given due to camper groups. If a camp group request can not be accommodated, no refund will be given if the camper chooses to withdraw from the session. MEDICAL REFUNDS If a camper leaves due to an injury incurred at camp, a prorated portion of the tuition may be refunded. If a camper is injured before attending a scheduled session and it prohibits them from participating, we will consider a refund upon reviewing the doctor’s note.  A doctor’s note must be received prior to the start of the camp session in order to be considered for a refund. Any tuition refunded will incur a $50 admin fee . Camp reserves the right to make exceptions to this rule without setting a precedent. COVID 19: campers unable to attend to due to Covid 19 will not receive a refund. RELEASE Parents/Guardians are required to sign a general release and waiver of liability and indemnity agreement before the camper is placed in a session. In addition to a release, proof of insurance is required for all campers. CAMP POLICIES PARKING/ DROP OFF /PICK UP Parking is in the Sarasota High School Parking lot ONLY. Park and walk your child to the main doors by the Circus Entrance Banner located in the Sarasota High School Parking lot. Pick-up will be at the same doors students are dropped off. VISITORS Circus camp is a closed space, and we do not allow parents or guests to spectate during camp.  Parents, guardians, and visitors are not allowed to stay during camp sessions. SNACKS Campers need to bring two snacks per day. Bring a water bottle to refill during the day. We do not allow soda, gum or candy. LUNCH Campers must bring their lunch. Microwaves are not available for campers to heat their lunches. Please note that refrigerators are not available for campers. Kindly pack your lunches accordingly. ATTIRE Campers should wear clothing that is easy to move in and appropriate for being upside down. Circus girls should wear leotards or one-piece bathing suits with leggings or shorts to go over leotards, hair ties (hair must be up if long), and shoes. Circus boys should wear tee shirts, gym shorts, briefs (no boxer shorts), sliders or leggings for aerialists, and shoes. Girl campers must wear tights matching their skin tone on Friday MORNING. PERSONAL ITEMS The CAC does not have secure lockers for personal storage. The CAC is not responsible for any lost, stolen, or damaged items brought to camp. Items to leave at home: Jewelry, watches, or other valuables are not allowed at camp Electronics such as cell phones, laptops, mini computers, iPods, MP3 players, e-readers, and portable game consoles. Money, checks, or debit/credit cards. Leave valuables at home HEALTH AND SAFETY Personal hygiene is essential for our health and safety. Body-to-body contact inevitably leads to the spreading of germs, so keep your child’s body clean. All cuts or open wounds must be covered with a bandage. Campers may not share clothes, hair ties, combs, or brushes. Campers may not share drinking containers. Campers must wash their hands often and use the hand sanitizers located throughout the facility. We do our best to keep the facility and equipment clean with regular sanitary maintenance. We ask our campers to do the same. CODE OF CONDUCT All campers will adhere to the full values contract below. Full Values Contract is a verbal agreement within a group to try, support, and encourage everyone to achieve their personal best. The F.V.C. is used to secure the bonds of teamwork, perseverance, and dedication in a learning environment. We will ask the campers to abide by the following philosophy: “I will try everything and be respectful to my instructors; I will try everything and support and encourage myself and my friends; I will model this behavior all the time because I am a leader by example”. Parents, please discuss examples of good behavior with your children to aid in the cohesion and flow of camp functions. The consequence for not adhering to this policy is removal from camp activities, removal from the showcase or dismissal from camp. Bullying will not be tolerated under any circumstances. SHOWCASE DETAILS A private showcase for campers’ families will be held on Friday at 3:30 PM. Doors open at 3:15 PM. All costumes and costume pieces are the property of the CAC and may not be taken off campus. Campers are dismissed immediately after the showcase and changing out of their costume. No tickets are required. Conditions of Registration Enrollment Campers are enrolled on a first-come, first-serve basis as per the date of receipt of the registration form and fees Confirmation of enrollment and receipt will be sent via email through MindBody Waiting List When a session is full, you will have the option to enroll on a waiting list. Family is notified via email / phone when space becomes available Refunds Please see our Policies and Procedures Tab Medical Refund Policy Please see our Policies and Procedures Tab Release Parents/Guardians are required to sign a “General Release” and a “Waiver of Liability and Indemnity Agreement” prior to a Circus Summer Camper being admitted Proof of insurance is required for all Circus Summer Campers COVID 19 See Website Home Page Prerequisites For Spring Break Camp, campers must meet BOTH prerequisites: be enrolled in or have completed kindergarten and be at least 6 years old. Please note that only campers who are officially enrolled and registered for a specific session can attend that camp session. It is not allowed to switch or trade campers, nor attend a session a camper is not enrolled in. The camp staff requires all necessary documents and adequate time to prepare for the camp session before its commencement. Therefore, we cannot accept walk-ins, one-day drop-ins, or campers coming instead of another. Children who do not meet these requirements cannot attend camp. Follow the steps outlined below to complete your registration process. Adventure awaits with just a few clicks! 1 ~ Please review the Spring Break Program Guide by clicking the TAB section on this page. 2 ~ Click the “Register Now” button, enabled during open enrollment. Enroll your child(ren) and complete payment through Mind Body. ~If enrolling more than one camper, enroll all of them in Mind Body to ensure that a spot is held for each camper. 3 ~ Complete the Spring Break Camp Registration Form in your purchase receipt or confirmation email. ~Submit this form during enrollment to avoid a $35 late fee per child. ~Once you have completed this step, your registration is finished. HOW TO REGISTER GUIDE Camp registration is NOT COMPLETE until the Google registration form (link sent in your receipt email) is filled out for all children. For more information, contact us at Register@circusarts.org or Tonia@circusarts.org. Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/blog/category/sailor-circus/",
      "text": "Sailor Circus Archives - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Circus Summer Camp , Programs Circus Camps Read more February 20, 2023 / by circusarts https://i0.wp.com/circusarts.org/wp-content/uploads/2016/12/CRP_7435-scaled.jpg?fit=2560%2C1704&ssl=1 1704 2560 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2023-02-20 06:35:42 2024-12-04 18:38:10 Circus Camps Sailor Circus Protected: Parent Resources – Junior Sailor Circus Program There is no excerpt because this is a protected post. Read more January 6, 2021 / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2021-01-06 14:30:15 2023-12-10 10:55:04 Protected: Parent Resources – Junior Sailor Circus Program Sailor Circus Protected: Parent Resources – Sailor Circus Academy There is no excerpt because this is a protected post. Read more January 6, 2021 / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2021-01-06 14:08:24 2021-09-03 14:10:32 Protected: Parent Resources – Sailor Circus Academy Blog , Circus Summer Camp , Press Release , Programs Area children invited to ‘step right up’ for Circus Summer Camp While the arena at the Circus Arts Conservatory site on Bahia Vista Street may be under construction, the show must – and will – go on for children seeking a more adventurous summer camp experience. From June through August, the Circus Arts Conservatory (CAC) will offer its popular Circus Summer Camp at the East Gymnasium at Sarasota High School. Read more August 28, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-08-28 10:42:08 2018-08-28 10:42:08 Area children invited to ‘step right up’ for Circus Summer Camp Blog , Press Release , Sailor Circus Don’t Miss Your Opportunity to See Sailor Circus this Spring! Sailor Circus Academy students will shine under the spotlight as they present the 69th annual spring performance of “The Greatest ‘Little’ Show on Earth” – for one day only under the Big Top in Nathan Benderson Park behind the Mall at UTC. This is the first time Sailor Circus students have performed under the Big Top in Sarasota. In past years, the show has taken place in the iconic Sailor Circus Arena which is currently closed for upcoming renovations. Read more August 28, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-08-28 10:40:33 2018-08-28 10:40:33 Don’t Miss Your Opportunity to See Sailor Circus this Spring! Circus Arts , In The Press , Programs , Sailor Circus Circus Fitness For All By BRITTANY MATTIE, SRQ DAILY SARASOTA – Jovially juggling its resources and forward-flipping into an exciting renovation, The Circus Arts Conservatory progresses steadfast in a project to expand programming in the community and revamp its one-of-a-kind Sailor Circus Arena. More August 23, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-08-23 14:18:29 2018-08-23 14:18:29 Circus Fitness For All Circus Summer Camp , Programs Youth Flying Trapeze Workshops Read more May 22, 2018 / by circusarts https://i0.wp.com/circusarts.org/wp-content/uploads/2018/05/2017_Flying_Trapeze_Stay_Creative_Photography-20170903_185828-scaled.jpg?fit=2560%2C1549&ssl=1 1549 2560 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-05-22 16:36:37 2021-07-15 11:23:38 Youth Flying Trapeze Workshops Circus Arts Conservatory , circus sarasota , Sailor Circus Ribbon Cutting at Sailor Circus for Junior League Improvements BY SRQ DAILY MONDAY BUSINESS EDITION SARASOTA — The Junior League of Sarasota held a ribbon-cutting ceremony at Sailor Circus Sarasota this past weekend to commemorate the completion of recent improvements. The League’s New Member Class of 2017-18 has dedicated its time and resources to breathe new life into the grounds of Sarasota’s beloved Sailor Circus, a pillar in the local arts community that provides after-school circus training to students ages 8 to 18. More . May 15, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-05-15 10:52:08 2018-05-15 10:52:08 Ribbon Cutting at Sailor Circus for Junior League Improvements Circus Arts Conservatory , circus sarasota , Sailor Circus Sailor Circus presents The Greatest ‘Little’ Show on Earth By Wade Tatangelo, Entertainment Editor SARASOTA — Sailor Circus returns to the Big Top for two performances Saturday of “The Greatest ‘Little’ Show on Earth.” The family-friendly production features awesomely-talented local students ages 8 to 18 displaying their skills with acts such as Acrobatic Adagio, Teeterboard, Lyra, Trampoline, Swinging Cradle, Juggling, Roller Skating, Aerial Silks, Web, Slack Line and more. More . May 15, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-05-15 10:32:32 2018-05-15 10:42:42 Sailor Circus presents The Greatest ‘Little’ Show on Earth Circus Arts Conservatory , circus sarasota , Sailor Circus One day only Sailor Circus shows set for Saturday By Scott Dennis, WWSB SARASOTA — Sailor Circus Academy students will shine under the spotlight as they present the 69th annual spring performance of “The Greatest ‘Little’ Show on Earth” – for one day only under the Big Top in Nathan Benderson Park behind the Mall at UTC. This is the first time Sailor Circus students have performed under the Big Top in Sarasota. More . May 15, 2018 / 0 Comments / by circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg 0 0 circusarts https://circusarts.org/wp-content/uploads/2020/08/CAC-logo-HORIZ-COLOR_no-srq_TM-for-website.jpg circusarts 2018-05-15 10:30:41 2018-05-15 10:42:49 One day only Sailor Circus shows set for Saturday Page 1 of 4 1 2 3 4 Media Blog In The Press Press Releases Media Images Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/about-us/our-board/",
      "text": "Our Board - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Board Of Directors The CAC Board is comprised of volunteers with diverse areas of expertise and passions, including marketing, education, fundraising, entrepreneurship, legal, and philanthropy. Their range of knowledge and experience is crucial in continuing to lead the CAC in it’s mission to preserve and expand the legacy of the Circus Arts. Julie Harris Chair The Circus Arts Conservatory | Sarasota Ken Woodworth Vice Chair The Circus Arts Conservatory | Sarasota Ray Pilon Treasurer The Circus Arts Conservatory | Sarasota Deborah Walk Secretary The Circus Arts Conservatory | Sarasota Shari Ashman Immediate Past Chair The Circus Arts Conservatory | Sarasota Michael Belle The Circus Arts Conservatory | Sarasota Jenne Britell The Circus Arts Conservatory | Sarasota Jack Brown The Circus Arts Conservatory | Sarasota Cherie Gorenstein The Circus Arts Conservatory | Sarasota Dolly Jacobs Founder/ NEA Fellow/ Vice President The Circus Arts Conservatory | Sarasota Richard Johnson The Circus Arts Conservatory | Sarasota Karen MacDonald-Basile The Circus Arts Conservatory | Sarasota Pedro Reis Founder / Production & Artistry Strategist The Circus Arts Conservatory | Sarasota Barb Tye The Circus Arts Conservatory | Sarasota Beth Waskom The Circus Arts Conservatory | Sarasota BOARD EMERITUS Rita & Syd Adler (decd)| Jack Brown | Andy Carlson | Don Malawsky | James Moore | Senator Bob Johnson (decd) | Bart Lowther | Ray Pilon | Mary Ann Robinson | Jan Silberstein (decd)| Albert Van Tieghem Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circesteem.org/",
      "text": "Home » CircEsteem Programs Homework Circus Work Chicago Youth Circus Performance Troupe Circus Summer Camp Financial Aid Events Bookings Parties at CircEsteem Performances Workshops About Our Mission Staff & Board of Directors Careers & Volunteering Annual Report Contact Support Our Youth Donate Gala Donors & Partners Programs Homework Circus Work Chicago Youth Circus Performance Troupe Circus Summer Camp Financial Aid Events Bookings Parties at CircEsteem Performances Workshops About Our Mission Staff & Board of Directors Careers & Volunteering Annual Report Contact Support Our Youth Donate Gala Donors & Partners Purchase Your 2025 Gala Tickets Today! CircEsteem CircEsteem, established in 2001, is a non-profit organization dedicated to fostering social change through the innovative approach of social circus. By using the dynamic and engaging medium of circus arts, CircEsteem empowers Chicago's youth to build self-esteem, develop valuable life skills, in safe and inclusive environments. Our programs offer a unique blend of physical activity and creative expression, helping young people to grow in confidence, collaboration, and perseverance. CircEsteem strives to make circus available to all students regardless of financial means. To serve this mission, we offer financial aid to eligible participants. Fall Registration Now Open! Featured Programs View All Programs HomeWork & CircusWork Located in a number of CPS schools across Chicago and our Uptown Headquarters, HomeWork & CircusWork (HWCW) is a free after school program for youth. Sign Up Learn More Chicago Youth Circus Chicago Youth Circus (CYC) is a vibrant Saturday program held in two locations, dedicated to developing circus skills and providing performance opportunities for youth. Our program includes a variety of circus disciplines such as juggling, unicycle, gym wheel, trapeze, silks, lyra, clowning, and many other circus skills. Sign Up Learn More Performance Troupe CircEsteem’s Performance Troupe is designed for experienced youth seeking to advance their skills to the next level and participate in performance opportunities through CircEsteem. Sign Up Learn More Join CircEsteem’s 24th Annual Gala Celebration Friday, September 26, 2025 | Venue West, Chicago Cocktail Attire | Doors Open at 6:00 PM Prepare to be swept away on an interstellar journey of joy, artistry, and community impact at Celestial Circus: Join the Joyful Revolution, CircEsteem’s 2025 Annual Gala. Held at the stunning Venue West, this year’s dinner-theatre style celebration will be an immersive evening featuring international artists, youth performers, interactive games, and dazzling circus spectacle, all in support of empowering Chicago youth through the transformative power of circus. This is more than a gala—it’s a joyful revolution. One night. Limitless impact. Learn more & purchase tickets! Serving Chicago Smiles Since 2001 “To see the look in a kid’s eyes when they first juggle or spin a plate, it’s like a light goes off. It’s just so magical to see” Sam Brown, Teaching Artist We Bring The Fun To You Parties & Workshops Hire CircEsteem for your next birthday, bar/bat mitzvah, parade, corporate or professional sporting event. We provide strolling performers, interactive circus workshops, and fully produced circus shows. Book Now Learn More Marquee Get Involved Get Involved Get Involved Get Involved Get Involved Get Involved Get Involved Donate CircEsteem relies on the generosity of its donors and partners. Learn More Volunteer Opportunities include, but are not limited to: Tutoring and Performance Support. Learn More Careers Make the circle bigger. From acrobatics to accounting, we appreciate your help! Learn More Subscribe to Stay Updated! Email Address * First Name Last Name * = required field CircEsteem Mailing Lists General Interest Registration Updates info@circesteem.org (773) 732-4564 4730 N. Sheridan Rd. Chicago, IL 60640 Quick Links Home Parties Events About Contact COVID Policy Follow Along Privacy Policy Terms of Service Accessibility © 2025 CircEsteem | ProPhoto Photo Blog"
    },
    {
      "url": "https://circusarts.org/programs/sailor-circus-academy-home-2/",
      "text": "Sailor Circus Academy Home - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Programs 2 / Sailor Circus Academy Home Previous Previous Previous Next Next Next 1 2 3 4 5 Sailor Circus Academy Circus arts training program for students in Sarasota & Manatee counties From humble beginnings as a high school gymnastics class in 1949, the Sailor Circus Academy has grown into one of the top circus training programs in the USA. Known worldwide as The Greatest ‘Little’ Show on Earth , the Sailor Circus is America’s longest-running youth circus, having been seen by more than 1 million thrilled spectators! The Academy provides a rigorous after-school program where students learn life management skills, self-discipline, confidence and a commitment to achievement; all in a safe and nurturing circus atmosphere. Sailor Circus Academy students are recognized as future leaders and major contributors to the legacy of Circus in Sarasota. Sailor Circus Academy Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/about-us/",
      "text": "About Us - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Performance. Training. Education. Legacy. Our Mission The Circus Arts Conservatory’s mission is to engage and educate students using unique and innovative learning programs; to measurably improve the quality of life for individuals in care communities; and to advance the extraordinary legacy and heritage of the circus. The Circus Arts Conservatory’s extraordinary mission underscores its commitment to sharing the entertainment, education, and enrichment that Circus Arts provide. Our History and Legacy Play Play In 1927, the world-renowned circus impresario, John Ringling - along with his brother Charles Ringling - moved the Ringling Brothers Circus winter quarters from Bridgeport, Connecticut to Sarasota, Florida Play Play This move brought with it hundreds of circus performers, support staff, and a whole new national spotlight on Sarasota, Florida - forever impacting and growing the social and economic life of Sarasota in ways we still see today Play Play Part of John and Charles Ringling’s creative impact included the construction of the John and Mable Ringling Museum of Art, Ca d’Zan, the Charles Ringling Mansion, The Sarasota Terrace Hotel (Sarasota County Administrator Building), and more Play Play Sarasota pays homage to the Ringling’s and Sarasota’s circus history through dedications of streets, bridges, buildings, parks, plaques, and more Play Play Entrenched in Sarasota since the 1920s, generations of international circus performers are proud to call Sarasota their home The Circus Arts Conservatory’s History Play Play On September 30, 1997, The Circus Arts Conservatory, Inc. was incorporated as The National Circus School of Performing Arts, a not-for-profit organization under the laws of the State of Florida Play Play The Organization’s name was later changed to Circus Sarasota, Inc. and then to The Circus Arts Conservatory in 2013, as a result of growth Play Play Sarasota’s residents are proud and supportive of The Circus Arts Conservatory for being committed to preserving Sarasota’s extraordinary heritage of circus arts through dedication to perform, train, educate, and to engage the community in their mission Play Play The Circus Arts Conservatory’s Circus Sarasota presents annual world-class performances in the one-ring, five-star, European-style Ulla Searing Big Top, and are acclaimed around the globe for artistry and entertainment in addition to preserving Sarasota’s unique circus legacy Play Play The Circus Arts Conservatory provides year-round outreach programs in the community: approximately 80% of ticket revenue supports our community outreach programs serving children through the Education Program, the elderly and those in care facilities through the Humor Therapy Program and the Sailor Circus Academy. Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://www.necenterforcircusarts.org/",
      "text": "New England Center for Circus Arts - Circus Fitness and Pro Training in Vermont! - New England Center for Circus Arts Skip to content Link to Facebook Link to Instagram Calendar Class Registration Shop Donate Today Programs Adult Programs Adult Session Classes Workshops Private Lessons ProTrack Program Create Your Own Training Visit NECCA Youth Programs Youth Session Classes Youth Open Gym Youth Troupes Youth Camps Private Lessons ProTrack Program Circus Intensives Fall Intensive Programs Winter Intensive Programs Winter Circus Skills Retreat Spring Intensive Program Summer Circus Skills Retreat Summer Intensive Program Performance Boot Camp Open Training Flying Trapeze Fly Team Program Class Policies Financial Aid Calendar Events Performances & Events Vermont Circus Festival Parties & Experiences About Who We Are Coaching Staff Admin Team Board of Directors Founders Mission, Values, Vision History News & Press Graduates Outreach Employment Support Donate 2025 Call for Support Become a Sponsor Financial Aid Volunteer Shop Contact Visit NECCA Menu Menu Now Open! Fall SEssion Class Registration Our Fall Session classes are now open for registration. Choose from two sessions this fall: Session 1 runs from Sept. 2 – Oct. 12 (6 weeks). Session 2 runs from Oct. 14 – Dec. 13 (8 weeks). View classes and register here Register today! Vermont Circus Festival Workshops! Advance registration for the Vermont circus festival is now open. Snag an Advance Pass and get a bunch of perks. Including workshop and performance discounts! Learn more and view the schedule here! Experience something new! SilverCircus Want to learn more and sign up for our SilverCircus classes for ages 60 and up? Check out all the info here! Class Sessions Drop-In Classes Get your fitness on! Circus Fitness Passes This membership pass gets you into 12 of NECCA’s beginner drop-in classes, as well as all NECCA’s open training opportunities for FREE, and also includes discounts on performances and access to other special events. Learn more about the Circus Fitness Pass here! Register Today Workshops & Immersions Whether you can come for a day or a few weeks, we have something perfect for you! See all of our workshops Pop In Drop-In Classes! Not ready for an entire session of classes? Select session classes now offer drop-in spots. See you in class! See All of Our Drop-In Classes Previous Previous Previous Next Next Next 1 2 3 4 5 6 Welcome to the NEW ENGLAND CENTER FOR CIRCUS ARTS NECCA is the premiere, nonprofit circus training school in the US. We offer a world class professional program for aspiring performers, along with workshops and recreational classes for youth and adult students of all ages, levels, and abilities. Our Mission Provide high-quality circus arts training for students and artists while facilitating greater access and programming to everyone What We Offer RECREATIONAL CLASSES ADULT CLASSES Learn More RECREATIONAL CLASSES YOUTH CLASSES Learn More In-Depth Training WORKSHOPS Learn More SHOWS & MORE Performances Learn More PROFESSIONAL TRAINING ProTrack Learn More COMMUNITY BUILDING OUTREACH Learn More SUPPORTING OUR MISSION DONATE TO NECCA NECCA is a nonprofit that’s committed to the people it serves and the community within which it thrives. We rely on our many generous donors to continue to be a place that’s accessible to everyone, where creativity and artistry soar, and where the seemingly impossible becomes possible—every single day. Please consider joining others in supporting our work. Donate Today SUPPORTING OUR MISSION DONATE TO NECCA NECCA is a nonprofit that’s committed to the people it serves and the community within which it thrives. We rely on our many generous donors to continue to be a place that’s accessible to everyone, where creativity and artistry soar, and where the seemingly impossible becomes possible—every single day. Please consider joining others in supporting our work. Donate Today NECCA ONLINE! Follow Us  on Instagram @NECCACircus From first class to the world stage - An Impact St This might be a highlight reel of last year’s Al Prepare yourselves… NECCA’s ProTrack Audition 🎪✨ The net beneath the circus is YOU! ✨🎪 This weekend folks! @thecirqueus is bringing Stori Meet Your Vermont Circus Festival Coaches! ✨🎪 May 2024 COVID POLICIES Read Our Full Policies Here NECCA is mask optional. NECCA reserves the right to change protocols if necessary. We encourage a culture of care for the health of others. If you are experiencing any of the following symptoms (fever, severe sore throat, fatigue, stomach related symptoms), we ask that you please stay home so as to not spread germs. (*If you test positive for COVID-19, see below) You can go back to your normal activities after at least one day (24 hours) if: Your symptoms are getting better overall, and You have not had a fever for at least 24 hours (and are not using fever-reducing medicines) You must wear a mask for five days if you have been ill and are returning to NECCA. Please wear a mask if… Someone you live with is experiencing the symptoms above. You are experiencing mild symptoms such as sneezing, runny nose, or sore throat. A coach asks for masks to be worn in class. Many Thanks To The New England Foundation for the Arts NECCA is supported by the New England Foundation for the Arts through the New England Arts Resilience Fund, part of the United States Regional Arts Resilience Fund, an initiative of the U.S. Regional Arts Organizations and The Andrew W. Mellon Foundation, with major funding from the federal CARES Act from the National Endowment for the Arts. About NEFA Support NECCA Many Thanks To Our Sponsors Please join us in thanking these companies for their support of NECCA. Our Funders Year Round Sponsors Our Mission Provide high-quality circus arts training for students and artists while facilitating greater access and programming to everyone. EIN #: 26-0495118 Classes & Training Adult Session Classes Youth Session Classes Youth Circus Camps Workshops & Immersions Private Lessons ProTrack Program Flying Trapeze Fly Team Program Summer Programs Create Your Own Training Class Policies Financial Aid About NECCA Mission, Values, Vision Our Staff Outreach Employment Our Graduates Contact NECCA 10 Town Crier Dr Brattleboro VT 05301 802-254-9780 info@necenterforcircusarts.org NECCA Comment Box Support NECCA Donate Today Become a Sponsor Volunteer COVID-19 Policies Full Policies Here Copyright © 2025 New England Center for Circus Arts Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/",
      "text": "Recreational Classes - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Programs 2 / Recreational Classes Previous Previous Previous Next Next Next 1 2 3 4 5 Classes, Camps, Workshops Run Away & Join The Circus (At Least For For A Few Hours) Pre-Registration Is Required for all classes Join the latest and most exciting form of physical and mental training – a unique form of exercise and fun taught by professional coaches for people of all ages and physical fitness levels. All recreational classes are held indoors at our air-conditioned Sailor Circus Academy Arena. Please be aware that class credits are not interchangeable and cannot be applied to other classes. Additionally, class times and dates listed on the website may vary due to events at the arena. Please refer to your confirmation email for your reserved class’s specific date and time. To view the current schedule with NEW CLASSES and reserve your spot, click the “Register Here” button below the class listings. Hula Hoop Flying Trapeze Aerial Silks Aerial Lyra Aerial Hammock Aerial Spanish Web Professional Artist Open Gym Trampoline Fitness Youth Circus Sampler Ages 6-15 Aerial Conditioning Ages 13+ Private Classes All Ages & Skills To view the schedule and register Use the new CAC-branded app or Visit the Mindbody site by clicking “Register Here” NEW! The Circus Arts Conservatory App! We now have our own CAC-branded mobile app, making it easier to sign up for recreational classes, camps, and more! Apple App Store Google Play Store Get started using th app: Download the circus arts conservatory app Log in using your current Mind-Body credentials or create an account if you don’t already have one. (If you create a new account, your class history and purchases will not be connected.) Please note that coach availability for recreational and private classes may vary based on the current class schedules. Some classes may only be offered during specific seasons, and certain timeslots may be limited due to other commitments. To sign up for intermediate or advanced classes, you must first take a beginner class and be assessed by the coach. Assessments can only be done during regularly scheduled classes; all classes have age prerequisites. Click on the photos above for additional information about the classes. Class Cancellations: For more information, please refer to the Cancellations tab below. Pre-Registration Is Required For All Classes  ~ Class Information Is Subject To Change At Any Time Without Notice ~ Schedule your purchased classes before they expire Good to know: Clients are requested not to be early or stay late. If the client arrives late, the class will end at the scheduled time in Mind Body. Clients are required to register and make payment online in advance. No staff members are available on-site to accept any form of payment. Due to limited space and equipment, we only have a limited number of spots available. Once the spots are filled, we cannot accept additional clients. Due to events in the arena, the number of available spots may fluctuate and will be reflected in Mind Body. Classes may not always follow a regular schedule. Check mind-body for daily schedules. The class will not be in Mind Body if it is not scheduled. Parking is available in the High School lot adjacent to the arena. The lot to the west of the arena is reserved solely for staff. Questions? Email Register@CircusArts.org . CLASS WAIVER Release of Liability WAIVER (required for all) The Circus Arts Conservatory requires everyone participating in classes or activities to complete our Assumption of Risk/General Liability Waiver. This waiver can be found in your Mind Body account. Only one waiver needs to be submitted per year. The individual taking the class must be the one listed on the roster, rather than a parent or guardian. Please ensure that the forms are completed through your Mind Body account. Parents and guardians dropping off children, please go inside and ensure that the waiver is completed. The class coach will assist you. Students without a waiver will be unable to participate. Only one waiver needs to be submitted per year. RESERVATIONS CHANGE/CANCEL Clients can change or cancel a reservation on their own, provided it’s done within 24 hours of the class start time. See steps below. Change a reservation for yourself. Here are the steps to cancel a reservation in your account: Log into your account Click on “My Info” > “My Schedule” Find the reservation you want to cancel and click “Cancel”(note: cancellations are not allowed within 24 hours of class start time) Click “OK” to confirm the cancellation Change a reservation for a family member in your account. Here are the complete steps: Log in under the family member’s account directly Click on “My Info” > “My Schedule” Find the reservation you want to cancel and click “Cancel” (note: cancellations are not allowed within 24 hours of class start time) Click “OK” to confirm the cancellation Client Cancels: Cancellations or change requests must be made at least 24 hours in advance to retain your class credit . No-shows, cancellations, or change requests made within this timeframe will result in the forfeiture of the credit. CLASS CANCELLATIONS Class Cancellation Policy Any class with fewer than two (2) enrolled students will be canceled at: – Noon on the day of the class (M-F) – Noon on Fridays for Saturday classes Checking Schedule – Clients can check the schedule in Mindbody after 12:30 PM to see if any classes have been canceled. Automatic Notification Process – Enrolled clients will receive an automated email or text notification from Mind Body if : Their profile includes a valid email address and mobile number AND they have opted in for notifications. For children, a valid email address must be included in their profile for cancellation notices AND they have opted in for notifications. – Enabling Text Notifications To enable text notifications, clients must: Go to their profile or their child’s profile. Select the text/email notifications option. Notification Limitation – Only the person enrolled in the class will receive notifications, so it is essential to select notification preferences for all profiles associated with the account. Client Cancels: Cancellations or change requests must be made at least 24 hours in advance to retain your class credit . No-shows, cancellations, or change requests made within this timeframe will result in the forfeiture of the credit. Clients can cancel their class in their Mind Body account as long as it’s at least 24 hours before the class start time. CAC Cancels: If the CAC cancels a class, a class credit will automatically be added to your account for use on another day. MIND BODY ACCOUNT SET UP Bevo our steps to set up a mind-body account that is connected to the circuit arts conservatory. Please keep in mind if you already have a mind-body account and you don’t connect to our business we will not be able to View your account or assist with setting up recreational or private classes. Once an account is created, you can book recreational classes on your own or email Register@circusrtas to book a private lesson. Setting up your mind-body account Recreational Classes Here are the steps to create an account and book a recreational class: Create your account on the business’s website by clicking “sign up now” above: Enter your name Provide an email address Add your Date of Birth Review and sign liability waiver Click “Save” Create login credentials via email verification Log in to your account Add payment card to account Navigate to Appointments to select service, staff, and time Complete booking using saved payment method Private Lessons Here are the steps to create an account and book a private lesson for your child: Create your account on the business’s website by clicking “sign up now” above: Enter child’s name and your relationship Provide an email address Add your Date of Birth Review and sign liability waiver Click “Save” Create login credentials via email verification Log in to your account Add payment card to account Email Register@circusarts.org and let them know you have completed these steps. Setting up an account for a family member: Recreational Classes Here are the steps to create an account and book a recreatinal class for your child: Create child/family member account on the business’s website by clicking “sign up now” above: Enter child’s name and your relationship Provide unique email address Add their Date of Birth Review and sign liability waiver Click “Save” Create login credentials via email verification Log in to child’s account Add payment card to account Navigate to Appointments to select service, staff, and time Complete booking using saved payment method Private Lessons Here are the steps to create an account and book a private lesson for your child: Create child/family member account on the business’s website by clicking “sign up now” above: Enter child’s name and your relationship Provide unique email address Add their date of birth Review and sign liability waiver Click “Save” Create login credentials via email verification Log in to child’s account Add payment card to account Email Register@circusarts.org and let them know you have completed these steps. LINK YOUR MIND BODY ACCOUNT ~LINK your MIND BODY account to the CAC~ This is only required for individuals who already have a Mind Body account. Some clients may already have a Mind Body account for other businesses. To connect your account to the Circus Arts Conservatory account, follow the steps below. Mind Body – How to link accounts to the CAC Sign into https://account.mindbodyonline.com/ with your Mindbody app account information. Select Places You Go on the left side. Click Start Searching . Under the “Find another Mindbody business” section, enter the business name and click Search . Select the correct business, enter the same email address and password you use to log in to the business’s Mindbody site (consumer mode), and click on Sign In . When troubleshooting the Mind Body platform , please use the website on your PC, laptop, or smartphone, as the app may not display all the information. HOW TO REGISTER  / Mind Body Help with Registering Mind Body Platform HOW TO REGISTER To Register: Click the Register Now button on this page. Create a Mind Body account. Add your Date of birth (you won’t be able to sign up for a class without it) Adding a family member to your account? ADD the person taking the class to your account as a family member if you are not taking the class or if multiple people are in your group. Each will need to be added to your profile. Add the birthdate of the person(s) taking the class to their profile and the email address you want class confirmations sent. Already have an account? Ensure the person(s) you are making the reservation for is in your account. If not, add them before making your reservation. Click the Classes tab (in Mind Body) Click the calendar and select the date and class desired. Reserve the class and choose the person to enroll . Enrolling more than one person? Repeat the steps and add each person to the class individually. Do NOT enroll yourself if you are not the person taking the class. Fill out the waiver for each person taking the class. Mind Body will not allow one person to reserve multiple spots in a class. You must add each individual person taking the class to your account and then add them to the class. You will receive a Confirmation email for each person registered for the class IF you add your email address to each PROFILE. Example: When Jane Doe bought 4 silk classes for 4 individuals and only signed up herself for the class, she reserved only one spot for the class. To ensure that the other 3 people can attend the class, Jane needs to add each person to her account and then enroll them in the class. After making your purchase and reservations, please check your email for a confirmation email for each person registered for the class. This email will contain important details including the class name, day and time of the reservation, as well as the name of the person in the class. Please note that if you have reserved spots for multiple people, you will receive a separate email for each individual. Did not receive a Class CONFIRMATION email? An email address is missing from the profile of the class attendee, or a date and time for the class have not been scheduled, and the class credit is on hold, awaiting assignment. Receive a “ does not meet the prerequisites” message when trying to enroll? If you see this message, it means that all classes have specific age restrictions in place and: the client does not meet the age requirements the client has not provided their date of birth parent/guardian is attempting to enroll in a youth-only class, or vice versa ~LINK your MIND BODY account to the CAC~ Some clients may already have a Mind Body account for other businesses. To connect your account to the Circus Arts Conservatory account, follow the steps below. Mind Body – How to link accounts to the CAC Sign into https://account.mindbodyonline.com/ with your Mindbody app account information. Select Places You Go on the left side. Click Start Searching . Under the “Find another Mindbody business” section, enter the business name and click Search . Select the correct business, enter the same email address and password you use to log in to the business’s Mindbody site (consumer mode), and click on Sign In . When troubleshooting the Mind Body platform , please use the website on your PC, laptop, or smartphone, as the app may not display all the information. REFUNDS Refunds Clients can request a refund as long as the class begins more than 24 hours from the time of the request. A $5 administrative fee will be charged for each purchase refunded. CAC cancels a class. Clients can request a full refund via email within 24 hours of the class cancellation. Requests must be made via email to Tonia@circusarts.org CLASS CREDITS / EXPIRE All classes have an expiration date. Each class counts as one (1) credit, and credits will expire. Please remember to schedule your classes before they expire. – Single classes and 5-Packs expire 90 days from the date of purchase. – 10-Packs expire 120 days from the date of purchase. – Gift certificates expire 12 months from the date of purchase. PARKING / SPECTATORS SPECTATORS, We do not allow spectators for recreational classes during the week due to our youth program training. Spectators are only permitted on Saturdays. Anyone attending classes during the week cannot have spectators. PARKING/ENTRANCE Parking/Entrance: All students should be dropped off and picked up on the southeast side of the arena, specifically at the doors with the red awning facing Bahia Vista Street, located next to the high school parking lot. All parking is in the high school lot. During school hours, make sure to use the parking spots designated for the CAC. CLASS REQUIREMENTS Classes are designed to welcome beginners unless they are specifically marked as intermediate, advanced, or invitation-only . For those classes categorized as intermediate, advanced, and invitation only, participants must satisfy certain prerequisites to be eligible for enrollment. To find out more about these requirements, please click on the class image above, where detailed information will be available. If a participant registers for a class that has specific prerequisites and does not meet them—whether related to skill level, age, or other criteria—the instructor reserves the right to deny entry to that class. In such cases, no refunds or credits will be provided. If you are uncertain whether you qualify for an intermediate or advanced class, you are encouraged to enroll in a beginner class. This will allow the instructor to assess your skills and determine your readiness for a higher-level class. Skill-level assessments cannot be arranged outside of regular class sessions, so participating in a beginner class is essential for your progression. All our classes are single, pay as you go. There are no sessions or workshops, so anyone who meets the prerequisites, age and level requirements can join at any time. WHAT TO WEAR Wear comfortable athletic attire for all classes. For aerial classes, students must ensure that their legs are covered. Jewelry is not recommended, and specific requirements may vary at the discretion of the coaches. To check if there are any specific requirements for your class, please click on the corresponding picture. If there are no specific instructions listed, follow the dress code outlined on this page. Class Aerial Conditioning Flying Trapeze Beginner Flying Trapeze Intermediate/Advanced Hammock Hula Hoop Lyra Silks Advanced Silks Beginner Spanish Web Trampoline Fitness Youth Sampler Pricing $35 $55 $65 $30 $30 $30 $35 $30 $30 $30 $25 Spread the Word! Share on Facebook Share on X Share on Pinterest Share by Mail Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/programs/classes-training/sailorcircusgold/",
      "text": "Sailor Circus Gold Troupe - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu You are here: Home 1 / Programs 2 / Recreational Classes 3 / Sailor Circus Gold Troupe Previous Previous Previous Next Next Next 1 2 3 Sailor Circus Academy Gold Troupe Registration for Fall Opens in the Summer Big Dreams. Big News! Ages Age Requirements: To enroll, students must be six (6) years old by September 1st for the Fall school year and have already completed kindergarten. Conditions of Registration Enrollment Registration Form The Google registration form must be submitted at enrollment before any training starts. If the forms are not completed during enrollment, a late fee will be applied. Policies and Procedures ENROLLMENT Is secure once payment in full is collected and all forms are completed and returned to the Circus Arts Conservatory.  Students are enrolled on a first come, first served basis as per the date of receipt of the registration application in Mindbody and the Google R egistration Form. Confirmation of enrollment and receipt will be sent via email through MindBody. REGISTRATION FEE As part of the comprehensive training fee, there is a non-refundable registration fee of $45. REFUNDS Once the training period begins, it is not possible to obtain a refund for any training fees that have already been paid. Please note that we cannot offer refunds for cancelled classes, schedule changes, or if a student decides to withdraw early. Additionally, if a student is dismissed from the Sailor Circus Academy Gold Troupe due to disciplinary reasons or evidence of lice, no refunds will be provided. However, if a student sustains an injury during training that prevents them from completing the season, we may consider providing a pro-rated refund. Please note that credits from recreational classes or summer camps cannot be transferred to Sailor Circus Academy courses, and vice versa. The CAC reserves the right to make exceptions to this rule without setting a precedent. Refunds may be requested up to one day after the Orientation. After this time, no refunds will be given. Refund requests must be made in writing to Tonia@circusarts.org. Please note that the $45 non-refundable registration fee. If classes are canceled for ANY reason, there will not be any make-up days/classes. Due to several programs running simultaneously throughout the year, we can not hold make-up classes. Tuition will not be refunded or prorated due to canceled classes. MEDICAL REFUNDS If a student leaves due to an injury incurred at Sailor Circus Academy, a prorated portion of the tuition may be refunded. If a student is injured prior to attending a scheduled session and it prohibits them from participating, we will consider a refund upon review of the doctor’s note.  A doctor’s note must be received prior to the start of the Sailor Circus Academy Gold Troupe session in order to be considered for a refund. The CAC reserves the right to make exceptions to this rule without setting precedent. Any tuition refunded will incur a $75 admin fee. COVID-19 If a student or family member tests positive for COVID-19 the CAC will not refund the session or any missed or unused days (credits) of the session. Unused days will not be credited to any future programs or recreational classes. WEATHER-RELATED CANCELATIONS Cancellations due to inclement weather will not be prorated or refunded. Due to the nature and scheduling of our programming, any canceled class or training cannot be rescheduled. RELEASE Parents/Guardians are required to sign a general release and waiver of liability and indemnity agreement prior to the student being placed in a session. In addition to a release proof of insurance is required for all participants. PARKING/ DROP OFF /PICK UP All drop off and pick up for students is located at the midway gate adjacent to the Sarasota High School parking lot. Look for our “ Circus Entrance” banner on the fence to direct you. Students should never be dropped off/ picked up in the staff parking lot/ticket sales lot by our main office. Parents/guardians may NOT escort students inside the building. Wait outside the main doors or the student may enter on their own. VISITORS Sailor Circus Academy Gold Troupe training is a closed space and we do not allow parents or guests to spectate during the training times. Parents/Guardians/Visitors are not permitted to stay during session time. CODE OF CONDUCT All students will adhere to the full values contract below. Full Values Contract is a verbal agreement within a group to try, support, and encourage everyone to achieve their personal best. The F.V.C. is used to secure the bonds of teamwork, perseverance, and dedication in a learning environment.  We will ask the participants to abide by the following philosophy: I will try everything and be respectful to my instructors I will try everything and support and encourage myself and my friends I will model this behavior all the time because I am a leader by example I will keep my hands to myself I will not call students names or purposefully hurt their feelings Bullying will not be tolerated under any circumstances . Failure to adhere to this policy will result in removal from the program. Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://sarasotaarts.org/venue/sailor-circus-arena/",
      "text": "Sailor Circus Arena - sarasotaarts.org MEMBER LOGIN LOGIN REGISTER LOGOUT MY ACCOUNT English Arabic Chinese (Simplified) Chinese (Traditional) English French German Japanese Korean Kurdish (Kurmanji) Spanish Vietnamese There are no recent bookmarks. Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT MENU Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Calendar Performing Arts Theatre Music Dance Visual Arts Classes/Workshops Family-Friendly Festivals Film Free! Directories Artists Organizations Venues Who We Are About Staff Board of Directors Contact What We Do Advocacy Happening Now Public Meetings Arts Data Arts Education SCAEP EdExploreSRQ Grants TDC/A Grants Opportunity Grants Patriot Plaza About Patriot Plaza School Tours Become a Guide Culture Collective Jobs and Opportunities Support Membership Sponsor Donate Newsletter Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Sailor Circus Arena Facebook Twitter Linkedin Print Sailor Circus Arena LOCATION Sailor Circus Arena 2075 Bahia Vista St, Sarasota, FL 34239 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette UPCOMING EVENTS PAST EVENTS GenSRQ – Celebrating Our Youth Presented by Key Chorale and The Circus Arts Conservatory at Sailor Circus Arena Mar 29, 2026 Facebook Twitter Linkedin Buy Tickets Sailor Circus Academy's 75th Anniversary Diamond Jubilee Show at Sailor Circus Arena Dec 26 - Dec 29, 2024 Facebook Twitter Linkedin Buy Tickets Contact information Website / 2075 Bahia Vista St, Sarasota, FL 34239 (941) 355-9805 Find A Venue Search by Keyword Venue Type Art Center Business/Company Comedy Club Concert Hall Gallery Meeting Space Museum Park/Garden/Open Space Performing Arts Center Restaurant/Cafe School Studio Theater State / Province FL City/Town Englewood Laurel Longboat Key Nokomis North Port Osprey Sarasota Venice Zip/Postal Code 34223 34224 34228 34229 34230 34231 34232 34233 34234 34235 34236 34237 34238 34239 34240 34241 34242 34243 34260 34272 34274 34275 34276 34277 34278 34284 34285 34286 34287 34288 34289 34292 34293 34295 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access DIRECTORIES Artists Organizations Venues SUBMIT A LISTING Event Artist Organization ABOUT Sarasota Arts Contact Us Privacy Policy ABOUT The Arts and Cultural Alliance of Sarasota County is a member-powered organization that serves as an advocate for arts and culture in Sarasota County. CONTACT US HOURS : 9 a.m. – 5 p.m. Monday – Friday SARASOTA ARTS | 1226 N. Tamiami Trail, Suite 300 Sarasota FL 34236 941-365-5118 | info@sarasotaarts.org © 2025 - Arts and Cultural Alliance of Sarasota County. All Rights Reserved. { Powered by ARTSOPOLIS }"
    },
    {
      "url": "https://circusarts.org/contact-us/",
      "text": "Contact Us - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Contact Us Name * E-Mail * Subject * Message * Box Office 941.355.9805 Address Circus Sarasota: 5851 Nathan Benderson Circle Sarasota, FL 34235 2075 Sailor Circus: 2075 Bahia Vista Street Sarasota, FL   34239 General Contact Info Info@CircusArts.org , 941.355.9335 Group Sales SaSa Armor , Box Office and Group Sales Manager, 941.355.9335, ext. 367 Venue Rental, Sailor Circus Arena Rental and Ulla Searing Big Top! Rental Info@CircusArts.org , 941.355.9335 Guest Speakers Kelly Fairchild , 941.355.9335, ext. 300 Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.org/programs/circus-summer-camp-2-2/",
      "text": "Sarasota Summer Camp - Circus Summer Camp Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu Circus Summer Camp Circus summer camp is a truly unique experience! Previous Previous Previous Next Next Next 1 2 3 4 5 LET YOUR CHILD RUN AWAY AND JOIN THE CIRCUS THIS SUMMER! SARASOTA’S MOST UNIQUE SUMMER CAMP EXPERIENCE SOLD OUT! Registration for Summer Camp 2025 is closed, and the waitlists are full. In the summer of 2024, the CAC hosted an enriching experience for more than 1,000 campers from various states and seven countries. We were thrilled to welcome visitors from California, Connecticut, Delaware, Florida, Georgia, Illinois, Indiana, Louisiana, Maryland, Massachusetts, Michigan, Missouri, New York, North Carolina, Ohio, Oregon, Pennsylvania, Tennessee, Texas, Utah, Virginia, Washington, Washington D.C., and Wisconsin. Kids ages 6*-15 Experience the thrill of the circus at summer camp! Discover a variety of circus skills, including… Trapeze • Rolling Globe • Aerials  • Rolla Bolla • Trampoline • Wire Walking • Clowning • Juggling Circus Arts enhance self-confidence, creativity and life skills such as responsibility, teamwork, poise, and discipline. It’s a fun way to improve balance, coordination, problem-solving, and self-esteem. At the end of the session, your child will show their skills in a spectacular costumed show for parents, creating memories that will last a lifetime.​ *Campers must have completed kindergarten. No prior experience or assessment is required. Field Trip: The extended session will include a field trip to see The Summer Circus Spectacular at The Ringling! Ticket and transportation are included in tuition. Enrollment is conducted exclusively online.  Session requests via email or voicemail cannot be accommodated, and spots cannot be reserved without payment. Our camp program is designed for daily practice and progress toward the camper’s showcase performance. As a result, drop-in days and make-up days are not available. Need Assistance? Email Register@circusarts.org or call 941-355-9335 x326 or 300. We will respond to your inquiry within 48 hours. 2025 Summer Camp Session Dates ( Pre-Registration Required) Thank you for your interest in Circus Summer Camp. All sessions are SOLD OUT, and our waitlists are full for the remainder of the season. Hope to see you next year! Registration is now closed SESSION 1 June 2 – 6 SOLD OUT! SESSION 2 June 9 -13 SOLD OUT! SESSION 3 June 16 – 20 SOLD OUT! SESSION 4 June  23 – 27 SOLD OUT! SESSION 5 June 30 – July 11 Registration Closed SESSION 6 July 14 – 18 SOLD OUT! SESSION 7 July 21- 25 SOLD OUT! SESSION 8 July 28 -August 1 SOLD OUT! SESSION 9 August 4 – 8 SOLD OUT! 2025 Summer Camp Hours & Pricing Before care and extended care are only available to campers enrolled in the corresponding session. Please note that space is limited, and sign-up is required to guarantee your spot.. CAMP HOURS Camp hours 9:00am – 3:00pm Before Care starts at 8:00am. Extended Care hours till 5:30pm. Early drop off / late pick up will automatically incur additional fees. CAMP SESSIONS 1 Week Session Extended Session (Includes Field Trip – Show & Transportation) No camp on July 4th. Pre registration required for all camp sessions BEFORE CARE PER WEEK EXTENDED SESSION Drop in – $ PER DAY (Subject to Availability) Starting at 8:00am EXTENDED CARE PER WEEK EXTENDED SESSION Drop in – $ PER DAY (Subject to Availability) Until 5:30pm (pickup after 5:30 will automatically incur late fees) SIGN UP IN 3 EASY STEPS STEP 1 Enroll and Pay Click the “Register Here” button below. Click on the “My Info / Add Family” tab at the top of the window. Complete your “Personal” and “Billing” information. In the “Family Members” column, click “Add Family Member” and complete this information using your child’s birthdate, but your email and phone number. Click on the “Summer Camp” tab at the top of the window. Select your desired session(s) and submit payment. STEP 2 Complete the Google Registration Form Once Step 1 is completed, you will receive an email receipt/confirmation. Click on the link in this email to finalize your child’s spot by completing the Registration Form. You will receive a final confirmation email after completing this step, which includes your form responses. A late fee will be applied if the Registration Form is not completed at the time of purchase or enrollment. STEP 3 Get Ready for Camp Due to a high volume of inquiries regarding camp, PLEASE review all on-line information before contacting camp staff directly. Chances are very good that you will find your answers here. Look over the Summer Camp Information Guide found on this page under the 1-2-3 steps. “Remind” is an app for your phone that will serve as the primary communication tool between you and the Camp staff during your session. Download this free app. Your class code will be included in your pre-session email. Pre-Session Email – You will receive an email from Register@circusarts.org at 5:00 PM on the Friday before your camp session starts. This email will include reminders, important information, and your remind class code. If you do not see the email by Saturday morning, please check your spam folder. Circus Camp Information Guide Prerequisites For Summer Camp, campers must meet both prerequisites: they must have completed kindergarten and be at least 6 years old. Please note that only campers who are officially enrolled and registered for a specific session can attend that camp session. It is not allowed to switch or trade campers, nor attend a session a camper is not enrolled in. The camp staff requires all necessary documents and adequate time to prepare for the camp session before its commencement. Therefore, we cannot accept walk-ins, one-day drop-ins, or campers coming instead of another. Children who do not meet these requirements cannot attend camp. Registration Form Registration Form (see below regarding late fees) The registration form can be found in the purchase receipt and session confirmation sent to your email address, which is in your Mind Body account. After enrolling a child and paying the tuition, a purchase receipt will be emailed to you. Click the SUMMER CAMP REGISTRATION FORM link to complete your form. Registration Confirmation: After completing the form, you will receive an email containing a copy of your responses. This serves as your confirmation that the CAC has received your form. If you have received a confirmation email from Google Forms (a copy of your form responses), refrain from emailing the registrar inquiring whether the form has been received. Due to the large number of campers and high interest in the Summer camp, your email might not receive a response. If your reg form is not received, the camp admin will email you before your session. Late Fees: You must complete and submit the Google Registration form immediately upon enrollment. If forms are not submitted at the time of purchase/enrollment, a $50 late fee per form will be applied, and Group requests will not be considered. We reserve the right to cancel your reservation, and you will not be entitled to any refund. Fees TUITION COST $385 for 1 week session (2024) $ for the extended session (includes a field trip to The Summer Circus Spectacular and transportation to and from the show). CAMP ENROLLMENT Is secure once payment in full is collected and ALL FORMS are completed ( ALL registration forms are completed online and will come in your purchase email receipt ) Your camper registration form link is in your purchase receipt. Our camp model is for campers to practice and progress in their act group daily, drop in days are not offered in our camps for this reason. REGISTRATION FEE There are no registration fees. Registration forms must be completed at the time of purchase/enrollment to avoid a $50 late fee. Failure to complete the forms may result in the reservation being canceled without a refund. MOVE SESSION FEE Requests to change the session can be submitted, provided that space is available in the desired session. The request must be made at least two weeks before the start of both the scheduled session and the new session. There is a $25 fee per camper for any reservation changes, regardless of when the request is made. This fee is necessary because the administrator needs to make changes in multiple areas to accommodate the request. BEFORE AND EXTENDED CARE FEES Before care hours are 8:00AM – 8:55AM $75 Per Week Pre-registration required, space is limited. Single day rates for before care- $15 per day. Subject to availability Extended care hours are 3:00 – 5:30PM $120 Per Week Snack included, 35 minutes of circus programming, movie time-schedule available upon request. Single day rates for after care $35 per day. Subject to availability. Campers not picked up by 5:30PM will incur a $5 dollar charge, per camper, for every one (1) minute past 5:30. While we understand that things can happen that are out of our control, it’s imperative that you have reliable backup during those times, as late pick-ups will not be tolerated. Conditions of Enrollment Enrollment Campers are enrolled on a first-come, first-serve basis as per the date of receipt of the registration form and fees Confirmation of enrollment and receipt will be sent via email through Mind Body Waiting List When a session is full, you will have the option to enroll on a waiting list. Family is notified via email / phone when space becomes available Session Date Change Session change requests are based on availability of spaces in camp Session changes can be denied if they are not made 14-days in advance If the session is available we will move campers one time at no charge. Additional requests will incur a $25 fee per child per session. Refunds Please see our Policies and Procedures Tab Medical Refund Policy Please see our Policies and Procedures Tab Release Parents/Guardians are required to sign a “General Release” and a “Waiver of Liability and Indemnity Agreement” prior to a Circus Summer Camper being admitted Proof of insurance is required for all Circus Summer Campers Visitors To ensure the safety of all campers and staff, the CAC has implemented a policy that prohibits parents, guardians, and visitors from entering the arena during camp hours. Additionally, the doors and gates of the campus and arena will be securely locked from 9:30 AM to 2:30 PM every day. This measure is necessary to ensure the safety and protection of all individuals attending camp and will be enforced without exception. Once the camp begins, all parents or guardians are required to leave the campus. To contact the camp staff, use Remind. Review the Remind tab. Or call 941-355-9335 ex 300. Parents, guardians, and visitors are not permitted to have lunch with campers. There are no exceptions. Camp Hours CAMP HOURS Camp hours are 9:00 a.m. to 3:00 p.m. Campers should arrive between 8:55 a.m. and 9:00 a.m. and must be picked up by 3:10 p.m. Campers dropped off before 8:55 a.m. will incur a daily drop-in fee, and campers picked up after 3:10 p.m. will incur a drop-in fee. No parents or visitors are allowed inside the arena during camp hours. This includes lunches and forgotten items. Pl ease drop off any necessary items at the main office located in the small brick building on the west side of the arena. For the safety of campers and staff the arena doors and gates will be secure from 9:30 – 2:30 daily. BEFORE AND AFTERCARE Before-care hours are 8:00AM – 8:55AM Pre-registration is required; space is limited. Single-day rates may be available to enrolled campers. Subject to availability Aftercare hours are 3:15 – 5:30 PM Snack included 35 minutes of circus programming, and a movie. Single-day rates may be available for enrolled campers. Subject to availability. Campers not picked up by 5:30 PM will incur a 5 dollar charge per camper for every one (1) minute past 5:30. While we understand that things can happen that are out of our control, it’s imperative that you have reliable backup during those times, as late pickups will not be tolerated. Need to drop off an item during camp hours? Please review the Remind Tab. Location / Parking LOCATION: 2027 Bahia Vista Street, Sarasota, Florida 34239. Inside the Sailor Circus Arena. PARKING/ DROP OFF /PICK UP: All camp parking is located in the Sarasota High School parking lot , next to the Arena (building with the Blue and White circus tent-style metal roof). Throughout the camp, camp families must use the High School parking lot for access to the arena. The arena doors will be locked during the day, so camp families will need to use REMIND to inform camp staff to open a door. Campers should be escorted to the main arena entrance, where camp staff will check them in. Use the new entrance with the red metal awning, which is located near the parking lot exit, facing Bahia Vista Street. Once camp begins, parents/guardians will not be allowed inside the arena. Camp is not open to spectators and is closed to the public. Campers will be picked up from the same doors as drop-off. The circus staff parking lot, located on the west side of the Sailor Circus Arena (the other side of the arena) near Tamiami Trail, is not available for use to camp families at any time. VISITORS: Circus camp is not open to the public; it is a closed space. We do not allow parents or guests to spectate during camp hours or during before- and aftercare. Parents/Guardians/Visitors are not permitted to stay during camp sessions for any reason. Campers cannot have lunch with anyone outside the camp. Need to drop off an item during camp hours? Please check the Remind Tab and park in the high school lot, not the Circus staff lot. Directions: If you are coming from the East on Bahia Vista Street, you will see the high school parking lot before you reach the arena. If you are coming from the West, you will pass the arena and then enter the high school parking lot to park. Remind / Communication During the camp session, Remind serves as the primary mode of communication between families and staff. Once your session begins all communication will be conducted through Remind. Please note that you will no longer receive any emails from the registrar once the session begins.  To contact our camp staff, kindly use Remind since there is no phone available in the area. If a phone were present, it would be difficult to hear it ring due to the exciting camp activities taking place. Prior to the start of your camp session, the weekend before, an email will be sent by the registrar providing you with instructions on how to join Remind and the corresponding class code. We recommend communicating with our staff through Remind, but if necessary, you can also reach Kelly at 941-355-9335, extension 300. If she’s unavailable, she may be assisting in the arena, so please use Remind to message the camp staff. During camp hours, if you need to drop off or pick up something for your camper, or drop off late or pick up early, simply message the camp staff via Remind. They will meet you at the locked gate near the Sarasota High School parking lot to assist you. A day at Circus Camp / Acts Our mornings at circus camp start with a gentle warm-up and group stretch, followed by one or two fun activities like low wire, unicycle riding, trampolining, hula hooping, and juggling. We take a break for a snack and then focus on practicing our showcase performance. After lunch, we enjoy theater games, arts and crafts, and more rehearsal for our showcase act. We take another snack break and end the day with group games before dismissal. On Wednesdays, we have flying trapeze day, where all campers can experience the thrill of flying high on the trapeze. On the last Friday of camp, campers can showcase their talents in a costumed performance for their families. Two-week session includes a ticket to the Summer Circus Spectacular and transportation. All are included in your camp tuition. Acts: Not all acts will train every session to mix it up. Unfortunately, we can’t tell you ahead of time which session will offer which acts. Some of the acts that may be offered over the summer are Rolling Globes, Lyra, Silks, Hammock, Cargo Net, Ladders, Triple Trapeze, Rolla Bolla, Trampoline, Low Wire, Clowning, Acro, and more. Lunch / Snacks LUNCH / SNACKS For safety and security reasons, parents, guardians, and visitors are not permitted to have lunch with campers. There are no exceptions. Campers need to bring their lunch, snacks, and water bottles every day. – The CAC does not supply cups, refrigerators, or microwaves. The CAC does not provide food or snacks. Campers must bring a non-perishable lunch and two snacks each day. Lunch: Include a healthy protein source and pack food that your child will eat. Snacks: Two snacks must be brought daily. Reusable Water Bottle: Campers must bring a clearly labeled reusable water bottle. Bottle refill stations are available at the arena. Please be aware that the CAC does not have refrigerators available for storing lunches, so pack your meals accordingly. Camp Attire / Personal items / Health & Safety Camp Attire Shoes required, any type. Long hair: All campers must wear a hair tie or have their hair up if it’s long. (For both safety and performances.) No pajamas, cargo shorts, or jeans. Recommended Items: L eotards Biketards Leggings Shorts Tee shirts Gym shorts Sliders, or Leggings for all aerialists Campers should wear clothing that is easy to move in and appropriate for being upside down. Showcase Tights: On the last day of the camp session, girl campers are required to wear skin-colored tights, either footed or footless, for the showcase. (not included in tuition) Tights may be purchased at Walmart, Target, Amazon, etc. Any brand No patterns allowed The color of the camper’s skin should be matched. Footed, footless, or convertible (google it) For campers attending multiple sessions, it is recommended that you purchase convertible tights. Footed tights may need to be cut by our staff depending on the act Please be advised that showcase items (tights, etc) must be dropped off on Friday morning of the showcase, along with the camper. It is imperative to understand that parents will not be granted access to the campus during the day for the purpose of dropping off items. PERSONAL ITEMS NO jewelry, watches, or other valuables are allowed at camp NO Electronics such as cell phones, laptops, mini computers, iPods, MP3 players, e-readers, money or checks, and portable game consoles. The CAC does not have secure lockers for personal storage. The CAC is not responsible for any lost, stolen, or damaged items brought to camp. HEALTH AND SAFETY Personal hygiene is very important for our health and safety. Body-to-body contact inevitably leads to the spreading of germs, so keep your child’s body clean. All cuts or open wounds must be covered with a bandage. Campers may not share clothes, hair ties, combs, or hair brushes. Campers may not share drinking containers. Campers must wash their hands often and use the hand sanitizers located throughout the facility. We do our best to keep the facility and equipment clean with regular sanitary maintenance. We ask our campers follow to do the same. Before Care & Extended Care Services are exclusively provided to campers enrolled in the program and unavailable to anyone not registered in the session. BEFORE AND EXTENDED CARE Before-care hours are 8:00 AM – 8:55 AM Pre-registration is required. Space is limited. Single-day rates are $15 per day. Subject to availability Extended care hours are 3:00 – 5:30 PM Thirty-five (35) minutes of circus programming, a snack, and movie time. Single-day rates are $35 per day. Subject to availability. On Showcase days, there is no extended care offered. After the showcase, all campers will be dismissed and no staff will be on duty. No special requests or ACT practice will be accommodated during extended care time, which is a group activity. Campers not picked up by 5:30PM will incur a $5 dollar charge per camper for every one (1) minute past 5:30. While we understand that things that are out of our control can happen, you must have a reliable backup during those times, as late pick-ups will not be tolerated. Refunds REFUNDS: – Requests accepted until May 1st with a $75 administrative fee deducted. – No refunds will be issued after May 1st. – Refunds will not be available if you purchase your camp session after May 1st. – Please send refund requests to Tonia@circusarts.org before May 1st. There are no refunds for campers dismissed from the program due to disciplinary reasons, or for campers found with evidence of lice (see our lice/nit policy), for campers who choose to withdraw early from a program already in session, or for campers who choose to withdraw before the start of their scheduled session. If a camper is unable to attend due to COVID (camper or family member has COVID), no refunds will be given. If space is available in another session, the camper may be transferred to a session with open spots. If all remaining sessions are full, or the camper cannot attend another session for any reason, no refunds will be given. Cancellation: – There are no refunds for cancellations or schedule changes after May 1st. Refunds may be requested until May 1st and a $75 admin fee will be deducted. If your camp session is purchased after May 1st, there are no refunds. If a camper does not attend their scheduled session for any reason, the credit is forfeited and cannot be transferred to another camp session or any other program / class offered by the CAC. No refunds will be given for: Purchases made after May 1 Cancellation or schedule changes after May 1 Campers dismissed from the program due to disciplinary reasons Campers found with evidence of lice (see our lice/nit policy) Campers who choose to withdraw early from a program already in session Campers who choose to withdraw before the start of their scheduled session. Campers who do not attend their scheduled session. Camper can not attend due to COVID Camper or family member has COVID MEDICAL REFUNDS : If a camper leaves due to an injury incurred at camp , A prorated portion of the tuition may be refunded depending on the situation. If a camper is injured prior to attending a scheduled session or is injured during the session outside of camp and it prohibits them from participating, we will consider a refund upon review of the doctor’s note.  A doctor’s note must be received prior to the start of the camp session in order to be considered for a refund. Any tuition refunded will incur a $75 admin fee . Refunds are not guaranteed; CAC reserves the right to make decisions based on the circumstances. Field Trip Field trip to see the Summer Circus Spectacular at the Ringling Museum. Extended sessions only. The camp session fee includes a ticket for the show and transportation. Transportation: The Sarasota County School District provides transportation for all campers and camp staff attending the show. Campers must be transported by the school bus with CAC staff to attend. Any requests for students to be transported in a different way or to meet the staff on location will not be granted. It is not possible for our staff to arrange a meeting with any campers or parents at the location. If campers cannot attend or ride the bus, they cannot attend camp that day since no staff will be available on campus to supervise campers who are not attending the show. For safety reasons, The CAC does not permit camp volunteers or parents or guardians to accompany their children on field trips. Showcase SHOWCASE DETAILS – This is a private event exclusively for the families of campers participating in the current week’s session. No tickets are necessary for attendance. – The showcase for campers’ families will take place at 3:30 p.m. The doors will open at 3:15 p.m. – After the showcase, campers will change out of their costumes, and the camp session will end. – The camp showcase is exclusive to campers’ families and is not open to the general public. – No aftercare will be provided on showcase days. –  The show is expected to last approximately 45 minutes. – Our concession stand will offer a limited summer menu and Camp merchandise for purchase. We accept cash and cards. – After the show, campers must change out of their costumes. – All C costumes and accessories, including hair pieces, are the property of the CAC and may not leave the campus. – Campers will be dismissed immediately after they change out of their costumes. – Female campers must wear skin-colored tights on the last day of the camp session for the showcase. Please drop the tights off on Friday morning with the camper. Parents will not have access to the campus to drop off tights throughout the day. More information is on the Attire Tab. – The showcase takes place on the last day of the session. Costumes The CAC costume team does an excellent job creating costumes for each session. Each act will have a custom costume designed according to the session’s theme. All costumes are washed with Tide laundry detergent after each performance . If your child has a Tide sensitivity or allergy, please let us know. ALL costumes, accessories, and hairpieces are the property of the CAC and are not permitted to leave the campus. Groups / Group Requests The campers are divided into two (2) groups: a home group and an act group. During the day, they spend time in both groups. ​ Home Group: Our camp organizes campers into home groups according to their age. Each group is led by one counselor and two to three junior counselors. We assign campers to their home group (by age) before camp begins, and they cannot be rearranged for any reason. Home groups typically consist of 10-12 campers. ​ Showcase Act Group: Campers will be placed in an act group that matches their interests and abilities. The groups will include campers of all ages and will be led by a counselor. This counselor may or may not be the same as the camper’s home group counselor. The act group assignments will be given to campers at the end of the first day. Group Requests We understand that you may prefer your camper to be placed in a particular group, but we cannot guarantee that we can fulfill every request. Our team will do their best to accommodate your preferences, but please remember that it may not always be feasible. We strive to group campers with their friends, but our process may not always permit it. If your child is not assigned to their friend’s group, we apologize, but we cannot honor requests to switch groups due to the high number of campers we have each week; it would be impossible to make changes for everyone. During the day, all the campers gather together in the arena, which is a vast open area. This means your camper will still be near his or her friends even if your requests cannot be fulfilled. Registration Forms not completed at the time of purchase/enrollment will be considered late. Unfortunately, we cannot grant group requests for late forms. *Requests to move to another group can not be granted. **Refund requests due to camper group placements will not be granted. ​ Waitlist The waitlist option becomes available only once a session is full and must be reserved via Mind Body. You can join the waitlist by clicking on the “Register Here” button provided in step #1 above. If you are reserving spots for multiple campers, add each camper’s name separately to the waitlist. In case a spot becomes available, you will be notified via email by Tonia@circusarts.org. You will then have 24 hours to respond and confirm. If you fail to respond within 24 hours, the spot will be offered to the next person in line. Your child’s camp spot is reserved once you receive a confirmation email after payment from Mind Body for that session and CAC staff. Please note that waitlist notifications will be sent out in the order of reservations received. No spots will be offered for the upcoming camp session after Thursday of the preceding week. Session Change Request Requests to change the session can be submitted, provided that space is available in the desired session. The request must be made at least two weeks before the start of both the scheduled session and the new session. There is a $25 fee per camper for any reservation changes, regardless of when the request is made. This fee is necessary because the administrator needs to make changes in multiple areas to accommodate the request. Policies and Procedures CAMP ENROLLMENT Is secure once payment in full is collected and ALL FORMS are completed ( ALL registration forms are completed online and will come in your purchase email receipt )      Our camp model is for campers to practice and progress in their act group daily, drop in days are not offered in our camps for this reason. REGISTRATION FEE No Registration Fees DISCOUNTS There are no discounts offered for summer camp, including for siblings or multiple sessions. CAMP HOURS Camp hours are 9 a.m. to 3p.m. Campers should arrive between 8:55 a.m. & 9 a.m. and must be picked up by 3:10 p.m. Campers dropped off before 8:55 a.m. will incur a daily drop in fee. Campers picked up after 3:10 p.m. will incur a drop in fee. No parents or visitors are allowed inside the arena during camp hours. For the safety of campers and staff the arena doors and gates will be secure from 9:30 – 2:30 daily. BEFORE AND AFTERCARE Before care hours are 8:00AM – 8:55AM Pre-registration required, space is limited. Aftercare hours are 3:15 – 5:30PM Snack included, 35 minutes of circus programming, movie time-schedule available upon request. Campers not picked up by 5:30PM will incur a $5 dollar charge, per camper, for every one (1) minute past 5:30. While we understand that things can happen that are out of our control, it’s imperative that you have reliable back up during those times as late pick ups will not be tolerated. Aftercare services are exclusively provided to campers who are enrolled in the program and are not available to the general public. ENROLLMENT: Campers are enrolled on a first come, first served basis as per the date of receipt of the registration in Mindbody and the Google R egistration Form. Confirmation of enrollment and receipt, along with a link for registration documents, will be sent via email through MindBody. GROUP REQUESTS: See group tab. Refunds will not given due to camper group assignments. Session changes will not be permitted because of group assignments. WAITING LIST: When a camp session fills, you may enroll onto the waitlist through MindBody.  Applicants will be notified if space becomes available by email. Tuition fees are not processed until applicants are placed in a session. You will be notified via email if a spot opens and you will have 24 hours to reply or the spot will be offered to the next person on the waitlist. SESSION CHANGE / RESCHEDULING: Session change requests are based on the availability of spaces in the requested session. If space is available, we can move your camper to a different session for a fee of $25 per camper per move. Requests must be made at least two weeks before the start of the desired session and at least two weeks BEFORE the currently enrolled session starts. Refunds will not be processed for cancellations or schedule changes. Email Tonia@CircusArts.org. Provide your camper name and the session desired. MISSED DAYS/MAKE-UP DAYS: Absenteeism is not creditable. We have reserved a space at camp for your child with staffing. Due to its nature, our programming doesn’t allow for make-up days . LATE FORMS: Registration forms must be completed at the time of purchase/enrollment to avoid a $50 late fee. Failure to complete the forms may result in the reservation being canceled without a refund. CANCELLATION / REFUND POLICY: Visit the Refunds tab. MEDICAL REFUNDS: Visit the Refunds tab. WEATHER RELATED CANCELATIONS: Cancelations due to inclement weather cannot be prorated or refunded. Due to the nature and scheduling of our programming, any canceled class or training cannot be rescheduled. RELEASE: Parents/Guardians are required to sign a general release and waiver of liability and indemnity agreement prior to camper being placed in a session. In addition to a release proof of insurance is required for all campers. PARKING/ DROP OFF /PICK UP: Campers should be walked to the main doors of the arena where camp staff will check campers in. Once camp begins parents/guardians will not be allowed inside the arena. Camp is not open for spectators and is closed to the public. Campers will be picked up from the same doors as drop off. VISITORS: Circus camp is a closed space and we do not allow parents or guests to spectate during camp hours, lunch or Before and After care. Parents/Guardians/Visitors are not permitted to stay during camp sessions. SNACKS Campers need to bring two healthy snacks per day. Bring a water bottle to refill during the day. Label the bottle with the campers name. LUNCH Campers must bring their own lunch. Refrigerators and microwaves are not available to campers. Pack the lunch accordingly. Campers need healthy lunches to supply them with enough energy to excel. Please send your child to camp with a good protein source and fruit and/or vegetables. Refrigerators and microwaves are not available to campers. Pack the lunch accordingly. ATTIRE: See Attire Tab PERSONAL ITEMS: See Attire Tab HEALTH AND SAFETY Personal hygiene is very important for health and our safety. Body to body contact inevitably leads to spreading of germs so keep your child’s body clean. All cuts or open wounds must be covered with a bandage. Campers may  not share clothes, hair ties, combs or hair brushes. Campers may not share drinking containers. Campers must wash their hands often and use the hand sanitizers  located throughout the facility. We do our best to keep the facility and equipment clean with regular sanitary maintenance. We ask our campers follow do the same. CODE OF CONDUCT All campers will adhere to the full values contract below. Full Values Contract is a verbal agreement within a group to try, support, and encourage everyone to achieve their personal best. The F.V.C. is used to secure the bonds of teamwork, perseverance, and dedication in a learning environment. We will ask the campers to abide by the following philosophy: “I will try everything and be respectful to my instructors; I will try everything and support and encourage myself and my friends; I will model this behavior all the time because I am a leader by example”. Parents please discuss examples of good behavior with your children to aid in the cohesion and flow of camp functions. The consequence for not adhering to this policy is removal from camp activities, removal from the showcase or dismissal from camp. Bullying will not be tolerated under any circumstances. SHOWCASE DETAILS : See Showcase Tab Scholarships Due to the generosity of our esteemed donors, we are often able to offer partial and full scholarships to families encountering financial difficulties. To apply for these scholarships, please submit your application HERE by May 1. The scholarship application process will conclusively end on this date. Our committee will evaluate all complete applications during May. Applicants are required to submit the tax forms filed with the Internal Revenue Service from the preceding year for the scholarship committee’s review. Please be advised that incomplete applications will not be considered. Award recipients will usually receive an email in late May or later, after the committee’s review, detailing their scholarship amount, which may be full or partial, along with their assigned session. Regrettably, we are unable to accommodate specific requests regarding session assignments. If awarded, details about the assigned session will be in the award email. We typically receive more applications than we can award. If a family decides to purchase a session, or if a session is purchased on behalf of the applicant, they will no longer be eligible for an award, and their application will be automatically withdrawn. Session Themes Each week, our camp offers a fun theme! The themes for the 2025 schedule are below. S1 – Movies S2 – Around the World (places/countries/cities) S3 – Holidays S4 – Disney S5 – Traditional Circus S6 – Outer Space & Planet Earth S7 – Heroes and Villains S8 – Music Genres S9 – Colors Discounts No discounts are offered for summer camp, including for siblings or multiple sessions. Enrollment Instructions: Do not add any notes in Mind Body as they will not be visible to the staff. Instead, you can add a note in your Google registration form. To ensure that your purchase and reservation for the camp session went through correctly, check your email for a confirmation that includes the camper’s name and the session information. If you did not receive this email, your reservation may not have been processed correctly. To ensure your camper has a spot at our summer camp, complete the Google Registration Form provided in your purchase receipt email. Failure to do so may result in your camper losing their spot. Registration forms are due at the time of purchase. Upon completing the form, a confirmation email will be sent to you, including a copy of your form as proof of receipt. Enrolling with the Mind Body Website, follow these steps: Click on the “Register Here” button above. If you already have a Mind Body account, log in. Otherwise, create a new one. Once logged in, click “ADD FAMILY MEMBER.” Add your child by filling in their information, which will create a profile for them in your account. Add your child’s date of birth and your email address in t heir profile. Save the information. Select the desired camp session(s) for your child. Enroll your child in the camp session(s), not yourself. Check your email for a receipt and confirmation of the session(s) you have selected. Click on the link provided in the email to fill out the Summer Camp Registration Form . Enrolling with the Mind Body App When you buy on the app, you can purchase camp sessions without enrolling. However, you must choose your session and enroll afterward, or your spot will not be reserved in a session. If sessions are full, we cannot add more campers, regardless of when the purchase was made. Enrolling in a session is the only way to reserve a spot. After purchasing, you must visit the Mind Body website to select your session. Troubleshooting: Received a “Does not meet the prerequisite, call the business” message when trying to register? There are a few reasons this message pops up. The client doesn’t meet the age requirements for camp. The client’s profile is missing a date of birth, preventing enrollment in Mind-Body. Your Mind Body account needs to be linked to our business. Please see below for instructions on how to resolve this issue. Please log in to your account and complete the following steps. You may not need to complete all of these steps. After you finish any step, you can attempt to enroll again. If your camper is not already listed in your profile, add them as a “family member” and ensure that their Date of Birth is included in their profile. Your camper is already listed in your profile. Please make sure that their Date of Birth is also included in their profile. Link your Mind Body account to our business by clicking HERE . Once you have completed any or all the steps above, try enrolling again. If you continue to have issues, please email Tonia@circusarts.org. Include the following information: Your Mind Body account name. (Your Mind Body account can be difficult for us to locate if you have a different last name) Camper name, first and last Date of birth Phone number where you can be reached. Frequently Asked Questions What are the ages for Circus Summer Camp? Campers must be at least 6 years old and have completed kindergarten to attend camp. No exceptions. Can I print out or pick up a registration form? All registration is performed through the online platform. You can access the registration forms by referring to the purchase receipt sent to your email. Should you need assistance filling out a digital form contact Tonia@circusarts.org Do you offer discounts for siblings or multiple sessions? No. There are no discounts offered for camps. Will there be a chance for campers to fly on the trapeze? YES! Can campers register to attend one week of an extended session? No, campers can only register to attend the full session. Do you prorate days? What if a camper misses some days can they make them up? Unfortunately, we can not allow campers to join another session for make up days. Days are not prorated. Load more For more information, contact us at Register@CircusArts.org Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://circusliquor.com/contact-us/",
      "text": "Contact Us - Circus Liquor Store - The One Stop Shop in LA and San Fernando Valley Home Categories Whiskey Wine Tequila Vodka Brandy Cocktails Cognac Gin Liqueur Mezcal Rum Sake Others Locations North Hollywood Laurel Canyon Blvd North Hollywood Santa Clarita Sylmar Inglewood Arleta Jefferson Blvd Los Angeles Offers Our Stock About Us Contact Us 0 Cart is empty Search 0 Cart is empty Home Contact Us Contact Us Contact Us Get In Touch Got a question or need assistance? We're here to help—reach out to the Circus Liquor team and we'll get back to you as soon as possible! Email: info@circusliquor.com Phone: +1 818-769-1500 Address : Check Our Locations Page Quick Links Home Locations Our Stock Categories Deals About Contact Contact @circusliquor @circusliquorlc @sylmarcircusliquor @circusliquorlax @circusliquorsc @circusliquorarleta Subscribe To Our Email For Latest Offers Leave this field empty if you're human: © 2025 Circus Liquor Store. All rights reserved. Privacy Policy  .  Term Condition Shopping Basket error: Content is protected !! We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Accept Reject Privacy policy"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/arts/2024/12/21/sarasota-sailor-circus-marks-75-years-of-student-performances/76889367007/",
      "text": "Sarasota Sailor Circus marks 75 years of student performances Manatee Sheriff's office: Bradenton man killed in standoff with deputies News Sports Ticket Lifestyle Opinion Advertise Obituaries eNewspaper Legals ARTS Sarasota Sailor Circus marks 75 years with holiday showcase Jay Handelman Sarasota Herald-Tribune This holiday season might be a bit more glittery and exciting for the Sailor Circus Academy, which will mark its 75th anniversary with a Diamond Jubilee production. Dozens of young performers from the Academy’s most senior group, the Red Troupe, will be flying and soaring over the Sailor Circus arena on Bahia Vista Street in Sarasota during four days of performances that will look to the future and pay respects to the past. The show will celebrate the “generations of contributors, coaches, artists, managers and leaders who helped it blossom into the Sailor Circus it is today and will impact even more young lives in the next 75 years,” said Jennifer Mitchell, who was recently promoted to president and CEO of the organization . Sailor Circus, known as The Greatest “Little” Show on Earth, was founded in 1949 by Bill Rutland as part of the Sarasota High School gymnastics program and is now the longest-running youth circus in the country. Circus Sarasota, which was founded by circus artists Pedro Reis and Dolly Jacobs, took over the Sailor Circus in 2011 and renamed the umbrella organization as the Circus Arts Conservatory, with the Sailor Circus Academy as one of its key educational components. Mitchell said records aren’t clear, but at least 15,000 students participated in Sailor Circus or graduated from the program before 2015. The numbers have only grown since. “Last year, we had over 10,000 students participate in some sort of youth program,” whether learning circus skills or participating in projects like Circus Science of the Marvelous, Miraculous Circus Machine. Watch it here: Stream your favorite shows, the biggest blockbusters and more. In years past, Sailor Circus students were featured on “The Original Amateur Hour,’ “The Mike Douglas Show” and “Today” with Barbara Walters, and in 1976 they marched in the Macy’s Thanksgiving Day Parade. They have toured Alaska, Japan and Peru. In 2017, students led performances, classes and demonstrations during the circus-themed 50th Annual Smithsonian Folklife Festival on the National Mall in Washington, D.C. Graduates and current students are participating in the “Wonderland: Illuminate,” the winter showcase co-presented by Nik Wallenda and the Circus Arts Conservatory. New show traces on Sailor Circus history Mitchell said the Diamond Jubilee show will feature about 60 of the most advanced Sailor Circus students in a show that will also share the “story and legacy of circus history” represented by alumni of the program and large numbers of current coaches and trainers who have a long connection with the program. Acts being performed by the students (all between ages 10 and 18) include the trampoline wall, the high wire, slack rope, cloudswing, hammock, juggling, web, lyra, hand balancing, acro dance, skating, unicycle and the traditional closing act of the flying trapeze. New this year is a chandelier act. Mitchell said the show is broken into sections and themes noted by different jewels and jewel tones to mark periods in the organization’s history, leading up to this year’s diamond celebration. The acts presented and the training for them have changed over the year “based on student dynamics. Do we have flexibility, or large numbers of boys? Each year’s show is planned around the students with safety at the core,” Mitchell said. Students perform with a safety net or safety lines or harnesses. “It’s about how we do something and execute it safely and well.” Arts Newsletter: Sign up to receive the latest news on the Sarasota area arts scene every Monday Purple Passion: The Van Wezel is a landmark that transformed Sarasota Fewer than 5 percent of the Sailor Circus participants have gone on to serious careers in professional circuses, but Mitchell said the training helps the students prepare for a variety of careers. “One graduate has gone into the stunting world, and another is working for Netflix. We’ve had students go on to become audio-video designers or engineers and architectural engineer for performance venues.” During a fundraising campaign to renovate the circus arena, she said an alumni from Texas who is now an attorney, sent a significant gift and wrote that it “built my confidence to be in front of others in this environment because of the Sailor Circus. That empowerment and individuality is what we’re dedicated to. We’ve built a world-class coaching team and their passion and commitment to exploring circus arts and teaching is unsurpassed.” Sailor Circus Academy Diamond Jubilee Presented at 2 and 7 p.m. Dec. 26-28 and 1 and 5 p.m. Dec. 29 at the Circus Arena, 2075 Bahia Vista St., Sarasota. Tickets are $20-$40. 941-355-9805; circusarts.org Follow Jay Handelman on Facebook , Instagram and BlueSky Contact him at jay.handelman@heraldtribune.com . And please support local journalism by subscribing to the Herald-Tribune . Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Licensing & Reprints Public Notices Help Center Subscriber Guide Manage Account Give Feedback Submit Community News Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.heraldtribune.com. All rights reserved."
    },
    {
      "url": "https://www.circuscollective.com/contactus",
      "text": "Contact | Circus Collective top of page HOME CLASSES Schedule Circus Class Descriptions & Pre-Reqs Pole Classes & Pre-Reqs Youth/Teen Classes Private Classes PRICING Class Pricing OTHER OFFERINGS Upcoming Workshops Camps Group Classes & Events School & Outreach BOOK PERFORMERS Photos ABOUT Policies Contact Team FAQ More Use tab to navigate through the menu items. Contact 4459 Jason Street, Unit 3 Denver, CO 80211 Same parking lot as Denver Beer Co. info@circuscollective.com **Preferred method of contact** (720) 722-0635 First Name Last Name Email Message Thanks for submitting! Send AERIAL   •   CIRCUS ARTS   •   POLE DANCE   •   MOVEMENT ARTS   •   PERFORMANCE   •   STRENGTH   •   HANDSTANDS   •   ACROBATICS 4459 Jason St. Unit 3, Denver CO 80211 • (720) 722-0635 • info@circuscollective.com bottom of page"
    },
    {
      "url": "https://issuu.com/srqme/docs/issuu_srqdec20_spiritofgiving/s/11426261",
      "text": "CIRCUS ARTS CONSERVATORY - Issuu Issuu Search Show submenu for \"Read\" section Read Articles Browse short-form content that's perfect for a quick read Issuu Store Purchase your next favourite publication Categories Arts and Entertainment Religion and Spirituality Business Science Education Society Family and Parenting Sports Food and Drink Style and Fashion Health and Fitness Technology Hobbies Travel Home and Garden Vehicles Pets All Categories Show submenu for \"Features\" section Features Flipbooks Transform any piece of content into a page-turning experience. Fullscreen Sharing Deliver a distraction-free reading experience with a simple link. Embed Host your publication on your website or blog with just a few clicks. Articles Get discovered by sharing your best content as bite-sized articles. Statistics Make data-driven decisions to drive reader engagement, subscriptions, and campaigns. Teams Enable groups of users to work together to streamline your digital publishing. Social Posts Create on-brand social posts and Articles in minutes. GIFs Highlight your latest work via email or social media with custom GIFs. Add Links Send readers directly to specific items or pages with shopping and web links. Video Say more by seamlessly including video within your publication. Digital Sales Sell your publications commission-free as single issues or ongoing subscriptions. QR Codes Generate QR Codes for your digital content. More Features Integrations Canva Create professional content with Canva, including presentations, catalogs, and more. HubSpot Embed, gate, and track Issuu content in HubSpot marketing campaigns. Adobe Express Go from Adobe Express creation to Issuu publication. Adobe InDesign Design pixel-perfect content like flyers, magazines and more with Adobe InDesign. Show submenu for \"Use Cases\" section Use Cases Industry Art, Architecture, and Design Education Internal Communications Marketing and PR Nonprofits Publishing Real Estate Retail and Wholesale Travel and Tourism More Industries Role Content Marketers Designers Publishers Salespeople Social Media Managers Teams Content Type Flipbook Portfolio Digital Magazine Digital Flipbook PDF to Flipbook Newspaper Digital Book Digital Lookbook More Content Types Show submenu for \"Learn\" section Learn Blog Welcome to Issuu’s blog: home to product news, tips, resources, interviews (and more) related to content marketing and publishing. Help Center Here you'll find an answer to your question. Webinars Free Live Webinars and Workshops. Resources Dive into our extensive resources on the topic that interests you. It's like a masterclass to be explored at your own pace. Pricing Log in Sign up 1 minute read CIRCUS ARTS CONSERVATORY from SRQ Magazine | Spirit Of Giving December 2020 by SRQ MEDIA Next Article THE JEWISH FEDERATION OF SARASOTA-MANATEE THE SAILOR CIRCUS ACADEMY, A CIRCUS ARTS CONSERVATORY OUTREACH PROGRAM has transformed the lives of youth in our community for more than seven decades. It’s an empowering program and a magical experience! Students are inspired by their coaches to work hard; know the thrills of performing; feel the incredible sense of accomplishment and experience the sheer fun that circus brings! Through this interdisciplinary, athletic performing arts program, students develop life management skills, self-discipline and confidence, while learning the circus arts. These experiences provide an environment where young people of differing abilities and backgrounds connect and learn the value of collaboration, teamwork, trust, respect and leadership in meaningful ways. And all of this takes place in a $5 million newly renovated Sailor Circus Arena, the largest state of the art youth circus arts training facility in the nation. The Circus Arts Conservatory has launched a special, limited opportunity fundraising program to name seats in the Sailor Circus Arena. Naming proceeds will help build the new Sailor Circus Fund. This Fund will provide scholarships, equipment and maintenance, performance costumes and more to future generations of young artists. Please contact Karen Misantone at KarenM@circusarts.org or call 941-355-9335, Ext. 311 for naming opportunities. The Circus Arts Conservatory is a non-profit organization whose mission is to keep the Circus Arts Alive and Thriving. The CAC’s innovative programs enhance the incredible value and impact of the Circus Arts to both young and old in our community and beyond. Through world class performances, excellence in youth training and educational outreach, The CAC inspires a passion for the performing arts while offering quality opportunities to learn life skills as well as entertain appreciative audiences. 2075 BAHIA VISTA ST. SARASOTA, FL 34239 | 941.355-9335 | CIRCUSARTS.ORG IN THE SPIRIT OF GIVING CREATIVE MARKETING SECTION :: SRQ MAGAZINE DEC 2020 More articles from this publication: THE JEWISH FEDERATION OF SARASOTA-MANATEE 2min page 24 FLORIDA STUDIO THEATRE 2min page 24 JFCS OF THE SUNCOAST 2min page 23 BIG CAT HABITAT 2min page 23 TIGER LILY FLOWERS 2min page 22 THE FLORIDA CENTER FOR EARLY CHILDHOOD 2min page 21 THE BISHOP MUSEUM OF SCIENCE AND NATURE 2min page 20 SENIOR FRIENDSHIP CENTERS 2min page 19 SARASOTA MEMORIAL HEALTHCARE FOUNDATION 2min page 18 Show more This article is from: SRQ Magazine | Spirit Of Giving December 2020 Issuu Issuu Inc. Create once, share everywhere. Issuu turns PDFs and other files into interactive flipbooks and engaging content for every channel. English Deutsch Company About us Careers Plans & Pricing Press Blog Contact Issuu Platform Content Types Features Flipbook Industries Resources Developers Publisher Directory Redeem Code Terms Privacy Report Content DMCA DSA Accessibility Cookie Settings"
    },
    {
      "url": "https://www.eshcircusarts.com/our-staff/",
      "text": "Our Staff – Esh Circus Arts Adult Classes FAQ Private Lessons Calendar & Sign Up Classes & Lessons Adult Class Descriptions Youth Class Descriptions Private Lessons Intensives & Programs Youth Summer Program Professional Prep Program Residency Program Act Creation Intensive Application About Our Story Our Staff FAQs Studio Policies Volunteerism & Community Shop Contact Menu Menu Our Staff Meet the folks who keep the circus running! MANAGEMENT INSTRUCTORS SUPPORT STAFF Management Ari Green Ellen Waylonis Johnny Blazes Roger May Instructors Abbie Green Alex Jackson Alexis Hedrick Becky Brown Caroline Dignes Chels Errante Elizabeth Sibert Ezra Varley Finn Cotton Jen Ender Karen Sokolow Lauren Breunig Liliana Jimenez Mandy Hackman Melanie Robinson Melissa Knowles Michael Lewin R Feynman Rachel Barringer Reba Rosenberg Rin Judith Sarah Selby Shir Livne Sofia Post Sophie Kaufman T Lawrence-Simon Tim Ellis Tyler Sabourin Xiaoshu “X” Dai Assistant Instructors Abbie Green Alex Jackson Alexis Hedrick Ari Green Becky Brown Caroline Dignes Chels Errante Elizabeth Sibert Ellen Waylonis Ezra Varley Finn Cotton Jen Ender Jess Shada Johnny Blazes Karen Sokolow Kira Jorgensen Lauren Breunig Liliana Jimenez Mandy Hackman Melanie Robinson Melissa Knowles Michael Lewin Nada Hussein R Feynman Rachel Barringer Reba Rosenberg Rin Judith Roger May Sarah Selby Shir Livne Sofia Post Sophie Kaufman T Lawrence-Simon Tim Ellis Tyler Sabourin Xiaoshu “X” Dai Support Staff Jess Shada Kira Jorgensen Nada Hussein Sofia Post Follow us on Instagram! @ESHCIRCUSARTS CURRENT & UPCOMING ADULT SESSIONS CURRENT: 2025 SUMMER SESSION Monday June 23rd – Sunday August 17th NEXT: 2025 FALL SESSION I Monday August 25th – Sunday October 19th CURRENT & UPCOMING YOUTH SESSIONS CURRENT: 2025 SUMMER SESSION Monday June 23rd – Sunday August 17th NEXT: 2025 FALL SESSION Monday September 8th – Sunday December 21st CONTACT 44 Park Street Somerville, MA 02143 info@eshcircusarts.com NEWSLETTER Email (required) * Select list(s) to subscribe to Esh Circus Arts mailing list I would like to receive emails from Esh Circus Arts! Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: Esh Circus Arts. You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact ©2020 ESH CIRCUS ARTS Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://circusarts.com.au/group-bookings/corporate-groups/",
      "text": "Corporate Groups - Circus Arts Australia • Circus Arts closed 6 Oct 2025 6 Oct 2025 — Sundays & Public Holidays •  02 6685 6566  info@circusarts.com.au Customer Login Book Online Timetable MENU MENU HOME What's on Adults Adult Timetable Trampoline Aerials & Silks Handstands & Acrobatics Flying Trapeze (Kids/Teens/Adults) Self-Training Private Classes Kids & Teens Tiny Circus (1-5yrs) Aerials & Circus (5yrs +) Ninja & Parkour (5yrs +) Acro & Gymnastics (5yrs +) Trampoline (7yrs +) Flying Trapeze (Kids/Teens/Adults) Circus Homeschool Program (7yrs +) Kids & Teens Timetable Private Classes Climbing Wall (5yrs +) Play Space (0 - 10yrs) Prepaid Packs School Holidays Kids & Teens School Holiday Programs (5 - 16yrs) Flying Trapeze (Kids/Teens/Adults) Climbing Wall (5yrs +) Play Space (0 - 10yrs) GROUPS & PARTIES Corporate Groups Private Groups School Groups Vacation Care Byron Bay Party Packages Byron Venue Hire SPECIALISED COURSES Aerial Intensive Flying Trapeze Intensive Coach-in-Training Course Trampoline Coaching Course Aerial Coaching Course Flying Trapeze Coaching Course Free Online Performance Course CONTACT GROUPS & PARTIES BYRON BAY Corporate Groups Any successful manager understands the benefits of a cohesive team. A sense of unity and enthusiasm for a common goal results in increased efficiency, trust and satisfaction in the workplace. Enquire Online  Buy a Gift Voucher Valid for 3 years from purchase date.  Active & Creative Kids Vouchers Available for full day school holiday programs .  Circus Art Merch! Check out our Circus Arts training clothes. TEAM BUILDING activities – Byron Bay We have a variety of team building programs to choose from that will bring your team together in a real and effective way. Let us know what you need to achieve and we will tailor a workshop to meet your needs. Flying Fun - $750 Flying trapeze is the ideal way to bring a team together by challenging fears, breaking through barriers and encouraging peer support. Circus Arts’ experienced fly coaches will take your team through all the steps and teach you the correct technique to perform a trick and a catch. This 1.5 hours will bring your team together in a real and effective way and will be remembered for many years to come. Duration: 1.5 hours Package price is for up to 10 participants – $75 per additional participant – Ages 5 – Adults Ringmaster Special - $850 The session includes welcome and safety introduction, warm-up and skills rotations with the feature of the day being the high flying trapeze.  This exhilarating and unique experience is one that will bond a team and create shared memories for years to come! Teams will leave the Ringmaster Special with a renewed sense of camaraderie, achievement and equity. The program can be completed by people of any age and physical ability and we welcome the opportunity to tailor the program to suit the needs of each business. Duration: 2 hours Package price is for up to 10 participants – $85 per additional participant up to 300 participants – Ages 5 – Adults Enquire Online ENQUIRY FORM Name Email Address Phone Preferred Date/Time Number of Participants Message 9 + 8 = Submit Yes, keep me in the loop! Subscribe to our newsler to receive updates on new classes and activities. Use \"NEWS_SIGNUP\" when booking your class First Name Last Name Email Interests Interests Kids & Teens Circus Adult Circus Educators Subscribe It's never too late to run away with the Circus! ? Byron Bay Groups & Parties Specialised Courses News & Events Merch Circus Arts Follow Follow Follow Flying trapeze and circus classes in Australia since 1999. Experiences, classes and specialised courses for kids & teens, adults and groups – beginner to experienced. Adults Circus Classes Kids & Teens Circus Classes Party Packages School Holidays About Careers Ts & Cs Contact © Circus Arts 2025 Merch! Look the part at your next class. Adults and kids. Order Online Gift Vouchers For you or someone you care for. Valid for 3 years from purchase date. Buy now"
    },
    {
      "url": "https://circusarts.org/calendar/sailor-circus-holiday-shows/",
      "text": "Sailor Circus Holiday Shows - The Circus Arts Conservatory | Sarasota Link to Facebook Link to Youtube Link to Instagram Link to X Shopping Cart Shopping Cart 0 Shopping Cart Buy Tickets Learn Circus Sailor Circus Academy Recreational Classes Magnet Programs Circus Camps Gift Certificates Events Circus Arts Gala WONDERBALL Past Appearances & Events Community Appearances Plan Your Event Book Talent for Your Next Event Team Building and Classes Talent Booking and Venue Rental Community Outreach Arts-Integrated Education Program Circus Arts in Healthcare About Us Mission Staff Coaches Board Founders History Careers Support Us Donate Sailor Circus Arena Seat Naming Scholarship Appeal Diversity Funding Challenge Sailor Circus Alumni Volunteer Sponsorships Latest from CAC Press Releases Media Images Smithsonian Folklife Festival Contact Us Click to open the search input field Click to open the search input field Search Menu Menu « All Events This event has passed. Sailor Circus Holiday Shows December 27, 2023 @ 7:00 pm December 31, 2023 @ 9:00 pm 10 shows 11-12 acts (2:00 & 7:00pm, 1:00pm & 5:00pm on 31st) Details Start: December 27, 2023 @ 7:00 pm End: December 31, 2023 @ 9:00 pm Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Start: December 27, 2023 @ 7:00 pm End: December 31, 2023 @ 9:00 pm Event Navigation « A Brave New Wonderland A Brave New WonderlanD » Stay Connected Sign up for the CAC’s Newsletter which delivers – directly to your inbox – all the latest Circus Arts Conservatory news and specials. Sign Up Contact Us 941-355-9335 info@circusarts.org Box Office/Tickets Call (941) 355-9805 Click Here To Purchase Tickets Thanks to the Official Accommodations Sponsor of the Circus Arts Conservatory Thinking of staying in Sarasota in 2025? Book accommodations at Sun Outdoors! Circus ticket discounts are available. © All material on this site is copyright 1998-2025 by The Circus Arts Conservatory - a 501(c)3 Non-Profit Performing Arts Educational Organization. All information is subject to change without notice. - powered by Enfold WordPress Theme Link to Facebook Link to Youtube Link to Instagram Link to X Sailor Circus Academy Recreational Classes Circus Arts in Healthcare Circus Summer Camp Community Appearances Team Building and Classes Get Involved Community Outreach Contact Us Link to: A Brave New Wonderland Link to: A Brave New Wonderland A Brave New Wonderland Link to: A Brave New WonderlanD Link to: A Brave New WonderlanD A Brave New WonderlanD Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://www.heraldtribune.com/story/entertainment/arts/2024/11/23/circus-sarasota-founders-shift-to-new-roles-in-long-planned-change/76495789007/",
      "text": "Circus Sarasota founders shift to new roles in long-planned change Manatee Sheriff's office: Bradenton man killed in standoff with deputies News Sports Ticket Lifestyle Opinion Advertise Obituaries eNewspaper Legals ARTS Circus Arts Conservatory has new leader as founders step down Jay Handelman Sarasota Herald-Tribune As it prepares for the 75th-anniversary celebration of the Sailor Circus and its own 27th season of Circus Sarasota , the Circus Arts Conservatory is making a long-planned change in leadership. Jennifer Mitchell, who joined the organization in 2008 as a marketing and public relations coordinator and served the last 10 years as executive vice president and chief operating officer, has been promoted to president and CEO. Co-founders and artistic leaders Pedro Reis and Dolly Jacobs are moving into new roles while remaining active in the organization. Reis is now the production and artistry strategist and will produce the annual winter Circus Sarasota show that opens in February. He also is working on developing a circus festival in the area. Jacobs serves as vice president and will continue to work with Sailor Circus students and be a spokesperson for the organization and circus in general. The change also comes as Reis and Jacobs, who were married in 2007, move through divorce proceedings after 17 years of marriage. Mitchell said she couldn’t have had better mentors. “I trained and worked very closely with Pedro and Dolly. Dolly was a different type of mentor in terms of her heritage because of the kind of historical figure she is in the circus arts.” Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Jacobs was a popular aerial artist who performed for many years with Circus Sarasota after touring with Ringling Bros. and Barnum & Bailey Circus among other circus troupes internationally. She is the daughter of the late clown Lou Jacobs. In 2015 she became the first circus performer to receive the National Heritage Fellowship from the National Endowment for the Arts. Reis began performing circus acts, specializing in the flying trapeze in his native Cape Town, South Africa, created a flying act that toured Europe and performed for Ringling Bros. He also created the first circus school in South Africa. In 1994 Jacobs and Reis began performing together in an aerial act “On the Wings of Love” and in 1997 created the National Circus School of Performing Arts, which was later renamed Circus Sarasota. When the organization acquired the Sailor Circus in 2013, it was renamed the Circus Arts Conservatory. In addition to its big top tent shows, CAC offers a variety of educational programs, including Circus Science and the Marvelous, Miraculous Circus Machine.  In the last fiscal year, it presented 250 performances to 117,000 people and worked with 9,000 students at 45 schools in five counties. It also trained more than 120 year-round student circus athletes at its Sailor Circus Academy. The Sailor Circus 75th Anniversary Diamond Jubilee show runs Dec. 26-29 in the Sailor Circus Arena. Strengthening circus organization for the future “We want Pedro and Dolly to receive all the acknowledgments for the way they laid the foundation for this organization and now we’ll put pillars on top of that foundation and pass it on to the next generations,” Mitchell said. “They’re still with us and committed to putting those pillars up.” In a statement, board chair Shari Ashman described Mitchell as “a highly effective leader with proven ability to consistently position CAC for success as a rapidly-evolving organization.” Reis said her “passion and knowledge of the CAC’s business model, educational programming and community outreach is unsurpassed.” Mitchell, 47, said she doesn’t expect the transition to mean drastic changes for the organization. “This is an opportunity to embrace change and continue to steer CAC forward,” she said. “New leadership always brings new ideas, but I was bringing that to the founders over the last decade and we were doing that in a really successful way.” Circus Nation A look at Circus Sarasota at National Folklife Festival During Mitchell’s tenure, the organization acquired the Sailor Circus, the nation’s longest-operating and largest youth circus training program, and was expanded to become the Circus Arts Conservatory. The organization brought its big top and coordinated a circus showcase for the 2017 Smithsonian Folklife Festival on the National Mall in Washington, D.C., which had a focus on circus. Mitchell came to the organization after a year in the development department at Ringling College of Art and Design and 10 years leading the Miss America Teen organization. The circus world also has become more personal because her daughter Emma Clarke, who trained for 10 years with the Sailor Circus Academy, is now pursuing a professional circus career. She is performing this winter in Nik Wallenda’s “Wonderland Illuminate,” a holiday show presented with the Circus Arts Conservatory. Mitchell said she has been lucky that \"all my positions have not been jobs. They’ve been passion projects.” Seeing how her daughter found her own passion through the Sailor Circus “motivates me. I can share that with a lot of other children and our team can go out and do more of that. It’s personal.” The executive may not come from a multi-generational circus family, “but maybe I’m starting one. Someone has to be the first. It starts somewhere.” Follow Jay Handelman on Facebook , Instagram , and BlueSky . Contact him at jay.handelman@heraldtribune.com . And please support local journalism by subscribing to the Herald-Tribune . Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Licensing & Reprints Public Notices Help Center Subscriber Guide Manage Account Give Feedback Submit Community News Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.heraldtribune.com. All rights reserved."
    }
  ]
}