{
  "fuentes": [
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/golf/cocoa-beach-country-club/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.cityofcocoabeach.com/681/Course-Rates",
      "email": "golf@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/523/ClassesPrograms",
      "email": "carolyn.potter@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/488/Weddings-and-Receptions",
      "email": "hjohnson@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cocoabeach.com/contact/",
      "email": "customerservice@wctravel.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/779/Command-Staff",
      "email": "jversaggi@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/779/Command-Staff",
      "email": "kkuehn@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/779/Command-Staff",
      "email": "mhernandez@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/779/Command-Staff",
      "email": "wmullins@cityofcocoabeach.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "tim.tumulty@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "citycommission@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "jeremy.hutcherson@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "joshua.jackson@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "keith.capizzi@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "email": "skip.williams@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/413/Cocoa-Beach-Country-Club-A-Public-Facili",
      "email": "golf@cityofcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/526/Rentals-Fees",
      "email": "carolyn.potter@cityofcocoabeach.com"
    },
    {
      "url": "https://kayakcocoabeach.com/kayak-tour-locations/",
      "email": "info@kayakcocoabeach.com"
    },
    {
      "url": "https://www.cityofcocoabeach.com/413/Golf",
      "email": "golf@cityofcocoabeach.com"
    },
    {
      "url": "https://aquafreshpoolservice.com/contact/",
      "email": "dean@aquafreshpoolservice.com"
    }
  ],
  "mails": [
    "carolyn.potter@cityofcocoabeach.com",
    "chosen-sprite@2x.png",
    "citycommission@cityofcocoabeach.com",
    "contact@clubcarwash.com",
    "customerservice@wctravel.com",
    "dean@aquafreshpoolservice.com",
    "golf@cityofcocoabeach.com",
    "hjohnson@cityofcocoabeach.com",
    "info@kayakcocoabeach.com",
    "jeremy.hutcherson@cityofcocoabeach.com",
    "joshua.jackson@cityofcocoabeach.com",
    "jversaggi@cityofcocoabeach.com",
    "keith.capizzi@cityofcocoabeach.com",
    "kkuehn@cityofcocoabeach.com",
    "mhernandez@cityofcocoabeach.com",
    "skip.williams@cityofcocoabeach.com",
    "tim.tumulty@cityofcocoabeach.com",
    "wmullins@cityofcocoabeach.com"
  ],
  "nombre_sitio": "cityofcocoabeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/golf/cocoa-beach-country-club/",
      "text": "Cocoa Beach Country Club - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Cocoa Beach Country Club Add to Wishlist Cocoa Beach Country Club The City of Cocoa Beach operates this golf course that features 17 lakes on the property, as well as 1.7 miles of holes along the Banana River. The Cocoa Beach Country Club is a public facility welcoming both residents and guests. Offering three nine-hole courses – Dolphin, Lakes, and River Courses ‘ plan to hone your skills with the challenging greens and up to 50 sand bunkers per course. The Country Club also has an onsite restaurant, ‘The 19th Hole Restaurant,’ featuring a full bar, snacks, breakfast and lunch. Banquet Facilities are offered at reasonable prices for special gatherings and celebrations. Appropriate dress attire is required which means no tank tops or cutoff shirts. Discounts are available so check online or call ahead of your visit. Add to Trip Visit Website Direction 5000 Tom Warriner Blvd, Cocoa Beach, FL 32931 Contact 321-868-3351 Discover More nearCocoa Beach All Hotels Restaurants Events Add to Wishlist Juice N Java Cafe Cocoa Beach Sip into the season with a specialty coffee from Juice N Java Cafe. Add to Trip Add to Wishlist Coastal Market Cocoa Beach Cocoa Beach Fresh • Local • Coastal At Coastal Market, you’ll find everything from handcrafted deli sandwiches and fresh-baked pastries to fresh produce, premium meats, and specialty groceries. We even cater your gatherings with custom trays and menus. Stop by and taste why we’re Cocoa Beach’s favorite neighborhood market! Enjoy  1/2 Sandwich,… Add to Trip Add to Wishlist Fuji Yama THAI and sushi Cocoa Beach Lunch special starting at $12.95, name this ad get Asahi beer for only 5 bucks! Add to Trip Add to Wishlist Boardroom Cocoa Beach Located just steps away from main street, where you can enjoy our casual but trendy atmosphere. We offer the largest selection of boutique wines at the beach by both the glass and bottle; as well as craft, classics & local beer, seltzer and a variety of other beverages like house… Add to Trip Add to Wishlist 2georges oceanside bar & grill Cocoa Beach Enjoy a glass of house wine on us with any dinner purchase! Just minutes from the Cocoa Beach Pier and world-famous Ron Jon Surf Shop, 2georges oceanside bar & grill is a local favorite for fresh seafood, especially known for our world famous jumbo lump crab cakes. We also have… Add to Trip Add to Wishlist Cape Grill and Bar Cocoa Beach Come visit Cape Grill and Bar, the hidden jewel of Cape Canaveral, to try our made-from-scratch Prix Fixe lunch or dinner offerings! We are open to the public inside the Holiday Inn Club Vacations Resort. Both menus feature appetizers of house-made Crab Rangoon Flautas or Mozzarella Sticks, along with a… Add to Trip Add to Wishlist Rebellion Beachside Bar and Bistro Cocoa Beach Enjoy a revolving 4-course prix fixe menu for $45! We are excited to change up this menu as fresh, local ingredients become available! Here’s a sample of what may be available for your reservation! 1st Course: Crudo 2nd Course: Oyster Stew 3rd Course: Roasted Chicken with Mushrooms and Truffles OR… Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist Shark Tank Cocoa Beach Vacation Rentals Cocoa Beach Come to Shark Tank Vacation Rentals, your exclusive getaway just steps from downtown Cocoa Beach and the pristine shores of Florida’s Space Coast. Each unit in our newly renovated quadplex features two bedrooms, a bathroom, and a stylish blend of seaside charm and contemporary elegance. Spend your days surfing, relaxing… Add to Trip Add to Wishlist Space Coast Sights LLC Cocoa Beach Our family owned small business offers excursions that highlight Natural Florida (including hike options), a historic village with a waterfront park, and famous landmarks on sandy beaches. Visit coastal communities of Cocoa, Merritt Island, Cocoa Beach, and Cape Canaveral where dining, entertainment, wildlife, education, and relaxation await. Our sightseeing destinations… Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Kabob-a-licious Cocoa Beach Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a… Add to Trip Add to Wishlist Central Florida Kayaking Inc. Cocoa Beach Central Florida Kayaking offers guided kayak tours throughout Brevard County, including Merritt Island, Cocoa Beach, Melbourne, and other locations near Orlando. Kayaking tours explore the beauty of The Thousand Islands, mangrove tunnels, and the Indian River Lagoon. If you would like to see dolphins, manatees, and wild birds, or experience… Add to Trip Add to Wishlist Skull & Books VR Cocoa Beach Discover the Space Coast’s most unique adventure! Skull & Books VR combines the magic of a cozy used bookstore with the excitement of a cutting-edge VR arcade—all in one unforgettable destination. Whether you’re solving mysteries in an immersive VR escape room, battling alongside friends in multiplayer games, or just picking… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Email This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.cityofcocoabeach.com/681/Course-Rates",
      "text": "Course Rates | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Cocoa Beach Country Club A Public Facility Course Rates Course Rates Summer Rates - April 16, 2025 to September 30, 2025 Residents Rates Resident's Green Fees Everyday Riding 18 Holes before 12pm $37 Walking 18 Holes before 2pm $20 Riding 9 Holes before 2pm $21 Walking 9 Holes before 2pm $18 Resident Special noon to Close 18H with Cart $32 Residents Special noon to Close 9H with Cart $18 Walking 9 Holes after 2 pm $16 Unlimited Walking after 2 pm $20 Florida Residents Rate Florida Resident Green Fees Monday Through Thursday Friday-Sunday & Holidays Riding 18 Holes before 12pm $43 $48 Walking 18 Holes before 2pm $26 $29 Riding 9 Holes before 2pm $23 $26 Walking 9 Holes before 2pm $18 $20 Noon Special 18 Holes NOON-1:52pm $38 $42 Noon Special 9 Holes NOON-1:52pm $19 $21 Twilight 18 Holes after 2 pm $32 $40 Twilight 9 Holes after 2 pm $18 $20 Walking 9 Holes after 2 pm $16 $18 Unlimited Walking after 2 pm $20 $22 Non-Florida Residents Rate Non-Florida Resident Green Fees Monday Through Thursday Friday-Sunday & Holidays Riding 18 Holes before 2 pm $49 $52 Walking 18 Holes before 2 pm $32 $34 Riding 9 Holes before 2pm $26 $28 Walking 9 Holes before 2pm $18 $22 Noon Special 18 Holes NOON-1:52pm $44 $48 Noon Special 9 Holes NOON-1:52pm $22 $24 Twilight 18 Holes after 2 pm $32 $40 Twilight 9 Holes after 2 pm $18 $20 Walking 9 Holes after 2 pm $16 $18 Unlimited Walking after 2 pm $20 $22 Please Note: No Rain Checks after teeing off on the 10th hole for the Special. Tee times are required. You may call, or book online, up to 28 days in advance. Call the starter shack for same-day tee times (321) 868-3361. No walking before noon on the main course. Mobile Friendly PDF of Course Rates Other Fees Miscellaneous Rate Pull Carts per 9 Holes $3 Rental Clubs for 18 Holes $35 Upgraded Rental Clubs for 18 Holes $60 Rental Clubs for 9 Holes $20 Upgraded Clubs for 9 Holes $35 Driving Range Machine (includes tax) Small - $3 = 20+ Balls Medium - $5 = 40+ Balls Large - $7 = 65+ Balls Driving Range Hours Days Hours Monday & Tuesday 7:00 am to varies based on sunset Wednesday 7:00am-6:00pm (closing time varies Nov - Feb) Thursday 9:00 am to varies based on sunset Friday through Sunday 7:00 am to varies based on sunset Call the Pro Shop for the most recent range closing times Ball dispenser closes 30 min prior to range closure Hours of Operation Location Hours of Operation Phone Number Stater Shack 6:45 am to 6:00 pm 321-868-3361 Pro Shop 6:45 am to 6:30 pm 321-868-3351 Snack and Bar/Lounge 7:30am to 7:00pm 321-868-3354 Contact Us Golf Course 5000 Tom Warriner Blvd Cocoa Beach, FL 32931 Book a Tee Time Join our E-Club Email the Golf Course Email Disclaimer Pro Shop : 321-868-3351 Starter Shack: 321-868-3361 Pro Shop Manager: 321-868-3363 Golf Pro/Manager: 321-868-3352 Course Superintendent: 321-868-3282 19th Hole Phone: 321-868-3354 19th Hole Information Aquatic Center 4800 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-868-3314 Aquatic Center Information Tennis Club 4600 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-296-8182 Tennis Club Information Recreation Center 321 Ramp Road Cocoa Beach, FL 321931 Phone: 321-868-3274 Leisure Services Information Additional Information Accessibility Statement Public Records Request Police Records Request View All Links /QuickLinks.aspx 19th Hole Course Rates Leagues Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofcocoabeach.com/523/ClassesPrograms",
      "text": "Aquatic Center Classes | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Aquatic Center Aquatic Center Classes/Programs Aquatic Center Classes Water Aerobics *Schedule subject to change, please check Facebook Link for schedule updates* Tuesday: Deep Water Aqua-fit 11:00am Wednesday: Deep Water Aqua-Fit 11:00am Thursday: Deep Water Aqua-Fit 11:00am Friday: Deep Water Aqua-Fit 11:00am Swim Lessons The Cocoa Beach Aquatics Center offers swim lesson classes through the American Red Cross Learn to Swim program.  All classes are held at the Cocoa Beach Aquatic Center, March through August and are taught by certified Water Safety Instructors when available. Private swim lessons offered when instructors are available, please call the Aquatic Center at 321-868-3240. To view/register Private/Summer Group Swim Lessons, please visit the link Cocoa Beach RecDesk Programs For additional information on programs, contact the aquatic manager via email or by phone at 321-868-3327. Contact Us Aquatic Center Email the Aquatic Center Email Disclaimer 4800 Tom Warriner Boulevard P.O. Box 322430 Cocoa Beach, FL 32932-2430 Ph: 321-868-3240 Fx: 321-868-3246 Book a Lane You can now book a lane for lap swim online at: RecDesk Swim Lane Reservations NOTE: To cancel Lane Reservation please call 321-868-3240 Aquatic Center Classes/Programs Aquatic Center Fees & Rentals Aquatic Center Rules & Regulations Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofcocoabeach.com/488/Weddings-and-Receptions",
      "text": "Weddings, Receptions and Events | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Weddings and Receptions Weddings, Receptions and Events Cocoa Beach Leisure Services provide several locations that are available for rental for your special event. We strive to provide excellent customer service, by overseeing the outdoor special event permitting process and are here to help you through your planning process. Beach Wedding Ceremony Country Club Facilities City Facilities Beach Wedding Ceremony Thank you for choosing Cocoa Beach for your Beach Wedding Ceremony. Our City staff is here to answer questions and concerns. Your Wedding on the Beach Wedding Ceremony Location Cocoa Beach offers 6 miles of Atlantic Ocean Beaches. Looking for the right location for you? Let us suggest one of 3 oceanfront parks with restrooms and easy parking access: Alan Shepard Park Lori Wilson Park Sidney Fischer Park How to Apply for a Permit 50 Attendees or Less To start the process on a small intimate wedding of 50 people or less in attendance you fill out the Beach Wedding Ceremony Permit Form online. 51 and more Attendees If your wedding will be larger than 50 guests,  we do ask that you fill out the Special Events Application . This is a more detailed form but, provides the staff and public safety departments with the information required to ensure that the event runs smoothly. Permit Fee The Beach Ceremony Permit fee is $50. Application must be completed 30 days before the event. If you are mailing a check please send check to: City of Cocoa Beach 321 Ramp Road Cocoa Beach, FL 32931 For more information on Beach Wedding Ceremonies please contact the City Event Coordination Staff at 321-868-3252 or via email . Country Club Facilities Facilities The Cocoa Beach Country Club is a great option for your wedding or next event. We have hosted many weddings, civic events, and receptions. Our staff is excited to help make your special day one to remember! Cocoa Beach Country Club Auditorium 19th Hole Restaurant Rates The Cocoa Beach County Club rental rates include a City Staff member on-site during your event, selected space, and available tables and chairs. Room Rental Cocoa Beach Resident Non-Resident Clean-up & Damage Deposit Auditorium $1200 per day $1500 per day $300 Conference Room $75.00 per day - 2 hour minimum $150 per hour - 2 hour minimum $75 Dining Room per day $750 per day $1000per day $300 Dining Room per hour $200 per hour - 2 hour minimum $300 per hour - 2 hour minimum $300 River and Dolphin Room 1/2 Auditorium without Stage $550 per day $700 per day $225 Lakes Room 1/2 Auditorium with Stage $600 per day $750 per day $225 River and Dolphin Room 1/4 Auditorium without Stage $300 per day $500 per day $75 River Room $300 per day $500 per day $75 Patio $200 per hour - 2 hour minimum $300 per hour - 2 hour minimum $300 Dining Room and Patio $350 per hour - 2 hour minimum $500 per hour - 2 hour minimum $300 Rental Additions for Cocoa Beach Country Club Additions Rates Dance Floor $175 Cash Bar $125 Table Linens 1 for $15 10 or more for $12 Clean-up and Damage $200 Open Bar Available upon request For more information on Facility Rental please contact the City Event Coordination Staff at 321 868 -3355 or via email . Check out our wedding page here! City Facilities Cocoa Beach Community Room The Cocoa Beach Community Room is a versatile indoor space perfect for meetings, workshops, bridal and baby showers, and so much more. The room includes: Room capacity of 126 people 40 folding chairs & 10 five-foot tables included in price, you are welcome to bring outside vendors Refrigerator (no freezer) and a microwave Please note: The Community Room cannot be rented for events where items are sold or admissions is charged. Centennial Park Located in the heart of Cocoa Beach, Centennial Park offers a beautiful outdoor setting for community gatherings, celebrations, and family-friendly events. The park features: Open green space for games and casual seating Central Cocoa Beach location Easy access to downtown Cocoa Beach How to Reserve To check availability or reserve either space, please visit RecDesk Facilities and go to City Facilities. Community Room Rates - Residents Only Amount of Reservation Time Rate Hourly (2 hour minimum) $125 Half Day (4 hours) $350 Full Day (over 4 hours) $650 Deposit: 50% of Total Rental Rate Centennial Park Amount of Reservation Time Rate Resident - Hourly (2 hour minimum) $50 Non-Resident - Hourly (2 hour minimum) $200 Resident - Half Day (4 hours) $200 Non-Resident - Half Day (4 hours) $500 Resident - Full Day (8 hours) $300 Non-Resident - Full (8 hours) $1000 Add-ons: Stage - $100 Public Restroom Access - Non-Business Hours: $100 per hour 1 Bride and Groom on the fairway 2 Wedding party celebrating the newly married couple 3 Auditorium with wedding set up2 4 Wedding reception set up in Auditorium 5 Bridal party standing on a wooden bridge with the course behind them 6 Wedding party on stage with Ceremony set up 7 Sweetheart Table set up in the Auditorium Aquatic Center Aquatic Center Classes/Programs Aquatic Center Fees & Rentals Aquatic Center Rules & Regulations Cocoa Beach Country Club A Public Facility 19th Hole Course Rates Leagues Programs Frightful Fairway 5K (Fall Into Winter 5K) Pickleball Sports Venues Ball Fields Cocoa Beach SkatePark Offenhauser Recreation Center - Gym Tennis Club Parks Parks with Beach Access Neighborhood Parks Boat Ramps Parks with Tennis & Pickleball Courts Green Space Parks Maritime Hammock Preserve Dog Park Weddings and Receptions Special Events Beaches Beach Access Beach Parking Beach Rules Beach Safety Drown Zero Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cocoabeach.com/contact/",
      "text": "Get In Touch With Us . . . | CocoaBeach.com Facebook X Instagram Pinterest Cocoa Beach 81 ° light intensity drizzle humidity: 85% wind: 9mph N H 82 • L 81 83 ° Thu 83 ° Fri 82 ° Sat 82 ° Sun Weather from OpenWeatherMap stay Find the Perfect Hotel in the Cocoa Beach Area! play Outdoor Adventures At The Beach… Charter Fishing Nature & Eco-Tours Wind & Water Sports Golfing Area Attractions Arts & Culture Museums & Historic Sites Performance Theatres Health & Beauty Salons & Spas Tattoo Shops Shopping Surf & Skate Shops Apparel & Accessories Galleries, Gifts & Home Decor Shopping Malls Specialty Shops dine Area Restaurants Bars & Clubs events more MEDIA Photo Gallery Video Album COMMUNITY Relocation Guide Area Churches Our History TRAVEL TOOLS Airport, Bus & Train Info Driving Directions Search Get In Touch With Us . . . HOTEL BOOKINGS: For help or questions regarding online hotel reservations, e-mail customerservice@wctravel.com or call and speak with a customer care representative. Give Promo Code 15198 when calling. * Reservations Center Hours: Open 24 Hours a Day, 7 Days a Week * Customer Service is available Monday through Friday, 8 AM through 8 PM, CST * TOLL FREE 1-888-254-0637, USA and Canada * International Toll Free 00-800-84469370 or 1-210-507-5997 GENERAL COMMENTS AND QUESTIONS: CocoaBeach.Com is happy to assist you with any questions you may have, and we appreciate your valuable feedback about how we can serve you better. Feel free to ask a question, report an error on the site, or send your comments or suggestions about our site by filling out the following form. Your Name (required) Your Email (required) Your Message 12 - 7 = Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video File Upload Show menus, flyers, forms and more to your customers File Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly on front page Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video File Upload Show menus, flyers, forms and more to your customers File Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly on front page Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video Menu Upload Menu Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly in Featured Listings on front page! Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × X"
    },
    {
      "url": "https://www.cityofcocoabeach.com/779/Command-Staff",
      "text": "Command Staff | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Public Safety Police Command Staff Command Staff Photo Of Command Staff Information Wes Mullins Chief of Police Email: wmullins@cityofcocoabeach.com Phone: 321-868-3204 Kris Kuehn Deputy Chief Email: kkuehn@cityofcocoabeach.com Phone: 321-868-3261 Joe Versaggi Support Services Major Email: jversaggi@cityofcocoabeach.com Phone: 321-868-3203 The staff & administrative services major is responsible for: Communications Property & Evidence Records Recruiting Training Beach Rangers Parking Enforcement Manuel Hernandez Operations Major Email: mhernandez@cityofcocoabeach.com Phone: 321-868-3251 The operations major is responsible for: Criminal Investigations Division Marine Patrol Patrol School Resource Officers Motor Unit FAQs Command Staff Organizational Chart Accreditation Patrol Division Traffic Enforcement Parking Enforcement Beach Rangers Records Investigations Communications Community Relations Crime Prevention Security Surveys Private/Public Trespass Program Bicycle Registration Citizen's Academy Resources Awards & Recognitions Policies and Procedures Property / Evidence Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.cityofcocoabeach.com/555/City-Commission",
      "text": "City Commission | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government City Commission City Commission The City of Cocoa Beach has a City Commission - City Manager form of government, adopted by the citizens on June 19, 1958. The City Commission is the legislative branch of City Government and is responsible for enacting policy. The City Manager administers policy as the executive officer of the City. Five Commission members, one of which is the Mayor, are elected at large by the voters of Cocoa Beach to serve for a four-year term. The Mayor presides at all meetings and performs duties delegated to the Mayor by the City Charter and City Commission. The Vice-Mayor is elected yearly by the City Commission at the annual organizational meeting, held after an election. Meetings The first and third Thursday of each month, at 7:00 p.m. Held at Cocoa Beach Country Club, 5000 Tom Warriner Blvd, Cocoa Beach, FL 32931 Are open to the public. Agendas and Minutes Available on our meeting platform, Agenda and Minutes . Meet the Cocoa Beach City Commission Mayor Keith Capizzi, Seat 1 (Term expires November 2028) Email  Mayor Keith Capizzi Elected as Commissioner in 2022 for a two-year term, Keith Capizzi has been a resident of Cocoa Beach for over 30 years.  Per the City Charter Section 2,06, on August 23, 2023, Vice-Mayor Capizzi became Mayor due to the resignation of Mayor Ben Malik.  Mayor Capizzi has 21 years of machinist, metallurgy, and marine experience, while serving as a Merchant Marine, and working as an Engineer.  He owns a property management company, manages a Reggae Radio station, and a few Facebook pages. He considers himself a problem solver, and fiscally responsible.  He loves Cocoa Beach for the small town feel where anyone can go anywhere, and see someone they know.  Mayor Capizzi is a proud husband and father of one.  He attends Club Zion Church where his father is the pastor. Commissioner Joshua Jackson, Seat 2 (Term expires November 2028) Email Commissioner Joshua Jackson Appointed on September 6, 2023, to fill the remaining term of Seat 2, Joshua Jackson has been a resident of Cocoa Beach since 2018. Commissioner Jackson holds a Chemical Engineering degree from USC and a Master's in Engineering Management from GWU.  He has applied his education in program management for the Navy's Strategic Systems programs (SSP) Trident II D5 Missile System. He has also applied his education in IT Systems engineering, IT Operations Management and innovation mainstream for the National Geospatial-Intelligence Agency and Marine Corps. Cocoa Beach is his favorite place on earth. He understands that change is inevitable and knows the importance of making sure that they are the right kind of changes to keep Cocoa Beach healthy and vibrant.  Commissioner Jackson is a husband and father of two  sons.  His family and him attends Club Zion in Cocoa Beach. Commissioner Tim Tumulty, Seat 3 (Term expires November 2028) Email Commissioner Tim Tumulty Elected as Commissioner in 2024, Commissioner Skip Williams, Seat 4 (Term expires November 2026) Email Commissioner Skip Williams Elected as Commissioner in 2007, Skip Williams is originally from Indian River County, Florida and has been a resident of Cocoa Beach since 1986. He holds a Mechanical Engineering Degree from the Florida Institute of Technology and a Master’s Degree in Engineering Project Management from the University of Central Florida. Currently employed at NASA, he works in the Exploration Ground Systems Program. Commissioner Williams takes an active role in community programs, having served as the Chairperson of the Cocoa Beach Waterways and Wildlife Board, graduated from the Cocoa Beach Citizen’s Academy, and is a member of the Fire Department Community Emergency Response Team (CERT). His affiliations include: volunteering for Keep Brevard Beautiful and House of Hope; attends Calvary Chapel Merritt Island. Commissioner Jeremy Hutcherson, Seat 5 (Term expires November 2026) Email Commissioner Jeremy Hutcherson Elected as Commissioner in 2022, Jeremy Hutcherson is originally from Atlanta, Georgia, and began calling Cocoa Beach home in 2011.  He holds a Bachelor in Mechanical Engineering from Georgia Tech and a MBA from the University of Florida.  Jeremy has over 25 years of engineering and project management experience in military weapon system development, and is now a Project Engineer for a local aerospace defense contractor. He is affiliated with Project Management Institute, Indian River Flying Club and Aircraft Owners & Pilots Association. Jeremy is passionate about keeping Cocoa Beach a safe, family-friendly community and maintaining a healthy appreciation for our natural resources.  The Hutcherson family enjoy an active, outdoor lifestyle and are involved at The Pointe Church in Cocoa Beach. Contacting Our Commission Mailing Address: City of Cocoa Beach P.O. Box 322430 Cocoa Beach, Florida 32932-2430 Phone:  321-868-3201 Fax: 321-868-3226 Email all Commission Members Contact Us City Hall 2 S Orlando Ave P.O.Box 322430 Cocoa Beach, FL 32932-2430 Phone: 321-868-3200 City Directory Email Disclaimer Calendar Fri, Sep. 12 CB25 010 Cocoa Beach Golf Muck Capping Wed, Sep. 17 5:15 PM Board of Adjustment CANCELLED Thu, Sep. 18 Community Redevelopment Agency  Special Meeting View All Events /Calendar.aspx Additional Information Accessibility Statement Public Records Request Police Records Request View All Links /QuickLinks.aspx City Disclosures Public Notice Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofcocoabeach.com/413/Cocoa-Beach-Country-Club-A-Public-Facili",
      "text": "Cocoa Beach Country Club A Public Facility | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Cocoa Beach Country Club A Public Facility Cocoa Beach Country Club A Public Facility THIS WEEK'S GOLF COURSE UPDATE: NEW HEAD PRO / SHOP MGR Brent Naylor Brent started with us back in late April and we wanted to formally welcome him aboard.  Brent brings a ton of experience to us and will be a valuable asset as we continue to improve our facilities, programs and shop.  Brent's impact has already been felt with tournaments, course ideas and in the pro shop. The next time you are in, please introduce yourself to Brent and welcome him aboard! HOURS OF OPERATION Pro Shop 7:00 AM to 6:30 PM Hours are subject to change due to weather. Driving Range Opens: Friday - Wednesday 7:00am; Thursday 9:00am Closes: Thursday - Tuesday (varies due to sunset, times posted in Pro Shop weekly); Wednesday 6:00pm (due to the range needing to be clean picked) ball dispenser closes 30 minutes prior to the range closing Restrooms Course closes at dusk Clubhouse closes when the bar closes. 19th Hole Restaurant Hours Bar: 7:30 AM to 7:00 PM Kitchen: 11:00 am - 6:00 pm Monday - Thursday 11:00 am - 6:30 pm Friday 9:00 am - 6:30 pm Saturday 9:00 am - 6:00 pm Sunday The Cocoa Beach Country Club is a public facility, we welcome residents and guests to the area alike. The Course boasts three courses - Dolphin, Lakes, and River Courses - featuring 27 holes and 41-50 sand bunkers per course. If you're ready, you can book a Tee Time Online , or call the Starter Shack at 321-868-3361.  You cannot book same day tee times online, you must call the Starter for same day times. Reservations can be cancelled only by contacting the Pro Shop at 321-868-3351 Course Policies Mandatory carts on the Main Course before noon between December 15th and April 15th. Walking is allowed on the second and third courses during this timeframe. Dress code includes: Appropriate golf attire required.  Shirts must be worn at all times.  Beachwear, such as tank tops, muscle shirts, swimsuits (men and women), sport bras or cutoff shorts are not permitted. Discounts Available: Twilight Rates and Junior Discounts. Weather Policy Due to unforeseen weather issues, the golf course could be closed. Please call our main phone number ( 321-868-3351) and press #1 for up-to-the-minute course and driving range conditions.  Closing of the golf course may affect the operation of the 19th Hole restaurant. Shortened hours, according to activity, such as 9 AM to 2 PM or closing of the restaurant may occur after the course is closed. Best Location In The County The Cocoa Beach Country Club is located on a peninsula surrounded by the Banana River Lagoon at the western end on Minutemen Causeway in Cocoa Beach. The Course welcomes locals and visitors alike. Since the greens renovation project in 2009, we now have some of the best Paspalum greens in the county. There are three nine hole courses that provide an excellent variety for the recreational golfer. Attractive Habitats The Banana River and the seventeen lakes that are located on the golf course at the Cocoa Beach Country Club provide a habitat that attracts an abundance of waterfowl and other birds. The birds provide an enjoyable attraction for the golfers. Assigning a name to each golf hole is one of the oldest traditions in the game of golf. The Cocoa Beach Country Club has named each of its 27 golf holes after one of the predominant species of birds seen on the golf course. The granite tee signs portray the name of the bird for each golf hole. Wildlife The waterfowl, other birds, the dolphins, alligators, turtles and raccoons make the Cocoa Beach Country Club a true habitat and wildlife sanctuary for the enjoyment of all golfers. Course features include putting greens, a driving range and a \"19th hole\" where you can get a bite to eat, a beverage of your choice and reminisce over the great golf shots you just made! The CBCC also features banquet facilities at reasonable prices to host those special gatherings and celebrations. The 19th Hole Restaurant Begin or end your day on the course, or off, at the19th Hole Restaurant located in the Country Club, featuring a full bar, snacks, breakfast and lunch. For more information visit the 19th Hole Information Page . Golf Course Interactive Map Contact Us Golf Course 5000 Tom Warriner Blvd Cocoa Beach, FL 32931 Book a Tee Time Join our E-Club Email the Golf Course Email Disclaimer Pro Shop : 321-868-3351 Starter Shack: 321-868-3361 Pro Shop Manager: 321-868-3363 Golf Pro/Manager: 321-868-3352 Course Superintendent: 321-868-3282 19th Hole Phone: 321-868-3354 19th Hole Information Aquatic Center 4800 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-868-3314 Aquatic Center Information Tennis Club 4600 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-296-8182 Tennis Club Information Recreation Center 321 Ramp Road Cocoa Beach, FL 321931 Phone: 321-868-3274 Leisure Services Information Additional Information Accessibility Statement Public Records Request Police Records Request View All Links /QuickLinks.aspx 19th Hole Course Rates Leagues Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofcocoabeach.com/526/Rentals-Fees",
      "text": "Aquatic Center Fees & Rentals | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Aquatic Center Aquatic Center Fees & Rentals Aquatic Center Fees & Rentals Daily Admission Fees Guest Cocoa Beach Resident (Valid ID Required) Non-Resident Child $3 $5.50 Adult $4 $8.50 Pre-Paid Passes Type of Pass Cocoa Beach Resident (Valid ID Required) Non-Resident 30 Day Single Swimmer $40 $67.50 30 Day Additional Family Member $15 $27.50 90 Day Single Swimmer $75 $150 90 Day Additional Family Member $30 $65 One Year Single Swimmer $225 $510 One Year Additional Family Member $105 $237.50 In order to receive a Pre-paid pass you will have to fill out the Pre-Paid Application. To get application please visit the Aquatic Center or our online portal at RecDesk Pool Passes Pavilion Rental The Pool Pavilion is available for private, business, club or community parties - large or small. The pavilion may also be rented in conjunction with rental of the pool during regular pool operating hours at $4.50 per guest. For more information, call 321-868-3327. Pavilion Rental Rates Pavilion Rental Daily Cocoa Beach Resident $250 Non-Resident $410 Cocoa Beach Businesses $375 Non-Cocoa Beach Business $590 Swim Team Rentals Our pool facilities are also available to swimming clubs and high school, college and university swim teams looking for a facility to train or host competitive events. Visiting teams will also enjoy free time exploring our beaches, shops and area attractions. For more information, contact the Aquatic Manager at 321-868-3327. Concession Rental Fees The concession patio is available for party rental. For more information and reservations call, 321 868-3314 Concession Rental Per 2 Hours Deposit Required Cocoa Beach Resident $90 plus admission per guest $40 Refundable Fee (see below for details) Non-Resident $140 plus admission per guest $40 Refundable Fee (see below for details) DEPOSIT REQUIREMENT $40 - Refundable in 7-10 Business Days if area is left in good condition. Admission Fees are not to be taken out of the deposit. View the Facility and Amenities Contact Us Aquatic Center Email the Aquatic Center Email Disclaimer 4800 Tom Warriner Boulevard P.O. Box 322430 Cocoa Beach, FL 32932-2430 Ph: 321-868-3240 Fx: 321-868-3246 Book a Lane You can now book a lane for lap swim online at: RecDesk Swim Lane Reservations NOTE: To cancel Lane Reservation please call 321-868-3240 Aquatic Center Classes/Programs Aquatic Center Fees & Rentals Aquatic Center Rules & Regulations Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://kayakcocoabeach.com/kayak-tour-locations/",
      "text": "Adventure Kayak Tour Locations in Central Florida Home Kayak Tours Kayak Tour Locations The Best Kayak Tours Bioluminescence Kayaking Kayak Tour Reviews Kayaking Safety Tips Kayak Tour Gallery Things to Do Need Help? Contact Us Get Directions Call Us: (321) 480-8632 BOOK A KAYAK TOUR Kayaking Day Tour Night Kayaking Tour Select Page Kayak Tour Locations We offer day and night tours at locations throughout Central Brevard County, including locations in Cocoa Beach and Merritt Island. We also offer private tours from locations throughout Central Florida. If you are interested in a private or group tour, contact us now and we will help you plan the perfect kayak tour. Book a Tour Today Tour Locations We offer day and night kayak tours including full moon and bioluminescent tours from different locations depending on the season. Our daytime tours also depart from several locations in Central Florida including Merritt Island, Cocoa Beach, and Melbourne. Adventure Kayak of Cocoa Beach has offered the Best Guided Kayak Tours in Central Florida for Over 20 Years Our guided and eco-friendly kayak tours depart from locations throughout Brevard County and Central Florida. Ramp Road Park Cocoa Beach, Florida One of the best places to kayak in Cocoa Beach is the Thousand Islands at Ramp Road Park. Ramp Road Park provides paddlers with quick and easy access to the local estuarine eco-system of the Banana River Lagoon, where manatees, dolphins, and birds are abundant. Tour Details Get Directions Cocoa Beach Country Club Cocoa Beach, Florida The Thousand Islands at the Cocoa Beach Country Club are just another aspect of the local estuarine system of the Banana River Lagoon in Central Florida’s Space Coast. Manatees, dolphins, and birds can be found in abundance, when in season. Tour Details Get Directions Bioluminescent Kayak Tours Cocoa Beach, Florida Experience the wonder of a Florida bioluminescence kayaking tour, typically available during the warm summer months from May to October. Contact us if you would like to know more about this tour. Tour Details Get Directions Honest John’s Fish Camp Melbourne Beach, Florida Specialty Tour for Groups of 8 to 40 Guests Tour Time: 3.5-4 Hours. Honest John’s is 10 Miles South of Melbourne Beach and 5 Miles North of Sebastian Inlet of SR A1A. Enjoy Bird Watching and Kayaking with Manatee and Dolphin. Tour Details Get Directions Turkey Creek Sanctuary Palm Bay, Florida Turkey Creek- Specialty Tour for Groups of 8 to 40 Guests Tour Time: 3.5-4 Hours. Turkey Creek is part of the Brevard County Environmentally Endangered Lands (EEL) program as well as the East Florida section of the Great Florida Birding Trail. Tour Details Get Directions Kiwanis Island Park Merritt Island, Florida WE NO LONGER LAUNCH FROM THIS LOCATION! BIOLUMINESCENT KAYAKING TOURS are seasonal! Please call Bill at 321-480-8632 for availability at other locations. Kiwanis Island Park is a protected area located in Brevard County. Looking for things to do after the sun sets? Kayaking in Kiwanis Island is great for moonlight paddling. Get Directions Google Reviews – What People are Saying About Us Went for our fourth adventure this week. This time with Dale. Saw plenty of wildlife and great conversation throughout our tour. Dale was AWESOME. Tammy H. We had Ashley as a guide and she was great!!! Very personable and knowledgeable about the whole ecosystem there. No rush, very informative, and a great experience!! Paulina Guides on this 2 hour kayak trip are the best. Very knowledgable and very friendly. It’s like going on a safari in the water! Don N. Let’s Go Kayaking! We offer guided kayak tours throughout Central Florida’s Space Coast for all ages, seven days a week, year-round! Most people that go on our tours have never kayaked before. You can paddle with manatees in Florida, dolphins, various birds, and other wildlife. Unfortunately, most tourists never see the natural side of Cocoa Beach, just minutes from all the resorts, but now that you are here, you can go on a guided kayak tour.  Excellent Rates We offer great prices on daytime, nightime, and other popular kayaking tours. Special rates are listed here from time to time, so bookmark this page.  Flexible Times & Dates We offer flexible times and dates for your convenience. We even offer private tours for groups meeting our minimum size requirement.  Multiple Locations Kayaking tours are available throughout Central Florida, including Cocoa Beach, Merritt Island, and Brevard County, Florida.  People Love Our Tours People from around the world have joined us, and we have many 5-star reviews on Google and Trip Advisor. Faqs Z Night Tours Comfortable Kayaks Z Private Tours Call Us for Details Z Group Tours Call Us at 321-480-8632 Let's Talk About Kayak Tours! Name Email Address Phone Number Message Subject Message 11 + 3 = Send Email  info@kayakcocoabeach.com  +1 (321) 480-8632  Cocoa Beach, Florida Join us on one of our guided Cocoa Beach kayak tours for a memorable adventure through the Indian River Lagoon, home to dolphins, manatees, and diverse bird species. KAYAK TOURS Kayaking Day Tour Night Kayaking Tour Book a Kayak Tour QUICK LINKS Contact Us About Us Kayaking Blog Photo Gallery Bioluminescence Florida Site Map WEBSITE POLICIES Tour Faqs & Support Refund Policy Privacy Policy Terms of Use Kayak Tour Locations Cocoa Beach Country Club Ramp Road Park PRIVATE TOURS Honest John’s Fish Camp Turkey Creek Sanctuary Things to Do in Cocoa Beach Things to Do in Cocoa Beach with Your Children Activities Cocoa Beach Residents Recommend Top Nightlife Activities in Cocoa Beach Florida Vacation Ideas Fun Things to Do in Florida Places to Stay in Cocoa Beach The Best Kayak Tours in Cocoa Beach COCOA BEACH, FLORIDA Cocoa Beach Parks Cocoa Beach Restaurants & Bars Cocoa Beach Scenery Photos Cocoa Beach Wild Birds Photos Cocoa Beach, Florida Kayaking Safety Tips Cocoa Beach’s Thousand Islands © by Adventure Kayak of Cocoa Beach | Cocoa Beach Kayak Tours – All rights reserved. – Designed by: MyIslandDesigns.com Follow Follow Follow Follow Follow Follow  Call  email  Home R Book"
    },
    {
      "url": "https://www.cityofcocoabeach.com/413/Golf",
      "text": "Cocoa Beach Country Club A Public Facility | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Cocoa Beach Country Club A Public Facility Cocoa Beach Country Club A Public Facility THIS WEEK'S GOLF COURSE UPDATE: NEW HEAD PRO / SHOP MGR Brent Naylor Brent started with us back in late April and we wanted to formally welcome him aboard.  Brent brings a ton of experience to us and will be a valuable asset as we continue to improve our facilities, programs and shop.  Brent's impact has already been felt with tournaments, course ideas and in the pro shop. The next time you are in, please introduce yourself to Brent and welcome him aboard! HOURS OF OPERATION Pro Shop 7:00 AM to 6:30 PM Hours are subject to change due to weather. Driving Range Opens: Friday - Wednesday 7:00am; Thursday 9:00am Closes: Thursday - Tuesday (varies due to sunset, times posted in Pro Shop weekly); Wednesday 6:00pm (due to the range needing to be clean picked) ball dispenser closes 30 minutes prior to the range closing Restrooms Course closes at dusk Clubhouse closes when the bar closes. 19th Hole Restaurant Hours Bar: 7:30 AM to 7:00 PM Kitchen: 11:00 am - 6:00 pm Monday - Thursday 11:00 am - 6:30 pm Friday 9:00 am - 6:30 pm Saturday 9:00 am - 6:00 pm Sunday The Cocoa Beach Country Club is a public facility, we welcome residents and guests to the area alike. The Course boasts three courses - Dolphin, Lakes, and River Courses - featuring 27 holes and 41-50 sand bunkers per course. If you're ready, you can book a Tee Time Online , or call the Starter Shack at 321-868-3361.  You cannot book same day tee times online, you must call the Starter for same day times. Reservations can be cancelled only by contacting the Pro Shop at 321-868-3351 Course Policies Mandatory carts on the Main Course before noon between December 15th and April 15th. Walking is allowed on the second and third courses during this timeframe. Dress code includes: Appropriate golf attire required.  Shirts must be worn at all times.  Beachwear, such as tank tops, muscle shirts, swimsuits (men and women), sport bras or cutoff shorts are not permitted. Discounts Available: Twilight Rates and Junior Discounts. Weather Policy Due to unforeseen weather issues, the golf course could be closed. Please call our main phone number ( 321-868-3351) and press #1 for up-to-the-minute course and driving range conditions.  Closing of the golf course may affect the operation of the 19th Hole restaurant. Shortened hours, according to activity, such as 9 AM to 2 PM or closing of the restaurant may occur after the course is closed. Best Location In The County The Cocoa Beach Country Club is located on a peninsula surrounded by the Banana River Lagoon at the western end on Minutemen Causeway in Cocoa Beach. The Course welcomes locals and visitors alike. Since the greens renovation project in 2009, we now have some of the best Paspalum greens in the county. There are three nine hole courses that provide an excellent variety for the recreational golfer. Attractive Habitats The Banana River and the seventeen lakes that are located on the golf course at the Cocoa Beach Country Club provide a habitat that attracts an abundance of waterfowl and other birds. The birds provide an enjoyable attraction for the golfers. Assigning a name to each golf hole is one of the oldest traditions in the game of golf. The Cocoa Beach Country Club has named each of its 27 golf holes after one of the predominant species of birds seen on the golf course. The granite tee signs portray the name of the bird for each golf hole. Wildlife The waterfowl, other birds, the dolphins, alligators, turtles and raccoons make the Cocoa Beach Country Club a true habitat and wildlife sanctuary for the enjoyment of all golfers. Course features include putting greens, a driving range and a \"19th hole\" where you can get a bite to eat, a beverage of your choice and reminisce over the great golf shots you just made! The CBCC also features banquet facilities at reasonable prices to host those special gatherings and celebrations. The 19th Hole Restaurant Begin or end your day on the course, or off, at the19th Hole Restaurant located in the Country Club, featuring a full bar, snacks, breakfast and lunch. For more information visit the 19th Hole Information Page . Golf Course Interactive Map Contact Us Golf Course 5000 Tom Warriner Blvd Cocoa Beach, FL 32931 Book a Tee Time Join our E-Club Email the Golf Course Email Disclaimer Pro Shop : 321-868-3351 Starter Shack: 321-868-3361 Pro Shop Manager: 321-868-3363 Golf Pro/Manager: 321-868-3352 Course Superintendent: 321-868-3282 19th Hole Phone: 321-868-3354 19th Hole Information Aquatic Center 4800 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-868-3314 Aquatic Center Information Tennis Club 4600 Tom Warriner Blvd Cocoa Beach, FL 32931 Phone: 321-296-8182 Tennis Club Information Recreation Center 321 Ramp Road Cocoa Beach, FL 321931 Phone: 321-868-3274 Leisure Services Information Additional Information Accessibility Statement Public Records Request Police Records Request View All Links /QuickLinks.aspx 19th Hole Course Rates Leagues Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://aquafreshpoolservice.com/contact/",
      "text": "Get in Touch for Premier Pool Services | Cocoa Beach, FL | Aqua Fresh Pool Service of Viera LLC Skip to content Menu Menu Home Services Products Gallery Contact Connect with Aqua Fresh, Your Pool's Perfect Partner A Call or Click Away Ready to take the plunge with Aqua Fresh Pool Service? Contact us now for top-tier pool care. Whether you need cleaning, repair, or expert advice, our team is just a call or click away. 321-863-5759 Days and Hours of Operation Monday-Sunday from 8:30 a.m. to 6:00 p.m. Service Areas: Viera, Rockledge, Merritt Island, Cape Canaveral, Cocoa Beach, Satellite Beach, Indian Harbor Beach, Indialantic, Melbourne, West Melbourne, Brevard County FL Contact Form Contact Us How can we help you? Name (Required) First Last Email (Required) Your Message CAPTCHA Ready for a Pool Makeover? Connect with Aqua Fresh Pool Service Today! Reach out to us for top-notch pool services in Melbourne, FL. Your pool's transformation awaits! Contact Us 1427 Donegal Drive. Melbourne, FL 32940 (321) 863-5759 dean@aquafreshpoolservice.com © 2025 - All Rights Reserved - Privacy Policy Website Design & Marketing by OMG National"
    }
  ]
}