{
  "fuentes": [
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "aunderwood@cityofsafetyharbor.com"
    },
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "bpedroza@cityofsafetyharbor.com"
    },
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "dspano@cityofsafetyharbor.com"
    },
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "lkothe@cityofsafetyharbor.com"
    },
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "mcyr@cityofsafetyharbor.com"
    },
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "email": "shplref@cityofsafetyharbor.com"
    },
    {
      "url": "https://childrensharbor.org/events-all/",
      "email": "echafin@childrensharbor.org"
    },
    {
      "url": "https://childrensharbor.org/events-all/",
      "email": "tiffanidhooge@childrensharbor.org"
    },
    {
      "url": "https://www.harborcourthotel.com/contact/",
      "email": "reservations@harborcourthotel.com"
    },
    {
      "url": "https://www.harborcourthotel.com/contact/",
      "email": "springboard@thepointpr.com"
    },
    {
      "url": "https://safeharborshelter.com/contact/",
      "email": "info@safeharborshelter.com"
    },
    {
      "url": "https://safeharborshelter.com/contact/",
      "email": "mary@safeharborshelter.com"
    },
    {
      "url": "https://safeharborshelter.com/contact/",
      "email": "someone@website.com"
    },
    {
      "url": "https://www.safetyharborspa.com/about-us",
      "email": "reservations@safetyharborresort.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "info@harborclub.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "u003einfo@harborclub.com"
    },
    {
      "url": "https://www.tampabay.com/archive/2011/12/04/safety-harbor-manager-leaving/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "acampbell@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "alin@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "anarang@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "cchappell@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "cmerfeld@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "info@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "jchristo@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "jdailey@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "jgarcia@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "jmeakem@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "jpalmer@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "kmustafawidberg@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "lgreenberg-nielsen@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "lorel@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "nmills@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "npioppi@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "ptran@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "rshoer@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "rsmerling@bostonharbornow.org"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "email": "sarahj@bostonharbornow.org"
    },
    {
      "url": "https://www.thetidesmarket.com/contact",
      "email": "info@thetidesmarket.com"
    },
    {
      "url": "https://business.safetyharborchamber.com/events",
      "email": "info@safetyharborchamber.com"
    },
    {
      "url": "https://harbordish.org/events/list/",
      "email": "harbordish@harbordish.org"
    },
    {
      "url": "http://www.cityofsafetyharbor.com/594/Get-Involved",
      "email": "dmack@cityofsafetyharbor.com"
    }
  ],
  "mails": [
    "acampbell@bostonharbornow.org",
    "alin@bostonharbornow.org",
    "anarang@bostonharbornow.org",
    "aunderwood@cityofsafetyharbor.com",
    "bpedroza@cityofsafetyharbor.com",
    "cchappell@bostonharbornow.org",
    "cmerfeld@bostonharbornow.org",
    "dmack@cityofsafetyharbor.com",
    "dspano@cityofsafetyharbor.com",
    "echafin@childrensharbor.org",
    "harbordish@harbordish.org",
    "info@bostonharbornow.org",
    "info@harborclub.com",
    "info@safeharborshelter.com",
    "info@safetyharborchamber.com",
    "info@thetidesmarket.com",
    "jchristo@bostonharbornow.org",
    "jdailey@bostonharbornow.org",
    "jgarcia@bostonharbornow.org",
    "jmeakem@bostonharbornow.org",
    "jpalmer@bostonharbornow.org",
    "kmustafawidberg@bostonharbornow.org",
    "lgreenberg-nielsen@bostonharbornow.org",
    "licensing@zumapress.com",
    "lkothe@cityofsafetyharbor.com",
    "lorel@bostonharbornow.org",
    "mary@safeharborshelter.com",
    "mcyr@cityofsafetyharbor.com",
    "nmills@bostonharbornow.org",
    "npioppi@bostonharbornow.org",
    "ptran@bostonharbornow.org",
    "reservations@harborcourthotel.com",
    "reservations@safetyharborresort.com",
    "rshoer@bostonharbornow.org",
    "rsmerling@bostonharbornow.org",
    "sarahj@bostonharbornow.org",
    "shplref@cityofsafetyharbor.com",
    "someone@website.com",
    "springboard@thepointpr.com",
    "tiffanidhooge@childrensharbor.org",
    "u003einfo@harborclub.com"
  ],
  "nombre_sitio": "cityofsafetyharbor.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://cityofsafetyharbor.com/865/Contact-Us",
      "text": "Contact The Library | Safety Harbor FL - Official Website Skip to Main Content About Events & Programs E-Library Services How Do I... Catalog Search Site Search Catalog Search Site Search Search Home Departments Library About Contact The Library Contact The Library For general library-related inquiries, please email us at shplref@cityofsafetyharbor.com or call 727-724-1525. To submit a library comment or let us know how we're doing, use the comment form . Staff Contacts Library Director Lisa Kothe 727-724-1525 x4106 lkothe@cityofsafetyharbor.com Circulation Manager Breanne Pedroza 727-724-1525 x4117 bpedroza@cityofsafetyharbor.com Adult Services Manager Mallory Cyr 727-724-1525 x4102 mcyr@cityofsafetyharbor.com Youth Services Manager Anastasia Underwood 727-724-1525 x4104 aunderwood@cityofsafetyharbor.com Outreach Services Librarian Desiree Spano 727-724-1525 x4107 dspano@cityofsafetyharbor.com Hours Mission Location Policies Circulation Policy Collection Development Policy Computer Use & Wireless Internet Policy Copyright Policy Display Policy Interlibrary Loan Policy Meeting & Study Room Policy Patron Code of Conduct Photography Policy Test Proctoring Policy Unattended Children Policy Wi-Fi Hotspot Policy Contact The Library My Account Reserve a Room Events Calendar Download & Stream Tool Library Contact Us Safety Harbor Public Library 101 2nd Street North Safety Harbor, FL 34695 shplref@cityofsafetyharbor.com Phone: 727-724-1525 Library Hours Monday - Thursday: 9:30am - 8:00pm Friday: 9:30am - 6:00pm Saturday: 9:30am - 5:00pm Sign Up For E-News Site Links Home Site Map Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://childrensharbor.org/events-all/",
      "text": "Events | Children’s Harbor 954.252.3072 Give Now Who We Are Open menu Annual Reports Leadership Board Of Directors What We Do Open menu Family Homes Family Strengthening Maternity Homes Independent Living Programs MOMs Matter Success Stories What’s New? Open menu Podcast Events News & Blogs Career Opportunities Give Now Events Safe Harbor Society June Mixer Connect & Conquer Safe Harbor Society August Mixer Halloween Harbor Night Accelerate MAI-KAI & Mingle Harbor Lights Classic REVVED a car show for a cause The Memorial Healthcare Career Day Expo 12th Annual Harbor Lights Gala Safe Harbor Society Mixer MAI-KAI & Mingle Harbor Lights Classic REVVED a car show for a cause WHO WE ARE LEADERSHIP EVENTS NEWS WHAT WE DO WAYS TO HELP SUCCESS STORIES CONTACT US 19410 SW 58th Place, Pembroke Pines, FL 33332 954.252.3072 Lauren Bernheim As a seasoned entrepreneur with several thriving businesses in the law, technology, and consulting industries, Lauren Bernheim brings an unparalleled level of perspective, expertise, and professionalism to each initiative she leads. After learning about the profound impacts of traumatic brain injury on mental health, Lauren became passionate about mental healthcare. With a results-driven approach and an unwavering commitment to excellence, Lauren was determined to bring advanced treatment solutions to the market. She soon discovered Transcranial Magnetic Stimulation (TMS) therapy, a groundbreaking advancement in the treatment of depression and other severe mental health conditions. Drawing upon her decades of business success, Lauren embarked on a journey to establish a TMS practice that would redefine the standard of mental healthcare. She began by investing in the most advanced TMS device on the market, one that boasts the most precise treatment capabilities and leads the industry in delivering optimized results with an unsurpassed level of comfort and safety. Beyond clinical objectives, Lauren is committed to delivering a first-class and exceptional patient experience from start to finish. From the elegantly appointed office to the carefully curated team members and the comprehensive treatment process, every detail has been meticulously planned to deliver an unparalleled patient experience—one that Lauren intends to bring to struggling patients nationwide. https://www.neurohealthtreatment.com/ View Profile × Spencer Collum Partnership Advisor at FTL United FC, a professional football club. Spencer brings the club-level perspective on what really matters when it comes to youth development. Dedicated to growing FTL United FC’s corporate sponsorships with strategic initiatives to educate, inspire, and create win-win partnerships. Additionally, working with the team to enhance season ticket holder value and ticket sales. 20+ years of experience working with small and large healthcare-based technology companies. Roles varied across marketing, sales, operations, and managerial positions. Worked in a number of healthcare industries such as health system/provider care, health insurance/actuarial modeling, and fintech/patient financing. https://www.ftlutd.com/ View Profile × Dirk Stephens Longtime football coach and seasoned sales pro. I’ve been mentoring high school athletes for over two decades and have seen it all—from hype to heartbreak. Born and raised in Salt Lake City, Utah, I’m the oldest of four brothers—all of us growing up immersed in sports. That early love for athletics set the tone for a lifelong involvement in football, both on and off the field. I began coaching in 1996, just a year after graduating high school, starting with my youngest brother’s team. Since then, I’ve coached youth and high school football for over two decades, working with players aged 12 through high school. My coaching journey included 11 rewarding years at American Fork High School, followed by a memorable season at Lone Peak High School, where I was part of the coaching staff that won the 2011 State Championship. While coaching was a passion, sales was my profession. I’ve worked in sales most of my life, and the flexibility it offered—when goals were met—allowed me to remain on the sidelines for many years. In 2020, my wife Jo and I took on a new challenge by purchasing Law Firm Sites, a digital marketing company specializing in web development and online services for law firms. This exciting venture eventually pulled me away from coaching full-time, but I remain actively involved with the local football program—attending games, helping with media, and supporting team websites whenever I can. https://lawfirmsites.com/ View Profile × Debra Lage Partner, Client Relationship Manager, Sr. Strategy Consultant / Client Solutions Leader Florida Extender | Mercer A child needs a place to feel loved and safe in an environment that provides guidance and the tools to help them continue to grow regardless of the experiences and tragedies they have endured. Children’s Harbor is that place. I am privileged and honored to be part of such an amazing organization. View Profile × Rebecca Thompson Rebecca Thompson was elected to the School Board of Broward County in November 2024 to represent District 2 which includes Pembroke Pines, Miramar, Southwest Ranches, and parts of Davie and Cooper City. With over a decade of experience in community social work and a Master of Social Work from Virginia Commonwealth University, she is the first social worker on the School Board. She has worked in various settings, including as a school social worker for Broward County schools, a residential counselor at an emergency teen shelter, and Program Director for a parenting program. Ms. Thompson is a mom to three young Broward students and a resident of Pembroke Pines. She is dedicated to improving the district’s mental health system, supporting schools, and providing A-rated services to students and families. View Profile × Mike Hernandez Vice Mayor Vice Mayor Hernández has over 20 years of experience in the fields of Communication and Public Affairs. He has spent parts of his career working as a senior executive in government and as a c-suite consultant in the private and non-profit sectors. For four years, Hernández was the Director of Communications for Miami-Dade County government and Senior Advisor to its mayor. In that role, Hernandez led communication efforts for Miami International Airport and Port Miami, as well as the water & sewer and emergency management departments. He was the mayor’s only official spokesperson and chief communications officer for the 25-department government and managed crises such as the impact of Hurricane Irma and the outbreak of the Zika virus. From 2019-2024, he appeared on NBC 6 and Telemundo 51 as the political analyst for both stations, providing commentary and information on the political process in Washington, D.C., Tallahassee, and South Florida for viewers in English and Spanish. Earlier in his career, Hernández worked as a consultant to heads of state, presidential and congressional candidates, political parties and organizations in the United States and 10 other countries throughout Latin America, the Caribbean and the Middle East while a Senior Director at Washington, D.C. based Penn Schoen Berland, a global research consultancy. A 15-year resident of Pembroke Pines, Hernández is married to the former Christine Cento. They have two children who attend local public schools. Originally from Miami and born to Cuban-American parents, Hernández is a proud graduate of Florida International University (FIU) where he earned two degrees — a Master’s in Public Administration and Bachelor’s Degree in Political Science. He has served as the president of the university’s 300,000-member alumni association and is currently an adjunct professor for the School of International & Public Affairs and College of Communication. Hernández also serves as a member of the Board of Directors for the economic development nonprofit organization Prospera in Orlando. https://www.ppines.com/161/Vice-Mayor-Michael-Hernandez View Profile × Emmanuella Jean Jacques I have always believed in the importance in advocacy and seen how having someone in your corner makes all the difference. Children’s Harbor is the place where I want to be an advocate and it is these children’s voices I want to make sure are heard above the rest. View Profile × Karen Ross Partner, Accountant, and Enrolled Agent | Palermo Landsman & Ross P.A. What is happening at Children’s Harbor is so much bigger than me; serving among some of the most compassionate board of directors in the community is just one way to change the lives of our youth who’ve been impacted by trauma. View Profile × Victoria Tuffy Chief Human Resources Officer / Community Care Plan Before starting my career in human resources, I worked with troubled children and adolescents, a role that instilled in me a deep passion for helping young people heal and flourish. I joined the board of Children’s Harbor because I believe every child deserves a safe, nurturing environment where they can grow and thrive. I am committed to supporting their mission to strengthen families and give children the opportunity to build bright, hopeful futures. View Profile × Kelley Maple, APRN, FNP-BC Kelley Maple is a board-certified Family Nurse Practitioner and the founder of The KM Health Collective, a platform dedicated to helping women feel strong, confident, and connected to their bodies through every stage of life. Known for her honest, compassionate approach, Kelley specializes in hormone health, regenerative medicine, and aesthetic care—guiding her patients through physical changes with science-backed strategies and heart-centered education. With more than a decade of clinical experience, Kelley is passionate about changing the conversation around body image, health, and aging. She is the Co-Founder and Chief Medical Officer of Medical Anti-Aging, a leading clinic in South Florida, and is a proud advocate for personalized care that meets people where they are—at any age or stage. Outside the clinic, Kelley is a mom, daughter, a friend, an athlete, a Women’s Health Ambassador for a personalized nutrition company and a passionate advocate for empowering women to reclaim their health and self-worth. Her work is deeply informed by her own journey and a belief that when people feel good in their bodies, they show up more fully in every part of life. https://medicalantiaging.com/ View Profile × Alex Ayodele Alex Ayodele is the CEO and Founder of Balcony People, a premium wellness concierge dedicated to detoxing the body, home, and lifestyle. A former track athlete at the University of Colorado, Alex has always been passionate about holistic health and wellness—both on and off the field. She began her career as a licensed esthetician and natural beauty expert, specializing in problematic skin, where she discovered the deep connection between skin health and gut health. Feeling called to a greater purpose, Alex transitioned from the beauty industry to become a licensed integrative nutrition health coach through the Institute of Integrative Nutrition. Today, she helps clients detox their bodies, lives, and lifestyles while guiding them in cultivating sacred, sustainable self-care practices. With a heart-centered approach, Alex empowers individuals to understand who they are, meet their unique needs, and overcome the obstacles that block their growth. Through Balcony People, she is creating a movement rooted in restoration, self-discipline, and holistic transformation. https://www.balconypeople.com/ View Profile × Ryan Winker As a Commercial Relationship Manager at City National Bank, Ryan Winker partners with privately held businesses to provide strategic financial guidance and tailored banking solutions. With a deep understanding of the challenges facing middle-market companies, Ryan specializes in helping clients optimize cash flow, access capital for growth, and streamline treasury operations. He works closely with business owners and executives across all industries to deliver a high-touch, relationship-driven banking experience. Known for his responsiveness, industry insight, and long-term approach, Ryan is a trusted advisor who aligns each client’s banking strategy with their broader business goals. Outside of work, Ryan enjoys spending time with his family, playing hockey, hitting the golf course, and catching a baseball game. Whether on the ice, the green, or in the stands, he values the camaraderie and connection these passions bring – both personally and professionally. He believes the best relationships are built on trust, shared values, and a genuine interest in helping others succeed. View Profile × Erik Chafin Erik Chafin is the Chief Development Officer at Children’s Harbor, where he leads strategic fundraising efforts to support teens and young adults impacted by trauma. Outside of the office, Erik is a proud dad to three teenagers, which means he’s no stranger to late-night talks, last-minute schedule changes, and the occasional group chat meltdown. Whether he’s leading a major philanthropic initiative or navigating the ever-evolving world of parenting, Erik shows up with strategy, heart, and a sense of humor that keeps it all grounded. EMAIL Chafin: echafin@childrensharbor.org View Profile × Tiffani Dhooge Tiffani Dhooge is the President & CEO of Children’s Harbor, a nationally recognized child welfare organization serving teens in foster care. As an award-winning advocate with over 25 years in the field, she’s spent the last eight fighting for the kids the system forgot. An Army mom and brand-new grandmother, Tiffani brings expert advice, hard-won strategies, and a whole lot of tenacity to the chaos of parenting teens. EMAIL Tiffani: tiffanidhooge@childrensharbor.org View Profile × Stephanie Parker Stephanie Parker serves as president of South Florida’s Condo-HOA Division. Stephanie joined FirstService Residential as vice president of strategy and operations in the South region in 2014. She then served as vice president of operations at a national level, with the oversight and efficient execution of major company initiatives, including the customer experience, process improvement, property operations and national procurement. Stephanie re-joined the South region in 2022 as the president of South Florida’s Condo-HOA Division, overseeing operations and growth initiatives for condominium and HOA communities in Southwest Florida and along the eastern coast from Miami to Vero Beach. Stephanie has a robust 20-year background in working with leadership teams to improve operations, execute strategic company initiatives and elevate overall performance. Prior to joining FirstService Residential, she ran Sparker Consulting, worked at Managerial Design and served as Vice President of Organization Effectiveness at Real Matters, Inc., a global provider of financial services technology, and Solidifi, a residential real estate appraisal firm. Stephanie holds an MBA from Schulich School of Business/York University in Toronto, Canada and is a graduate of the University of Western Ontario where she attained an Honors Bachelor of Music. Stephanie is a native of Ontario and serves as the Board Chair of the Board of Directors for Children’s Harbor. Outside the boardroom, she is a singer, writer, Ironman triathlete, devoted mother of two and an advocate for trust-based parenting. She believes the best boundaries—whether in communities or families—are built on respect, not control. https://www.fsresidential.com/florida/ View Profile × Julie Khanna Julie Khanna is the founder and owner behind two media companies: Khanna Connections, a public relations, strategic communications, and media marketing agency specializing in the medical, health, and nonprofit industries, and Khanna House Studios, a full-production YouTube, podcast, and content creation studio located in Wellington, Florida, that also provides in-studio and onsite videography. With years of documented experience and secured media placements, Khanna and her team successfully secure top-level local and national media coverage for their clients and provide executive thought leadership on increasing brand visibility. Keeping a pulse on all sides of media, Khanna is the editor-in-chief of The Well of PBC magazine, and a contributor for many outlets including Around Wellington, NewsBreak, Medium, and more. https://khannaconnections.com/ View Profile × Michael Wild, Esq. Michael D. Wild, Esq., is the managing partner of WFP Law, PA, and a leader in his community. He serves on the Boards of Directors of 2-1-1 Broward, HANDY, ARC Broward, Boys and Girls Club of Broward County, and the NSU Ambassador Board. He also sits on the Broward Sheriff’s Advisory Council, is a Charter Fellow of the NSU Levan Center of Innovation, and has chaired the March of Dimes Signature Chef Gala, the 14th Annual Joint Tax and Estate Planning Seminar, and the 211 Broward Making Real Connections Breakfast. Michael was named Small Business Person of the Year for the City of Plantation, nominated for Man of the Year by the Leukemia and Lymphoma Society, and named one of Gold Coast Magazine’s Top 40 Professionals Under 40. He has also been listed in the Wall Street Journal as one of South Florida’s Top Attorneys. Super Lawyers magazine has repeatedly recognized Michael as a “Super Lawyer.” This prestigious designation, selected by other lawyers in Florida, is bestowed upon less than 3 percent of all attorneys each year. Michael is among only two Rising Star Estate Planning Attorneys in Broward County. Michael is designated with an “AV® Preeminent Rating” by Martindale-Hubbell. An AV® certification rating is the highest rating provided by Martindale-Hubbell – a testament to the fact that his peers rank Michael at the highest level of ethical standards and legal ability, based on legal knowledge, analytical capabilities, judgment, communication ability, and legal experience. Michael was admitted to the Florida Bar in 2006. Before obtaining his law degree from the University of Florida – Levin College of Law, Michael earned his B.A. in Political Science, with a minor in Sports Management, also from the University of Florida. In addition to earning his undergraduate and law school degrees, Michael has worked as a Financial Associate with Alliance Bernstein and as an Operations Assistant with the Miami Dolphins. With a genuine enthusiasm for his work, Michael frequently speaks to advisors and clients on estate planning, wealth transfer, probate administration, and asset protection. He prides himself on implementing a holistic approach to planning, treating his clients like family, and working with them instead of talking at them. www.wfplaw.com View Profile × Nick Sproul Nick Sproul is a father of three (ages 4, 2, and a newborn) and the Designated Broker of Southwestern Real Estate, leading a high-performing team across Florida. Ranked in the top 1% of all agents in South Florida, Nick is a recognized Luxury Home Marketing Specialist with a reputation for results and relationship-driven service. In addition to his real estate success, Nick is deeply invested in his community—serving on the Board of Directors and Executive Committee for both Children’s Harbor and the Hollywood Chamber of Commerce, and as a member of the Cooper City Charter Review Board. NickSproulSells@gmail.com https://www.swrealestate.com/ View Profile × Nicholas Sproul Managing Broker | Southwestern Real Estate Coming from a broken home and being orphaned as a teenager myself, I could see what a difference Children’s Harbor and Brown’s Harbor was making in the lives of these kids. From working my first Guardian Ad Litem case and being assigned to a set of siblings that was placed at Children’s Harbor, I could tell this facility was here to do something most group homes don’t have the ability to do and that’s to keep these kids together when they can only lean on each other. I’m truly honored to be able to serve on this board because it’s a cause that is dear to me and I believe it can make a huge impact. View Profile × Dr. Andre Caruso Dr. Andre Caruso, affectionately known as ‘The Doctor’ or ‘Doc’, is a psychologist, speaker, and expert in behavior and mindset with over two decades of experience helping individuals and organizations evolve and optimize performance. Doc is a Performance Alchemist, blending psychology and science with real-world experience to transform complex concepts into practical, actionable strategies. His career spans industries from hospitality and executive leadership to clinical psychology, where he has designed and led programs focused on leadership, communication, and behavioral change. As co-founder of IVOLVE Performance and Development and IVOLVE + Thrive, he helps professionals and business owners refine their decision-making, strengthen their leadership, and cultivate the soft skills essential for long-term success. Rejecting one-size-fits-all solutions, his approach is highly tailored, aligning with each person’s unique challenges and goals. Beyond his work with individuals and teams, Dr. Caruso is a sought-after speaker known for blending science, storytelling, and humor to make behavioral concepts engaging and accessible. He emphasizes that “more than one thing is true at the same time,” challenging conventional thinking and helping people expand their perspectives, recognize the trade-offs of success, and evolve in ways that elevate both their performance and well-being. IVOLVE Performance and Development drandrecaruso.com View Profile × Jason Zembuch Young Jason Zembuch Young is a high school theatre teacher and was the 2023 Tony Award Winner for Excellence in Theatre Education. He has been teaching for 27 years and has worked with teenagers his entire career. He and his husband, Michael, are soon to celebrate their 30th anniversary. They have fostered over 30 children and have a teenage daughter who they adopted from foster care. Jason holds a Bachelor’s Degree in Secondary Education and a Master’s Degree in Directing for the Stage. View Profile × Dr. Brandy Pidermann, DSW, LCSW-QS Licensed Psychotherapist & Mental Health Expert Dr. Brandy Pidermann is a licensed psychotherapist, clinical social worker, and the founder of Changing Tides Therapy. She has over a decade of experience working with children, adolescents, young adults, and families, specializing in mental health, emotional resilience, and family dynamics. ​In addition to her private practice, she leads a clinical team overseeing a therapeutic program for foster care youth, ensuring underserved teens receive the structure, support, and interventions they need to thrive. She has also taught clinical social work courses at Florida Atlantic University, helping train the next generation of mental health professionals. Her work extends beyond direct practice—she has contributed to youth mental health research, particularly in suicide prevention, and has developed programs supporting families, schools, and healthcare systems. Passionate about mental health education, she helps parents and caregivers better understand teen behavior, strengthen communication, and build emotional resilience in today’s world. View Profile × Dr. Julie Radlauer-Doerfler, LMHC Dr. Julie Radlauer is a leading expert in the social influences of mental health and uses her experience to create impact within communities, systems, organizations, and individuals. She has extensive experience in behavioral health, public health, and organizational development and speaks internationally, is a TEDx speaker, and a published best-selling author. Websites: https://collectivelyus.org/ https://julieradlauer.com/ Social Media Handles: https://www.linkedin.com/in/julie-radlauer-doerfler-drph-lmhc/ https://www.facebook.com/profile.php?id=100077717883180 https://www.instagram.com/collectively_us/ https://www.youtube.com/@collectively-us Book and TEDx: CONNECT.Book: https://www.amazon.com/CONNECT-Ways-Create-Happiness-Your/dp/B0CGM51W8Q TEDx: https://www.youtube.com/watch?v=_v9nJlVvKFs View Profile × Romi Wallach Romi Wallach began working in Financial Services in 2017. In early 2022 she joined NOW CFO as a Business Development Representative in the South Florida market. Romi’s background working with business owners and decision makers has allowed her to expand and provide even more resources and support to the large community of business owners and professionals that she has served over the years. In November of 2023 she became the Director of Business Development for ISA – an organization that provides innovative solutions to business owners looking to grow and scale their business by leveraging remote Global Talent. In 2021, she Co-founded The Daily Drip , a media platform providing content, resources, programming, and community to support South Florida businesswomen on their journey to maximum potential. The Daily Drip is a thought leadership platform amplifying the voices of the modern female business professional. From Palm Beach to South Beach, they are now a community of 4,000 and growing! Romi serves as a member of the Joe DiMaggio Planned Giving committee, a Board Member for Piper’s Angels Foundation, a 3 x Crossing Crusader in the Crossing for CF, Mentor for the Crossing for CF, Core Committee Member for the Crossing for CF, member of Women Know Y, Club 211 Broward Lifetime member, Circle of Wise Women and Co-President for IBDPros.. View Profile × Melia Arnett-Archie, Esq. Founder of Modern Creators Law Firm, PLLC, VoiceBox Podcast & Creators Studio, LLC, and Co-Founder of B. Her Collective, LLC I am Melia Arnett-Archie, a proud mother of two beautiful girls, Hannah, 19, and Aliza, 5. Alongside my roles as a wife and mother, I am also a passionate entrepreneur dedicated to empowering creative minds in the digital age. Through my journey as the founder of the Modern Creators Law Firm and VoiceBox Podcast & Creators Studio, I’ve discovered the power of combining legal expertise with creative expression. At the Modern Creators Law Firm, I offer personalized legal strategies tailored to the unique needs of creative entrepreneurs, content creators, and influencers. From business formation to intellectual property protection, I ensure that my clients are equipped with the tools they need to succeed in today’s ever-evolving landscape. VoiceBox Podcast & Creators Studio, shapes brand identities through compelling digital media content creation and comprehensive podcast production services. Our tagline, “Our Box. Your Voice,” embodies our commitment to handling the intricate aspects of content creation, allowing creatives and business owners to focus on what they do best: expressing their unique voice and vision. From crafting engaging podcasts to producing dynamic digital media content, we provide the tools and expertise needed to effectively communicate with your audience and elevate your brand presence. Additionally, as the Co-Founder of B. Her Collective, LLC, I passionately work to arm Women of Color with the connections, practical tools, and educational enrichment necessary to ‘Change what they cannot accept.’ We are blowing up the status quo, activating genius, and crafting opportunities to ensure Women of Color can confidently seize opportunities and build success in every phase of their careers and entrepreneurial journeys. As both a mother and an entrepreneur, I am committed to building a brighter future for my family and for all those I serve. View Profile × Notice: JavaScript is required for this content. × Laura Raybin Miller Vice-President of Wealth Management | UBS Financial Services, Inc. View Profile × Jesse Bernheim Founder, CEO, Trial Attorney | Bernheim Kelley It means a great deal to me to be part of the Children’s Harbor team. Together, we will be their voice when they need it most. View Profile × Ariadna Alvarez Partner | Holland & Knight LLP It is an honor to join an organization committed to improving the lives of children and teens in foster care by offering them a safe environment, stability, and tools that will help them get ahead. An investment in the residents of Children’s Harbor is an investment in the future of our community. View Profile × Brenda D. Forman Broward County Clerk of Courts Children’s Harbor is a beacon of hope for kids who have endured the unfortunate experience of family-related trauma. It’s an opportunity to give them a safe place to call home, as well as the guidance they often need to make sense of life as young adults. View Profile × Clara Acero Smith Executive Director | Kingdom Charitable Trust Growing up in a single-parent household, I can relate to needing guidance and yearning for stability. Children’s Harbor provides that safe place for youth in our community struggling to find a home and is unique as it keeps siblings together. I am honored to be part of a heart-led, impactful organization. View Profile × Marleen Applebaum VP of Business Operations | MA Construction Group Each child should have a place to call home – a safe place where they are loved, nurtured, and taught skills to help them succeed in life. For many, Children’s Harbor is that place. I’m honored to part of this incredible organization whose professionals give of themselves every single day and every single hour to help children heal. View Profile × Stephanie Parker President, South Florida Condo – HOA | FirstService Residential Children’s Harbor is unique in so, so many ways, but most importantly in how the leadership team, dedicated professionals and onsite team members manage to create a home and also a family for young people who may have never experienced that before. I’ve never seen anything like it and I am humbled by the youth, and the team, every single day. View Profile × Troy Sorel Senior Financial Advisor, Partner | SlateStone Wealth, LLC I chose to serve on this board because of the direct short and long-term impact this incredible organization has on children in the community. View Profile × Manolis Alevropoulos Vice President of Celebrity Cruises | Marine Operations Serving our community at Children’s Harbor is not only my internal need and obligation but a realization that the future depends on working together and supporting the young to carry a better future for a better world. View Profile × Martin J. Alexander, Esq. Equity Partner | Holland and Knight I believe that the most important part of our mission at Children’s Harbor is providing a place where there is love. I am most proud of the fact that we not only provide services but we do it in a way that lets our kids know and their families know that we truly care about each and every one of them. View Profile ×"
    },
    {
      "url": "https://www.harborcourthotel.com/contact/",
      "text": "Get in Touch! - Harbor Court Hotel Book Offers Rooms Food & Drink Ozumo Groups & Events About Explore the Bay Sustainability Health & Wellness Pet Friendly Contact FAQ Gallery Book Now Offers Rooms Food & Drink Ozumo Groups & Events About Explore the Bay Sustainability Health & Wellness Pet Friendly Contact FAQ Gallery CONCERN? COMPLIMENT? WE’RE LISTENING Harbor Court Hotel 165 Steuart Street San Francisco, CA 94105 Toll-free reservations: 1-888-538-8552 T: 415-882-1300 F: 415-882-1313 reservations@harborcourthotel.com Media Inquiries: springboard@thepointpr.com For information on accessibility, please view our Accessibility Statement . Get in touch! Name (Required) Email (Required) Phone How do you want to be contacted? Phone Email Comments CAPTCHA Email This field is for validation purposes and should be left unchanged. 165 Steuart Street, San Francisco, CA 94105 (415) 882-1300 Contact FAQ Press Privacy Policy Accessibility Fact Sheet Careers © 2025 Harbor Court Hotel Subscribe To Our Newsletter SUBMIT View Hotels Careers"
    },
    {
      "url": "https://safeharborshelter.com/contact/",
      "text": "Contact - Safe Harbor s Leave Site Now DONATE NOW 0 Items Search for: Home About Us About Us Our Work Board Staff Contact Us Media Kit How We Work Counseling Children’s / Youth Counseling Program Safe Houses Court Advocacy SMART Safe Bars Red Flags / How to Help a Friend Resources/Blog Blog Media Kit The Counselor’s Corner Get Involved Volunteer Internship Opportunities Community Outreach Request Third Party Fundraising Events Donate Goods Host a Drive Provide a Meal Donate Select Page Contact Contact Us If you want to talk to someone about your experience with domestic and/or sexual violence, please call our confidential helpline at (804) 500-2755. Someone is available to talk 24 hours a day/7 days a week.  Mailing Address: PO Box 17996 Richmond, VA 23226  Phone: 804-249-9470 (general business line) 804-500-2755 (24-hour helpline) Click here for our staff directory  Email: info@safeharborshelter.com  Fax: 804-249-9472 Please be aware that this is a general contact form, NOT TO BE USED FOR EMERGENCIES. If you need immediate help, please call our 24-hour helpline at 804-500-2755. Name * First Last Email * Phone * Is it safe to leave a message at this number? * Yes No Message Δ Annual Impact Report Your support positively impacted the lives of the women, men and children who deperately needed us. Thank you! To read about the impact of your support... Click Here Safe Harbor 990 VIEW Donate to Safe Harbor Donate Now Get Our Free Newsletter! Categories Categories Select Category Current Events & News International Local & Regional State & National Learn & Grow Domestic Violence How To Help… Human Trafficking Recovery & Resilience Programs Community Awareness Conferences & Trainings Counseling Groups Hotline 804.612.6126 Individual Interns Court Advocacy Fundraising Beacon of Hope Planned Giving Walk To End It Outreach Community Support Donate Goods Volunteers Shelters Shelter News Survivor Stories Resources/Blog Counselors Corner Safe Harbor News Events & Happenings Gratitude Report Press Releases Recent Media Updates & Changes Uncategorized Testimonials Great experience and gained great amount of knowledge. Since this is so prevalent in today's society it is best to have the most information possible. “I learned that I am as strong as I think I am, and that I am definitely a survivor.” - T, domestic violence survivor “Both my child and I have received counseling that has added to the quality of our life.  I know that I am not alone, and that has made me a better parent.” - I, domestic violence survivor “I feel so fortunate to have found a program like Safe Harbor. I was greeted with smiles, a calming presence, and a place to heal and rebuild my life.Thank you!” -M., domestic violence survivor “Safe Harbor helped me to get a preliminary protective order against my abuser.  Their services and support helped me to navigate the court system and feel more confident.  I am very grateful for these resources and to know that I was not alone during this process.” - M, domestic violence survivor “It was very nice to have someone there to give me support while I was going through the process.  She was very helpful and kind. I did not know that people like that existed anymore.” - Survivor quote Like Us on Facebook! Search Search for: SITEMAP Home About Us Get Help Counselor’s Corner Get Involved Donate Blog Media Kit Contact Us RECENT ARTICLES Hiring: Full-Time Therapist Identifying Digital Abuse: Do You Know the Signs? 2024 Safe Harbor’s Walk to End It! Human Trafficking Conference Brings Together Experts in the Field Press Release – Junior League Beacon Honoree GET IN TOUCH P.O Box 17996 Richmond, VA 23226 Office: 804-249-9470 Fax: 804-249-9472 info@safeharborshelter.com © 2011-2025. Safe Harbor Shelter . All Rights Reserved. Safe Harbor is a 501(c)(3) Organization Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.safetyharborspa.com/about-us",
      "text": "About Us | Safety Harbor Resort & Spa Skip to navigation Skip to main content Skip to footer About Us Learn More About Our Historic Tampa Bay Area Waterfront Spa Resort In 1539, Hernando Desoto reached the shores of Old Tampa Bay and discovered the natural springs, later named “Espiritu Santo Springs,\" believing he had found the legendary “Fountain of Youth” missed by Ponce De Leon. In 1964 the U.S. Department of the Interior recognized and designated the Safety Harbor Resort and Spa a Historical Landmark and in 1997 it became a Florida Heritage Landmark. Boasting 172 spacious guest rooms , a 50,000 sq. ft. Spa and Fitness center and over 30,000 sq. ft. of Convention and Meeting space, Safety Harbor Spa remains one of the most comprehensive spa and fitness centers in the country. Our 50,000 Sq. ft. Spa features 30 newly renovated treatment rooms including men and women’s bath and shower facilities. Featuring Eminence Organic Skincare Signature treatments and products, extensive exercise facilities and specialized wellness programs , a truly rejuvenating and revitalizing mind and body experience awaits you. Built on the site of the natural mineral springs believed to restore youth and vitality, our spa treatments and three swimming pools use the healing powers of the water to help you achieve your own personal serenity. Discover why Spa Finder Magazine has consistently named the Safety Harbor Spa among their top ten U.S. spas year over year. Our Meeting and Conference facilities offer an \"out of the box\" destination for your next meeting. With 30,000 sq. ft. of flexible meeting and convention space, including outdoor venues with spectacular views of Tampa Bay and the city lights of Tampa, Safety Harbor Resort and Spa can accommodate groups from 10 to 1,000 guests. The Four Springs Ballroom, featuring a specially designed Fresco painting representing our heritage, adorns the domed ceiling and can accommodate up to 360 guests. Dining at the Safety Harbor Resort and Spa is as refreshing as the natural spring waters that bubble beneath our tranquil property. Sample all of the unique possibilities, from the Fountain Grille restaurant , to the poolside refreshments of the Tiki Bar or cocktails and light fare in the Santorini lobby lounge. We offer an entire range of privately catered fine dining experiences for meetings, conventions, social events and weddings. We are the proud winner of Wedding Wire Couple's Choice Award, consecutively, from 2014 - 2023, putting us among the top 5% of Wedding Pros. The best of what Clearwater hotels have to offer: Stunning views of Tampa Bay, spacious guestrooms, historic ballrooms and award winning spa facilities await your visit with us whether for a business meeting, special occasion or the need to just get away. Back to top Back to top"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "text": "Contact - Harbor Club GA Real Estate Golf Lifestyle Memberships Find Homes Inquire Real Estate Golf Lifestyle Membership About Weddings & Events Blog Gallery Contact Discover the Harbor Club Lifestyle We hope you enjoyed your virtual visit to Harbor Club, but nothing compares to experiencing our beautiful community firsthand. To schedule an in-person tour, or to simply learn more about life at Harbor Club, reach us at (800) 505-GOLF (4653) or info@harborclub.com today. Visit Us 1111 Polo Circle Suite 102 Greensboro, GA 30642 (800) 505.GOLF or (706) 453.9690 info@harborclub.com Get Directions Get In Touch Contact us today and learn more about life at Harbor Club. First Name* Last Name* Phone Number* Email Address* Zip/Country Code* Contact Preference* Email Call Text I am interested in* Real Estate Golf Membership Wedding Private Event Local Outings Learn More Golf Learn More Keep In Touch @HARBORCLUBONLAKEOCONEE 1111 Polo Circle Greensboro Georgia 30642 Get Directions 866 805 5253 info@harborclub.com Harbor Club All Rights Reserved © 2023 Real Estate Golf Lifestyle Membership About Weddings Events Blog Gallery Accolades Contact Resident Log In Member Log In Front Gate Guest Registration Privacy Policy Cookie Policy © 2025 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions. 1111 Polo Circle Greensboro Georgia 30642 Get Directions Resident Log In Member Log In Privacy Policy Cookie Policy ©2023 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Harbor Club All Rights Reserved © 2023 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions."
    },
    {
      "url": "https://www.tampabay.com/archive/2011/12/04/safety-harbor-manager-leaving/",
      "text": "SAFETY HARBOR MANAGER LEAVING Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Archive SAFETY HARBOR MANAGER LEAVING Matt Spoor heads to St. Petersburg as its new management and budget director. By DIANE STEINLE Published | Updated MORE FOR YOU Photos: Clearwater Ferry crash • Transportation After a baby was born in a hurricane shelter, a witness is left wondering • Hurricane Advertisement Hurricane Helene to keep Tampa Bay area schools closed Friday • Hurricane More Florida faculty still looking to leave the state, survey shows • Archive Drivers could cross the new Howard Frankland in six months. Here’s what’s left. • Transportation What to expect from the Lightning at NHL trade deadline • Sports Tampa council approves $14 million to settle wrongful conviction lawsuit over 1983 murder • Tampa Florida makes it official: Universities to drop sociology as a core course • Archive Pete Alonso’s Battle for the Bay knocks giving back out of the park • Photos Tampa woman charged after 3 puppies found in dumpster, police say • Breaking News Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.bostonharbornow.org/about-us/our-team/",
      "text": "Our Team - Boston Harbor Now × Home About Us About Us Overview History Our Team Annual Report Contact Us What We Do What We Do Work Play Learn Explore News Events Events Onboard Awards Spectacle on Spectacle Boston Harbor for All Summit Eastie Week Public Programs Get Involved Get Involved Careers Volunteer Friends of the Boston Harborwalk Friends of the Boston Harbor Islands Current RFPs Giving Giving Donate Join Signature Events Donate Contact Us Subscribe Menu About Us Overview History Our Team Annual Report Contact Us What We Do Work Harborwalk 2.0 Waterfront Development Waterfront Development Comment Letters Climate Change Preparedness Water Transportation Boston’s Working Port Working Port: A 21st-Century Harbor Peddocks Island Redevelopment Plan Play Summer on the Waterfront Eastie Week Free and Discounted Access Revolution 250 Learn Harbor Discovery Camps Vlog Explore Boston Harbor Islands Boston Harborwalk Getting Around News Events Onboard Awards Spectacle on Spectacle Boston Harbor for All Summit Eastie Week Public Programs Get Involved Careers Volunteer Friends of the Boston Harborwalk Friends of the Boston Harbor Islands Current RFPs Giving Donate Join Signature Events Spectacle on Spectacle Onboard Awards Donate Contact Us Subscribe Our Team About Us Press Overview History Our Team Annual Report Contact Us Staff Board of Trustees Board of Advisors Founding Emeritus Trustee Lifetime Emeritus Trustees Boston Harbor Now is an intentionally diverse group of people committed to our work and each other. Staff Kathy Abbott President and CEO kabbott@bostonharbornow.org Read More Andrea Campbell Director of Individual Giving acampbell@bostonharbornow.org Read More Christina Chappell Manager of Business Operations cchappell@bostonharbornow.org Read More Joe Christo Chief Resilence Officer jchristo@bostonharbornow.org Read More Janine Dailey Vice President, Development jdailey@bostonharbornow.org 617-460-6751 Read More Jessica Garcia Development Coordinator jgarcia@bostonharbornow.org Read More Liana Greenberg-Nielsen Education and Engagement Program Coordinator lgreenberg-nielsen@bostonharbornow.org Read More Sarah Jackson Innovation Islands Program Assistant sarahj@bostonharbornow.org Read More Allison L. Communications Coordinator alin@bostonharbornow.org Read More Jaye Meakem Community Engagement Manager jmeakem@bostonharbornow.org Read More Christian Merfeld Communications & Public Relations Director cmerfeld@bostonharbornow.org Read More Na’tisha Mills Manager of Special Events nmills@bostonharbornow.org Read More Kalimah Mustafa-Widberg Program Coordinator kmustafawidberg@bostonharbornow.org Read More Alankrita Narang Chief Financial and Administrative Officer anarang@bostonharbornow.org Read More Linda Orel Chief Impact Officer lorel@bostonharbornow.org Read More Jon Palmer Communications Manager jpalmer@bostonharbornow.org Read More Nick Pioppi Youth Engagement Coordinator npioppi@bostonharbornow.org Read More Rebecca Shoer Education and Engagement Program Manager rshoer@bostonharbornow.org Read More Rebecca Smerling Director of Programs rsmerling@bostonharbornow.org Read More PhuongDuy Tran Manager of Operations & Partnerships ptran@bostonharbornow.org Read More Board of Trustees James Miner Executive Director, CannonDesign Nalini Sharma Betsy Wall Chief of Staff, Office of Senator Barry Finegold Marcel Vernon Sr. Chief Executive Officer, Massachusetts Convention Center Authority (MCCA) Beth Card Senior Policy Advisor, Smith, Costello, & Crawford Kevin Clarke Director, Global Scientific Communications, Vertex Pharmaceuticals Bob Delhome Founder and President, Charter Development Company Greg Herrema Harvard Advanced Leadership Initiative Andrew McElwee President & COO, Plymouth Rock Assurance Bud Ris Senior Advisor, Climate Change, Boston Green Ribbon Commission Meaghan Hooper-­Berdik Chair VP & General Manager, Turner Construction Company Elaine Richardson Treasurer Chief Operating Officer, AR Products LLC Kishore Varanasi Chair, Planning and Policy Committee Director of Urban Design, CBT Martin O’Neill Chair, Parks and Open Spaces: Programs, Projects, Operations Senior Vice President, Safety, Health, and Environment, Cabot Corporation Richard Walker Former Senior Vice President, Federal Reserve Bank of Boston Cathleen Douglas Stone Clerk The James M. & Cathleen D. Stone Foundation Jamie Fay President, Fort Point Associates Malia Lazu Chair, DEI Working Group Lecturer, MIT Sloan School of Management; Founder, The Urban Labs, Ann Lagasse Principal, Ocean Havens Shelagh Mahoney Owner and Chief Executive Officer, Eastern Salt Company, Inc Ex-Officio Trustees Kathy Abbott President and CEO, Boston Harbor Now Rebecca Tepper Secretary, Executive Office of Energy and Environmental Affairs Michael Creasey Superintendent, National Parks of Boston Fred Laskey Executive Director, MWRA Andrew Hargens Chief Development Officer, Massport Mary Kay Leonard Chair, Board of Advisors Board of Advisors Joel Barrera Faries Gray Sagamore, Massachusett Tribe at Ponkapoag Veronica Robles Co-founder and Director, Veronica Robles Cultural Center Stephanie Kruel Associate, Senior Regulatory and Resilience Advisor, VHB Jason Hellendrung Vice President, Planning and Design, Tetra Tech Kathleen Brill Partner, Foley Hoag Steven Pedigo Executive Director, LBJ Urban Lab; Professor of Practice at The University of Texas at Austin, Devanshi Purohit Senior Associate, Senior Urban Designer: CBT Architects, Kelly Strong Executive Director of Boston Shipping Association, Tom Comeau President & Chief Operating Officer, Commodore Builders Leslie Doyle VP of Construction, WS Development Derek Lumpkins Founder, Re|Fresh Strategies Kaki Martin President, Boston Society of Landscape Architects (BSLA) Catherine Barner Consultant and Former Vice President of Park Projects for the Golden Gate National Parks Conservancy, Tom Mori Senior Staff Engineer, Wayfair Roger Berman President, The Berman Company Megha Vadula Vice President, Mixed-Use Development, Hilco Redevelopment Partners Sheena Collier Founder, Boston While Black Christian Williams VP, Startup Banking, J.P. Morgan John Schmid Principal, Nitsch Engineering Diego Huezo Senior Director of Government Relations, Massachusetts Clean Energy Center Olawumi Akinwumi Director of Hibernian Hall, Event Consultant, AfroDesiaCity Sean Riley Principal, Deloitte Patrick Kimble Founder and Managing Partner, Caste Capital Monique Robinson Clark Owner/Principal Consultant, Robinson Clark Consulting, LLC Robert Golledge Principal, Golledge Strategies Dean Hara Financial Advisor, Retired, Rebecca Lee Member, Mintz Levin Mary Kay Leonard Chair, Board of Advisors Marty Mazzone COO and General Counsel, Center for Advancing the American Dream, Jennifer McMahon Regional Director of Sales and Marketing, Boston Harbor Hotel Charlayne Murrell-Smith Vice President, External Relations & Corporate Development, Boston Children's Museum Tom Powers Former President , Boston Harbor Island Alliance Leverett Wing President and General Manager, Lee Wing Management Founding Emeritus Trustee Lifetime Emeritus Trustees Governor Michael Dukakis Distinguished Professor of Political Science, Northeastern University Governor William Weld Principal, ML Strategies, LLC Are You On Board? Sign up for what interests YOU most: news, free fun, volunteer opportunities, or all of the above! Boston Harbor Now 1 Constitution Road Boston, MA 02129 Phone: (508) 377-3003 Email: info@bostonharbornow.org Home About Us Subscribe to Newsletters What We Do Events News Get Involved Support Annual Report Home About Us Subscribe to Newsletters © Copyright 2025 Boston Harbor Now Home About Us Subscribe to Newsletters"
    },
    {
      "url": "https://www.thetidesmarket.com/contact",
      "text": "CONTACT | Contact The Tides Market in Safety Harbor — The Tides Market | Eatery & Market in Safety Harbor, FL Skip to Content Open Menu Close Menu MENU MARKET OUR ROOTS PRESS CONTACT GIFT CARDS 0 0 MENU MARKET OUR ROOTS PRESS CONTACT GIFT CARDS 0 0 Open Menu Close Menu MENU MARKET OUR ROOTS PRESS CONTACT GIFT CARDS RESERVATIONS We do not accept reservations at this time. However, if you have a party of 8 or more, please call us at (727) 699-8433 and ask for a manager. They will take your party’s details so our team can anticipate your arrival. While we cannot guarantee availability, we will do our best to accommodate your group on a case-by-case basis. CONTACT US For inquires about our products, events or you just wanna say hello, please feel free to reach out! We’d love to hear from you! Name * First Name Last Name Email * Message * Thank you! CATCH THE FRESHEST UPDATES Stay in the know! Sign up for our newsletter to get the latest on fresh market finds, weekly specials, and all things happening at The Tides Market. Email Address Sign Up Thank you! Your privacy is important to us. We’ll never share your personal information! CONTACT The Tides Market 305 Main Street Safety Harbor, FL 34695 727-699-TIDE (8433) INFO@THETIDESMARKET.COM HOURS OPEN 7 DAYS A WEEK MONDAY - FRIDAY: 11AM - 9PM SATURDAY  - SUNDAY: 10AM - 9PM FOLLOW ©2025 The Tides Market. All rights reserved. | Terms & Policy Designed by Saltbox Creative"
    },
    {
      "url": "https://business.safetyharborchamber.com/events",
      "text": "Event List | Safety Harbor Chamber of Commerce Skip to content Menu The Chamber About Us Be Part of Something Bigger Marketing Opportunities 2025 Social Media Promotions Board of Directors Bay Area Young Professionals Leads Group Business of the Year Foundation Jobs Hurricane Resources Visit Safety Harbor History Around Town Things To Do Map Contact Us Directory Directory Hot Deals Member to Member Deals Join Today! Events Events Calendar Safety Harbor Restaurant Week Annual Dinner Celebration B.O.S.S Series 3rd Friday Street Celebration Art & Seafood on the Waterfront Events Calendar Category... Arts & Culture Chamber Of Commerce Clubs/Organizations Community Continuing Education Festivals & Celebrations Government Holiday Networking Recreation & Sports Schools Date... Today This Week This Month This Month & Next This Year Search Results Found: 453 Button group with nested dropdown Safety Harbor Restaurant Week 2025 Safety Harbor Restaurant Week 2025 Monday Sep 8, 2025 Sunday Sep 14, 2025 Categories: Community Chamber Of Commerce AARP Safe Driver Course AARP Safe Driver Course Thursday Sep 11, 2025 Categories: Community Schools Continuing Education September Wine-O Social September Wine-O Social Thursday Sep 11, 2025 September Wine-O Social September Wine-O Social Thursday Sep 11, 2025 Ribbon Cutting - The Tranel Financial... Ribbon Cutting - The Tranel Financial Group Friday Sep 12, 2025 Categories: Festivals & Celebrations Community Chamber Of Commerce Networking Register Mystery Dinner Theatre - Death of a G... Mystery Dinner Theatre - Death of a Gangster Friday Sep 12, 2025 Categories: Arts & Culture Clubs/Organizations Wine Pairing Experience: Sweet and Sa... Wine Pairing Experience: Sweet and Savory Night Friday Sep 12, 2025 Make Your Own Jewelry Class with Liz Make Your Own Jewelry Class with Liz Sunday Sep 14, 2025 Categories: Community Recreation & Sports Featured Member : Silent Slayer Ghost... Featured Member : Silent Slayer Ghost Tours Monday Sep 15, 2025 City Commission Meeting City Commission Meeting Monday Sep 15, 2025 Categories: Community Government Chamber Of Commerce Business Directory News Releases Events Calendar Hot Deals Member To Member Deals Marketspace Job Postings Contact Us Information & Brochures Join The Chamber © 2025 Safety Harbor Chamber of Commerce | Site by GrowthZone Safety Harbor Chamber of Commerce Phone number 727.726.2890 map icon 200 Main St., Safety Harbor, FL 34695 email address Email Us Facebook Instagram © 2025 Safety Harbor Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://harbordish.org/events/list/",
      "text": "Events  - HarborDish | A Community Cafe in Safety Harbor, Florida Skip to content Helping Our Community One Meal At A Time Home About Events Supporters Volunteer Sign Up Log In Donate Contact Us Blog Home About Events Supporters Volunteer Sign Up Log In Donate Contact Us Blog Home Events About Supporters Volunteer Login Volunteer Sign Up Donate Contact Us Blog Home Events About Supporters Volunteer Login Volunteer Sign Up Donate Contact Us Blog 0 events found. There are no upcoming events. There are no upcoming events. Views Navigation Event Views Navigation List List Month Day Today Upcoming Upcoming Select date. Latest Past Events Jul 30 2025 July 30 @ 6:00 pm - 7:00 pm Fright Nights Meeting at Folly Farmhouse Jul 30 2025 July 30 Rotary at noon: Mattie Williams Jul 29 2025 July 29 @ 4:30 pm - 5:30 pm Harbor Dish Board Meeting Harbor Dish Kitchen 3380 SR-580 E., \t\t\t\t\tSafety Harbor Mailing Address 690 Main Street, #123 Safety Harbor, FL 34695 727-796-8286 Kitchen Location 3380 SR-580 E. Safety Harbor, FL 34695 harbordish@harbordish.org Facebook Instagram Youtube X-twitter © 2025 The Harbor Dish, Inc. All Rights Reserved."
    },
    {
      "url": "http://www.cityofsafetyharbor.com/594/Get-Involved",
      "text": "Events | Safety Harbor FL - Official Website Skip to Main Content About Us Camps REAL: Recreation, Events, Arts & Leisure Magazine Register Now Special Events Activity Search Site Search Activity Search Site Search Search Home Departments Leisure Services Facilities Museum & Cultural Center Get Involved! Events Are you interested in becoming a volunteer at the Museum? Contact Donna Mack at 727-724-1562 ex 1155 or email dmack@cityofsafetyharbor.com We want you to become a Museum Docent! Do you love all things Safety Harbor History and want to get involved with the Safety Harbor Museum & Cultural Center? Now is your chance to become a volunteer docent/tour guide! All docents must complete a training, and trainings are held the first Saturday of the month. Stop in and get signed up! Our training takes approximately 1 hour. For more information, contact us at 727-724-1562. Activity Guide, Registration & Sales Special Events Parks Recreation Centers & Museum Fitness Center Marina Contact Us Leisure Services Physical Address 750 Main Street Safety Harbor, FL 34695 Phone: 727-724-1560 Fax: 727-793-2317 Directory Link Sign Up For E-News Site Links Home Site Map Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}