{
  "fuentes": [
    {
      "url": "https://www.winterparkvenue.com/about-us",
      "email": "debbie@uclubwp.org"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "andrea.schaefer@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "brooke.tyler@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "david.sizelove@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jason.lippy@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "jesse.regalado@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "menno.ozinga@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@clubcorp.commitchell"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "mitchell.putnam@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "robin.kremen@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "email": "annemarie.mckay@invitedclubs.com"
    },
    {
      "url": "https://countryclubtrentpark.co.uk/contact/",
      "email": "enquiries@countryclubtrentpark.co.uk"
    },
    {
      "url": "https://business.winterpark.org/list/member/winter-park-country-club-golf-course-winter-park-5007698",
      "email": "wpcc@winterpark.org"
    },
    {
      "url": "https://moors-valley.co.uk/contact-us/",
      "email": "info@idhospitalityltd.co.uk"
    },
    {
      "url": "https://moors-valley.co.uk/contact-us/",
      "email": "rangers@moors-valley.co.uk"
    },
    {
      "url": "https://www.winterpark.org/board-of-director-5-29/",
      "email": "wpcc@winterpark.org"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "email": "reception@whittlebury.com"
    }
  ],
  "mails": [
    "andrea.schaefer@invitedclubs.com",
    "annemarie.mckay@invitedclubs.com",
    "brooke.tyler@invitedclubs.com",
    "david.sizelove@invitedclubs.com",
    "debbie@uclubwp.org",
    "enquiries@countryclubtrentpark.co.uk",
    "info@idhospitalityltd.co.uk",
    "jason.lippy@invitedclubs.com",
    "jesse.regalado@invitedclubs.com",
    "menno.ozinga@invitedclubs.com",
    "mitchell.putnam@clubcorp.commitchell",
    "mitchell.putnam@invitedclubs.com",
    "rangers@moors-valley.co.uk",
    "reception@whittlebury.com",
    "robin.kremen@invitedclubs.com",
    "wpcc@winterpark.org"
  ],
  "nombre_sitio": "cityofwinterpark.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.winterparkvenue.com/about-us",
      "text": "About University Club of Winter Park University Club of Winter Park University Club of Winter Park 841 N Park Ave Winter Park , Florida 32789 (407) 644-6149 debbie@uclubwp.org Owner: Home Weddings Parties Meetings The University Club of Winter Park About Us Contact Us Home » About Us About The University Club of Winter Park Established in 1934 as a forum where educators and professionals could meet and exchange ideas, the University of Winter Park now stands as a beautiful club & venue where ideas and experiences can be shared in equal measure. From intimate weddings to extravagant parties and corporate meetings, we bring your ideas to life. Home About Us Testimonials Contact Us Privacy Policy Site Map University Club of Winter Park 841 N Park Ave Winter Park , FL 32789 Phone : (407) 644-6149 Log in Login Email Password Forgot Password? Reset Password If you have lost your password, enter your email address. An email will\n                            be sent to you with instructions for you. Email Address Call Hours Map Hours: Monday 09:00 am - 04:30 pm Tuesday 09:00 am - 04:30 pm Wednesday 09:00 am - 04:30 pm Thursday 09:00 am - 04:30 pm Friday 09:00 am - 04:30 pm (407) 644-6149 Contact Us View\n                in Maps (407) 644-6149 Contact Us Copyright © 2020-2025                Wedding and Party Network - University Club of Winter Park All Rights Reserved cms-01.local"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/the-woodlands-country-club/our-story/our-team",
      "text": "Meet Our Dedicated Team | The Woodlands Country Club, TX × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers The Woodlands Country Club Main Site Navigation Our Story Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Login - Opens in new tab Menu Our Story Our Team Calendar Directions & Hours Golf The Refinery Insperity Invitational Lessons & Programs Tournament Course Player Course North Course West Course Palmer Course King General Deacon Amenities Racquet Sports Dining Blu Pool Fitness Membership Host An Event Tournaments & Outings Weddings Events Meetings & Corporate Event Rooms Contact Us Calendar Opens in new tab Member Login Find A Club Opens in new tab Careers Login - Opens in new tab Home Our Story Our Team Our Story Calendar Directions & Hours Meet Our Amazing Team David Sizelove Regional Manager Contact Me David.Sizelove Contact Me + Close David Sizelove information modal David Sizelove Regional Manager Serving since 2023 David.Sizelove David.Sizelove Contact Me Contact Me Menno Ozinga General Manager | Palmer Contact Me Menno.Ozinga Contact Me + Close Menno Ozinga information modal Menno Ozinga General Manager | Palmer Serving since 2023 Menno.Ozinga Menno.Ozinga Contact Me Contact Me Robin Kremen General Manager | The Trails Contact Me Robin.Kremen Contact Me About Robin + Close Robin Kremen information modal Robin Kremen General Manager | The Trails Serving since 2015 Robin.Kremen Robin.Kremen Contact Me About Robin Born in New Jersey. Moved to Houston in October 80Graduated Culinary Institute of America. Worked at Cellar in Sky World Trade Center, Sheraton Corporation, Junior League of Houston, Bon Appetite, Lakeside Country Club and Bay Oaks Country Club.Over Thirty years in Food Service13years as a Invited Employee.Team member Texas Chefs Association George W Bush Presidential inauguration reception, Economic Summit Rice University.Culinary Institute of America – Culinary Team Member25 years as a member Houston Livestock Show & Rodeo, Chairman 2 timeWife Tracy, son Gregory, Daughter ElizabethStarted at the Woodlands CC in February Contact Me Jesse Regalado Club Manager | Tournament Contact Me Jesse.Regalado Contact Me + Close Jesse Regalado information modal Jesse Regalado Club Manager | Tournament Serving since 2022 Jesse.Regalado Jesse.Regalado Contact Me Contact Me Amber Sickafoose Membership Director Contact Me 281-845-4886 Amber.Sickafoose Contact Me About Amber + Close Amber Sickafoose information modal Amber Sickafoose Membership Director Serving since 2010 281-845-4886 Amber.Sickafoose 281-845-4886 Amber.Sickafoose Contact Me About Amber Amber holds a BS degree in Marketing from Bellevue University. She started her career as a Director of Marketing for a financial company but quickly decided that sales was her real passion. Her golf career began in 2009 for The Woodlands Country Club as a membership director for both The Oaks and Panther Trail courses as well as The Woodlands Country Club courses. She is a very active member in the community and a graduate of Leadership Montgomery County class of 2013. Contact Me Jason Lippy Membership Director Contact Me 832-810-5876 Jason.Lippy Contact Me About Jason + Close Jason Lippy information modal Jason Lippy Membership Director Serving since 2015 832-810-5876 Jason.Lippy 832-810-5876 Jason.Lippy Contact Me About Jason Jason comes to Indian Wells Country Club by way of Desert Falls Country Club in Palm Desert, where he spent the four years as General Manager / Membership Director. Before moving to California in 2015, Jason spent the previous 12 years working as General Manager / Membership Director for Glen Oaks Country Club, a Invited Affiliate Club in Louisville, Kentucky. \n\nJason has worked in the golf business his entire career, starting in the Golf Shop at The Polo Fields Country Club when he was only 16.  He then moved to Glenmary Country Club to join the Membership Sales Department. Eventually becoming Club Manager at Glenmary Country Club.  Jason is a graduate of Western Kentucky University’s Broadcasting Department and has also worked covering college basketball and football for ESPN.  Jason’s interests include playing golf, spending time with his wife and eight year old daughter exploring the Coachella Valley. Contact Me Mitchell Putnam Membership Director Contact Me 832-810-5872 Mitchell.Putnam Contact Me About Mitchell + Close Mitchell Putnam information modal Mitchell Putnam Membership Director Serving since 2014 832-810-5872 Mitchell.Putnam 832-810-5872 Mitchell.Putnam Contact Me About Mitchell Email:  Mitchell.Putnam@clubcorp.comMitchell holds a BS degree in Criminal Justice from Sam Houston State University. He was born and raised in Houston Texas. He joined the Invited family as Service Captain at Willow Creek Golf Club in 2014, eventually becoming the Membership Director in 2017. He joined The Golf Trails of The Woodlands team in 2018 as the Membership Director. He enjoys playing golf, fishing, and watching Houston sports teams play. Contact Me Annemarie McKay Event Sales Director Contact Me 281-801-4103 Annemarie.Mckay Contact Me About Annemarie + Close Annemarie McKay information modal Annemarie McKay Event Sales Director Serving since 2015 281-801-4103 Annemarie.McKay 281-801-4103 Annemarie.McKay Contact Me About Annemarie Annemarie is originally from Allen, Tx. She holds a Bachelor’s degree in Hospitality Administration from Stephen F. Austin State University, located in the small town of Nacogdoches, Texas. Annemarie started her career with Invited as a college intern at Stonebriar Country Club in Frisco, Tx. After she graduated, she was hired on fulltime as their Private Event Coordinator assisting with corporate and social events. Annemarie then moved forward in here career and stepped into the role of Private Event Manager at the Las Colinas Country Club in Irving, Tx. There she continued to build her range of events and added Golf Tournaments to her portfolio. She had the privilege of working on events such as George W. Bush Presidential Center’s Warrior Open and the 2015 Volunteers of America North Texas LPGA Shootout. Annemarie recently moved to Houston to further pursue her passion for private events and is proud to call the Woodlands Country Club home, as their Private Event Director. Contact Me Brooke Tyler Event Sales Director Contact Me 281-339-8085 Brooke.Tyler Contact Me About Brooke + Close Brooke Tyler information modal Brooke Tyler Event Sales Director Serving since 2009 281-339-8085 Brooke.Tyler 281-339-8085 Brooke.Tyler Contact Me About Brooke Brooke Tyler is a graduate of The University of Texas at Arlington with a degree in Public Relations. She moved to the Houston Area in 2004 where she started her career in the hospitality industry. She worked for Marriott International for five years as an Event Manager planning various events ranging from corporate, social, to weddings. She began her career at The Woodlands Country Club in 2009 as an Event Manager where she planned Member Events, Member Association Events and Golf Tournaments. In 2012, she took over the Private Event Manager role where she focused on selling and executing all private events for The Woodlands Country Club. She has had the pleasure of working with many members, clients and brides to successfully implement their event. Some of her most favorite memories have been made at The Country Club. She has made some of her closest friendships while working here, as well as meeting her husband, Wes. Contact Me Andrea Schaefer Event Sales Coordinator Contact Me Andrea.Schaefer Contact Me + Close Andrea Schaefer information modal Andrea Schaefer Event Sales Coordinator Serving since 2024 Andrea.Schaefer Andrea.Schaefer Contact Me Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Our Story Golf Amenities Membership Host An Event Contact Us THE WOODLANDS COUNTRY CLUB Opens in new window 100 Grand Fairway The Woodlands, TX \r\n                                77381 1 281-863-1400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://countryclubtrentpark.co.uk/contact/",
      "text": "Contact - Country Club Trent Park Skip to content Menu Events Club Policy FAQ’s Contact Menu Menu Events Club Policy FAQ’s Contact Menu Events Club Policy FAQ’s Contact Menu Menu Events Club Policy FAQ’s Contact Contact us ADDRESS Country Club Trent Park, Bramley Rd, London N14 4UW CONTACT NUMBER 020 8363 8800 EMAIL enquiries@countryclubtrentpark.co.uk CLUB OPENING HOURS Monday to Thursday: 10am – 1am Friday & Saturday: 10am – 3am Sunday: 10am – 1am enquiries FEEDBACK We’re keen to hear about your experience, good or bad. GIVE YOUR FEEDBACK CAREERS Get in touch to find out more about joining the Country Club team. enquire now GENERAL ENQUIRIES Have a general question about the club? Get in touch. enquire now Country Club Opening Hours Monday to Thursday 10am - 1am Friday & Saturday: 10am - 3am Sunday: 10am - 1am SIGN UP FOR EXCLUSIVE UPDATES Phone-alt Facebook Instagram Menu Events Club Policy FAQ’s Contact Menu Events Club Policy FAQ’s Contact SIGN UP! receive EXCLUSIVE UPDATES, FREE TICKETS AND MUCH MORE. PHONE Email SIGN UP NOW Careers at the country club Full NAME EMAIL Contact Number Upload your cv Cover Letter Send ENQUIRY"
    },
    {
      "url": "https://business.winterpark.org/list/member/winter-park-country-club-golf-course-winter-park-5007698",
      "text": "Winter Park Country Club & Golf Course | Golf Courses - Private & Public Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map Winter Park Country Club & Golf Course Categories Golf Courses - Private & Public 761 Old England Avenue Winter Park FL 32789 (407) 599-3339 (407) 691-6532 Visit Website Rep/Contact Info Mr. Gregg Pascale × Close Mr. Gregg Pascale Golf Pro Shop Manager Phone: (407) 599-3339 Fax: (407) 691-6532 Send an Email Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Member Login Member Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave., Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://moors-valley.co.uk/contact-us/",
      "text": "Contact Us - Moors Valley Country Park & Forest Skip to main content Skip to footer Things To Do Play Stick Man Trail Adventure Valley Mini Golf Adventure Valley Land Rovers Cycle Hire Go Ape High Ropes Go Ape Nets Adventure Go Ape Forest Segways Moors Valley Railway Ranger Den Health & Fitness Walking, Running & Cycling Golf Course 18 Holes Fishing Laser Tag Events Inside Out Dorset 2025 Bunker Open Day Halloween Halloween Experience Santa Specials Plan Your Visit Opening Times Parking Charges Season Tickets Gift Shop Food and Drink Accessibility Maps Schools and Groups Celebrations FAQ Dogs and Horses Wildlife About Us About the Rangers History of Moors Valley Contact Us World War II Bunker Contact Us Moors Valley is located on the Dorset / Hampshire border – two counties that offer fantastic countryside and visitor attractions to enjoy, including the historic New Forest and the award-winning beaches at Christchurch and the Jurassic Coast World Heritage Site. If you’re visiting the area for the first time, we recommend you take a look at the Visit Dorset and The New Forest websites for more information about the area and visitor attractions nearby. If you’re contacting us about raffle prizes please follow our step by step guide on our dedicated raffle prize requests page. Email : rangers@moors-valley.co.uk Visitor Centre: 01425 470721 The Barn Café: 01425 477665 – info@idhospitalityltd.co.uk Moors Valley Railway: 01425 471415 Go Ape information: 01603 895500 Golf and Activity Centre: 01425 479776 (For questions about another activity eg. Laser Tag, please go to the activity page. ) Address: Moors Valley Country Park, Horton Road, Ashley Heath, Dorset, BH24 2ET Explore More About us Raffle Prize Requests Volunteering Working at Moors Valley Wildlife Subscribe to receive latest news and updates Signup form First Name Last Name Email Submit Things To Do Events Find Us Data Protection and Small Print Our Terms and Conditions Cookie Policy Follow us on Facebook Follow us on Instagram Follow us on X (twitter) Copyright © 2025 • Dorset Council | All Rights Reserved. Moors Valley is a joint venture between Dorset Council and Forestry England. Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Things To Do Play Stick Man Trail Adventure Valley Mini Golf Adventure Valley Land Rovers Cycle Hire Go Ape High Ropes Go Ape Nets Adventure Go Ape Forest Segways Moors Valley Railway Ranger Den Health & Fitness Walking, Running & Cycling Golf Course 18 Holes Fishing Laser Tag Events Inside Out Dorset 2025 Bunker Open Day Halloween Halloween Experience Santa Specials Plan Your Visit Opening Times Parking Charges Season Tickets Gift Shop Food and Drink Accessibility Maps Schools and Groups Celebrations FAQ Dogs and Horses Wildlife About Us About the Rangers History of Moors Valley Contact Us World War II Bunker"
    },
    {
      "url": "https://www.winterpark.org/board-of-director-5-29/",
      "text": "Board of Directors - Winter Park Chamber of Commerce Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map 2025 Board of Directors Executive Committee Laura Walda Chair Lowndes Laura Walda is a shareholder specializing in commercial real estate law, with a focus on contract and lease negotiations, real estate transactions, credit facility structuring, and title insurance review. She also has experience in commercial litigation, particularly in title insurance, landlord/tenant disputes, and banking matters. Dr. Keith Whittingham Chair-Elect Rollins College / Artifx Coffee Carroll Goggin Past-Chair DBG Promotions Carroll Hanley Goggin is the co-owner and CFO of DBG Promotions and a dedicated community and industry leader, serving on national advocacy committees and holding multiple leadership roles at Rollins College. She was appointed to the Florida Council on Arts and Culture in 2020 and has received several awards recognizing her volunteer service. Joel Knopp Treasurer Forvis Mazars LLP Steve Kramer Executive The Mayflower at Winter Park Steve Kramer is President and CEO of The Mayflower at Winter Park, where he has led the organization through its largest expansion since 1989. With a 30-year career spanning healthcare and hospitality leadership, Steve brings a unique blend of operational expertise and civic engagement, including roles with the Winter Park Rotary Club, Leadership Winter Park, and LeadingAge Florida. Arnaldo Oliveras Executive 180 Commercial Real Estate Advisors Arnaldo Oliveras is the CEO of 180 Commercial Real Estate Advisors, a licensed broker and instructor operating in Florida and Puerto Rico, with extensive experience in international commercial real estate and a passion for community service. He actively serves on several boards, including the Hispanic Chamber of Commerce of Metro Orlando and the Rollins Museum of Art, while also championing causes like The Leukemia and Lymphoma Society and supporting the arts and nonprofit fundraising efforts. Emily Williams Executive Be on Park , Clementine , The Grove , and Z Properties Emily Dowling Williams is a Winter Park-based entrepreneur known for her vibrant, design-forward businesses, including Be On Park, Z Properties, The Grove, and Clementine. With a strong background in retail and a passion for curated luxury, she brings color, joy, and high design to Central Florida while actively engaging in the local community. Representatives Mike Carolan Legacy Rep WHWW Michael P. Carolan is a shareholder and chair of the real estate department at Winderweedle, Haines, Ward and Woodman, P.A., Board Certified in Real Estate Law by The Florida Bar. He represents clients in commercial finance, real estate transactions, and business matters, bringing prior experience as a financial analyst and serving in leadership roles with the Winter Park Chamber of Commerce. Dawn Braddy Leadership Winter Park Rep Orange County Clerk of Courts Dawn Braddy is the Operations Assistant Director for the Orange County Clerk of the Court, with over 36 years of service and a strong background in leadership and public administration. A dedicated community volunteer and graduate of Leadership Winter Park, she has earned multiple awards for her service and continues to play an active role in local initiatives through the Winter Park Chamber and other organizations. Board of Directors Ryan DeVos Orlando Magic Ryan DeVos is the Vice President of Shareholder Engagement for the Orlando Magic, leading ownership engagement and long-term family involvement with the team. With a background in NBA global marketing and managing the Magicâs NBA 2K League team, he is also active in community service through various nonprofit boards and initiatives. Diane DiFebbo Full Sail University Diane serves as the Vice President of Accounting and Finance for Full Sail University. Prior to joining Full Sail University in June 2017, Diane served as a principal in the Orlando office of CliftonLarsonAllen, LLP. Diane has over 27 years of experience in financial accounting and reporting, business advisory services, and business operations. Ed Kania Rollins College Ed Kania is Vice President of Business & Finance and Treasurer at Rollins College, bringing extensive financial leadership experience from previous roles at Davidson College and in auditing. He is an active community leader and mentor, serving on multiple boards and recognized for his service by NACUBO. Aimee Hitchner Maynard Nexsen Aimee is an attorney at Maynard Nexsen specializing in trusts, estates, business planning, and family business services, with a strong entrepreneurial background. She helps clients protect their business assets and family legacy through comprehensive legal planning, including succession, asset protection, and various commercial agreements. Patrick Lewis PrivÃ© Salon and Spa Patrick is a Texas Christian University graduate who transitioned from a career in mortgage banking to co-owning and managing Prive Salon and Spa in Winter Park. An active community leader and Leadership Winter Park alumnus, he is passionate about supporting local businesses and balancing family life with his roles in various community committees. Ivan Lys-Dobradin The Gulf Stream Law Firm Ivan Lys-Dobradin is the founder of The Gulf Stream Law Firm PLLC, specializing in residential and commercial property damage insurance disputes in Central Florida. A longtime Winter Park resident, he is actively involved in the community as president of the Winter Park History Museum, a Winter Park Chamber committee member, and an assistant coach at the Orlando Rowing Club. Markys Mackey Verity Construction Kelly Nierstedt Orlando Health Kelly Nierstedt is president of Orlando Health Orlando Regional Medical Center and senior vice president of Orlando Health, leading one of the nationâs largest hospitals with a focus on expanding care access and clinical excellence. With a nursing background and a passion for womenâs health, she is recognized for her leadership in healthcare innovation and advocacy for diversity and equity. Paul Twyford The Winter Park Distilling Company Paul Twyford is a serial entrepreneur and co-founder of The Winter Park Distilling Company, who also owns Hidden Potential, a clinic for children with Autism, and runs the Bonfire clubhouse at Winter Pines Golf Club. A dedicated community leader and Rollins College alumnus, Paul has served in multiple local leadership roles and received recognition as Winter Park Chamber Volunteer of the Year. Alex Uncein First Citizens Bank Alex Uncein is Vice President and Financial Sales Manager at First Citizens Bank, leading business development in the Greater Orlando area with a focus on strategic partnerships and financial solutions. Originally from Venezuela, he brings extensive leadership experience from both banking and industry, actively mentors in the community, and serves as a trustee for the Winter Park Chamber of Commerce. You know your business is capable of more. We can help. Join the Winter Park Chamber © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Â Member Login Member Â Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave.,Â Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "text": "GOT HERE\n\t\t\t\tArray\n(\n    [strictly_necessary] => Array\n        (\n        )\n\n    [functional] => Array\n        (\n        )\n\n    [performance_analytics] => Array\n        (\n        )\n\n    [advertisement_targeting] => Array\n        (\n        )\n\n    [gtm] => Array\n        (\n            [0] => Google Tag Manager (Head)\n            [1] => [2] => on\n        )\n\n) Contact Us - Whittlebury Park We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. View Options Accept All Close Cookie Preferences This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. View More Show Less View our Cookie Policy Accept All Strictly Necessary Always Enabled We use necessary cookies to ensure our website works properly and provide essential functionalities and security features. These cookies do not collect any personal information and are always enabled. By continuing to use our website, you agree to our use of these cookies. V:2 - 2025-04-29 01:28:12pm Functional Disabled Enabled Functional cookies enable specific functionalities such as social media sharing, feedback collection, and other third-party features. These cookies may collect anonymous data to improve user experience. V:2 - 2025-04-29 01:28:12pm Performance and Analytics Disabled Enabled To enhance user experience, we use performance and analytical cookies to understand and analyze the key performance indexes of our website. Performance cookies help us deliver better user experiences by tracking metrics such as load times and response times. Analytical cookies help us understand how visitors interact with our website by providing information on metrics like the number of visitors, bounce rate, traffic source, and more. Cookie _ga_*ID* Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy Cookie _ga Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Advertisement and Targeting Disabled Enabled To personalize your online experience, we use advertisement cookies that track your activity across websites and gather information to display relevant ads and marketing campaigns. These cookies help us tailor our advertising to your interests and preferences. Cookie _gcl_au Duration 3 months Description Used by Google AdSense for experimenting with advertisement efficiency across websites using their services. Vendor Google Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Reject All Accept Selected Powered by UP Hotel Agency Skip to content Menu Stay Spa Packages Christmas Shop Contact Book General Contact Us If you need to contact us for any reason please use the form below Continue Contact Us Form Name (Required) First Last Email (Required) Telephone (Required) Postcode (Required) Postcode Type of enquiry (Required) Hotel Meetings & Events The Day Spa The Leisure Club Dining Press Tribute Nights & Events Lost Property Weddings Comments (Required) CAPTCHA Have you viewed our essential information pages? Spa Spa Essential Information View here The Leisure Club The Leisure Club Essential Information View here Golf Golf Essential Information View here Motorsport Camping Essential Information View here Stays Room Information View here Dining Dining Options View here Customer Service Telephone Numbers Need to get in touch? Please note our reservation hours are: Monday – Sunday, 9:00am – 10:00pm Hotel and Dining reservations: 01327 850 489 Spa reservations: 01327 850 489 Conference and Events: 01327 850 490 Silverstone Hospitality Packages: 01327 850 438 Tribute Nights: 01327 850 489 The Leisure Club: 01327 850 450 Christmas reservations: 01327 850 490 Hotel reception and Guest Relations: 01327 857857 General Where to find us Whittlebury Park is easily accessible no matter what your preferred method of transport is, whether it be road, rail, or air. Situated in the heart of the country and within minutes of the M1 and M40, perfectly placed between London and Birmingham. Plus with 650 car park spaces, parking is extensive and complimentary for guests. Find us General Newsletter sign-up Be the first to hear about our news & offers, straight to your inbox. Sign-up Follow Us Whittleburypark instagram Stay in touch for the latest News & Offers By signing up, you agree to the Terms & Conditions and would like to be added to the mailing list. Useful Links Blog Contact Us Where to find us Careers Donations Sign-up to our newsletter Hotel Rooms & Suites Hotel Breaks Spa Breaks Golf Breaks Family Breaks Spa Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Golf Book a tee time TopTracer Driving Range Groups & Society Memberships Packages Courses & Facilities Essential Information Contact us Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH T: 01327 857857 E: reception@whittlebury.com Legal Cookie Control Privacy Policy Terms & Conditions Accessibility facebook instagram linkedin © Whittlebury Hall and Spa Limited, Registered Number: 7839199. V.A.T. Registration Number: 257 6855 56 The Atrium, Whittlebury Park, Whittlebury, Towcester, Northamptonshire, NN12 8WP Website by Up Hotel Agency Make a Booking Close Package Finder Breaks Spa Day Packages Gift Cards Treatments Tee Times TopTracer Driving Range Small Meeting Rooms Afternoon Tea Murrays Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us Stay Spa Golf Dining Meeting & Events Weddings & Occasions Package Finder Shop Christmas The Leisure Club What's On Motorsports Go Back Hotel Breaks Spa Breaks Golf Breaks Family Breaks Rooms & Suites Go Back Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Go Back Book a Tee Time TopTracer Driving Range Golf Membership Groups & Society Golf Packages Courses & Facilities Go Back Afternoon Tea Murrays Astons Restaurant Silverstone Bar Sunday Lunch Atrium Clubhouse & Driving Range Go Back Book a small meeting space Our Spaces Team Building Meet the Team Go Back Dry Hire Wedding Packages Enquire about our Weddings Go Back Spa Days Spa Breaks Hotel Breaks Family Breaks Golf Breaks Autumn at the Park Go Back Whittlebury Gift Cards Afternoon Tea For Two People Murrays Tasting Menu for Two People 18 Holes of Golf for Two People 3-Course Sunday Lunch for Two People Go Back Christmas Party Nights Christmas Three-Night Stay New Year's Eve Gala Ball Winter Spa-kle Retreat Go Back Facilities Membership Classes Timetable Essential Information Refer a friend Go Back Retro Electro 80s Murder Mystery Go Back British Grand Prix MotoGP Silverstone Festival Close 01327 857857 reception@whittlebury.com Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us facebook instagram linkedin This browser is no longer supported In order to have the best experience, please update your browser. If you choose not to update, this website may not function as expected. Clicking the button below will help you to update your browser. Update Your Browser Continue Without Updating Close"
    }
  ]
}