{
  "fuentes": [
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "ehernandez@mosaicmomentum.org"
    },
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "info@mosaicmomentum.org"
    },
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "jfoley@mosaicmomentum.org"
    },
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "lhiura@mosaicmomentum.org"
    },
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "mberkowitz@mosaicmomentum.org"
    },
    {
      "url": "https://mosaicmomentum.org/about/",
      "email": "mjacobs@mosaicmomentum.org"
    },
    {
      "url": "https://www.vanportmosaic.org/about-us",
      "email": "info@vanportmosaic.org"
    },
    {
      "url": "https://mosaic-miami.org/contact-us/",
      "email": "info@mosaic-miami.org"
    },
    {
      "url": "https://www.mosaicpearland.org/about-us",
      "email": "info@mosaicpearland.org"
    },
    {
      "url": "https://groupmosaic.com/contact-us/",
      "email": "info@groupmosaic.com"
    },
    {
      "url": "https://groupmosaic.com/contact-us/",
      "email": "info@mosaicgroup.com"
    },
    {
      "url": "https://simplywall.st/stocks/us/materials/nyse-mos/mosaic/management",
      "email": "peter@google.com"
    },
    {
      "url": "https://mosaicamerica.org/contact/",
      "email": "info@mosaicamerica.org"
    },
    {
      "url": "https://mosaicms.com/contact-us/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://joinmosaic.com/contact-us/",
      "email": "loanservicing@joinmosaic.com"
    },
    {
      "url": "https://joinmosaic.com/contact-us/",
      "email": "press@joinmosaic.com"
    },
    {
      "url": "https://joinmosaic.com/contact-us/",
      "email": "refi@joinmosaic.com"
    },
    {
      "url": "https://www.mosmanpark.wa.gov.au/contact/",
      "email": "admin@mosmanpark.wa.gov.au"
    }
  ],
  "mails": [
    "admin@mosmanpark.wa.gov.au",
    "app-promo-phones@2x.png",
    "chosen-sprite@2x.png",
    "ehernandez@mosaicmomentum.org",
    "info@groupmosaic.com",
    "info@mosaic-miami.org",
    "info@mosaicamerica.org",
    "info@mosaicgroup.com",
    "info@mosaicmomentum.org",
    "info@mosaicpearland.org",
    "info@vanportmosaic.org",
    "jfoley@mosaicmomentum.org",
    "lhiura@mosaicmomentum.org",
    "loanservicing@joinmosaic.com",
    "mberkowitz@mosaicmomentum.org",
    "mjacobs@mosaicmomentum.org",
    "peter@google.com",
    "press@joinmosaic.com",
    "refi@joinmosaic.com"
  ],
  "nombre_sitio": "cityofbartow.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mosaicmomentum.org/about/",
      "text": "Who we are – Mosaic Skip to content Mosaic Boosting the collective power of the environmental movement across climate, conservation, and environmental health and justice. Who we are Our impact Our grantmaking Funding partners The latest Who we are WHO WE ARE Mosaic is a national funder and field catalyst that boosts the collective power of climate, conservation, and environmental health and justice movements in the United States to achieve durable, population-scale wins. A participatory grantmaker governed by a Leadership Council of grassroots, nonprofit, and philanthropy movement leaders, Mosaic supports the connectivity and shared tools — also known as movement infrastructure — advocates and activists need to build and exercise power across demographics, geographies, and issue silos. Our History Mosaic was created in response to a collective recognition that, although the U.S. environmental movement has achieved historic victories, the pace and scale of the challenges we face demand even more of all of us. More than 100 NGO, philanthropy, and academic leaders from diverse organizations across the country participated in an 18-month design process that launched Mosaic in 2020 with seed funding from the Hewlett, Packard, Walton Family, and Pisces Foundations. These leaders unanimously confirmed that stronger movement infrastructure is indispensable to enable the environmental movement to take advantage of its strengths — like size — and diminish its weaknesses — like unproductive competition and inequitable access to funding. Our Team Mosaic is led by a diverse constellation of environmental and justice leaders and supported by a small staff. Leadership Council Angela Mahecha Adrar Tishman Environment and Design Center, The New School Angela Mahecha Adrar is the Program Director of the Environmental Justice Movement Fellowship. She has committed her life to advancing the role of the grassroots sector and provides agile leadership and structure to address and adapt to the changing and complex priorities of local communities while influencing national and international agendas. David Beckman Pisces Foundation David Beckman is President of the Pisces Foundation and its founding staff member. He leads the Foundation's efforts to support innovators working to ensure people and nature thrive. Since 2017, he also has worked with partners to create Mosaic. Previously, David led the Water Program at the Natural Resources Defense Council. Jacqueline Patterson The Chisholm Legacy Project Jacqueline Patterson is the Founder & Executive Director of The Chisholm Legacy Project. Since 2007, Patterson has served as coordinator & co-founder of Women of Color United. She has worked as a researcher, program manager, coordinator, advocate and activist working on gender justice, HIV&AIDS, racial justice, economic justice, and environmental and climate justice. Kate Sinding Daly Conservation Law Foundation Kate Sinding Daly is the Executive Director of NorthLight Foundation. Prior to her current role, she was senior advisor to the president of the Natural Resources Defense Council (NRDC), a senior attorney and deputy director of NRDC's New York program, and was a partner in the specialty environmental law firm of Sive, Paget & Riesel, P.C. Mily Treviño-Sauceda Alianza Nacional de Campesinas, Inc. Mily Treviño-Sauceda is the Executive Director & Co-Founder of Alianza Nacional de Campesinas, Inc., the first national farmworker women's organization in the U. S. created by current and former farmworker women, along with women who hail from farmworker families. Rahwa Ghirmatzion Just Solutions Collective Rahwa Ghirmatzion is the Executive Director of PUSH, a community organization that works at the grassroots to create and implement a comprehensive revitalization plan for Buffalo's West Side, with more than $60 million invested in affordable housing rehabilitation, solar installation, green jobs training, weatherization and green infrastructure. Rashad Morris Philanthropic Advisors Rashad Morris is a Program Officer with the Bullitt Foundation where he manages the Foundation's Energy, Climate, and Materials and Deep Green Buildings programs. Rev. Susan Hendershot Self-Help Climate Capital Rev. Susan Hendershot is the Director of Climate Community Engagement for Self-Help Climate Capital, a part of the Center for Community Self-Help. Rev. Hendershot currently serves on the Board of The Center for Spirituality in Nature and as a member of the Interfaith Women Council of the UN Environment Program's Faith for Earth Initiative. She previously served as a member of the White House Environmental Justice Advisory Council. Tonya Bonitatibus Savannah Riverkeeper Tonya Bonitatibus is the Riverkeeper and Executive Director of Savannah Riverkeeper, watching over the health and vibrancy of the Savannah River. She has served in that role for over 13 years, helping successfully guide the organization through threats to water quality, including the recent fight against the Palmetto Pipeline. Alumni Abigail Dillen Earthjustice Abigail Dillen is the President of Earthjustice, leading the organization's staff, board and supporters to advance the mission of using the courts to protect our environment and people's health. Collin O'Mara National Wildlife Federation Collin O'Mara is the President and CEO of the National Wildlife Federation, America's largest wildlife conservation organization with more than six million members and 52 state and territorial affiliates. Dr. Andrea Yodsampa DEPLOY/US Dr. Andrea Yodsampa is CEO of DEPLOY/US , a convener, re-grantor, and accelerator of climate leadership across the political spectrum. DEPLOY/US works to accelerate the right-of-center climate leadership essential for ambitious, durable US-led decarbonization. She brings to DEPLOY/US a commitment to depolarizing and accelerating climate action, as well as expertise in NGO coordination and philanthropy. Dr. Cecilia Martinez Bezos Earth Fund Dr. Cecilia Martinez is the Chief of Environmental and Climate Justice at the Bezos Earth Fund. Cecilia joined the Earth Fund after serving as the Senior Director for Environmental Justice at the White House Council on Environmental Quality in the Biden Administration. In this role, she helped to establish a whole of government approach to equitable climate and environmental policy. Gabrielle Strong NDN Collective Gaby Strong, citizen of Sisseton-Wahpeton Dakota Oyate, is the Director of Grantmaking for NDN Collective, a national Indigenous-led community development organization, where she oversees grantmaking strategy. Gaby has nearly forty years of experience in philanthropic, non-profit and tribal arenas. Melissa Lin Perrella Natural Resources Defense Council Melissa Lin Perrella is the Natural Resources Defense Council's (NRDC) Senior Director of the Environmental Justice, Healthy People & Thriving Communities program where she represents communities that have been hardest hit by freight-related air pollution. Michael Brune Sierra Club Michael Brune was the Sierra Club’s Executive Director 2010-2021. Under Brune’s leadership, the Sierra Club has grown to more than 3.8 million supporters and is at the forefront of the drive to move to 100% clean, renewable energy, while also protecting America’s remaining wild places. Brune is a nationally recognized writer, speaker, and commentator on energy and environmental issues. Miya Yoshitani Asian Pacific Environmental Network Miya Yoshitani is the Executive Director of the Asian Pacific Environmental Network (APEN). A movement leader in many key local, state, and national alliances, APEN is helping to shift the center of gravity of what is possible when the health and economic well being of working families, immigrant and communities of color are put at the center of solutions to the economic and climate crises. Staff Maya Berkowitz Development Director Maya Berkowitz (she/her) is a resource mobilizer and philanthropic leader with over a decade of experience supporting movement ecosystems grounded in systems change work. As the Development Director Maya stewards Mosaic’s strategic partnerships with donors and philanthropists to amplify our collective impact to resource the capacity of our environmental movement grantee partners and the field as a whole. Danielle Levoit Program Officer Danielle Levoit (she/her) is a philanthropic leader with seventeen years of experience advancing equity and impact in the environmental movement. As Program Officer at Mosaic, Danielle leads the development of grantmaking strategy and implementation and strengthens relationships with grantee partners to build a more connected and effective movement. Julian Foley Dir of Comms and Strategic Projects Julian Foley (she/her) is a strategic communications and nonprofit leader with 20 years of experience helping organizations move hearts, minds, and money in service of environmental and economic justice. As Director of Communications and Strategic Initiatives Julian leads Mosaic’s strategic communications and related efforts aimed at catalyzing a more aligned and interconnected environmental movement. Eva Hernandez Executive Director Eva Hernandez (she/her) is a visionary nonprofit leader and movement strategist with over 20 years of experience serving the US environmental movement as an organizer, strategist, and leader at organizations like Sierra Club, MoveOn, and Dogwood Alliance. As Executive Director, Eva leads Mosaic’s overarching work to boost the collective power of climate, conservation, and environmental health and justice movements in the United States to achieve durable, population-scale wins. Leigh Hiura Operations Manager Leigh Hiura (she/her) is a masterful operations professional with over ten years of experience making nonprofits run smoothly. As Mosaic’s Operations Manager, Leigh supports and streamlines Mosaic’s IT systems and back-end processes to ensure our team can stay laser focused on strengthening environmental movement infrastructure. Our Values JUST, INCLUSIVE & EQUITABLE Center equity and transparency, engaging people and organizations of all sizes and types, not just funders or large organizations. Learn more about our commitment to equity . CO-CREATIVE Seek and incorporate broad input into initiative design and governance, sharing power and agency. COMPLEMENTARY Reinforce and complement field-wide capacity, focusing on amplifying the work of others. ADAPTIVE Continuously experiment, iterate, and adapt based on feedback and experiences, both successes and failures. TRANSFORMATIVE Pledge to boldness in unlocking systems-level opportunities. Our Funders Mosaic’s work is supported by a community of systems-focused funders who understand that we need to build power at an unprecedented scale if we are to effect the kind of durable, transformational environmental progress our world needs right now. We welcome additional funding partners to this community of purpose. Together, we can support a movement that is better connected, aligned, and collaborative, enabling us to win the biggest victories. Learn more about our funders and funding partnerships . FOLLOW US. 268 Bush Street San Francisco CA 94104 415-364-3777 info@mosaicmomentum.org ©2025 Mosaic Privacy Policy Terms of Use Mosaic is a fiscally sponsored project of the Tides Center, a 501(c)(3) non-profit organization. Copyright © 2023 Mosaic"
    },
    {
      "url": "https://www.vanportmosaic.org/about-us",
      "text": "About Us | VANPORT MOSAIC — The Vanport Mosaic About Us Programs The 10th Vanport Mosaic Festival Memory Activism Calendar Press Connect Partner with us! Back Oral History The Living Archive Exhibits Community Gatherings Theater Tours Festival About Us Programs Oral History The Living Archive Exhibits Community Gatherings Theater Tours Festival The 10th Vanport Mosaic Festival Memory Activism Calendar Press Connect Partner with us! A platform for memory activism Scroll Our Story Our Values Our Team The Collective Why Vanport Get Involved We Are a Memory-Activism Platform For the past 10 years, we've brought together storytellers, artists, educators, and community members to honor erased histories and reimagine belonging. Learn More Our Mission We are a memory-activism platform. Vanport Mosaic amplifies, honors, and preserves the silenced histories that surround us to better understand our present and shape a future where we all belong. Our Story Vanport Mosaic was born from a collective desire to make the invisible visible. Since 2014, we’ve brought together Vanport flood survivors, descendants, artists, activists, educators, and historians to co-create spaces of collective memory and healing. We began as a grassroots initiative and have since evolved into a nationally recognized nonprofit platform for memory activism. 🎬 2015: First Vanport Mosaic Festival 🏆 2022: National Trust for Historic Preservation Recognition 🥇 2023: AASLH Leadership in History Award style=\"padding: 3em 1em; background-color: #fdf9f1;\"> Our Values Memory Activism We honor erased histories by amplifying community voices and lived experiences. Collective Storytelling We believe in telling stories with people, not about them. Justice Through Joy We use art and celebration to heal, remember, and envision a more just future. Meet Our Team We are artists, educators, historians, and storytellers working together to honor memory and reimagine belonging. Laura Lo Forti Co-Founder & Director A multimedia storyteller, Story Midwife and cultural organizer. Damaris Webb Co-Founder & All Power Initiative Director A theater maker and social justice advocate. Chisao Hata Community Weaver A performing artist, community organizer, advocate, and global citizen artist. Laveta Gilmore Board of Directors Member & Outreach Coordinator A Vanport Descendant and community organizer. Greta Smith Program Manager An oral and public historian and researcher. The Vanport Mosaic Collective Is: A living, evolving community of memory workers: artists, educators, storytellers, historians, cultural strategists, survivors, descendants, and organizers. Alex Chiu Illustrator / Muralist Andrew DeVigal UO-SOJC Agora Journalism Center Director Angie Fadel Mindfulness Guide Beatrice Gilmore Vanport Survivor Brian Burk Multimedia Producer Darrell Grant Jazz Pianist, Composer, and Educator Donovan Scribes Journalist / Community Organizer Ed Washington Vanport Survivor / Civic Leader / Vanport Mosaic Board Member Emmalee McDonalds Photographer / Video Producer Heather Mcafee Human Geographer Heath Hyun Actor / Director Henk Pander Fine Art Painter Show More Partnering Organizations Oregon Historical Society Oregon Humanities Oregon Black Pioneers Albina Music Trust Portland Bureau of Emergency Management Port of Portland Portland International Raceway Multnomah County Drainage District Portland Parks and Recreation Matt Dishman Center North Portland Neighborhood Services Ignorant/Reflections Open Signal Portland Community College Portland State University Confluence Project Fair Housing Council of Oregon Expo Center Irvington Covenant Church Leaven Community Vancouver Avenue Baptist Church University of Oregon School of Architecture Preservation Program University of Oregon School of Journalism and Communication UO Agora Center for Journalism Innovation and Civic Engagement The Sharing History through Active Reminiscence and Photo-imagery program Donate Join our effort and help us fight historical amnesia. With your help, we can continue to amplify, honor, and preserve the silenced histories that surround us. DONATE Our story and mission Funders and Sponsors Partnering Organizations Donate to Vanport Mosaic Become a Memory Activist Sign up for our newsletter to keep up to date on events and happenings. Email Address Sign Up We respect your privacy. Thank you! 5131 Northeast 23rd Avenue, Portland, OR, 97211, United States 510.717.2441 info@vanportmosaic.org Hours Column One Home Column Two The Living Archive Resources Column Three Events Calendar News & Press VANPORT, THE MIRACLE CITY Column Four Connect Donate The Vanport Mosaic is a 501(c)(3) registered non-profit organization. Photography  credits: The City of Portland Archives | Copyright © 2019. All Rights Reserved. Donate Become A Memory Activist Sign up for our newsletter to keep up to date on events and happenings. Email Address Sign Up We respect your privacy. Thank you!"
    },
    {
      "url": "https://mosaic-miami.org/contact-us/",
      "text": "Mosaic Miami | Get in Touch with Us Hamburger Main Items Who We Are Meet Our People Our Events Our Sponsors Our News Programs Column What We Do Can We Talk? Clergy Dialogue Emerging Leaders Hank Meyer Headliner Award Metrotown Humanitarian Dinner Buy Tickets Nomination Form Third Column Support Us Contact Click to open the search input field Click to open the search input field Search Menu Menu What We Do Our Events Our Sponsors Our News Donate Connect with Us Get in touch with us today to learn about our upcoming events and discover how you can get involved in continuing to transform our community. PO BOX 140248 Miami, FL 33114 T: 305.755.6096 I F: 305.755.6094 info@mosaic-miami.org Let’s Talk Fill in the form to connect with Mosaic Miami. Contact Us Name Last Name Company / Organization * Email What would you like to discuss? * Partner with us Volunteer with us Subscribe to our newsletter Other (Add reason in Message box) Message Submit If you are human, leave this field blank. Follow Us Quick Links Events Donate News Contact EMBRACING DIVERSITY. BUILDING COMMUNITY. PO BOX 140248, Miami, FL 33114 T: 305.755.6096 I F: 305.755.6094 info@mosaic-miami.org Subscribe to our newsletter © 2025 Mosaic Miami | Site Designed and Developed by Roar Media | Scroll to top Scroll to top Scroll to top The owner of this website has made a commitment to accessibility and inclusion, please report any problems that you encounter using the contact form on this website. This site uses the WP ADA Compliance Check plugin to enhance accessibility. Subscribe to our newsletter Keep up with the Mosaic Miami community by subscribing to our newsletter so you never miss an impactful conversation, engaging event, or new development as we advance our mission to unite Miami, one community connection at a time. Email Sign-up First & Last Name * Last Name * Phone * Email * Submit If you are human, leave this field blank."
    },
    {
      "url": "https://www.mosaicpearland.org/about-us",
      "text": "Who We Are — Mosaic 0 Skip to Content I'm New About Us Who We Are Our Team F.A.Q.s Partners ST. ANDREW'S EPISCOPAL CHURCH MOSAIC IN ACTION EPISCOPAL DIOCESE OF TEXAS Contact Merch GIVE Open Menu Close Menu GIVE I'm New About Us Who We Are Our Team F.A.Q.s Partners ST. ANDREW'S EPISCOPAL CHURCH MOSAIC IN ACTION EPISCOPAL DIOCESE OF TEXAS Contact Merch Open Menu Close Menu I'm New Folder: About Us Back Who We Are Our Team F.A.Q.s Folder: Partners Back ST. ANDREW'S EPISCOPAL CHURCH MOSAIC IN ACTION EPISCOPAL DIOCESE OF TEXAS Contact Merch GIVE Our Mission: To know Jesus and make Jesus known Our Journey: from Strangers to Neighbors from Consumers to Creators from Wanderers to Wonderers Our Values: to be Inclusive: Where everybody — seeker and skeptic, Democrat and Republican, LGBTQIA+ and straight, young and old — has a real place at the table. We mean it. We truly mean it when we say “Ya’ll means ALL!” Wherever you are on your spiritual journey, you are truly welcome here. Photo by Nour Chamoun on Scopio to be Bold: Where we are rooted in the gospel of Jesus Christ, which tears down walls and builds up life. Where there is authentic joy in gathering to worship God and power in discovering that our lives working together can serve and change the world. to be Community: Where “a bunch of outcasts and oddballs gathered at a table, not because they are rich or worthy or good, but because they are hungry, because they said yes. And there's always room for more.” - Rachel Held Evans Mosaic Episcopal Church To know Jesus and make Jesus known 11901 Shadow Creek Pkwy #133 Pearland, TX 77584 Contact Us"
    },
    {
      "url": "https://groupmosaic.com/contact-us/",
      "text": "Contact Us | Mosaic Group Skip to content Home About Us Our Vision & Our Mission Meet Our Team Our Work At-a-Glance Community Solutions for Health Equity Complex Planning for Sustainable Change Behavioral Health Integration Overdose Prevention and Response Our Clients Our Impact News & Resources News Research & White Papers Reports & Toolkits Mosaic Group’s MOUD Toolkit Peer Recovery Coaches in Hospital EDs Families Strong Self-Care Info Reverse The Cycle Materials Reverse The Cycle Webinars Peer Recovery Coach Directory Peer Recovery Coach Tips Mosaic Minute: A Peer Recovery Coach Newsletter Beacon of Hope Awards 2025 Beacon of Hope Awards 2025 Beacon of Hope Awards Nomination Form 2024 Beacon of Hope Recipients 2023 Beacon of Hope Award Recipients Contact Us Follow Follow Follow Follow Contact Us We’d Love to Work With You Bringing all the pieces together for a healthier community Contact us today Name Organization Email Address Phone Number Message 15 + 14 = SUBMIT 1122 Kenilworth Drive, Suite 313 Towson, MD 21204 410-852-4263 info@groupmosaic.com Mosaic Group Ready to Get Started? Contact Us Bringing all the pieces together for a healthier community Mosaic Group is a certified women-owned small business. STAY CONNECTED Join our email list. Name Email 12 + 5 = Submit CONTACT US Mosaic Group 1122 Kenilworth Drive, Suite 313 Towson, MD 21204 410-852-4263 Follow Follow Follow Follow ©2023 Mosaic Group. All rights reserved. Share This Facebook Twitter Print Friendly LinkedIn Like"
    },
    {
      "url": "https://simplywall.st/stocks/us/materials/nyse-mos/mosaic/management",
      "text": "The Mosaic Company (MOS) Leadership & Management Team Analysis - Simply Wall St Dashboard Portfolios Watchlist Community Discover Screener NOT FOR DISTRIBUTION The Mosaic Company NYSE:MOS Stock Report Market Cap: US$10.2b Portfolio Add to Portfolio Holding More actions … Portfolio Add to Portfolio Holding … Company Overview 1 Valuation 2 Future Growth 3 Past Performance 4 Financial Health 5 Dividend 6 Management 7 Ownership Other Information Stock Community View Dividend Mosaic Management Management criteria checks 3/4 Mosaic's CEO is Bruce Bodine, appointed in Aug 2023,  has a tenure of 2.08 years.  total yearly compensation is $9.88M, comprised of 12.1% salary and 87.9% bonuses, including company stock and options.  directly owns 0% of the company’s shares, worth $23.48K. The average tenure of the management team and the board of directors is 2.7 years and 5.7 years respectively. Key information Bruce Bodine Chief executive officer US$9.9m Total compensation CEO salary percentage 12.14% CEO tenure 2.1yrs CEO ownership 0.0002% Management average tenure 2.7yrs Board average tenure 5.7yrs Recent management updates Insider recently sold US$643k worth of stock Jun 03 Insider notifies of intention to sell stock May 30 CEO, President & Director recently sold US$5.7m worth of stock May 11 CEO, President & Director notifies of intention to sell stock May 09 The Mosaic Company, Annual General Meeting, May 29, 2025 Apr 17 + 1 more update High number of new directors Feb 02 Show all updates Recent updates Second quarter dividend of US$0.22 announced Sep 01 Consensus EPS estimates increase by 34% Aug 13 New major risk - Revenue and earnings growth Aug 08 Mosaic: A Strong Foundation, But Not A Buy (For Now) Aug 08 Second quarter 2025 earnings: EPS exceeds analyst expectations while revenues lag behind Aug 06 Why The Mosaic Company (NYSE:MOS) Could Be Worth Watching Jul 28 The Mosaic Company to Report Q2, 2025 Results on Aug 05, 2025 Jul 16 We Think Mosaic (NYSE:MOS) Is Taking Some Risk With Its Debt Jul 14 Insider recently sold US$643k worth of stock Jun 03 Mosaic (NYSE:MOS) Shareholders Will Want The ROCE Trajectory To Continue Jun 02 Insider notifies of intention to sell stock May 30 Upcoming dividend of US$0.22 per share May 29 The Mosaic Company (NYSE:MOS) Stocks Shoot Up 30% But Its P/E Still Looks Reasonable May 20 Consensus EPS estimates increase by 10% May 14 Price target increased by 7.1% to US$35.54 May 13 CEO, President & Director recently sold US$5.7m worth of stock May 11 CEO, President & Director notifies of intention to sell stock May 09 First quarter 2025 earnings: EPS exceeds analyst expectations while revenues lag behind May 07 Is It Time To Consider Buying The Mosaic Company (NYSE:MOS)? Apr 20 The Mosaic Company, Annual General Meeting, May 29, 2025 Apr 17 + 1 more update Investor sentiment deteriorates as stock falls 15% Apr 08 Is Mosaic (NYSE:MOS) Using Too Much Debt? Apr 05 Dividend of US$0.22 announced Mar 24 The Mosaic Company (NYSE:MOS) Shares Could Be 46% Below Their Intrinsic Value Estimate Mar 20 Consensus EPS estimates increase by 18% Mar 10 Mosaic's Revenue Is Growing, But Investors Should Worry About Its Profits Mar 06 Earnings Miss: The Mosaic Company Missed EPS By 9.3% And Analysts Are Revising Their Forecasts Mar 05 Mosaic (NYSE:MOS) Is Increasing Its Dividend To $0.22 Mar 02 The Mosaic Company Provides Sales Volumes Guidance for the First Quarter of 2025 and Production Volumes Guidance for the Full Year 2025 Mar 01 Full year 2024 earnings: EPS misses analyst expectations Feb 28 Upcoming dividend of US$0.22 per share Feb 27 Mosaic's (NYSE:MOS) Shareholders Will Receive A Bigger Dividend Than Last Year Feb 07 The Mosaic Company to Report Q4, 2024 Results on Feb 27, 2025 Feb 07 High number of new directors Feb 02 Consensus EPS estimates increase by 23% Jan 28 Mosaic (NYSE:MOS) Will Pay A Larger Dividend Than Last Year At $0.22 Jan 17 Mosaic (NYSE:MOS) Hasn't Managed To Accelerate Its Returns Jan 08 Mosaic (NYSE:MOS) Has Announced That It Will Be Increasing Its Dividend To $0.22 Dec 26 Dividend of US$0.22 announced Dec 26 Mosaic's Moment: Why This Inflation-Linked Stock Is Ready To Bloom Dec 22 Mosaic (NYSE:MOS) Takes On Some Risk With Its Use Of Debt Dec 16 Are Investors Undervaluing The Mosaic Company (NYSE:MOS) By 39%? Dec 02 Upcoming dividend of US$0.21 per share Dec 01 Mosaic: Take The Cyclical Opportunity Nov 21 Mosaic (NYSE:MOS) Is Due To Pay A Dividend Of $0.21 Nov 18 Third quarter dividend of US$0.21 announced Nov 17 Earnings Miss: The Mosaic Company Missed EPS By 32% And Analysts Are Revising Their Forecasts Nov 14 Third quarter 2024 earnings: EPS and revenues miss analyst expectations Nov 13 Jarden Reportedly Tapped for Incitec Pivot Fertiliser Sale Nov 12 Incitec Pivot to Revive Fertiliser Business Sale Campaign Nov 11 What Does The Mosaic Company's (NYSE:MOS) Share Price Indicate? Nov 10 Mosaic Company: Good Entry Here To Get Long Food Inflation Nov 05 The Mosaic Company to Report Q3, 2024 Results on Nov 12, 2024 Oct 23 The Mosaic Company's (NYSE:MOS) Share Price Is Matching Sentiment Around Its Revenues Oct 13 Mosaic: A Value Investor's Dream Sep 25 The Mosaic Company(NYSE:MOS) dropped from FTSE All-World Index (USD) Sep 23 Here's Why Mosaic (NYSE:MOS) Has A Meaningful Debt Burden Sep 16 Second quarter dividend of US$0.21 announced Aug 26 Operational Efficiencies And Decisive Growth Initiatives Poised To Enhance Financial Performance Despite Analyst Concerns Aug 25 Mosaic's efficiency improvements and cost reduction efforts are set to enhance its financial performance by lowering expenses. Insider recently sold US$1.1m worth of stock Aug 16 Insider notifies of intention to sell stock Aug 15 Consensus EPS estimates fall by 64% Aug 14 Second quarter 2024 earnings: EPS and revenues miss analyst expectations Aug 07 The Mosaic Company to Report Q2, 2024 Results on Aug 06, 2024 Jul 18 The Mosaic Company Reiterates Sales Guidance for the Second Quarter of 2024 Jun 25 Mosaic: Today's Definition Of A Contrarian Value Pick Jun 09 Upcoming dividend of US$0.21 per share May 30 Consensus EPS estimates fall by 19% May 11 Consensus EPS estimates fall by 18% May 09 Investors Take Note, Mosaic Has Turned Into The Ultimate Value Play May 03 First quarter 2024 earnings: EPS and revenues miss analyst expectations May 02 The Mosaic Company, Annual General Meeting, Jun 06, 2024 Apr 26 The Mosaic Company to Report Q1, 2024 Results on May 01, 2024 Apr 11 Dividend of US$0.21 announced Mar 25 Executive VP & CFO exercised options and sold US$550k worth of stock Mar 08 New major risk - Revenue and earnings growth Mar 01 Upcoming dividend of US$0.21 per share Feb 28 Mosaic: Despite Challenges, I Believe It's Dirt Cheap Feb 23 Full year 2023 earnings: EPS exceeds analyst expectations Feb 22 The Mosaic Company to Report Q4, 2023 Results on Feb 21, 2024 Feb 02 High Demand Should Keep Things Positive For The Mosaic Company Jan 08 The Mosaic Company, Inc. Appoints Corrine D. Ricard as Senior Vice President Dec 21 + 1 more update CEO Compensation Analysis How has Bruce Bodine's remuneration changed compared to Mosaic's earnings? Date Total Compensation Salary Company Earnings Jun 30 2025 n/a n/a US$940m Mar 31 2025 n/a n/a US$368m Dec 31 2024 US$10m US$1m US$175m Sep 30 2024 n/a n/a US$371m Jun 30 2024 n/a n/a US$245m Mar 31 2024 n/a n/a US$775m Dec 31 2023 US$3m US$636k US$1b Sep 30 2023 n/a n/a US$1b Jun 30 2023 n/a n/a US$2b Mar 31 2023 n/a n/a US$3b Dec 31 2022 US$3m US$601k US$4b Sep 30 2022 n/a n/a US$4b Jun 30 2022 n/a n/a US$3b Mar 31 2022 n/a n/a US$3b Dec 31 2021 US$3m US$567k US$2b Compensation vs Market : Bruce's total compensation ($USD9.88M) is about average for companies of similar size in the US market ($USD13.61M). Compensation vs Earnings : Bruce's compensation has increased by more than 20% in the past year. CEO Bruce Bodine (53 yo) 2.1yrs Tenure US$9,880,653 Compensation Mr. Bruce M. Bodine, Jr. serves as President & Director at The Mosaic Company since August 29, 2023 and serves as its Chief Executive Officer since January 01, 2024. He had been Senior Vice President of No ... Show more Leadership Team Name Position Tenure Compensation Ownership Bruce Bodine CEO, President & Director 2.1yrs US$9.88m 0.00023% $ 23.5k Karen Swager Executive Vice President of Operations 1.8yrs US$2.82m 0.052% $ 5.3m Walter Precourt Senior VP & Chief Administrative Officer 1.8yrs US$2.66m 0.041% $ 4.1m Yijun Wang Executive Vice President of Commercial 4.9yrs US$2.93m 0.017% $ 1.7m Luciano Pires Executive VP & CFO less than a year US$304.25k 0.0050% $ 515.4k Russell Flugel VP, Controller 3.3yrs no data 0.0029% $ 299.1k Paul Massoud Vice President of Investor Relations no data no data no data Philip Bauer Senior VP 2.7yrs no data 0.0076% $ 779.8k Benjamin Pratt Senior Vice President of Government & Public Affairs 11.9yrs no data no data Christopher Lewis Senior Vice President of Human Resources 6.3yrs no data no data Jason Tremblay Vice President of Enterprise Strategy & Business Support no data no data no data Show more 2.7yrs Average Tenure 55yo Average Age Experienced Management : MOS's management team is considered experienced (2.7 years average tenure). Board Members Name Position Tenure Compensation Ownership Bruce Bodine CEO, President & Director 2.1yrs US$9.88m 0.00023% $ 23.5k Gregory Ebel Independent Chairman of the Board 12.9yrs US$480.56k 0.045% $ 4.6m Cheryl Beebe Independent Director 6.3yrs US$333.53k 0.014% $ 1.4m Kelvin Westbrook Independent Director 9.1yrs US$327.53k 0.012% $ 1.2m Kathleen Shanahan Independent Director less than a year no data 0.00076% $ 77.6k Gretchen Watkins Independent Director 5.3yrs US$308.78k 0.0098% $ 999.3k Timothy Gitzel Independent Director 11.9yrs US$389.73k 0.024% $ 2.4m David Seaton Independent Director 6yrs US$308.78k 0.015% $ 1.5m João Gonçalves Teixeira Independent Director 2.8yrs US$299.70k 0.0027% $ 275.6k Emery Koenig Independent Director 14.9yrs US$327.53k 0.026% $ 2.6m Sonya Little Independent Director less than a year no data 0.00076% $ 77.6k Jody L. Kuzenko Independent Director 1.7yrs US$304.52k 0.0025% $ 253.1k Show more 5.7yrs Average Tenure 61.5yo Average Age Experienced Board : MOS's board of directors are considered experienced (5.7 years average tenure). View Ownership Company Analysis and Financial Data Status Data Last Updated (UTC time) Company Analysis 2025/09/10 05:33 End of Day Share Price 2025/09/10 00:00 Earnings 2025/06/30 Annual Earnings 2024/12/31 Data Sources The data used in our company analysis is from S&P Global Market Intelligence LLC . The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available. Package Data Timeframe Example US Source * Company Financials 10 years Income statement Cash flow statement Balance sheet SEC Form 10-K SEC Form 10-Q Analyst Consensus Estimates +3 years Forecast financials Analyst price targets Analyst Research Reports Blue Matrix Market Prices 30 years Stock prices Dividends, Splits and Actions ICE Market Data SEC Form S-1 Ownership 10 years Top shareholders Insider trading SEC Form 4 SEC Form 13D Management 10 years Leadership team Board of directors SEC Form 10-K SEC Form DEF 14A Key Developments 10 years Company announcements SEC Form 8-K * Example for US securities, for non-US equivalent regulatory forms and sources are used. Unless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more . Analysis Model and Snowflake Details of the analysis model used to generate this report is available on our Github page , we also have guides on how to use our reports and tutorials on Youtube . Learn about the world class team who designed and built the Simply Wall St analysis model. Industry and Sector Metrics Our industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github . Analyst Sources The Mosaic Company is covered by 52 analysts. 18 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day. Analyst Institution Ishan Majumdar Baptista Research Benjamin Theurer Barclays Farooq Hamed Barclays Show 49 more analysts Level 5, 320 Pitt Street, Sydney Financial Data provided by S&P Global Market Intelligence LLC, analysis provided by Simply Wall Street Pty Ltd. Copyright © 2025 , S&P Global Market Intelligence LLC. All rights reserved. View Data Sources Markets US: NYSE & NASDAQ UK: FTSE Australia: ASX India: NIFTY Canada: TSX South Africa: JSE Japan: NIKKEI South Korea: KOSPI Germany: DAX Investing Ideas Undervalued Companies Dividend Powerhouses Insider Buying Nuclear Energy Autonomous Vehicles Artificial Intelligence Crypto and Blockchain Cybersecurity More ideas Stock Communities AstraZeneca HSBC Holdings Shell Unilever Diageo Rio Tinto Group RELX BP Barclays Features & Tools Portfolio Tracker Stock Screener & Alerts Narratives & Fair Values Dividend Calculator News & Discovery Latest Stock News Global Market Insights Investing Ideas Community Narratives What's New Simply Wall St Plans & Pricing About Us Our People Contact Us Careers Help Center Learn Stock Investing Affiliate Program Business & Enterprise Simply Wall Street Pty Ltd (ACN 600 056 611), is a Corporate Authorised Representative (Authorised Representative Number: 467183) of Sanlam Private Wealth Pty Ltd (AFSL No. 337927). Any advice contained in this website is general advice only and has been prepared without considering your objectives, financial situation or needs. You should not rely on any advice and/or information contained in this website and before making any investment decision we recommend that you consider whether it is appropriate for your situation and seek appropriate financial, taxation and legal advice. Please read our Financial Services Guide before deciding whether to obtain financial services from us. © 2025 Simply Wall Street Pty Ltd, US Design Patent #29/544/281, Community and European Design Registration #2845206 Terms and Conditions Privacy Policy Financial Services Guide Logos provided by Clearbit"
    },
    {
      "url": "https://mosaicamerica.org/contact/",
      "text": "Contact Us | Mosaic America HOME ABOUT MISSION ADVISORY BOARD TEAM PARTNERS NEWS BLOG NEWSLETTERS EXPLORE MOSAIC ATLAS MOSAIC EVENTS MOSAIC FESTIVAL MOSAIC FELLOWS GET INVOLVED DONATE CONTACT Select Page Contact Us Leave us a message Everyone can contribute to Mosaic America. Get in touch with us here, or by emailing info@mosaicamerica.org. If you are interested in volunteering with us, kindly fill this form Follow Mosaic America social media for upcoming engagement opportunities! Name Email Address Message Submit © 2025 Mosaic America All Rights Reserved SUBSCRIBE ABOUT US Mosaic is a nonprofit organization that strengthens communities, cultivates belonging, and catalyzes inclusion through inter-cultural and co-created art. Our team of artists uses inspiration from their cultures and art forms to collaborate on unique performances and expressions that highlight the common threads of our shared American story. Tax ID: 46-3114496"
    },
    {
      "url": "https://mosaicms.com/contact-us/",
      "text": "Contact Us | Mosaic Management Skip to content About Services Expand Independent Living Assisted Living Memory Care Find a Community Careers Resources Expand Blogs FAQs Contact Toggle Menu Get in Touch How can we help you? Contact Mosaic Management. Contact Mosaic Management with questions and guidance for finding independent living, assisted living and memory care. Main Office Address Main Office 650 Hawthorne Ave. SE, Ste. 210 Salem, OR 97301 Main Office Phone Phone 503-751-8895 Main Office Email Email [email protected] First Name * Last Name * Email * Phone * Location if applicable Select a Location Corporate Office Bayberry Commons Boone Ridge Emerson House at River Pointe Heron Pointe Hilltop Springs Lakeland Magnolia Gardens Manzanita Village Meadowlark Mosaic Gardens at Chandler Mosaic Gardens at Scottsdale Mosaic Gardens at Surprise Mountain Park Pacific Grove Sunnycrest The Lodge The Pavilion at El Dorado Hills The Pavilion at Tecolote Canyon Timber Creek White Oak Village Wiley Creek Willamette Springs Message Name This field is for validation purposes and should be left unchanged. location 650 Hawthorne Ave. SE., Ste. 210 Salem, OR 97301 Customer service P: 503-751-8895 F: 503-587-8547 E: [email protected] About Services find a community Contact Careers Blog Investor Login Copyright © 2025 Mosaic Senior Living. All rights reserved. Privacy Policy | Cookie Policy | Opt-Out Scroll to top Scroll to top About Services Toggle child menu Expand Independent Living Assisted Living Memory Care Find a Community Careers Resources Toggle child menu Expand Blogs FAQs Contact"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://joinmosaic.com/contact-us/",
      "text": "Mosaic - Contact Us Skip to content Home For Contractors Solar Financing Options Home Improvement Financing Contractor’s Guide to the IRA Contractor FAQs Technology Mosaic Portal Mosaic Financing API Swiftlink For Homeowners Homeowner’s Guide to the Inflation Reduction Act Homeowner FAQs About Us Meet the Team Press Careers Blog Contact Us Become a Partner Login Borrower Loan Servicing Portal Borrower Loan Documents Portal Partner Portal Mosaic is becoming Solar Servicing LLC. Learn more We’re here to help. Our support team is available to answer any questions you have. Partner support For all sustainable home solutions, and solar questions and needs: (855) 746-7849 Monday through Friday: 8:30 a.m. – 8 p.m. PT Saturday: 8 a.m. – 4:30 p.m. PT Sunday: Closed support@joinmosaic.com Borrower support For all existing customers' questions and needs: (866) 493-6367 Monday through Friday: 8:30 a.m. – 8 p.m. PT Saturday: 8 a.m. – 4:30 p.m. PT Sunday: Closed For all payment-related questions: loanservicing@joinmosaic.com Refinancing your home? refi@joinmosaic.com Selling your home? (866) 493-6367 , Option 3 loanservicing@joinmosaic.com For making payments: Click here for the payment portal. Or submit payment by mail. U.S. Mail: Mosaic P.O. Box 78080 Phoenix, AZ 85062-8080 Overnight: Mosaic 4343 N. Scottsdale Rd., Ste. 270 Scottsdale, AZ 85251 For all press and media inquiries, please contact us at: press@joinmosaic.com 601 12th Street, Suite 325 Oakland CA 94607 3.9 1,015 Reviews Logo About Us Careers Press Contact Us Blog Company Update Contractors Sign Up with Mosaic Mosaic Portal Login Contractor FAQs Participation Agreement Technology Mosaic Portal Info Swiftlink Mosaic Financing API Homeowners Borrower Loan Servicing Portal Borrower Loan Documents Portal Online & Email Safety Connect with us Accessibility: We strive to make our website content accessible and user-friendly. If you are having difficulty viewing the content on this website or navigating the site, please call our Customer Service Team toll-free at (855) 746-7849 or email our team at support@joinmosaic.com and we will be happy to assist you. Terms Privacy Policy/GLBA Política de Privacidad/GLBA Solar Mosaic LLC Licenses Notice At Collection El Momento De La Recogida Mosaic and third parties, including installers, are independent contractors, and not agents, representatives, or partners of each other. Neither Mosaic nor any third party has any right, power or authority to enter into any agreement of any kind for or on behalf of, incur any obligation or liability of, or other otherwise bind, the other party. Mosaic provides third party offers solely as a convenience, and the inclusion of any third party offer does not imply endorsement by Mosaic. Information about any installer or other third party on the Website shall not be interpreted or construed to create an association, joint venture, agency, partnership, franchise, sale representative or employment relationship between the parties or to impose any partnership obligation or liability upon either Mosaic or any third party. Financing applied for and processed through the Mosaic platform is originated by Solar Mosaic LLC or one of its lending/financing partners . Solar Mosaic LLC originated loans to California borrowers: Loans will be arranged or made pursuant to California Financing Law License 60DBO-180554. Refer to transaction specific disclosures and loan documents for details and additional information. © 2025 SOLAR MOSAIC LLC, ALL RIGHTS RESERVED | NMLS ID 1295934"
    },
    {
      "url": "https://www.mosmanpark.wa.gov.au/contact/",
      "text": "Get in touch with us – Town of Mosman Park Skip To Content (08) 9383 6600 Type your search and press enter Press enter to submit your search request Online Services Visit YourSay   Search Live My Home A helpful guide for new residents About Mosman Park Apply for a residential parking permit Asbestos Dinghy management Noise Pest concerns and issues Waste and recycling Rates and payments Air quality My Street Roads Resurfacing Program Underground Power in Mosman Park Report a fault Activity on thoroughfare Infrastructure Traffic and transport Utilities Street trees and verges My Community Act Belong Commit Arts and culture Awards Children and youth Citizenship ceremonies Commemorative Plaques Community directory Community safety Crisis and Support Services Disability Access and Inclusion Grants and Funding Local History Seniors Sport and recreation Volunteers My Parks and Environment Drones in the Town Environmental Pests Snake season Bushland and natural areas Fauna around the Town Weed Management Infrastructure and environmental projects Mosman Beach Park maintenance and access Plant diseases in Mosman Park Sustainability Water management Customer Service Antenno app Complaints Customer Service Charter Pets Cats at home Dogs and sport: sharing our spaces How to be a responsible pet owner Dog off-lead exercise areas Pet registration or renewal Update your pet’s details Handy forms for pets and registration Need a new pet tag or replacement? Report an issue Animal fines and infringements Ranger Services Emergency warnings and incidents Fire Control and Hazard Management in the Town of Mosman Park Parking and Appeals Abandoned shopping trolleys Play What’s On Upcoming events Places The Grove Library Parks and reserves Sport and recreation facilities Venues for hire Planning an event Private Events Public events Food stalls and food trucks Build Building or renovating Approvals and timeframes Building or renovating a house Carports, patio, pergola and shade sails Building a shed or outbuilding Building a granny flat Commercial, Mixed Use and Non-Residential Change of use Residential swimming pools and spas Demolitions Crossovers and stormwater Infrastructure Protection Bond Request house plans Planning Information Submitting a Development Application Subdivision Construction & Demolition Management Plans Online maps and zoning Planning Strategies Local Planning Scheme No. 3 Local Planning Policies The Town’s Heritage Framework Development Assessment Panels Latest planning projects Building forms and documents Building application forms Building application checklists Building fees Building legislation Dividing fences Stormwater disposal Environmental Health Information Food businesses Public buildings Filming, Photography and Drones Mobile food traders Skin Penetration Liquor Licensing Applications open for public comment State Development Assessment Unit Compliance and inspections Planning and building compliance Work Career opportunities Council Council Code of Conduct Deputations and Public Questions Meet the Executive Leadership Team News Public Notices Get to know your Councillors Council meeting dates and information Agendas and Minutes Elections Further Information for Candidates Further Information for Electors Candidate Profiles – 2025 Finance Budget Budget Bulletin Fees and charges Supplier information Tenders Governance Access to information Annual report CEO Standards Public Interest Disclosure Registers Council policies and local laws Our vision for the future Corporate Business Plan Long Term Financial Plan Our commitment to Reconciliation Strategic Community Plan 2021-2031 YourSay – Community Consultation News IMAGINE magazine Talk of the Town newsletter Type your search and press enter Press enter to submit your search request  Submit search form Live Play Build Work Council Online Services Visit YourSay This website may not work correctly in Internet Explorer. We recommend switching to a more secure modern web browser such as Microsoft Edge which is already installed on your computer. View this website in Edge. Community safety takes all of us Click here to report anti-social and disruptive behaviour in Mosman Park. Domestic Violence and Crisis Support The Town is committed to ensuring Mosman Park continues to be a safe and welcoming place to live. If you or someone you know is experiencing a life threatening emergency, call 000 now. Online Payment Portal now live Online Payments just got easier with our upgraded Online Services - click here for more information. Street trees Request a street tree or find out more information on street tree management within the Town. Thinking of running for Council? Nominations open Thursday 28 August. Sunset Eats is back! The series will kick off on Sunday 5 October 2025, with more events to follow on Sunday 16 November 2025 and Sunday 22 February 2026. ← → Get in touch with us Home Get in touch with us Visit the administration office Monday – Friday, 8.30am to 4.30pm 1 Memorial Drive Mosman Park WA 6012 Please call us on 9383 6600 Send us a message Please use the form . Postal address PO Box 3, Mosman Park, WA 6912 Get in touch with us Our Administration office hours are Monday - Friday | 8.30am to 4.30pm 1 Memorial Drive Mosman Park WA 6012 PO Box 3, Mosman Park, WA 6912 Ph: 08 9383 6600 E: admin@mosmanpark.wa.gov.au Sign up to Talk of the Town Our monthly e-newsletter gets delivered to your inbox every month. Subscribe now and stay in the loop with important news and updates in Mosman Park. * indicates required Email Address * Subscribe Connect with us    The Town of Mosman Park acknowledges the Whadjuk Nyoongar people as the traditional custodians of the lands and waters where the Town is situated and pay our respects to Elders past and present. © 2025 Town of Mosman Park Disclaimer Privacy Statement"
    }
  ]
}