{
  "fuentes": [
    {
      "url": "https://citylimits.org/about-us/",
      "email": "google_newsinitiative_lockup_fullcolor_stacked@4x.png"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://qctimes.com/business/city-limits-saloon-grill-owner-closing-a-tough-decision/article_a8148bd8-2975-5392-b2af-e2cfe6e6eeef.html",
      "email": "gteske@qctimes.com"
    },
    {
      "url": "https://qctimes.com/business/city-limits-saloon-grill-owner-closing-a-tough-decision/article_a8148bd8-2975-5392-b2af-e2cfe6e6eeef.html",
      "email": "ngteske@qctimes.com"
    }
  ],
  "mails": [
    "google_newsinitiative_lockup_fullcolor_stacked@4x.png",
    "gteske@qctimes.com",
    "info@rivervillegrill.com",
    "ngteske@qctimes.com"
  ],
  "nombre_sitio": "citylimitspsl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://citylimits.org/about-us/",
      "text": "About Us - City Limits Skip to content Skip to footer Newsletter Donate English Español 中文 العربية Français Deutsch Português Русский 日本語 हिन्दी 한국어 Italiano Nederlands Türkçe Polski Bahasa Indonesia Tiếng Việt עברית ไทย Svenska Ελληνικά Українська Magyar Bahasa Melayu Filipino English Español 中文 العربية Français Deutsch Português Русский 日本語 हिन्दी 한국어 Italiano Nederlands Türkçe Polski Bahasa Indonesia Tiếng Việt עברית ไทย Svenska Ελληνικά Українська Magyar Bahasa Melayu Filipino Empowering affordable and thriving neighborhoods | Knowledge builds community Topics NYCHA Homelessness Land Use and Development Immigration Climate and Environment Comunidades de habla hispana Community Voices Resources Latest News NYC Toolkit Homeless Shelter Tracker Job Board Clarify Youth Program Get Involved About About Us Impact Contact Events Topics NYCHA Homelessness Land Use and Development Immigration Climate and Environment Comunidades de habla hispana Community Voices Resources Latest News NYC Toolkit Homeless Shelter Tracker Job Board Clarify Youth Program Get Involved About About Us Impact Contact Events Topics NYCHA Homelessness Land Use and Development Immigration Climate and Environment Comunidades de habla hispana Community Voices Resources Latest News NYC Toolkit Homeless Shelter Tracker Job Board Clarify Youth Program Get Involved About About Us Impact Contact Events Topics NYCHA Homelessness Land Use and Development Immigration Climate and Environment Comunidades de habla hispana Community Voices Resources Latest News NYC Toolkit Homeless Shelter Tracker Job Board Clarify Youth Program Get Involved About About Us Impact Contact Events About Our Impact Our Standards Reprint Policy Contact Us History & Mission Team Board Awards Partners Our history and mission City Limits uses investigative journalism through the prism of New York City to identify urban problems, examine their causes, explore solutions, and equip communities to take action. City Limits exists to inform democracy and empower citizens to create a more just city. City Limits is a 501(c)(3) nonprofit funded by foundation support, ad sponsorship and donations from readers. 1976 City Limits founded to cover issues affecting low-income communities in NYC, focusing on housing, development, and government policy. 1980s Expanded reporting to include more in-depth investigations on homelessness, healthcare, and urban planning. 1990s Became a go-to source for in-depth analysis of NYC policies and grassroots movements. Launched special projects focusing on welfare reform and neighborhood revitalization. 2000 Transitioned from print to digital publication, increasing accessibility and reach. 2009 Merged with the Center for an Urban Future, enhancing its capacity for investigative reporting on urban challenges. 2010 Relaunched as an independent nonprofit newsroom with a renewed mission to highlight underserved communities. 2016 Celebrated 40 years of impactful journalism, continuing to provide essential coverage on social justice, urban policy, and economic inequality in NYC. Our Team Gary Clemons Executive Director Gary Clemons is a seasoned non-profit executive with 25+ years of experience and a passion for supporting marginalized communities. He tripled the budget and expanded services at Friends of the Children New York, becoming a leader in strategic growth and community partnerships. In his free time, Gary enjoys interior design, traveling, and spending time with his dog, Biggie, while continuing to move the CULTURE forward. Jeanmarie Evelly Executive Editor Jeanmarie Evelly, City Limits’ Executive Editor since 2021, joined the team in 2018, previously serving as youth program manager, deputy editor, and managing editor. A veteran metro reporter, she covered Astoria and Long Island City for DNAinfo.com and reported for Bronx community papers, including the award-winning Norwood News. She holds degrees from SUNY New Paltz, the CUNY Graduate School of Journalism, and an MFA from Queens College. She lives in Sunset Park, Brooklyn. List Item Daniel Parra Spanish Language Senior Reporter/Editor Daniel, City Limits’ Spanish-language editor/reporter, is a seasoned investigative reporter from Colombia. He has worked as a freelancer for more than seven years and has covered war, politics, religion, culture, fashion, and beers. Daniel loves poetry, short stories, and long-form journalism. Fran Reilly Director of Strategic Initiatives Fran Reilly, Director of Strategic Initiatives and Youth Program Development, previously served as Co-Executive Director and Executive Director/Publisher. She leads strategic partnership funding and the youth internship program, CLARIFY.  Earlier in her career she was a  business development executive on multiple national media startups. She holds an MFA in creative writing. A Bronx native, she lives in Beacon, NY. Mariana Simões Senior Reporter, Climate and the Environment Mariana Simões, who joined City Limits in 2023, covers climate and the environment. A Brazilian investigative journalist, her work has appeared in The New York Times, The Economist, Vice, and more. A Columbia J-school alum, she has led award-winning projects and directed Brazil’s first journalism cultural center. Adi Talwar Contributing photographer City limits board Martha Nelson, chair Former SVP and Editor-in-Chief of Yahoo! and former Editor-in-Chief of Time Inc. Neill Coleman, vice chair Principal, Mission Magnified Consulting Mark Edmiston, treasurer Managing Partner, Civil Management LLC Andrew Breslau Senior Vice President for Communications and Marketing, Downtown Alliance Stephen Fee VP, Communications at Enterprise Community Partners Erica González Martínez Deputy Director, Power4PuertoRico David R. Jones President, Community Service Society Nick Lundgren General Counsel, New Destiny Housing Corporation Erik Spooner Marketing Creative Director, Quad Chester Jesus Soria Senior Vice President, Berlin Rosen Advisory Board Edward Lewis Magazine publisher and entrepreneur Meg Louis Legal, Nonprofit, and Business Consultant Michael Moskowitz SVP Wealth Management Advisor, Merrill Lynch Wealth Management Rashad Nelms In-Residence with Indiana University‘s Office of the Vice President for Diversity, Equity, and Multicultural Affairs Lisette Nieves President, Fund for the City of New York Paul Spivey Principal, Phillips Oppenheim Tanzina Vega Adjunct Professor, NYU; Contributing Columnist, Boston Globe Opinion Section Mon Yuck Yu Director of Policy, Office of the Brooklyn Borough President and Co-Founder & Board Member, RaisingHealth Partners Recent Awards 2024 Silurian Press Club Excellence in Journalism Awards Merit Prize for Environmental Reporting, Merit Prize for Feature Photography 2023 Silurian Press Club Excellence in Journalism Awards Merit Prize for Environmental Reporting, Merit Prize for Investigative Reporting 2022 Nonprofit News Awards Finalist for The Insight Award for Explanatory Journalism, Finalist for Insight Award for Visual Journalism 2022 Association for Women in Communications Clarion Awards Finalist for Online Journalism – Special Feature Section 2021 Silurian Press Club Excellence in Journalism Awards Merit Prize for Feature Reporting 2020 Association for Women in Communications Clarion Awards Online Journalism – Special News Section 2018 Ippies Award Partners About Our Impact Our Standards Reprint Policy Contact Us Jobs Board Get Involved Advertise Privacy Newsletter Subscribe I agree to receive communications from City Limits. Leave this field empty if you’re human: © 2025 City Limits. All Rights Reserved. To better help City Limits know and serve our community, please select all that apply: Options I'm looking for housing and community resources I'm a public official or housing expert I'm looking to stay informed about NYC I make less than $60,000 per year Submit"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://qctimes.com/business/city-limits-saloon-grill-owner-closing-a-tough-decision/article_a8148bd8-2975-5392-b2af-e2cfe6e6eeef.html",
      "text": "City Limits Saloon & Grill owner: Closing a 'tough decision' Skip to main content Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close 62° Log In Subscribe Guest Logout Read Today's E-edition News Local Crime Iowa Illinois Politics Business Nation & World Markets & Stocks News Tip Obituaries Share a story Recent Obituaries Find an Obituary Archives Opinion Submit a letter Letters Editorials Guest/Columnists Sports High School College Professional Lifestyles Arts & Theatre Event Calendar Movies & TV Music Food & Dining Games Contests Comics Play Food & Drink Parenting Health Home & Garden Fashion People Pets Faith Celebrate Weather: Live radar Join the community News tip Share video Send a story Share a photo Brand Ave. Studios Print Edition E-edition E-edition Archives Special Sections Our Publications Bettendorf News QCT business Buy & Sell Place an Ad Jobs QC Auto Listings Marketplace Public Notices Shop Local I Love A Deal Shopping Customer Service Manage Subscription Activate Digital Subscription Newsletter sign-up Subscribe Contact us Help Center Gift Subscriptions Mobile Apps Facebook Twitter Bluesky YouTube Pinterest Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Obituaries Opinion Sports Puzzles Lifestyles Public Notices Jobs QC Autos 62° Clear Share This Facebook Twitter Bluesky WhatsApp SMS Email City Limits Saloon & Grill owner: Closing a 'tough decision' 0 Comments Share this Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Alert Top Story Editor's Pick City Limits Saloon & Grill owner: Closing a 'tough decision' Gretchen Teske Mar 18, 2023 Mar 18, 2023 Updated Apr 20, 2024 0 City Limits, 4514 9th St., Rock Island, is closing. CONTRIBUTED PHOTO Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Gretchen Teske A popular Rock Island restaurant and bar is closing for good April 1. Subscribe today and support local journalism! Owners of City Limits Saloon & Grill, 4514 9th St., made the announcement Tuesday in a Facebook post. The post said deciding to close was a \"tough decision\" that was made after much consideration, and the bar will close April 1. \"We appreciate the long history of City Limits in the community and want to thank all of our wonderful guests and employees over these past years,\" the post continued. \"We hope this location is quickly filled with a concept that meets the community's needs.\" Those with gift cards are encouraged to use them before the bar closes. In the months leading up to Tuesday's announcement, the bar was closed multiple times for maintenance, according to Facebook posts. No specific reason for the closure was mentioned. People are also reading… This Christian school in Davenport has grown beyond its building and now seeks a new one Davenport man accused of sexually abusing and secretly videoing child Dave & Buster's coming to Davenport early next year Enrollment at Illinois’ regional universities is plummeting, but solutions hard to come by Congratulations to Quad-City Times Player of the Week, Davenport North's Derek Pena Poynton, CCA too much for Davenport North in Class 4A showdown Teaching is a family tradition for these four Moline educators Eldridge-based LMT Defense awarded contract with U.S. Special Operations Command 5 Takeaways from Iowa’s loss to Iowa State: A drive that will define Mark Gronowski's Hawkeye tenure Food truck adds restaurant; halal, soul food spots open and more Quad-Cities business news Bettendorf man charged for August collision that injured pedestrian Chocolate Manor & Ghost Chicken open, Zeke's at Steeplegate Inn closed, and more Quad-Cities business news Vote for this week's Quad-City Times Player of the Week Kenneth Wayne Ewoldt Tom Martin: Press shutting down doesn't mean less news or later delivery The bar is operated by Food, Drinks, Friends, Inc., a restaurant group that owns the Tangled Wood in Bettendorf, Steventon's and Blue Iguana in LeClaire and most recently signed a deal with the city of Bettendorf to operate the Palmer Grill, which will open April 1. Subscribe today and support local journalism! Under the contract, the city will pay Food, Drink, Friends, Inc. $4,000 a month to operate Palmer Grill, 2999 Middle Rd, Bettendorf. The city and restaurant group would split the losses and/or profits. The city closed Palmer Grill at the end of 2022 after the grill’s food and beverage manager resigned. 0 Comments Love 2 Funny 4 Wow 2 Sad 6 Angry 5 The business news you need Get the latest local business news delivered FREE to your inbox weekly. Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Gretchen Teske Author linkedin Author twitter Author email Follow Gretchen Teske Related to this story × Facebook Twitter Bluesky YouTube Pinterest Instagram Bettendorf News QCVarsity.com Plus 60 Sites & Partners E-edition Email Newsletters Quad-Cities Calendar Obituaries Weather Online Features Services Activate Full Access Advertise with Us Contact Us Job Search Start a Subscription Privacy Policy Terms of Service Customer Service Work here Become a Carrier Dealer Returns Licensing Shopping © Copyright 2025 The Quad-City Times , 500 E 3rd St. Davenport, IA 52801 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics News Alerts Subscribe Breaking News Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely! * First name * Last name * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account or Sign up with facebook google Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Remember me Forgot your password? Log In Email me a log in link or Sign in with facebook google Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted Sign in with Email Address Continue with Email Address or Continue with facebook Continue with google What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    }
  ]
}