{
  "fuentes": [
    {
      "url": "https://www.citywineandcigar.com/",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://1033wvyb.com/city-and-wine-cigar-opens-in-deland/",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://www.citywineandcigar.com/about",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/days-of-wine-and-cigars-in-deland/article_2b7a0308-53fc-11ee-a62d-9b1a34fbd898.html",
      "email": "cguarria@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/days-of-wine-and-cigars-in-deland/article_2b7a0308-53fc-11ee-a62d-9b1a34fbd898.html",
      "email": "classifieds@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/days-of-wine-and-cigars-in-deland/article_2b7a0308-53fc-11ee-a62d-9b1a34fbd898.html",
      "email": "ncguarria@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/days-of-wine-and-cigars-in-deland/article_2b7a0308-53fc-11ee-a62d-9b1a34fbd898.html",
      "email": "newsdy@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "email": "info@brookswine.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "aferrer@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "apuncioni@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "asariyan@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "bramirez@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "dlebold@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "dludwig@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "jcronin@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "joliva@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "kcastaldi@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "lmarshall@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "mdougherty@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "mhayes@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "mlott@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "mrushing@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "personalreserve@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "rzunt@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "email": "spoza@jcnewman.com"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "email": "info@creeksidecigarco.com"
    },
    {
      "url": "https://founderscigarco.com/",
      "email": "info@founderscigarco.com"
    },
    {
      "url": "https://931coast.com/city-and-wine-cigar-opens-in-deland/",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://newsdaytonabeach.com/stories/city-and-wine-cigar-opens-in-deland,63538",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://www.citywineandcigar.com/menu2ee9025f",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "email": "adam@theaustralianwinecompany.com"
    },
    {
      "url": "https://www.citywineandcigar.com/dinner-menu",
      "email": "info@citywineandcigar.com"
    },
    {
      "url": "https://cityofcigars.com/pages/about-us",
      "email": "contact@cityofcigars.com"
    }
  ],
  "mails": [
    "adam@theaustralianwinecompany.com",
    "aferrer@jcnewman.com",
    "apuncioni@jcnewman.com",
    "asariyan@jcnewman.com",
    "bramirez@jcnewman.com",
    "cguarria@hometownnewsmediagroup.com",
    "classifieds@hometownnewsmediagroup.com",
    "contact@cityofcigars.com",
    "dlebold@jcnewman.com",
    "dludwig@jcnewman.com",
    "info@brookswine.com",
    "info@citywineandcigar.com",
    "info@creeksidecigarco.com",
    "info@founderscigarco.com",
    "jcronin@jcnewman.com",
    "joliva@jcnewman.com",
    "kcastaldi@jcnewman.com",
    "lmarshall@jcnewman.com",
    "mdougherty@jcnewman.com",
    "mhayes@jcnewman.com",
    "mlott@jcnewman.com",
    "mrushing@jcnewman.com",
    "ncguarria@hometownnewsmediagroup.com",
    "newsdy@hometownnewsmediagroup.com",
    "personalreserve@jcnewman.com",
    "rzunt@jcnewman.com",
    "sales@finewineliquors.com",
    "spoza@jcnewman.com"
  ],
  "nombre_sitio": "citywineandcigar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.citywineandcigar.com/",
      "text": "Wine & Cigar Bar | DeLand, Florida Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Contact Us 555-555-5555 info@citywineandcigar.com 386-337-7008 Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Check our calendar for daily specials and live entertainment! City Wine & Cigar is your cozy spot for great food, premium wines, cigars, and live entertainment—perfect for relaxing with friends, whether inside or on the patio. Located in the Victoria Commons Complex Our story Welcome to City Wine & Cigar—your go-to spot for great food, drinks, and entertainment! Whether you're joining us at the bar, dining room, or relaxing on our patio, we offer an impressive selection of wines and craft cocktails. Explore our humidor to find a variety of cigars to suit every taste and budget. We’ve partnered with Bronx Pizza to offer a full menu, featuring everything from appetizers and small plates to charcuterie boards, entrees, and desserts. Perfect for lunch, dinner, or just a quick snack or drink! Don’t forget to check our social media for live entertainment on the patio most evenings. There’s always something happening at City Wine & Cigar—come be part of the fun! Hours of Operation Monday 11:00 am - 9:00 pm Tue - Thu 11:00 am - 9:30 pm Fri - Sat 11:00 am - 11:00 pm Sunday 11:00 am - 9:00 pm 111 Victoria Commons Blvd. Suite 113 DeLand, FL 32724 ﻿ Contact Us 386-337-7008 info@citywineandcigar.com Share by:"
    },
    {
      "url": "https://1033wvyb.com/city-and-wine-cigar-opens-in-deland/",
      "text": "City and Wine Cigar Opens in DeLand | 103.3 The Vibe Skip to Content ON AIR NOW 3:00 PM - 7:00 PM Jay Michaels Menu More ▼ ▲ Sign In On Air ▼ ▲ sub menu toggle Personalities DJ Tremble Alyssa Jay Michaels Tino Cochino Slow Jams Podcasts Contests ▼ ▲ sub menu toggle Contest Rules Official Rules for Southern Stone Communication’s Universal Orlando Resort Halloween Horror Nights Promotion ’25 Events News ▼ ▲ sub menu toggle Contact About WVYB Home On Air ▼ ▲ sub menu toggle Personalities DJ Tremble Alyssa Jay Michaels Tino Cochino Slow Jams Podcasts Contests ▼ ▲ sub menu toggle Contest Rules Official Rules for Southern Stone Communication’s Universal Orlando Resort Halloween Horror Nights Promotion ’25 Events News ▼ ▲ sub menu toggle Contact About WVYB Sign In Search City and Wine Cigar Opens in DeLand Nov 15, 2023 | 4:14 PM DELAND, Fla. – One of the great tests of any friendship is to venture into business together. That’s what five friends in DeLand decided to do this month with City Wine & Cigar, the newest restaurant to open in the heart of Volusia County. The business’ owners are Elvira Hanna, Melissa Stalzer, Jessica Ferrentino, Paula Outzen, and Paul Hunt, a group of friends with a passion for food service. Two are veterans – Stalzer with the U.S. Air Force Reserves and Hunt in the Royal Navy. City Wine & Cigar held its soft opening back in October, unveiling their food and drink menu to the public and receiving a warm initial welcome. They’re now preparing for a formal ribbon-cutting next month, December 5th at 5:30 pm. The restaurant is located at 111 Victoria Commons Blvd, Suite 113 in DeLand, where The Grapevine used to be. The restaurant currently offers salads, charcuteries, sandwiches, and soups, as well as a selection of wines and cigars as the name suggests. It regularly hosts live entertainment, both music and comedy, and advertises itself as dog-friendly. “We’re excited about infusing new energy and ideas into the business,” co-owner and DeLand native Elvira Hanna said. “Recognizing the desire for a community-centric atmosphere, we’re committed to adding our unique touch, ensuring that both locals and visitors relish the City Wine & Cigar experience for the foreseeable future.” City Wine & Cigar is open seven days a week, from 11:00 am to 10:00 pm Mondays through Thursdays, 11:00 am to 12:00 am on Friday and Saturday, and 1:00 pm to 8:00 pm on Sunday. They can be reached by email at info@citywineandcigar.com, and on Facebook or Instagram. On Air Now Jay Michaels 3:00 PM - 7:00 PM 3-7pm Weekdays Current Conditions: Daytona Beach, FL, USA 82 °F Partly cloudy Wind: NNE @ 12 mph Humidity: 67 % Precipitation: 0.0 in Pressure: 30 Summary High Low Wind Precipitation Thu Sunny High: 88 °F Low: 76 °F Wind: NNE @ 12 mph Precipitation: 0.0 in Fri Partly Cloudy High: 87 °F Low: 76 °F Wind: NNE @ 13 mph Precipitation: 0.0 in Sat Moderate or heavy rain shower High: 80 °F Low: 74 °F Wind: NNE @ 13 mph Precipitation: 0.1 in Sun Light rain shower High: 82 °F Low: 74 °F Wind: NNE @ 14 mph Precipitation: 0.0 in Mon Sunny High: 82 °F Low: 76 °F Wind: NNE @ 13 mph Precipitation: 0.0 in Tue Patchy rain nearby High: 82 °F Low: 74 °F Wind: NNE @ 15 mph Precipitation: 0.0 in Wed Sunny High: 82 °F Low: 77 °F Wind: NE @ 10 mph Precipitation: 0.0 in Advertise With Us! Privacy Policy Terms Of Service Copyright © 2025. All rights reserved. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.citywineandcigar.com/about",
      "text": "About City Wine & Cigar | DeLand, Florida Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Contact Us 555-555-5555 info@citywineandcigar.com 386-337-7008 Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Let us host your next event! Let us host your next event at City Wine & Cigar! Whether it’s a bridal shower, birthday party, retirement celebration, rehearsal dinner, or reunion, our venue provides a welcoming and relaxed atmosphere—without any facility fee. With live music on Thursday, Friday, and Saturday nights, your event will be even more special. Catering food items are also available for pickup with 24 hours’ notice. Call or text our event planner, Constance, at (386) 785-3271 to start planning your event today! Place your catering order by calling (386) 785-3271 . 111 Victoria Commons Blvd. Suite 113 DeLand, FL 32724 ﻿ Contact Us 386-337-7008 info@citywineandcigar.com Share by:"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.hometownnewsvolusia.com/news/days-of-wine-and-cigars-in-deland/article_2b7a0308-53fc-11ee-a62d-9b1a34fbd898.html",
      "text": "Days of wine and cigars in DeLand | News | hometownnewsvolusia.com Skip to main content You have permission to edit this article. Edit Close 82° Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home About Us Contact Us Advertise Terms of Use Subscription Services Submission Forms Place an Ad Local Weather Gift Certs Rack Locations Search News Local News Sports Arts & Entertainment Local Events ClubScene Business Business News Stock Market Calendar Viewpoint Letters to the Editor Rants & Raves Columns Land Lines Volusia Business News Chef's Corner Fishing with Dan Obituaries Photos & Videos e-Edition Marketplace Classifieds Featured Advertisers Legal Ads Legal Notices Facebook Twitter LinkedIn © Copyright 2025 Hometown News Volusia 2400 S.Ridgewood Ave., Suite 22, South Daytona, FL | Terms of Use | Privacy Policy Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout SUBSCRIBE Join our VIP Club Menu Search 82° Home About Us Contact Us Advertise Terms of Use Subscription Services Submission Forms Place an Ad Local Weather Rack Locations Gift Certs Search News Local News Sports Business A&E Viewpoint Columns Land Lines Volusia Business News Chef's Corner Fishing with Dan Obits Multimedia Photo Galleries Business Directory Classifieds Real Estate Property For Rent Cars & Vehicles Jobs Items For Sale Pets Auctions, Estate & Garage Sales Services Community Personals Place An Ad Featured Advertisers Legal Ads e-Edition Legal Notices Ask the Experts Featured Days of wine and cigars in DeLand By Charles Guarria\ncguarria@hometownnewsmediagroup.com Sep 21, 2023 Sep 21, 2023 Updated Sep 27, 2023 0 Facebook Twitter WhatsApp SMS Email Chris Barfield, who is handling public relations for City Wine & Cigar, said the owners hope to become a fixture for the Victoria Park community in DeLand. Photo by Charles Guarria Facebook Twitter WhatsApp SMS Email Print Copy article link Save A new wine bar in DeLand will open in an established wine bar location. City Wine & Cigar is readying for its Oct. 1 soft opening at 111 Victoria Commons Blvd., the former home of Grapevine Wine Bar. Chris Barfield is handling public relations for City Wine & Cigar. While sitting at the bar, he explained how the owners were customers of Grapevine Wine Bar. They enjoyed the vibe and would discuss what they would do if they had a chance to run it. When the chance happened, they bought in as it was “the perfect opportunity to help liven this area up,” Mr. Barfield said. They want to re-inject the Victoria Park community with a family-friendly establishment. In addition to wine and cigars, they will offer craft beer, cappuccino, coffee, espresso and tea. The food menu is “predominately appetizers,” Mr. Barfield said. Charcuterie boards will be the food focal point. They will also serve small plates highlighted by crab cakes. There will be a Sunday brunch offering a mimosa charcuterie board. And, of course, there are cigars. At first blush, cigars and wine might seem a bit non-traditional, as many think in terms of cigars and cognac, bourbon or a darker rum. However, white wines go well with lighter, sweeter cigars and cigarstud.com mentioned port wine as “a good partner for a premium cigar.” They suggest vintage Port because it has the “sweetness and alcohol to complement a full-bodied smoke,” and younger Ports will “lend spice to your cigar.” Mr. Barfield said, “There's actually a huge group of cigar smokers that enjoy quality fine wines with a cigar and beers.” Cigar smoking will be outside on the patio, he said. “It's not going to be a cigar lounge. This is a wine bar that offers cigars for outdoor smoking or to go.” There will be a walk-in humidor. The owners plan on having about 40 different cigar brands once fully stocked. Orlando-based Oxford Cigar Co. will provide some of the smokes and a sommelier to advise City Wine & Cigar on pairing “wines from our menu with cigars,” Mr. Barfield said. As far as selecting the wines, they have been talking to and tasting the wine of about five distributors with the goal of “having a nice plethora, variety of everything,” Mr. Barfield noted. There will be a handful of local wines, with most of the wine being “Italian, French quality, California, Napa, Sonoma wines,” he said. Summing up what they're offering, he said, “We just want to put out a great product.” The inside décor will feature a lounge area and a loveseat. There is a designated area at the bar to select a beverage to take to the patio, or you can order outside as there will be patio wait service. “The inside will be more like a living room atmosphere,” Mr. Barfield said. City Wine and Bar encourages patrons to grab food from the next-door pizzeria and sit on their porch with a glass of wine. Touching on the family-friendly aspect, Mr. Barfield said, “If their kids want to grab ice cream and sit outside while we have live music, with mom and dad having a glass of wine, no problem. Bring whatever (food) you'd like. It's gonna be a nice community spot that they can come to.” The live music will be acoustic, jazz-type music. They might also have a comedy night. Core Five Volusia LLC is the name of the ownership group. They are “five locals,” who are “very involved in the community,” Mr. Barfield said. The partnership is a combination of folks who have been in the food and beverage business for many years and others who are new to the industry. They all live locally; some used to live in the Victoria Park community, and at least one owns another bar in DeLand. They have “a passion for wine,” Mr. Barfield noted. City Wine will be active in community events, such as the Halloween celebration. Victoria Park is a mixed-use development consisting of homes, offices, dining establishments and plenty of nature to complement biking and walking paths. The community is west of exit 116 on Interstate 4, about 15 minutes from Downtown DeLand. Mr. Barfield said, “We just felt like this was an opportunity to elevate this area, bring people back in here and stop them from driving all the way downtown.” City Wine will be open seven days a week. Facebook Twitter WhatsApp SMS Email Print Copy article link Save × Post a comment as anonymous Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Legal Notices Ownership Volusia Audit Period: October 1, 2021 – September 30, 2023 Bulletin Contact Information hometownnewsvolusia.com 2400 S.Ridgewood Ave., Suite 22 South Daytona, FL 32119 Phone: 1-386-322-5900 Email: newsdy@hometownnewsmediagroup.com Facebook Twitter LinkedIn Sections Home News Sports A & E Business Viewpoint Columns Obituaries Photos & Videos Marketplace Online Features Services Subscription Services Forms Classifieds Place an Ad Calendar Search Weather Rack Locations Media Kit Advertise with Us To advertise your business, call (386) 322-5900. Agencies | National | Regional: Call Amanda Tucker at (772) 467-4352. Place a Legal Ad Call: 772-465-5551 or 1-800-823-0466 Email: classifieds@hometownnewsmediagroup.com × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Hometown News Volusia 2400 S.Ridgewood Ave., Suite 22, South Daytona, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "text": "Contact Us - Brooks Wine Skip to content See what’s on this month in the Tasting Room! Shop Riesling Pinot Noir Club Exclusives Other Wines Library Wines Brooks Swag Join Visit In the Tasting Room this Month Summer Tours and Special Tastings Brooks University Upcoming Events Private Events Travel with Brooks About Us Artisans in Residency Our Story Our People Our Impact Our Blog Take the Quiz My Account How can we help? We’re always here to answer your questions. Get in touch and one of our team members will get back to you as soon as possible. Customer Care For questions about orders, reservations, or general inquiries, email us at [email protected] and we’ll respond asap. For questions about wine clubs and shipping, get in touch with [email protected] or [email protected] . Trade & Media Looking for technical sheets and approved assets? You’ll find everything you need in our Brooks Tech Sheet folder . Partnerships Brands, influencers, and ambassadors wanting more information on partnering with Brooks, please reach out directly at [email protected] . Or, complete our form and we will respond by email shortly Skip Footer Visit Brooks Open daily 11:00 a.m. to 5:00 p.m. 21101 SE Cherry Blossom Lane Amity, OR 97101 Phone: (503) 435-1278 Email: [email protected] In the Tasting Room Book a Table Wine Tastings This Month Spring Tours and Special Tastings Upcoming Events Brooks Recipes Shop our wine All Wines All Red Wines All White Wines Find your perfect wine Wine Clubs Distributors Get to know us About Us Our Impact American Wine Story Strange Inheritance Jimi’s Legacy Series Our Blog Get help Contact Us Shipping & Returns Accessibility Statement Facebook Instagram X YouTube © 2025            Brooks Wine Privacy Policy | Terms and Conditions | Site by 5forests ↑ × Search Looking for a specific wine, experience, or story? Looking for a specific wine, experience, or story?"
    },
    {
      "url": "https://www.jcnewman.com/company/our-team/",
      "text": "Our Team | J.C. Newman Staff | J.C. Newman Cigar Co. HOME ABOUT US OUR CIGARS DOMINICAN REPUBLIC Diamond Crown MAXIMUS Julius Caeser Black Diamond Cuesta-Rey La Unica NICARAGUA Alcazar Brick House Bricktoberfest Don Jose El Baton Jose Gaspar Cigars Perla Del Mar Quorum Yagua Havana Q UNITED STATES The American The American All-Star Humidor Angel Cuesta LeRoy Neiman Tampa Smokers Wm Brown Decision El Reloj Cigars Factory Throwouts Mexican Segundos Tampa Trolleys Trader Jacks RETAILERS DIAMOND CROWN LOUNGES STORE LOCATOR ACCESSORIES CRAFTSMAN’S BENCH DIAMOND CROWN TEAM OUR TEAM CAREERS VISIT THE EL RELOJ DISTRICT HOME ABOUT US OUR CIGARS DOMINICAN REPUBLIC Diamond Crown MAXIMUS Julius Caeser Black Diamond Cuesta-Rey La Unica NICARAGUA Alcazar Brick House Bricktoberfest Don Jose El Baton Jose Gaspar Cigars Perla Del Mar Quorum Yagua Havana Q UNITED STATES The American The American All-Star Humidor Angel Cuesta LeRoy Neiman Tampa Smokers Wm Brown Decision El Reloj Cigars Factory Throwouts Mexican Segundos Tampa Trolleys Trader Jacks RETAILERS DIAMOND CROWN LOUNGES STORE LOCATOR ACCESSORIES CRAFTSMAN’S BENCH DIAMOND CROWN TEAM OUR TEAM CAREERS VISIT THE EL RELOJ DISTRICT Toggle navigation our team owners Eric Newman 3rd Generation Owner and                             President Bobby Newman 3rd Generation Owner and Executive Vice President Drew Newman 4th Generation Owner and General Counsel officers Vice President and General Manager El Reloj Aimee Cooks Vice President of Operations Rich Dolak Vice President of Sales and Marketing Cristal Lastra Vice President of Finance Scott Lewis Chief Financial Officer Shira Martin Vice President and General Manager El Reloj Aimee Cooks Year Started with the Company: 1997 Vice President of Operations Rich Dolak Year Started with the Company: 1996 Vice President of Sales and Marketing Cristal Lastra Year Started with the Company: 2015 Vice President of Finance Scott Lewis Year Started with the Company: 2001 Chief Financial Officer Shira Martin Year Started with the Company: 2000 management team Security and Safety Manager John Carlo Director of Eastern Territory Sales Jake Cronin Director of Western Territory Sales Michael Dougherty Marketing Manager Sydney Elliott Executive Director of Hospitality and Community Engagement Kara Guagliardo The American Room Production Manager Gene Haines Accounting & Accounts Receivable Manager Stacy McDermid European Brand Manager Aldo Puncioni SR. BUSINESS PROCESS MANAGER Terri Ryan Creative Director Tyler Storms Consumer Programs Director Chris Szeglowski Director of Military Sales Annie Vander Veen Warehouse Operations Manager Drew Washington Director of H.R. Payroll & Compliance Luke Wendell I.T. Manager David Witt Security and Safety Manager John Carlo Year Started with the Company: 2024 Director of Eastern Territory Sales Jake Cronin Territory: KY, MO, Southern IL, Western TN Year Started with the Company: 2005 2009 J.C. Newman Salesperson of the Year Email: jcronin@jcnewman.com Director of Western Territory Sales Michael Dougherty Territory: NV, CA Year Started with the Company: 1999 2010 J.C. Newman Salesperson of the Year 2011 J.C. Newman Salesperson of the Year 2017 Fuente Salesperson of the Year 2019 Trailblazer Award 2020 Cigar Family Award 2020 Fuente Salesperson of the Year 2021 Trailblazer Award Email: mdougherty@jcnewman.com Marketing Manager Sydney Elliott Year Started with the Company: 2022 Executive Director of Hospitality and Community Engagement Kara Guagliardo Year Started with the Company: 2010 The American Room Production Manager Gene Haines Accounting & Accounts Receivable Manager Stacy McDermid Year Started with the Company: 2014 European Brand Manager Aldo Puncioni Year Started with the Company: 2021 Email: apuncioni@jcnewman.com SR. BUSINESS PROCESS MANAGER Terri Ryan Year Started with the Company: 1991 Creative Director Tyler Storms Year Started with the Company: 2018 Consumer Programs Director Chris Szeglowski Year Started with the Company: 2018 Director of Military Sales Annie Vander Veen Year Started with the Company: 1998 Warehouse Operations Manager Drew Washington Year Started with the Company: 2022 Director of H.R. Payroll & Compliance Luke Wendell Year Started with the Company: 2015 I.T. Manager David Witt Year Started with the Company: 2007 regional sales managers Kristyn Castaldi Director of Eastern Territory Sales Jake Cronin Director of Western Territory Sales Michael Dougherty Antonio Ferrer Mark Hayes Dan Lebold Mills Lott David Ludwig Louis Marshall John Oliva Sean Poza Bradley Ramirez Michael Rushing Anthony Sariyan Rick Zunt Kristyn Castaldi Territory: CT, NH, MA, ME, RI, VT, Northeast NY Year Started with the Company: 2022 2024 Cigar Family Award 2024 Fuente Salesperson of the Year Email: kcastaldi@jcnewman.com Director of Eastern Territory Sales Jake Cronin Territory: KY, MO, Southern IL, Western TN Year Started with the Company: 2005 2009 J.C. Newman Salesperson of the Year Email: jcronin@jcnewman.com Director of Western Territory Sales Michael Dougherty Territory: NV, CA Year Started with the Company: 1999 2010 J.C. Newman Salesperson of the Year 2011 J.C. Newman Salesperson of the Year 2017 Fuente Salesperson of the Year 2019 Trailblazer Award 2020 Cigar Family Award 2020 Fuente Salesperson of the Year 2021 Trailblazer Award Email: mdougherty@jcnewman.com Antonio Ferrer Territory: South Florida Year Started with the Company: 2019 2021 Fuente Salesperson of the Year 2022 Fuente Salesperson of the Year 2022 Cigar Family Award 2022 J.C. Newman Salesperson of the Year Email: aferrer@jcnewman.com Mark Hayes Territory: MI, IN, Western OH Year Started with the Company: 2001 2009 J.C. Newman Salesperson of the Year 2014 Fuente Salesperson of the Year 2016 Fuente Salesperson of the year 2020 J.C. Newman Salesperson of the Year 2020 Cigar Family Award Email: mhayes@jcnewman.com Dan Lebold Territory: Western VA, PA, OH, NY, KY Year Started with the Company: 2015 Email: dlebold@jcnewman.com Mills Lott Territory: NC, Northern SC, Eastern TN, Southern VA. Year Started with the Company: 2019 Email: mlott@jcnewman.com David Ludwig Territory: AK, AZ, ID, MT, ND, OR, SD, WA, WY, UT, CO, NM Year Started with the Company: 2006 2010 Trailblazer Award 2014 J.C. Newman Salesperson of the Year 2015 Fuente Salesperson of the Year 2017 Cigar Family Award 2017 J.C. Newman Salesperson of the Year 2017 Trailblazer Award 2018 Trailblazer Award 2021 J.C. Newman Salesperson of the Year 2024 J.C. Newman Salesperson of the Year 2024 Cigar Family Award Email: dludwig@jcnewman.com Louis Marshall Territory: AL, GA, MS, SC, Western TN Year Started with the Company: 1999 2013 Fuente Salesperson of the Year 2016 J.C. Newman Salesperson of the Year 2012 Trailblazer Award 2016 Trailblazer Award 2022 Trailblazer Award 2023 Trailblazer Award 2024 Trailblazer Award Email: lmarshall@jcnewman.com John Oliva Northern/Central FL, AL. Year Started with the Company: 2018 Email: joliva@jcnewman.com Sean Poza Territory: TX, OK, LA Year Started with the Company: 2011 Email: spoza@jcnewman.com Bradley Ramirez Territory: Northern IL, MN, MO, WI, IA, KS, NE Year Started with the Company: 2019 2019 Cigar Family Award 2019 Fuente Salesperson of the Year Email: bramirez@jcnewman.com Michael Rushing Territory: Southeast PA, Southern NJ, DE, MD,DC, VA Year Started with the Company: 2023 Email: mrushing@jcnewman.com Anthony Sariyan Territory: NYC, Northern NJ, Northeast PA Year Started with the Company: 2015 2016 J.C. Newman Salesperson of the year 2018 J.C. Newman Salesperson of the year 2019 J.C. Newman Salesperson of the year 2018 Cigar Family Award 2023 Cigar Family Award 2023 Fuente Salesperson of the Year 2023 J.C. Newman Salesperson of the year Email: asariyan@jcnewman.com Rick Zunt Territory: Southern LA, MS, Southern TX, HI. Year Started with the Company: 2005 2011 Trailblazer Award 2013 J.C. Newman Salesperson of the year Email: rzunt@jcnewman.com In Loving Memory of Our Friend Stefan Bastiaenssens In Loving Memory of Our Friend Stefan Bastiaenssens Territory: All Territories outside the US; mainly Europe Year Started with the Company: 2018 Favorite JCN Cigar: Black Diamond Hobbies/Interests: Cigars, wine, beer, music fitness. Favorite Thing About the Cigar Industry: The bond that is created between two people that smoke. You can enter a cigar room or lounge without knowing anyone and leave it having made many new friends! Favorite Place to Travel: All countries in the Carribean Favorite Newman Memory: I love all members of the family, but Bobby was the first one I met. He picked me up at the airport when I flew over applying for the job and the first thing he said was: “I am Bobby, and this is Jeanny”. Next thing I know I am showing pictures of me and my family. Couldn’t think of a warmer welcome. Favorite Quote: “Happiness is about a good meal, a good cigar, and a good woman, or a bad woman, depending on how much happiness you can handle” Fun Fact: Stefan ran a cigar magazine for a number of years before joining the J.C. Newman Team. QUICK LINKS Follow Follow Follow Follow Follow BLOG FOUNDATION CONTACT CAREERS PRIVACY POLICY SHIPPING & RETURNS TERMS  & CONDITIONS AGE VERIFICATION SIGN UP FOR OUR NEWSLETTER Marketing Permissions Please check this box to confirm you would like to receive marketing materials and newsletters from J.C. Newman Cigar Co. Company News Tampa Events You can unsubscribe at any time by clicking the link in the footer of our emails. For information about our privacy practices, please visit our website. We use Mailchimp as our marketing platform. By clicking below to subscribe, you acknowledge that your information will be transferred to Mailchimp for processing. Learn more about Mailchimp's privacy practices here. Designed by Elegant Themes | Powered by WordPress This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings Accept Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "text": "Get in Touch With Us – Creekside Cigar Co Skip to content Pause slideshow Play slideshow Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year . . . Site navigation Search Search Close Creekside Cigar Co Search Account 0 Cart . . . Site navigation Close Search Search Close Cigars New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Latest Release: Frontier Limited Edition HVC Edicion Especiales LE Merch Hats Accessories Watch Our Content Visit the Lounge Hours & Location Membership FAQ Join the Club Search Search Close Goes great with Quick shop Add to cart Crowned Heads Premium Sampler $55 00 $55.00 Quick shop Add to cart Foundation Wise Man Lancero Sampler $60 00 $60.00 Quick shop Sold Out Espresso Pairing Sampler from $65 00 from $65.00 Quick shop Sold Out Best with Bourbon Sampler $70 00 $70.00 Add order note Close Subtotal $0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Cigars Expand submenu Cigars New Arrivals Expand submenu New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Expand submenu Samplers View all Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Expand submenu Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Expand submenu Creekside Customs Latest Release: Frontier Limited Edition Expand submenu Limited Edition HVC Edicion Especiales LE Merch Expand submenu Merch View all Hats Accessories Watch Our Content Visit the Lounge Expand submenu Visit the Lounge Hours & Location Membership FAQ Join the Club Confirm your age Are you 21 years old or older? No Yes Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Hours Sunday: 12pm-9pm Monday: 11am-9pm Tuesday: 11am-9pm Wednesday: 11am-9pm Thursday: 11am-11pm Friday: 11am-11pm Saturday: 11am-11pm Contact 513-630-1044 1381 US-22 Maineville, OH 45039 info@creeksidecigarco.com Lounge Address 1381 US-22 Maineville, OH 45039 Creekside Cigar Co. Privacy Policy Creekside Cigar Co respects your privacy. If you sign up for any of our engagement and outreach programs, including those that use SMS text messaging, we ONLY use information you provide to transmit your mobile messages and, upon request, respond to you directly. This includes sharing information with our program partners, message content providers, phone companies, and vendors who assist us in the delivery of mobile messages. EXCEPT AS SET FORTH IN THIS SECTION, WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER FOR PROFIT ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH PROGRAMS TO ANY THIRD PARTY. We do reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information at point of sale, you agree to provide accurate, complete, and true information. Subscribe today to hear first about our sales Enter your email Subscribe Subscribe Shop Cigars Merch Visit the Lounge Watch our Content Join the Club Customer Care Manage Subscriptions Contact Us FAQ Return Policy Shipping Policy My account About About Us Visit the Lounge Get in touch Email us Follow us Facebook Instagram TikTok YouTube We accept American Express Apple Pay Diners Club Discover JCB Mastercard Visa © 2025\n              Creekside Cigar Co\nNamed Lounge of the Year by PCA Best of the Leaf Awards 2025, located in Cincinnati, Ohio Privacy Policy Terms of Service Get in Touch With Us"
    },
    {
      "url": "https://founderscigarco.com/",
      "text": "Founders | Founders Cigar Company | Veteran Owned Cigars + Accessories Skip to content Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting $ 0.00 0 Cart Premium Cigars from a Veteran Owned, Top-Rated Cigar Brand Discover Our Small-Batch Blends from a Veteran-Owned Premium Cigar Brand Crafted for Character: Premium Cigar Blends You Can Buy Online or at your Favorite Cigar Shop Our cigars are from the Dominican Republic, rolled with care, and ready for you to enjoy with your friends and family. Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Premium Cigars Paired with Cigar Education + Community At Founders Cigar Company, we’re here to equip both seasoned cigar enthusiasts and those new to the cigar world with premium cigars from a top cigar brand you can trust. Whether you’re looking to buy cigars online for a special occasion or to enjoy your everyday ritual, our collection delivers bold flavor, consistent craftsmanship, and a legacy of excellence. We’re also passionate about education— our blog is packed with helpful guides on how to cut a cigar , light a cigar , and navigate cigar culture and etiquette with confidence. From first light to final draw, Founders is your go-to veteran-owned cigar brand for quality, knowledge, and community. Gift a Custom Cigar Box At Founders Cigar Company, we’ve created the ultimate custom cigar box—a premium gift that’s as personal as it is unforgettable. Whether you’re shopping for corporate gifting, groomsmen gifts, bachelor parties, or Father’s Day, our cigar box is designed to leave a lasting impression. Each handcrafted box includes 16 premium cigars from a top cigar brand, along with a high-quality cutter and lighter—everything they need to enjoy a perfect smoke. What makes it truly special? You can customize the lid with your logo, name, date, or personal message, turning it into a keepsake that’s both stylish and meaningful. Whether you’re celebrating milestones or building client relationships, Founders’ custom cigar box delivers quality, character, and craftsmanship in every detail. Order yours today. Ask Your Local Cigar Shop for Founders Cigars​ We love when cigar enthusiasts shop local—there’s nothing like enjoying a premium cigar from your favorite hometown lounge or retailer. If your local cigar shop doesn’t carry Founders Cigars yet, ask them to! As a veteran-owned premium cigar brand, we’re proud to be featured in cigar shops across the country, and we’d be honored to be on the shelves of your favorite spot. Whether you’re looking to buy cigars locally or help introduce a top cigar brand to your community, your support helps us grow and share our passion for premium cigars with more enthusiasts like you. Find A Retailer Near You! We Believe In Supporting Veterans + Local Communities At Founders, We Support Our Veterans Cigars Donated 0 Cigars Donated 0 About Founders Cigar Company Founders began with a small group of friends who started meeting weekly for bonfires and cigars in the early days of the 2020 pandemic. At a time when the rest of the world was shut down, cigars served as a surprising catalyst for connection. Today, we’re here to provide you with premium cigars and the cigar education you’re looking for. Building stronger cigar communities Join Our Newsletter Facebook Instagram Youtube Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Shipping Return & Refund Policy Privacy Policy Warranty Policy Shipping Return & Refund Policy Privacy Policy Warranty Policy Copyright 2024 © Founders Cigar Company, LLC. Designed & Built by : Bearded Cigar Lover Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://931coast.com/city-and-wine-cigar-opens-in-deland/",
      "text": "City and Wine Cigar Opens in DeLand | 93.1 Coast Country Menu Listen Live On-Air Personalities Events Contests Contest Rules Official Rules for Southern Stone Communication’s Universal Orlando Resort HHN Promotion ’25 News Contact × Sign In Search Home On-Air Personalities Events Contests Contest Rules Official Rules for Southern Stone Communication’s Universal Orlando Resort HHN Promotion ’25 News Contact City and Wine Cigar Opens in DeLand By News Daytona Beach - Latest Stories Nov 15, 2023 | 4:14 PM DELAND, Fla. – One of the great tests of any friendship is to venture into business together. That’s what five friends in DeLand decided to do this month with City Wine & Cigar, the newest restaurant to open in the heart of Volusia County. The business’ owners are Elvira Hanna, Melissa Stalzer, Jessica Ferrentino, Paula Outzen, and Paul Hunt, a group of friends with a passion for food service. Two are veterans – Stalzer with the U.S. Air Force Reserves and Hunt in the Royal Navy. City Wine & Cigar held its soft opening back in October, unveiling their food and drink menu to the public and receiving a warm initial welcome. They’re now preparing for a formal ribbon-cutting next month, December 5th at 5:30 pm. The restaurant is located at 111 Victoria Commons Blvd, Suite 113 in DeLand, where The Grapevine used to be. The restaurant currently offers salads, charcuteries, sandwiches, and soups, as well as a selection of wines and cigars as the name suggests. It regularly hosts live entertainment, both music and comedy, and advertises itself as dog-friendly. “We’re excited about infusing new energy and ideas into the business,” co-owner and DeLand native Elvira Hanna said. “Recognizing the desire for a community-centric atmosphere, we’re committed to adding our unique touch, ensuring that both locals and visitors relish the City Wine & Cigar experience for the foreseeable future.” City Wine & Cigar is open seven days a week, from 11:00 am to 10:00 pm Mondays through Thursdays, 11:00 am to 12:00 am on Friday and Saturday, and 1:00 pm to 8:00 pm on Sunday. They can be reached by email at info@citywineandcigar.com, and on Facebook or Instagram. Weather Daytona Beach, FL, USA 82 °F Partly cloudy Recently Played More Advertise With Us! Privacy Policy Terms Of Service Copyright © 2025. All Rights Reserved. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://newsdaytonabeach.com/stories/city-and-wine-cigar-opens-in-deland,63538",
      "text": "City and Wine Cigar Opens in DeLand | WNDB - News Daytona Beach DAYTONA BEACH WEATHER Toggle navigation Main menu Listen Live! News Local News Crime & Law Sports Entertainment Education State News Local News Crime & Law Sports Entertainment Education State News On-Air Schedule Contests Schedule Contests Events Best of Daytona Best of Daytona Contact Send News/Traffic Tips Send Public Service Announcements Advertise With Us Send News/Traffic Tips Send Public Service Announcements Advertise With Us Weather Extras Agriculture Automotive Business Education & Careers Entertainment Food Gardening Green Living Health Home Improvement Kids & Family Lifestyles Features Money Matters Outdoors Pets Real Estate Seniors Spanish language features Tech Page The Book Page Travel Trivia, History & Games Agriculture Automotive Business Education & Careers Entertainment Food Gardening Green Living Health Home Improvement Kids & Family Lifestyles Features Money Matters Outdoors Pets Real Estate Seniors Spanish language features Tech Page The Book Page Travel Trivia, History & Games Business City and Wine Cigar Opens in DeLand L-R: Paula Outzen, Melissa Stalzer, Paul Hunt, Jessica Ferrentino, and Elvira Hanna. City Wine & Cigar Posted Wednesday, November 15, 2023 4:14 pm Chris Gollon DELAND, Fla. - One of the great tests of any friendship is to venture into business together. That's what five friends in DeLand decided to do this month with City Wine & Cigar, the newest restaurant to open in the heart of Volusia County. The business' owners are Elvira Hanna, Melissa Stalzer, Jessica Ferrentino, Paula Outzen, and Paul Hunt, a group of friends with a passion for food service. Two are veterans - Stalzer with the U.S. Air Force Reserves and Hunt in the Royal Navy. City Wine & Cigar held its soft opening back in October, unveiling their food and drink menu to the public and receiving a warm initial welcome. They're now preparing for a formal ribbon-cutting next month, December 5th at 5:30 pm. The restaurant is located at 111 Victoria Commons Blvd, Suite 113 in DeLand, where The Grapevine used to be. The restaurant currently offers salads, charcuteries, sandwiches, and soups, as well as a selection of wines and cigars as the name suggests. It regularly hosts live entertainment, both music and comedy, and advertises itself as dog-friendly. \"We're excited about infusing new energy and ideas into the business,\" co-owner and DeLand native Elvira Hanna said. \"Recognizing the desire for a community-centric atmosphere, we're committed to adding our unique touch, ensuring that both locals and visitors relish the City Wine & Cigar experience for the foreseeable future.\" City Wine & Cigar is open seven days a week, from 11:00 am to 10:00 pm Mondays through Thursdays, 11:00 am to 12:00 am on Friday and Saturday, and 1:00 pm to 8:00 pm on Sunday. They can be reached by email at info@citywineandcigar.com, and on Facebook or Instagram . Other items that may interest you Volusia's Dr. Carmen Balgobin is 2025 National Superintendent of the Year Florida Political Leaders Respond to Charlie Kirk Shooting New Smyrna Beach Won't Join Lawsuit Against State Development Law Derek Barrs Resigns School Board Seat for Federal Transportation Post Facebook Local News Volusia's Dr. Carmen Balgobin is 2025 National Superintendent of the Year Dr. Carmen Balgobin, the Superintendent of Volusia County Schools, has been named the 2025 Superintendent of the Year by the National Asssociation of School Superintendents. The honor comes three  … Florida Political Leaders Respond to Charlie Kirk Shooting 31-year-old political activist Charlie Kirk was fatally shot on Wednesday while conducting a Q&A at Utah Valley University. The killing sent shock waves through America’s political  … New Smyrna Beach Won't Join Lawsuit Against State Development Law The New Smyrna Beach City Commission on Tuesday voted against joining other cities in a lawsuit against a state law limiting development moratoriums. The legislation, SB 180, substantially eroded  … Derek Barrs Resigns School Board Seat for Federal Transportation Post Flagler School Board member Derek Barrs has submitted his letter of resignation to Gov. Ron DeSantis as he awaits confirmation to become Administrator of the Federal Motor Carrier Safety  … VSO Arrests Nursing Applicant on Fraudulent ID Charges The Volusia Sheriff's Office arrested 55-year-old Joseph Kinney on Monday after they alleged he used a fraudulent identification while interviewing for a nursing job. Kinney is accused of using  … More local news 1410 Lpga Blvd Suite 148, Daytona Beach, FL 32117 (386) 255-9300 Sections Listen Live! News On-Air Events Contact Weather Extras Services Advertising Rates Report News © Copyright 2025 Southern Stone Communications | WNDB Public Inspection File | Equal Opportunity Employer Powered by Creative Circle Media Solutions"
    },
    {
      "url": "https://www.citywineandcigar.com/menu2ee9025f",
      "text": "View Our Menu | City Wine & Cigar | DeLand, Florida Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Contact Us 555-555-5555 info@citywineandcigar.com 386-337-7008 Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza 111 Victoria Commons Blvd. Suite 113 DeLand, FL 32724 ﻿ Contact Us 386-337-7008 info@citywineandcigar.com Share by:"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "text": "Contact us – The Australian Wine Company Skip to content Pause slideshow Play slideshow Deliveries in The Netherlands and to countries across mainland Europe Deliveries in The Netherlands and to countries across mainland Europe Facebook Instagram LinkedIn Language English English Nederlands Deutsch . . . Site navigation The Australian Wine Company Search Search Search Account 0 Cart . . . Site navigation Close Search Search Home Wines Red Wines Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Australian Chardonnay Australian Semillon and Blends Regions New South Wales Canberra District Hunter Valley South Australia Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Geelong Yarra Valley Beechworth Western Australia Margaret River Great Southern Tasmania Winemakers New South Wales Brokenwood Tyrrells South Australia d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Tolpuddle Dalrymple Vineyards About Us & FAQ's News Search Search Subtotal €0,00 Check out Taxes included. Shipping and discount codes calculated at checkout. Your cart is currently empty. Home Wines Expand submenu Wines View all Red Wines Expand submenu Red Wines View all Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Expand submenu White Wines View all Australian Chardonnay Australian Semillon and Blends Regions Expand submenu Regions View all New South Wales Expand submenu New South Wales View all Canberra District Hunter Valley South Australia Expand submenu South Australia View all Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Expand submenu Victoria View all Geelong Yarra Valley Beechworth Western Australia Expand submenu Western Australia View all Margaret River Great Southern Tasmania Winemakers Expand submenu Winemakers View all New South Wales Expand submenu New South Wales View all Brokenwood Tyrrells South Australia Expand submenu South Australia View all d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Expand submenu Western Australia View all Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria Expand submenu Victoria View all By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Expand submenu Tasmania View all Tolpuddle Dalrymple Vineyards About Us & FAQ's News Want to Know More About Australian Wines? If you would like further information about our wines and how they suit your style of drinking then please get in touch and we'd be happy to help you further in your selection adam@theaustralianwinecompany.com Get in Touch \"Close (esc)\" Are you 18 years or Older? No I'm not Yes I am Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Get in Touch The Australian Wine Company would love to hear your comments, recommendations or if you would like to know more about our wines or just to chat about Australia and the wine industry please get in touch we'd be glad to help out The Australian Wine Company Diependaalse Drift 11, Hilversum 1213CM North Holland, The Netherlands +31 682 4090 61 adam@theaustralianwinecompany.com Customer Service Shipping Policy Refund Policy My account Menu Home Red Wines White Wines Terms of Service Refund policy About Contact us About us Wine Tastings Get in touch +31 682 4090 61 Follow us Facebook Instagram LinkedIn We accept Bancontact iDEAL Klarna Maestro Mastercard PayPal Shop Pay Visa © 2025\n              The Australian Wine Company Privacy Policy Terms of Service Powered by Shopify \"Close (esc)\" Contact us"
    },
    {
      "url": "https://www.citywineandcigar.com/dinner-menu",
      "text": "Dinner Menu at City Wine & Cigar Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza Contact Us 555-555-5555 info@citywineandcigar.com 386-337-7008 Home Calendar Menu Become a VIP Contact Catering & Events Bronx Pizza 111 Victoria Commons Blvd. Suite 113 DeLand, FL 32724 ﻿ Contact Us 386-337-7008 info@citywineandcigar.com Share by:"
    },
    {
      "url": "https://cityofcigars.com/pages/about-us",
      "text": "About Us – cityofcigars.com Add to cart Added to cart successfully! Continue shopping Go to cart 0 Menu Login Remember me Forgot your password? Sign in or Create an account Recover password Cancel register register or Back to login Home Products Accessories Arturo Fuente OpusX Rare & Limited Cigars Atabey Avo Cohiba Spectre 2025 Davidoff Don Pepin Drew Estate La Flor Dominicana My Father Padron Plasencia Room 101 Rocky Patel Tatuaje About Us Contact Us My Wishlist english English Italia USD Your cart 0 No products in the cart. Start shopping Our Shipping & Return Policy New Year sale discount off 50%! shop now Home Products All Item Accessories Arturo Fuente OpusX Atabey Avo Cohiba Spectre 2025 Davidoff Don Pepin Drew Estate La Flor Dominicana My Father Padron Plasencia Room 101 Rocky Patel Tatuaje The New Look Cigar 2025 Shop Now About Us Contact Us Log in Register Search 0 About Us About City Of Cigars Home >   About us Welcome to City Of Cigars – your trusted destination for premium hand-rolled cigars. We are a dedicated boutique focused on quality, authenticity, and the rich tradition of cigar culture. Whether you're a long-time cigar lover or exploring the world of fine tobacco for the first time, we’re here to guide you through a curated selection of cigars from the world’s top producers. At Fine Ash Cigars, every cigar tells a story. We invite you to slow down, light up, and savor the moment. Po Box 220042 Hollywood Fl 33022-0042 United States tel: (+1) 9174806572 contact@cityofcigars.com +1 (917) 480-6572 Cityofcigars.com does not sell tobacco products to anyone under the age of 21.  If you do not meet the minimum age requirement, please refrain from purchasing on our site.  Your cooperation is greatly appreciated. Useful Links Privacy Policy Terms & Conditions Refund policy Contact Us Shipping policy 2025, cityofcigars.com Payment Options: Add to cart Added to cart successfully! Continue shopping Go to cart"
    }
  ]
}