{
  "fuentes": [
    {
      "url": "https://www.historicjeffersonpark.org/community-gallery",
      "email": "president@unnc.org"
    },
    {
      "url": "https://fortmyers.gov/1181/City-Clerk",
      "email": "jgravitt@fortmyers.gov"
    },
    {
      "url": "https://fortmyers.gov/1181/City-Clerk",
      "email": "mhagemann@fortmyers.gov"
    },
    {
      "url": "https://fortmyers.gov/1181/City-Clerk",
      "email": "sthomas@fortmyers.gov"
    },
    {
      "url": "https://www.jnpa.com/707/contact-us.htm",
      "email": "getinvolved@jnpa.com"
    },
    {
      "url": "https://www.jnpa.com/707/contact-us.htm",
      "email": "info@jnpa.com"
    },
    {
      "url": "https://www.jnpa.com/707/contact-us.htm",
      "email": "trigg@jnpa.com"
    },
    {
      "url": "https://www.biography.com/us-president/thomas-jefferson",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.jeffreal.com/",
      "email": "info@jeffreal.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.jefferson.edu/academics/colleges-schools-institutes/architecture-and-the-built-environment/programs/landscape-architecture/park-in-a-truck.html",
      "email": "parkinatruck@jefferson.edu"
    },
    {
      "url": "https://www.jeffersonparkforward.org/",
      "email": "info@jeffersonparkforward.org"
    },
    {
      "url": "https://www.jcparks.com/contact-us/",
      "email": "jcparks@jeffersoncitymo.gov"
    },
    {
      "url": "https://www.biography.com/political-figures/thomas-jefferson",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/history-of-jefferson-park-chicago",
      "email": "executivedirector@jeffersonparkchamber.com"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/history-of-jefferson-park-chicago",
      "email": "info@jeffersonparkchamber.com"
    },
    {
      "url": "https://www.seattle.gov/parks/allparks/jefferson-park",
      "email": "jonathan.pagan@seattle.gov"
    },
    {
      "url": "https://www.seattle.gov/parks/allparks/jefferson-park",
      "email": "pks_info@seattle.gov"
    },
    {
      "url": "https://www.seattle.gov/parks/allparks/jefferson-park",
      "email": "pks_info@seattle.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "cfmpurchasing@fortmyers.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "cscott@fortmyers.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "dfinn@fortmyers.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "kzimmerman@fortmyers.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "lburon@fortmyers.gov"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "email": "rotheriot@fortmyers.gov"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/events",
      "email": "executivedirector@jeffersonparkchamber.com"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/events",
      "email": "info@jeffersonparkchamber.com"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/events",
      "email": "info@senatormartwick.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "aberdeenbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "chehalisbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "longbeachbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "oceanparkbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "raymondbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.jefferson.edu/about/locations/center-city/parking-at-jefferson.html",
      "email": "enroll@jefferson.edu"
    }
  ],
  "mails": [
    "aberdeenbranchbookings@greatnwfcu.com",
    "app-promo-phones@2x.png",
    "asset-1@2x.png",
    "cfmpurchasing@fortmyers.gov",
    "chehalisbranchbookings@greatnwfcu.com",
    "cscott@fortmyers.gov",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "dfinn@fortmyers.gov",
    "editor@biography.com",
    "enroll@jefferson.edu",
    "executivedirector@jeffersonparkchamber.com",
    "getinvolved@jnpa.com",
    "info@jeffersonparkchamber.com",
    "info@jeffersonparkforward.org",
    "info@jeffreal.com",
    "info@jnpa.com",
    "info@reception-plus.de",
    "info@senatormartwick.com",
    "jcparks@jeffersoncitymo.gov",
    "jgravitt@fortmyers.gov",
    "jonathan.pagan@seattle.gov",
    "kzimmerman@fortmyers.gov",
    "lburon@fortmyers.gov",
    "longbeachbookings@greatnwfcu.com",
    "mhagemann@fortmyers.gov",
    "oceanparkbookings@greatnwfcu.com",
    "parkinatruck@jefferson.edu",
    "pks_info@seattle.gov",
    "president@unnc.org",
    "raymondbranchbookings@greatnwfcu.com",
    "rotheriot@fortmyers.gov",
    "sthomas@fortmyers.gov",
    "tkramer@thisistheplace.org",
    "trigg@jnpa.com",
    "you@domain.com"
  ],
  "nombre_sitio": "cityftmyers.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.historicjeffersonpark.org/community-gallery",
      "text": "Community Contacts | Historic Jefferson Park top of page HISTORIC JEFFERSON PARK Home Our HPOZ Overview FAQ Preservation Plan HPOZ Board Office of Historic Resources Links ZIMAS and Historic Contributor Map Secretary of Interior's Standards The Mills Act Welcome Packet Preservation Plan Chapter 1 Mission Statement Chapter 2 Goals and Objectives Chapter 3 Function of the Plan Chapter 4 Context Statement Chapter 5 Historic Resources Survey Chapter 6 Architectural Styles Chapter 7 Residential Rehabilitation Chapter 8 Residential Additions Chapter 9 Residential Infill Chapter 10 Commercial Rehabilitation Chapter 11 Commercial In-fill Chapter 12 Public Realm Chapter 13 Definitions FAQ Restoration Local Resources Exterior Paint Colors Windows Doors Craftsman Style Guide Commercial Properties Researching your Historic Home History Stories of Jefferson Park Featured Videos News SB 79 Community Contacts About Us Support More Use tab to navigate through the menu items. COMMUNITY CONTACTS WAHA The West Adams Heritage Association (WAHA) is devoted to the preservation of the historic West Adams neighborhood of Los Angeles.  Besides the goal of preservation of the community’s architectural heritage, WAHA also supports beautification activities, block club initiatives, neighborhood councils within the West Adams network, and seeks to educate Los Angeles’ citizens as well as others about the area’s cultural heritage and about possible restoration techniques.  WAHA also supports the creation of HPOZs within West Adams and the designation of Los Angeles Historic-Cultural Monuments (LAHCM). Membership in WAHA can be a valuable source of support and information about living in an historic home. WAHA Website/Membership information UNNC United Neighborhoods Neighborhoods Council (UNNC) is your representative to Council District 10 and to City agencies and departments. One of UNNC’s missions is “to advise the City of Los Angeles on issues concerning City governance, the needs of the UNNC, the delivery of City services to the UNNC, and on matters of a Citywide nature.” This includes advising on matters concerning the Jefferson Park HPOZ. UNNC holds public meetings the first Thursday of every month. If you have any concerns, suggestions, or things you would like to see done in our community, use our contact form, email president@unnc.org or call 323.731.8686. UNNC Website BLOCK CLUBS/COMMUNITY ORGANIZATIONS If you would like to have your Jefferson Park block club or community organization featured on this page please email us Email us VASSIE D. WRIGHT MEMORIAL BRANCH LIBRARY Jefferson Park is fortunate to have its own branch of the Los Angeles Public Library located at 2211 W, Jefferson Blvd. Many of the branches publish program videos on their facebook pages.  But these are not geographic and are available to anyone,  The main library web page offers a large selection of emedia, and other library resources. LA Public Library CITY SERVICES Know who to call when you have a concern. MYLA311 Call 311 or use the MYLA311 app to report abandoned waste and illegal dumping in the public right of way near you. This includes free bulky item pickup. You can also create a service request download the app, available free in Google Play and the App Store. Download the App LA SANITATION LA Sanitation & Environment (LASAN) has a wide variety of services, including free bulky item pickup, and it is our goal to help you with what you need as quickly and efficiently as possible. Click on the link below to start your service request or call us directly at 1-800-773-2489 . We're available by phone 24 hours a day, 7 days a week! Access Website LA DEPT OF TRANSPORTATION LADOT leads transportation planning, project delivery, and operations in the City of Los Angeles. LADOT is made up of over 1,300 civil servants, including 600 traffic officers. LADOT manages 52 different transportation services for the region -- from parking management to safety improvements to permits for private mobility operators. Access website LA ANIMAL SERVICES The City of Los Angeles Animal Services Department (LAAS) was established 153 years ago. LAAS’s major areas of responsibility are saving the lives of animals that end up at one of our six City shelters. Please check out the links on the website to learn more about our mission, vision, and values. You can also learn about our General Manager, the Board of Animal Services Commissioners, review statistical information about the Department and learn about career opportunities available. Access Website NON EMERGENCY POLICE NUMBER 1-877-ASK-LAPD only operates  in the city of Los Angeles. It is a universal toll-free non-emergency police number. It was  designed to help reduce the number of non-emergency calls to 9-1-1 operators. 877 ASK-LAPD  is also available in Spanish and TTY for the hearing-impaired. Visit Website COMMUNITY POLICE ADVISORY BOARD (CPAB) Community-Police Advisory Boards (C-PABs) were created in 1993 to provide community members with an opportunity to provide information and advice to their respective Area and to take information from the police department back to the community. Watch: LAPD CPAB Summit 2013 CPAB LA CITY VIEW \" LA CityView \" is the City of Los Angeles' official cable channel available on channel 35 and produces Emmy award winning shows geared for the citizens of Los Angeles such as \"LA This Week\" and \"LA This Minute\" LA City View Website LA BUREAU OF STREET SERVICES The Bureau of Street Services was recently branded \"StreetsLA\" and is part of the Department of Public Works family responsible for preserving, protecting, maintaining, and renewing the City of Los Angeles' (City) street network and urban forest. This includes our streets' sidewalks, bikeways, trees, and medians. The men and women of StreetsLA are committed to providing high-quality, efficient, and equitable services across our great city and communities. Access Website BUREAU OF STREET LIGHTING The Bureau of Street Lighting is one of five Bureaus in the Department of Public Works. The Bureau of Street Lighting is responsible for the design, construction, operation, maintenance and repair of the street lighting system within the City of Los Angeles. There are currently more than 210,000 lights in the City consisting of more than 400 designs. Access Website LA HOUSING DEPARTMENT HCIDLA has a rich history dating back to 1990 when the Housing Preservation and Production Department was established to respond to community advocacy for a new department that would focus on and address the growing shortage of affordable housing in the City. This section includes everything you wanted to know about us: where we came from, who we are, what we do and where we are going. Access Website LA COUNTY PUBLIC HEALTH The Los Angeles County Department of Public Health (Public Health) works to protect and improve health and well-being in the largest county in the United States. View the new Daily COVID-19 Data Dashboard and other public health information for the City of Los Angeles. Access Website PAY-A-FEE Access online payment for the following: LADOT Animal Services Department of Recreation and Parks Office of Finance Department of Water and Power Department of Building and Safety ​ Access This site was developed and maintained by the Friends of the Jefferson Park HPOZ with generous hosting support from the United Neighborhoods Neighborhood Council . UNNC is a proud partner of the Jefferson Park HPOZ. historicjeffersonpark@gmail.com Subscribe Form Submit Thanks for submitting! ©2020 Historic Jefferson Park bottom of page"
    },
    {
      "url": "https://fortmyers.gov/1181/City-Clerk",
      "text": "City Clerk | Fort Myers, FL - City Government Skip to Main Content Search Government Departments Information Services Last Content Update: Last month Overview Cemetery Elections - 2026 Candidates - 2024 Public Records Contact Overview City Clerk The City Clerk serves as a vital cornerstone in ensuring the smooth functioning of our local government. With a range of essential responsibilities, our office plays a fundamental role in upholding the transparency and accountability that citizens expect and deserve. We take pride in our commitment to preserving the city's historical records, facilitating municipal elections, and providing a gateway for citizens to engage with their government. Our dedicated team is here to serve you and to assist with various administrative functions that keep our city running effectively and efficiently. Responsibilities As the City Clerk, our key responsibilities encompass: Acting as the qualifying officer for municipal elections, ensuring the democratic process proceeds smoothly. Administering oaths and affirmations, reinforcing the integrity of official actions and declarations. Processing applications for Boards and Committees, facilitating civic engagement and citizen involvement. Attesting official documents, certifying the authenticity of important records and transactions. Overseeing the city's records management program, which includes maintaining a formal system and preserving historical records for future generations. Assisting in the preparation of official documents that are essential to the functioning of our local government. Maintaining comprehensive cemetery records and oversees the upkeep of cemetery property in conjunction with Parks & Recreation. Recording and preserving the minutes of the City Council, as well as those of the Citizens Police Review Board, Economic Development Advisory Board, Environmental Advisory Board, Audit Committee, and Nuisance Abatement Board. Handling research requests for public records from citizens, council members, and city staff. Supervising the sale of cemetery plots, ensuring this process is conducted with care and respect for those we serve. Our office is dedicated to maintaining the highest standards of professionalism and transparency, and we are here to assist you with any inquiries or requirements you may have. Please do not hesitate to contact us for any support or information you may need. Cemetery Fort Myers Cemetery Providing an architecturally designed and landscaped serene setting for the inurnment of cremains of your loved ones. For more information about the use of our columbarium or how to reserve a niche, please call the City Clerk’s Office at 239-321-7037. All cemetery visits at City Hall are by appointment only. Sherry Thomas Senior Administrative Assistant (239) 321-7037 sthomas@fortmyers.gov Mary Hagemann City Clerk (239) 321-7040 mhagemann@fortmyers.gov Location Fort Myers Cemetery Address: 3200 Michigan Ave, Fort Myers, FL 33916 Notice: Fort Myers Cemetery Rules and Regulations Compliance Starting May 1, 2025, city staff will begin removing and disposing of items that do not meet the City's requirements. We would like to remind all visitors of the importance of adhering to the Fort Myers Cemetery Rules and Regulations. It has come to our attention that some burial plots contain items that do not comply with the established guidelines. Fort Myers Cemetery Rules & Regulations - English (pdf) Fort Myers Cemetery Rules & Regulations - Spanish (pdf) As outlined in Section III: General Information of the cemetery rules and regulations: • Each burial plot is permitted one floral arrangement. • No additional items are allowed beyond the permitted arrangement. To maintain the beauty and order of the cemetery, we kindly ask that any non-compliant items be removed by April 30, 2025. Grave marker damage due to a Hurricane? If a grave marker of a loved one is damaged, your insurance company may pay for repairs, usually up to $5,000.00. It's important to note that grave markers must be established as your \"personal property\" for it to be covered. Elections - 2026 2026 Municipal Elections COUNCIL MEMBERS FOR WARDS 1, 3, AND 5 AND MAYOR (Four Year Terms) GENERAL ELECTION:  August 18, 2026 PRIMARY ELECTION:  November 3, 2026 CANDIDATE QUALIFYING WEEK Beginning - June 8 at 12 pm (Noon) Ending - June 12 at 12 pm (Noon) CANDIDATE PETITION DEADLINE: May 11 QUALIFYING REQUIREMENTS TO BECOME A CANDIATE: Must be a registered voter of the City. Must be a permanent resident of the City: Candidates for City Council shall have been a resident of the ward from which he or she is elected for a period of at least six (6) months prior to the last day to qualify for office; Candidates for Mayor shall have been a resident of the City for a period of twelve (12) consecutive months prior to the last day to qualify for office. WARD MAPS City Council and Mayor Ward Maps HELPFUL RESOURCES The Florida Election Code Chapters 97-106 Florida Election Code Chapters 97-106 Guide to the Sunshine Amendment and Code of Ethics for Public Officers and Employees Florida Commission on Ethics TO BECOME A FILED CANDIDATE AND BEGIN YOUR CAMPAIGN FILE THE COMPLETED FORMS BELOW WITH THE CITY CLERK'S OFFICE BY MAKING AN APPOINTMENT WITH THE CITY CLERK, MARY HAGEMANN, AT 239-321-7040 BEFORE COLLECTING OR EXPENDING ANY CAMPAIGN FUNDS (BRING WITH YOU: DRIVER'S LICENSE AND VOTER REGISTRATION CARD): DS-DE 9 Appointment of Campaign Treasurer and Designation of Campaign Depository for Candidates DS-DE9 Form DS-DE84 Statement of Candidate (Must be filed within 10 days after the DS-DE 9 is filed) DS-DE84 Form AFTER BECOMING A FILED CANDIDATE THE DESIGNATED CAMPAIGN TREASURER SHALL FILE WITH THE CLERK'S OFFICE THE FOLLOWING CAMPAIGN FINANCE REPORTS IN ACCORDANCE WITH A CAMPAIGN FINANCE REPORT SCHEDULE DS-DE 12 Campaign Treasurer's Report Summary DS-DE12 Form DS-DE 13 Itemized Contributions DS-DE13 Form DS-DE 14 Itemized Expenditures DS-DE14 Form DS-DE-14A Itemized Distributions DS-DE14A Form DS-DE 87 Waiver of Report DS-DE87 Form DS-DE 2 Contributions Returned DS-DE2 Form DS-DE 73 Campaign Loans Report DS-DE73 Form DS-DE 73A Campaign Loans Report Itemized DS-DE73A Form TO BECOME A QUALIFIED CANDIDATE DURING QUALIFYING WEEK THE CANDIDATE SHALL COMPLETE AND FILE THE DOCUMENTS AND FORMS BELOW WITH THE CITY CLERK'S OFFICE BY MAKING AN APPOINTMENT WITH THE CITY CLERK, MARY HAGEMANN, AT  239-321-7040 1. FORM 1 Statement of Financial Interests (Bring verification copy of having filing to your appointment) FORM 1 - Statement of Financial Interests 2. DS-DE 302NP Oath of Candidate DS-DE302NP Form 3. CERTIFICATE OF CANDIDATE Mayor Certificate of Candidate Council Member Certificate of Candidate 4. SIGN REGULATIONS Sign Regulations 5. CANVASSING BOARD MEETING DATES 6. PAYMENT OF FILING FEES: $100.00 City Filing Fee All Candidates plus $326.30 State Election Assessment for City Council or $424.19 State Election Assessment for Mayor A Check for filing and qualifying fees must be drawn on the candidate’s campaign checking account and made payable to the CITY OF FORT MYERS. For more information regarding Elections, please contact Mary Hagemann, City Clerk, at 239-321-7040. Candidates - 2024 2024 Primary & General Election Candidates Qualified Candidates 2024 QUALIFIED CANDIDATES Ward 2 Candidate Forms & Campaign Treasurer Reports ARLEASE WIILLIAMS - Appointment of Campaign Treasurer ARLEASE WILLIAMS - Statement of Candidate ARLEASE WILLIAMS 2024-Q1 CHANETTA CAMPBELL BRUNSON - Appointment of Campaign Treasurer CHANETTA CAMPBELL BRUNSON - Statement of Candidate CHANETTA CAMPBELL-BRUNSON - Certificate of Candidate CHANETTA CAMPBELL-BRUNSON - Lee County Elections_Canvassing Board Meeting Dates CHANETTA CAMPBELL-BRUNSON_Candidate Oath CHANETTA CAMPBELL-BRUSON - 2023-Q4 CHANETTA CAMPBELL-BRUNSON 2024-Q1 CHANETTA CAMPBELL-BRUNSON - 2024-Q2 CHANETTA CAMPBELL-BRUSON 24-Q2 AMENDED CHANETTA CAMPBELL-BRUSON - 2024-P1 CHANETTA CAMPBELL-BRUSON - 2024-P2 CHANETTA CAMPBELL-BRUSON - 2024-P3 CHANETTA CAMPBELL-BRUNSON - 24-P4 CHANETTA CAMPBELL-BRUSON - 24-P4 CHANETTA CAMPBELL-BRUNSON- 24-P5 CHANETTA CAMPBELL-BRUNSON - 24-P6 CHANETTA CAMPBELL-BRUNSON - 24 - P6 AMENDED CHANETTA CAMPBELL-BRUNSON - 24-P7 CHANETTA CAMPBELL-BRUNSON 24-TRP JACQUELYN MCMILLER - Appointment of Campaign Treasurer JACQUELYN MCMILLER - Certificate of Candidate JACQUELYN MCMILLER_Candidate Oath JACQUELYN MCMILLER - Statement of Candidate JACQUELYN MCMILLER - Lee County Elections_Canvassing Board Meeting Dates JACQUELYN MCMILLER 2024-Q1 JACQUELYN MCMILLER - 2024-Q1 AMENDED JACQUELYN MCMILLER - 2024-Q2 JACQUELYN MCMILLER 2024-P1 JACQUELYN MCMILLER - 2024-P2 JACQUELYN MCMILLER - 2024-P3 JACQUELYN MCMILLER - 24-P4 JACQUELYN MCMILLER - 24-P5 JACQUELYN MCMILLER - 24-P6 JACQUELYN MCMILLER - 24-P7 JACQUELYN MCMILLER - 24-G1 JACQUELYN MCMILLER 24-G2 JACQUELYN MCMILLER - 24-G3 JACQUELYN MCMILLER - 24-G4 JACQUELYN MCMILLER - 24-G4 AMENDMENT JACQUELYN MCMILLER - 24-G5 JACQUELYN MCMILLER - 24-G6 JACQUELYN MCMILLER - 24-TRG DIANA GIRALDO - Appointment of Campaign Treasurer DIANA GIRALDO - Statement of Candidate DIANA GIRALDO - Statement of Candidate DIANA GIRALDO_Candidate Oath DIANA GIRALDO - Lee County Elections_Canvassing Board Meeting Dates DIANA GIRALDO 2024-Q1 DIANA GIRALDO 2024-Q2 DIANA GIRALDO 2024-P1 DIANA GIRALDO - 2024-P2 DIANA GIRALDO - 2024-P3 DIANA GIRALDO - 24-P4 DIANA GIRALDO - 24-P5 DIANA GIRALDO - 24-P6 DIANA GIRALDO - 24-P7 DIANA GIRALDO - 24-G1 DIANA GIRALDO 24-G2 DIANA GIRALDO - 24-G3 DIANA GIRALDO - 24-G4 DIANA GIRALDO - 24-G5 DIANA GIRALDO - 24-G6 DIANA GIRLADO - 24-TRG Ward 4 Candidate Forms & Campaign Treasurer Reports CINDY BANYAI - Appointment of Campaign Treasurer CINDY BANYAI - Statement of Candidate CINDY LYN BANYAI - Candidate Oath CINDY LYN BANYAI - Certificate of Candidate CINDY LYN BANYAI - Lee County Elections_Canvassing Board Meeting Dates CINDY BANYAI - 2024-Q2 CINDY BANYAI  2024-P1 CINDY BANYAI - 2024-P2 CINDY BANYAI - 24-P3 CINDY BANYAI - 24-P4 CINDY BANYAI - 24-P5 CINDY BANYAI - 24-P6 CINDY BANYAI - 24-P7 CINDY BANYAI - 24-G1 CINDY BANYAI - 24-G2 CINDY BANYAI - 24-G3 CINDY BANYAI - 24-G4 CINDY BANYAI - 24-G5 CINDY BANYAI - 24-G6 CINDY BANYAI - 24-TRG LISTON BOCHETTE - Certificate of Candidate LISTON D. BOCHETTE - Appointment of Campaign Treasurer - Deputy Treasurer LISTON BOCHETTE - Lee County Elections_Canvassing Board Meeting Dates LISTON BOCHETTE_Candidate Oath LISTON D. BOCHETTE  - 23-Q3 LISTON D. BOCHETTE - 23-M6 LISTON D. BOCHETTE - 23-Q3 LISTON D. BOCHETTE - 23-Q4 LISTON D. BOCHETTE, III - 23-Q4 AMENDED LISTON D. BOCHETTE - 24-Q1 LISTON D. BOCHETTE, III - 24-Q1 AMENDED LISTON D. BOCHETTE - 24-Q2 LISTON D. BOCHETTE, III - 24-Q2 AMENDED LISTON D. BOCHETTE - 24-P1 LISTON D. BOCHETTE, III - 24-P1 AMENDED LISTON BOCHETTE - 2024-P2 LISTON D. BOCHETTE, III - 24-P2 AMENDED LISTON BOCHETTE III - 24-P3 LISTON D. BOCHETTE, III - 24-P3 AMENDED LISTON BOCHETTE - 24-P4 LISTON BOCHETTE, III - 24-P5 LISTON D. BOCHETTE, III - 24-P6 LISTON BOCHETTE, III - 24-P7 LISTON BOCHETTE, III - 24-G1 LISTON BOCHETTE, III - 24-G2 LISTON BOCHETTE - 24-G3 LISTON BOCHETTE III - 24-G4 LISTON BOCHETTE- 24-G5 LISTON BOCHETTE - 24-G6 LISTON BOCHETTE III - 24-TRG Ward 6 Candidate Forms & Campaign Treasurer Reports DARLA BONK - Appointment of Campaign Treasurer DARLA BONK - Certificate of Candidate DARLA BONK - Lee County Elections_Canvassing Board Meeting Dates DARLA BONK_Candidate Oath DARLA BONK - 2023-Q4 DARLA BONK 2024-Q1 DARLA BONK 2024-Q2 DARLA BONK - 24-TRQ Termination Report Public Records City Transparency Portal Public Records Manager: John Paul Gravitt Phone: (239) 321-7042 jgravitt@fortmyers.gov Public Records Fees and Special Charges Resolution 2024-76 (PDF) Contact City Clerk's Office Physical Address View Map 2200 Second Street Fort Myers , FL 33901 2200 Second Street  Fort Myers FL 33901 Directions Phone: 239-321-7035 Home Departments Government Information Services Contact /QuickLinks.aspx News Public Records Report A Concern Site Map Social Terms & Policies /QuickLinks.aspx City of Fort Myers 2200 Second Street Fort Myers, FL 33901 City Hall: 239-321-7000 City Public Records: 239-321-7042 or via our Transparency Portal Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.jnpa.com/707/contact-us.htm",
      "text": "Contact Us | Jefferson National Parks Association Locations Locations Overview Clinton Birthplace Home National Historic Site Gateway Arch National Park Lewis and Clark Visitor Center Little Rock Central High School National Historic Site Mississippi National River and Recreation Area Missouri National Recreational River New Philadelphia National Historic Site Springfield 1908 Race Riot National Monument Ste. Genevieve National Historical Park Ulysses S. Grant National Historic Site Voyageurs National Park About Who We Are What We Do Leadership Contact Us Connect Get Involved Arch License Plate Employment Stay In Touch Blog Shop Shop by Park Customer Service Gateway Arch Photos Wholesale Speaker Series Donate arrow_forward_ios Contact Us Shopping Cart 0 Cart 0 items Menu Contact Us JNPA is all about service and we’re here to help. Please don’t hesitate to get in touch if you have a question. General Inquiries (314) 678-1500 info@jnpa.com Wholesale & Product-related Inquiries (314) 678-1512 Rick Trigg Arch Plates, Update Contact Info getinvolved@jnpa.com Shipping & Handling, Returns, and Payment Info Visit our Customer Service page Mailing Address Jefferson National Parks Association One Memorial Drive Suite 1900 St. Louis, MO 63102 One Memorial Drive, Suite 1900 St. Louis,  MO  63102 (314) 678-1500 Wholesale Contact Us Privacy Policy × Item(s) added to your cart Your Cart: items Cart Subtotal: Continue Shopping View Cart"
    },
    {
      "url": "https://www.biography.com/us-president/thomas-jefferson",
      "text": "Thomas Jefferson: Biography, U.S. President, Founding Father Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Shohei Ohtani Real-Life Heroes of 9/11 Famous Political Figures U.S. Presidents Thomas Jefferson Thomas Jefferson Thomas Jefferson was a Founding Father of the United States, author of the Declaration of Independence, and America’s third president. By Biography.com Editors Updated: Jul 03, 2024 3:59 PM EDT Getty Images 1743-1826 Who Was Thomas Jefferson? Thomas Jefferson was one of the Founding Fathers of the United States. The native Virginian was the primary author of the Declaration of Independence and later held several national offices. Jefferson served as the nation’s first secretary of state, and the second vice president (under John Adams ), and the third American president, from 1801 to 1809. During his two-term presidency, Jefferson doubled the size of the United States by successfully brokering the Louisiana Purchase and defeated pirates from North Africa during the Barbary War. In retirement, Jefferson founded the University of Virginia and continued work on his beloved Monticello estate. He died on the 50 th anniversary of the Declaration of Independence at age 83. Jump to: Who Was Thomas Jefferson? Quick Facts When and Where Was Thomas Jefferson Born? Education Monticello Children, Wife, and Sally Hemings Declaration of Independence Virginia Governor and House Delegate National Appointments: Minister to France and Secretary of State Vice Presidency Accomplishments as U.S. President Ideology: Political Party, Views on Slavery, and Legacy Later Years: Founding the University of Virginia When Did Thomas Jefferson Die? Quotes Quick Facts FULL NAME: Thomas Jefferson BORN: April 13, 1743 DIED: July 4, 1826 BIRTHPLACE: Shadwell, Virginia SPOUSE: Martha Jefferson (1772-1782) CHILDREN: 12 ASTROLOGICAL SIGN: Aries When and Where Was Thomas Jefferson Born? Thomas Jefferson was born on April 13, 1743, at the Shadwell plantation located just outside of Charlottesville, Virginia. Thomas was born into one of the most prominent families of Virginia’s planter elite. His mother, Jane Randolph Jefferson, was a member of the proud Randolph clan, a family claiming descent from English and Scottish royalty. His father, Peter Jefferson, was a successful farmer as well as a skilled surveyor and cartographer who produced the first accurate map of the Province of Virginia. Thomas was the third born of 10 siblings. As a boy, his favorite pastimes were playing in the woods, practicing the violin, and reading. Education Jefferson began his formal education at age 9, studying Latin and Greek at a local private school run by Reverend William Douglas. In 1757, at the age of 14, he took up further study of the classical languages as well as literature and mathematics with Reverend James Maury, whom Jefferson later described as “a correct classical scholar.” In 1760, having learned all he could from Maury, Jefferson left home to attend the College of William and Mary in Williamsburg, Virginia’s capital. Although it was the second oldest college in America (after Harvard), William and Mary wasn’t an especially rigorous academic institution at that time. Jefferson was dismayed to discover that his classmates expended their energies betting on horse races, playing cards, and courting women rather than studying. Nevertheless, the serious and precocious Jefferson fell in with a circle of older scholars that included Professor William Small, Lieutenant Governor Francis Fauquier, and lawyer George Wythe, and it was from them that he received his true education. After three years at William and Mary, Jefferson decided to read law under Wythe, one of the preeminent lawyers of the American colonies. There were no law schools at this time; instead aspiring attorneys “read law” under the supervision of an established lawyer before being examined by the bar. Wythe guided Jefferson through an extraordinarily rigorous five-year course of study—more than double the typical duration. By the time Jefferson won admission to the Virginia bar in 1767, he was already one of the most learned lawyers in America. Monticello Getty Images Thomas Jefferson designed his famous home, Monticello, which was initially completed in the 1780s. In 1769, Jefferson began construction of what was perhaps his greatest labor of love: Monticello , his house atop a small rise outside of Charlottesville, Virginia. The house was built on land within the state’s Piedmont region that his father had owned since 1735. In keeping with his interests as one of America’s greatest Renaissance Men—he liked botany, archaeology, music, and birdwatching, among other subjects—Jefferson, himself, drafted the blueprints for Monticello’s neoclassical mansion, outbuildings, and gardens. More than just a residence, Monticello was also a working plantation, where Jefferson kept roughly 130 Black people in slavery. Their duties included tending gardens and livestock, plowing fields, and working at the onsite textile factory. Now a museum centered on its original owner, Monticello is open to the public for tours. The property was designated as a National Historic Landmark in 1966 and a UNESCO World Heritage Site in 1987. Children, Wife, and Sally Hemings From 1767 to 1774, Jefferson practiced law in Virginia with great success, trying many cases and winning most of them. During these years, he also met and fell in love with Martha Wayles Skelton, a recent widow and one of the wealthiest women in Virginia. The pair married on January 1, 1772. Thomas and Martha Jefferson had six children together, but only two survived into adulthood: Martha, their firstborn, and Mary, their fourth, who went by the name “Maria.” Only Martha survived her father. His six children with Martha, however, weren’t the only kids Jefferson fathered. History scholars and a significant body of DNA evidence indicate that Jefferson had an affair—and several children—with Sally Hemings, one of his enslaved people and the elder Martha’s half-sister. (Sally’s mother, Betty Hemings, was enslaved by Mather’s father, John Wayles, who also fathered Sally.) Read Her Biography Sally Hemings It’s overwhelmingly likely, if not absolutely certain, that Jefferson fathered all six of Sally Hemings’ children. Even the Thomas Jefferson Foundation, which owns and operates Monticello, has publicly acknowledged this and considers Jefferson’s paternity of Hemings’ children “settled historical matter.” The most compelling proof is DNA evidence, revealed in 1998, showing that some male member of the Jefferson family fathered Hemings’ children, and that it wasn’t Samuel or Peter Carr, the only two of Jefferson’s male relatives in the vicinity at the relevant times. Only four of Jefferson and Hemings’ six children survived. William Beverly Hemings, Harriet Hemings, James Madison Hemings, and Thomas Eston Hemings were born into slavery, though Jefferson freed them. Still shrouded in history is the exact nature of Jefferson’s relationship with Sally, who was thirty years younger than the Founding Father. Declaration of Independence The beginning of Jefferson’s professional life coincided with major changes in Great Britain’s 13 American colonies . The conclusion of the French and Indian War in 1763 left Great Britain in dire financial straits; to raise revenue, the Crown levied a host of new taxes on its colonies in America. In particular, the Stamp Act of 1765, which imposed a tax on printed and paper goods, outraged the colonists, giving rise to the American revolutionary slogan, “No taxation without representation.” Eight years later, on December 16, 1773, colonists protesting a British tea tax dumped 342 chests of tea into the Boston Harbor in what is known as the Boston Tea Party . In April 1775, American militiamen clashed with British soldiers at the Battles of Lexington and Concord , the first conflicts in what developed into the Revolutionary War . Jefferson was one of the earliest and most fervent supporters of the cause of American independence from Great Britain. He was elected to the Virginia House of Burgesses in 1768 and joined its radical bloc, led by Patrick Henry and George Washington . Keep Reading The Founding Fathers: What Were They Really Like? The Best Books About Founding Fathers In 1774, Jefferson penned his first major political work, A Summary View of the Rights of British America , which established his reputation as one of the most eloquent advocates of the American cause. A year later, Jefferson traveled to Philadelphia to attend the Second Continental Congress , which created the Continental Army and appointed Washington as its commander-in-chief. However, the Congress’ most significant work fell to Jefferson himself. Getty Images Declaration Committee members Thomas Jefferson, Roger Sherman, Benjamin Franklin, Robert Livingston, and John Adams at work In June 1776, the Congress appointed a five-man committee—Jefferson, John Adams , Benjamin Franklin , Roger Sherman , and Robert Livingston—to draft a Declaration of Independence . The committee then chose Jefferson to author the declaration’s first draft, selecting him for what Adams called his “happy talent for composition and singular felicity of expression.” Over 17 days, Jefferson drafted one of the most beautiful and powerful testaments to liberty and equality in world history. The document opens with a preamble stating the natural rights of all human beings then continues on to enumerate specific grievances against King George III that absolved the American colonies of any allegiance to the British Crown. Although the version of the Declaration of Independence adopted on July 4, 1776, had undergone a series of revisions from Jefferson’s original draft, its immortal words remain essentially his own: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights; that among these are Life, Liberty, and the pursuit of Happiness.” Virginia Governor and House Delegate After authoring the Declaration of Independence, Jefferson returned to Virginia, where, from 1776 to 1779, he served as a member of the Virginia House of Delegates. There he sought to revise Virginia’s laws to fit the American ideals he had outlined in the Declaration of Independence.  Jefferson successfully abolished the doctrine of entail, which dictated that only a property owner’s heirs could inherit his land, and the doctrine of primogeniture, which required that in the absence of a will a property owner’s oldest son inherited his entire estate. On June 1, 1779, the Virginia legislature elected Jefferson as the state’s second governor. His two years as governor proved the low point of Jefferson’s political career. Torn between the Continental Army’s desperate pleas for more men and supplies and Virginians’ strong desire to keep such resources for their own defense, Jefferson waffled and pleased no one. As the Revolutionary War progressed into the South, Jefferson moved the capital from Williamsburg to Richmond, only to be forced to evacuate that city when it, rather than Williamsburg, turned out to be the target of British attack. On June 1, 1781, the day before the end of his second term as governor, Jefferson was forced to flee his home at Monticello, only narrowly escaping capture by the British cavalry. Although he had no choice but to leave, his political enemies later pointed to this inglorious incident as evidence of cowardice. Jefferson declined to seek a third term as governor and stepped down on June 4, 1781. Claiming that he was giving up public life for good, he returned to Monticello, where he intended to live out the rest of his days as a gentleman farmer surrounded by the domestic pleasures of his family, his farm, and his books. But the next year, Jefferson was spurred back into public life by private tragedy: the untimely death of his beloved wife, Martha, on September 6, 1782, about six weeks before her 34 th birthday. National Appointments: Minister to France and Secretary of State After months of mourning, in June 1783, Jefferson returned to Philadelphia to lead the Virginia delegation to the Confederation Congress. In 1785, that body appointed Jefferson to replace Benjamin Franklin as the U.S. minister to France. His official duties as minister consisted primarily of negotiating loans and trade agreements with private citizens and government officials in Paris and Amsterdam. Although Jefferson appreciated much about European culture—its arts, architecture, literature, food, and wines—he found the juxtaposition of the aristocracy’s grandeur and the masses’ poverty repellant. “I find the general fate of humanity here, most deplorable,” he wrote in one letter. In Europe, Jefferson rekindled his friendship with John Adams , who served as minister to Great Britain, and his wife, Abigail Adams . The educated and erudite Abigail, with whom Jefferson maintained a lengthy correspondence on a wide variety of subjects, was perhaps the only woman he ever treated as an intellectual equal. After nearly five years in Paris, Jefferson returned to America at the end of 1789 with a much greater appreciation for his home country. As he wrote to his good friend James Monroe , “My God! How little do my countrymen know what precious blessings they are in possession of, and which no other people on earth enjoy.” America’s First President George Washington’s Biography 10 Great Quotes by George Washington How George Washington Won the Presidency Jefferson arrived in Virginia in November 1789 to find George Washington waiting for him with news that Washington had been elected the first president of the United States of America and that he was appointing Jefferson as his secretary of state. Besides Jefferson, Washington’s most trusted advisor was Treasury Secretary Alexander Hamilton . A dozen years younger than Jefferson, Hamilton was a New Yorker and war hero who, unlike Jefferson and Washington, had risen from humble beginnings. Rancorous partisan battles emerged to divide the new American government during Washington’s presidency. On one side, the Republican Party, led by Jefferson, promoted the supremacy of state governments, a strict constructionist interpretation of the U.S. Constitution , and support for the French Revolution . On the other side, the Federalists , led by Alexander Hamilton , advocated for a strong national government, broad interpretation of the Constitution, and neutrality in European affairs. Washington’s two most trusted advisors thus provided nearly opposite advice on the most pressing issues of the day: the creation of a national bank, the appointment of federal judges, and the official posture toward France. On January 5, 1794, frustrated by the endless conflicts, Jefferson resigned as secretary of state, once again abandoning politics in favor of his family and farm at his beloved Monticello. Vice Presidency Despite Jefferson’s public ambivalence and previous claims that he was through with politics, the Republicans selected Jefferson as their candidate to succeed George Washington as president. In those days, candidates didn’t campaign for office openly, so Jefferson did little more than remain at home on the way to finishing a close second to then–Vice President John Adams in the electoral college vote. By the rules of the time, that made Jefferson the new vice president. He held the post from 1797 to 1801. Besides presiding over the U.S. Senate , the vice president had essentially no substantive role in government. The long friendship between Adams and Jefferson had cooled due to political differences (Adams was a Federalist), and Adams didn’t consult his vice president on any important decisions. To occupy his time during his four years as vice president, Jefferson authored A Manual of Parliamentary Practice , one of the most useful guides to legislative proceedings ever written, and served as the president of the American Philosophical Society. Accomplishments as U.S. President John Adams ’ presidency revealed deep fissures in the Federalist Party between moderates such as Adams and George Washington and more extreme Federalists like Alexander Hamilton . In the presidential election of 1800, the Federalists refused to back Adams, clearing the way for the Republican candidates Jefferson and Aaron Burr to tie for first place, with 73 electoral votes each. After a long and contentious debate, the U.S. House of Representatives selected Jefferson to serve as the third president of America, with Burr as his vice president. The election of Jefferson in 1800 was a landmark of world history: the first peacetime transfer of power from one party to another in a modern republic. Delivering his inaugural address on March 4, 1801, Jefferson spoke to the fundamental commonalities uniting all Americans despite their partisan differences. “Every difference of opinion is not a difference of principle,” he stated. “We have called by different names brethren of the same principle. We are all Republicans, we are all Federalists.” First Term President Jefferson’s accomplishments during his first term in office, from 1801 to 1805, were numerous, remarkably successful, and productive. In keeping with his Republican values, Jefferson stripped the presidency of all the trappings of European royalty, reduced the size of the armed forces and government bureaucracy, and lowered the national debt from $80 million to $57 million in his first two years in office. Nevertheless, Jefferson’s most important achievements as president all involved bold assertions of national government power and surprisingly liberal readings of the Constitution. Louisiana Purchase Jefferson’s most significant accomplishment as president was the Louisiana Purchase. In 1803, he acquired land stretching from the Mississippi River to the Rocky Mountains from cash-strapped Napoleonic France for the bargain price of $15 million, thereby doubling the size of the nation in a single stroke. He then devised the wonderfully informative Lewis and Clark Expedition to explore, map out, and report back on the new American territories. Key Figures of the Lewis and Clark Expedition Meriwether Lewis William Clark Sacagawea Tripoli Pirates Jefferson also put an end to the centuries-old problem of Tripoli pirates from North Africa disrupting American shipping in the Mediterranean. During the Barbary War , Jefferson forced the pirates to capitulate by deploying new American warships. Notably, both the Louisiana Purchase and the undeclared war against the Barbary pirates conflicted with Jefferson’s much-avowed Republican values. Both actions represented unprecedented expansions of national government power, and neither was explicitly sanctioned by the Constitution. Keep Reading 10 Best Presidential Biographies Second Term Although Jefferson easily won re-election in 1804, his second term in office proved much more difficult and less productive than his first. He largely failed in his efforts to impeach the many Federalist judges swept into government by the Judiciary Act of 1801. However, the greatest challenges of Jefferson’s second term were posed by the war between Napoleonic France and Great Britain. Both Britain and France attempted to prevent American commerce with the other power by harassing American shipping. Britain, in particular, sought to impress American sailors into the British Navy. In response, Jefferson passed the Embargo Act of 1807, suspending all trade with Europe. The move wrecked the American economy as exports crashed from $108 million to $22 million by the time he left office in 1809. The embargo also led to the War of 1812 with Great Britain after Jefferson left office. Ideology: Political Party, Views on Slavery, and Legacy Jefferson was the first leader of the Republican Party, which formed in the 1790s and became the Democratic-Republican Party before the end of the decade. Jeffersonian Republicans advocated for a smaller federal government, encouraged states’ rights and individual liberties, and favored a strict interpretation of the U.S. Constitution. Jefferson was the first of three Democratic-Republican presidents, followed by James Madison and James Monroe . The party eventually evolved into the modern-day Democratic Party. Beyond his positions and actions while in public office, Jefferson offered a window into his political philosophy and worldview through his only full-length book, Notes on the State of Virginia . He began writing the book in late 1781 after stepping down as the governor of Virginia and ostensibly sought to outline the history, culture, and geography of his home state. However, Notes on the State of Virginia also contained Jefferson’s vision of the good society he hoped America would become: a virtuous agricultural republic based on the values of liberty, honesty, and simplicity and centered on the self-sufficient yeoman farmer. Views on Slavery Jefferson’s writings shed light on his contradictory, controversial, and much-debated views on race and slavery . Jefferson was a slave owner his entire life, and his very existence as a gentleman farmer depended on the institution of slavery. Like most white Americans of that time, Jefferson held views we would now describe as nakedly racist: He believed that Black people were innately inferior to white people in terms of both mental and physical capacity. Nevertheless, he claimed to abhor slavery as a violation of the natural rights of man. He saw the eventual solution of America’s race problem as the abolition of slavery followed by the exile of formerly enslaved people to either Africa or Haiti, because, he believed, the formerly enslaved couldn’t live peacefully alongside their former masters. As Jefferson wrote, “We have the wolf by the ears, and we can neither hold him nor safely let him go. Justice is in one scale, and self-preservation in the other.” An Appeal Against Slavery From a Leading Black Thinker Benjamin Banneker’s Letter to Thomas Jefferson Democratic Legacy Jefferson will be forever revered as one of the great American Founding Fathers . As the primary author of the Declaration of Independence, Jefferson wrote the foundational text of American democracy and one of the most important documents in world history. He also wrote about other key democratic ideals, including: The separation of church and state: In 1777, Jefferson wrote the Virginia Statute for Religious Freedom, which established freedom of religion and the separation of church and state. Although the document wasn’t adopted as Virginia state law for another nine years, it was one of Jefferson’s proudest life accomplishments. Legislative procedures: Jefferson’s A Manual of Parliamentary Practice (1801) established more granular rules for America’s legislative bodies than had been previously outlined. He was inspired to study the subject while serving as vice president, which involved overseeing the U.S. Senate. His rules are still active influences in the Senate and the U.S. House of Representatives. Ultimately, Jefferson was a man of many contradictions. He was the spokesman of liberty and a racist slave owner, a champion of the common people and a man with luxurious and aristocratic tastes, a believer in limited government and a president who expanded governmental authority beyond the wildest visions of his predecessors, a quiet man who abhorred politics and arguably the most dominant political figure of his generation. The tensions between Jefferson’s principles and practices make him all the more apt a symbol for the nation he helped create, a nation whose shining ideals have always been complicated by a complex history. Later Years: Founding the University of Virginia On March 4, 1809, after watching the inauguration of his close friend   and successor James Madison , Jefferson returned to Virginia to live  out  the rest of his days as “The Sage of Monticello.” His primary  pastime was endlessly rebuilding, remodeling, and improving his home and estate, at considerable expense. A Frenchman named Marquis de Chastellux quipped, “it may  be said that Mr. Jefferson is the first American who has  consulted the  Fine Arts to know how he should shelter himself from the  weather.” Jefferson also dedicated his later years to organizing the University   of Virginia, the nation’s first secular university. He personally   designed the campus, envisioned as an “academical village” in Charlottesville, and   hand-selected renowned European scholars to serve as its professors. The   University of Virginia opened its doors on March 7, 1825, one of the   proudest days of Jefferson’s life. At the end of his life, the former president kept up an outpouring of correspondence. In particular, he rekindled a lively correspondence on   politics, philosophy, and literature with John Adams that stands out   among the most extraordinary exchanges of letters in history. Nevertheless, Jefferson’s retirement was marred by financial woes. To   pay off the substantial debts he incurred over decades of living beyond   his means, Jefferson resorted to selling his cherished personal library   to the national government to serve as the foundation of the Library  of  Congress. When Did Thomas Jefferson Die? Jefferson died on July 4, 1826—the 50 th anniversary of  the Declaration of Independence—at his Monticello estate near Charlottesville, Virginia. His death occurred only a few hours before fellow Founding Father John Adams passed away in Massachusetts. In the moments before he passed, Adams spoke his last words, eternally true though not in the literal sense he meant them: “Thomas Jefferson survives.” Jefferson is buried in the family cemetery at his beloved Monticello, in a grave marked by a plain gray tombstone. The brief inscription it bears, written by Jefferson, himself, is as noteworthy for what it excludes as what it includes. It suggests his humility as well as his belief that his greatest gifts to posterity came in the realm of ideas rather than the realm of politics: “Here was buried Thomas Jefferson, author of the Declaration of American Independence of the Virginia Statute for Religious Freedom, and father of the University Of Virginia.” The former president’s likeness appears on the U.S. nickel and on Mount Rushmore. The Thomas Jefferson Memorial in Washington, D.C., was dedicated in 1943 and took architectural influence from Jefferson’s designs at Monticello and the University of Virginia. Dive Deeper Which Historical Figures Are on U.S. Money? Quotes We have the wolf by the ears, and we can neither hold him nor safely let him go. Justice is in one scale, and self-preservation in the other. All tyranny needs to gain a foothold is for people of good conscience to remain silent. How little do my countrymen know what precious blessings they are in possession of, and which no other people on earth enjoy. Every difference of opinion is not a difference of principle. We have called by different names brethren of the same principle. We are all Republicans, we are all Federalists. The natural progress of things is for liberty to yield and government to gain ground. I hold it that a little rebellion now and then is a good thing, and as necessary in the political world as storms in the physical. I find friendship to be like wine, raw when new, ripened with age, the true old man’s milk and restorative cordial. I cannot live without books; but fewer will suffice where amusement, and not use, is the only future object. The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. All, too, will bear in mind this sacred principle, that though the will of the majority is in all cases to prevail, that will to be rightful must be reasonable; that the minority possess their equal rights, which equal law must protect, and to violate would be oppression. I like the dreams of the future better than the history of the past. [A] wise and frugal government, which shall restrain men from injuring one another, shall leave them otherwise free to regulate their own pursuits of industry and improvement, and shall not take from the mouth of labor the bread it has earned. I know well that no man will ever bring out of that office the reputation which carries him into it. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below U.S. Presidents Jimmy Carter Elvis Asked Richard Nixon to Be a Federal Agent George Washington Was Almost Kidnapped in the Army Hunter Biden and Other Presidential Problem Kids Advertisement - Continue Reading Below Donald Trump 4 U.S. Presidents Who Won the Nobel Peace Prize Which Historical Figures Are on U.S. Money? Joe Biden President Donald Trump’s Family Tree Who Killed JFK? You Won’t Believe Us Anyway 12 Notable Grand Ole Opry Performers Can You Name U.S. Presidents When They Were Young? Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Contact First Name Last Name Email Department - Select Department - Dining Events Media / Press General Admission Weddings Corporate Groups Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://www.jeffreal.com/",
      "text": "Park County Real Estate | Jefferson Real Estate MENU Search Featured Listings All Park County Cabins & Homes All Park County Vacant Land All Park County Ranches Advanced Search Search by Map Property Tracker Communities Buyers Buyers Form Personalized Property Search Cabins and Homes For Sale Vacant Land For Sale Ranch/Large Acreage For Sale Mortgage Calculator Mortgage Pre-Approval Price Reductions Are You Ready To Buy A House? Home Buyers Guide NAR Settlement - What it means for Buyers BUYERS FAQ Sellers Seller Form Recent Sales Free Market Analysis Why List with Jefferson Real Estate? JRE Concierge Home Seller Guide NAR Settlement - What it means for Sellers SELLERS FAQ About About Testimonials Recreational Activities Live Cam & Weather History of South Park Contractors Directory Contact Things To Do Cycling Guide Central Colorado Fishing Guide Summer In The Park-Local Events Park County Trail Guide More Login / Register Blog (719) 836-2615 ENGLISH 中文 FRANÇAIS 한국어 ITALIANO 日本語 DEUTSCH PORTUGUÊS РУССКИЙ ESPAÑOL TIẾNG VIỆT Find Your Park County Colorado Home $COUNT$ listing$S$ available. Let us find the one that's right for you. Enter Location, Zip, Address or MLS # Min Price Max Price Search Homes Search Properties Near Me What's Your Mtn Property Worth? Find your home or land value in today's market, for free. Find Out Explore Park County Colorado Listings For Sale Featured Listings View More Like This Newest Listings View More Like This Vacant Land View More Like This Luxury Homes View More Like This Ranches View More Like This Explore Park County Colorado Communities and Neighborhoods Alma Bailey Bar D Ranch Beaver Ridge Black Mountain and Weston Pines Blue River Breckenridge Buena Vista Circle R Ranch Como Elkhorn Ranches Fairplay Four Mile Fishing Club Fourmile Creek Ranch Foxtail Estates Foxtail Pines Grant Guffey Hartsel Indian Mountain Jefferson Jefferson Heights Kenosha Trout Club Lake George Lost Park Ranch Michigan Hill Placer Valley Redhill Forest Rocker 7 Ranch Santa Maria Ranch Shawnee Silverheels Ranch Slash 6 Ranch South Park Ranches Stagestop Tarryall Fishing Club The Bighorn The Buffalo Thousand Peaks Ranch Valley of the Sun Warm Springs Ranch Western Union Ranch RV Park/CORA Wildwood Recreational Village View More Park County Colorado Market at a Glance MEDIAN PRICE (Past 6 months) Select a Metric Select a Metric Median Price Avg. Price per Sq. Ft. Avg. Days on Site No Chart Data Today's Listings Residential New Today Price Reduced Recently Sold Recent Posts from our Park County CO Blog The Real Estate Market Mortgage Rates Just Saw Their Biggest Drop in a Year BY Kevin Copeland 9/10/2025 Real Estate For Sale 5700 San Juan St, Lake George CO 80827 BY JoAnn MacDougall 9/5/2025 The Real Estate Market What Everyone’s Getting Wrong About the Rise in New Home Inventory BY Kevin Copeland 9/4/2025 The Real Estate Market From Frenzy to Breathing Room: Buyers Finally Have Time Again BY Kevin Copeland 8/30/2025 View All Blog Posts Park County Real Estate Welcome to JeffReal.com, your one-stop source for Park County Colorado real estate. Use our state-of-the-art property search , including an interactive map search , to find homes for sale in Park County Colorado. These listings are updated from the MLS. Park County Real Estate Or, use our Community Guide to help you in your search for Park County Colorado real estate listings. Our community searches will keep you up to date with the latest properties in the areas you are interested in. And, for your convenience, be sure to register for a free account to receive email notifications whenever new homes for sale come on the market that match your specific criteria, and save your favorite properties for quick and easy access whenever you need — it's fast, easy, automatic and FREE! With a Property Tracker account, you'll be among the first to know about the newest Park County Colorado homes for sale. Colorado Mountain Real Estate Park County Real Estate Thank you for taking the time to visit Jefferson Real Estate. Park County Real Estate Jefferson Real Estate is a real estate company based in Jefferson, Colorado. Jefferson Real Estate specializes in real estate in Park County Colorado, including all of the towns throughout the county. From cozy cabins to multi-million dollar ranches, Jefferson Real Estate, Inc. is ready to bring you the best in Colorado Mountain real estate. Park County Real Estate Jefferson Real Estate Website & in Office Park County Real Estate All the latest listings available in Multiple MLS systems. Colorado does not have just one. Park County Real Estate Large Photos, Home Tours & Community Info Park County Real Estate Best maps available, your cell may not work. Park County Real Estate Instant, Daily or Weekly Notifications of New Listings and Price Changes. Park County Real Estate Free to use. We respect your privacy and do not sell your info for ANY reason. Park County Real Estate We are here to help Find Your Elevated Life!! Park County Real Estate Jefferson Real Estate is part of the Tom Ferry network. Bringing together exceptional technology, market knowledge, and a commitment to the relationships we have built over the years, we have been the leader in the Park County real estate market for over 30 years. Get in touch with one of our experienced agents and start your Mountain Property search today. Park County Real Estate Contact Jefferson Real Estate, Inc. Jefferson, CO 80456 O: (719) 836-2615 E: Email Us All Listings provided by Multiple MLS providers and may not necesarrily be Listed/Sold by Jefferson Real Estate Inc. Connect Facebook Instagram LinkedIn YouTube Pinterest Navigation Search Communities Buyers Sellers About Contact Things To Do Popular Searches Featured Listings Newest Listings Vacant Land Luxury Homes Ranches Accessibility | Terms of Service | Privacy Policy | DMCA Notice | Property Listings | Sitemap © Copyright 2025 Jefferson Real Estate, Inc.. All Rights Reserved. Real Estate Websites by Sierra Interactive We're Here to Help Feel free to reach out any time: Jefferson Real Estate, Inc. Jefferson, CO 80456 O: (719) 836-2615 E: Email Us All Listings provided by Multiple MLS providers and may not necesarrily be Listed/Sold by Jefferson Real Estate Inc. Connect Facebook Instagram LinkedIn YouTube Pinterest Have a Question or Want a Free Market Report? Contact Us Home Blog Search Featured Listings All Park County Cabins & Homes All Park County Vacant Land All Park County Ranches Advanced Search Search by Map Property Tracker Communities Buyers Buyers Form Personalized Property Search Cabins and Homes For Sale Vacant Land For Sale Ranch/Large Acreage For Sale Mortgage Calculator Mortgage Pre-Approval Price Reductions Are You Ready To Buy A House? Home Buyers Guide NAR Settlement - What it means for Buyers BUYERS FAQ Sellers Seller Form Recent Sales Free Market Analysis Why List with Jefferson Real Estate? JRE Concierge Home Seller Guide NAR Settlement - What it means for Sellers SELLERS FAQ About About Testimonials Recreational Activities Live Cam & Weather History of South Park Contractors Directory Contact Things To Do Cycling Guide Central Colorado Fishing Guide Summer In The Park-Local Events Park County Trail Guide Questions? We're Here to Help Recently From Our Blog Mortgage Rates Just Saw Their Biggest Drop in a Year By Kevin Copeland 9/10/2025 5700 San Juan St, Lake George CO 80827 By JoAnn MacDougall 9/5/2025 We're Here to Help Feel free to reach out any time: Jefferson Real Estate, Inc. Jefferson, CO 80456 O: (719) 836-2615 E: Email Us All Listings provided by Multiple MLS providers and may not necesarrily be Listed/Sold by Jefferson Real Estate Inc. Connect Facebook Instagram LinkedIn YouTube Pinterest Have a Question or Want a Free Market Report? Contact Us Call Now"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Surname E-Mail name Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.jefferson.edu/academics/colleges-schools-institutes/architecture-and-the-built-environment/programs/landscape-architecture/park-in-a-truck.html",
      "text": "Park in a Truck Initiative Skip to main content Apply Visit Give More Search Academics Back Academics Academics Home Program Finder Areas of Interest Registrar's Office Online Programs Study Away Academic Calendars Colleges, Schools & Institutes Sidney Kimmel Medical College College of Architecture & The Built Environment Kanbar College of Design, Engineering & Commerce School of Business School of Design & Engineering College of Health Professions College of Humanities & Sciences College of Life Sciences College of Nursing College of Pharmacy College of Population Health College of Rehabilitation Sciences Institute of Emerging Health Professions Continuing & Professional Studies Find Your Program Prepare yourself for what’s yet to come. Admissions Back Admissions Admissions Home Undergraduate Admissions Graduate Admissions Continuing & Professional Studies Admissions Sidney Kimmel Medical College Admissions Admissions Quick Links Request Information Schedule a Visit Take a Virtual Tour Apply for Admission Financing Your Education Contact Admissions Apply Start your Jefferson journey today. Tuition & Financial Aid Back Tuition & Financial Aid Tuition & Financial Aid Home Tuition, Fees and Room & Board (2025-26) Tuition & Financial Aid Quick Links Financial Aid Office Student Accounts Office Contact Us Expert Center City and East Falls staffs are here to help. Life at Jefferson Back Life at Jefferson Life at Jefferson Home Center City Residential Life East Falls Residential Life Virtual Tours Life at Jefferson Quick Links Explore Philadelphia University Catalog & Handbooks Commencement Consumer Information & Disclosures Plan Your Visit Each of our locations offers a unique learning environment. Research Back Research Research Home Labs & Service Centers Research Resources 2025 Research Magazine Research Quick Links Applied Research Basic Research Clinical Research Athletics Back Athletics Athletics Home Visit jeffersonrams.com Athletic Facilities Shop Official Store Athletics Quick Links Health & Wellness at Jefferson Jefferson Recreation & Fitness Center News Back News News Home News Quick Links Design & Style Science & Technology Business Health Life at Jefferson Podcasts More Apply Visit Give More Close Apply Visit Give Explore More: Jefferson Advantage About Jefferson Virtual Tour Jefferson Online Global Jefferson Campus Locations Alumni Careers Provost Current Students & Faculty Center City Campus Banner Campus Store Canvas Commuter Services Campus Life & Current Students Faculty & Staff JeffMail Library Office 365 Student Portal East Falls Campus Banner Campus Store Canvas Faculty & Staff Giving JeffMail Library Starfish Student Life & Resources Student Portal YouTube Instagram Facebook Twitter LinkedIn Park in a Truck Initiative Return to Home Toggle Hidden Breadcrumb Items Academics Academics College of Architecture & the Built Environment Bachelor of Landscape Architecture Download the DIY Toolkit With Park in a Truck DIY Toolkit, you can design, build and sustain your own unique greenspace for your community. The Toolkit is easy to follow, easy to build and easy to maintain – download it today! Learn More View Toolkit (PDF) Park in a Truck allows communities to better themselves, and actually serves residents rather than displace them. DeWayne Drummond President of Mantua Civic Association Park in a Truck Empowers Communities Park in a Truck enables communities to design, build, and sustain their own park. Design Build Sustain Transforming Philadelphia's Urban Green Spaces The Park in a Truck program is using urban green spaces to transform neighborhoods with the help of young people. But what is Park in a Truck? With Park in a Truck DIY toolkit, you can design, build and sustain your own unique green space for your community. Read More Landscape Architecture Program Director Awarded Robert Wood Johnson Grant Kimberlee Douglas, Jefferson’s landscape architecture program director, has recently joined the next cohort of Interdisciplinary Research Leaders with a Robert Wood Johnson grant supporting the Park in a Truck initiative. Read More Vacant Lots Become Beautiful Parks The corner of 38th and Melon Streets is the subject of Thomas Jefferson University's \"Park in a Truck\" program, which enables community leaders like Drummond to organize and build green gathering spaces on previously empty land. Watch 6 ABC Feature Park in a Truck on WHYY's Movers and Makers \"Park in a Truck” is a project developed by Kimberlee Douglas with her students at Thomas Jefferson University, where they created a DIY Toolkit for communities. Watch the Feature on WHYY Prev Next Melon Street Park Melon Street Park 643 N. Melon Street Philadelphia, PA Visit Park Cecil Street Community Garden Cecil Street Community Garden 5730 Kingsessing Avenue Philadelphia, PA Visit Garden 4+ Features Including... Philadelphia Inquirer 6ABC Action News Fast Company Jefferson Nexus News Grid Philly Magazine AARP 6+ Partners Including... City of Philadelphia Empowered CDC National Wildlife Federation John Heinz National Wildlife Refuge Mantua CDC Audubon Mid-Atlantic 3+ Awards Including... Green Building United’s 2020 Groundbreaker Fast Company’s 2020 Social Good Recognition ASLA’s 2019 Community Service Award Dream. Build. Sustain. Professor Kimberlee Douglas, Director, Landscape Architecture Professor at the College of Architecture & the Built Environment, started Park in a Truck in 2019. Students at Thomas Jefferson University Landscape Architecture Program learn how to build parks within Philadelphia communities. By donating to Park in a Truck’s mission, communities can build green networks established through low-cost fast-turnaround renovations of under-utilized lots. Donate Learn More Partners For more information or questions call 215-951-0115 or email ParkInATruck@jefferson.edu. Park Ambassadors See other Park Ambassadors and volunteer opportunities at @parkinatruck on Instagram. Student Opportunities Interested in learning more about the Landscape Architecture Program? Apply to Jefferson! Follow Jefferson Park in a Truck on Instagram Join us on social media to learn more about our projects and stories Melon Park Park in a truck park Melon Street Park in Mantua, Philadelphia. This community designed, built and are maintaining their own park! The summer camp they ran this summer at the park made birdhouses with the kids! Cecil Street Community Garden Lots of hard work making this community garden at Cecil street come to life Tilden Middle School Tilden middle school kids creating a pollinator garden at their school! #tildenmiddleschool #parkinatruck with #audobonsociety sponsored by @pewtrusts @ParkinaTruck on Instagram Park in a Truck Toolkit BLA in Landscape College of Architecture & the Built Environment Video: Jefferson Park in a Truck Assembly Instructions #1 Video: Jefferson Park in a Truck Assembly Instructions #2 Apply Visit Give Facebook Twitter YouTube Instagram LinkedIn Copyright © 2025 Thomas Jefferson University Jefferson Health Innovation Philanthropy Contact Admissions Privacy Policy Consumer Information Jefferson holds itself accountable, at every level of the organization, to nurture an environment of inclusion and respect, by valuing the uniqueness of every individual, celebrating and reflecting the rich diversity of its communities, and taking meaningful action to cultivate an environment of fairness, belonging & opportunity."
    },
    {
      "url": "https://www.jeffersonparkforward.org/",
      "text": "Jefferson Park Forward - Jefferson Park Forward is an active neighborhood association dedicated to creating a vibrant and inclusive community by driving positive change. Close Navigation Home About News Membership Log In Donate Calendar JPF Community Stage at Jeff Fest General Meetings JPF Walks Leadership Businesses Community Volunteer Committees Community Development Marketing Social & Events Livability Little Libraries Bylaws Contact Us Jefferson Park Forward Menu Jefferson Park Forward Jefferson Park Forward is an active neighborhood association dedicated to creating a vibrant and inclusive community by driving positive change. Learn More About Us Our Mission & Vision Jefferson Park Forward is an active neighborhood association dedicated to creating a vibrant and inclusive community by driving positive change. GOALS: Gather neighbors to learn about local projects and share information in a friendly, apolitical environment. Create volunteer opportunities to support local nonprofits and community resources. Partner with and promote local businesses and attractions. Embrace an open-minded approach to new ideas, proposals, and smart development. Nurture arts and culture in the community. Serve as a voice of our members. Committees Working Committees Minutes JPF General Meetings Membership Subscribe 2025 Jefferson Park Forward Pub Crawl April 17, 2025 Join us for our annual Jefferson Park Forward Pub Crawl! This is our annual fundraiser to help support community events and programming throughout the neighborhood. This year we will kick off at Windsor Tavern and end at The Brig. Tickets are $45. Your ticket includes:… Filed Under: News JPF October 2024 General Meeting Minutes October 21, 2024 A huge thank you to everyone who joined us on Thursday, Oct. 17 at the Windsor Tavern! Amended bylaw changes were voted in, and we heard from 6 local business owners about what they have going on this fall. See the full meeting minutes here. Filed Under: Meeting Minutes JPF October 2024 General Meeting October 14, 2024 Join JPF for our next general member meeting on Thursday, October 17, from 7-8pm. We are hosting our meeting in the back area of The Windsor. (Come early, grab a seat, grab some food, tip well!) We’ll have a vote for proposed bylaw changes (you… Filed Under: Meeting Notice , News JPF Community Stage at Jeff Fest June 24, 2024 Jefferson Park Forward is hosting the Community Stage for Jeff Fest for the 6th year! This year the JPF Community Stage at Jeff Fest (July 12-14, 2024) will feature 10+ acts of original songwriters, recording artists, and performers from Jefferson Park and the surrounding area.… Filed Under: Information , News Tagged With: Jeff Fest , music , Volunteer JPF May 2024 General Meeting May 11, 2024 Join us on Thursday, May 16, at 7pm at the Windsor Tavern (4530 N Milwaukee Ave, Chicago) to hear about spring happenings in Jefferson Park! Guests include the Jefferson Park Sunday Market and Jefferson Park Pollinator Gardens, with more invited! Filed Under: Event , Meeting Notice , News JPF 2022 Annual Meeting September 8, 2022 Each year, Jefferson Park Forward members meet at our Annual Meeting for the sole purpose of electing their representatives to serve on the ten-member Board of Directors. Directors serve two-year staggered terms. This year, our Annual Meeting will be held at Weston’s Coffee & Tap… Filed Under: Information Tagged With: annual meeting , JPF Board of Directors JPF Board of Director Elections August 15, 2022 How to Submit for a Board Seat The nine-member JPF Board of Directors are elected representatives of the JPF membership. JPF holds board elections every September during our annual meeting. Each Director serves a two-year term. In even numbered years the following Board seats are… Filed Under: JPF Business Tagged With: annual meeting , elections JPF 2021 Homebrew Competition July 8, 2021 Calling All Brewers! Hear ye, hear ye. Jefferson Park Forward is calling all brewers in the neighborhood to participate in our third annual JPF Homebrew Competition. The event will be held on Friday, November 12 and we are looking for some home brewers willing to… Filed Under: Event Tagged With: beer , homebrew , Volunteer A Message from the Board (April 2021) April 14, 2021 A little distance from 2020 and things are looking brighter. We get more daylight every day, vaccines are rolling out, and spring is here. As our neighborhood reopens and we move towards recovery, we will proceed cautiously, but optimistically.  JPF will continue to conduct our… Filed Under: News A Message From the Board (January 2021) January 1, 2021 Welcome to a new year and good riddance to a year like no other. COVID-19 shined a light on our society’s inequities, stole our time, and took so many lives. It can be difficult to see the light in the darkness, but so much good… Filed Under: News A Message from the President August 25, 2020 For the past five years I have watched Jefferson Park Forward spring up from the ground after fundamental disagreement over the direction of the Jefferson Park Neighborhood Association. I am proud to co-found and lead JPF as we’ve grown and expanded our footprint within the… Filed Under: Uncategorized Tagged With: news , Ryan Richter Jefferson Park Open Mic Night! July 15, 2025 Jefferson Park Forward is excited to extend our monthly open mic night in our neighborhood with our friends at The Brig! Singers, songwriters, instrumentalists – all are welcome at the monthly Jefferson Park Open Mic at The Brig. Casual, friendly, and a great chance to… Tagged With: Jeff Fest Back Porch Music Series July 7, 2025 FREE CONCERT SERIES! Join the Jefferson Park Forward, and local co-sponsors as we present the Back Porch Music Series. This event recurs on select Sundays in Jefferson Memorial Park, featuring talented local artists who will entertain us from the porch of the Esdohr House (just… Back Porch Music Series July 7, 2025 FREE CONCERT SERIES! Join the Jefferson Park Forward, and local co-sponsors as we present the Back Porch Music Series. This event recurs on select Sundays in Jefferson Memorial Park, featuring talented local artists who will entertain us from the porch of the Esdohr House (just… Back Porch Music Series July 7, 2025 FREE CONCERT SERIES! Join the Jefferson Park Forward, and local co-sponsors as we present the Back Porch Music Series. This event recurs on select Sundays in Jefferson Memorial Park, featuring talented local artists who will entertain us from the porch of the Esdohr House (just… Jefferson Park Open Mic Night! July 7, 2025 Jefferson Park Forward is excited to extend our monthly open mic night in our neighborhood with our friends at The Brig! Singers, songwriters, instrumentalists – all are welcome at the monthly Jefferson Park Open Mic at The Brig. Casual, friendly, and a great chance to… Tagged With: Jeff Fest JPF Community Stage at Jeff Fest July 7, 2025 Jefferson Park Forward is hosting the Community Stage at Jeff Fest for the 7th year! This year will feature 8 bands of all original songwriters and recording artists from Jefferson Park and the surrounding area. Come support live music, original music, and your neighbors at… Tagged With: Jeff Fest JPF Community Stage at Jeff Fest July 7, 2025 Jefferson Park Forward is hosting the Community Stage at Jeff Fest for the 7th year! This year will feature 8 bands of all original songwriters and recording artists from Jefferson Park and the surrounding area. Come support live music, original music, and your neighbors at… Tagged With: Jeff Fest JPF General Meeting July 7, 2025 Join us for our next JPF General Member Meeting on Thursday, July 17 from 7-8pm! We’ll be in the Gateway Lounge (Annex) at Copernicus Center. Come meet your neighbors, grab a refreshment from the Gateway Lounge (bar will be open!) and join us for local… Tagged With: general meeting JPF October 2024 General Meeting October 14, 2024 Join JPF for our next general member meeting on Thursday, October 17, from 7-8pm. We are hosting our meeting in the back area of The Windsor. (Come early, grab a seat, grab some food, tip well!) We’ll have a vote for proposed bylaw changes (you… Tagged With: general meeting 1 2 3 … 30 Next Page » Latest Tweets My Tweets Follow Us Facebook Instagram RSS Twitter YouTube Search Jefferson Park Forward Jefferson Park Forward is a community and neighborhood association based in Jefferson Park, Chicago, IL. We are a registered, non-profit 501(c)(3) public charity. Questions, comments, concerns? Email us at: info@jeffersonparkforward.org Sign Up for Our Newsletter First Name: Last Name: Email address: Leave this field empty if you're human: © Jefferson Park Forward 2015–2025 Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.jcparks.com/contact-us/",
      "text": "Contact Us - Jefferson City, MO Parks Programs Adult Youth Adaptive Parks & Trails City Parks Trails Forestry Scenic Stops Facilities Rentals Outdoor Facilities Indoor Facilities Events About Program Guide Park Improvements Parks Commission Donate Contact Us  Call Us 573.634.6482  Visit Us 1299 Lafayette Street Jefferson City, MO 65101  Email Us jcparks@jeffersoncitymo.gov I .... * Would like to Rent a JC Park Facility Would like to Report a Concern in a Park Would like to make Reservations at The Linc Want to Become a Volunteer Would like to Learn about Scholarship Opportunities Have Questions ... Share An Idea Name * First Last Email * Phone Your Message * CAPTCHA Name This field is for validation purposes and should be left unchanged. Contact Us 573.634.6482 Email 1299 Lafayette Street Jefferson City, MO 65101 NAVIGATION Programs Parks & Trails Facilities Events Policies & Procedures Website Accessibility Progress Report Parks Foundation About Us SOCIAL Facebook YouTube Instagram 573.634.6482 Email 1299 Lafayette Street Jefferson City, MO 65101 SOCIAL Facebook YouTube Instagram NAVIGATION Programs Parks & Trails Facilities Events Policies & Procedures Website Accessibility Progress Report Parks Foundation About Us 573.634.6482 Email 1299 Lafayette Street Jefferson City, MO 65101 NAVIGATION Programs Parks & Trails Facilities Events Policies & Procedures Website Accessibility Progress Report Parks Foundation About Us SOCIAL Facebook YouTube Instagram 2025 Jefferson City Department of Parks & Recreation & Forestry Programs ▼ Adult Youth Adaptive Parks & Trails ▼ City Parks Trails Forestry Scenic Stops Facilities ▼ Rentals Outdoor Facilities Indoor Facilities Events About ▼ Program Guide Park Improvements Parks Commission Donate"
    },
    {
      "url": "https://www.biography.com/political-figures/thomas-jefferson",
      "text": "Thomas Jefferson: Biography, U.S. President, Founding Father Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Shohei Ohtani Real-Life Heroes of 9/11 Famous Political Figures U.S. Presidents Thomas Jefferson Thomas Jefferson Thomas Jefferson was a Founding Father of the United States, author of the Declaration of Independence, and America’s third president. By Biography.com Editors Updated: Jul 03, 2024 3:59 PM EDT Getty Images 1743-1826 Who Was Thomas Jefferson? Thomas Jefferson was one of the Founding Fathers of the United States. The native Virginian was the primary author of the Declaration of Independence and later held several national offices. Jefferson served as the nation’s first secretary of state, and the second vice president (under John Adams ), and the third American president, from 1801 to 1809. During his two-term presidency, Jefferson doubled the size of the United States by successfully brokering the Louisiana Purchase and defeated pirates from North Africa during the Barbary War. In retirement, Jefferson founded the University of Virginia and continued work on his beloved Monticello estate. He died on the 50 th anniversary of the Declaration of Independence at age 83. Jump to: Who Was Thomas Jefferson? Quick Facts When and Where Was Thomas Jefferson Born? Education Monticello Children, Wife, and Sally Hemings Declaration of Independence Virginia Governor and House Delegate National Appointments: Minister to France and Secretary of State Vice Presidency Accomplishments as U.S. President Ideology: Political Party, Views on Slavery, and Legacy Later Years: Founding the University of Virginia When Did Thomas Jefferson Die? Quotes Quick Facts FULL NAME: Thomas Jefferson BORN: April 13, 1743 DIED: July 4, 1826 BIRTHPLACE: Shadwell, Virginia SPOUSE: Martha Jefferson (1772-1782) CHILDREN: 12 ASTROLOGICAL SIGN: Aries When and Where Was Thomas Jefferson Born? Thomas Jefferson was born on April 13, 1743, at the Shadwell plantation located just outside of Charlottesville, Virginia. Thomas was born into one of the most prominent families of Virginia’s planter elite. His mother, Jane Randolph Jefferson, was a member of the proud Randolph clan, a family claiming descent from English and Scottish royalty. His father, Peter Jefferson, was a successful farmer as well as a skilled surveyor and cartographer who produced the first accurate map of the Province of Virginia. Thomas was the third born of 10 siblings. As a boy, his favorite pastimes were playing in the woods, practicing the violin, and reading. Education Jefferson began his formal education at age 9, studying Latin and Greek at a local private school run by Reverend William Douglas. In 1757, at the age of 14, he took up further study of the classical languages as well as literature and mathematics with Reverend James Maury, whom Jefferson later described as “a correct classical scholar.” In 1760, having learned all he could from Maury, Jefferson left home to attend the College of William and Mary in Williamsburg, Virginia’s capital. Although it was the second oldest college in America (after Harvard), William and Mary wasn’t an especially rigorous academic institution at that time. Jefferson was dismayed to discover that his classmates expended their energies betting on horse races, playing cards, and courting women rather than studying. Nevertheless, the serious and precocious Jefferson fell in with a circle of older scholars that included Professor William Small, Lieutenant Governor Francis Fauquier, and lawyer George Wythe, and it was from them that he received his true education. After three years at William and Mary, Jefferson decided to read law under Wythe, one of the preeminent lawyers of the American colonies. There were no law schools at this time; instead aspiring attorneys “read law” under the supervision of an established lawyer before being examined by the bar. Wythe guided Jefferson through an extraordinarily rigorous five-year course of study—more than double the typical duration. By the time Jefferson won admission to the Virginia bar in 1767, he was already one of the most learned lawyers in America. Monticello Getty Images Thomas Jefferson designed his famous home, Monticello, which was initially completed in the 1780s. In 1769, Jefferson began construction of what was perhaps his greatest labor of love: Monticello , his house atop a small rise outside of Charlottesville, Virginia. The house was built on land within the state’s Piedmont region that his father had owned since 1735. In keeping with his interests as one of America’s greatest Renaissance Men—he liked botany, archaeology, music, and birdwatching, among other subjects—Jefferson, himself, drafted the blueprints for Monticello’s neoclassical mansion, outbuildings, and gardens. More than just a residence, Monticello was also a working plantation, where Jefferson kept roughly 130 Black people in slavery. Their duties included tending gardens and livestock, plowing fields, and working at the onsite textile factory. Now a museum centered on its original owner, Monticello is open to the public for tours. The property was designated as a National Historic Landmark in 1966 and a UNESCO World Heritage Site in 1987. Children, Wife, and Sally Hemings From 1767 to 1774, Jefferson practiced law in Virginia with great success, trying many cases and winning most of them. During these years, he also met and fell in love with Martha Wayles Skelton, a recent widow and one of the wealthiest women in Virginia. The pair married on January 1, 1772. Thomas and Martha Jefferson had six children together, but only two survived into adulthood: Martha, their firstborn, and Mary, their fourth, who went by the name “Maria.” Only Martha survived her father. His six children with Martha, however, weren’t the only kids Jefferson fathered. History scholars and a significant body of DNA evidence indicate that Jefferson had an affair—and several children—with Sally Hemings, one of his enslaved people and the elder Martha’s half-sister. (Sally’s mother, Betty Hemings, was enslaved by Mather’s father, John Wayles, who also fathered Sally.) Read Her Biography Sally Hemings It’s overwhelmingly likely, if not absolutely certain, that Jefferson fathered all six of Sally Hemings’ children. Even the Thomas Jefferson Foundation, which owns and operates Monticello, has publicly acknowledged this and considers Jefferson’s paternity of Hemings’ children “settled historical matter.” The most compelling proof is DNA evidence, revealed in 1998, showing that some male member of the Jefferson family fathered Hemings’ children, and that it wasn’t Samuel or Peter Carr, the only two of Jefferson’s male relatives in the vicinity at the relevant times. Only four of Jefferson and Hemings’ six children survived. William Beverly Hemings, Harriet Hemings, James Madison Hemings, and Thomas Eston Hemings were born into slavery, though Jefferson freed them. Still shrouded in history is the exact nature of Jefferson’s relationship with Sally, who was thirty years younger than the Founding Father. Declaration of Independence The beginning of Jefferson’s professional life coincided with major changes in Great Britain’s 13 American colonies . The conclusion of the French and Indian War in 1763 left Great Britain in dire financial straits; to raise revenue, the Crown levied a host of new taxes on its colonies in America. In particular, the Stamp Act of 1765, which imposed a tax on printed and paper goods, outraged the colonists, giving rise to the American revolutionary slogan, “No taxation without representation.” Eight years later, on December 16, 1773, colonists protesting a British tea tax dumped 342 chests of tea into the Boston Harbor in what is known as the Boston Tea Party . In April 1775, American militiamen clashed with British soldiers at the Battles of Lexington and Concord , the first conflicts in what developed into the Revolutionary War . Jefferson was one of the earliest and most fervent supporters of the cause of American independence from Great Britain. He was elected to the Virginia House of Burgesses in 1768 and joined its radical bloc, led by Patrick Henry and George Washington . Keep Reading The Founding Fathers: What Were They Really Like? The Best Books About Founding Fathers In 1774, Jefferson penned his first major political work, A Summary View of the Rights of British America , which established his reputation as one of the most eloquent advocates of the American cause. A year later, Jefferson traveled to Philadelphia to attend the Second Continental Congress , which created the Continental Army and appointed Washington as its commander-in-chief. However, the Congress’ most significant work fell to Jefferson himself. Getty Images Declaration Committee members Thomas Jefferson, Roger Sherman, Benjamin Franklin, Robert Livingston, and John Adams at work In June 1776, the Congress appointed a five-man committee—Jefferson, John Adams , Benjamin Franklin , Roger Sherman , and Robert Livingston—to draft a Declaration of Independence . The committee then chose Jefferson to author the declaration’s first draft, selecting him for what Adams called his “happy talent for composition and singular felicity of expression.” Over 17 days, Jefferson drafted one of the most beautiful and powerful testaments to liberty and equality in world history. The document opens with a preamble stating the natural rights of all human beings then continues on to enumerate specific grievances against King George III that absolved the American colonies of any allegiance to the British Crown. Although the version of the Declaration of Independence adopted on July 4, 1776, had undergone a series of revisions from Jefferson’s original draft, its immortal words remain essentially his own: “We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights; that among these are Life, Liberty, and the pursuit of Happiness.” Virginia Governor and House Delegate After authoring the Declaration of Independence, Jefferson returned to Virginia, where, from 1776 to 1779, he served as a member of the Virginia House of Delegates. There he sought to revise Virginia’s laws to fit the American ideals he had outlined in the Declaration of Independence.  Jefferson successfully abolished the doctrine of entail, which dictated that only a property owner’s heirs could inherit his land, and the doctrine of primogeniture, which required that in the absence of a will a property owner’s oldest son inherited his entire estate. On June 1, 1779, the Virginia legislature elected Jefferson as the state’s second governor. His two years as governor proved the low point of Jefferson’s political career. Torn between the Continental Army’s desperate pleas for more men and supplies and Virginians’ strong desire to keep such resources for their own defense, Jefferson waffled and pleased no one. As the Revolutionary War progressed into the South, Jefferson moved the capital from Williamsburg to Richmond, only to be forced to evacuate that city when it, rather than Williamsburg, turned out to be the target of British attack. On June 1, 1781, the day before the end of his second term as governor, Jefferson was forced to flee his home at Monticello, only narrowly escaping capture by the British cavalry. Although he had no choice but to leave, his political enemies later pointed to this inglorious incident as evidence of cowardice. Jefferson declined to seek a third term as governor and stepped down on June 4, 1781. Claiming that he was giving up public life for good, he returned to Monticello, where he intended to live out the rest of his days as a gentleman farmer surrounded by the domestic pleasures of his family, his farm, and his books. But the next year, Jefferson was spurred back into public life by private tragedy: the untimely death of his beloved wife, Martha, on September 6, 1782, about six weeks before her 34 th birthday. National Appointments: Minister to France and Secretary of State After months of mourning, in June 1783, Jefferson returned to Philadelphia to lead the Virginia delegation to the Confederation Congress. In 1785, that body appointed Jefferson to replace Benjamin Franklin as the U.S. minister to France. His official duties as minister consisted primarily of negotiating loans and trade agreements with private citizens and government officials in Paris and Amsterdam. Although Jefferson appreciated much about European culture—its arts, architecture, literature, food, and wines—he found the juxtaposition of the aristocracy’s grandeur and the masses’ poverty repellant. “I find the general fate of humanity here, most deplorable,” he wrote in one letter. In Europe, Jefferson rekindled his friendship with John Adams , who served as minister to Great Britain, and his wife, Abigail Adams . The educated and erudite Abigail, with whom Jefferson maintained a lengthy correspondence on a wide variety of subjects, was perhaps the only woman he ever treated as an intellectual equal. After nearly five years in Paris, Jefferson returned to America at the end of 1789 with a much greater appreciation for his home country. As he wrote to his good friend James Monroe , “My God! How little do my countrymen know what precious blessings they are in possession of, and which no other people on earth enjoy.” America’s First President George Washington’s Biography 10 Great Quotes by George Washington How George Washington Won the Presidency Jefferson arrived in Virginia in November 1789 to find George Washington waiting for him with news that Washington had been elected the first president of the United States of America and that he was appointing Jefferson as his secretary of state. Besides Jefferson, Washington’s most trusted advisor was Treasury Secretary Alexander Hamilton . A dozen years younger than Jefferson, Hamilton was a New Yorker and war hero who, unlike Jefferson and Washington, had risen from humble beginnings. Rancorous partisan battles emerged to divide the new American government during Washington’s presidency. On one side, the Republican Party, led by Jefferson, promoted the supremacy of state governments, a strict constructionist interpretation of the U.S. Constitution , and support for the French Revolution . On the other side, the Federalists , led by Alexander Hamilton , advocated for a strong national government, broad interpretation of the Constitution, and neutrality in European affairs. Washington’s two most trusted advisors thus provided nearly opposite advice on the most pressing issues of the day: the creation of a national bank, the appointment of federal judges, and the official posture toward France. On January 5, 1794, frustrated by the endless conflicts, Jefferson resigned as secretary of state, once again abandoning politics in favor of his family and farm at his beloved Monticello. Vice Presidency Despite Jefferson’s public ambivalence and previous claims that he was through with politics, the Republicans selected Jefferson as their candidate to succeed George Washington as president. In those days, candidates didn’t campaign for office openly, so Jefferson did little more than remain at home on the way to finishing a close second to then–Vice President John Adams in the electoral college vote. By the rules of the time, that made Jefferson the new vice president. He held the post from 1797 to 1801. Besides presiding over the U.S. Senate , the vice president had essentially no substantive role in government. The long friendship between Adams and Jefferson had cooled due to political differences (Adams was a Federalist), and Adams didn’t consult his vice president on any important decisions. To occupy his time during his four years as vice president, Jefferson authored A Manual of Parliamentary Practice , one of the most useful guides to legislative proceedings ever written, and served as the president of the American Philosophical Society. Accomplishments as U.S. President John Adams ’ presidency revealed deep fissures in the Federalist Party between moderates such as Adams and George Washington and more extreme Federalists like Alexander Hamilton . In the presidential election of 1800, the Federalists refused to back Adams, clearing the way for the Republican candidates Jefferson and Aaron Burr to tie for first place, with 73 electoral votes each. After a long and contentious debate, the U.S. House of Representatives selected Jefferson to serve as the third president of America, with Burr as his vice president. The election of Jefferson in 1800 was a landmark of world history: the first peacetime transfer of power from one party to another in a modern republic. Delivering his inaugural address on March 4, 1801, Jefferson spoke to the fundamental commonalities uniting all Americans despite their partisan differences. “Every difference of opinion is not a difference of principle,” he stated. “We have called by different names brethren of the same principle. We are all Republicans, we are all Federalists.” First Term President Jefferson’s accomplishments during his first term in office, from 1801 to 1805, were numerous, remarkably successful, and productive. In keeping with his Republican values, Jefferson stripped the presidency of all the trappings of European royalty, reduced the size of the armed forces and government bureaucracy, and lowered the national debt from $80 million to $57 million in his first two years in office. Nevertheless, Jefferson’s most important achievements as president all involved bold assertions of national government power and surprisingly liberal readings of the Constitution. Louisiana Purchase Jefferson’s most significant accomplishment as president was the Louisiana Purchase. In 1803, he acquired land stretching from the Mississippi River to the Rocky Mountains from cash-strapped Napoleonic France for the bargain price of $15 million, thereby doubling the size of the nation in a single stroke. He then devised the wonderfully informative Lewis and Clark Expedition to explore, map out, and report back on the new American territories. Key Figures of the Lewis and Clark Expedition Meriwether Lewis William Clark Sacagawea Tripoli Pirates Jefferson also put an end to the centuries-old problem of Tripoli pirates from North Africa disrupting American shipping in the Mediterranean. During the Barbary War , Jefferson forced the pirates to capitulate by deploying new American warships. Notably, both the Louisiana Purchase and the undeclared war against the Barbary pirates conflicted with Jefferson’s much-avowed Republican values. Both actions represented unprecedented expansions of national government power, and neither was explicitly sanctioned by the Constitution. Keep Reading 10 Best Presidential Biographies Second Term Although Jefferson easily won re-election in 1804, his second term in office proved much more difficult and less productive than his first. He largely failed in his efforts to impeach the many Federalist judges swept into government by the Judiciary Act of 1801. However, the greatest challenges of Jefferson’s second term were posed by the war between Napoleonic France and Great Britain. Both Britain and France attempted to prevent American commerce with the other power by harassing American shipping. Britain, in particular, sought to impress American sailors into the British Navy. In response, Jefferson passed the Embargo Act of 1807, suspending all trade with Europe. The move wrecked the American economy as exports crashed from $108 million to $22 million by the time he left office in 1809. The embargo also led to the War of 1812 with Great Britain after Jefferson left office. Ideology: Political Party, Views on Slavery, and Legacy Jefferson was the first leader of the Republican Party, which formed in the 1790s and became the Democratic-Republican Party before the end of the decade. Jeffersonian Republicans advocated for a smaller federal government, encouraged states’ rights and individual liberties, and favored a strict interpretation of the U.S. Constitution. Jefferson was the first of three Democratic-Republican presidents, followed by James Madison and James Monroe . The party eventually evolved into the modern-day Democratic Party. Beyond his positions and actions while in public office, Jefferson offered a window into his political philosophy and worldview through his only full-length book, Notes on the State of Virginia . He began writing the book in late 1781 after stepping down as the governor of Virginia and ostensibly sought to outline the history, culture, and geography of his home state. However, Notes on the State of Virginia also contained Jefferson’s vision of the good society he hoped America would become: a virtuous agricultural republic based on the values of liberty, honesty, and simplicity and centered on the self-sufficient yeoman farmer. Views on Slavery Jefferson’s writings shed light on his contradictory, controversial, and much-debated views on race and slavery . Jefferson was a slave owner his entire life, and his very existence as a gentleman farmer depended on the institution of slavery. Like most white Americans of that time, Jefferson held views we would now describe as nakedly racist: He believed that Black people were innately inferior to white people in terms of both mental and physical capacity. Nevertheless, he claimed to abhor slavery as a violation of the natural rights of man. He saw the eventual solution of America’s race problem as the abolition of slavery followed by the exile of formerly enslaved people to either Africa or Haiti, because, he believed, the formerly enslaved couldn’t live peacefully alongside their former masters. As Jefferson wrote, “We have the wolf by the ears, and we can neither hold him nor safely let him go. Justice is in one scale, and self-preservation in the other.” An Appeal Against Slavery From a Leading Black Thinker Benjamin Banneker’s Letter to Thomas Jefferson Democratic Legacy Jefferson will be forever revered as one of the great American Founding Fathers . As the primary author of the Declaration of Independence, Jefferson wrote the foundational text of American democracy and one of the most important documents in world history. He also wrote about other key democratic ideals, including: The separation of church and state: In 1777, Jefferson wrote the Virginia Statute for Religious Freedom, which established freedom of religion and the separation of church and state. Although the document wasn’t adopted as Virginia state law for another nine years, it was one of Jefferson’s proudest life accomplishments. Legislative procedures: Jefferson’s A Manual of Parliamentary Practice (1801) established more granular rules for America’s legislative bodies than had been previously outlined. He was inspired to study the subject while serving as vice president, which involved overseeing the U.S. Senate. His rules are still active influences in the Senate and the U.S. House of Representatives. Ultimately, Jefferson was a man of many contradictions. He was the spokesman of liberty and a racist slave owner, a champion of the common people and a man with luxurious and aristocratic tastes, a believer in limited government and a president who expanded governmental authority beyond the wildest visions of his predecessors, a quiet man who abhorred politics and arguably the most dominant political figure of his generation. The tensions between Jefferson’s principles and practices make him all the more apt a symbol for the nation he helped create, a nation whose shining ideals have always been complicated by a complex history. Later Years: Founding the University of Virginia On March 4, 1809, after watching the inauguration of his close friend   and successor James Madison , Jefferson returned to Virginia to live  out  the rest of his days as “The Sage of Monticello.” His primary  pastime was endlessly rebuilding, remodeling, and improving his home and estate, at considerable expense. A Frenchman named Marquis de Chastellux quipped, “it may  be said that Mr. Jefferson is the first American who has  consulted the  Fine Arts to know how he should shelter himself from the  weather.” Jefferson also dedicated his later years to organizing the University   of Virginia, the nation’s first secular university. He personally   designed the campus, envisioned as an “academical village” in Charlottesville, and   hand-selected renowned European scholars to serve as its professors. The   University of Virginia opened its doors on March 7, 1825, one of the   proudest days of Jefferson’s life. At the end of his life, the former president kept up an outpouring of correspondence. In particular, he rekindled a lively correspondence on   politics, philosophy, and literature with John Adams that stands out   among the most extraordinary exchanges of letters in history. Nevertheless, Jefferson’s retirement was marred by financial woes. To   pay off the substantial debts he incurred over decades of living beyond   his means, Jefferson resorted to selling his cherished personal library   to the national government to serve as the foundation of the Library  of  Congress. When Did Thomas Jefferson Die? Jefferson died on July 4, 1826—the 50 th anniversary of  the Declaration of Independence—at his Monticello estate near Charlottesville, Virginia. His death occurred only a few hours before fellow Founding Father John Adams passed away in Massachusetts. In the moments before he passed, Adams spoke his last words, eternally true though not in the literal sense he meant them: “Thomas Jefferson survives.” Jefferson is buried in the family cemetery at his beloved Monticello, in a grave marked by a plain gray tombstone. The brief inscription it bears, written by Jefferson, himself, is as noteworthy for what it excludes as what it includes. It suggests his humility as well as his belief that his greatest gifts to posterity came in the realm of ideas rather than the realm of politics: “Here was buried Thomas Jefferson, author of the Declaration of American Independence of the Virginia Statute for Religious Freedom, and father of the University Of Virginia.” The former president’s likeness appears on the U.S. nickel and on Mount Rushmore. The Thomas Jefferson Memorial in Washington, D.C., was dedicated in 1943 and took architectural influence from Jefferson’s designs at Monticello and the University of Virginia. Dive Deeper Which Historical Figures Are on U.S. Money? Quotes We have the wolf by the ears, and we can neither hold him nor safely let him go. Justice is in one scale, and self-preservation in the other. All tyranny needs to gain a foothold is for people of good conscience to remain silent. How little do my countrymen know what precious blessings they are in possession of, and which no other people on earth enjoy. Every difference of opinion is not a difference of principle. We have called by different names brethren of the same principle. We are all Republicans, we are all Federalists. The natural progress of things is for liberty to yield and government to gain ground. I hold it that a little rebellion now and then is a good thing, and as necessary in the political world as storms in the physical. I find friendship to be like wine, raw when new, ripened with age, the true old man’s milk and restorative cordial. I cannot live without books; but fewer will suffice where amusement, and not use, is the only future object. The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants. All, too, will bear in mind this sacred principle, that though the will of the majority is in all cases to prevail, that will to be rightful must be reasonable; that the minority possess their equal rights, which equal law must protect, and to violate would be oppression. I like the dreams of the future better than the history of the past. [A] wise and frugal government, which shall restrain men from injuring one another, shall leave them otherwise free to regulate their own pursuits of industry and improvement, and shall not take from the mouth of labor the bread it has earned. I know well that no man will ever bring out of that office the reputation which carries him into it. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below U.S. Presidents Jimmy Carter Elvis Asked Richard Nixon to Be a Federal Agent George Washington Was Almost Kidnapped in the Army Hunter Biden and Other Presidential Problem Kids Advertisement - Continue Reading Below Donald Trump 4 U.S. Presidents Who Won the Nobel Peace Prize Which Historical Figures Are on U.S. Money? Joe Biden President Donald Trump’s Family Tree Who Killed JFK? You Won’t Believe Us Anyway 12 Notable Grand Ole Opry Performers Can You Name U.S. Presidents When They Were Young? Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/history-of-jefferson-park-chicago",
      "text": "Our History — Jefferson Park Chamber of Commerce Skip to Content Open Menu Close Menu Membership Become a Member Who Can Join? New Membership Application Our Partners Our Partners Partnership Opportunities Resources Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory News & Events JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Explore Jeff Park Explore Jeff Park Our History Jeff Park Today About Us Officers & Directors Privacy Policy Contact Us Home 0 0 Join the Chamber Membership Become a Member Who Can Join? New Membership Application Our Partners Our Partners Partnership Opportunities Resources Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory News & Events JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Explore Jeff Park Explore Jeff Park Our History Jeff Park Today About Us Officers & Directors Privacy Policy Contact Us Home 0 0 Join the Chamber Open Menu Close Menu Folder: Membership Back Become a Member Who Can Join? New Membership Application Folder: Our Partners Back Our Partners Partnership Opportunities Folder: Resources Back Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory Folder: News & Events Back JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Folder: Explore Jeff Park Back Explore Jeff Park Our History Jeff Park Today Folder: About Us Back Officers & Directors Privacy Policy Contact Us Home Join the Chamber Our History The First Inhabitants of Chicago Before any Europeans settled in the Chicago region, it was a vast swampland on the shores of Lake Michigan.  Primarily Potawatomi Indians inhabited it. The name Chicago originates from \"Checagou\" (Chick-Ah-Goo-Ah), which in the Potawatomi language means 'wild onions' or 'skunk'. The area was so named because of the smell of marshland wild leeks or wild garlic that used to cover it. 1700s The first non-native settler in Chicago was Jean-Baptiste Pointe du Sable, of French and African descent, who settled at the mouth of the Chicago River in the 1770s and married a local Potawatomi woman. In 1795, following the Northwest Indian War, the area of Chicago was ceded by the Native Americans in the Treaty of Greenville to the United States for a military post. 1800s In 1803, Fort Dearborn was built. The Ottawa, Ojibwa, and Potawatomi ceded the land to the United States in the 1816 Treaty of St. Louis. A group of merchants, trappers, and traders incorporated the City of Chicago in 1833 and chartered it in 1837. At that time, Chicago was a much smaller parcel in the area directly around the Loop. In these early years, John Kinzie Clark built a cabin on the Chicago River near what historians believe is now Addison Street and became Jefferson Township’s earliest resident.   He arrived with only a few personal items and a team of horses most likely by way of an Indian trail that would become Clybourn Avenue. In 1830, Elijah Wentworth Sr. was the proprietor of a tavern located on the west side of the Chicago River a little north of Wolf Point near present-day Kinzie Street. Less than a quarter of a mile away was an Indian trail that led Northwest.  This trail eventually became Milwaukee Avenue. Elijah traveled this trail eight miles northwest of Chicago, to a place called Sand Ridge, just south of the Northern Indian Boundary Line, to build his new tavern. This was a perfect spot for an inn, located near the junction of three well-traveled Indian Trails (Milwaukee, Higgins, and Northwest Highway).  This large 2-story log tavern, “The Wentworth Tavern” later called “The Jefferson Hotel,” was located on the land now occupied by the Jefferson Park Bus Terminal.  Elijah Wentworth became the first resident and business owner in what is now the Jefferson Park neighborhood. Except for a short stay at Fort Dearborn during the Black Hawk War, Elijah Wentworth continued to operate his inn until he sold the property, tavern, and farm, to David L. Roberts in the early 1850’s.  Before he left, others came to join him in the business district. Abram Gale (for whom Gale Street is named) came to Jefferson Township soon after this and built the first frame house in the Township.  It was 18 x 34 feet and reportedly cost the sum of $75.00. This house was located in the Galewood neighborhood (also named for him) south of Grand Avenue. The Founding of Jefferson Township It should be noted that Jefferson Township and Jefferson Park can’t be interchangeable.  In the beginning, the township was a large tract of land that was north of North Avenue to Devon Avenue and west of Western Avenue to Harlem Avenue (Norwood Park township broke away from Jefferson Township taking a small chunk of land at its northwest side). The Township was a form of government the residents picked with “villages” like Irving, Dunning, and Cragin within Jefferson Township. The Town of Jefferson or Jefferson Park is mostly centered around Milwaukee and Higgins Avenues. Early settlers first wanted the township to be named for President James Monroe. However, they soon learned that another community in Illinois was known as Monroe, so they decided to honor President Thomas Jefferson instead. The State formed Jefferson Township in 1850 and by 1855, the village had 50 buildings. The Town of Jefferson was officially incorporated in 1872. During the 1860s, the population of the Town of Jefferson grew to about 800 persons and nearly all the trades and professions were represented. The area had two taverns, two dry goods stores, a drug store, markets, and other businesses.  The first township high school was established in 1870 in the Town Hall at Irving Park and Milwaukee.  Eventually, a more permanent 3-story structure was erected in 1883 and called “Jefferson High School.”  (The Irish Heritage Center on Wilson and Knox stands at this site today). The Gateway to Chicago Around this time, Jefferson Park started to become known as the “Gateway to Chicago” or the “Garden Gateway” because of the truck farms throughout the area. Farmers would truck their produce to Jefferson Park to sell to the residents.  They would also truck products to Chicago by way of Milwaukee Ave. The trucks would come in on Higgins or Northwest Highway, both dead-ending in Jefferson Park. This ideal location made for a successful business district with a large community to support this commerce. The site where Higgins and Long Avenues meet today was initially a house owned by the Henry Esdohr family.  During those early years, most Jefferson Park area residents obtained their water at an artesian well located on the property. This well was 2,200 feet deep with a flow rate of 200 gallons per minute. The well was in operation until 1895. There were also other pumps located along Milwaukee Avenue but not with the same quality of water from the Esdohr house. This gave tremendous impetus to population growth in the area and helped to attract immigrants from Poland, Germany, and other European countries through the next several decades. In addition to the Esdohr family’s importance to the neighborhood through providing fresh water, they played prominent roles in the community in numerous other ways.  Henry served as the Knight Templar for the Masons (and his brother Herman was the Master of the Lodge.)  Henry was appointed as the community’s first postmaster and the treasurer of the school board (for one of the state’s earliest public high schools).  In 1881, he was elected as City Clerk of the Town of Jefferson. The Annexation of Jefferson Park During the late 19th century, Chicago was growing rapidly.  Not only was the population growing, but the geography was growing through the annexation of suburban communities at its boundaries. Some residents of Jefferson Township petitioned for annexation in 1886. Three years later, Jefferson Park was annexed to Chicago along with Lake View, Lake, and Hyde Park Townships. Interestingly, only 24 votes in total were cast for annexation. They were write-in votes and not on the printed ballot. The 24 votes were unanimous. This 1889 initiative proved to be the city’s largest single annexation with the addition of 125 square miles of property and 225,000 additional people.  This made Chicago the nation’s largest city by area and second in population at the time. By the year of annexation, Jefferson had become active and prosperous. The Jefferson settlement was linked to the City of Chicago by the Milwaukee and Elston Plank Roads, both of which had been in operation since the 1850’s. These roads had initially been Native American Trails, and they were later called the “Upper Plank” (Milwaukee) and “Lower Plank” (Elston) roads.  Elston got its name from Dan Elston, a former alderman and bricklayer who graded, maintained, and principally used the road. Both Milwaukee and Elston became toll roads with Jefferson Park having a tollgate at Milwaukee and Leland Avenues.  Milwaukee Avenue being a diagonal street, cut across many plots of land and some of the owners put up tollgates, one of the principal owners was Amos J. Snell.  Mr. Snell was a large landowner and made considerable money selling wood to the railroads for their steam-powered locomotives and collecting tolls. On February 8, 1888, the 64-year-old millionaire, Amos Snell was found shot to death in his mansion on Washington and Ada Streets. At the time, his unsolved murder did not affect the collection of the tolls. Early morning on April 30, 1890, a group of 200 angry tollpayers dressed up as Indians and burned the tollgate and gatehouse at Fullerton Avenue to the ground.  In the next few days, other gates were torn down. On May 14, 1890, the Illinois Supreme Court declared that the gates were illegal and that Amos Snell’s heirs could not rebuild the toll gates and collect tolls within Chicago City limits. 1900s At the time of annexation, the Northwest Railroad was the only reliable way to get in and out of the neighborhood.  The plank roads were often rutted and muddy and difficult to navigate.  As Jefferson Park was now part of Chicago, new methods of transportation and ease of travel were soon to arrive.  Streetcar tracks were laid on Lawrence Avenue in 1909, and in 1911 the tracks on Elston were extended to Lawrence Avenue.  In 1927, the railroad tracks were all elevated eliminating dangerous grade crossings and opening up important thoroughfares such as Montrose. The transportation opportunities and new city services helped attract new residents to the area.  During this period, many first and second-generation immigrants from Poland, Germany, Russia, Czechoslovakia, Italy, and Sweden settled here.  As neighborhoods of frame cottages and brick bungalows emerged in the 1910s and 1920s, many of the new residents desired a park.  Residents of the Jefferson Park neighborhood filed a petition in the County Court on May 24, 1920, requesting the creation of a park district to serve their area.  The community election was held on June 22, 1920, and the majority voted for a park district for Jefferson Park.   The park (Jefferson Park) first opened to the public in 1921 and took its moniker from the surrounding community.  When it opened, there was an earlier Jefferson Park located on the west side of Chicago. Because of this, the site was long known as Jefferson Park #2. (The original Jefferson Park is now Skinner Park.) In 1999, the Chicago Park District changed the Park’s name to Jefferson Memorial Park (Thomas Jefferson Memorial Park). Development of Jefferson Park slowed in the mid-1950s when residents of Chicago began to migrate to the suburbs.  This was due to evolving tastes and new ease of commuting from the suburbs to the city due to the construction of major interstate highways directly to the Loop.  The Kennedy Expressway was one of these new highways. When it was built, it cut the neighborhood in half.  At that time, it was a devastating blow to the area as hundreds of people lost their homes and businesses.  Today, most residents have become accustomed to the Kennedy and it offers quick transportation to downtown and the Northwest suburbs. In 1970, the Chicago Transit Authority opened the Jefferson Park Transit Station, which now serves approximately 10,000 commuters rail passengers per day and operates at the starting or ending point for over 800 buses per day. The CTA station, along with the Kennedy Expressway and the METRA Railroad, now provides the community with a varied transportation network. Today Jefferson Park has grown to a population of almost 44,000 residents within a one-mile radius of the Milwaukee/Lawrence intersection. Today, this community is the home of one of the largest first and second-generation Polish communities in Chicago.  More than 25% of the neighborhood has first or second-generation ties to Poland.  In 1979, the Copernicus Foundation established Chicago’s very own Polish Cultural Center in the heart of Jefferson Park.  The Foundation broke ground on what was once the Gateway Theater on Lawrence Avenue, which had originally been designed to show the first “talkies” in Chicago.  The building and all of its programs are referred to as “The Copernicus Center,” and the theater seats 2000. In 1985, the \"Solidarity Tower,\" with its matching facade, was erected atop the building. The exterior of the building was modified to resemble the historic Royal Castle in Warsaw, Poland. The tower is a replica of the clock tower adorning the castle - it can be seen from the Kennedy Expressway. Jefferson Park Chamber of Commerce 5214 W Lawrence Avenue Suite 5 Chicago, IL 60630 Phone: 773-736-6697 Fax: 773-736-5008 Email: info@jeffersonparkchamber.com Membership Become a Member Who Can Join? Officers  & Directors News & Events Events Submit Your Event News Our Neighborhood Resources Explore Jeff Park Business Directory News You Can Use Never miss out on interesting news, business resources, and local events happening in the Jeff Park community! A monthly digital newsletter sent straight to your inbox. Email Address Sign Up We never share your data. Thank you for subscribing!"
    },
    {
      "url": "https://www.seattle.gov/parks/allparks/jefferson-park",
      "text": "Jefferson Park - Parks | seattle.gov Close Main Menu Parks Apply for financial aid Sign up for activities All Activities, Passes, & Permits Aquatics (Lap lanes & Lessons) Athletic Leagues Camps Childcare Fitness, Health, & Wellness Preschool Scholarships and Financial Aid for Recreation About Us Contact Seattle Parks & Recreation Graffiti Prevention & Removal Prevent Graffiti Report Graffiti Remove Graffiti Contracts & Partnerships Current Partnership Opportunities Seattle Mentors RFQ Red Barn Ranch Request For Proposal Seasonal Food Truck, Activities, and Fitness Concessions Request For Proposal (RFP): Outdoor Preschools Our Contracting Process Successful Partnerships Donate Supplies for Sale Job Opportunity Highlights Summer Employment Opportunities Aquatics Employment & Training Current Neighborhood Projects How Our Projects Are Funded Ongoing Racquet Sports Park CommUNITY Fund 1125 Harvard Avenue East Charlestown Park (48th and Charlestown Landbanked Site Park Development) A. B. Ernst Park Addition Ballard Playground Athletic Field Improvements Be'er Sheva Park Improvements B. F. Day Playground Play Area Renovation Bicycle Weekends Bitter Lake Playfield Public Restroom and Play Area Renovation Bitter Lake Reservoir Park Bryant Neighborhood Playground Renovation Burke-Gilman Trail Repairs Carkeek Park Pedestrian Bridge Replacement Carkeek Park Playground Renovation Cayton Corner Park Cheasty Mountain Bike/Pedestrian Trail Pilot Project City Hall Park and Vicinity Community Centers Decarbonization and Electrification (Decarbonization Package One) Dahl Playfield Restroom Renovation Denny Blaine Park long-term Plan Discovery Park South Beach Trail Dr. Jose Rizal Park Renovation Don Armeni Boat Ramp Improvement Duwamish Waterway Park Activation Duwamish Waterway Park Expansion Fairmount Playground Softball Infield Conversion Firehouse Mini Park Play Area Renovation Freeway Park Improvements Garfield Super Block - Play Area, Promenade & Restroom Renovation Gas Works Park Renovations – Playground, Restroom and East Entry Genesee Playfield - Play Area Renovation and Public Restroom Replacement Artificial Turf Replacement - Genesee Playfields 1&2 Georgetown Flume Off-Leash Area Development Green Lake Community Center, Play Area, and Evans Pool Redevelopment Green Lake Park Inner Loop Green Lake Integrated Aquatic Vegetation Management Plan Development Green Lake Small Craft Center Redevelopment Herring's House Park (Tualtwx) – Shoreline Restoration Hiawatha Community Center Stabilization Hiawatha Play Area Relocation and Renovation Hing Hay Park Restroom Renovation Hubbard Homestead Play Area Hutchinson Playground Renovation I-5 Colonnade Pump Track International District/Chinatown Community Center Alcove Safety Renovation Stan Sayres Boat Ramp Replacement Japanese Garden Wall and Pavilion Replacement Bill Wright Golf Complex at Jefferson Park - Holes #11 & 12 Poles and Netting Renovation Judkins Park Renovations Project Kubota Garden Improvements Lake City Community Center Redevelopment Lake City Floodplain Park Development Lake Washington Boulevard Renovations Langston Hughes Performing Arts Institute Restoration Leschi South Marina Wave Attenuator and Facility Improvements Lincoln Park South Play Area Renovation Little Brook Park Redevelopment Longfellow Creek Bridge Replacement Lower Woodland Playfield #1 Lower Woodland Softball Field 4 Infield Conversion Loyal Heights Community Center Renovation Madrona Park Beach Play Area Renovation Project Madrona Playground Play Area Renovation Magnolia Community Center Stabilization Magnolia Playfield Lighting Magnolia Neighborhood Skate Park Conceptual Design Study Magnuson Park Play Area Renovation Maple Wood Playfield, Public Restroom and Play Area Renovation Project Marra-Desimone Park Mayfair Park Retaining Wall and Stair Replacement Meridian Playground Play Area Improvements Mickey Merriam Field 8 At Magnuson Synthetic Turf Replacement Miller Playfield Play Area Renovation Memorial Garden Developmentat Martin Luther King, Jr. Memorial Park Morgan Junction Park Addition Mount Baker Park Beach Bathhouse Renovation Mount Baker Park Public Restroom North Rainier Landbanked Site Park Development - Cheryl Chow Park Northwest Native Canoe Center Olmsted Parks and Boulevards Restoration Project Othello Playground Off-Leash Area Development Outdoor Pickleball Court Development Queen Anne Community Center Renovation Rainier Beach Playfield Skatepark Rainier Community Center Play Area Playground Renovation Red Barn Ranch Improvements Smith Cove Park Development Soundview Playfield Athletic Field Renovation South Lake Union Community Center South Park Community Center Stabilization and Site Redevelopment South Park Plaza Landbanked Site Park Development Southwest Teen Life Center Play Area Renovation T. T. Minor Playground Play Area Renovation Terry Pettus Park Renovation Victor Steinbrueck Park View Ridge Playfield Playground Renovation Ward Springs Play Area Renovation Washington Park Arboretum Creek Headwaters Project Washington Park Arboretum Waterfront Trail Washington Park Arboretum Woodland Meadow Wedgwood Landbanked Site Park Development West Queen Anne Playfield Athletic Field Renovation Westcrest Park Restroom Renovation & Play Area Restoration West Seattle Golf Clubhouse Restroom Renovation West Seattle Junction Park Development West Seattle Stadium Off-Leash Area Development Rules & Regulations ADA: Serving Patrons with Disabilities Boundaries and Encroachments Public Disclosure Requests Special Use of Seattle Parks Property: Permits Park Rangers Plans, Policies & Reports Find a Restroom in a Park Parks Legacy Plan Planning and Policy Library Environment Plans & Reports Tree Health and Management Horticulture Integrated Pest Management Irrigation and Water Usage Pollinator Habitat Climate Resiliency Strategy Environmental Stewardship Report Thriving Environment Initiative Vegetation Management Plans Recreation Plans & Reports Off Leash Area Expansion Study Community Center Strategic Plan People, Dogs and Parks Strategic Plan Strategic Planning Seattle Conservation Corps Urban Food Systems Program Park History Task Forces & Advisory Teams Athletic Facilities Task Force Olmsted Legacy Task Force Trails Task Force Viewpoint Advisory Team All Parks Index Pages Parks A to D Parks E to H Parks I to L Parks M to P Parks Q to T Parks U to Z Parks A-D 12th Ave Square Park 12th West & West Howe Park 14th Avenue NW Boat Ramp 3001 E Madison Park 32nd Ave W Boat Launch 6th Avenue NW Pocket Park A. B. Ernst Park Adams Street Boat Ramp Albert Davis Park Alice Ball Park Alki Beach Park Alki Playground Alvin Larkins Park Amy Yee Tennis Center Park Andover Place Arroyo Heights Atlantic City Boat Ramp Atlantic Street Park B.F. Day Playground Bagley Viewpoint Baker Park on Crown Hill Ballard Commons Park Ballard Corners Park Ballard Playground Bar-S Playground Bayview Playground Bayview-Kinnear (Lower Kerry Park) Beacon Hill Playfield Beacon Place Be'er Sheva Park Bell Street Park Bellevue Place Belltown Cottage Park Belmont Place Belvedere Park Belvoir Place Benefit Playground Benvenuto Viewpoint Bergen Place Bhy Kracke Park Bitter Lake Playfield Bitter Lake Reservoir Open Space Blaine Place Blanche Lavizzo Park (Dr.) Blue Dog Pond Blue Ridge Circle Blue Ridge Places Boren Park Boren Place Boylston Place Bradner Gardens Park Brighton Playfield Broadway Hill Park Bryant Neighborhood Playground Burke-Gilman Trail Cal Anderson Park California Place Camp Long Camp Long Environmental Learning Center & Activities 4H Challenge Course at Camp Long Schurman Rock at Camp Long Camp Long Nature and Adventure Camps Carkeek Park Carleton Center Carleton Highlands Cascade Place Cascade Playground Cayton Corner Park Cedar Park Cesar Chavez Park Charles Richey Sr Viewpoint Cheasty Boulevard Cheasty Natural Area Cheryl Chow Park Cheshiahud Lake Union Loop Chinook Beach Park Christie Park City Hall Park Cleveland Playfield Coe Play Park College Street Park College Street Ravine Colman Park Colman Playground Columbia Park Commodore Park Corliss Place Cormorant Cove Cottage Grove Park Counterbalance Park Cowen Park Crescent Place Crown Hill Glen Crown Hill Park Daejeon Park Dahl (Waldo J.) Playfield Dakota Place Park David Rodgers Park Day Street Boat Ramp Dearborn Park Delridge and Myrtle Park Delridge Playfield Denny Park Denny Blaine Lake Park Denny Blaine Park Discovery Park Discovery Park Advisory Council Discovery Park History Salmon Bay Walking Tour Discovery Park Summer Camps Parking and Beach Shuttles Don Armeni Boat Ramp Donnie Chin International Childrens Park Duwamish Waterway Park Parks E-H E.C. Hughes Playground East Duwamish Greenbelt East Montlake Park (CLOSED) East Portal Viewpoint East Queen Anne Playground Eastmont Place Eddie Vine Boat Ramp Ella Bailey Park Emma Schmitz Memorial Overlook Endolyne Park Ercolini Park Fairmount Playground Fairview Park Fairview Walkway Fauntleroy Creek Ravine Fauntleroy Park Fauntleroy Place Ferdinand Street Boat Launch Firehouse Mini Park First Hill Park Fletcher Place Flo Ware Park Freeway Park Fremont Canal Park Fremont Peak Park Frink Park Fritz Hedges Waterway Park Froula Playground Garfield Playfield Gas Works Park Gemenskap Park Genesee Park and Playfield Georgetown Playfield Georgetown Pump Station Gerber Park Gilman Playground Golden Gardens Park Grand Army of the Republic Cemetery Green Lake Park Greenwood Park Greenwood Triangle Greg Davis Park Haller Lake Street End Hamilton Viewpoint Park Harrison Ridge Greenbelt Harvard-Miller/Roanoke Annex Herring's House Park (Tualtwx) Hiawatha Playfield Highland Drive Parkway Highland Park Playground Highland Place Hing Hay Park Hitt's Hill Park Hoa Mai Park Homer Harris Park Horiuchi Park Horton Hill Corridor Howell Park Hubbard Homestead Hunter Boulevard Hutchinson Playground Hyde Place Parks I-L I-5 Colonnade Interbay Athletic Complex Interlaken Park Inverness Ravine Park Japanese Garden Jefferson Park Jimi Hendrix Park John C. Little, Sr. Park Jose Rizal Park (Dr.) Judge Charles M. Stokes Overlook Judkins Park and Playfield Julia Lee’s Park Junction Plaza Katie Black's Garden Kerry Park (Franklin Place) Keystone Place Kilbourne Park Kinnear Park Kinnear Place Kirke Park Kiwanis Memorial Preserve Park Kobe Terrace Kubota Garden Lake City Beach Park Lake City Memorial Triangle Lake City Mini Park Lake City Park Lake People Park (Xacua'bs) Lake Union Park Lake Washington Boulevard Lakeridge Park Lakeridge Playfield Lakeview Park Lakeview Place Lakewood Playground Lakewood Triangle Lambert Place Landing Parkway Lawton Park Laurelhurst Playfield Leschi-Lake Dell Natural Area Leschi Park Licton Springs Park Lewis Park Lincoln Park Linden Orchard Park Little Brook Park Llandover Woods Greenspace Lowman Beach Park Longfellow Creek Natural Area Loyal Heights Playfield Lynn Street Mini Park Parks M-P MacLean Park Madison Park Madison Park North Beach Madrona Briar Patch Madrona Park Madrona Playground Madrona Ravine Magnolia Greenbelt Magnolia Manor Park Magnolia Park Magnolia Playfield Magnolia Tidelands Park Magnuson Park Magnuson Park Boat Launch Artist Studios at Magnuson Park Magnuson Park Calendar Camps Magnuson Park History Magnuson Park Advisory Committee Magnuson Park Reports Magnuson Park Reservations Off-Leash Area Partner Organizations Park Features Seattle Conservation Corps Magnuson Park Swimming Beach Wetlands and Habitat Maple Leaf Reservoir Park Maple School Ravine Maple Wood Playfield Marra-Desimone Park Marshall Park Martha Washington Park Martin Luther King Jr. Civil Rights Memorial Park Marvin's Garden Matthews Beach Park Mayfair Park McGilvra Boulevard McGilvra Place McGraw Square Meadowbrook Playfield Me-Kwa-Mooks Natural Area Me-Kwa-Mooks Park Meridian Playground Miller Playfield Miller Triangle Magnolia Boulevard Mineral Springs Park Mock Creek Ravine Montlake Boulevard Montlake Playfield Morgan Junction Mount Baker Boulevard Mount Baker Park Mount Claire Park Mt Baker Ridge Viewpoint Myrtle Edwards Park Myrtle Reservoir Nantes Park Nathan Hale Playfield NE 60th Street Park Nora's Woods North Beach Ravine Northacres Park Northeast Queen Anne Greenbelt Northgate Park Northlake Park Northwest 60th Viewpoint Observatory Courts Occidental Square Olympic Sculpture Park Open Water Park Orchard Street Ravine Othello Playground Oxbow Park Park Home Circle Parkmont Place Parsons Gardens Pathways Park (Burke-Gilman Playground Park) Peace Park Pelly Place Natural Area Peppi's Playground Pier 58 Pier 62 Pigeon Point Park Pinehurst Playground Pinehurst Pocket Park Pioneer Square Pipers Creek Natural Area Plum Tree Park Plymouth Pillars Park Powell Barnett Park Pratt Park Prefontaine Place Prentis I. Frazier Park Pritchard Island Beach Puget Boulevard Commons Puget Creek Greenspace Puget Park Puget Ridge Playground Parks Q-T Queen Anne Boulevard Queen Anne Bowl Playfield Rainbow Point Rainier Beach Playfield Rainier Beach Urban Farm and Wetlands Rainier Place Rainier Playfield Ravenna Boulevard Ravenna Park Ravenna Ravine Ravenna Woods Ravenna-Eckstein Park Regrade Park Riverview Playfield Roanoke Park Roanoke Street Mini Park Rogers Playground Ross Playground Rotary Viewpoint Roxhill Park Sacajawea Playground Salmon Bay Park Sam Smith Park Sandel Playground Schmitz Boulevard Schmitz Preserve Park Seacrest Park Seola Park Seven Hills Park Seward Park Sierra Place Smith Cove Park Solstice Park Soundview Playfield Soundview Terrace South Park Meadow South Park Playground South Park Plaza Spring Street Mini Park Spruce Street Mini Park St. Marks Greenbelt Stan Sayres Memorial Park Stevens Place Stevens Triangle Sturgus Park Sturtevant Ravine Summit Place Summit Slope Park SUN Park Sunnyside Ave N Boat Ramp Sunset Hill Park Sunset Place SW Queen Anne Greenbelt T. T. Minor Playground Tashkent Park Taylor Creek Headwaters Terry Pettus Park Thayer Place Thomas C. Wales Park Thomas Street Mini Park Thorndyke Park Thornton Creek Natural Area Thyme Patch Park Tilikum Place Troll’s Knoll Park Trolley Hill Park Trudy's Triangle Twelfth Avenue South Viewpoint Parks U-Z Urban Triangle Park Union Bay Boglands Union Station Square University Circle University Heights Plaza University Lake Shore Place University Playground Ursula Judkins Viewpoint Van Asselt Playground Victor Steinbrueck Park Victory Creek Park Victory Heights Playground View Ridge Playfield Viretta Park Virgil Flaim Park Volunteer Park Volunteer Parkway Wallingford Playfield Wallingford Steps Walt Hundley Playfield Ward Springs Park Washington Park Playfield Washington Street Boat Landing Waterfront Park Watton Site Weather Watch Park Webster Park Wedgwood Park Wedgwood Square West Duwamish Greenbelt West Ewing Mini Park West Montlake Park West Queen Anne Playfield West Seattle Stadium Westcrest Park Westlake Greenbelt Westlake Park Westlake Square William Grose Park Williams Place Wolf Creek Ravine Natural Area Woodland Park Woodland Park Rose Garden Yesler Terrace Park York Park York Playground All Community Centers Central Community Centers Northeast Community Centers Northwest Community Centers Southeast Community Centers Southwest Community Centers Community Centers Central Centers Garfield Community Center International District/Chinatown Community Center Miller Community Center Montlake Community Center Yesler Community Center Northeast Centers Lake City Community Center Laurelhurst Community Center Magnuson Community Center Meadowbrook Community Center Northgate Community Center Ravenna-Eckstein Community Center Northwest Centers Ballard Community Center Bitter Lake Community Center Green Lake Community Center Loyal Heights Community Center Magnolia Community Center Queen Anne Community Center Southeast Centers Jefferson Community Center Rainier Community Center Rainier Beach Community Center Van Asselt Community Center Southwest Centers Alki Community Center Delridge Community Center Hiawatha Community Center High Point Community Center South Park Community Center Pools Pool Fees & Program Descriptions Ballard Pool Colman Pool (West Seattle) Evans Pool (Green Lake) Helene Madison Pool (Haller Lake) Meadowbrook Pool (Lake City) Medgar Evers Pool (Central District) Mounger Pool (Magnolia) Queen Anne Pool Rainier Beach Pool Southwest Pool Swim Seattle Recreation Dog Off-Leash Areas & Map Events & Attractions Museums & Attractions Events, Public Meeting & Volunteer Calendar Park Activation Events Outdoor Activation and Mobile Recreation Big Day of Play Career Explorations Community Grant Programs Get Moving Fund Hope for Youth Fund Recreation For All Fund Community Engagement Ambassadors Fitness & Wellness Food & Nutrition Rec 'N The Streets Summer Playgrounds & Summer Meals Outdoor Water Recreation Boating & Sailing Andrews Bay Anchorage Mt. Baker Rowing and Sailing Center Green Lake Small Craft Center Sprayparks & Wading Pools Swimming Beaches Lifelong Recreation for Adults 50+ Outdoor Recreation 50+ Dementia Friendly Recreation Recreation for LGBTQ+ Specialized Programs for People with Disabilities Hiking & Trails Sports Pickleball Adult Sports Teams & Programs Youth Sports Citywide Tennis, and Amy Yee Tennis Center Tennis Court Rentals Tennis Lessons, Programs and Tournaments Youth Tennis Programs Golf Virtual Recreation Learning & Childcare Camps Childcare & Preschool Community Learning Centers Discovery Park Nature Kids Preschool Environmental Education & Outdoor Learning Environmental Learning Centers Calendar Teen & Youth Development Seattle Mentors Youth Green Corps Job Readiness Opportunities for Teens Indoor Tot Gyms & Tot Rooms Rentals and Permits Hidden Boat Launch Permits Operate a Class in a Park Community Center Rentals Day Camp Permits Event Planning Tools Park Maps for Event Planning Refunds, Reductions, & Waivers Rental Tips, Rules, and Regulations Rent an Indoor Space for Your Event Alki Beach Bathhouse Camp Long Event Space and Cabin Rentals Dakota Place Park Building Discovery Park Environmental Learning Center Rental Golden Gardens Bathhouse Japanese Garden Tateuchi Community Meeting Room Madrona Playfield Shelterhouse Mount Baker Rowing and Sailing Center Officers Club--Magnuson Park Pinehurst Shelterhouse Pritchard Beach Bathhouse Ross Playfield Shelterhouse Ward Springs Pump House Outdoor Ceremony Reservations Permits for Outdoor Events in Seattle Parks (Park Use Permits) Photography Permits Picnic Shelter and Table Reservations Pool Rentals Sports Field Reservations Athletic Field Drop-In Program Baseball Field Features Football Field Features Soccer Field Features Tennis Court Reservations and Costs Volleyball Sand Court Reservations Volunteer How To Volunteer Volunteer Background Check Advisory Councils Coaching and Recreation Volunteering Environmental Education Volunteering Park Inspection Volunteers Trail Building & Park Clean Up Trails Program Urban Forest Restoration Volunteer Calendar Volunteer Calendar Event Submission Form Departments Elected Officials Boards and Commissions Media Contacts News Events Seattle Parks and Recreation Apply for financial aid Sign up for activities All Activities, Passes, & Permits Aquatics (Lap lanes & Lessons) Athletic Leagues Camps Childcare Fitness, Health, & Wellness Preschool All Parks All Community Centers Find a Community Center near you!  26 locations offer recreation programs including childcare, after school, senior programs, sports leagues, arts classes, and ... All Community Centers Find a Community Center near you!  26 locations offer recreation programs including childcare, after school, senior programs, sports leagues, arts classes, and ... Central Community Centers Garfield, International District/Chinatown, Miller, Montlake, Yesler Northeast Community Centers Lake City, Laurelhurst, Magnuson, Meadowbrook, Northgate, Ravenna-Eckstein Northwest Community Centers Ballard, Bitter Lake, Green Lake, Loyal Heights, Magnolia, Queen Anne Southeast Community Centers Jefferson, Rainier, Rainier Beach, Van Asselt Southwest Community Centers Delridge, Hiawatha, High Point, South Park Pools Find and contact your local pool. See schedules, amenities, program descriptions, and fees. Fees & Programs See descriptions and fees for city-wide pool programs like fitness classes and public swims. Ballard Pool Adjacent to Ballard High School. Features a 25-yard indoor pool with water slide, low dive, rope swing and warm water spa. Colman Pool (West Seattle) A 50-meter, 8-lane Olympic sized heated saltwater pool in West Seattle’s Lincoln Park. Summer only. Evans Pool (Green Lake) A 25-yard indoor lap pool on the east shore of Green Lake, with sauna. Same building as the community center. Madison Pool (Bitter Lake) A 25-yard indoor pool in the Haller Lake/Bitter Lake neighborhood of NE Seattle, with a shallow section and two diving boards. Meadowbrook Pool (Lake City) Just east of Lake City Way in NE Seattle, this 25-yard indoor pool features a rope swing, high dive, water fitness equipment and sauna. Medgar Evers Pool (Central) Next to Garfield Community Center, this 25-yard indoor pool features a rope swing, low diving board, separate shallow section and sauna. Mounger Pool (Magnolia) In the Magnolia neighborhood. Two outdoor pools: one w/50-foot corkscrew slide; the other shallow & great for kids. Concessionaire too! Summer only. Queen Anne Pool On top of Queen Anne Hill, this 25-yard indoor pool has built-in steps for easy entry, a high and low diving board, rope swing and a small sauna. Rainier Beach Pool 2 indoor pools: one w/ huge slide, spray features, lazy river, vortex and gradual entry. The other is a 25-yard lap pool w/ diving board. Sauna/hot tub onsite. Southwest Pool A 25-yard indoor pool in the Roxhill neighborhood of West Seattle. High and low diving boards, spa & sauna, and complimentary exercise machines. Swim Seattle Initiative Learn about swim scholarships, free swim lessons, and other training and events with community partners. Recreation Find activities and amenities for sports, hobbies, and fun. Dog Off-Leash Areas Seattle Parks and Recreation welcomes you to explore and enjoy most parks (on a leash), and we offer 14 exciting Off-Leash exceptions! At these designated ... Events and Attractions Attend an event or visit a fun attraction in a park. For Adults 50+ Seattle Parks and Recreation's Lifelong Recreation program offers a wide range of fitness and social activities for people 50 and better that change each ... For LGBTQ+ Seattle Parks has many services and activities of interest to the diversity of people who live, work and play in Seattle - including opportunities of interest ... For People with Disabilities Seattle Parks and Recreation Specialized Programs offers year-round activities for people with disabilities. The purpose is to provide recreational ... Hiking & Trails Plan your next urban hike with us! Seattle Parks and Recreation has miles of developed and semi-developed trails. Outdoor Water Recreation Find a boating center, swimming beach, spraypark, or wading pool. Recreation Equity Free drop-in recreation in parks and recreation deserts, and grants to fund free recreation programs with partners. Sports Learn about public tennis and pickleball courts, youth and adult sports leagues, find a golf course, and more. Virtual Recreation Here are some recreation alternatives to public, in-person activities in the Seattle Parks and Recreation system. You will find new opportunities to learn and ... Learning and Childcare Find activities, care, and environmental education for teens, children, and adults. Camps Come experience the amazing summer opportunities in your neighborhood community center and parks for all youth ages 3-17!  Options include Summer Day Camps from ... Childcare & Preschool Seattle Parks and Recreation provides a range of childcare and preschool programs for the social, recreational, and physical development of children and youth. ... Environmental Education (All Ages) Welcome to Seattle Parks and Recreation's Environmental Education Programs page. Our staff and volunteers offer outdoor nature learning opportunities that ... Teen Programs We have a variety of great teen programs including technology training, free wifi and computer access, jobs, service learning volunteer opportunities, hikes, ... Toddler Indoor Play Areas Designed for children 5 and younger, Toddler (Tot) Gyms offer a variety of toys and larger indoor space to play when it's not summer. Children will enjoy toys, ... Rentals and Permits Find a space for events like ceremonies, festivals, birthday parties, and picnics. Learn how to use a sports field, tennis court, or boat launch. Get tips and ... Boat Launch Permits Seattle has more pleasure boats per capita than anywhere else in the U.S. Seattle Parks and Recreation manages seven motorized boat launches on Puget Sound, ... Commercial Use Permits - Small Classes Commercial activity in a Seattle park requires a permit or contract. These small-class permits are issued to operators of fitness groups (boot camps, yoga, ... Community Center Room Rentals The Seattle Parks and Recreation community centers are excellent places for meetings, parties, and group gatherings. We have over two dozen locations across the ... Day Camp Permits Permits are required to operate a daytime program offering supervised and registered recreational activities that are open to the public. Event Planning Tools Find tips, rules, and refund information to help with your event. Get a photography permit or park map. Indoor Event Rentals This is your first stop for all indoor event space rentals within the Seattle Parks and Recreation system. Reserve an events space, including Shelterhouses, ... Outdoor Ceremonies Seattle parks and gardens make lovely and inexpensive outdoor venues. Surround your ceremony with the elegance and beauty of nature. Read on for critical info ... Outdoor Event Permits Thank you for choosing a Seattle park for your event. A permit is required to reserve a playfield, facility, stage or performing arts area, or to use a park for ... Photography Permits Seattle Parks and Recreation maintains over 485 parks. A permit is required for professional and commercial photography occurring on City of Seattle Parks and ... Picnic Rentals We have dozens of beautiful parks located in the Seattle area available for picnic reservations. In order to schedule successfully, please read the Picnic ... Sports Fields Seattle Parks and Recreation has 200+ athletic fields suitable for seasonal, occasional and tournament play for sports such as, but not limited to; softball, ... Tennis Courts The Amy Yee Tennis Center schedules reservations and court rentals for the Center and the 100+ outdoor tennis courts in the Seattle Park system. Same-day ... Volunteer Find ways you can give back to your community and improve our parks. Advisory Councils Here's a direct opportunity to create more access for underserved populations and improve the quality of offerings provided by the Associated Recreation Council ... Coaching & Recreation Are you interested in sports? Want to further the well being and learning skills of students in Seattle Public Schools? We have a variety of coaching and ... How to Volunteer Want to volunteer with Seattle Parks and Recreation? We have a variety of current opportunities that need you. Help us build and maintain our forest lands, ... Environmental Education Volunteering Do you love nature and have a passion for our environment? Are you looking to enhance the public's understanding of our urban flora and fauna? We have a variety ... Park Inspection The Department of Parks and Recreation is announcing its new volunteer Park Inspection program. We invite any Seattle residents, including current and past ... Trail Building & Park Clean Up Find ways to keep our parks healthy while having fun, getting community service hours, or completing a scout project. Urban Forest Restoration Our city forests need a little loving care from us. Urban pressures, like invasive plants and lack of regeneration of native trees, are diminishing the benefits ... Volunteer Calendar A calendar of volunteer opportunities and events in Seatttle parks. Home All Parks Jefferson Community Center Reserve A Picnic Site Current Volunteer Opportunities Contact Us Phone: (206) 684-4075 Email: PKS_Info@seattle.gov Fax: (206) 615-1813 Learn about Spray Parks & Wading Pools Have your ceremony in a Seattle park Reserve A Tennis Court Jefferson Park Photo Credit Photo Credit: TIA International Photography 3801 Beacon Ave. S, Seattle, WA  98108 4 a.m. – 11:30 p.m. Contact Us (206) 684-4075 General Contact Information Phone: (206) 684-4075 Amenities Picnic Sites Views Tennis Courts Skate Park Trails Play Area Baseball/Softball Fields Restrooms Drinking fountains Spray Parks Soccer Fields Art in the Park Basketball Courts Images About Jefferson Park, the sixth largest park in the city, offers unparalleled views of the Duwamish River, the city and the Olympic Mountains. The Olmsted-inspired path system flanked by trees offers a wonderful respite from city life along with many active opportunities. The covering of the reservoirs and two voter-approved Park levies transformed the park into a great community gathering place for southeast Seattle. It is the home to the Bill Wright Golf Complex at Jefferson Park , the Jefferson Community Center , Jefferson Lawn Bowling , Jefferson Skatepark and Beacon Mountain. Bill Wright Golf Complex at Jefferson Park Bill Wright played golf at Franklin High School and Western Washington University and became the first Black competitor to win a US Golf Association championship.  He learned the game at Jefferson Park Golf Course on Beacon Hill and made history in 1959 when he won the US Amateur Public Links Championship in Denver.  In 2024, Jefferson Park Golf Course was officially renamed in honor of Bill Wright. Visit the Jefferson Park Golf Course Holes #11-12 Renovation project page for information about the renovation project. Jefferson Park Playfield Synthetic Turf Replacement Project Spring 2025 The playfield’s synthetic turf was replaced in summer/fall of 2023 and is open for public use. Seattle Parks and Recreation (SPR) conducted condition assessments on all our synthetic turf fields in 2018, which informed both immediate maintenance needs and the order in which field projects are funded for replacement. This project replaced 153,500 sq ft of aging synthetic turf at Jefferson Playfield. This included the removal of the old ‘worn out’ synthetic turf and addressed structural repairs to curbing, subsurface drainage, and the rubberized running track. Continued improvements are being planned to make field access more accessible. The implementation of these accessibility improvements is on a separate project timeline from the turf replacement project due to additional permitting requirements. Osborn Consulting is finalizing construction drawings for the addition of two accessible parking stalls and an accessible ramp off 16th Ave S. This work is currently anticipated to be under constructionin early 2025.. Budget The budget for planning, design, and construction of the synthetic turf replacement and accessibility improvements is $2.8 million. The funding is provided by the REET I Capital Fund. Turf Replacement Schedule (Complete) Bidding: Spring 2023 Construction: Late July - Late October 2023 Accessibility Improvements Schedule Bidding: Winter 2024 Construction: Spring 2025 - Summer 2025 Anticipated Impact Seattle Parks and Recreation and the contractor hired will work to minimize impacts to park visitors and the community. For additional information please contact Jonathan Pagan at: Jonathan.Pagan@seattle.gov Spraypark Open Memorial Day to Labor Day. See all sprayparks and wading pools Reserve your tennis court Outdoor tennis court reservations are managed by Amy Yee Tennis Center, with self service reservations available online in Active Net (free account required).  Reservations are also available by phone. Call (206) 684-4764 , or visit Amy Yee Tennis Center in person. Indoor tennis court rentals are available at Amy Yee Tennis Center. See Tennis Court Reservations for a full list of indoor and outdoor courts, features, and prices. Have your special ceremony here! You can schedule an outdoor ceremony in almost any of our 400 parks, but this particular location is especially well suited for outdoor ceremonies. Please visit our outdoor ceremonies reservations site for more information. After-Hours Lighting Shutoff Call to manually shut off lights at Athletic Fields or Sport Courts if lights are on after-hours. Phone: 1 (855) 330-8400 About Us Jobs Projects Contracts & Partnerships Rules & Regulations Plans & Policies Parks and Recreation AP Diaz, Superintendent Mailing Address: 100 Dexter Ave N, Seattle, WA, 98109 Phone: (206) 684-4075 Fax: (206) 615-1813 Email: pks_info@seattle.gov Newsletter Updates Subscribe Sign up for the latest updates from Parks and Recreation Citywide Information Elected Officials Open Data Portal Public Records City Holidays and Closures City News Feed City Event Calendar All City Newsletters View the Departments & Agencies List Boards & Commissions Popular Pages Pools All Parks Picnic Rentals Find a Restroom in a Park All Community Centers Healthy People, Thriving Environment, Vibrant Community Policies About Our Digital Properties Privacy Policy Title II: Americans with Disabilities Act Title VI: Civil Rights Act Sitemap"
    },
    {
      "url": "https://www.cityftmyers.com/1171/Procurement-Services",
      "text": "Procurement Services | Fort Myers, FL - City Government Skip to Main Content Search Government Departments Information Services Home Departments Financial Services Services Procurement Services Procurement Services Last Content Update: Thursday, June 5, 2025 Procurement Services is the centralized authority responsible for the procurement of and contracting for supplies, goods, equipment, contractual services, professional and consultant services, capital improvements and construction, and/or any combination of goods and services at the best value, with fairness and integrity on behalf of the City of Fort Myers, City Council, City Manager, staff and citizens. The City of Fort Myers will follow sound and prudent business practices, promote full and equitable economic participation of all segments of the business community, and follow the strictest ethical standards when procuring commodities and contractual services. Procurement Services’ mission is to foster and support a Culture of Excellence throughout the City by providing superior goods and services through effective, innovative, and strategic procurement and contract management.  The procurement staff is committed to exemplary customer service, professionalism, impartiality, transparency, and achieving the best value for the City within the parameters of the law. The role of Procurement Services is to: Provide fair and equitable treatment of all persons interested in the City’s procurement practices; Be an expert resource for client departments regarding contracts and purchasing goods and services; Partner with departments/divisions to increase the efficiency of City operations by obtaining supplies, goods, equipment, contractual services, professional and consultant services, capital improvements and construction and/or any combination of goods and services required, in a timely manner, meeting the department needs while acting in the best interest of the City and residents; Maximize competition for all procurements increasing the value of public funds; Assure adherence to all federal laws, state statutes, City Ordinances, regulations, policies and procedures through various methods of procurement; Administer the contracting function with internal efficiency, and ensuring that each procurement and contract is in the best interest of the City; Utilize local and minority businesses when appropriate, as set forth in Chapter 38 of the City’s Administrative Code of Ordinances; Obtain maximum savings through innovative buying and application of value analysis techniques and consolidating purchases of common items. Solicitations, Quotes OpenGov Notice of Intent to Enter into a Sole Source Procurement has moved to OpenGov Single Source Portal Procurement Services Email Physical Address View Map 2200 Second Street Fort Myers , FL 33901 2200 Second Street  Fort Myers FL 33901 Directions Phone: 239-321-7240 Denise Finn NIGP-CPP CPPO C.P.M. CPPB Procurement Manager Email Phone: 239-321-7242 Rose Theriot Purchasing Agent II Email Phone: 239-321-7240 Kirk Zimmerman NIGP-CPP, CPPB Senior Procurement Specialist Email Phone: 239-321-7241 Cathy Scott NIGP-PPA Senior Procurement Specialist Email Phone: 239-321-7235 Lis Buron Procurement Card Analyst Email Phone: 239-321-7232 Information General Terms & Conditions Minority Business Enterprise Program Principles and Practices of Public Procurement Procurement Ordinances Procurement Policy Procurement Process Procurement Proclamation Procurement Resources Procurement Services FAQs Services Active Solicitations Becoming a City Vendor City Payment Program How to do Business Taxes & IRS Forms Vendor Responsibilities Contracts E-Procurement Contact Home Departments Government Information Services Contact /QuickLinks.aspx News Public Records Report A Concern Site Map Social Terms & Policies /QuickLinks.aspx City of Fort Myers 2200 Second Street Fort Myers, FL 33901 City Hall: 239-321-7000 City Public Records: 239-321-7042 or via our Transparency Portal Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.jeffersonparkchamber.com/events",
      "text": "Events — Jefferson Park Chamber of Commerce Skip to Content Open Menu Close Menu Membership Become a Member Who Can Join? New Membership Application Our Partners Our Partners Partnership Opportunities Resources Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory News & Events JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Explore Jeff Park Explore Jeff Park Our History Jeff Park Today About Us Officers & Directors Privacy Policy Contact Us Home 0 0 Join the Chamber Membership Become a Member Who Can Join? New Membership Application Our Partners Our Partners Partnership Opportunities Resources Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory News & Events JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Explore Jeff Park Explore Jeff Park Our History Jeff Park Today About Us Officers & Directors Privacy Policy Contact Us Home 0 0 Join the Chamber Open Menu Close Menu Folder: Membership Back Become a Member Who Can Join? New Membership Application Folder: Our Partners Back Our Partners Partnership Opportunities Folder: Resources Back Business Resource Center Business Grants Residents 2025 Scholarship Program Aldermanic Offices City of Chicago Elected Officials 2024 Jefferson Park Flea Market Member Directory Folder: News & Events Back JEFF FEST 2025 Events Submit an Event News Jefferson Park Photo Contest Jeff West Sip & Shop Folder: Explore Jeff Park Back Explore Jeff Park Our History Jeff Park Today Folder: About Us Back Officers & Directors Privacy Policy Contact Us Home Join the Chamber Schedule of Events Sep 11 Chamber Meetings Monthly Chamber Meeting Thursday, September 11, 2025 10:00 AM 11:30 AM Regus (map) Google Calendar ICS When: Sept 11 at 10 AM Where: Regus Workspace Solutions 4849 N Milwaukee Ave 7th floor. Ribbon Cutting for Regus at 10:45am Please join us after the meeting for a special 9/11 commemorative ceremony led by the Billy Caldwell American Legion post 806 and other veteran groups across the street at the Jefferson Park War Memorial. View Event → Sep 13 Fall Nature Fest Saturday, September 13, 2025 12:00 PM 3:00 PM La Bagh Woods (map) Google Calendar ICS The 6th Annual Fall Nature Fest is back in LaBagh Woods! On September 13th, 2025 from 12pm - 3pm join Commissioner Degnen and The Forest Preserves of Cook County in LaBagh Woods for this free environmentally-focused festival. View Event → Oct 4 Northwest Art Walk Saturday, October 4, 2025 10:00 AM 4:00 PM Parkway Bank (map) Google Calendar ICS Step onto the Northwest Art Trail and be part of something NEW! On Saturday, October 4, 2025, Jefferson Park is celebrating the launch of the NW Art Trail Walk- a vibrant public art experience featuring more than ten stunning sculptures along N. Milwaukee Avenue. Mark your calendars! Join NWArt Trail for the Dedication Ceremony at 10am at Parkway Bank (4858 N. Milwaukee Ave), followed by guided tours until 4pm. Explore art, enjoy neighborhood specials, and celebrate October Arts & Humanities Month. View Event → Oct 9 Chamber Meetings Monthly Chamber Meeting Thursday, October 9, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS When: Monthly chamber meetings are held on the second Thursday of every month at 8:30 AM unless otherwise noted. Where: Copernicus Center 5214 W Lawrence Ave Ste. 5, Annex Bldg. Chicago, IL 60630 Please be sure to drop your card in the bowl near sign in at the next general meeting for a chance to be our featured business of the month! View Event → Nov 13 Chamber Meetings Monthly Chamber Meeting Thursday, November 13, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS When: Monthly chamber meetings are held on the second Thursday of every month at 8:30 AM unless otherwise noted. Where: Copernicus Center 5214 W Lawrence Ave Ste. 5, Annex Bldg. Chicago, IL 60630 Please be sure to drop your card in the bowl near sign in at the next general meeting for a chance to be our featured business of the month! View Event → Dec 11 Chamber Meetings Monthly Chamber Meeting Thursday, December 11, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS When: Monthly chamber meetings are held on the second Thursday of every month at 8:30 AM unless otherwise noted. Where: Copernicus Center 5214 W Lawrence Ave Ste. 5, Annex Bldg. Chicago, IL 60630 Please be sure to drop your card in the bowl near sign in at the next general meeting for a chance to be our featured business of the month! View Event → Aug 14 Chamber Meetings Monthly Chamber Meeting Thursday, August 14, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS Please note: Our August meeting has been canceled to make way for a private, members-only event. Please stay tuned for September meeting details. View Event → Jul 19 Sol Space Grand Opening- Public Welcome! Saturday, July 19, 2025 4:00 PM 6:00 PM Sol Space LLC (map) Google Calendar ICS 🌞 Welcome to Sol Space! Grand Opening in Jeff West – July 19 at 4 PM The Jefferson Park Chamber is thrilled to celebrate the grand opening of Sol Space , a vibrant new wellness and community studio located in the heart of our growing Jeff West corridor . 📍 Location: 5922 W Lawrence Ave., Jefferson Park 📅 Date: Friday, July 19th 🕓 Time: Starting at 4:00 PM Join us as we officially welcome this unique, family-friendly space to the neighborhood with an exciting lineup of events: 🎀 Event Schedule: 4:00 PM – Ribbon Cutting Ceremony 4:30 PM – Yoga Demonstration 5:00 PM – Meet Bluey (fun for the kiddos!) 6:00 PM – Sound Bath Experience Sol Space brings a fresh energy to the west end of Lawrence Ave., blending community connection with mind-body wellness offerings for all ages. We’re proud to support their mission and can’t wait to see what they bring to the neighborhood. 👉 Learn more at www.solspacechicago.org Let’s show up, celebrate, and support another incredible small business in Jeff Park! View Event → Jul 10 Multi-Chamber Networking Event Thursday, July 10, 2025 5:30 PM 7:30 PM Coletti's Restaurant (map) Google Calendar ICS Join us for an evening of connection and collaboration at our Multi-Chamber Networking Event , hosted on the beautiful patio at Colletti’s Restaurant ! This is your chance to mingle with fellow professionals, entrepreneurs, and local leaders from across the Northwest Side—all in one place. Whether you’re growing your business or just love a good conversation over appetizers, this event is for you. View Event → Jul 10 Chamber Meetings Monthly Chamber Meeting Thursday, July 10, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS When: Monthly chamber meetings are held on the second Thursday of every month at 8:30 AM unless otherwise noted. Where: Copernicus Center 5214 W Lawrence Ave Ste. 5, Annex Bldg. Chicago, IL 60630 Please be sure to drop your card in the bowl near sign in at the next general meeting for a chance to be our featured business of the month! View Event → Jun 29 Printers Row Brewing Concerts on the Corner Sunday, June 29, 2025 7:00 PM 8:00 PM Printers Row Brewery (map) Google Calendar ICS Enjoy live music while sipping a brew at Concerts on the Corner! View Event → Jun 28 Summer Yoga with Chicago Health and Physical Therapy Saturday, June 28, 2025 1:15 PM 2:15 PM Chicago Health & Physical Therapy (map) Google Calendar ICS $20 only! A relaxing and energizing 1 hour beginner yoga class designed to help you build strength, flexibility, and mindfulness with Ann! View Event → Jun 26 Clarendale Six Corners BBQ, Blues & Brews Thursday, June 26, 2025 4:30 PM 6:30 PM Clarendale Six Corners (map) Google Calendar ICS BLUES, BREWS & BBQ FIX - Clarendale Six Corners View Event → Jun 24 Yoga and Journaling at Plot Twist Used Book Store Tuesday, June 24, 2025 7:30 PM 8:30 PM Plot Twist Used Book Club (map) Google Calendar ICS Community Yoga & Journaling Join us at Plot Twist Used Books for community yoga & journaling. Details: Tuesdays in June: 7:30 - 8:30 PM﻿ Led by Catharsis Collective, this one-hour small group yoga and journaling session is a great way to destress and build community! Single session: $27 or class passes are available LINK TO REGISTER: Studio Calendar | Catharsis Collective View Event → Jun 24 End of Session Legislative Town Hall Tuesday, June 24, 2025 6:00 PM 7:30 PM The Irish American Heritage Center (map) Google Calendar ICS As the legislative session closes for the summer, we invite you to engage with Senator Robert Martwick and State Representative Lindsey LaPointe at our End-of-Session Legislative Town Hall on Tuesday, June 24th from 6 to 7:30 PM at The Irish American Heritage Center (4626 N Knox Ave). Please bring any questions or concerns you may have regarding legislative updates from our Spring 2025 session, as well as any other issues that impact our community. You can scan the QR code here to register and submit your questions, or you can email our office at info@senatormartwick.com to RSVP. We look forward to seeing you there! View Event → Jun 22 Printers Row Brewing Concerts on the Corner Sunday, June 22, 2025 7:00 PM 8:00 PM Printers Row Brewery (map) Google Calendar ICS Enjoy live music while sipping a brew at Concerts on the Corner! View Event → Jun 21 Aponte Art Gallery Presents: L'ving Be Diff Day Saturday, June 21, 2025 2:00 PM 7:00 PM Aponte Art Gallery (map) Google Calendar ICS Join us as we come together to celebrate life, Living One Life, One Love: This apparel Pop-Up showcases Chicago artist Juliano L’ving’s unique inspired clothing, which conveys a powerful message: Living One Love, One Life. From 2 to 7 pm, guests will be immersed in a vibrant atmosphere where creativity and community intersect. Enjoy the soulful sounds of Juliano L’ving, setting the perfect backdrop to explore his apparel. This pop-up event invites you to celebrate life, love, and creativity in full color. Mark your calendar and be part of the movement. Appetizers and Beverages will be served. street parking available View Event → Jun 21 Plot Twist Used Book Club Meeting Saturday, June 21, 2025 2:00 PM 4:00 PM Plot Twist Used Book Club (map) Google Calendar ICS The Great Gatsby - Saturday June 21st, 2025 $20.00 Welcome to Plot Twist Used Book Club ! Join us for an afternoon of lively discussions and good company as we dive into our next read - The Great Gatsby by F. Scott Fitzgerald . If its your first read or your fifty-first, enter the world of the beautiful and the damned...yes, that's a Fitzgerald reference. Whether you're a seasoned bookworm or just looking to meet new people, this event is perfect for anyone who loves to read. Date: Sunday June 8, 2025 Time: 2:00 PM - 4:00 PM CST Location: 5938 W Lawrence Ave Come prepared to share your thoughts, ask questions, and maybe even uncover a few plot twists of your own. We can't wait to see you there! Details: $20 + tax includes A used copy of the book - to be picked up in advance Light snacks & beverages 2 hours of conversation & community Group size limited to 7 LINK BELOW: The Great Gatsby - Saturday June 21st, 2025 View Event → Jun 21 Unison Annual Warehouse SALE! Saturday, June 21, 2025 9:00 AM 4:00 PM Unison (map) Google Calendar ICS Join us Thursday, Friday and Saturday for our Annual Warehouse Sale. Shop up to 70% off bed + bath linens, furniture, rugs, tabletop, outlet items and unique samples. June 19th-20th: 12PM-7PM June 21st: 9AM-4PM While supplies last, does not apply to orders placed online or by phone. Payment via credit card only. For more information visit: https://www.unisonhome.com/the-annual-warehouse-sale Please contact the Unison Customer Experience Team with any questions. View Event → Jun 20 Unison Annual Warehouse SALE! Friday, June 20, 2025 12:00 PM 7:00 PM Unison (map) Google Calendar ICS Join us Thursday, Friday and Saturday for our Annual Warehouse Sale. Shop up to 70% off bed + bath linens, furniture, rugs, tabletop, outlet items and unique samples. June 19th-20th: 12PM-7PM June 21st: 9AM-4PM While supplies last, does not apply to orders placed online or by phone. Payment via credit card only. For more information visit: https://www.unisonhome.com/the-annual-warehouse-sale Please contact the Unison Customer Experience Team with any questions. View Event → Jun 19 Printers Row Brewing Concerts on the Corner Thursday, June 19, 2025 7:00 PM 8:00 PM Printers Row Brewery (map) Google Calendar ICS Enjoy live music while sipping a brew at Concerts on the Corner! View Event → Jun 19 Chamber of Commerce Business After Hours Thursday, June 19, 2025 6:00 PM 8:00 PM 6 Corners Lofts Rooftop Terrace (map) Google Calendar ICS Business After Hours Summer 2025 General Ticket – $15.00 Includes cocktails and appetizers provided by Tank Restaurant. Register HERE: SIX CORNERS CHAMBER OF COMMERCE - Business After Hours Summer 2025 View Event → Jun 19 Unison Annual Warehouse SALE! Thursday, June 19, 2025 12:00 PM 7:00 PM Unison (map) Google Calendar ICS Join us Thursday, Friday and Saturday for our Annual Warehouse Sale. Shop up to 70% off bed + bath linens, furniture, rugs, tabletop, outlet items and unique samples. June 19th-20th: 12PM-7PM June 21st: 9AM-4PM While supplies last, does not apply to orders placed online or by phone. Payment via credit card only. For more information visit: https://www.unisonhome.com/the-annual-warehouse-sale Please contact the Unison Customer Experience Team with any questions. View Event → Jun 17 Yoga and Journaling at Plot Twist Used Book Store Tuesday, June 17, 2025 7:30 PM 8:30 PM Plot Twist Used Book Club (map) Google Calendar ICS Community Yoga & Journaling Join us at Plot Twist Used Books for community yoga & journaling. Details: Tuesdays in June: 7:30 - 8:30 PM﻿ Led by Catharsis Collective, this one-hour small group yoga and journaling session is a great way to destress and build community! Single session: $27 or class passes are available LINK TO REGISTER: Studio Calendar | Catharsis Collective View Event → Jun 17 MBE/WMBE Vendow Workshop Tuesday, June 17, 2025 1:00 PM 3:00 PM Jefferson Park Chamber of IUOE Local 399 (map) Google Calendar ICS MBE/ WMBE Vendor Workshop: Steps to Understand the BidBuy Process and SOS Procurement Opportunities The vendor assistance workshop provides assistance in completing the County minority and women (MBE/WBE) certification application and the MBE/WBE for bid/proposal submission. More info and register here: REGISTRATION LINK View Event → Jun 15 Printers Row Brewing Concerts on the Corner Sunday, June 15, 2025 7:00 PM 8:00 PM Printers Row Brewery (map) Google Calendar ICS Enjoy live music while sipping a brew at Concerts on the Corner! View Event → Jun 14 Congregational Church of Jefferson Park Spaghetti Dinner and Dime Social Saturday, June 14, 2025 7:00 PM 7:00 PM Congregational Church of Jefferson Park (map) Google Calendar ICS Doors Open: 4PM Dinner Served: 5-6:30PM Prizes Called: 7PM 13+ years old- $12 6-12 years old- $6 5 and under- FREE 50/50 Raffle and prizes! View Event → Jun 14 Printers Row Brewing 4th Anniversary Block Party! Saturday, June 14, 2025 12:00 PM 11:59 PM Printers Row Brewery (map) Google Calendar ICS If you've been to one of our block parties, you know what's in store; lots of family and kids fun, live music, tacos and BEER! KID FUN: Bubble Mania Arts and Crafts Games ADULT FUN: BEER! Live Music Cans to go TACOS FROM IZTATL COCINA JEFFERSON PARK! View Event → Jun 12 Chamber Meetings Monthly Chamber Meeting Thursday, June 12, 2025 8:30 AM 9:30 AM Copernicus Center (map) Google Calendar ICS When: Monthly chamber meetings are held on the second Thursday of every month at 8:30 AM unless otherwise noted. Where: Copernicus Center 5214 W Lawrence Ave Ste. 5, Annex Bldg. Chicago, IL 60630 Please be sure to drop your card in the bowl near sign in at the next general meeting for a chance to be our featured business of the month! View Event → Jun 11 Printers Row Brewing Book Club Meeting Wednesday, June 11, 2025 7:30 PM 9:00 PM Printers Row Brewery (map) Google Calendar ICS It's our first anniversary, and we'll have a special guest, @ohhushreads ! Book: The Gone World by Tom Sweterlitsch View Event → Jun 10 Yoga and Journaling at Plot Twist Used Book Store Tuesday, June 10, 2025 7:30 PM 8:30 PM Plot Twist Used Book Club (map) Google Calendar ICS Community Yoga & Journaling Join us at Plot Twist Used Books for community yoga & journaling. Details: Tuesdays in June: 7:30 - 8:30 PM﻿ Led by Catharsis Collective, this one-hour small group yoga and journaling session is a great way to destress and build community! Single session: $27 or class passes are available LINK TO REGISTER: Studio Calendar | Catharsis Collective View Event → Jun 8 Printers Row Brewing Concerts on the Corner Sunday, June 8, 2025 7:00 PM 9:00 PM Printers Row Brewery (map) Google Calendar ICS Enjoy live music while sipping a brew at Concerts on the Corner! View Event → Jun 8 City-Wide Symphony Orchestra at Jefferson Memorial Park Sunday, June 8, 2025 3:00 PM 4:00 PM Jefferson Memorial Park (map) Google Calendar ICS FREE EVENT! Enjoy an afternoon of beautiful symphonic music performed by talented Chicago area musicians. Bring a chair or a blanket and enjoy the free outdoor show! View Event → Jun 8 Plot Twist Used Book Club Sunday, June 8, 2025 2:00 PM 4:00 PM Plot Twist Used Book Club (map) Google Calendar ICS Welcome to Plot Twist Used Book Club ! Join us for an afternoon of lively discussions and good company as we dive into our next read - Last Days of Night by Graham Moore . Edison! Tesla! Lawyers! Oh my! A young, untested lawyer tries to prove who invented the light bulb, Whether you're a seasoned bookworm or just looking to meet new people, this event is perfect for anyone who loves to read. Date: Sunday June 8, 2025 Time: 2:00 PM - 4:00 PM CST Location: 5938 W Lawrence Ave Come prepared to share your thoughts, ask questions, and maybe even uncover a few plot twists of your own. We can't wait to see you there! Details: $20 + tax includes A used copy of the book - to be picked up in advance Light snacks & beverages 2 hours of conversation & community Group size limited to 7 LINK BELOW: Last Days of Night - Sunday June 8, 2025 View Event → Jun 8 Jefferson Park Pollinator Gardens Plant Sale!! Sunday, June 8, 2025 10:00 AM 1:00 PM Jefferson Memorial Park (map) Google Calendar ICS Jefferson Park Pollinator Gardens Plant Sale!! We will be along Higgins Ave: between the Sunday Market and Nature Play Event. $5 per native/annual plant Cash or QR payment accepted Plants grown and donated by volunteers Exact plant varieties will be available the day of the event View Event → Jun 8 Jefferson Park Sunday Market at Jefferson Memorial Park Sunday, June 8, 2025 9:30 AM 1:30 PM Jefferson Memorial Park (map) Google Calendar ICS Season Opener at the PARK! The Jefferson Park Sunday Market is back and better than ever! June 8th Jefferson Memorial Park (4822 Long Ave, behind the fieldhouse) Come for the fresh produce, stay for the community vibes! You’ll find: Local honey Handcrafted goods Fresh fruit and veggies Artisan breads Coffee, hot sauces, and so much more! It’s the perfect way to kick off the season – support small businesses and discover unique finds that nourish body and soul. View Event → Want to list your event with us? Great — gather all the information and submit your event to our calendar here! Submit your Event Jefferson Park Chamber of Commerce 5214 W Lawrence Avenue Suite 5 Chicago, IL 60630 Phone: 773-736-6697 Fax: 773-736-5008 Email: info@jeffersonparkchamber.com Membership Become a Member Who Can Join? Officers  & Directors News & Events Events Submit Your Event News Our Neighborhood Resources Explore Jeff Park Business Directory News You Can Use Never miss out on interesting news, business resources, and local events happening in the Jeff Park community! A monthly digital newsletter sent straight to your inbox. Email Address Sign Up We never share your data. Thank you for subscribing!"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "text": "Contact Us Free Community Shred Day to be held at our Aberdeen, Raymond and Long Beach branch locations - Saturday, September 20th from 9AM to Noon. Bring your sensitive documents and mail to be securely destroyed on-site. Donations of canned goods for local food banks will be accepted. Close Alert Go to main content Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Search: Online Banking Login Login Username Register Bank Borrow Manage Discover Spend Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Share Savings HSAs Youth Accounts Christmas Club Investment Accounts Money Market IRAs Certificates Business Accounts Retirement & Investment Services Savings Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Loans Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Access Online Banking Mobile Banking EasyPay Protection Insurance Estate Planning Loan Payment Options Business Services Card Services Courtesy Pay Order Checks Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More About Us About Great NorthWest FCU Become a Member Membership Benefits Buy Local Spend Local Promotions Refer a Friend Career Opportunities Get Help Contact Us Frequently Asked Questions Disclosures & Agreements Provide Feedback Rates Locations Locations & ATMs Financial Education Great NorthWest Insider Great NorthWest Scholarships Credit Score Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Contact Us We're here when you need us. Have a question or need a hand? We’re here to help. Reach out by phone, text, email, or visit us in person—our team is ready to support you, wherever life takes you. Contact Us Quick Question? Get a quick answer during business hours. Text 3605339990 and a Member Service Representative will reply! Need a notary? Want to open a Safe Deposit Box? Have questions about filing a cardholder dispute? Skip the line at your local branch and Schedule an Appointment ! * Required Fields First Name: Last Name: Email Address: Message: Are you a current member of Great NorthWest FCU? Yes No Branch Information Filter by City All Cities All Cities Aberdeen, WA Chehalis, WA Long Beach, WA Ocean Park, WA Raymond, WA Filter by Service All Services All Services Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Aberdeen Branch 301 W. Wishkah Street Aberdeen, WA 98520 Get Directions Phone: 360-533-9990 TTY: 1-800-533-8396 Email Us Schedule an Appointment 24-Hour Drive-Thru ATM located across the street at 320 W. Wishkah St. You can also visit our Great NorthWest Financial Center. Located at 331 W. Wishkah St., this office houses our Retirement & Investment Services along with Mortgage and Business Lending. Lobby Hours: Mon: 9am - 6pm Tue: 9am - 6pm Wed: 9am - 6pm Thu: 9am - 6pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 6pm Tue: 8am - 6pm Wed: 8am - 6pm Thu: 8am - 6pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru Safe Deposit Boxes Night Deposit Coin Counter Notary Services Chehalis Branch 1601 N.W. Louisiana Avenue Chehalis, WA 98532 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 8:30am - 5:30pm Tue: 8:30am - 5:30pm Wed: 8:30am - 5:30pm Thu: 8:30am - 5:30pm Fri: 8:30am - 6pm Sat: 9am - 1pm Sun: Closed On-site ATM Notary Services Long Beach Branch 705 Pacific Ave. S. Long Beach, WA 98631 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Ocean Park Branch 1409 251st Pl. Ocean Park, WA 98640 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive Thru Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Raymond Branch 327 Commercial Street Raymond, WA 98577 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Go to main navigation Make it Great! Send Us A Message This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Call Center (360) 533-9990 (call or text) (800) 533-8396 Call Center Hours (PST) Monday - Friday: 8am - 6pm Saturday: 9am - 1pm Sunday: Closed Mailing Address 301 W. Wishkah St. Aberdeen, WA 98520 Routing Number: 325180333 Accessibility Statement Privacy Policy Disclosures Site Map © 2025 Great NorthWest Federal Credit Union Website by CUSG Facebook Instagram This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Search: Bank Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Investment Accounts Business Accounts Retirement & Investment Services Savings Rates Borrow Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Manage Online Banking Insurance Loan Payment Options Business Services Courtesy Pay Card Services Order Checks Discover About Great NorthWest FCU Become a Member Membership Benefits Promotions Career Opportunities Locations & ATMs Contact Us FAQs Provide Feedback Great NorthWest Insider Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Google ReCaptcha Error"
    },
    {
      "url": "https://www.jefferson.edu/about/locations/center-city/parking-at-jefferson.html",
      "text": "Parking at Jefferson Skip to main content Apply Visit Give More Search Academics Back Academics Academics Home Program Finder Areas of Interest Registrar's Office Online Programs Study Away Academic Calendars Colleges, Schools & Institutes Sidney Kimmel Medical College College of Architecture & The Built Environment Kanbar College of Design, Engineering & Commerce School of Business School of Design & Engineering College of Health Professions College of Humanities & Sciences College of Life Sciences College of Nursing College of Pharmacy College of Population Health College of Rehabilitation Sciences Institute of Emerging Health Professions Continuing & Professional Studies Find Your Program Prepare yourself for what’s yet to come. Admissions Back Admissions Admissions Home Undergraduate Admissions Graduate Admissions Continuing & Professional Studies Admissions Sidney Kimmel Medical College Admissions Admissions Quick Links Request Information Schedule a Visit Take a Virtual Tour Apply for Admission Financing Your Education Contact Admissions Apply Start your Jefferson journey today. Tuition & Financial Aid Back Tuition & Financial Aid Tuition & Financial Aid Home Tuition, Fees and Room & Board (2025-26) Tuition & Financial Aid Quick Links Financial Aid Office Student Accounts Office Contact Us Expert Center City and East Falls staffs are here to help. Life at Jefferson Back Life at Jefferson Life at Jefferson Home Center City Residential Life East Falls Residential Life Virtual Tours Life at Jefferson Quick Links Explore Philadelphia University Catalog & Handbooks Commencement Consumer Information & Disclosures Plan Your Visit Each of our locations offers a unique learning environment. Research Back Research Research Home Labs & Service Centers Research Resources 2025 Research Magazine Research Quick Links Applied Research Basic Research Clinical Research Athletics Back Athletics Athletics Home Visit jeffersonrams.com Athletic Facilities Shop Official Store Athletics Quick Links Health & Wellness at Jefferson Jefferson Recreation & Fitness Center News Back News News Home News Quick Links Design & Style Science & Technology Business Health Life at Jefferson Podcasts More Apply Visit Give More Close Apply Visit Give Explore More: Jefferson Advantage About Jefferson Virtual Tour Jefferson Online Global Jefferson Campus Locations Alumni Careers Provost Current Students & Faculty Center City Campus Banner Campus Store Canvas Commuter Services Campus Life & Current Students Faculty & Staff JeffMail Library Office 365 Student Portal East Falls Campus Banner Campus Store Canvas Faculty & Staff Giving JeffMail Library Starfish Student Life & Resources Student Portal YouTube Instagram Facebook Twitter LinkedIn Parking at Jefferson Return to Home Toggle Hidden Breadcrumb Items About Jefferson About Jefferson Locations Center City Campus Explore this Section Center City Campus East Falls Campus Dixon Campus Voorhees Campus Virtual Tours & Videos Admissions Visit Center Organization: Edison Building 130 S. 9th Street Suite 100 Philadelphia , PA 19107 Email: enroll@jefferson.edu Contact Number(s): 215-951-2800 Admissions Visits Parking at Jefferson Valet Parking Valet parking for access to the following Jefferson buildings is available: Gibbon Building , 11th Street entrance of the Gibbon Building, between Chestnut & Sansom Streets Main Building & Thompson Building , 10th & Sansom Streets entrance to the Emergency and Trauma Center 925 Chestnut Street , 10th & Ludlow Streets entrance (Please note, valet service at this location is experiencing delays due to changes in parking garage availability in the area. Please allow extra time, or consider self-parking at one of the locations below.) Jefferson Neurosciences Garage (Valet Park) 9th Street between Walnut & Locust Streets Valet available Monday through Friday 6 AM to 6 PM Self Parking If you do not wish to use Jefferson Valet Parking Service, there are a number of parking lots and garages in the area. Patients may be dropped off at either the 11th or 10th Street entrance of the Gibbon Building. Suggested Parking Locations: 10th & Chestnut Streets Garage (Self and Valet Park) 10th & Chestnut Streets Open: 7 days, 24 hours Philadelphia Parking Authority Garage (Self Park) 10th & Ludlow Streets Open: 7 days, 6:00 AM to 11:30 PM Walnut Towers Garage (Self Park) 9th Street between Walnut & Locust Streets Open: Monday-Friday 6:00 AM to 2:00 AM Saturday 6:00 AM to 2:00 AM Parkway Garage (Self Park) 12th & Walnut Streets Open: 7 days, 24 hours Hamilton Garage (Self Park) 11th Street between Locust and Walnut Streets on the right hand side. Open: 7 days, 24 hours Apply Visit Give Facebook Twitter YouTube Instagram LinkedIn Copyright © 2025 Thomas Jefferson University Jefferson Health Innovation Philanthropy Contact Admissions Privacy Policy Consumer Information Jefferson holds itself accountable, at every level of the organization, to nurture an environment of inclusion and respect, by valuing the uniqueness of every individual, celebrating and reflecting the rich diversity of its communities, and taking meaningful action to cultivate an environment of fairness, belonging & opportunity."
    }
  ]
}