{
  "fuentes": [
    {
      "url": "https://www.cityofkeywest-fl.gov/475/Planning-Board",
      "email": "planning-dept@cityofkeywest-fl.gov"
    },
    {
      "url": "https://keysweekly.com/42/2-incumbent-city-commissioners-draw-challengers/",
      "email": "steve.potter@yahoo.com"
    },
    {
      "url": "http://cityofkeywest-fl.gov/directory.aspx?did=6",
      "email": "bldg@cityofkeywest-fl.gov"
    },
    {
      "url": "http://cityofkeywest-fl.gov/directory.aspx?did=6",
      "email": "cbo@cityofkeywest-fl.gov"
    },
    {
      "url": "http://cityofkeywest-fl.gov/directory.aspx?did=6",
      "email": "floodplain@cityofkeywest-fl.gov"
    },
    {
      "url": "https://sanddollarsports.com/about-us/",
      "email": "sales@sanddollarsports.com"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/FAQ.aspx?TID=15",
      "email": "bldg@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/FAQ.aspx?TID=15",
      "email": "cbo@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/FAQ.aspx?TID=15",
      "email": "floodplain@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/FAQ.aspx?TID=15",
      "email": "bldg@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/318/Planning-Department",
      "email": "planning-dept@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/318/Planning-Department",
      "email": "planning-dept@cityofkeywest-fl.gov"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/1124/About-Us",
      "email": "utilities@cityofkeywest-fl.gov"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://cozumelparks.com/en/contact/",
      "email": "mercadotecnia@cozumelparks.org"
    },
    {
      "url": "https://cozumelparks.com/en/contact/",
      "email": "reservas@cozumelparks.org"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "booking@maarlab.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "callcenter@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "jsanchez@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationscaribe1@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationscaribe2@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationscaribe3@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationscaribe@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationsixt1@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationspacific1@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "reservationspacific2@park-royalhotels.com"
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "email": "ventasprv@park-royalhotels.com"
    },
    {
      "url": "https://cozumelparks.com/en/about-us/",
      "email": "mercadotecnia@cozumelparks.org"
    },
    {
      "url": "https://cozumelparks.com/en/about-us/",
      "email": "reservas@cozumelparks.org"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.parkroyalcozumel.com/contact_us.asp",
      "email": "reservations2@vacationstoremiami.com"
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/cozumel-park-monroe-fl",
      "email": "info@cozumelpark.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.grandparkroyalcozumel.com/contact_us.asp",
      "email": "info@vacationstoremiami.com"
    },
    {
      "url": "https://www.grandparkroyalcozumel.com/contact_us.asp",
      "email": "reservations2@vacationstoremiami.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://deepbluecozumel.com/contact-us/",
      "email": "scuba@deepbluecozumel.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "app-promo-phones@2x.png",
    "beatrice.malle@skanem.com",
    "bldg@cityofkeywest-fl.gov",
    "booking@maarlab.com",
    "callcenter@park-royalhotels.com",
    "cbo@cityofkeywest-fl.gov",
    "floodplain@cityofkeywest-fl.gov",
    "info.nairobi@skanem.com",
    "info@cozumelpark.com",
    "info@inzmo.com",
    "info@reception-plus.de",
    "info@vacationstoremiami.com",
    "jane@skanem.ke",
    "jsanchez@park-royalhotels.com",
    "mercadotecnia@cozumelparks.org",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "planning-dept@cityofkeywest-fl.gov",
    "reservas@cozumelparks.org",
    "reservations2@vacationstoremiami.com",
    "reservationscaribe1@park-royalhotels.com",
    "reservationscaribe2@park-royalhotels.com",
    "reservationscaribe3@park-royalhotels.com",
    "reservationscaribe@park-royalhotels.com",
    "reservationsixt1@park-royalhotels.com",
    "reservationspacific1@park-royalhotels.com",
    "reservationspacific2@park-royalhotels.com",
    "sachen.gudka@skanem.com",
    "sales@sanddollarsports.com",
    "sameer.gaikwad@skanem.com",
    "scuba@deepbluecozumel.com",
    "shamila.mirza@skanem.com",
    "steve.potter@yahoo.com",
    "utilities@cityofkeywest-fl.gov",
    "ventasprv@park-royalhotels.com"
  ],
  "nombre_sitio": "cityofkeywest-fl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cityofkeywest-fl.gov/475/Planning-Board",
      "text": "Planning Board | Key West, FL Skip to Main Content Your Government Visitors City Departments Our Community Doing Business Search Legal Interpretation of Profanity Rules During Public Comment Development Review Committee (DRC) Historic Architectural Review Commission (HARC) Rules of Procedure for HARC Members Map of the Historic District 2025 Meeting Schedule Key West Bight Management District Board Key West Sculpture Garden Memorial Committee Naval Properties Local Redevelopment Authority Parks & Recreation Advisory Board Planning Board Sustainability Advisory Board Tree Commission Home Your Government Boards & Commissions D - Z Planning Board Planning Board Meeting Agendas and Minutes Current Board Member Information Overview The City of Key West Planning Board hears a spectrum of important public planning issues, ranging from specific development approval requests to Comprehensive Plan and Land Development Regulations changes. In 2008, the City Commission enlarged the membership of the Board to seven members, with each City Commissioner appointing one member each.  To become a volunteer to serve on the Planning Board, the interested person is required to be a resident of the City of Key West. Depending on the nature of the land development regulatory activity or proposed ordinance, the Planning Board serves in an advisory capacity, making recommendations to the City Commission or making decisions that are final in nature and subject to appeal to the City Commission or a court of law. Visual Presentations for Agendas All Visual Presentations for Agenda items must be submitted to the Clerk of the Board twenty-four hours before the start of the meeting. Americans with Disabilities Act ( ADA ) Assistance It is the policy of the City of Key West to comply with all requirements of the Americans with Disabilities Act ( ADA ). Please call the TTY number at 800-955-8771 or 800-955-8770 (Voice) or the ADA Coordinator at 305-809-3811 at least five business days in advance for sign language interpreters, assistive listening devices, or materials in accessible format. Acting City Planner James Singelyn Email the Planning Staff Phone: 305-809-3884 More Information Calendar Thu, Sep. 18 Planning Board meeting Thu, Oct. 16 Planning Board meeting Thu, Nov. 20 Planning Board meeting /Calendar.aspx Agendas & Minutes View official meetings & submit eComment Careers View open positions Parking Pay your citation online Live Meetings View what is airing now on KWCTV City Ordinances View our Code & Comprehensive Plan Key West Transit View Bus times and schedules Contact Us 1300 White Street Key West, FL 33040 305-809-3945 Email: Webmaster Social Media Facebook Instagram LinkedIn /QuickLinks.aspx Quick Links e-TRAKiT Permit Portal GovBuilt Licensing Payment Portal Staff Directory Employee Portal City Projects in Progress /QuickLinks.aspx Site Links Home Accessibility Copyright Notices Privacy Policy Site Map /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://keysweekly.com/42/2-incumbent-city-commissioners-draw-challengers/",
      "text": "2 incumbent city commissioners draw challengers Facebook Instagram Spotify Twitter Youtube BOM Best of Marathon Bubbas Best of Key West Best of Upper Keys Keyswide Key West Arts & Entertainment Key West Bubbas Key West crime Key West Business Key West Dining Key West Marine Life Key West News Lower Keys Community Lower Keys News Marathon Arts & Entertainment Marathon Best of Marathon Marathon Business Marathon Dining Marathon Marine Life Marathon News Middle Keys Community Middle Keys News Upper Keys Arts & Entertainment Upper Keys Islamorada News Key Largo News Upper Keys Business Upper Keys Community Upper Keys Dining Upper Keys Marine Life Upper Keys News Columns Artist’s Corner Barstool Astrology Behind the Blonde Dive Report Fishing Health Hip to the Scene In Pictures In Their Own Words Island Astrologer Island Currents Keys Disease Keys History Letter to the Editor Miles to Go Neighbor of the Week Opinion Paws in Paradise Raise a Glass Reef Report Reel Recs Seen Around Town Shelf Help Sports & More Sports Wrap Athlete of the Week Student of the Week The Weekly Editorial The Weekly Interview 20 Questions Classifieds Magazines Keys Woman Decision 24 Official Fantasy Fest Guide 2024 Hurricane Guides Home and Garden Florida Keys Table OnBoard Cruisers Holidays in the Keys Event Programs Gigantic Nautical Market Marathon Seafood Festival Guide I Love Stock Island Print Editions Live WebCams Search Contact Who We Are Home Delivery Legal Notices Careers Facebook Instagram Spotify Twitter Youtube Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Florida Keys Weekly Newspapers BOM Best of Marathon Bubbas Best of Key West Best of Upper Keys Keyswide Key West All Arts & Entertainment Key West Bubbas Key West crime Key West Business Key West Dining Key West Marine Life Key West News Lower Keys Community Lower Keys News KEY WEST FIREFIGHTERS TRAIN FOR SCARY SCENARIOS CAREER KEY WEST CRIMINAL CONVICTED OF GRAND THEFT SENTENCED TO PRISON EXPLORE THE GLAMOUR OF FLAGLER’S GILDED AGE HOTELS AT HAPPY HOUR… CONVICTED, THEN PARDONED JAN. 6 RIOTERS ARE FEATURED SPEAKERS Marathon All Arts & Entertainment Marathon Best of Marathon Marathon Business Marathon Dining Marathon Marine Life Marathon News Middle Keys Community Middle Keys News FREE CERTIFIED BICYCLE HELMET FITTER TRAININGS OFFERED THIS MONTH MONROE COUNTY FIRE RESCUE SET TO REMEMBER THE LIVES LOST ON… NEIGHBOR OF THE WEEK: LISA CAMPENELLI KEY COLONY BEACH WEIGHS FISHING AT SUNSET PARK Upper Keys All Arts & Entertainment Upper Keys Islamorada News Key Largo News Upper Keys Business Upper Keys Community Upper Keys Dining Upper Keys Marine Life Upper Keys News SUNSET CRUISE FUNDAISER IN KEY LARGO SUPPORTS A ‘FOXY’ CAUSE CONCERTS CELEBRATE HISPANIC HERITAGE SEPT. 13 AT FLORIDA KEYS BREWING CO. TASTE THE KEYS ADDS NEWS FLAVOR TO KEY LARGO CULINARY SCENE MONROE COUNTY FIRE RESCUE SET TO REMEMBER THE LIVES LOST ON… Columns All Artist’s Corner Barstool Astrology Behind the Blonde Dive Report Fishing Health Hip to the Scene In Pictures In Their Own Words Island Astrologer Island Currents Keys Disease Keys History Letter to the Editor Miles to Go Neighbor of the Week Opinion Paws in Paradise Raise a Glass Reef Report Reel Recs Seen Around Town Shelf Help Sports & More Sports Wrap Athlete of the Week Student of the Week The Weekly Editorial The Weekly Interview 20 Questions SUNSET CRUISE FUNDAISER IN KEY LARGO SUPPORTS A ‘FOXY’ CAUSE KEY WEST FIREFIGHTERS TRAIN FOR SCARY SCENARIOS FREE CERTIFIED BICYCLE HELMET FITTER TRAININGS OFFERED THIS MONTH NEIGHBOR OF THE WEEK: LISA CAMPENELLI Classifieds Magazines Keys Woman Decision 24 Official Fantasy Fest Guide 2024 Hurricane Guides Home and Garden Florida Keys Table OnBoard Cruisers Holidays in the Keys Event Programs Gigantic Nautical Market Marathon Seafood Festival Guide I Love Stock Island Print Editions Live WebCams Key West News Politics 2 incumbent city commissioners draw challengers Chiropractor and bar owner enter Key West race By Javier Reyes - June 15, 2020 Share Facebook Twitter Pinterest ReddIt Email Print Ryan Barnett T hree of the seven seats on the Key West City Commission dais are now being contested by challengers who have filed paperwork to run against the incumbent mayor and two sitting commissioners. Chiropractor Ryan Barnett, who owns Key West Chiropractic, is running against longtime District 6 Commissioner Clayton Lopez, whose district includes Bahama Village and other parts of Old Town. John Wilson Smith also filed to run against Lopez, but has not submitted a candidate statement or reported any campaign finance activity. Lopez is still working on his campaign platform and information, but has said he welcomes the challenge and hopes for a clean and respectful race. Clayton Lopez Barnett, who was born in Key West, says on the elections website, “Community service is important to me and servant leadership is my core value. … I’m also passionate about speaking to our youth about mental health and wellness. As a Conch, I love Key West. I represent the future of leadership. I have family and friends here; my business and my heart are here. My goal is to see Key West thrive as a community while embracing our unique One Human Family culture. We are in this together.” In the New Town District 3, Kimball Ingram, who owns Aqua nightclub and the SideBar, is challenging incumbent Billy Wardlow. This will be Lopez’s and Wardlow’s final term if they keep their seats in the coming election. Kimball Ingram Ingram says in his campaign statement that he is running for the community and to gain a voice on the commission, not against any one person. “No candidate should run unopposed and term limits should matter,” he states on the Monroe County Supervisor of Elections website. “Without opposition we have no opportunity to challenge the status quo. Normally, the commissioner would be termed out after 12 years. This year, because of a change in dates for the election, the term limit that should be imposed was suspended.” Wardlow, who has served on the City Commission since 2009, says in a campaign video that he has worked to improve communication among the city management, staff and the public, giving everyone a voice in the community. Billy Wardlow “We’ve also added numerous parks, including Cozumel Park with a splash pad, in our district, and the Coffee Butler Amphitheater at Truman Waterfront. City taxes haven’t gone up in years — it’s the property values that have gone up. And now we’re working to improve our streets and sidewalks.” In the Key West mayor’s race, incumbent Teri Johnston faces former commissioner and bar owner Mark Rossi as well as Key West native and real estate broker Rick Haskins. Key West commission seats are non-partisan, so the city elections could be decided in the August primary if one candidate garners 512% of the vote. Javier Reyes RELATED ARTICLES MORE FROM AUTHOR CAREER KEY WEST CRIMINAL CONVICTED OF GRAND THEFT SENTENCED TO PRISON FORMER PLANNING DIRECTOR PENS SCATHING LETTER TO COMMUNITY; CITY RESPONDS KEY WEST TO LOSE ASSISTED-LIVING UNITS AT POINCIANA GARDENS KEY WEST REMINDS RESIDENTS AND VISITORS TO NOT FEED THE CHICKENS ETHICS COMPLAINTS DISMISSED AGAINST TWO KEY WEST COMMISSIONERS KEY WEST WOMAN CHARGED FOR ALLEGEDLY POSSESSING QUEEN CONCH KEY WEST OFFICIALS VOTE TO PRESERVE & PROTECT PRIDE CROSSWALKS POLICE CHIEF SEAN BRANDENBURG MEETS WITH DEPUTY FBI DIRECTOR DAN BONGINO KEY WEST OFFICIALS DECLINE TO OPPOSE ALLIGATOR ALCATRAZ Already boasting the largest newspaper circulation in the Florida Keys, The Keys Weekly is the only locally-owned and operated publishing company in South Florida - and fastest growing! Facebook Instagram Spotify Twitter Youtube MARATHON WEEKLY 305.743.0844 9709 OVERSEAS HWY OLDE TOWNE CENTRE MARATHON, FL 33050 UPPER KEYS WEEKLY 305.363.2957 89240 OVERSEAS HIGHWAY, SUITE 2 TAVERNIER FL 33070 KEY WEST WEEKLY 305.453.6928 5450 MACDONALD AVENUE, NO. 5 KEY WEST, FL 33040 Keys Weekly’s Digital Marketing Agency: Transforming business goals into reality, one strategy at a time. Contact Advertise Podcast Subscribe to our Blast Statement of Ownership Subscribe To Our Newsletter Get Keys Weekly delivered right to your inbox along with a daily dose of Keys News. SUBSCRIBE! Success! Please check your email for confirmation."
    },
    {
      "url": "http://cityofkeywest-fl.gov/directory.aspx?did=6",
      "text": "Staff Directory • Building Department Skip to Main Content About Us FAQs Building Fees Utilization Report Search About Us Affidavits and Forms Permit Applications Monroe County Property Appraiser Military Service Members e-TRAKiT Submittal and Status Inspections Electronic Submittal Instructions on e-TRAKiT Contractors Best Practices for Weather Emergencies Florida Building Codes Code of Ordinances FEMA Flood Mitigation Grant Program Floodplain Management (FEMA) Verify your Florida Contractor Historic Preservation Division (HARC) DBPR State Licensed Contractor On-Line Form Application for AEC Contractor Authorization Contractor Licensing Competency Cards FAQs Building Fees Utilization Report Home Staff Directory Building Department Physical Address: 1300 White Street Key West, FL 33040 Mailing Address: P.O. Box 1409 Key West, FL 33041 Phone: 305-809-3956 Hours of Operation: Monday-Friday 7:30 AM - 4:30 PM Staff Name Title Email Phone Additional Phone Wright, Patrick Director of Growth Management 305-809-3877 Winterfield, Troy Chief Building Official 305 809-3943 Barter, Marybeth Senior Administrative Coordinator 305 809-3791 Lewis, Brandy Development Review Manager 305-809-3810 Castro, Sr., John Building Plans Reviewer 305 809-3732 Curry Hill, Gerzale Permit Technician 305 809-3972 Keane, Edward Plan Reviewer/Building Inspector 305 809-3735 Mobley, Patrick Permit Technician 305 809-3974 O&#39Dell, Terry Permit Technician 305 809-3738 Richardson, Terry Building Plans Reviewer 305 809-3969 Rahming-Woods, Anita Administrative Assistant II 305 809-3863 Wright, Tarin Plan Reviewer Mechanical Inspector 305-809-3961 Return to Staff Directory Live Edit Chief Building Official Troy Winterfield Send an email to the Chief Building Official Phone: 305 809-3943 More Information Marybeth Barter Senior Administrative Coordinator Send an email to the Building Department Phone: 305 809-3791 More Information Brandy Lewis Development Review Manager Send an email to the Development Review Manager Phone: 305-809-3810 More Information Building Department Physical Address 1300 White Street Key West , FL 33040 Mailing Address P.O. Box 1409 Key West , FL 33041 Phone: 305-809-3956 Directory Frequently Asked Questions (FAQs) Why do I need a Building Permit? What types of work need a Building Permit? Is the Permit Fee based on the price of the job? Who should I contact to close out a Building Permit? What work is unlawful without a Permit? How do I get a Building Permit? What are the requirements for owner builders? What is a Demolition Permit? How do I get an Electrical Permit? Why do I need a Mechanical Permit? How do I get a Mechanical Permit? Why do I need a Plumbing Permit ? /FAQ.aspx City Ordinances View our Code & Comprehensive Plan Verify Florida Contractors View DBPR database of licensed professionals Report a Concern Request a fix to your problem. Floodplain Management Review flood information. Agendas & Minutes View official meeting agendas & minutes. Live Meetings View what is airing now on KWCTV Contact Us Building Department 1300 White Street Key West, FL 33040 Phone: 305-809-3956 Payment Line: 305-809-3738 Email: the Building Department Directory Quick Links e-TRAKiT Permit Portal GovBuilt Licensing Payment Portal Staff Directory Employee Portal City Projects in Progress /QuickLinks.aspx Site Links Home Accessibility Copyright Notices Privacy Policy Site Map /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://sanddollarsports.com/about-us/",
      "text": "About Us - Sand Dollar Sports Dive Center Skip to content Cozumel, Mexico +52 9878761452 Home Activities Recreational Scuba Diving Private Dive Trips Discover Scuba Diving Scuba Diving Courses Reef Restoration Tour Snuba Snorkeling Dive Sites Amenities Cozumel Attractions Book Now Dive Packages DAN Dive Insurance Blog About Us Reef Restoration Program Sustainability Weather and Water Temperatures Underwater Images Recommended Hotels FAQs Contact Us Home Activities Recreational Scuba Diving Private Dive Trips Discover Scuba Diving Scuba Diving Courses Reef Restoration Tour Snuba Snorkeling Dive Sites Amenities Cozumel Attractions Book Now Dive Packages DAN Dive Insurance Blog About Us Reef Restoration Program Sustainability Weather and Water Temperatures Underwater Images Recommended Hotels FAQs Contact Us Book Now Sand Dollar Sports Dive Center Home » About Us SAND DOLLAR SPORTS Supporting sustainable tourism and protecting marine life Sand dollar sports A Legacy of Conservation in Cozumel's Marine Park Since its inception in 1996, Sand Dollar Sports has been a leading force in the preservation of Cozumel’s magnificent marine environment. We hold the distinction of being a founding member of the Cozumel Marine Park initiative, actively participating in the creation of the regulations that safeguard this underwater treasure. Our commitment extends beyond policy. In the wake of Hurricane Wilma’s devastation (2005), Sand Dollar Sports spearheaded a critical initiative. By strategically deploying 100 Reef Balls , representing a significant investment of over $40,000 USD, we fostered vital fish habitat and facilitated the restoration of the coral reef ecosystems. This impactful project resonated with local authorities, prompting a government contribution of 1 million pesos to further expand the artificial reef systems. Sand Dollar Sports remains steadfast in its dedication to sustainable water sports tourism practices. Over the past decade, we have prioritized environmental awareness and education for our valued guests. We do this through our Coral Reef Restoration Tour . This tour has been enjoyed by many who report it being a top experience while on the island. Meet John Flynn Founder • Conservationist • Leader in Sustainable Tourism John Flynn has been shaping sustainable tourism in Cozumel since 1990, when he left California to turn a dive operation into what is now Sand Dollar Sports—a pioneering, eco-conscious water sports company. With over 40 years in the industry, John has not only built a business but also led efforts to protect Cozumel’s coral reefs through education, collaboration, and hands-on conservation. John was directly involved in establishing the Marine Park in Cozumel. He has also partnered with over 20 non government organizations to work towards sustainable tourism, reef restoration, and preserving the beauty of Cozumel Island. John and his wife, Angelica are passionate about saving ecosystems for future generations to enjoy. 👉 Read John’s full story Mission At Sand Dollar Sports, we are stewards of Cozumel’s natural wonders. As a responsible water sports tour operator, we prioritize the protection of our vibrant marine environment. Through education and immersive experiences, we empower our guests to become mindful stewards themselves. By embracing sustainable tourism practices and leading by example, we aim to create a thriving economic future for Cozumel, one that is inextricably linked to environmental responsibility. Vision Sand Dollar Sports champions the preservation of our breathtaking underwater paradise. We fulfill this mission by educating guests on responsible tourism practices and fostering a deep appreciation for Cozumel’s unique marine environment. Through immersive scuba diving and snorkeling experiences, we empower our guests to become stewards of the reef, ensuring its continued health for generations to come. By leading by example and embracing sustainable practices, we strive to build a thriving tourism industry in Cozumel, one that is inextricably linked to the island’s environmental well-being. PROUD TO  BE A CERTIFIED PADI ECO CENTER A PADI Eco Center is a dive shop recognized for its exceptional commitment to environmental conservation and sustainable dive practices. These centers go beyond offering scuba training—they actively protect marine ecosystems through initiatives like reef cleanups, coral restoration, and eco-education. Being a PADI Eco Center means meeting high standards in conservation, community engagement, and ocean stewardship. PROTECTING CORALS REEFS THROUGH SUSTAINABLE TOURISM As a Green Fins Digital Member we strive to protect and conserve coral reefs by following environmental guidelines that promote a sustainable scuba diving and snorkeling industry. Our Partners Sand Dollar Sports is a PADI 5 Star scuba and water sports center in Cozumel that prioritizes environmental protection and education. We have over 40 years experience and prioritize your safety and enjoyment. Company About Us Reef Restoration Program Snuba Scuba Diving Snorkeling Sustainability Contact Us About Us Reef Restoration Program Snuba Scuba Diving Snorkeling Sustainability Contact Us Useful Satisfaction Guaranteed Refund and Safe Diving Policy Diving Medical Waiver Scuba and Snorkel Waiver Sand Dollar Sports Privacy Policy Blog Satisfaction Guaranteed Refund and Safe Diving Policy Diving Medical Waiver Scuba and Snorkel Waiver Sand Dollar Sports Privacy Policy Blog Contact Us Carretera Costera Sur Km. 3.2 C.P. 77622 San Miguel de Cozumel, Q.R. Mexico WhatsApp: (+52) 987 876 14 52 Facebook-f Instagram Youtube Sand Dollar Sports Typically replies within minutes during business hours Would you like more information about diving, snuba, snorkeling, or our PADI scuba courses? We'd love to help! WhatsApp Us 🟢 Online | Privacy policy WhatsApp us"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/FAQ.aspx?TID=15",
      "text": "FAQs • Building Department Skip to Main Content About Us FAQs Building Fees Utilization Report Search About Us Affidavits and Forms Permit Applications Monroe County Property Appraiser Military Service Members e-TRAKiT Submittal and Status Inspections Electronic Submittal Instructions on e-TRAKiT Contractors Best Practices for Weather Emergencies Florida Building Codes Code of Ordinances FEMA Flood Mitigation Grant Program Floodplain Management (FEMA) Verify your Florida Contractor Historic Preservation Division (HARC) DBPR State Licensed Contractor On-Line Form Application for AEC Contractor Authorization Contractor Licensing Competency Cards FAQs Building Fees Utilization Report Home FAQs Building Department Show All Answers 1. Why do I need a Building Permit? It is the law, and building permits can protect you.  With a building permit, you get the advice of reviewers and inspectors who review each phase of your project for approval, checking to see that the work is done per the Building Code, zoning, and the approved plans.  A building permit is required to show compliance with sanitary and life safety, assist in obtaining insurance coverage, and welfare concerns, including protection from unlicensed contracting. Working without a permit results in potential fines and cause problems when you sell your home.  More importantly, you lose the assurance that the work you're paying for is built to code, a minimum standard for safety. 2. What types of work need a Building Permit? Provided are a few examples of the types of Building Permits requested: Residential: Accessory structures such as sheds and gazebos Awnings and canopy Carports Decks (wood or concrete) Fences and walls Minor repairs, remodeling, and alterations One and two-story additions Patios Pools and spas Rehabilitation of existing structures Screened porch, patios, and enclosures Single Family Residence and Duplex Commercial: Awnings and canopies Change of owner or contractor Fences Interior and exterior signs Landscaping Minor repairs, remodeling, and alterations Paving and drainage 3. Is the Permit Fee based on the price of the job? Yes, from $24.00 to $36.00 per thousand.  Some permit fees are based on linear feet, such as fencing permits. 4. Who should I contact to close out a Building Permit? You can reach the Building Department at (305) 809-3956 or email the Permit Technicians at permittech@cityofkeywest-fl.gov. What factors affect closing out a permit? Closing a permit depends on several factors, including: The type of permit The age of the permit Whether any inspections have been completed If any additional requirements need to be met. If you need specific guidance on your permit, please contact the Building Department. 5. What work is unlawful without a Permit? Alteration of any building structure, any part thereof, equipment, device, or facility therein or thereon. To change a building's occupancy or use from one use group to another requires stronger egress, fire, and sanitary provisions. To change to an unauthorized or prohibited use. To install or alter any equipment for which provision is made or the installation is regulated by this code without first having applied and obtained a permit from the Chief Building Official, validated by payment thereof. 6. How do I get a Building Permit? Building permits are issued in the name of the person performing the work.  Only licensed contractors or owners/builders may obtain a permit, which is limited to the construction of one single-family residence or duplex. 7. What are the requirements for owner builders? Owner-builder applicants making an application for a building permit should be advised of the following provisions and requirements that apply to owner-builders: Proof of Ownership Before a building permit is issued to you, you must submit proof of ownership of the land concerned in the application in the form of a recorded deed showing you own the property or a copy of the mortgage or warranty deed of the land, showing you are obligated to purchase the property or a statement to contain the legal description of property and indicate the property is in your name. The legal description and name on the proof document must correspond to the name and legal description on the application.  Disclosure Statement State law requires construction to be done by a licensed contractor.  You have applied for a permit under an exemption to that law.  The exemption allows you, as the property owner, to act as your own contractor even though you do not have a license. You must supervise the construction yourself. You may not hire an unlicensed person as your contractor. If you sell or lease more than one building you have built within one year after the construction is complete, the law will presume that you built it for sale or lease, which violates this exemption. You may build or improve a one-family or two-family residence or a farm outbuilding.  You may also build or improve a commercial building at a cost of $25,000 or less.  The building must be done for your own use or occupancy.  It may not be built for sale or lease. Your construction must be done according to building codes and zoning regulations. It is your responsibility to ensure that people employed by you have licenses required by state law and county or municipal licensing ordinances. Insurance: You should be advised that your day labor employees cause any damage to persons or property, or if any of your day labor employees are injured on the job, you are liable. Your regular home insurance policy ordinarily does not cover this type of liability. Withholding Taxes, Etc.: You should be advised to investigate your responsibility for withholding Social Security, Federal and State Unemployment Insurance Taxes and Federal Income Taxes from the wages of employees working for you on the proposed construction, and for making returns thereof to the proper agencies. Restrictions for Owner-Builders: An owner-builder, subject to the foregoing provisions and requirements, is limited to constructing one single family or duplex residence each year for his/her own or erecting a one story building of not more than 500 square feet for commercial or industrial use, or adding a first floor addition of not more than 500 square feet to a commercial or industrial building; or maintenance or repairs and non-structural alterations, not to exceed $5,000 on any building which he/she owners or leases. Notice: Separate permits required for Electrical, Plumbing, Roofing, and Mechanical work. 8. What is a Demolition Permit? There are three types of demolition permits, namely, Full Demolition Permit: All full demolition permits are pulled by persons who are general contractors (State or County) with Specialty licenses in demolition or engineering. Partial Demolition Permit: All requirements for a full demolition permit apply, except it is unnecessary to notify the Utility companies.  The contractor shall get his electrical and plumbing contractors to pull proper permits for disconnections.  When the disconnection has already been done, the contractor shall state in writing that he is responsible for all disconnections.  Where the demolition involves the removal of any structural members, a shoring plan must be submitted.  The shoring plan must demonstrate how the remaining building portion will be supported.  The plans have to be signed and sealed by a professional engineer registered in the State of Florida. Exploratory Demolition Permit: This permit can only be issued to the contractor with the approval of the Building Official. It is issued for exploratory inspection to help the Contractor, Architect and/or Engineer determine the extent of the deterioration of the building. 9. How do I get an Electrical Permit? Electrical permits are issued in the name of the person performing the work.  Only licensed contractors or owners/builders may obtain a permit.  Owner/builder permits are limited to the construction of one single-family residence or duplex in which the owner resides. 10. Why do I need a Mechanical Permit? It is the law, and mechanical permits can also protect you.  With a mechanical permit, you get the advice of reviewers and inspectors who will approve each phase of your project, checking to see that the work is done per the Standard Mechanical Code, zoning laws, and the approved plans.  Additionally, a mechanical permit is required to show compliance with sanitary, safety, and welfare concerns, including required setbacks from property lines and adjacent structures. Working without a permit, when required, can result in fines and cause problems when you sell your home. More importantly, you lose the assurance that the work you're paying for is built to code, a minimum standard for safety. 11. How do I get a Mechanical Permit? Mechanical permits are issued in the name of the person performing the work.  Only licensed contractors or owners/builders may obtain a permit.  Owner/builder permits are limited to constructing one single-family residence or duplex. 12. Why do I need a Plumbing Permit ? It is the law, and plumbing permits can also protect you.  With a plumbing permit, you get the advice of reviewers and inspectors who will approve each phase of your project, checking to see that the work is done per the Standard Plumbing Code, zoning laws, and the approved plans.  Additionally, a plumbing permit is required to show compliance with sanitary, safety, and welfare concerns, including required setbacks from property lines and adjacent structures. Working without a permit, when required, can result in fines and cause problems when you sell your home. More importantly, you lose the assurance that the work you're paying for is built to code, a minimum standard for safety. 13. How do I get a Plumbing Permit? Plumbing permits are issued in the name of the person performing the work.  Only licensed contractors or owners/builders may obtain a permit, which is limited to the construction of one single-family residence or duplex. 14. What is an inspection? Once a permit has been issued and work has begun, the City’s inspectors perform inspections at intervals designated by the Building Code.  Simply stated, an inspection is required before concealing any part of the construction. The issued building permit will indicate the types of work that require inspections and when to call for one.  This permit must be displayed on the job site.  The contractor should call the Building Department when the stage of work indicated on the building permit has been completed. Failure to Comply with the inspection requirements could result in a request to dismantle any work beyond the inspection stage. To prevent inspection delays, we ask for your assurance that properly installed and visible signs appear on buildings. 15. When is a Certificate of Occupancy (C.O.) required? A Certificate of Occupancy (CO) is required for all new construction, additions, or when a change of use is desired. 16. When is a Certificate of Occupancy (C.O.) issued? The Building Department can issue a Certificate of Occupancy (CO) after all applicable final inspections are approved, all required documents are filed with the Building Department, and all applicable fees are paid.  Other required fees are for solid waste accounts and the establishment of sewer accounts.  These accounts are established with the Revenue Department of The City of Key West. For further information on required documents, please call the Building Department at 305-809-3956. 17. When is a Temporary Certificate of Occupancy issued? The Chief Building Official is authorized to issue a Temporary Certificate of Occupancy before the completion of the work covered by the permit, provided that such portion shall be occupied safely.  To obtain a Temporary Certificate of Occupancy, the applicant must submit a request to the Chief Building Official. 18. When is a Certificate of Completion issued? The permit holder requests a Certificate of Completion after final inspection for structures without occupancy. A Certificate of Completion is offered on the following permit types: Shell buildings Construction trailers Additions Demolitions Detached garages Exterior doors Fences Pools Sheds Screen rooms Vinyl siding Window replacements 19. What is a Condo Milestone Report? Per Florida Statutes 553.899(3)(a), a phase one milestone inspection for each applicable building must be completed within 180 days of receipt of a written notice from our Building Department via certified mail return receipt.  Within 14 days after receipt of written notice, the condominium or cooperative association must notify the unit owners of the required milestone inspection and provide the date the milestone inspection must be completed. The phase one milestone inspection report must be performed, signed, and sealed by a licensed State of Florida design professional (engineer or architect).  It must certify that the building is in a structurally sound condition or identify the areas that are suspected of not being structurally sound.  To address additional questions, call 305-809-3956 or email the building department at bldg@cityofkeywest-fl.gov 20. What is a Milestone Inspection? As defined in 110.9.2 of the Florida Building Code, “Milestone Inspection”  means a structural inspection of a building, including an inspection of load-bearing walls and the primary structural members and primary structural systems, as those terms are defined in s.  627.706, Florida Statutes, by a licensed architect or engineer authorized to practice in this state to attest to the life safety and adequacy of the structural components of the building and, to the extent reasonably possible, determining the general structural condition of the building as it affects the safety of such building, including a determination of any necessary maintenance, repair, or replacement of any structural component of the building. The purpose of such an inspection is not to determine whether an existing building's condition is in compliance with the Florida Building Code or the fire safety code. 21. What Code or Statute mandates the Milestone Inspection requirements? Florida Statutes 553.899, entitled “Mandatory structural inspections for condominium and cooperative buildings’ and the Florida Building Code 110.9, “Mandatory structural inspections for condominium and cooperative buildings.” 22. Who is Qualified to Perform a Milestone Inspection? A licensed architect or engineer authorized to practice in the State of Florida may complete a Milestone Inspection Report. 23. Which Buildings are Subject to a Milestone Inspection? Condominium and/or Cooperative association buildings meeting certain age and height criteria are subject to Milestone Inspection requirements, as Florida Statute 553.899 and Section 110.9 of the Florida Building Code require. 24. How is Building Age Determined? The age of a building is determined by the date the Certificate of Occupancy (CO) was issued. 25. When is the Deadline for a Milestone Inspection Report to be Submitted? In general, Phase I of the milestone inspection must be completed within 180 days after the owner or owners of the building receive written notice from the City. However, if a building reaches the applicable age before July 1, 2022, the building's initial milestone inspection must be performed before December 31, 2024.  If a building reaches the applicable age on or after July 1, 2022, and before December 31, 2024, the building's initial milestone inspection must be performed before December 31, 2025. 26. How Often Does a Milestone Inspection Need to be Conducted? The initial milestone inspection must be performed by December 31 of the year the building reaches thirty (30) years of age and every ten (10) years thereafter. However, if the building is within 3 miles of a coastline as defined in s. 376.031, Florida Statutes, the condominium association or cooperative association must have a milestone inspection performed by December 31 of the year the building reaches 25 years of age, based on the date the certificate of occupancy was issued, and every 10 years thereafter. 27. Can I Access a Copy of My Condominium Association's Milestone Inspection Report? Milestone Inspection Reports are public records and may be requested through the Public Records Request Center . 28. What do I do if the Milestone Inspection Report Indicates a Phase II Inspection is Required? If the Milestone Inspection Report shows that a Phase II inspection is needed, a qualified professional must carry it out.  This inspection will include more detailed analysis, testing, and data collection.  A Phase II progress report must be submitted to the City of Key West Building Department within 180 days of the Phase I report. 29. Is There a Deadline for Milestone Repairs? Identified repairs within the Phase II report must begin within 365 days after receiving the Phase II report. 30. Who May I Contact for Additional Information on Milestone Inspections? The City of Key West Building Department can help with additional information about milestone inspections.  Please email the Building Department staff at bldg@cityofkeywest-fl.gov or call at 305-809-3956. Module Search Enter Search Terms All Categories Bikes on Buses (BOB) Building Department Building Height Exception Bulk Waste Code Enforcement Elevation Certificates Emergency Management - About US Emergency Management - Tropical Storms & Hurricanes Engineering-Rights-of-Way and Sidewalks Flood Insurance Garbage Collection General Employee's Retirement Plan DROP Program Historic Building Exemption Historic Key West Cemetery Historic Preservation Division (HARC) Household Hazardous Waste Human Resources Information Technology Key West Connect powered by SeeClickFix Key West Department of Transportation (KWDoT) Key West Rides, an On-Demand City Bus Service Letter of Map Amendment (LOMA) Licensing Division Major Parks & Facilities Mayor's Office Parking - Residential Parking Permit Parking Department Planning Department Police Department - Recruitment Records Management Recycling Special Events Special Magistrate Stormwater Substantial Improvement Yard Waste Categories All Categories Bikes on Buses (BOB) Building Department Building Height Exception Bulk Waste Code Enforcement Elevation Certificates Emergency Management - About US Emergency Management - Tropical Storms & Hurricanes Engineering-Rights-of-Way and Sidewalks Flood Insurance Garbage Collection General Employee's Retirement Plan DROP Program Historic Building Exemption Historic Key West Cemetery Historic Preservation Division (HARC) Household Hazardous Waste Human Resources Information Technology Key West Connect powered by SeeClickFix Key West Department of Transportation (KWDoT) Key West Rides, an On-Demand City Bus Service Letter of Map Amendment (LOMA) Licensing Division Major Parks & Facilities Mayor's Office Parking - Residential Parking Permit Parking Department Planning Department Police Department - Recruitment Records Management Recycling Special Events Special Magistrate Stormwater Substantial Improvement Yard Waste Live Edit Chief Building Official Troy Winterfield Send an email to the Chief Building Official Phone: 305 809-3943 More Information Marybeth Barter Senior Administrative Coordinator Send an email to the Building Department Phone: 305 809-3791 More Information Brandy Lewis Development Review Manager Send an email to the Development Review Manager Phone: 305-809-3810 More Information Building Department Physical Address 1300 White Street Key West , FL 33040 Mailing Address P.O. Box 1409 Key West , FL 33041 Phone: 305-809-3956 Directory Frequently Asked Questions (FAQs) Why do I need a Building Permit? What types of work need a Building Permit? Is the Permit Fee based on the price of the job? Who should I contact to close out a Building Permit? What work is unlawful without a Permit? How do I get a Building Permit? What are the requirements for owner builders? What is a Demolition Permit? How do I get an Electrical Permit? Why do I need a Mechanical Permit? How do I get a Mechanical Permit? Why do I need a Plumbing Permit ? /FAQ.aspx City Ordinances View our Code & Comprehensive Plan Verify Florida Contractors View DBPR database of licensed professionals Report a Concern Request a fix to your problem. Floodplain Management Review flood information. Agendas & Minutes View official meeting agendas & minutes. Live Meetings View what is airing now on KWCTV Contact Us Building Department 1300 White Street Key West, FL 33040 Phone: 305-809-3956 Payment Line: 305-809-3738 Email: the Building Department Directory Quick Links e-TRAKiT Permit Portal GovBuilt Licensing Payment Portal Staff Directory Employee Portal City Projects in Progress /QuickLinks.aspx Site Links Home Accessibility Copyright Notices Privacy Policy Site Map /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/318/Planning-Department",
      "text": "Planning Department | Key West, FL Skip to Main Content Your Government Visitors City Departments Our Community Doing Business Search Applications & Forms Current Planning Projects Mallory Square Project, Brighten the Square! History of Mallory Square Online Application Information E-TRAKiT Submittal and Status Planning Fee Schedule DRC Meeting Dates, and Application Deadlines HARC Meeting Dates, and Application Deadlines Planning Board Meeting Dates, and App. Deadlines Tree Commission Meeting Dates, and App. Deadlines Building Permit Allocation System (BPAS) Alternatives to BPAS Annual Allocation Schedule Background Development Subjected to BPAS Point System for Optional Credits Prerequisites Recovered Units, Penalties & Enforcement What Happens After BPAS Award Comprehensive Plan Key West Land Use Map Transient Rental Transfer Locations Zoning Map Map of the Historic District Land Development Regulations Key West Fair Housing & Equal Opportunity Act Home City Departments Planning Department Planning Department The City of Key West is one of the world's most remarkable urban environments.  Its historic streetscapes, unique culture, and beautiful environment are a magnet for residents and visitors.  Maintaining and improving the fabric of the city is one of the most important tasks of the Planning Department.  The Department works with the community to craft policy documents, such as the adopted Comprehensive Plan, that guide future actions.  We also work to create regulations to implement policy directives through the adopted Land Development Regulations ( LDR s).  On a day-to-day basis, our staff meets with the public to help interpret regulations, explain development approval processes, and discuss specific projects. Meet with a Planner Make an appointment to meet with a planner from 9:00 AM to 4:00 pm Monday through Friday. Boards & Committees Agendas, minutes, and packets for the following boards can be accessed through Legistar : Art in Public Places ( AIPP ) Development Review Committee ( DRC ) Historic Architectural Review Commission ( HARC ) Planning Board Tree Commission Upcoming Meetings Thu, Sep. 11 Special City Commission (sitting as Naval Properties LRA) meeting Thu, Sep. 11 Special City Commission meeting - Budget Hearing Tue, Sep. 16 Tree Commission meeting Thu, Sep. 18 Planning Board meeting Tue, Sep. 23 Historic Architectural Review Commission (HARC) meeting Thu, Sep. 25 Development Review Committee (DRC) meeting Thu, Sep. 25 Special City Commission meeting - Budget Hearing Thu, Oct. 9 City Commission meeting - Morning Session Thu, Oct. 9 City Commission meeting - Evening session Wed, Oct. 15 Art in Public Places Advisory Board meeting Thu, Oct. 16 Planning Board meeting Tue, Oct. 21 Tree Commission meeting Thu, Oct. 23 Development Review Committee (DRC) meeting Tue, Oct. 28 Historic Architectural Review Commission (HARC) meeting Wed, Nov. 5 City Commission meeting - Morning session /Calendar.aspx Acting City Planner James Singelyn Email the Planning Staff Phone: 305-809-3884 More Information Mercedes Herrada Administrative Specialist Email the Planning Staff Phone: 305-809-3764 More Information Planning Department Email the Planning Department Physical Address 1300 White Street Key West , FL 33040 Mailing Address P.O. Box 1409 Key West , FL 33041 Directory FAQs Where can I find the City's Code of Ordinances and Land Development Regulations (LDRs)? To access the City’s code, click Code of Ordinances and the Land Developments Regulations . In what zoning district is my property located? View the zoning map (PDF) to view where your property is located. What can I do with my property? The use of your property is determined by the zoning district’s Permitted and Conditional Uses. Once you have identified the zoning district of the property, zoning regulations can be found under Section 122 of the Land Development Regulations ( LDR s) . How can I rent my property transiently? Your property can be rented transiently if it is in a zoning district that allows for this use. Those districts are HRCC -1, HRCC -3, HCT , HNC -1 and HNC -3. Redevelopment or conversion of permanent housing to transient or other commercial uses shall be permitted only if no on-site reduction of permanent housing occurs within the HNC -1 and 3 districts. Please contact our Department for further clarification 305-809-3720. How many dwelling units are associated with my property? Each zoning district has a density calculation for the number of units allowed per acre.  Please contact our Department at 305-809-3764 to determine the number of legal units associated with your property. Can I subdivide my property to create a new lot? A property may be subdivided so long as the lots created through the subdivision meet the minimum lot size per the zoning district requirements. Additional information can be found in the City’s Code of Ordinances, Land Development Regulations (LDRs) under Chapter 118. What is required to build an addition on my house? The addition shall meet the zoning district’s dimensional requirements to building coverage, impervious surface ratio and setbacks. Construction will require building and site plans prepared by a registered architect or engineer and be approved and permitted by the Building Department. If your property is under HARC jurisdiction, the proposed addition would also need to meet the Historic Architectural Design Guidelines. Do I need a building permit or other permits to erect a fence, shed or other accessory structure? Yes, please see the City’s Code of Ordinances, Land Development Regulations (LDRs) Section 122-1181 through 122-1187. Who do I contact if I believe unpermitted construction is occurring? Code Compliance can be reached at 305-809-3740. What are the sign regulations for my business? Sign regulations vary depending upon location within a particular zoning district. If your business is in the historic district, regulations can be found on pages 49-50w of the Historic Architectural Design Guidelines . /FAQ.aspx Agendas & Minutes View official meetings & submit eComment Careers View open positions Parking Pay your citation online Live Meetings View what is airing now on KWCTV City Ordinances View our Code & Comprehensive Plan Key West Transit View Bus times and schedules Contact Us 1300 White Street Key West, FL 33040 305-809-3945 Email: Webmaster Social Media Facebook Instagram LinkedIn /QuickLinks.aspx Quick Links e-TRAKiT Permit Portal GovBuilt Licensing Payment Portal Staff Directory Employee Portal City Projects in Progress /QuickLinks.aspx Site Links Home Accessibility Copyright Notices Privacy Policy Site Map /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cityofkeywest-fl.gov/1124/About-Us",
      "text": "About Us | Key West, FL Skip to Main Content About Us Stormwater Solid Waste Management Wastewater Treatment Plant Search About Us Stormwater Pollution In Our Oceans 2024 Stormwater Master Plan Florida Healthy Beaches Florida Keys Nearshore Water Quality Monitoring Solid Waste Management Garbage Collection FAQs for Garbage Collection Recycling FAQs on Recycling Commercial Recycling Weekend Commercial Recycling What is Bulk Waste?  How do I get it picked up? FAQs on Bulk Waste First Saturdays for Household Hazardous Waste FAQs on Household Hazardous Waste Transfer Station Hours Of Operation / Tipping Rates Yard Waste FAQs on Yard Waste Stock Island Landfill Wastewater Treatment Plant Home City Departments Utilities Department About Us About Us Mission Statement: The Utilities Department's mission is to collaborate with Key West's ratepayers and taxpayers to implement best practices for stormwater management, tidal flooding prevention, and solid waste management, ensuring the health and safety of residents.  Our team is dedicated to delivering excellent customer service while safeguarding the public, supporting our community, and promoting the city as a top tourist destination. About Us The General Services (Utilities) Department includes the following divisions: Waste Water, Storm Water, and Solid Waste, as well as managing the city's Solid Waste and Hauling Contracts with Waste Management, Inc.  The Department also includes the Richard A. Heyman Environmental Pollution Control Facility (Waste Water Treatment Plant), which is operated by Jacobs, the City of Key West Solid Waste Transfer Station on Rockland Key, which is operated by Waste Management, Inc., and the Stock Island Landfill, which has been closed since 1992. Rate Studies The Utilities Director is responsible for annual sewer, stormwater, and solid waste rate studies.  The rate studies and budgets are traditionally presented to the City Commission in July.  The Utilities Department is at City Hall, 1300 White Street, Key West, FL 33040.  The Solid Waste Transfer Station is located at MM 9 on Rockland Key and can be found at 161 Toppino Industrial Drive, Highway (US-1), Rockland Key. Awards Key West's wastewater and stormwater system has garnered numerous top awards from the Florida Water Environment Association, including First Place in the Advanced Secondary Treatment category and the 2012 Operational Performance Excellence Award. MasterPlan The City of Key West has a Solid Waste Master Plan for the City.  This plan aims to create a map to guide the City towards increasing our recycling rate, maximizing our waste diversion, and creating a pathway towards a zero-waste community. If you have a question about your sewer, solid waste, or storm water billing, please get in touch with us at 305-809-3721, or you are also welcome to stop by our office at: 1300 White Street Key West, FL 33040 Hours Monday through Friday 8 AM to 5:00 PM Sewer Jacobs 305-292-5100 Water The Florida Keys Aqueduct Authority (FKAA) is independent of the City Government, providing potable water for all Florida Keys.  Please get in touch with FKAA at 305-296-2454. Electricity Keys Energy Services is independent of the City Government, providing electricity for the City of Key West.  Please get in touch with Keys Energy at 305-295-1000. Garbage Waste Management, Inc. provides waste management services, including collection, transfer, recycling, resource recovery, and disposal services, and operates waste-to-energy facilities.  The Company serves North American municipal, commercial, industrial, and residential customers. Please get in touch with Waste Management at 305-296-8297 Director of Utilities Matt Willman E-mail the Utilities Department Phone: 305-809-3721 Physical Address 1300 White Street Key West , FL 33040 Mailing Address P.O. Box 1409 Key West , FL 33041 Phone: 305-809-3906 Fax: 305-809-3978 Staff Directory Hours of Operation: Monday-Friday 8:00 AM - 5:00 PM Disability Discount Application Disability Discount Application (PDF) Utility Resources University of Florida Best Practices for Home Lawn University of Florida Home Lawn Care Report a Concern Request a fix to your problem. Household Waste Responsibly dispose of hazardous waste and electronics. Yard Waste Get your yard waste picked up. Recycling Read guidelines about recycling. Garbage Find out when your pick-up day is. GIS See maps. Contact Us Utilities Department 1300 White Street Key West, FL 33040 Phone: 305-809-3906 E-mail the Utilities Department Staff Directory Quick Links e-TRAKiT Permit Portal GovBuilt Licensing Payment Portal Staff Directory Employee Portal City Projects in Progress /QuickLinks.aspx Site Links Home Accessibility Copyright Notices Privacy Policy Site Map /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://cozumelparks.com/en/contact/",
      "text": "Contact | Cozumel Parks Facebook X RSS Transparencia Formatos de Solicitud Armonización Contable Artículo 131 Denuncias por Incumplimientos Parks Chankanaab Punta Sur San Gervasio Cozumel Museum About Us Contact Gallery Español Select Page Parks Chankanaab Punta Sur San Gervasio Cozumel Museum About Us Contact Gallery Español Contact Where will you spend the day? Park Chankanaab Punta Sur Cozumel Museum Date Where will you spend the day? Park Chankanaab Punta Sur Cozumel Museum Date Tourist information Phone 1: (52)987-87-21522 Phone 2: (52)987-87-20093 E-mail: mercadotecnia@cozumelparks.org reservas@cozumelparks.org Cozumel Parks Facebook: Cozumel Parks Twitter: @CozumelParks1 Instagram: @CozumelParksofficial E-mail: mercadotecnia@cozumelparks.org reservas@cozumelparks.org Fundación de Parques y Museos Facebook: Fundación de Parques y Museos de Cozumel Twitter: @FPMCOZUMEL Instagram: @FPMCQROO E-mail: mercadotecnia@cozumelparks.org reservas@cozumelparks.org Dirección oficina: Av. Pedro Joaquín Coldwell entre 1 y Juárez, Colonia Centro. Cozumel, Quintana Roo. México C.P. 77600 Send us a message Name * Email Address * City Message 0 / 180 Submit ¡No lo pienses más y obtén tus entradas! Comprar Boletos Av. Pedro Joaquin Coldwell #70 Col. Centro C.P. 77600 Cozumel Quintana Roo, México.. (987) 87 21522 | (987) 87 20093 | reservas@cozumelparks.org | mercadotecnia@cozumelparks.org Quienes Somos Fundacion de Parques y Museos de Cozumel Testimoniales Mapa del Sitio Avisos de Privacidad Prensa © Cozumel Parks 2017. Todos los derechos reservados."
    },
    {
      "url": "https://www.park-royalhotels.com/en/contact.html",
      "text": "Contact Park Royal Hotels & Resorts 1 800 890 3798 MX: 800 872 7275 BR +55 (11) 52420710 Vacation Club MX - 5556 27 8880 Vacation Club US & CAN 1 800 808 2329 Royal Planet Online Check-in EN ES PT Hotels & Resorts Destinations Mexican Caribbean Mexican Pacific USA Argentina Puerto Rico All our Hotels & Resorts Grand Park Royal Cancun Grand Park Royal Cozumel Grand Park Royal Puerto Vallarta Royal Select at Grand Park Royal Cancún Adults Only Park Royal Beach Acapulco Grand Reopening Park Royal Beach Cancun Park Royal Beach Huatulco Park Royal Beach Ixtapa Park Royal Beach Mazatlán Park Royal City Buenos Aires Park Royal Miami Beach Park Royal Orlando Park Royal Homestay Los Cabos Park Royal Homestay Club Cala Puerto Rico See all hotels & resorts By brand Weddings Wellness Events Offers Gallery Blog Book here -The best price guaranteed- Hotels Hotel + Flight 1 800 890 3798 MX: 800 872 7275 BR +55 (11) 52420710 Vacation Club MX - 5556 27 8880 Vacation Club US & CAN 1 800 808 2329 Select origin airport Origin airport Select the hotel Hotel Grand Park Royal Cancun Grand Park Royal Cozumel Royal Select at Grand Park Royal Cancún Park Royal Beach Cancun Grand Park Royal Puerto Vallarta Park Royal Beach Acapulco Park Royal Beach Huatulco Park Royal Beach Ixtapa Park Royal Beach Mazatlán Park Royal Homestay Los Cabos Park Royal City Buenos Aires Park Royal Miami Beach Park Royal Orlando Park Royal Homestay Club Cala Puerto Rico Mexican Caribbean Grand Park Royal Cancun Grand Park Royal Cozumel Royal Select at Grand Park Royal Cancún Park Royal Beach Cancun Mexican Pacific Grand Park Royal Puerto Vallarta Park Royal Beach Acapulco Park Royal Beach Huatulco Park Royal Beach Ixtapa Park Royal Beach Mazatlán Park Royal Homestay Los Cabos Argentina Park Royal City Buenos Aires USA Park Royal Miami Beach Park Royal Orlando Puerto Rico Park Royal Homestay Club Cala Puerto Rico Hotels highlights Cancún, México Grand Park Royal Cancun Cozumel, Mexico Grand Park Royal Cozumel Puerto Vallarta, Mexico Grand Park Royal Puerto Vallarta Acapulco, Mexico Park Royal Beach Acapulco Next Check-In Check-Out Occupancy 2/0/0 %total_adults/%total_kids/%total_babies Select the number of occupants You are going to book your stay in with stay of of to the of Adults Children (7 - 12 years) infants (0 - 6 years) + Add new room Adults Children (7 - 12 years) infants (0 - 6 years) + Add new room - Delete room Adults Children (7 - 12 years) infants (0 - 6 years) - Delete room Book now! Book here -The best price guaranteed- Improve your experience by adding the flight to your stay See another airport Book flight and hotel Step 1 of 3 — Select Hotel and Destination Step 2 of 3 — Choose the dates Step 3 of 3 — Select the occupation and apply promotions Do not leave with doubt! We are in contact Do you need help with your next vacation? The Park Royal Hotels & Resorts team is happy to answer your questions… Don't be left wondering! The best vacations in Mexico, the United States, Puerto Rico and Argentina are at Park Royal. Home / Contact See all contacts Hotel Grand Park Royal Cancun Blvd. Kukulcán km 10.5, 77500. Cancún, Quintana Roo, México reservationscaribe@park-royalhotels.com reservationscaribe2@park-royalhotels.com MEX: +52 998 848 7800 | USA & CAN: 1 800 890 3798 Hotel Grand Park Royal Cozumel Carretera a Chankanaab Km. 3.5, B Zona Sur, 77600. Cozumel, Quintana Roo- México reservationscaribe@park-royalhotels.com reservationscaribe1@park-royalhotels.com MEX: +52 998 848 7800 | USA & CAN: 1 800 890 3798 Hotel Grand Park Royal Puerto Vallarta Carretera a Barra de Navidad Km. 8.5 Zona Hotelera Sur, 48390. Puerto Vallarta, Jalisco, México reservationspacific1@park-royalhotels.com ventasprv@park-royalhotels.com MEX: +52 322 226 88 00 | USA & CAN: 1 800 890 3798 Hotel Park Royal Beach Acapulco Av. Costera Guitarrón 110 Fracc. Brisas Guitarrón, 39880. Acapulco, Guerrero, México reservationspacific1@park-royalhotels.com ventasprv@park-royalhotels.com MEX: (744) 440 6565 | USA & CAN: 1 800 890 3798 Hotel Park Royal Beach Cancun Blvd. Kukulcán km 12.5 Lt. 18 Fracc. 1-B, 77500. Cancún, Quintana Roo, México reservationscaribe@park-royalhotels.com reservationscaribe3@park-royalhotels.com MEX: +52 998 848 7800 | USA & CAN: 1 800 890 3798 Hotel Park Royal Beach Huatulco Blvd. Benito Juarez #8, Bahía de Tangolunda, Bahía de Huatulco, 70989. Huatulco, Oaxaca, México jsanchez@park-royalhotels.com MEX: +52 958 689 0015 | USA & CAN: 1 800 890 3798 Hotel Park Royal Beach Ixtapa Blvd. Ixtapa Lote 5-A, Zona Hotelera I, 40884. Zihuatanejo, Guerrero, México reservationspacific2@park-royalhotels.com reservationsixt1@park-royalhotels.com MEX: +52 755 55 5 05 50 | USA & CAN: 1 800 890 3798 Hotel Park Royal Beach Mazatlan Av. Sábalo Cerritos 3110, Marina Mazatlán, 82100 Mazatlán, Sin., México reservationsixt1@park-royalhotels.com MEX: +52 755 55 5 05 50 | USA & CAN: 1 800 890 3798 Hotel Park Royal City Buenos Aires Calle Suipacha 1092, C1008AAV. Buenos Aires, Argentina callcenter@park-royalhotels.com +54 11 4320 3607 / 3600 | Call center - MEX: 800 872 7275 | USA & CAN: 1 800 890 3798 Hotel Park Royal Miami Beach 6495 Indian Creek Dr, 33141-5804. Miami Beach, Florida, EE.UU callcenter@park-royalhotels.com +54 11 4320 3607 / 3600 | Call center - MEX: 800 872 7275 | USA & CAN: 1 800 890 3798 Hotel Park Royal Orlando 1500 N Thacker Ave, Kissimmee, 34741. Orlando, Florida, EEUU callcenter@park-royalhotels.com +54 11 4320 3607 / 3600 | Call center - MEX: 800 872 7275 | USA & CAN: 1 800 890 3798 Hotel Park Royal Homestay Club Cala Puerto Rico 50 Club Cala Dr, 00791. Humacao, Puerto Rico callcenter@park-royalhotels.com MEX: 800 872 7275 | USA & CAN: 1 800 890 3798 Hotel Park Royal Homestay Los Cabos Retorno Playa Añuiti No. 27, Colonia Campo de Golf, 23400. Los Cabos, Baja California Sur, México reservationspacific1@park-royalhotels.com ventasprv@park-royalhotels.com MEX: (624) 142 1177 | USA & CAN: 1 800 890 3798 See map From the cinema to your table: discover the Bubba Art and museums in Buenos Aires Want to stay up to date with the latest from Park Royal Hotels & Resorts? Take a look at our blog to find out all the news of interest about our hotels and how to make the most of your vacation. Visit our blog Our four brands are a reflection of the unique experience that each traveler will live, they will be the ideal option to live vacation experiences surrounded by joy, fun and rest."
    },
    {
      "url": "https://cozumelparks.com/en/about-us/",
      "text": "About Us | Cozumel Parks Facebook X RSS Transparencia Formatos de Solicitud Armonización Contable Artículo 131 Denuncias por Incumplimientos Parks Chankanaab Punta Sur San Gervasio Cozumel Museum About Us Contact Gallery Español Select Page Parks Chankanaab Punta Sur San Gervasio Cozumel Museum About Us Contact Gallery Español About Us Where will you spend the day? Park Chankanaab Punta Sur Cozumel Museum Date Where will you spend the day? Park Chankanaab Punta Sur Cozumel Museum Date Did You Know? That every entrance fee contributes in maintaining and creating a varity of social and ecological programs that benefit Cozumel island? Thank you for your support! Visit www.fpmc.qroo.gob.mx for more information History Cozumel Parks “Cozumel Parks” is the trademark for the Foundation of parks and museums of Cozumel who manages “Chankanaab Park”, “Punta Sur” Ecological Park, “San Gervasio” archaeological site and “El Museo de la Isla” museum with the purpose of generating resources to be invested in education, social, cultural, and environmental conservation programs for community development. The creation of the patronage named “Laguna de Chankanaab” in 1983 resulted from the effort and participation from the people of Quintana Roo, mainly Cozumel and its objective was the recovery of the lagoon, guaranteeing the development and survival of marine and terrestrial species of flora and fauna. On February 20, 1987 the governor of Quintana Roo state Lic. Pedro Joaquin Coldwell after the administrative success of “Chankanaab” issued the decree to create the “Fundacion de Parques y Museos de Cozumel” foundation, attaching to it the “El Museo de la Isla” museum with the purpose of having a space for the rescue, promotion and diffusion of the cultural and historical heritage of Cozumel therefore sponsoring the reconstruction of the former “Hotel Playa” building.. In 1994 the State Government granted to this agency the management of the cultural and service area of “San Gervacio” archaeological site. After two years, in 1996 The “Punta Sur” Ecological Park was given to this foundation for its management when by decree it became an ecological conservation zone and state refuge for flora and fauna “Laguna Colombia” ¡No lo pienses más y obtén tus entradas! Comprar Boletos Av. Pedro Joaquin Coldwell #70 Col. Centro C.P. 77600 Cozumel Quintana Roo, México.. (987) 87 21522 | (987) 87 20093 | reservas@cozumelparks.org | mercadotecnia@cozumelparks.org Quienes Somos Fundacion de Parques y Museos de Cozumel Testimoniales Mapa del Sitio Avisos de Privacidad Prensa © Cozumel Parks 2017. Todos los derechos reservados."
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.parkroyalcozumel.com/contact_us.asp",
      "text": "Park Royal Cozumel - Cozumel Hotel - Park Royal Cozumel Vacation Specials  - Contact Us Grand Park Royal Cozumel All Inclusive Beach Resort Cozumel, Mexico 1 (888) 774 0040 or (305) 774 0040 Book now! Number of persons Number 0 Persons 0 Rooms Occupation is incorrect Date of arrival Arrival Arrival date empty INCORRECT DATE Date of departure Departure Departure date empty INCORRECT DATE Search Resorts Park Royal Cancun Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa Accommodations Restaurants & Bars All Inclusive Details Home Resorts Park Royal Cancun Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa + Accommodations Restaurants & Bars All Inclusive Details Gallery Weddings Contact Us Home Weddings Gallery Contact Us All Inclusive: The All-Inclusive Plan at Grand Park Royal Cozumel is ideal for guests who want a peaceful vacation with all the perks: drinks, food, activities, sports and a range of other services. Contact Us Vacation Store Miami offers All Inclusive Vacations at unbelievable discounts on an extensive selection of resorts in the Caribbean. Let our professional staff help you find your perfect family vacation, weekend getaway, spring break vacation or that special honeymoon. Why choose Vacation Store Miami? Guaranteed best prices on Caribbean Vacations. Over 15 years of experience. Did we mention BEST PRICES? Satisfying our Guests is our principal aim. Therefore we would like to facilitate the reservations process with our telephone reservations service. If you need help, contact us by phone or EMAIL US Call Us Nationally at 1 (888) 774 0040 or (305) 774 0040 EMAIL US Phone: 1 (888) 774 0040 or (305) 774 0040 Vacation Store Miami® -  All Inclusive Resort â Call us Toll Free at 1 (888) 774 0040 or (305) 774 0040 Park Royal Cancun Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa ®Vacation Store Miami Accommodations Restaurants & Bars All Inclusive Contact Us"
    },
    {
      "url": "https://www.joonsquareusa.com/water-park/cozumel-park-monroe-fl",
      "text": "Cozumel Park in Key West, Monroe -  Water Park | Joonsquare USA List Your Business Login Register Visit Explore Monroe FL Park Water Park Museums Login Register Explore Monroe FL Park Water Park Museums List Your Business Social Links 0 0 Go Back Florida Monroe Water Park Cozumel Park Cozumel Park Key West, Monroe Share × Cozumel Park Share This Business Click Below to Share this Business with your Friends, Clients and other Contacts. Save × Please login to Save this business. Login Close × Please login to report this business. Login Close 07:00 AM - 11:00 PM Wednesday Send Enquiry Call Map Location Review 3+ 3+ Like 251 Views You can search for other Businesses Near  Key West Water Park Park Reviews about the Cozumel Park. Click To Review Upload Image Cozumel Park Contact Details: Address : 1208 19th Terrace, Key West, Monroe, Florida, USA, 33040 Phone No. : 3058093700 Email : info@cozumelpark.com Official website : https://www.cityofkeywest-fl.gov/Facilities/Facility/Details/Cozumel-Park-14 Share this Business with others: Send Your Enquiry Get response from other Businesses Also. Feedback Send Enquiry Location Click Here to Search for more Water Park Near Key West × Working Hours Monday 07:00 AM - 11:00 PM Open Tuesday 07:00 AM - 11:00 PM Open Wednesday 07:00 AM - 11:00 PM Open Thursday 07:00 AM - 11:00 PM Open Friday 07:00 AM - 11:00 PM Open Saturday 07:00 AM - 11:00 PM Open Sunday 07:00 AM - 11:00 PM Open Water Park Near Key West × Cozumel Park Response Within 24 Hours. Get response from other Businesses Also × Cozumel Park Book Appointment Online in Advance. Select Appointment Date Choose Time Slot Choose Time Morning Slot 10:15 AM 10:30 AM 10:45 AM 11:00 AM 11:15 AM 11:30 AM 11:45 AM Afternoon Slot 12:00 PM 12:15 PM 12:30 PM 12:45 PM 01:00 PM 01:15 PM 02:00 PM 02:15 PM 02:30 PM 02:45 PM 03:00 PM 03:15 PM 03:30 PM 03:45 PM Evening Slot 04:15 PM 04:30 PM 04:45 PM 05:00 PM 05:15 PM 05:30 PM 05:45 PM Get Confirmation from Business on Mobile No. × Cozumel Park . Please Give Feedback. × Cozumel Park . Response In Only 30 minutes. --Select --- Voilence Harassment Spam Copyrighted browse by state Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa kansas Kentucky Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Louisiana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Company About Joonsquare Jobs Blogs Press Promote Business Online Publish a Business Terms & Conditions Reviews Content Guidelines Advertise with Joonsquare More Customer Support Privacy Policy Terms of Services FAQ Follow Us Facebook Twitter Youtube Copyright 2024 © All rights reserved by Joonsquare USA"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.grandparkroyalcozumel.com/contact_us.asp",
      "text": "Grand Park Royal Cozumel â Cozumel â Park Royal Cozumel All Inclusive Resort  - Contact Us Grand Park Royal Cozumel All Inclusive Beach Resort Cozumel, Mexico 1 (888) 774 0040 or (305) 774 0040 Book now! Number of persons Number 0 Persons 0 Rooms Occupation is incorrect Date of arrival Arrival Arrival date empty INCORRECT DATE Date of departure Departure Departure date empty INCORRECT DATE Search Resorts Park Royal Cancun The Villas Cancun by Grand Park Royal Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa Park Royal Puerto Vallarta Accommodations Restaurants & Bars All Inclusive Details Home Resorts Park Royal Cancun The Villas Cancun by Grand Park Royal Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa Park Royal Puerto Vallarta + Accommodations Restaurants & Bars All Inclusive Details Gallery Weddings Contact Us Home Weddings Gallery Contact Us All Inclusive: The All-Inclusive Plan at Grand Park Royal Cozumel is ideal for guests who want a peaceful vacation with all the perks: drinks, food, activities, sports and a range of other services. Contact Us Vacation Store Miami offers All Inclusive Vacations at unbelievable discounts on an extensive selection of resorts in the Caribbean. Let our professional staff help you find your perfect family vacation, weekend getaway, spring break vacation or that special honeymoon. Why choose Vacation Store Miami? Guaranteed best prices on Caribbean Vacations. Over 15 years of experience. Did we mention BEST PRICES? Satisfying our Guests is our principal aim. Therefore we would like to facilitate the reservations process with our telephone reservations service. If you need help, contact us by phone or EMAIL US Call Us Nationally at 1 (888) 774 0040 or (305) 774 0040 EMAIL US Phone: 1 (888) 774 0040 or (305) 774 0040 Grand Park Royal Cozumel - All Inclusive Resort â Call us Toll Free at 1 (888) 774 0040 or (305) 774 0040 Park Royal Cancun The Villas Cancun by Grand Park Royal Park Royal Cozumel Park Royal Acapulco Park Royal Grand Park Royal Huatulco Park Royal Ixtapa Park Royal Puerto Vallarta ®Vacation Store Miami Accommodations Restaurants & Bars All Inclusive Contact Us"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Datenschutz Surname name First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://deepbluecozumel.com/contact-us/",
      "text": "Contact us - Deep Blue Cozumel Skip to main content Skip to footer Diving For certified divers Dive Packages Advanced Cozumel diving Private Charters Cruise Ship Divers Cozumel dive sites Equipment Rentals Courses All our courses Discover Scuba Refresher Course Open Water Diver Continued Education Advanced Open Water Emergency First Responder Rescue Diver Diving Specialties Other activities Snorkeling Cenotes Whale Shark tour Freediving Hotel/Dive Packages About Discover Cozumel Our dive shop Our team Our boats Gallery FAQ Blog Contact Booking Diving For certified divers Dive Packages Advanced Cozumel diving Private Charters Cruise Ship Divers Cozumel dive sites Equipment Rentals Courses All our courses Discover Scuba Refresher Course Open Water Diver Continued Education Advanced Open Water Emergency First Responder Rescue Diver Diving Specialties Other activities Snorkeling Cenotes Whale Shark tour Freediving Hotel/Dive Packages About Discover Cozumel Our dive shop Our team Our boats Gallery FAQ Blog Contact Booking Let's talk about your next diving adventure If you have any inquiries about our services, want to schedule a dive, or seek additional information, we’re here to assist you! Reach out to us through phone, email, or by using the contact form below. We can’t wait to hear from you! Home Contact us It's easy to find us. We're just 5 minutes away from the Ferry Pier, and a 10-15 min taxi ride from the Cruise Ship piers. We're opened everyday from 7:00 am to 8:00 pm. Follow us on Facebook Follow us on Instagram Follow us on Twitter/X Address Deep Blue Dive Center Adolfo Rosado Salas # 200 Cozumel, Q. Roo, Mexico 77600 Open in Google Maps Phone +529871182639 (mobile / Whatsapp) Email scuba@deepbluecozumel.com Send us a message We reply to every message as soon as we can. Please check you spam folder in case you don't get an answer after 24h. Call or chat on WhatsApp +52 (987) 118-2639 Email us scuba@deepbluecozumel.com Search For divers Dive packages Hotel & Dive offers Courses Dive sites For non divers Snorkeling Discover scuba diving Whale Shark tour Freediving About The dive shop The staff The fleet Follow us on Facebook Follow us on Instagram Follow us on Twitter/X Newsletter Get exclusive deals by signing up to our Newsletter. Copyright 2025 © Deep Blue Cozumel Privacy Policy Disclaimer Terms and conditions Cancellation policy Designed & developed by IkaCode Back to Top Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent"
    }
  ]
}