{
  "fuentes": [
    {
      "url": "https://mouse.org/mouse20/gale-brewer",
      "email": "info@mouse.org"
    },
    {
      "url": "https://untappd.com/w/civic-brewing/500371",
      "email": "draft@3x.png"
    },
    {
      "url": "https://untappd.com/w/civic-brewing/500371",
      "email": "taster@3x.png"
    },
    {
      "url": "https://www.brewerleadership.com/about-us",
      "email": "jim@brewerleadership.com"
    },
    {
      "url": "https://www.civicllc.com/our-staff",
      "email": "info@civicenterprises.net"
    },
    {
      "url": "https://www.melomed.co.za/contact_melomed.asp",
      "email": "info@melomed.co.za"
    },
    {
      "url": "https://www.civicllc.com/about-us",
      "email": "info@civicenterprises.net"
    },
    {
      "url": "https://www.bostonbeer.com/contact-us",
      "email": "media@bostonbeer.com"
    },
    {
      "url": "https://civicallyinc.org/about-us/",
      "email": "info@civicallyinc.org"
    },
    {
      "url": "https://www.tosharebrewing.com/",
      "email": "ashare@tosharebrewing.com"
    },
    {
      "url": "https://www.tosharebrewing.com/",
      "email": "info@tosharebrewing.com"
    }
  ],
  "mails": [
    "ashare@tosharebrewing.com",
    "draft@3x.png",
    "info@civicallyinc.org",
    "info@civicenterprises.net",
    "info@melomed.co.za",
    "info@mouse.org",
    "info@tosharebrewing.com",
    "jim@brewerleadership.com",
    "media@bostonbeer.com",
    "taster@3x.png"
  ],
  "nombre_sitio": "civicbrewingco.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mouse.org/mouse20/gale-brewer",
      "text": "Mouse | Gale Brewer, Civic Honoree Design League CS Resources X About Us Our History Job Openings News Our Work Courses on Mouse Create Design League Design League NYC Support Mouse Give Supporters Financials Volunteer Contact Connect With Us Donate Gale Brewer, Civic Honoree We are very pleased to recognize Gale A. Brewer as our Civic Honoree for her longstanding support of young people that Mouse serves across New York City as Manhattan Borough President and in her previous role as City Council Member. Gale has been a ceaseless champion for all students in our city, with a particular focus on equitable access to the latest technologies and on expanded mastery within the STEM (science, technology, engineering, math) disciplines.  Her dedication to these two elements are especially meaningful to Mouse, as the majority of our youth represent diverse ethnicities and more than one third are young women. Gale has been a steadfast supporter to Mouse for more than 15 years. She has attended several events at NYC public schools honoring our students and educators. Gale has also been a strong voice on policy issues directly impacting our youth, including access to high-speed Internet connection in the communities we serve. Gale is the 27th Borough President of Manhattan, with a role in deciding land-use and zoning issues in the borough, appointment of members to the 12 community boards, and the ability to introduce legislation in the City Council. She previously served on the Council for 12 years, including as Chair of the Technology Committee. Gale earned an MPA from Harvard’s Kennedy School of Government and did her undergraduate work at Columbia University and Bennington College. Connect With Us Connect with our community of educators, connect with our Mouse family members, and more. About Work Join Give News Supporters Financials Contact Join Our E-Mail List Email Address Support Mouse Donate © 2025 Mouse Terms Privacy"
    },
    {
      "url": "https://untappd.com/w/civic-brewing/500371",
      "text": "Civic Brewing - Sopchoppy, FL - Untappd Blog Top Rated Insiders Help Shop Login Sign Up Sign In Join Now Menu Blog Top Rated Insiders Help Shop Civic Brewing Sopchoppy, FL United States Nano Brewery Total ( ? ) 744 Unique ( ? ) 261 Monthly ( ? ) 8 You 0 (3.89) 634 Ratings 88 Beers Website Website Civic Brewing Co. is brought to life by the community in and around Wakulla County, Show More Civic Brewing Co. is brought to life by the community in and around Wakulla County, Florida. Civic has found a home in downtown Sopchoppy, in a building that was originally a pharmacy, then years later restored to become a pizza place and restaurant.\r\n\r\nElliot Seidler is the owner and brewer behind the beer. A Wakulla native and former Navy aviation rescue swimmer, Elliot completed the Master Brewers program at UC Davis in 2019. After traveling the world and gaining an appreciation for a good bitter in Britain, a clear kolsch in Germany, and a crisp rice lager in Japan, it’s time to bring the brews home. Show Less See All Filter by: Global Friends You Global Recent Activity William Adams is drinking an IIPA #92 by Civic Brewing at Civic Brewing Purchased at Civic Brewing Taster Earned the Kick-Ass Kick-Off (Eastern USA) badge! Earned the Kick-Ass Kick-Off (Central USA) badge! Earned the Middle of the Road (Level 68) badge! Earned the Taster, Please (Level 16) badge! Earned the 2X (Level 8) badge! Tagged Friends Sun, 07 Sep 2025 19:21:15 +0000 View Detailed Check-in 0 Chuck Knight is drinking an IIPA #92 by Civic Brewing at Civic Brewing Wed, 03 Sep 2025 20:41:26 +0000 View Detailed Check-in 1 Austin Johnson is drinking an EXP IPA #91 by Civic Brewing at Civic Brewing Draft Sun, 31 Aug 2025 20:31:35 +0000 View Detailed Check-in 0 Sam Lovingood is drinking a Pale Ale by Civic Brewing at Civic Brewing Purchased at Civic Brewing Draft Earned the Pale as the Moon (Level 6) badge! Sun, 31 Aug 2025 17:12:14 +0000 View Detailed Check-in 0 Fritz Marggraff is drinking a Booku's Best by Civic Brewing at Civic Brewing Draft Sat, 30 Aug 2025 17:37:00 +0000 View Detailed Check-in 0 Tina James Marggraff is drinking a Tupelo Honey Blonde by Civic Brewing Draft Sat, 30 Aug 2025 17:17:46 +0000 View Detailed Check-in 0 Chuck Knight is drinking an EXP IPA #91 by Civic Brewing at Sopchoppy Pizza Company Draft Earned the Beer Foodie (Level 49) badge! Fri, 29 Aug 2025 20:40:31 +0000 View Detailed Check-in 1 John Yeager is drinking an EXP IPA  #90 by Civic Brewing at Civic Brewing Purchased at Civic Brewing Draft Earned the Cheers To You! (Level 4) badge! Thu, 28 Aug 2025 20:56:32 +0000 View Detailed Check-in 0 Megan Silver is drinking an India Pale Ale by Civic Brewing at Sopchoppy Pizza Company Draft Sat, 23 Aug 2025 23:36:31 +0000 View Detailed Check-in 0 Megan Silver is drinking a Tupelo Honey Blonde by Civic Brewing at Sopchoppy Pizza Company Draft Earned the Riding Steady (Level 97) badge! Sat, 23 Aug 2025 23:35:11 +0000 View Detailed Check-in 0 Lord Kyle Burress is drinking an EXP IPA  #90 by Civic Brewing at Civic Brewing Taster Earned the Haze for Days (Level 79) badge! Sat, 09 Aug 2025 00:14:55 +0000 View Detailed Check-in 0 Lord Kyle Burress is drinking a Pale Ale by Civic Brewing at Civic Brewing Taster Sat, 09 Aug 2025 00:14:02 +0000 View Detailed Check-in 0 Michael Harder is drinking a Living the Dream by Civic Brewing at Civic Brewing Sat, 02 Aug 2025 23:53:11 +0000 View Detailed Check-in 0 Michael Harder is drinking a Tupelo Honey Blonde by Civic Brewing at Civic Brewing Earned the Land of the Free (Level 68) badge! Sat, 02 Aug 2025 23:41:12 +0000 View Detailed Check-in 0 Michael Harder is drinking a Civic Lite by Civic Brewing at Civic Brewing Earned the International Beer Day (2025) badge! Earned the National Disc Golf Day (2025) badge! Earned the Riding Steady (Level 25) badge! Earned the Lager Jack (Level 14) badge! Sat, 02 Aug 2025 23:25:34 +0000 View Detailed Check-in 0 beaux cole is drinking an EXP IPA  #90 by Civic Brewing Tasty Hazy Fri, 01 Aug 2025 23:22:16 +0000 View Detailed Check-in 0 beaux cole is drinking a Pils Nye the Science Guy by Civic Brewing at Civic Brewing Draft Earned the International Beer Day (2025) badge! Earned the Crisp as Day (Level 10) badge! Tagged Friends Fri, 01 Aug 2025 22:21:39 +0000 View Detailed Check-in 0 Chuck Knight is drinking an EXP IPA  #90 by Civic Brewing at Civic Brewing Draft Earned the International Beer Day (2025) badge! Earned the National Disc Golf Day (2025) badge! Earned the Haze for Days (Level 89) badge! Fri, 01 Aug 2025 20:40:38 +0000 View Detailed Check-in 1 Mike Karns is drinking a Pils Nye the Science Guy by Civic Brewing at Civic Brewing Wed, 16 Jul 2025 23:20:15 +0000 View Detailed Check-in 0 Chuck Knight is drinking a XIPA #89 by Civic Brewing at Civic Brewing Draft Thu, 03 Jul 2025 21:01:07 +0000 View Detailed Check-in 1 Show More Propose Edit Propose Duplicate Is this your brewery? Claim it now and start interacting with your fans today! Claim This Brewery Brewery Locations Civic Brewing Sopchoppy, FL Top Beers Tupelo Honey Blonde Blonde / Golden Ale - Other Sopchoppy Stout Stout - American Pale Ale Pale Ale - American India Pale Ale IPA - American Hefeweizen Wheat Beer - Hefeweizen Brown Ale Brown Ale - American Black Lager Lager - Dark Better Off Red Red Ale - Irish Coffee Porter Porter - Coffee Vienna Lager Lager - Vienna See All Beers\n                                                                    (88) Popular Locations Civic Brewing Sopchoppy, FL Added Jun 20, 2021 Untappd for Business Untappd for Business Blog Breweries Shop Support Careers API Terms Privacy Cookie Policy Do Not Sell My Personal Information"
    },
    {
      "url": "https://www.brewerleadership.com/about-us",
      "text": "About Us — Brewer Leadership Home Programs Client Stories Leaders Corner Client Login Take Action Home Programs Client Stories Leaders Corner Client Login Take Action Jim Brewer, CEO and Founder I am grateful. The companies I had the privilege to be part of have changed me, industries, and the lives of our customers and associates. I was part of a leadership team acknowledged as INC Magazine as #1 the fastest growing private company in the US as we added drug coverage to the Medicare program.  I believe in leaders; entrepreneurs who start businesses, hired guns who run businesses, and their senior teams who execute short-term and long-term strategies in larger organizations. My great passion is helping those leaders take a vision and make it reality.  I chair the by-invitation-only CEO and Key Leader Boards, lead our EOS engagements and our leadership coaching practice. I decided I liked entrepreneurship early. I was the top fund raiser in Boy Scouts, but it was sort of unfair. I was selling brooms made by the blind while I was in a Boy Scout uniform. Later, I started my first company at age 20 and made a million in sales in under three years. I have had the privilege to work at great companies with great leaders. As VP of Individual Sales at MemberHealth I worked with Chuck Hallberg, the man who won the race against the largest payers in healthcare. MemberHealth made it to INC #9 in 2006 and all the way to INC#1 in 2007; one of the few INC #1 companies with over a billion dollars in revenue. At CompuServe Network Services, with an amazing team led by Clark Woodford, I held many roles including National Sales for the exclusive network for VISA USA, its merchant banks and large retailers. When CompuServe bought Mark Cuban’s first major company, I worked for Mark, now owner of the Dallas Mavericks and the lead shark on Shark Tank, to expand to a multi-city model. And at Transactive, Inc., I was one of the players in an amazing leadership group that transformed the billion-dollar-a-year fraud-ridden food stamp program in Texas to the first statewide electronic card program for over a million families served by 20,000+ food retailers. There were other adventures; software companies built and sold to giants, ventures positioned to go public with hopes shattered in the dot com era, great alliances between great companies, and important failures where we learned big lessons. Those stories are best saved for conversation over a cup of coffee or a good glass of wine. Susan Taylor, VP Marketing and brand ninja Susan’s witty, irreverent style of writing earned her a suspension from the Academy of Our Lady High School in Chicago before the age of 16. Her career in advertising was well under way. During her 25+ years in advertising, Susan headed up the creative departments of a number of noteworthy Dallas agencies working on a variety of national and international accounts. She is recognized for her big ideas, powerful headlines and clear communications. She is particularly adept at strategic positioning and integrated brand messaging. If you ask Susan the reason for her success, she’ll tell you it’s simple psychology. She has the ability to get inside the heads of consumers and connect with their needs. While her insightful approaches have garnered numerous awards, she’s the first to say her real benchmark for success is bottom-line results as evidenced by her impressive track record for meeting clients’ goals. In her off time, Susan enjoys yoga, sipping good wine and figuring out how to do both at the same time. Account Highlights: Avocados From Mexico, Borden Foods, Carter BloodCare, Cooper Aerobics Center, El Fenix Mexican Restaurants, Fisher Price, General Datatech, Guardian Savings, Hoya VisionCare, JC Penney, Kansas City Steaks, KFC, McAfee, Neiman Marcus, Nokia, Omni Hotel Rewards, Pepsi, Pizza Hut, Starbucks, Sprint, Taco Bell, Tony Roma’s, United Regional Health Care WHAT WE DO Connect and follow us on social media Home About us Programs Client Stories Leaders Corner Free Resources © 2023 All Rights Reserved | Site by SusanTaylorCreative"
    },
    {
      "url": "https://www.civicllc.com/our-staff",
      "text": "Our Team | Civic top of page Home About Us Our Team Wall of Fame Our Partners Our Reports Education Economic Mobility and the Future of Work National Service and Civic Engagement Environment Previous Initiatives Our Work Contact Us Careers More Use tab to navigate through the menu items. Español OUR TEAM John Bridgeland Founder & CEO John Bridgeland is Executive Chairman of the Office of American Possibilities, a civic moonshot factory that taps the entrepreneurial talent of Americans to solve public challenges together across divides. In that capacity, he is Co-Founder, Executive Chairman and CEO of More Perfect , a bipartisan initiative with 34 Presidential Centers (from Washington’s Mount Vernon through the Obama Foundation), National Archives Foundation, American Academy of Arts & Sciences, Corporation for Public Broadcasting, Karsh Institute of Democracy, and 100 partners to protect and renew American democracy by advancing 5 foundational Democracy Goals; Co-Founder and CEO of the COVID Collaborative ; that partnered with the Ad Council on a $330 million vaccination education campaign; and Co-Founder and Co-Chairman of Welcome.US to engage Americans in supporting the resettlement of Afghan, Ukrainian and other refugees. Bridgeland is also Founding CEO and Vice Chairman of Malaria No More , launched at the White House Summit on Malaria he co-led. Since 2001, more than 14 million lives have been saved from malaria. ​ He has been a leader for 20 years on the high school dropout challenge, with his report The Silent Epidemic generating a TIME cover story , two Oprah Shows, and other coverage, the development of a civic marshal plan to address it, and his co-leadership of the Grad Nation campaign.  His work on this civic moonshot was the lead cover story in the August 2024 edition of the Stanford Social Innovation Review . Graduation rates have climbed from 71 percent in 2000 to 86.5 percent in 2020, translating into over 5 million more students graduating rather than dropping out.  Bridgeland is Co-Founder and Vice Chairman of the Service Year Alliance, an initiative to create a civilian national service counterpart to military service in the United States.  In 2020, he founded Tennis for America, a year-of-service program designed for former college tennis players, with the Intercollegiate Tennis Association, which awarded him its Lifetime Achievement Award presented by Wimbledon Champion Stan Smith. He is also author of the book, Heart of the Nation: Volunteering and America's Civic Spirit , which was reissued in paperback on the 15th anniversary of 9/11 with a foreword by General Stanley McChrystal and is being assigned on college campuses. Click to read his full bio. Melody C. Barnes Melody Barnes Solutions Vice Provost for Global Student Leadership Initiatives Senior Fellow at the Robert F. Wagner School of Public Service at New York University Melody Barnes is CEO of Melody Barnes Solutions LLC, a domestic strategy firm, and Vice Provost for Global Student Leadership Initiatives and Senior Fellow at the Robert F. Wagner School of Public Service at New York University.  Ms. Barnes also serves as a Senior Director at the Albright Stonebridge Group, a global strategy firm; Chair of the Aspen Institute Forum for Community Solutions; and on the Board of Directors of the Marguerite Casey Foundation.  From January 2009 until January 2012, she was Assistant to the President and Director of the White House Domestic Policy Council. As Director of the Domestic Policy Council, Ms. Barnes provided strategic advice to President Obama and worked closely with members of the Cabinet coordinating the domestic policy agenda across the Administration. Under her leadership, innovative new policies, practices and partnerships were initiated to address significant national challenges, including education, health care and the federal government’s relationship with local governments and communities. Until July 2008, Ms. Barnes was the Executive Vice President for Policy at the Center for American Progress, a progressive research institute and think tank.  From December 1995 until March 2003, Ms. Barnes worked for Senator Edward M. Kennedy on the Senate Judiciary Committee; she served as his chief counsel from 1998 until she left the Committee in 2003.  Barnes’ experience also includes an appointment as Director of Legislative Affairs for the U. S. Equal Employment Opportunity Commission and serving as a Principal at the D.C.-based consulting firm, The Raben Group. Ms. Barnes began her career as an attorney with Shearman & Sterling in New York City.Ms. Barnes received her law degree from the University of Michigan in 1989.In 1986, she received her bachelor's degree from the University of North Carolina at Chapel Hill where she graduated with honors in history. Ms. Barnes’ media appearances include This Week with George Stephanopoulos, The Daily Show with Jon Stewart, Charlie Rose, Morning Joe and NewsHour with Jim Lehrer.  She currently resides in Washington, DC with her husband, Marland Buckner. Robert Balfanz Everyone Graduates Center, Johns Hopkins University Robert Balfanz, PhD, is a co-director of the Everyone Graduates Center and research scientist at the Center for Social Organization of Schools, Johns Hopkins University. He is the co-director of the Talent Development Middle and High School Project, which is currently working with more than 100 high-poverty secondary schools to develop, implement and evaluate comprehensive whole school reforms. He is also co-operator of the Baltimore Talent Development High School, an Innovation High School run in partnership with the Baltimore City Public School System. He has published widely on secondary school reform, high school dropouts, early warning systems and instructional interventions in high-poverty schools. Recent work includes Locating the Dropout Crisis, with co-author Nettie Legters, in which they identify the number and location of high schools with high dropout rates and What Your Community Can Do to End its Dropout Crisis. Dr. Balfanz is the first recipient of the Alliance For Excellent Education's Everyone a Graduate Award. John J. Dilulio Jr. Frederic Fox Leadership Professor of Politics, Religion, and Civic Society John J. Dilulio Jr. is a Frederic Fox Leadership Professor of Politics, Religion, and Civil Society and Professor of Political Science at the University of Pennsylvania. He serves as Faculty Director of the Robert A. Fox Leadership Program. During his leave from Penn in academic year 2000-2001, he served as Assistant to the President of the United States, and first Director of the White House Office of Faith-Based and Community Initiatives. Professor Dilulio is a Non-Resident Senior Fellow at the Brookings Institution, where he directed the Center for Public Management. For thirteen years, he was Professor of Politics and Public Affairs at Princeton University. He has authored, Institutions and Policies (with James Q. Wilson, Houghton-Mifflin, ninth edition, 2004); What’s God Got to Do with the American Experiment? (E.J. Dionne, Brookings, 2000); and Medicaid and Devolution (with Frank Thompson, Brookings, 1998). Professor Dilulio received his Ph.D. from Harvard University, where he also served as a Head Resident Tutor. He is winner of the David N. Kershaw Award of the Association of Public Policy Analysis and Management, and the Leonard D. White Award of the American Political Science Association (APSA). Margo Drakos Founder & CEO, ArtistYear Committed to a life of service that harnesses the innovative power of technology and the transformative potential of the arts, Margo Drakos is a former professional cellist turned entrepreneur and a proud U.S. Military spouse. Margo is Founder and CEO of ArtistYear, an organization born out of the traditions of service, dedication to artistic excellence and expression, and obligation towards our fellow citizens, and the first National AmeriCorps program for artists to serve to our nation. ArtistYear recruits, trains, and supports recent arts graduates across disciplines to serve as full-time teaching artists in high-poverty schools across our nation to ensure that all students, no matter their economic status, have arts education. In 2018-2019, 55 ArtistYear AmeriCorps Fellows are serving in 51 low-income schools, delivering 93,000 hours of arts instruction to nearly 12,000 vulnerable students twice per-week. Margo spent the past decade working with private and public sector institutions leveraging technology and strategic alignment to realize scale, revenue generation, and sustainability. Until 2017, Margo spent four years as Chief Technology Officer at McChrystal Group LLC. Margo began working as a professional musician at age four, performing on national radio and television commercials.  Over the course of her career as a cellist she performed as a soloist, chamber, and orchestral musician on the world’s preeminent stages on five continents. Margo entered music conservatory at fifteen as a double major in cello and composition and graduated from the prestigious Curtis Institute of Music in 1999. From 2002-2008, she served as Artist-in-Residence and faculty member at Manhattan School of Music and Aspen Music Festival & School. Margo’s positions included cellist of the American String Quartet, Principal Cellist of the Oregon, San Diego, and Seattle Symphonies, and Associate Principal of Pittsburgh Symphony. She has recorded for Sony Classical and Arabesque. In 2007, embracing the power of technology to democratize access to the arts, Margo co-founded and led her first start-up, InstantEncore.com, the world’s leading provider of web and mobile technology to the performing arts. In that role, Margo led strategic deals with Tesitura and Google.  In 2010, Margo was honored as a Young Global Leader of the World Economic Forum, a community of extraordinary global leaders under forty. Margo received a Master’s in Human Rights from Columbia University and holds Executive Degrees in Global Leadership and Public Policy from Harvard’s Kennedy School and Singapore’s Lee Kuan Yew School of Public Policy. Her publications have appeared in the Aspen Institute Magazine, The International Affairs Review, The Stanford Social Innovation Review, and The Cornell International Law Journal. Margo lives with her family in Southern Pines, North Carolina. Dr. Sylvia Earle High Seas Initiative President and Chairman, Mission Blue The Sylvia Earle Alliance National Geographic Society Explorer in Residence Sylvia Earle is Co-Chair of the High Seas Initiative, President and Chairman of Mission Blue/ The Sylvia Earle Alliance. She is a National Geographic Society Explorer in Residence, and is called Her Deepness by the New Yorker and the New York Times, Living Legend by the Library of Congress, and first Hero for the Planet by Time Magazine. She is an oceanographer, explorer, author, and lecturer with experience as a field research scientist, government official, and director for several corporate and non-profit organizations. Gary R. Edson Principal, Civic Gary Edson is Principal of Civic. He is a White House veteran, non-profit executive, and recognized leader in global development. Condoleezza Rice has called him “one of the best ‘policy engineers’” she has ever known. As Deputy National Security Advisor and Deputy National Economic Advisor to President George W. Bush, Edson established the groundbreaking Millennium Challenge Corporation to fight global poverty; co-led the development of the President’s Emergency Plan for AIDS Relief; co-chaired the Task Force on New York Economic Revitalization after 9/11; and helped launch Volunteers for Prosperity. Earlier in his career, he served as General Counsel to the U.S. Trade Representative. In the non-profit sector, Edson has served as CEO of the Clinton Bush Haiti Fund, helping Haiti “build back better” after the devastating 2010 earthquake, and President of Conservation International. He is Senior Advisor at TOTAL Impact Capital, a merchant bank for impact investment, and an affiliate partner at Lindsay Goldberg LLC, a private equity firm. He was previously Chairman of PAR Systems, Inc, a provider of intelligent robotic systems, and Managing Director at the Albright Stonebridge Group. ​ Click to read his full bio. Dr. William Galston Senior Fellow, Governance Studies The Ezra K. Zilkha Chair in Governance Studies Brookings Institution Dr. Galston is a political theorist and author of 6 books and more than 100 articles, who both studies and participates in American politics and domestic policy. Galston was Deputy Assistant to the President for Domestic Policy during the first Clinton Administration and Executive Director of the National Commission on Civic Renewal, which was chaired by Sam Nunn and William Bennett. He has served as Director of Economic and Social Programs at the Roosevelt Center for American Policy Studies in Washington, D.C., as chief speech writer for John Anderson's National Unity campaign, as issues director for Walter Mondale's presidential campaign and as senior advisor to Albert Gore Jr. during his run for the Democratic presidential nomination in 1988. Since 1995, Galston has served as a founding member of the Board of the National Campaign to Prevent Teen Pregnancy and as chair of the Campaign's Task Force on Religion and Public Values. Galston's teaching and research interests include social policy, family policy, normative analysis, education policy and civic renewal. Stephen Goldsmith Daniel Paul Professor of Government, Harvard's Kennedy School of Government Stephen Goldsmith is the Daniel Paul Professor of Government and the Director of the Innovations in American Government Program at Harvard's Kennedy School of Government. He is also Chairman of the Corporation for National and Community Service. He previously served as Special Advisor to President Bush on faith-based and not for profit initiatives and as chief domestic policy advisor to the 2000 Bush for President campaign. While serving two terms as Mayor of Indianapolis, Goldsmith earned a national reputation for innovations in government. As Mayor of America’s 12th largest city, he reduced government spending, cut the city’s bureaucracy, held the line on taxes, eliminated counter-productive regulations, and identified more than $400 million in savings. He reinvested the savings by putting more police officers on the street and implemented a $1.3 billion infrastructure improvement program called Building Better Neighborhoods. His neighborhood empowerment initiatives involved hundreds of community and faith based partnerships in the widely acclaimed Front Porch Alliance. Prior to his two terms as Mayor, Goldsmith was Marion County District Attorney for 13 years. Colin Marrapese Civic Fellow Colin Marrapese is a Civic Fellow in the spring of 2023. He is a fourth-year student at the University of Florida majoring in Business Administration Management. On campus, Colin is a member of the service organization ASTRA at UF, participating in community outreach projects in the Gainesville community. He is also a volunteer for the Gator Nation Night to Shine event, which helps celebrate people with developmental disabilities. He previously served as an assistant dean of elections for the judicial branch in the Student Government. Colin previously worked as an intern on the Industry Team at Appian in the summer of 2022, where he worked on projects related to vertical industries, including the public sector, financial services, pharma, and insurance. Colin is passionate about the Afghanistan refugee crisis, the importance of equal opportunity education, and how businesses can provide solutions to solve national, state, and local-level civic issues. Jessica A. Milano Vice President and Director of ESG Research for Calvert Research and Management Jessica Milano is Vice President and Director of ESG Research for Calvert Research and Management, an investment management firm based in Washington, DC that invests across global capital markets. She is responsible for overseeing the firm’s environmental, social and governance (ESG) research on global securities, which focuses on identifying issuers that create value for long-term investors in a positive manner that is sustainable to our environment and inclusive of all people and communities.  From 2012 to 2017, Jessica served in the Obama Administration, first at the Small Business Administration and then at the U.S. Treasury Department where she oversaw policy initiatives to connect more families, small businesses, and communities to safe and affordable credit. As Deputy Assistant Secretary for Small Business, Community Development, and Housing Policy she managed three Treasury programs focused on access to capital; the Small Business Lending Fund (SBLF), the State Small Business Credit Initiative (SSBCI), and the Community Development Financial Institutions (CDFI) Fund.  Collectively, the SBLF and SSBCI provided $5.5 billion in capital to support nearly $30 billion in small business lending or investment nationally during her tenure.  Jessica also facilitated the historic award of $7 billion in New Markets Tax Credits by the CDFI Fund and signed on behalf of the Secretary more than $1.1 billion in bond guarantees under the newly created CDFI Bond Guarantee program, which provides long-term credit at below-market interest rates to economically underserved communities.  She also directed Treasury’s research on how advances in financial technology and the availability of data are changing the way consumers and small businesses access credit. Jessica has extensive economic consulting and financial services experience. She previously held positions as Director of Research at Compass Lexecon, an economic consulting firm, and with Promontory Interfinancial Network, a financial services firm with a network of over 3,000 financial institutions. She also was a policy consultant at Civic Enterprises where she ran projects for a wide variety of clients including AARP, the Gates Foundation, OpportunityNation, and the White House Council for Community Solutions. Jessica is the author of several policy reports for the Progressive Policy Institute on topics including economic opportunity, job creation, and investment and innovation and a member of the Board of Directors of Small Business Majority, a national small business advocacy organization.  She holds a MA in Applied Economics from The Johns Hopkins University and received her BSc in Government from the London School of Economics. She lives in Maryland with her husband and daughter. Robert D. Putnam Peter and Isabel Malkin professor of Public Policy, Harvard University Robert D. Putnam is a Peter and Isabel Malkin Professor of Public Policy at Harvard University, where he teaches undergraduate and graduate courses in American politics, international relations, comparative politics, and public policy. He is the founder of The Saguaro Seminar: Civic Engagement in America, a program that brings together leading practitioners and thinkers for a multi-year discussion to develop broad-scale, actionable ideas to fortify the nation's civic connectedness. Raised in a small town in the Midwest, Putnam graduated from Swarthmore College in 1963, attended Balliol College, Oxford, and received his PhD from Yale University in 1970. He is the recipient of honorary degrees from Swarthmore, Ohio State University, Stockholm University, and the University of Antwerp. Putnam has authored or co-authored ten books and more than 30 scholarly works, including Bowling Alone: The Collapse and Revival of American Community (2000). Timothy Shriver Chairman & CEO of Special Olympics Timothy P. Shriver is the Chairman of Special Olympics. In that capacity, he serves 2.5 million Special Olympics athletes and their families in more than 165 countries. He has helped transform Special Olympics into a movement that focuses on acceptance, inclusion, and respect for individuals with intellectual disabilities in all corners of the globe. In his eleven years at the helm of Special Olympics, Shriver launched the organization’s most ambitious growth agenda leading to the recruitment of over 1.5 million new athletes around the world. He has worked with the leaders of China to initiate a thriving program in their country and supported their efforts to bring the 2007 Special Olympics World Games to Shanghai. He has also worked with world leaders such as Nelson Mandela, Bill Clinton, George W. Bush, Bertie Ahern, Rafiq Hariri, Thabo Mbeki, Julius Nyerere, Hosni Mubarak, and Shimon Peres to advance the growth of the Special Olympics mission and vision while challenging nations to adopt more supportive and just policies. He has spearheaded programs in developing or war-torn countries such as Afghanistan, Bosnia Herzegovina, and Iraq. Shriver has also created exciting new Special Olympics initiatives in athlete leadership, cross-cultural research, health, education, and family support. Among them, Special Olympics Healthy Athletes® has become the world’s largest public health screening and education program for people with intellectual disabilities, and Special Olympics Get Into It®, together with Unified Sports®, promotes inclusion and acceptance around the world. In addition, he has worked to garner more legislative attention and government support for issues of concern to the Special Olympics community, testifying before Congress on numerous occasions. As part of his passion for promoting the gifts of the forgotten, Shriver has harnessed the power of Hollywood to share the stories of inspiration and change, co-producing DreamWorks Studios’ 1997 release, “Amistad,” and Disney Studios’ 2000 release, “The Loretta Claiborne Story.” He is Executive Producer of “The Ringer,” a Farrelly Brothers’ film, and “Front of the Class,” a Hallmark Hall of Fame television movie. He has produced or co-produced shows for ABC, TNT, and NBCnetworks, and made broadcast appearances on The Today Show, CNN, MTV, and Nickelodeon’s World of Difference. Before joining Special Olympics, Shriver was and remains a leading educator focusing on the social and emotional factors in learning. He has worked in substance abuse prevention, violence, dropout prevention, and teen pregnancy prevention. He created the New Haven Public Schools’ Social Development Project, now considered the leading school-based prevention effort in the U.S., and co-founded the Collaborative for Academic, Social, and Emotional Learning (CASEL), the leading research organization in the U.S. in the field of social and emotional learning. Shriver currently chairs CASEL. Shriver earned his undergraduate degree from Yale University, a Master's degree in Religion and Religious Education from Catholic University, and a Doctorate in Education from the University of Connecticut. He is the recipient of numerous honors, including honorary degrees from Loyola University, New England College, and Albertus Magnus College; the Medal of the City of Athens, Greece; the Order de Manuel Amador Guerrera of the Republic of Panama; the 1995 Connecticut Citizen of the Year; the Surgeon General’s Medallion; and the 2007 Lions Humanitarian Award. He has authored articles in many leading publications including The New York Times, The Washington Post, and Commonwealth magazine. Shriver serves on the Boards of the Education Commission of the States’ Compact for Learning and Citizenship, WPP Group, and Neogenix Oncology, Inc. He is a member of the Council on Foreign Relations. He and his wife, Linda Potter, reside in the Washington, D.C. area with their five children. Randal C. Teague Legal Counsel Mr. Teague serves as counsel to Civic. He began his international practice in the late 1970s as counsel with Boston-headquartered Cabot Corporation, where he had responsibilities for the legal requirements of subsidiary corporations and affiliates in Europe, Latin America, Asia and Australia. In the intervening years, he has represented for-profit and non-profit corporations as to the now former Soviet Union and Central and Eastern Europe more broadly, Latin America and the Caribbean, the Middle East and southern and east Africa. Mr. Teague began his government relations career as the Republican clerk of the House Committee on Public Works (now House Committee on Transportation and Infrastructure) where he worked principally on federal environmental remediation projects and related legislation. He served as chief of staff and legislative counsel to the Rep. Jack F. Kemp, a member of the House Committee on Appropriations and later President George H.W. Bush’s Secretary of Housing and Urban Development and his party’s 1996 Vice Presidential candidate. He had previously served as an economic policy analyst in the Executive Office of the President of the United States. Today, he heads Vorys’ federal legislative and related regulatory practice as to appropriations, environment remediation and civil works, energy, transportation, taxation, financial institutions, international trade and finance, and agriculture. Mr. Teague is past chairman of the U.S. Agency for International Development’s Advisory Committee for Voluntary Foreign Aid, a trustee of EARTH University in Costa Rica, a director of the Air Force Academy Foundation in Colorado Springs, and a senior councilor to the Atlantic Council of the United States. He is chairman and chief executive officer of The Fund for American Studies in association with Georgetown University, a co-founder of its American Institute on Political and Economic Systems at Charles University in Prague, and the founder of its International Institute for Political and Economic Studies in Greece. Mr. Teague is admitted to practice fourteen federal and state jurisdictions, including the Supreme Court of the United States Practice Areas: Administrative Law; Agribusiness; Alternative Energy; Business & Trade; Directors’ & Officers’ Liability; Foreign Investment; Formation & Business Planning; International Banking; International Law; International Transactions; Legislative Practice; Non-profit & Tax-exempt Organizations; Taxation Law; Trade Associations; and Transportation Law. In Memoriam Michael J. Gerson Amy Kass James Q. Wilson Senator Harris L. Wofford Thanks to progress made from 2000, 12.7 million lives have been saved from malaria. But 800 children still die from malaria every day. You can help be part of the effort to end malaria deaths.  Go to: https://www.malarianomore.org. ​ Gracias a los progresos realizados entre 2001 y 2020, se han salvado 12.7 millones de vidas de la malaria. Pero aún mueren 800 niños de malaria cada día. Usted puede colaborar con la iniciativa para acabar con las muertes por malaria. Visite: https://www.malarianomore.org. Washington, DC 20036 info@civicenterprises.net © 2025 bottom of page"
    },
    {
      "url": "https://www.melomed.co.za/contact_melomed.asp",
      "text": "Contact Us Melomed Emergency Service 0800 786 000 Home About Us Melomeds Journey Our Executives and Directors Corporate Social Responsibility Careers at Melomed Our Hospitals Melomed Bellville Melomed Claremont Melomed Gatesville Melomed Mitchells Plain Melomed Richards Bay Melomed Tokai Virtual Tours Melomed Bellville Melomed Claremont Melomed Gatesville Melomed Mitchells Plain Melomed Mitchells Plain Maternity Ward Melomed Richards Bay Melomed Tokai Our Specialists Find a specialist Health articles Specialist Listings Services Pharmacy Melomed Cardiology Melomed Orthopaedics Melomed Oncology Melomed 24 Radiology Pathology Melomed Renal Care METS Pre-Admissions FAQ? Melobabes Melobabes Gynaecologists Birthing Options Register Now Additional Info Antenatal Classes Medical Aid Information Private Paying Patients Lactation Specialist Nursery & Neonatal ICU Something for dads What to bring Melobabes Newsletters Melobabes FAQ? News & Media Melomag MeloTV Virtual Tours News Articles Events Careers Contact Us Pre-Admissions Personalised care Melomed Private Hospitals Delivering exceptional patient care with a commitment to clinical excellence. Find Specialist Cardiac Centre of Excellence Melomed Private Hospitals Your health deserves the Melomed difference About Us Experience world-class medicine Melomed Private Hospitals Trusted healthcare, exceptional outcomes. Our Journey Start Your Melobabes Journey Melobabes Programme Join our Melobabes Programme for expert guidance and support. Query Now Find a Hospital Melomed Bellville Melomed Claremont Melomed Gatesville Melomed Mitchells Plain Melomed Richards Bay Melomed Tokai Find a Specialist Find leading South African doctors across a wide range of specialties. Melobabes Join the Melobabes Programme and experience a positive pregnancy journey. Careers Are you a passionate about professional seeking a rewarding career? Click Here MeloBot We value your feedback At Melomed Private Hospitals, we value your feedback.  We understand that choosing a healthcare provider is an important decision, and we want to ensure you have all the information you need.  Whether you have questions about our services, specific procedures, or simply want to learn more about how Melomed can support your healthcare journey, we encourage you to reach out.  Fill out our quick and easy contact form below and a member of our dedicated team will be happy to get in touch with you shortly. Head Office Unit 6 & 8 Melomed Office Park Punters Way Kenilworth 7535 Contact Numbers Head Office: +27 21 699 0950 Melomed Bellville: +27 21 948 8131 Melomed Claremont: +27 21 683 0540 Melomed Gatesville: +27 21 637 8100 Melomed Mitchells Plain: +27 21 392 3126 Melomed Richards Bay: +27 35 791 5300 Melomed Tokai: +27 21 764 7500 Melomed 24: 0800 786 000 Contact Us Please use the quick form below to contact us if you have any questions: Melomed Gatesville Melomed Mitchells Plain Melomed Bellville Melomed Claremont Melomed Tokai Melomed Richards Bay Hospital Name & Surname Email Address Contact Number Comments / Queries I'm not a robot Powered by MeloCaptcha Contact Us About Melomed Melomeds Journey Executives & Directors CSI Contact Us Our Hospitals Melomed Gatesville Melomed Bellville Melomed Mitchells Plain Melomed Tokai Melomed Richards Bay Melomed Claremont Our Services Melobabes Melomed Pharmacies Melomed Orthopaedic Melomed Cardiology Melomed Oncology Melomed 24 Radiology Pathology Melomed Renal Care METS Frequently Asked Questions Our Specialists Find A Specialist Health Articles Melomed Careers How To Apply A career at Melomed Vacancies News & Info-Hub Melomag Virtual Tours MeloTV Events Articles & Announcements Melomed Hospital Holdings PTY LTD. Privacy Policy Promotion of Access to Information Act Administrator FOLLOW US Melomed Head Office\r\n\t\tUnit 6 & 8, Melomed Office Park, 0A Punters Way, \r\n\t\tKenilworth, Cape Town, 7708\r\n\t\tPhone: 021 699 0950"
    },
    {
      "url": "https://www.civicllc.com/about-us",
      "text": "About Us | Civic top of page Home About Us Our Team Wall of Fame Our Partners Our Reports Education Economic Mobility and the Future of Work National Service and Civic Engagement Environment Previous Initiatives Our Work Contact Us Careers More Use tab to navigate through the menu items. Español WHO WE ARE Acerca de Nosotros Civic is a bipartisan ideas company specializing in innovative initiatives at the cutting edge of domestic, economic, and international policy. We work to raise high school graduation rates, expand national service, increase civic engagement, protect oceans, end malaria deaths, make sure technology does right by society, and prepare Americans for the future of work. We partner with think tanks, foundations, nonprofits, corporations, and elected officials to develop and advance new ways to solve emerging problems. Civic works on every aspect of making ideas happen: policy development, policy analysis, issue research, strategic communications, coalition building, and strategy. The Civic team includes talented leaders, researchers, and policymakers who have run foundations and think tanks and served as senior advisors to Presidents, Governors, and Members of Congress. Our Policy Council taps some of the best minds in the country, with broad experience in a range of domestic and economic and international policy arenas. ​ Meet O ur Team John Bridgeland Founder & CEO Heart of the Nation Distinguished Alumni Award Thanks to progress made from 2000, more than 14 million lives have been saved from malaria. But 800 children still die from malaria every day. You can help be part of the effort to end malaria deaths.  Go to: https://www.malarianomore.org. ​ Gracias a los progresos realizados entre 2001 y 2020, se han salvado +14 millones de vidasde la malaria. Pero aún mueren 800 niños de malaria cada día. Usted puede colaborar con la iniciativa para acabar con las muertes por malaria. Visite: https://www.malarianomore.org. Washington, DC 20036 info@civicenterprises.net © 2025 bottom of page"
    },
    {
      "url": "https://www.bostonbeer.com/contact-us",
      "text": "Contact Us | Boston Beer Co. Search Menu Close Menu About Us Back About Us About Us Our Leadership Our Story Beer and Beyond Back Beer and Beyond Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard Tap In Back Tap In Tap In Come Visit Us What's Next Our Impact Back Our Impact Our Impact Sustainability Social Impact Careers Back Careers Careers BBC Invests in Coworkers Inclusion & Belonging Early Talent Programs Investors Contact News Skip to main content ABOUT US BEER AND BEYOND TAP IN OUR IMPACT CAREERS About Us Our Leadership Our Story Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard Tap In Come Visit Us What's Next Our Impact Sustainability Social Impact Careers BBC Invests in Coworkers Inclusion & Belonging Early Talent Programs Investors Contact News Search Home Contact Us Contact Us Reach out and let's catch up over a drink (or email) The Boston Beer Company One Design Center Place, Suite 850 Boston, MA 02210 617-368-5000 Product feedback or brand inquiry? Angry Orchard Angel City Brewery Coney Island Brewing Dogfish Head Hard Mountain Dew Samuel Adams TeaPot Truly Hard Seltzer Twisted Tea Boston Beer Ethics Hotline Hosted by EthicsPoint, an independent third party: 888-261-1717 Or submit a report The Boston Beer Ethics Hotline is intended for the reporting of unethical, illegal, or improper activity. It is not generally intended for consumer concerns. For consumer-related concerns, please call us at 617-368-5000. Reporter on a deadline? media@bostonbeer.com For shareholder and investor relations, please visit our Investor site for contact information. For 40 years, our mission has remained the same: Seek long-term profitable growth by offering the highest-quality product to the U.S. beer drinker. Instagram LinkedIn X Contact Us One Design Center Place, Suite 850 Boston, MA 02210 617.368.5000 Get in touch Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard View all Beer and Beyond Quick Links About Us Careers News Our Impact Investors Terms and conditions Privacy Policy Responsibility"
    },
    {
      "url": "https://civicallyinc.org/about-us/",
      "text": "About Us – Civically, Inc. Skip to content Facebook Instagram Home What We Do What We Do Our Programs Our Partners About Us Leadership Board Members News & Events Contact Home What We Do What We Do Our Programs Our Partners About Us Leadership Board Members News & Events Contact DONATE TODAY LEARN MORE ABOUT What We Do Creating a Self-Reliant Community Launched in 2017 by Founding President & CEO Marita Garrett, she recognized there was more than the FreeStore Wilkinsburg needed to create self-reliance and general wealth-building within her community. Civically, Inc. envisions a community that is truly self-reliant and creates opportunities from within that has a positive and sustainable impact. Knowing that for a community to flourish, residents must be engaged and connected to the tools to steer their own empowerment and prosperity. We exercise multi- approaches to accomplish this effort by focusing on creation of sustaining communities, public health advocacy, literacy, and equity building. To accomplish these efforts, our programs meet one or more of the following objectives: Addressing the basic needs of community members Promoting civic and community engagement Further community revitalization through community-led economic development See Our programs FUNDING awarded To date, Civically has brought over $3 Million to the Pittsburgh East End Region Thanks to the support of both private and government entities, we have successfully raised over millions in funding within the last 4 years.  These incredible milestones allows us to further our mission of empowering individuals and fostering positive change within our community. Join us as we continue our efforts to grow our surrounding region. donate today $2 Million+ Awarded by Redevelopment Assistance Capital Program for redevelopment of the Hunter Building, the largest commercial building in the business district. $350,000 Received from Keystone Communities Grant Funding to acquire the Hunter Building $260,000 From Community Development Block Grant to continue Fresh Market programming $150,000 Received from PA Department of Community and Economic Development to assist with programming and operational expenses WORK WITH US Civically aligns with partners to develop strategic relationships that help expand our reach. Join us as we create a more sustainable community. MEET OUR PARTNERS Promoting civic and social literacy to the economically under resourced in Wilkinsburg and the Pittsburgh East End region. Facebook-f Instagram Quick Links Who We Are Leadership Events Donate Now Get In Touch Main Office: 1001 Wood Street Pittsburgh, PA 15221 info@civicallyinc.org ​ 412.727.1970 Freestore Wilkinsburg 619 Penn Avenue Wilkinsburg, PA 15221 freestorewilkinsburg@gmail.com 412.436.9836 Promoting civic and social literacy to the economically under resourced in Wilkinsburg and the East End region. Facebook-f Instagram Get In Touch Main Office: 1001 Wood Street Pittsburgh, PA 15221 info@civicallyinc.org ​ 412.727.1970 Freestore Wilkinsburg 619 Penn Avenue Wilkinsburg, PA 15221 freestorewilkinsburg@gmail.com 412.436.9836 Quick Links Who We Are Leadership Events Donate Now © 2025  All Rights Reserved Civically, Inc. | Designed by Creative Rae Co. Scroll to Top Menu Donate Today What We Do Leadership Team Our Programs Our Partners Events Contact Us"
    },
    {
      "url": "https://www.tosharebrewing.com/",
      "text": "To Share Brewing Company Home Drink Beer Eat Food Taproom Events Host an Event To Share Values Play Vinyl Find Us Welcome Home Drink Beer Eat Food Taproom Events Host an Event To Share Values Play Vinyl Find Us Welcome Welcome to To Share Brewing Company! We’re glad you’re here. Founded in 2018 by Aaron and Jenni Share, To Share Brewing Company is about community and providing a safe space for all people to put their differences aside and come together over a pint of great, locally produced craft beer. Our brewery and taproom are located in a residential neighborhood in Manchester, NH. You’ll always find a variety of beers on tap with gluten-free and non-alcoholic options as well. We have a small kitchen for all of your snacking needs. We’re family friendly with a game room containing lots of board games, pinball, a chalkboard wall, and video games. We host a lot of community-focused events including live music, a weekly run club, monthly book club and craft nights, charity events, and beer release parties. SIGN UP FOR OUR NEWSLETTER Name * First Name Last Name Email * Thank you! 2025 Hippo Best of Awards Best Pub or Bar Best NH Brewery Best Happy Hour Hangout Best Local Place to Buy Art Best Spot for a Cheap Date Best Restaurant, Brewery, or Bar for Live Music DRINK BEER (and other things) Draft Pours For Heck Yeah* | American Light Lager | 4% Orange Crush | Hard Seltzer | 4.5% Baby Goats** | Maibock | 7.3% Smokey’s Kangaroo* | West Coast IPA | 6.6% Hugs and Belly Rubs* | Maple Stout | 7.1% Mic Check* | Mexican Amber Lager | 5.3% Krone* | Kolsch | 5.2% Gold Civic* | NEIPA | 6.7% Love Letter To Manchester* | Pale Ale | 5% Sophisticated Pumpkin* | Pumpkin Ale | 5.9% Ruth* | Pink Boots IPL | 6.4% *Available To Go in 16oz 4-packs **Available To Go in 32oz Crowlers Cans/Bottles 20/20 Hearing* | Hoppy Table Beer | 4.3% Homies Help Homies, Always* | NEIPA | 7% Capital T* | Mojito Seltzer | 4.5% Carlson Orchards - Assorted Varieties | Hard Cider | 4.5% Woodland Farms - Assorted Varieties | Non-alcoholic Beer | < .5% Fizzy Hop | Non Alcoholic Hop Water | 0% Espresso Stange (aka: Martini) | 20% | 6oz Margarita | Served with Lime and Salt Rim | 15% | 10oz Moscow Mule | Vodka, Ginger and Lime | 4.5% | 12oz Chardonnay | White Wine | 12.5% | 187ml Cabernet Sauvignon | Red Wine | 13% | 187ml EAT FOOD Special of the Moment Cheddah Nachos | $9 Layers of corn chips smothered in melty cheddar cheese. Topped with corn, jalapenos and green peppers. Served with black bean salsa and sour cream. Real hungry? Add Chicken [$2] or Bacon [$1]. Meat & Cheese Board | $14 | Salami, Pepperoni, and Assorted Cheeses. Comes with a variety of Crackers, Ranch Pickles, Smokehouse Almonds & Spicy Mustard. Soft Pretzel | $7 | Traditional soft pretzel, lightly salted. Served with your choice of Queso or Sweet & Spicy Mustard. Mac & Cheese | $9 | Organic pasta and cheese. Top with potato chips, crumbled bacon [add $1] or hotdog (add $4). Loaded Waffle Fries | $8 | Oven-baked waffle fries loaded up with cheddar cheese, crumbled bacon, sour cream drizzle and fresh scallions. Add Jalapenos [add $1] to spice it up! 1/4 lb Hot Dog | $9 | Giant Nathans 100% Beef Frank served on a soft roll with ketchup, mustard, pickles & potato chips. Cheeseburger Skewers | $9 | Four mini burger patties topped with lettuce, tomato, pickle, american cheese, and 1,000 island dressing. Taquitos | $8 | Five delicious chicken and cheese taquitos per order. Served with sour cream on the side. Pizza Rolls | $6 | Totino’s Pizza Rolls, just like you remember! Ten pizza rolls per order. Two options: pepperoni or cheese. You choose. Mac ‘n’ Cheese Bites | $6 | Talk about comfort food. An order of these babies comes with five lightly-breaded bites filled with creamy and cheesy Cavatappi pasta. Served with your choice of ranch or marinara! Dino Nuggets | $7 | Get eight of your favorite nuggets from your childhood with your choice of ranch, ketchup, honey mustard, or BBQ Sauce. Chips, Salsa & Queso | $7 | Salsa & Warm Queso served with tortilla chips. Snack Flight | $7 | Comes with: M&Ms, pretzels, and white cheddar popcorn. You can choose the last snack. Make it spicy with wasabi peas or extra sweet with animal crackers. Served on a flight paddle. Deep River Potato Chips | $2 | Lightly Salted or BBQ Soda & Juice | $3 | Coke, Diet Coke, Root Beer, Lemonade, Plain & Flavored Seltzers. Juicebox | $1 | First one is free for our younger guests. Red Bull | $4 | Sugar Free. Fizzy Hop | $6 | Hop infused sparkling water with refreshing citrus notes. Zero calories, carbs or alcohol. Rainbow Popsicle | $3 | It’ll cool you down! Try one in a seltzer or heck yeah! TAPROOM EVENTS Find all of our upcoming community events on our Facebook Page ! HOST AN EVENT HOST A PRIVATE OR SEMI-PRIVATE EVENT Name * First Name Last Name Email * Phone (###) ### #### Desired Date MM DD YYYY Desired Start Time Hour Minute Second AM PM Desired End Time Hour Minute Second AM PM Number of People What's the special occasion? Birthday Engagement Party Wedding Shower Wedding Ceremony Wedding Before/After Party Baby Shower Corporate Event Other Budget $ Beer/Bar $$ Options Open Bar Open Bar with $$ Cap Drink Tickets Cash Bar Not Sure Yet Tell Us About Your Event How did you hear about us? Word of Mouth Google Taproom Poster Other Thank you! Looking for a unique space to host your next meeting, birthday party, team building, baby shower, holiday party or happy hour? We’ve got you covered. You can rent out our entire taproom for an exclusive experience. The taproom seats 55 with standing room for up to 100 and full use of our beer garden, which seats 25. For smaller events, our game room provides a semi-private space for up to 30 guests. Features for space include: Tables on wheels give you the flexibility to configure the space to meet your needs. AV equipment, including sound system, projector and screen. Game room with a pinball machine, board games, and chalkboard wall will keep guests entertained, including children. We have a variety of options for event food, including anything on our regular menu modified for larger groups, vegetarian and vegan options. Our most popular food offerings are pretzel bites, cheeseburger skewers, caprese bites and brunch! Beer! All of the beer we serve is brewed onsite. Our head brewer would be happy to give you and your guests a tour of our 7-barrel brewery. Fill out the form on the right and we’ll get back to you with more information. here’s what our previous hosts have said about their to share experience … “Had my Wife’s Surprise HBD Party at the Brewery last week, I could not have been more pleased with the Service, the Food, the Space and yup…the BEER!! They pour a variety of styles of beer for all. Aaron, Jenni, Mary and the Beertenders are top notch and create an atmosphere for EVERYONE!!!”  - Dana “We had our private wedding after party at To Share Brewing Company this past weekend, and could not have asked for a better experience! Mary worked with us to create a custom menu that fit all of our guests dietary needs (vegan, vegetation, diabetic friendly/low carb) and everything was delicious! The atmosphere, beer, food, and music were a perfect way to end our wedding!! Our guests had fun playing games, spending time together, and continuing our wedding celebration! We would 100% recommend hosting your event with To Share Brewing Company!”  - Rose OUR VALUES & CODE OF CONDUCT TO SHARE CORE VALUES Respect - We welcome and encourage all - our coworkers, customers, neighborhood and planet - treating them with dignity and compassion. Teamwork - We accomplish more when we come together. Community - Our community is at the heart of what we do. We work hard to provide a safe space for a community we work to improve everyday. TO SHARE CODE OF CONDUCT To Share Brewing Company is committed to providing an environment that is free of discrimination and from abusive, offensive, or harassing behavior. We want you to be a part of an environment that is respective and inclusive. Everyone deserves to operate and co-exist in an environment where each individual is treated with dignity and respect. Any To Share Brewing Company employee, guest or vendor must: Contribute to a positive environment that is free of hostile and offensive behaviors. Harassment includes any unwelcome or inappropriate verbal or physical conduct, or coercive behavior, where the behavior is known or reasonably ought to be recognized as unwanted or unwelcome. Treat all individuals and groups respectfully, recognizing their human dignity, regardless of of their diverse human characteristics: race, color, sex, sexual orientation, gender expression, age, physical or mental disability, size or appearance, genetic pre-disposition, religion, ancestry, national origin, or veteran status. Respect the opinions of others and address conflicts in a positive and constructive manner. Feel they can speak out without fear of retaliation when the actions of others violate the rights of any individuals or groups. To Share Brewing Company reserves the right to ask any guest violating this code of conduct to leave the premises. Similarly, any vendor violating this code of conduct may be asked to leave and their future working relationship with the brewery could be in jeopardy. Any employee found violating this code of conduct will be investigated and the appropriate course of action will be taken; which could include but may not be limited to reprimand, suspension, or termination of employment. All violations will be reviewed and dealt with at the discretion of To Share Brewing Company’s management. PLAY VINYL We have a collection of nearly 1,000 vinyl records that we play in the taproom. Get a sample of what’s available with our Spotify playlist. Some of our staff favorites are linked below. VISIT & CONTACT US VISIT US OUR TAPROOM HOURS Tuesday & Wednesday 4-8PM Thursday & Friday 4-9PM Saturday 1-8PM Sunday 1-7PM Our brewery & Taproom LOCATION 720 Union Street Manchester, NH 03104 CONTACT US Name * First Name Last Name Email * Subject * Message * Thank you! Back To Top ashare@tosharebrewing.com Powered by Squarespace Cart ( 0 )"
    }
  ]
}