{
  "fuentes": [
    {
      "url": "https://www.clancyssports.com/",
      "email": "contact@clancyssports.com"
    },
    {
      "url": "https://www.clancyshospitality.com/about/",
      "email": "773-6066info@michaelangelosbistro.com"
    },
    {
      "url": "https://www.clancyssherwood.com/about",
      "email": "bowerpdx@yahoo.com"
    }
  ],
  "mails": [
    "773-6066info@michaelangelosbistro.com",
    "bowerpdx@yahoo.com",
    "contact@clancyssports.com"
  ],
  "nombre_sitio": "clancysirishsportspub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.clancyssports.com/",
      "text": "Clancys Sports Toggle navigation Home Services About Us Testimonials Engage Impact Through Sports SPORTS STRATEGIC PLANNING The overall focus of CSP is to help our partners develop a proactive and consistent approach to achieving their vision and mission, focusing on core activities and prioritizing and leveraging resources. New and Unique Sports Events Analytical approach to understanding the drivers of value in a sports events and helping create effective and sustainable strategies for event creation. Planning and Support Sports Tourism 30+ years of experience in studying tourism and event trends and providing insights to take communities to the next level. Planning & Operations Sports Facilities Leveraging the learnings from overseeing the busiest sports complex in the world to provide operational and process improvements.  What to build and how to operate is our core competency. Our services Organizational Strategic Planning Clancy’s Sports provides organizations focus and a roadmap. Shifting from tactical thinking to strategic visioning is difficult while you are in execution mode. Our approach is simple: define your primary purpose(s), understand your capabilities, design the organization for success and hold people accountable to clearly aligned goals. Setting vision is easy, but staying tethered to the vision requires setting the right processes that ensure cultural alignment. Learn more Event Management Clancy’s Sports provides organizations access to a myriad of expertise from across the country with access to some of most seasoned leaders who have worked on Super Bowls, Final Fours, large scale road races as well as leveraging the deepest understanding of the grassroots sports' movement. Broad based experience allows for thoughtful insight into ensuring every event has the potential to feel like it is a ‘World Cup’ event while driving meaningful results.  The ability to create properties, attract them, or simply just put the structure and processes in place to manage every or any aspect of an event, Clancy’s is a solution. Learn more Sports Tourism Clancy’s Sports was initially established to support sports commissions, Convention & Visitor Bureaus and government agencies alike in optimizing their sports offerings in a community, developing and packaging them effectively to specific target market needs and ensure maximum participation. Our network and extensive industry knowledge, ranging from feasibility studies to facility design and operations includes experience with some of the most recognizable event properties and sports facilities in the U.S. Learn more Sports Facilities After being involved with creating or hosting over 2500 events over 30 years, in 60+ sports and over 3M athletes, we understand how a facility should be built, what amenities are important and most importantly, how to maximize the revenue for facility and the market that it is in. Learn more Hire Us Now! Liked our services? Get in touch and hire us now! We are a click away... About Us Why Choose Us? Who are we? What we do? The Orlando-based company is a sports consultancy company specializing in strategic planning, organizational design, event programming, sports tourism initiatives and facility assessments, all of which drive economic vitality to communities. Clancy’s Sports is a Florida based LLC which was founded in May of 2014 by former Walt Disney World executive, Mike Millay. As the Director of Business Development for ESPN Wide World of Sports complex, Mike was one of the original and remains the longest-tenured executive of the complex. As the initial Executive in the development and execution of the business strategy, his roles included providing leadership insights into facility design, business processes, client negotiations, event management, sponsorship and marketing. In addition to Fortune 100 corporate experience, Clancy’s Sports is influenced by Mike’s non-profit sports background as he helped create that Greater New Orleans Sports Foundation serving as its first executive director for almost 7 years and helped drive the formation of the National Association of Sports Commissions (NASC) serving as its chairman for 2 terms. He is active with several local and national sports non-profit boards such as the Greater Orlando Sports Commission, the DeVos Sports Business Management Program and Ohio University’s Sports Management Program. Testimonials What Customers Say \"Mike Millay is a true visionary and problem solver.  He examines a situation and visualizes a great long-term solution.  But, having said that, he's always ready to roll his sleeves up and dig into the immediate short-term, ground level solution.  Over a relationship of 20 years, Mike has been a pleasure to deal with - always professional and personable even in difficult circumstances.\" Jon Butler - Pop Warner Executive Director “There may not be a more knowledgeable person in the amateur sports space than Mike.   He has such broad sports and event experience working with the Olympic family, the collegiate space, and all grassroots sports….yet he also has experience with the professional leagues, broadcast and the facility design space….he’s just a very unique and qualified sports leader.” Don Schumacher - Former Executive Director of the National Association of Sports Commissions Since its inception in 2002, the Greater Columbus Sports Commission has grown from a two-person team to a staff of 12 and has booked more than 500 new sporting events. Early in the organization’s history, we trusted Mike Millay and Clancy’s Sports to help us implement new tools and procedures that would take the Sports Commission to the next level and ultimately, help us achieve the success we experience today. Mike and his team are skilled professionals that understand the industry and value the partnerships they build. I highly recommend Clancy’s Sports. Linda Logan, Executive Director - Greater Columbus Sports Commission Clancy’s really helped us totally rethink our mission, vision and organizational structure. Their (Mike’s?) process led our board of directors, key stakeholders and staff through a thorough strategic discussion which resulted in shifting our mindset on our organizational design and staffing alignment.  Clancy’s impact is seen every day in how we operate our business. Kathy Nelson, President & CEO - Kansas City Sports Commission Mike’s 20 years of sports facility operational experience was critical as we conducted our feasibility study for facility expansion in the market.  Mike has a unique balance with his programming insights, facility management experience as well as understanding of functional facility design. Mike Guswiler, President  - West Michigan Sports Commission Delivered Projects All Strategic Planning Sports Facilities Event Management Richmond Strategic Planning , Details New Orleans Details Columbus Details Kansas City Details Dallas Details West Michigan Details Cincinnati Details Discover Puerto Rico Details Soul Race Trip Details Prospect Cup 2017 Event Management , Details St. Pete/Clearwater Details Sport Oregon Details Engage Get In Touch Name Email Subject Message Find Us Office: 7325 Forestwood Court Orlando, FL Email: contact@clancyssports.com Phone: +1 407 341 8335 Social Media Clancys Sports Orlando-based sports consultancy company Designed and Developed by Clancys Sports.  All rights reserved. © www.clancyssports.com × Close Sports Strategic Planning Clancy’s Sports provides organizations focus and a roadmap. Shifting from tactical thinking to strategic visioning is difficult while you are in execution mode. Our approach is simple: define your primary purpose(s), understand your capabilities, design the organization for success and hold people accountable to clearly aligned goals. Setting vision is easy, but staying tethered to the vision requires setting the right processes that ensure cultural alignment. Strategic Direction Assessing organizational strengths & weaknesses Assessing Internal work processes Helping identify workload priorities Support in development of Strategic Plans and financial analysis Develop facilities master plans and programing Organizational Structure Working with Non-Profit sports organizations Assessing current organizational culture and provide insights for improvement Determining critical roles, skills sets and talent alignment Provide insights on Accountability, Responsibility and Empowerment in the chain of command The overall focus of Clancy’s Sports is to help clients develop a proactive and consistent approach to achieving their vision and mission, focusing on core activities while prioritizing and leveraging resources. Close × Close Event Management Clancy’s Sports provides organizations access to a myriad of expertise from across the country with access to some of most seasoned leaders who have worked on Super Bowls, Final Fours, large scale road races as well as leveraging the deepest understanding of the grassroots sports' movement. Broad based experience allows for thoughtful insight into ensuring every event has the potential to feel like it is a ‘World Cup’ event while driving meaningful results.  The ability to create properties, attract them, or simply just put the structure and processes in place to manage every or any aspect of an event, Clancy’s is a solution. Event Property Development Designing events from scratch can be difficult. Understanding the keys deliverables and metrics to event success begins with setting expectations and providing a roadmap to exceeding them. Creative Event Brainstorming & Concepting Business and Financial Modeling from year one to a stabilized year Event Management Event Planning & Management, Budget Execution, Site Programming & Planning, Operations Planning & Management, Marketing & Sales Strategies, Logistics, Ticketing, Security, Access Control & Credentials, Special Events, Hospitality, Transportation, Volunteers, and Language Services. Close × Close Sports Tourism Clancy’s Sports has at its core, the deepest understanding of the youth sports industry through the 30 years worth of relationships with almost every National Governing Body in the Olympic Family, most collegiate conferences and the NCAA, pro sports leagues as well as the community based organizations.   Clancy’s Sports was initially established to support sports commissions, Convention & Visitor Bureaus and government agencies alike in optimizing their sports offerings in a community, developing and packaging them effectively to specific target market needs and ensure maximum participation. Our network and extensive industry knowledge, ranging from feasibility studies to facility design and operations includes experience with some of the most recognizable event properties and sports facilities in the U.S. Traditional Strategic Development work with a deep understanding of the sports event space Reviewing Organizational Culture from Leadership to the receptionist Organization design to match mission and vision, and strategic priorities Providing operational work plans with an eye on performance and accountability Close × Close Sports Facilities After being involved with creating or hosting over 2500 events over 30 years, in 60+ sports and over 3M athletes, we understand how a facility should be built, what amenities are important and most importantly, how to maximize the revenue for facility and the market that it is in. Functional Design Partner with Architects, Designers and Engineers in thoughtful consideration of realistic operational needs Food & Beverage and Merchandise area planning Review of playing areas, playing surfaces Review of type and quality of the sports equipment and facility equipment Ensure appropriate number of fields, courts, diamonds match realistic demand in defined market area Event Programming Event Calendar Review and Development Metric-Based Decision Making on Event selection Key Client Contract Considerations (length & terms) Event financial modeling Understanding sport seasonalities and competitive benchmarks Review appropriate strengths and weakness of the overall facility packaging Operational Management Labor Planning considerations Financial Review of projected user fees, rental rates, gate pricing or other revenue streams Sales and Marketing Strategies Sponsorship Sales and Servicing Strategies Event Management and Logistics Operational processes inclusive of critical handoffs between sales, business development and operational teams Review current or proposed facility maintenance processes Ensure service level standards and processes are in place Close × Close Richmond Sports Backers Best Practices Seminar and Organizational Assessment Helped the 3-time winning NASC Sports Commission of the Year with business development and event management insight as the Sports Backers continue their growth. Focus on process improvement and organizational efficiency Close × Close Greater New Orleans Sports Foundation Organizational Assessment & Strategic Plan Development Contracted to provide guidance on creating re-imagined strategic plan for this 25-yr old organization. Provided discovery work and recommendations on image diversification, improvement of internal processes, organizational vibrancy solutions as well as design options to maximize staffing and event opportunities. Close × Close Greater Columbus Sports Commission Organizational Assessment & Strategic Plan Development Contracted to research the operations of the Greater Columbus Sports Commission and provide recommendations about the strategic alignment of the organization, potential process improvements as well as suggestions on organizational design options in order to optimize staffing. Close × Close Greater Kansas City Sports Commission Organizational Assessment & Strategic Plan Development Contracted to research the operations of the Greater Kansas City Sports Commission and provide recommendations about the strategic alignment of the organization, process improvements, revenue optimization modeling as well as suggestions on organizational design options in order to maximize staffing output. Close × Close Dallas Sports Commission Organizational Assessment & Strategic Plan Development Contract to research the operations of the Dallas Sports Commission, a department of the Dallas CVB. CSP engaged executive board members in creating the new vision for the organization as well as develop the financial modeling to remain part of the CVB framework, but work independent to maximize the business community involvement. Developed an organizational design with clarity in roles and responsibilities to compliment the integrated strategic plan and tactical objectives. Close × Close St. Petersburg Sports Commission Organizational Assessment & Strategic Plan Development Contracted to research the operations of the St. Petersburg Sports Commission, a department of the St. Petersburg CVB. Research the operations of the commission and provide recommendations about the strategic alignment of the organization. Close × Close Grand Rapids Sports Commission Organizational Assessment & Strategic Plan Development Contracted to research the operations of the Grand Rapids Sports Commission and its three (3) distinct community objectives including facility operations, managing their State Games and operating a successful sports commission. We provided recommendations about the strategic alignment of the organization, process improvements, revenue optimization modeling as well as business development. Close × Close Sport Oregon Organizational Assessment & Strategic Plan Development Contracted to research the operations of the Oregon Sport and provide recommendations about the strategic alignment of the organization, process improvements, revenue optimization modeling as well as suggestions on organizational design options in order to maximize staffing output. Close × Close Cincinnati USA Sports Commission Overall Sports Market Assessment & Strategic Planning Contracted to provide a metropolitan facility assessment, as well as an organizational assessment to provide strategic and financial recommendations on how Cincinnati can be a more competitive sports commission that provides greater relevancy in the marketplace as well as more successful nationally. Close × Close Discover Puerto Rico Overall Sports Market Assessment & Strategic Planning Contracted to perform an overall sports market assessment for the Island of Puerto Rico. Scope includes a research component understanding right holders barrier to host and consumers propensity to travel. Additionally, a facility assessment regarding facilities that can impact sports tourism. Lastly, conducting an overall strategic development process and provide organizational assessment to drive a strategic and operational workplan. Close × Close Prospect Cup 2017 Event Management - International Youth Soccer Tournament The inaugural Prospects Cup was a landmark global U12 soccer event bringing the most talented teams from around the globe together at this first-of-its-kind televised competition. Through the broad reach of the Prospects Cup multimedia assets passionate fans, supportive families and dedicated brands combine with the love of the beautiful game in the ultimate showcase for these young players. Tomorrow's soccer stars will make their international debut here. Clancy's Sports was responsible for the project plan and operations, including event scope, bid city selection, planning and travel for the teams, hospitality management, digital footprint strategy, venue management, event logistics and tournament operations. Close"
    },
    {
      "url": "https://www.clancyshospitality.com/about/",
      "text": "About | Clancy's in Noblesville, IN Skip to main content Restaurants Catering Private Dining About Frequent Diner Club Gift Cards Reservations Toggle Navigation Restaurants Catering Private Dining About Frequent Diner Club Gift Cards Careers Contact Us App Accessibility Privacy Policy Newsletter Facebook Twitter Instagram LinkedIn Email Tiktok powered by BentoBox Main content starts here, tab to start navigating About Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Clancy’s Hospitality was established in 1965 in Noblesville, Indiana by Indiana Restaurant Hall of Fame Member Carl Fogelsong. We believe that hospitality, when done well, can be a transformative force in a community. Pride in our commitment to technically excellent service, with an emphasis on warm hospitality is the cornerstone of our business. Coaching our staff to think our  customers as guests in our own home. Thats who we are, that's who we will always be. Core Values HONESTY INTEGRITY FAIRNESS FOCUS CONCENTRATION Serving great food starts with great quality ingredients. We proudly source ingredients from partners committed to quality, authenticity, and practices to create a more sustainable future. Contact Us 120 Carey Drive Noblesville, IN 46060 (317) 773-3284 Send Us A Message May 15, 1965 Clancy’s Hamburgers opens its doors in Noblesville, Indiana. Carl Fogelsong partnered with Clarence Katherins on the first double drive through in the Midwest featuring a 35 seat dining room. Both innovations at the time. 1966 Clancy’s Hamburgers opens a second location in Sidney, Ohio. Carl Fogelsong’s brother Gale enters into the family business. The restaurant continues to operate to this day making it a staple in central Ohio. 1970’s Clancy’s Hamburgers grow to over 30 units in Indiana, Ohio, Tennessee, and Kentucky. The company would eventually sell off many of the units do to competition from big chain fast food restaurants. 1981 Founder Carl Fogelsong's son, Perry, joins the Corporate Team. 1982 Grindstone Charley’s concept is born in Noblesville, Indiana, opening to rave reviews for casual themed American food. 1985 Grindstone Charley’s opens at Rockville Road on the west side of Indianapolis near the Indianapolis Motor Speedway. 1990 Clancy’s introduces its “Nice Italian Restaurant” Michaelangelo’s Italian Bistro in Noblesville, Indiana 1995 Houlihan’s opens in Downtown Indianapolis near Circle Centre Mall at the World of Wonders parking garage. 1996 Houlihan’s opens in the posh Keystone at the Crossing Fashion Mall. 1998 A Grindstone Charley’s like no other opens in Kokomo, Indiana. 2003 Clancy’s introduces a new concept, Red Rock Roadhouse, in Fisher’s, Indiana. 2003 Founder Carl Fogelsong is inducted into the Indiana Restaurant Hall of Fame. 2004 Perry Fogelsong is appointed President/CEO of Clancy’s after founder Carl Fogelsong retires. 2018 A return like no other, Grindstone Public House opens up in the Historic Castor Building in Downtown Noblesville 2019 Grindstone on the Monon opens up in Westfield, Indiana, the fastest growing community in the state. 2020 Grindstone on the Monon is rewarded with “Best New Business,” at Westfield Chamber of Commerce awards. Perry Fogelsong accepts honor in speech. 2021 Clancy’s Hamburger’s returns to the state of Indiana in a bustling food hall, The Garage, in downtown Indianapolis at Bottleworks District. 2022 A Supper Club inspired concept is introduced at Bottleworks District. The Fountain Room is the hottest restaurant of the year garnering 2.5/3 stars & \"Best New Restaurant\" from Indianapolis Monthly Magazine. Our Team Perry Fogelsong President/CEO Mel Wildermuth Vice President Blake Fogelsong Owner/Director of Operations Mark Sontag Director of Food, Beverage, & Menu Development Annette Cunion Owner / Accounts Payable Carley Clark Event Sales Manager Meredith Hudson Accounting Manager Brandi Ingals Administrative Assistant Reservations Facebook Twitter Instagram LinkedIn Email Tiktok Careers Contact Us App Accessibility Privacy Policy Newsletter powered by BentoBox leave this field blank Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reservations Location - Required Location Grindstone Public House Michaelangelo's Italian Bistro Grindstone Charley's - Kokomo Grindstone On The Monon Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Please, select a date Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://www.clancyssherwood.com/about",
      "text": "About | Clancy's Pub & Restaurant top of page Clancy's Pub & Restaurant Home About Menu More Use tab to navigate through the menu items. Order Online Our Story Clancy’s owner Bob Bower started the business with his lifelong friend and business namesake, Pat Clancy, in November of 1987. After nearly four months of paint, plaster, and sweat the doors were opened on St. Patricks day in 1988. Bob Bower, a native Oregonian, (Benson Poly-tech, P.S.U. alumni) and wife Jeannie (passed Easter of 07') took over all operations in November of 88′. Jeannie Bower, whose comfort food recipes have remained the backbone of the menu for over 36 years, was classicly trained by her mother, the Chef D’ Parte at the original St. Vincents hospital. Bob & Jeannie’s son Allen, who started with Clancy's in 1991, has continuously refined and expanded on his family’s food and beverage offerings. ​ Bob Bower, working with local participants, personally developed and implemented his concept for the very first Cruisin' Sherwood Car show. Ensuring its longevity by managing its growth throughout the first five years with help from Rod Runners West of Tigard, and fellow old town merchants.  20 years later Cruisin' Sherwood is still the largest single event in the old town area. Clancy's has and will continue to be a longtime supporter of Sherwood athletics. ​ ​ Whats New? Allen Bower, Bob's son, returns as General Manager after 6 years in the San Francisco Bay area. We are open for breakfast 7 days a week. ​ Allen's newest kitchen specialties include a hand-cut filet mignon, hearty Irish Stew and our amazing Halibut Fish Tacos. Our famous clam chowder is now available every day. What was once our dinner menu is now available every day from 11 am to close. Ala carte offering on our dinner favorites like razor clams, pan-fried oysters Dry-aged steaks, fresh steamer clams,  and specialty burgers to go with our famous halibut fish and chips. Old Town Trivia is back !! Every Tuesday night at 7:00 pm ~ Come down win fun Prizes and giveaways through the game. Clancy's Pub & Restaurant bowerpdx@yahoo.com (503) 625-6711 16066 SW 1st St, Sherwood, OR 97140, USA ©2020 by Clancy's Pub & Restaurant bottom of page"
    }
  ]
}