{
  "fuentes": [
    {
      "url": "https://clearwateryachtclub.org/contact-us/",
      "email": "countrybutcher-logo@1x.png"
    },
    {
      "url": "https://clearwateryachtclub.org/contact-us/",
      "email": "office@clearwateryachtclub.org"
    },
    {
      "url": "https://www.tampabay.com/archive/2011/07/24/clearwater-golf-operator-looks-to-largo/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "juri@cwc.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "katharina@cwc.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "marc@cwc.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "max@cwc.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "ranya@cwc.com"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "email": "stefan@cwc.com"
    },
    {
      "url": "https://www.cwbgolf.org/contact-us/",
      "email": "fanitatam@cwbgolf.org"
    },
    {
      "url": "https://www.cwbgolf.org/contact-us/",
      "email": "sr@cwbgolf.org"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club",
      "email": "andrea.bianchi@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club",
      "email": "ashley.hauser@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club",
      "email": "matthew.mccracken@invitedclubs.com"
    },
    {
      "url": "https://www.clearwatercountryclub.com/golf/pro-shop/golf-instructors-at-clearwater-c-c/",
      "email": "jeff@jeffhaneygolf.com"
    },
    {
      "url": "https://www.clearwatercountryclub.com/golf/pro-shop/golf-instructors-at-clearwater-c-c/",
      "email": "mike@mikeriso.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are",
      "email": "andrea.bianchi@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are",
      "email": "ashley.hauser@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are",
      "email": "matthew.mccracken@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are/our-team",
      "email": "andrea.bianchi@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are/our-team",
      "email": "sasha.rosenzwog@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are/our-team",
      "email": "matthew.mccracken@invitedclubs.com"
    },
    {
      "url": "https://clearwatersecurity.com/contact/",
      "email": "info@clearwatersecurity.com"
    }
  ],
  "mails": [
    "andrea.bianchi@invitedclubs.com",
    "ashley.hauser@invitedclubs.com",
    "countrybutcher-logo@1x.png",
    "fanitatam@cwbgolf.org",
    "info@clearwatersecurity.com",
    "jeff@jeffhaneygolf.com",
    "juri@cwc.com",
    "katharina@cwc.com",
    "licensing@zumapress.com",
    "marc@cwc.com",
    "matthew.mccracken@invitedclubs.com",
    "max@cwc.com",
    "mike@mikeriso.com",
    "office@clearwateryachtclub.org",
    "ranya@cwc.com",
    "sasha.rosenzwog@invitedclubs.com",
    "sr@cwbgolf.org",
    "stefan@cwc.com"
  ],
  "nombre_sitio": "clearwatercountryclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clearwateryachtclub.org/contact-us/",
      "text": "Contact Us – Clearwater Yacht Club Skip to content FOLLOW US: Calendar Become a Member Calendar Become a Member Calendar Become a Member Calendar Become a Member FOLLOW US: Calendar Become a Member Calendar Become a Member Calendar Become a Member Calendar Become a Member Toggle Navigation Home About Us Why Join Us? Our Heritage FCYC Reciprocity Dress Code Getting Here Newsletters Facilities To Eat Check out our menu and different venue options. To Dock Check out our brand new docks built in 2022. To Swim Enjoy our heated and chilled swimming pool. To Book We have a suitable venue for all occasions. Events Boat Parade 50th year for this spectacular water parade. Regular Events Cruising Bow Chasers Book Club regattas The Gulls Calendar Our Gallery Contact Us Members Members Area Members Statements Toggle Navigation Home About Us Why Join Us? Our Heritage Dress Code FCYC Reciprocity Getting Here Newsletters Facilities To Eat To Dock To Swim To Book Events Calendar Regattas Boat Parade Book Club Bow Chasers Cruising The Gulls Our Gallery Contact Us Members Members Area Members Statements Contact Us Administrator 2024-06-18T15:09:51+00:00 Get in touch fast Quick Enquiry Simply select what you would like to do, and fill out the correct form. We will get in touch with you very shortly. If you require urgent information, just give us a call. What Would You Like To Do? Request A Slip Learn To Sail Contact General Manager Contact Office Manager Contact Dockmaster First Name: Surname: Telephone Number: Email Address: Your Message: Length * Type Power Sail Draft * Beam * Boat Name Member Number * Home Yacht Club Requested Arrival Date * Requested Departure Date * Date Of Birth Street Address City State Zip Code If you are married, please provide the name of your spouse: If you have any children under the age of 21, please provide their names and ages: Please provide a description of your cruising/sailing background: Submit Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Give us a call CYC 727-447-6000 office@clearwateryachtclub.org Become a Member × Become a Member Membership Types & Pricing Sponsor Name: Sponsor Surname: Member Number * Membership Type: * Full Social Summer Junior Military/First Responders Effective Date: * First Name: Surname: Telephone Number: Email Address: Date Of Birth: * Spouse Name: Spouse Surname: Spouse Date Of Birth: Primary Mailing Addres * Secondary Residence Unmarried Children of applicant 21 years of age and under, living at home or attending school on a full-time basis. If you have more than 3 children, please use the comment section to add them. Name Name Name Birthday Birthday Birthday Gender: Male Female Transgender Non-binary/non-conforming Prefer not to respond Gender: Male Female Transgender Non-binary/non-conforming Prefer not to respond Gender: Male Female Transgender Non-binary/non-conforming Prefer not to respond Comment: Business Information Work Info: * Working Retired Business Name: * Telephone: * Business Adress: * Occupation: * Title: * Years in Present Employment: * Social Club Affiliations Name of Club/Organization: Type: Year Accepted: Name of Club/Organization: Type: Year Accepted: Boat Information Boat Name: * Boat Power: * Sail: Sail Make: * Length Overall: * Beam/Draft * Do you want to put your name on the waiting list for a slip at the club? * $150 refundable fee Yes No Other Vessels: jet skis, inflatables, wave runners, etc. Interests Please indicate the areas of interest you have in joining CYC.  Check those that apply: Interests: Arts & Crafts Activities Book Club Entertainment & Social Events Fashion Shows Formal & Casual Dining Youth Sailing Ladies Luncheons Ladies Sailing Ladies Social Group Membership Recruitment RV Cruising Sailing & Regattas Weekend Cruising Wine Tastings Formalities Credit cards on file will be used in collecting any delinquent accounts over 60 days. Copy of Driver’s License * Choose File Copy of Credit Card * Choose File Signatures Applicant Name: * By typing my name below, I understand and agree that this form of electronic signature has the same legal force and effect as a manual signature. Applicant Signature * Spouse Name: By typing my name below, I understand and agree that this form of electronic signature has the same legal force and effect as a manual signature. Sponsor Signature Submit Thank you for your application. It has been sent. × There was an error trying to send your application. Please try again later. × Close Directions × Here Is How To Get To Us By Car From downtown Clearwater follow the signs to the beach (SR60). Once on the beach turn left onto Gulfview Blvd and make a left turn onto South Bayway Blvd. You may also print a map and get detailed driving directions from your location. By Boat If approaching from the Gulf of Mexico, enter Clearwater Harbor through the Clearwater Pass. Proceed under the fixed span Clearwater Pass Bridge (74 feet vertical clearance), turn to port at marker #10. Proceed to markers #2 and #3 at Clearwater Point and follow that channel to marker #7. Turn to port and keep the small private markers #1 and #3 close aboard on your port side. Proceed heading west directly to the Yacht Club. If approaching from the Intracoastal, turn west at marker #12. Follow that channel to marker #2 at Clearwater Point, turn north, and proceed as above. Our Dockmaster monitors VHF channel 16 (working channel 71) from 0900 to 1600 Tuesday through Sunday and will be happy to assist you. Heading out the pass? Be careful, especially at low tide. A large shoal has formed across the entrance to Clearwater Point Channel, between markers No. 2 and No. 3. View the aerial photo below. Please note this photo is not to be used for navigation. Close Our next Event Waterside Meeting September 11 @ 5:30 pm - 6:30 pm Get in touch fast Quick Enquiry Simply select what you would like to do, and fill out the correct form. We will get in touch with you very shortly. If you require urgent information, just give us a call. What Would You Like To Do? Request A Slip Learn To Sail Contact General Manager Contact Office Manager Contact Dockmaster First Name: Surname: Telephone Number: Email Address: Your Message: Length * Type Power Sail Draft * Beam * Boat Name Member Number * Home Yacht Club Requested Arrival Date * Requested Departure Date * Date Of Birth Street Address City State Zip Code If you are married, please provide the name of your spouse: If you have any children under the age of 21, please provide their names and ages: Please provide a description of your cruising/sailing background: Submit Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Give us a call CYC 727-447-6000 office@clearwateryachtclub.org Become a Member Directions Our next Event Waterside Meeting September 11 @ 5:30 pm - 6:30 pm Be The First To Find Out What’s On Don´t worry. We will never spam you with emails. Simply subscribe to our monthly newsletter, so you don´t miss out on upcoming events, and latest news. Email Address Subscribe Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × © Copyright 1911 - 2025 |   Created by Elite CXS Digital |   All Rights Reserved Page load link Clearwater Yacht Club Go to Top"
    },
    {
      "url": "https://www.tampabay.com/archive/2011/07/24/clearwater-golf-operator-looks-to-largo/",
      "text": "CLEARWATER GOLF OPERATOR LOOKS TO LARGO Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Archive CLEARWATER GOLF OPERATOR LOOKS TO LARGO Clearwater Country Club's operator wants to run Largo Golf Course. By WILL HOBSON Published | Updated MORE FOR YOU Photos: Clearwater Ferry crash • Transportation After a baby was born in a hurricane shelter, a witness is left wondering • Hurricane Advertisement Hurricane Helene to keep Tampa Bay area schools closed Friday • Hurricane More Florida faculty still looking to leave the state, survey shows • Archive Drivers could cross the new Howard Frankland in six months. Here’s what’s left. • Transportation What to expect from the Lightning at NHL trade deadline • Sports Tampa council approves $14 million to settle wrongful conviction lawsuit over 1983 murder • Tampa Florida makes it official: Universities to drop sociology as a core course • Archive Pete Alonso’s Battle for the Bay knocks giving back out of the park • Photos Tampa woman charged after 3 puppies found in dumpster, police say • Breaking News Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.clearwaterclub.org/about-us",
      "text": "About us | Clear Water Club top of page Log In Start Mission FAQ Voices Shop Contact Impressum Privacy More Use tab to navigate through the menu items. Meet the Team Dreamers. Believers. Achievers. Clear Water Club is the digital meeting place for health-conscious people. And it was precisely these kinds of people who started the project. We have always been fascinated by topics such as sport, nutrition and regeneration. However, we soon agreed that the biggest lever for health is the water we drink. And that's exactly how we came up with the idea of setting up this website. The focus was always just one thing: Your health! ​ As you can imagine, when we founded this enterprise we were diving into uncharted territory with no expectations at all. What we had was an idea worth exploring. We strongly believe in the objective of this project and signed-up for the mission to educate and distribute our knowledge far and wide. This website was made for that purpose. Building a strong community around \"water-awareness\" and developing a solid understanding of the benefits of distilled water for human health and longevity, those were (and still are) our main goals. Since then we are getting a little closer to becoming the \"go-to-website\" for everything water- and health-related every day. This is our ask, this will be our mission - and a big first step towards something bigger? Time will tell! We are glad to have you on board. Thank you for walking this path with us! If you ever have a question, please don't hesitate to get in contact. Looking forward to hearing from you soon! Founder & CEO Marc marc@cwc.com 123-456-7890 COO & Head of Strategy Katharina katharina@cwc.com 123-456-7890 Design & Photography Juri juri@cwc.com 123-456-7890 Marketing & Advertisement Max max@cwc.com 123-456-7890 Media Management Ranya ranya@cwc.com 123-456-7890 Technical Development Stephan stefan@cwc.com 123-456-7890 ©2023 von Clear Water Club. bottom of page"
    },
    {
      "url": "https://www.cwbgolf.org/contact-us/",
      "text": "Contact Us – The Clearwater Bay Golf & Country Club Skip to content Skip to footer 10 September 2025 25 °C Search Contact Us Members' Zone EN 繁 About Us Message from Chairman Message from General Manager Members’ Council Club Management Vision, Mission & History Membership Reciprocal & Affiliated Clubs Our Ambassadors Careers The Club Golf Club Marina Club Country Club Sports Academy Community Outreach and Charity Charitable Foundation About Us Message from Charitable Foundation Chairman Latest News Close 10 September 2025 25 °C About Us Message from Chairman Message from General Manager Members’ Council Club Management Vision, Mission & History Membership Reciprocal & Affiliated Clubs Our Ambassadors Careers The Clubs Golf Club Marina Club Country Club Sports Academy Community Outreach and Charity Charitable Foundation About Us Message from Charitable Foundation Chairman Latest News Contact Us Logout EN 繁 Contact Us Facilities Open to Outside Bodies The Clearwater Bay Golf & Country Club is committed to promoting the development of sports in Hong Kong and to providing greater access to the Club’s facilities by the following approved outside bodies: Any schools registered under the Education Ordinance (Cap. 279) Full List Here Any non-governmental organisations that is receiving recurrent subvention from the Social Welfare Department Full List Here Any “National Sports Association” which is affiliated to its respective International Federation and is a member of the Sports Federation & Olympic Committee of Hong Kong, China Full List Here Any uniformed groups and youth organisations that is receiving recurrent subvention from the Home Affairs Bureau Full List Here Any Government Departments Full List Here For enquiries, please contact Ms Fanita Tam, Senior Member Relations / Spa & Wellness Manager 2335 3788 fanitatam@cwbgolf.org For Academy Course bookings and/or further information please click Here 2335 3878 sr@cwbgolf.org Academy Course Enrolment requirements Visitors that have prior Golf Experience (no handicap required) are welcome to book and play on the Academy Course on all weekdays (except Hong Kong Public Holidays) with tee-off times available from 8:00am to 5:00pm. Please note the Academy Course is closed for regular maintenance every Tuesday morning and reopens at midday. Green-Fees for Local and Overseas Visitors 6-holes HK$500 12-holes HK$600 18-holes HK$700 Golf Carts Fees for Local and Overseas Visitors 6-holes HK$70 per Golf Cart 12-holes HK$110 per Golf Cart 18-holes HK$150 per Golf Cart Rental Golf Equipment Club HK$50 per Club Contact Us Name Email Subject Select... Golf Sports & Recreation Food & Beverage Marina Membership Other Your Message 139 Tai Au Mun Road, Clearwater Bay, N.T., Hong Kong (852) 2335 3700 About Us Academy Latest News Golf Club Marina Club Country Club COP Contact Us The Clearwater Bay Golf & Country Hong Kong © 2025. All rights reserved. Disclaimer | Privacy Policy Statement"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club",
      "text": "Countryside Country Club | Clearwater, FL | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Countryside Country Club Main Site Navigation Who We Are Amenities Golf Membership Host An Event Join Now Host Event Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Amenities Dining Tennis Meet Our Tennis Staff Swimming Fitness Spa Kid Zone Camps Golf Bayhead Course Lake Course Pine Course Membership Host An Event Weddings Events Meetings & Corporate Event Rooms Tournaments & Outings Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Gary Player Design Since the early 1980’s, Gary Player Design has been a global leader in golf course design with more than 135 courses completed worldwide. The business’s mission is founded on the principles of the man, Gary Player, who has always maintained that quality and professionalism are not negotiable. As a course designer, Gary Player and Gary Player Design are always steadfast in their ambition to create beauty and harmony and a playable golf course that honors the average member. Golf Play 27 holes of world-class championship golf re-designed exclusively by Gary Player and enjoy spectacular putting greens, a driving range and a fully equipped golf Pro Shop. The beautiful course features a striking and picturesque landscape that varies in challenge for players of every age and skill. With cutting-edge draining technology, golf at Countryside is largely unaffected by Florida's seasonal storms. Come play! Explore Golf Membership Discover all the many benefits of life at Countryside, including nationwide access to premier private clubs. Explore Membership Link opens in new page View Our Membership Brochure Dining Enjoy our talented culinary experts' vast selection of mouthwatering dishes, including American classics and bold seasonal specialties. Here, we're always cooking up something delicious. Explore Dining Fitness Look good, feel better and stay healthy in our state-of-the-art fitness center and spa, conveniently located on site. Explore Fitness Tennis Perfect your server at one of out 14 lighted outdoor courts and one of the finest tennis programs in all of Clearwater. Explore Tennis Host an Event Guaranteed to make your next wedding or event unforgettable, our gorgeous private venues are run by our professional service staff. Find a Venue Cross Bay & Cross Bay Premier Benefits If you're looking to enhance your membership with some exciting local club perks, this offers incredible value. With the Cross Bay benefits, you'll have the opportunity to relish golf access at discounted cart fees and enjoy reduced guest fees at not just two extra country clubs (Cross Bay) but THREE extra clubs (Cross Bay Premier) within the Tampa Bay region. Furthermore, you'll receive a 25% discount on food and beverage purchases at the additional clubs as well as your home club. Additionally, you can take advantage of special pricing for booking private events. Membership Team Matthew McCracken Membership Director Contact Me 727-350-1176 Contact Me About Matthew + Close Matthew McCracken information modal Matthew McCracken Membership Director Serving since 2022 727-350-1176 Matthew.McCracken 727-350-1176 Matthew.McCracken Contact Me About Matthew Matt brings over 15 years of sales and relationship management experience. Matt began his hospitality journey within the restaurant industry. His Iowa City restaurant was voted most romantic both years he was there. After meeting his wife Ruhee, he started a family with Mason and Maverik. Matt transitioned to banking for a leading Fortune 50. He was labeled the top finance sales producer within the consumer lending division before departing to Florida. Prior to Matt taking over the Membership Director role at Countryside, he championed the payments industry helping local neighbors save time and money. Within 3 years he was helping to facilitate over $75MM in transaction volume while monitoring over 1MM transactions annually. McCracken also finds the time to give back, donating his time and money to Wounded Warrior Project, Folds of Honor, 22 Until Valhalla and numerous groups helping our veterans, military and first responders. Contact Me Ashley Hauser Member Experience Director Contact Me 727-796-2153 Contact Me About Ashley + Close Ashley Hauser information modal Ashley Hauser Member Experience Director Serving since 2015 727-796-2153 Ashley.Hauser 727-796-2153 Ashley.Hauser Contact Me About Ashley Ashley joined the Countryside team in November 2015. Ashley was previously Countryside's Children's / Fitness Program Coordinator and is now serving as our Member Experience Director. Ashley obtained a B.A.S degree in Management and Organizational Leadership from St. Petersburg College.  In her spare time, Ashley enjoys spending time with family, friends and going to Universal. Ashley enjoys planning events and is excited to create unforgettable experiences for our Members here at Countryside! Contact Me Andy Bianchi General Manager Contact Me 727-796-2153 Contact Me About Andy + Close Andy Bianchi information modal Andy Bianchi General Manager Serving since 2010 727-796-2153 Andy.Bianchi 727-796-2153 Andy.Bianchi Contact Me About Andy Originally from Rome, Italy, he came to study English as a second language in 1996 in Miami, Florida. After 3 months of super-intensive courses, he attended Florida International University where he graduated with a Bachelor of Science in Hospitality Management. Andy worked for Intercontinental Hotels, Sofitel, Bentley Luxury Suites hotel in Miami Beach, Crown Golf and Invited for the last 10 years. Andy is fluent in Italian, Spanish and French and he is a certified pool operator. He is passionate about sports in general and considers his job a privilege. \"You know it is not your typical 9-5 job when your office is surrounded by tennis courts, a pool, a gym and 80 children screaming and playing. Having worked in the past for big hotel chains where customers go and come daily, I really enjoy building long-lasting relationships and enriching member's lives as well as my own!\" Contact Me Member Benefits Beyond the Club Our Members have access to the industry-leading Invited Network of more than 300 country clubs and business clubs nationwide. Plus, special offerings at more than 1,000 hotels, resorts and entertainment venues. Learn More Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Amenities Golf Membership Host An Event Contact Us Countryside Country Club Opens in new window 3001 Countryside Blvd Clearwater, FL \r\n                                33761 1 727-796-2153 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.clearwatercountryclub.com/golf/pro-shop/golf-instructors-at-clearwater-c-c/",
      "text": "Golf Instructors at Clearwater C.C. - Clearwater Country Club Skip to main content Skip to footer Clearwater Country Club Clearwater, FL Home Golf Course Golf Course Golf Facilities Rates Golf Shop Gallery Tournaments & League Play League Information Tee Times Golf Shop Golf Shop Let Us Host Your Event Golf Instructors at Clearwater C.C. Summer Junior Golf Camp Trackman Membership Membership Banquets Flyover Contact Us Contact Us Directions Email Club Golf Instructors at Clearwater C.C. Gregory McClimans, PGA PGA Head Professional Works with Trackman 4 Launch Monitor Individual and Group Lessons Indoor/Outdoor Email at gsm4290@gmail.com Call at 727-459-9565 Harrison McClimans PGA Level 3 Associate Works with Trackman 4 Launch Monitor Indoor facility and Outdoor facility Individual Lessons Group Lessons -On Course Instruction -Short Game Specialist Email at harrisonmac10@gmail.com Call at 727-251-5935 *Discount Packages available Jeff Haney, PGA 33 years teaching experience Old Dominion University Teaching Professional for 7 years New Student One Hour Introductory Video Lesson – $40 Full Swing, Short Game, Putting Private & Group Instruction Corporate & Specialty Clinics Playing Lessons (727) 365-7235 Email Jeff at: Jeff@jeffhaneygolf.com Visit Jeff’s website: www.JeffHaneyGolf.com Text “HANEY” to 63975 for information and specials Mike Riso “We Make Learning Golf Simple.” PGA Associate Over 37 years teaching experience Small individual attention classes Online instruction – Learn anywhere worldwide Phone: 727-776-8380 Email: mike@mikeriso.com Website: Mikerisogolf.com Footer Weather CLEARWATER WEATHER Visit Us Clearwater Country Club 525 N Betty Ln. Clearwater, FL 33755 Call Us Phone: (727) 446-9501 Ext 101 Clearwater Country Club |   | Call (727) 446-9501 Ext 101 for Clubhouse Services, Ext 106 for Tee Times Copyright © 2025 Clearwater Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are",
      "text": "Who We Are | Countryside Country Club | Clearwater, FL | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Countryside Country Club Main Site Navigation Who We Are Amenities Golf Membership Host An Event Join Now Host Event Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Amenities Dining Tennis Meet Our Tennis Staff Swimming Fitness Spa Kid Zone Camps Golf Bayhead Course Lake Course Pine Course Membership Host An Event Weddings Events Meetings & Corporate Event Rooms Tournaments & Outings Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Who We Are Skip Image Carousel Discover the Countryside Difference The Countryside experience starts with you. We proudly offer programs, lessons, leagues and teams across all sports and all levels, including youth. Our beautiful clubhouse includes men’s and ladies’ locker rooms, a pro shop and casual and fine dining options. Whatever brings you life, you'll find the best of it right here. Our Team Calendar Directions & Hours A Warm, Welcoming Oasis Where Friends and Family Come Together Welcome! Here you'll discover the ultimate upscale home away from home just for you, where families come together, where friends become like family and where you create those special moments you will cherish forever. You'll find diverse golfing and tennis facilities featuring 27 holes of golf and 14 tennis courts. When you add a state-of-the-art fitness center, spa facilities, great dining, an attentive private events department, children's programming, two pools and a newly renovated bar and dining room, it's easy to see why we're the ideal Club to bring your luxe living dreams to life. Schedule A Tour A Friendly, Relaxed Environment For Friends & Family Countryside Country Club is dedicated to providing a home away from home for the family while creating those special moments you will cherish forever. At our Club, you'll find diverse golfing and tennis facilities, featuring 27 holes of golf and 14 tennis courts. When you add a state-of-the-art fitness center, spa facilities, great dining, an attentive private events department, programming for children, two pools and a newly renovated bar and dining room, it's easy to see why we're the ideal Club for your family and business needs. With versatility in both recreational amenities and special programs, Countryside Country Club appeals to a variety of Members of all ages. It’s the perfect place for families, friends, and business associates to come together and enjoy leisure time activities. Club Events Whether you're part of an active family or you're a busy professional with a passion for sports and social activities, we provide facilities and features to meet all your needs. With exceptional programming, business and social events, Members build lifelong relationships and develop a network of connections that lead to personal fulfillment and invaluable family memories. Tournaments - Join your fellow Members for fun and competitive Club-hosted tournaments. This is Club spirit at its finest. Networking - Build your network of business and social connections at our special Member events. Our Members include local professionals, civic and community leaders and other influential people to enhance your circle of friends. Kids & Family - We offer programs for kids of all ages and their families. From sports teams and leagues to special dining events and fun activities, we have something for every member of your family. Enriching Programs - Our programs are designed to enrich your life with cultural, educational and business-oriented events to match your interests. Enjoy guest speakers, professional seminars and special Member clubs and events. Holidays - We enjoy celebrating holidays at the Club. Watch our calendar for special traditions and events, as well as holiday dining features. We're also ready to help you host the perfect party with catering for any occasion. Membership Team Matthew McCracken Membership Director Contact Me 727-350-1176 Contact Me About Matthew + Close Matthew McCracken information modal Matthew McCracken Membership Director Serving since 2022 727-350-1176 Matthew.McCracken 727-350-1176 Matthew.McCracken Contact Me About Matthew Matt brings over 15 years of sales and relationship management experience. Matt began his hospitality journey within the restaurant industry. His Iowa City restaurant was voted most romantic both years he was there. After meeting his wife Ruhee, he started a family with Mason and Maverik. Matt transitioned to banking for a leading Fortune 50. He was labeled the top finance sales producer within the consumer lending division before departing to Florida. Prior to Matt taking over the Membership Director role at Countryside, he championed the payments industry helping local neighbors save time and money. Within 3 years he was helping to facilitate over $75MM in transaction volume while monitoring over 1MM transactions annually. McCracken also finds the time to give back, donating his time and money to Wounded Warrior Project, Folds of Honor, 22 Until Valhalla and numerous groups helping our veterans, military and first responders. Contact Me Ashley Hauser Member Experience Director Contact Me 727-796-2153 Contact Me About Ashley + Close Ashley Hauser information modal Ashley Hauser Member Experience Director Serving since 2015 727-796-2153 Ashley.Hauser 727-796-2153 Ashley.Hauser Contact Me About Ashley Ashley joined the Countryside team in November 2015. Ashley was previously Countryside's Children's / Fitness Program Coordinator and is now serving as our Member Experience Director. Ashley obtained a B.A.S degree in Management and Organizational Leadership from St. Petersburg College.  In her spare time, Ashley enjoys spending time with family, friends and going to Universal. Ashley enjoys planning events and is excited to create unforgettable experiences for our Members here at Countryside! Contact Me Andy Bianchi General Manager Contact Me 727-796-2153 Contact Me About Andy + Close Andy Bianchi information modal Andy Bianchi General Manager Serving since 2010 727-796-2153 Andy.Bianchi 727-796-2153 Andy.Bianchi Contact Me About Andy Originally from Rome, Italy, he came to study English as a second language in 1996 in Miami, Florida. After 3 months of super-intensive courses, he attended Florida International University where he graduated with a Bachelor of Science in Hospitality Management. Andy worked for Intercontinental Hotels, Sofitel, Bentley Luxury Suites hotel in Miami Beach, Crown Golf and Invited for the last 10 years. Andy is fluent in Italian, Spanish and French and he is a certified pool operator. He is passionate about sports in general and considers his job a privilege. \"You know it is not your typical 9-5 job when your office is surrounded by tennis courts, a pool, a gym and 80 children screaming and playing. Having worked in the past for big hotel chains where customers go and come daily, I really enjoy building long-lasting relationships and enriching member's lives as well as my own!\" Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Amenities Golf Membership Host An Event Contact Us Countryside Country Club Opens in new window 3001 Countryside Blvd Clearwater, FL \r\n                                33761 1 727-796-2153 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.invitedclubs.com/clubs/countryside-country-club/who-we-are/our-team",
      "text": "Our Team | Countryside Country Club | Clearwater, FL | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Countryside Country Club Main Site Navigation Who We Are Amenities Golf Membership Host An Event Join Now Host Event Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Amenities Dining Tennis Meet Our Tennis Staff Swimming Fitness Spa Kid Zone Camps Golf Bayhead Course Lake Course Pine Course Membership Host An Event Weddings Events Meetings & Corporate Event Rooms Tournaments & Outings Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Who We Are Our Team Who We Are Calendar Directions & Hours Our Team Andy Bianchi General Manager Contact Me 727-796-2153 Andrea.Bianchi Contact Me About Andy + Close Andy Bianchi information modal Andy Bianchi General Manager Serving since 2010 727-796-2153 Andy.Bianchi 727-796-2153 Andy.Bianchi Contact Me About Andy Originally from Rome, Italy, he came to study English as a second language in 1996 in Miami, Florida. After 3 months of super-intensive courses, he attended Florida International University where he graduated with a Bachelor of Science in Hospitality Management. Andy worked for Intercontinental Hotels, Sofitel, Bentley Luxury Suites hotel in Miami Beach, Crown Golf and Invited for the last 10 years. Andy is fluent in Italian, Spanish and French and he is a certified pool operator. He is passionate about sports in general and considers his job a privilege. \"You know it is not your typical 9-5 job when your office is surrounded by tennis courts, a pool, a gym and 80 children screaming and playing. Having worked in the past for big hotel chains where customers go and come daily, I really enjoy building long-lasting relationships and enriching member's lives as well as my own!\" Contact Me Matthew McCracken Membership Director Contact Me 727-350-1176 Matthew.Mccracken Contact Me About Matthew + Close Matthew McCracken information modal Matthew McCracken Membership Director Serving since 2022 727-350-1176 Matthew.McCracken 727-350-1176 Matthew.McCracken Contact Me About Matthew Matt brings over 15 years of sales and relationship management experience. Matt began his hospitality journey within the restaurant industry. His Iowa City restaurant was voted most romantic both years he was there. After meeting his wife Ruhee, he started a family with Mason and Maverik. Matt transitioned to banking for a leading Fortune 50. He was labeled the top finance sales producer within the consumer lending division before departing to Florida. Prior to Matt taking over the Membership Director role at Countryside, he championed the payments industry helping local neighbors save time and money. Within 3 years he was helping to facilitate over $75MM in transaction volume while monitoring over 1MM transactions annually. McCracken also finds the time to give back, donating his time and money to Wounded Warrior Project, Folds of Honor, 22 Until Valhalla and numerous groups helping our veterans, military and first responders. Contact Me Sasha Rosenzwog Event Sales Director Contact Me Sasha.Rosenzwog Contact Me + Close Sasha Rosenzwog information modal Sasha Rosenzwog Event Sales Director Serving since 2025 Sasha.Rosenzwog Sasha.Rosenzwog Contact Me Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Amenities Golf Membership Host An Event Contact Us Countryside Country Club Opens in new window 3001 Countryside Blvd Clearwater, FL \r\n                                33761 1 727-796-2153 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://clearwatersecurity.com/contact/",
      "text": "Contact Us | Clearwater Contact About Us Who We Serve Careers Cybersecurity & Risk Managed Service Programs ClearAdvantage Program Scale cybersecurity & compliance as a program that elevates trust with patients, partners, and vendors ClearConfidence Program Drive ongoing cyber risk identification and reduction through our tech-enabled solution Managed Security Services Detect and mitigate cyber threats before they become a crisis by leveraging the expertise of Healthcare’s MSSP Cybersecurity Assist Partner Program (CAPP) Risk Management Enterprise Cyber Risk Management OCR-Quality® Risk Analysis OCR-Quality® Risk Response 405(d) HICP Assessment Vendor Risk Management as a Service Security Consulting vCISO Incident Response NIST CSF Maturity Assessment Medical Device Security Resiliency Services Technical Security Testing Cloud Services Managed Cloud Services Accelerate and protect your healthcare business in the cloud with expert-led Azure and Microsoft 365 security, compliance, and operations management Hybrid Cloud Security & Assistance Leverage our healthcare cloud expertise for hybrid setups, migrations, and security assessments integrated with on-prem services Cloud Security Posture Management Continuous monitoring of cloud infrastructure for risks and misconfigurations, with expert-guided remediation support Privacy & Compliance Privacy Privacy Risk Assessment Patient Privacy Monitoring Services Privacy Program Development Privacy Staffing & Training Expert Witness Services Compliance Platform IRM|Pro® IRM|Analysis® IRM|Privacy® IRM|Security® IRM|Performance™ IRM|405(d) HICP™ Compliance Healthcare Compliance HIPAA Risk Analysis HIPAA Privacy & Breach Notification NIST-800-171 Assessment Compliance Program Effectiveness Compliance Program Development Compliance Staffing & Training Certification & Audit HITRUST PCI DSS SOC 2 CMMC EPCS Resources Blog Webinars & Events Case Studies eBooks Podcasts On-Demand Webinars White Papers Book: Enterprise Cyber Risk Management as a Value Creator Book: Stop the Cyber Bleeding About Us Who We Serve Contact Select Page Contact Us We want to hear from you! Please use this form to let us know a little more about you and your organization and how we can be helpful to you.  (800) 704-3394  Security Operations Center +1 855 588 0145  info@clearwatersecurity.com  Nashville, TN Connect With Us Connect With Us Terms of Use | Privacy Policy ©2025 Clearwater Security & Compliance LLC"
    }
  ]
}