{
  "fuentes": [
    {
      "url": "https://www.clearwaterjazz.com/partners/",
      "email": "gary@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/education/",
      "email": "deb@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/education/",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/",
      "email": "volunteer@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/",
      "email": "volunteers@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact_us.html",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/covid19.html",
      "email": "deb@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/festival-info/",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/festival-info/",
      "email": "media@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/festival-info/",
      "email": "volunteer@clearwaterjazz.com"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "email": "info@theclearwaterfoundation.com"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "email": "partnerships@theclearwaterfoundation.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about_us_education.html",
      "email": "deb@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about_us_education.html",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "deb@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "gary@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "music@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "steve@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "volunteer@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "email": "volunteers@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "deb@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "gary@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "music@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "steve@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "volunteer@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "email": "volunteers@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/index.html",
      "email": "volunteer@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/index.html",
      "email": "volunteers@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/sponsorship.html",
      "email": "gary@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/ticketing.html",
      "email": "info@clearwaterjazz.com"
    },
    {
      "url": "https://www.clearwaterjazz.com/about_us_cjh.html",
      "email": "info@clearwaterjazz.com"
    }
  ],
  "mails": [
    "deb@clearwaterjazz.com",
    "gary@clearwaterjazz.com",
    "info@clearwaterjazz.com",
    "info@theclearwaterfoundation.com",
    "media@clearwaterjazz.com",
    "music@clearwaterjazz.com",
    "partnerships@theclearwaterfoundation.com",
    "steve@clearwaterjazz.com",
    "volunteer@clearwaterjazz.com",
    "volunteers@clearwaterjazz.com"
  ],
  "nombre_sitio": "clearwaterjazz.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.clearwaterjazz.com/partners/",
      "text": "PartnersClearwater Jazz Holiday Sponsorship Opportunities Choose a CLEARWATER JAZZ HOLIDAY SPONSORSHIP that works for you! Align with a 46-Year Community Tradition of Significant, Sustained Economic and Cultural Community Impact Customize a Unique Marketing Plan and VIP Experience that meets your Marketing Goals 5 Exciting & Effective S ponsorship Platforms! Click the Following Link to Learn More Clearwater Jazz Holiday Music Festival CJH Year-Round Education & Outreach CJH Presents Monthly Music Series The Bill Horne Community Day CJH Benefactor Partner Year-Round Impact and Visibility! Customize Your Plan Contact our Team for More Information about Custom Opportunities that Fit your Budget & Marketing Goals Gary Hallas 727-895-6264 gary@clearwaterjazz.com CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c  )  (3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 2025 Festival Sponsors Partner Photos Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/education/",
      "text": "Education and Outreach YEAR-ROUND IMPACT In addition to sustaining the longstanding festival tradition, Clearwater Jazz Holiday Foundation, a 501(c  )  (3  ) not-for-profit organization and proud winner of the 2016 Clearwater Regional Chamber’s Judge’s Choice Nonprofit of the Year, delivers year-round innovative programs, exciting performance opportunities, special funding, and creative learning experiences. CLICK HERE TO DONATE TODAY Join the family of partners below or DONATE to help expand the reach! INNOVATION AND CREATIVITY Celebrating the art form of Jazz with meaningful music appreciation and instructional experiences for people of all ages, backgrounds and abilities. INNOVATIVE PROGRAMS Innovative initiatives are changing lives and providing special experiences for people of all ages and backgrounds, from the very young to the elderly and from varying socio-economic backgrounds. CJH YOUNG LIONS PROGRAM YOUNG LIONS JAZZ MASTER SESSIONS A one-of-a-kind instructional experience for Bay area jazz students with group clinics, master class sessions, and performance opportunities involving university jazz educators and local jazz professionals. The Program occurs at a main event every December as well as in schools throughout the year. Clearwater Jazz Holiday Thanks Marcia P Hoffman School of the Arts, Al Downing Tampa Bay Jazz Association, St. Petersburg College and Yamaha For supporting the Young Lions Jazz Master Sessions . Young Lions Jazz Master \"Virtual\" Sessions Expanding upon our popular YOUNG LIONS JAZZ MASTER SESSIONS PROGRAM FREE VIRTUAL MUSIC LESSONS and MASTER CLASS INSTRUCTIONAL SESSIONS ZOOM PLATFOM Approximately 45-60 minute sessions …and visit THE STUDIO for ARCHIVED SESSION RECORDINGS and OTHER MATERIALS Clearwater Jazz Holiday Thanks Our Supporters Expanding the Reach of the Young Lions Jazz Master “Virtual Sessions i ncluding The Anderson Foundation Al Downing Tampa Bay Jazz Association UPCOMING SESSIONS Stay Tuned! CJH HISTORY OF JAZZ PROGRAMMING HISTORY OF JAZZ OUTREACH PROGRAM Interactive, musical presentations featuring local musicians offered to schools (including Title I  )  and other special groups covering the culture, history, and feel of jazz and its evolution as a unique, American art form. By the Spring of 2020, CJH had impacted over 30,000 students with this innovative program and has also adapted it to provide meaningful experiences to older adults in our community, memory care centers, as well as organizations and schools serving people with special needs. Clearwater Jazz Holiday Thanks Pinellas Community Foundation, Pinellas Realtor Organization, Landon Korabek Foundation, and Rotary Club of Largo for supporting the History of Jazz Outreach Program . STOP-TIME SERIES with Frank Williams Enhancing our enduring HISTORY OF JAZZ OUTREACH PROGRAM A Comprehensive VIDEO and AUDIO HISTORY OF JAZZ ARCHIVE Produced with our friend and long-time education partner FRANK WILLIAMS VISIT the STOP-TIME SERIES page and start your journey through time Clearwater Jazz Holiday Thanks Pinellas Realtor Organization and Pinellas Community Foundation For their support of the STOP-TIME SERIES and History of Jazz Outreach Program MY JOURNEY WITH JAZZ In-Person PROGRAM My Journey with Jazz is a music mentoring program in a unique game format where students learn about important people, places and music that shaped the history of jazz. It delivers a fun and meaningful experience to afterschool and summer programs in economically challenged or underserved communities. What started as a pilot effort at the Clearwater Neighborhood Family Center has grown to serve many others including Mattie Williams NFC, High Point NFC, the Greater Regional Area Youth Development Initiative, Union Academy NFC, Sanderlin NFC and the Pinellas Sheriff's Police Athletic League. Clearwater Jazz Holiday Thanks Duke Energy, Pinellas Community Foundation, Landon Korabek Foundation and Seaside National Bank & Trust For supporting the My Journey with Jazz Program . My \"Virtual\" J ourney with Jazz A collection of EDUCATIONAL VIDEOS highlighting the People, Places, and Music covered in CJH’S MY JOURNEY WITH JAZZ PROGRAM Engaging the Family of Musicians who bring this wonderful program to NEIGHBORHOOD FAMILY CENTERS and other groups in our COMMUNITY VISIT the my “virtual” journey with jazz page Clearwater Jazz Holiday Thanks Pinellas Community Foundation, Duke Energy Foundation, and the Pinellas County Sheriff’s Office For their Support of the My “Virtual” Journey with Jazz Program CJH GIVE THEM A STAGE PROGRAM GIVE THEM A STAGE & THEY WILL SHINE CJH is known for showcasing young, incredibly talented, home-grown musicians, helping these aspiring artists to build confidence, hone their craft, and develop fans through special learning and performance opportunities. Whether at the festival, throughout the year at CJH events, or at special CJH corporate and outreach partner functions, these experiences are invaluable opportunities for young musicians to network, promote their art, and develop important planning and communication habits. In many instances these artists enjoy an opportunity to play with more established professionals and also benefit from a paid gig! Clearwater Jazz Holiday Thanks The Anderson Foundation and the many CJH donors For supporting the My Journey with Jazz Program. If you or your organization have interest in featuring young musicians at your next event or if you would like to sponsor a trio of Young Lions for an at home back yard or front porch concert please email info@clearwaterjazz.com and let’s give them a stage! BUILD-A-GUITAR PROGRAM An annual initiative designed to engage the greater family of CJH corporate partners and other supporters around a unique team building program where participating teams assemble special guitars which are donated to CJH outreach partners. CJH also provides onsite group guitar lessons throughout the year with these outreach partners, typically neighborhood family centers in economically challenged and underserved communities. CJH also has a fun virtual adaptation of the lessons. You can enjoy the Full Recorded Sessions of JJ Patishall’s Basic Guitar Series (for beginners  )  for FREE courtesy of Clearwater Jazz Holiday Foundation. Click Here Clearwater Jazz Holiday Thanks Best Corporate Events for donating its wonderful Build-A-Guitar® Charitable Program and giving the gift of music to young people in our community and The Anderson Foundation For supporting guitar lessons. CJH INSPIRES CJH identifies special opportunities to inspire young musicians with the gift of music. CJH collects donated instruments and also works with partners to help inspire young people to continue on their musical journey. Whether it is for a school jazz or band program, a committed student who may not otherwise be able to afford an instrument outside of the school system, or a dedicated proven talent, these gifts of beginner and professional grade instruments are a symbol of CJH’s strong belief in these young talents and the power of music to change lives. Clearwater Jazz Holiday Thanks RS Berkley, Best Corporate Events, and others for helping to make a difference in the lives of many talented young performers. ABOUT FRANK WILLIAMS Frank T. Williams III, a 40-year + educator, band director, clinician, author, adjudicator, and composer, is a long-time CJH education partner, important to the development of many CJH Outreach programs. THANK YOU TO ALL THE MUSICIANS who make Clearwater Jazz Holiday Foundation Education & Outreach So Special! Special Funding CJH has a long history of providing special funding in support of youth music and jazz education. Jazz & Band Programs This support includes annual contributions to middle and high school jazz ensembles and band programs participating in CJH’s History of Jazz Outreach Program, Young Lions Jazz Master Sessions, and School Give Back Program. Scholarships CJH also offers scholarships through the Pinellas Education Foundation to graduating high school seniors who demonstrate a unique music background and/or aspirations for careers involving music as well as to other students with interests in various facets of event production. In 2019, CJH additionally launched the Frank T. Williams III Summer Camp Scholarships which create meaningful jazz camp opportunities throughout the state for deserving young music students. Jazz Program at the Marcia P. Hoffman School of the Arts Lastly, CJH celebrates its longtime partnership with Ruth Eckerd Hall and is proud to provide annual funding to Marcia P. Hoffman School of the Arts at Ruth Eckerd Hall to support its renowned youth jazz program so that very talented Bay area jazz students can learn at a high level and experience exciting year-round performance opportunities across the CJH platform including the festival every October. Creative Learning Experiences CJH offers unique, event-based learning experiences. Students in area high schools and universities participate in various facets of event production including photography, journalism, stage and video production, culinary arts, graphic design and merchandising. St. Petersburg College MIRA Program CJH’s partnership with the Music Industry and Recording Arts Program at St. Petersburg College is now in its sixth year! CJH developed and delivers a special series of classroom discussions for students to gain real-world insight into the business of music plus the opportunity to volunteer / shadow, network, meet industry professionals and intern with CJH stage crew, production, artist hospitality and operations. The class has become one of the program’s most fun and coveted student opportunities. Operation Graduate Summer Workshop CJH developed a special annual workshop complementing the United Way’s successful credit recovery/graduation track program. educating participating students about CJH’s year-round impact while inspiring volunteerism and networking. We thank the following additional Partners for supporting and believing in #CJHOutreach : GET INVOLVED AND MAKE A DIFFERENCE! Education is a core component to the Foundation’s mission. If you would like to join our effort to support music & arts education in Tampa Bay or otherwise become part of the wonderful Clearwater Jazz Holiday family education and outreach team, please contact our office at 727-461-5200 or email deb@clearwaterjazz.com . Your financial support helps to sustain and grow these wonderful programs and initiatives. Please consider making a donation to the Foundation. CLICK HERE TO DONATE TODAY We appreciate your support and look forward to partnering with you! CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c  )  (3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Education and Outreach - Making a Difference! Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/",
      "text": "Volunteer / Clearwater Jazz Holiday About the Volunteer Program Thank you for your interest in volunteering at this year's On the Green in VOLUNTEER SIGN UP OPEN NOW! Volunteer Waiver 2025 Thank you for your Support! Have a large group or organization that wants to Volunteer? Please email volunteer@clearwaterjazz.com for information on the 2025 event. What do volunteers do? Volunteering is fun and a great way to meet new people! Volunteers work in all available areas throughout the event. Merchandise, Food Service, Hospitality and Ambassadors are just a few examples of the areas where volunteers are needed. Volunteers are also needed before and after the event for setup and breakdown. This event would not be a success without our volunteers. How long do volunteer shifts last? Volunteer shifts average about four hours long depending on the area. How old do I have to be to volunteer? The minimum age for volunteers is 16. Younger volunteers are welcome, but we ask that they work along with Mom or Dad. No volunteers under 21 are allowed to help in the wine and beer tents for obvious reasons. When do I check in? Please report to the Volunteer Check-In Area located on the corner of Cleveland & Osceola at least 30 minutes before your shift. Do I get anything for volunteering at the Clearwater Jazz Holiday? All volunteers receive a t-shirt, an unframed poster, a volunteer pin and a meal/beverage. You will also have the satisfaction of volunteering your time to one of the largest community events in Clearwater. What should I wear? Comfort is KEY! Comfortable shoes are a MUST! Wear shorts, a t-shirt or whatever you are most comfortable in. You may also want to bring a sweater or jacket, as the evenings may be cool. Who do I contact to change my volunteer time? Simply log-in with your username & password to manage your shift dates and times. The volunteer site will be open in late June through October 13th. After October 13th - NO CHANGES will be made to the online schedules. We look forward to working with you this year! Have additional questions? Please email volunteer@clearwaterjazz.com or call us at 727-351-2927 Sign Up Click Here to Sign up NOW We look forward to seeing you in October 16-19, 2025 Thank You for your support! Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact_us.html",
      "text": "Clearwater Jazz Holiday info@clearwaterjazz.com (727 )  461-5200 600 Cleveland Street, Suite 204 Clearwater, FL 33755 * Required Fields First Name: * Last Name: * Email Address: * Phone: Fax: Address: City: State: Zip: Message: Sign up to our Newsletter: Yes No Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/covid19.html",
      "text": "COVID-19 A NOTE TO OUR CJH FAMILY AND FANS REIMAGINING CLEARWATER JAZZ HOLIDAY 2021 Traditional Festival Format Thank you for your patience during these challenging times and our consideration of various strategies for the 2021 Clearwater Jazz Holiday music festival. We are planning to deliver another one-of-a-kind event for our 42 nd year, producing the festival in a reduce scale format In October. The health and well-being of all our constituents remain top priority. This includes our volunteers and staff, High Note Society members, corporate and outreach partners, beneficiaries of our education and outreach initiatives, participating musicians, and all the friends of CJH who make our family so special. Reimagining the CJH Experience in 2021 - A re-imagined series of events, with CJH’s special touch, starting in mid-February through mid-December 2021. These small-scale, socially distanced, intimate events provide a unique opportunity and setting for you to ENJOY! Continuing the Mission and How You Can Help! The Clearwater Jazz Holiday Foundation celebrates and promotes the art form of jazz through year-round innovative music appreciation and instructional programs, special funding, performance opportunities, exciting events, and creative learning experiences, supported by the longstanding, annual festival tradition. Much of our Education & Outreach programming also supports local musicians who help deliver these meaningful experiences to schools, neighborhood family centers, schools and organizations serving those with special needs, and older adult independent and assisted communities and memory care centers. We are proud of our response to COVID-19 and the unique and creative program adaptations continuing to make a BIG impact. Please visit with us on Facebook, Instagram and YouTube as well as our Education & Outreach page to see these activities in action. To name a few, these initiatives include our new Young Lions Jazz Master “Virtual” Sessions , new STUDIO video archive of past sessions, new Young Lions Jazz Master “Virtual” Sessions Podcast , new “Virtual” Basic Guitar Series, and new STOP-TIME SERIES with Frank Williams (which complements our History of Jazz Outreach Program by creating a comprehensive visual and audio History of Jazz archive delivered in Frank’s one-of-a-kind style  )  . These online resources are now positioned to benefit thousands of band directors and their students in Florida and beyond as they adjust to a new normal curriculum in this challenging environment. DONATE TO THE FOUNDATION We THANK the many supporters and businesses who have donated to the Foundation this year! As a cultural and educational 501(c  )  (3  )  organization that relies on social events, live performances, and on-site audience participation for its survival, we continue to explore creative ways to engage our community and provide meaningful outreach activities and experiences as we together weather this unprecedented challenge. If you have not already contributed, we appreciate your consideration. Your charitable donation not only helps to sustain the long-standing festival tradition, which unites a community and brings an enormous economic impact, but also meaningful year-round Education & Outreach programs changing lives and making a difference. DONATE NOW We look forward to more musical days ahead with you and as always THANK YOU for your support of Clearwater Jazz Holiday. Clearwater Jazz Holiday Foundation Team If you would like to join our effort to support music & arts education in Tampa Bay or otherwise become part of the wonderful Clearwater Jazz Holiday family education and outreach team, please contact our office at 727-461-5200 or email deb@clearwaterjazz.com . CLEARWATER JAZZ HOLIDAY IS A QUALIFIED 501(c  )  (3  )  ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FRESHFROMFLORIDA.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA DEPT. OF AGRICULTURE & CONSUMER SERVICES: CH15231 FEDERAL ID: 58-1910442 Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/festival-info/",
      "text": "Festival InfoClearwater Jazz Holiday Festival Map Experience the 46th Clearwater Jazz Holiday Celebration as We Return to our Roots with a Special, Familiar Format in Coachman Park’s Large Green on the Waterfront Map Not to Scale Concertgoers Purchase Reserved Seats on the Green or Enjoy the Festival with Two General Admission Options Classic CJH Green Experience – A vintage CJH vibe, featuring a dedicated section for blankets and lawn chairs located on the green behind the reserved seating area – MAIN LAWN GA TICKET Sunset Bluff Access – For those not purchasing Reserved Seats or a Main Lawn GA ticket, a nominal entrance fee provides access to the Sunset Bluff , a scenic area overlooking the green where attendees may also bring blankets and lawn chairs – SUNSET BLUFF GA TICKET Reserved Seats and Both General Admission options include access to the festival’s side stages and food and beverage vendors Please Visit our CJH Ticketing Options Page for Additional Information Additional Details: Kids under 12 are FREE in the General Admission areas when accompanied by an adult GA ticket holder-Main Law or Sunset Bluff areas Attendees with GA tickets may bring personal blankets ( max size 6’x8’  )  , lawn chairs, folding chairs, camp chairs, and similar seating for use in designated GA areas only ( Main Lawn & Sunset Bluff Areas  ) The Lower Plaza and Promenade Pier stages are Standing Room ONLY with some festival seating and high-top tables provided. Blankets and lawn chairs are NOT permitted in these areas The festival features different vendor, food, and bar areas accessible to all attendees throughout the venue Parking & Getting to Coachman Park The City of Clearwater’s Visit Coachman Park Page is a great resource for information about Coachman Park, Directions and Parking. Coachman Park’s address is 300 Cleveland Street, Clearwater, FL 33757. Here is a direct link to the City’s Getting Here & Finding Parking page with links to Directions , Alternate Transportation (boat, ferry, trolley, bike, bus, or rideshare  )  , and Accessible & Handicap Parking . Alternatively, this is a Google link with Directions to Coachman Park . Parking & Transportation Tips Plan ahead for parking. Park on-street in downtown or at one of the following larger lots or garages: -Lot 11, 224 Pierce Street (153 spaces, close to the event and $2 until 6 p.m.  ) -Pinellas County Parking Garage, 310 Court St. (498 spaces  ) -Garden Avenue Garage, 28 N Garden Ave. (255 spaces  ) -Municipal Services Building Garage,100 S Myrtle Ave. (283 spaces  ) -Grass Lot, 704 Court St. (150 spaces  ) -Pierce Street Lot, 200 S. Osceola Ave. (118 spaces  ) All city of Clearwater parking lots and garages are free on the weekend (except for Lot 11. Private lots may charge for admission. Please follow this link for a Full List of Lots and Garages in downtown and a map view of their locations. Consider the following modes of Alternate Transportation : -Clearwater Ferry - provides a safe waterborne transportation experience in a fun, fast and reliable method to and from Coachman Park, Clearwater Beach and Dunedin. -Jolley Trolley or PSTA - hop off at the Park Street Terminal. -Arrive by Boat - first-come, first-served, free mooring spaces. Available 8 a.m. to 9 p.m. with a 4-hour mooring limit. -Bike to Coachman Park - via the nearby Memorial Causeway Trail or Pinellas Trail. There are multiple bike racks to secure your bicycle in the park. -Rideshare is always a great options. Specific festival drop-off and pick-up locations will be posted here closer to the festival. FAQs Is the 46th Clearwater Jazz Holiday a paid admission event? Yes, we return to our roots, October 16-19, 2025. The festival will feature the main stage concerts back on the large green in Coachman Park over-looking the waterfront ( adjacent to the amphitheater, and the 2025 Experience also features late afternoon, smaller concerts in the Lower Plaza and Promenade Pier areas prior to the headlining artists taking the main stage in the evenings on the green. Concertgoers purchase Reserved Seats on the green ( tiers include Reserved Seating, Premium Reserved Seating, and VIP/Reserved Seating  )  or enjoy two General Admission areas: 1  )  a re-introduction of the vintage, CJH GA experience with dedicated sections for blankets and lawn chairs situated on the green behind the reserved seating section ( Main Lawn GA  ) , or 2  )  for attendees who are not purchasing Reserved Seats or Main Lawn GA tickets to sit on the green, there is a nominal entrance fee into Coachman Park allowing these attendees to roam between the smaller stages and also sit with blankets and lawn chairs on the Sunset Bluff over-looking the green ( Sunset Bluff GA  ) . Personal blankets ( 6x8  )  and lawn chairs are permitted in both GA areas behind the Reserved Seating on the large green and also on the Sunset Bluff. How do I purchase tickets? Tickets are available to purchase online at www.clearwaterjazz.com once the lineup is announced. Phone orders can also be processed by contacting the ETIX Box Office 1-800-514-3849. Please call the CJH office ( 727-461-5200  )  for sponsorship inquiries, special VIP package sales, and other inquiries or email info@clearwaterjazz.com . Please also consider joining our High Note Society. Membership in the High Note Society is a great way to support the Clearwater Jazz Holiday Foundation and its tradition of Music, Education & Outreach and enjoy discounted VIP benefits. High Note memberships are sold prior to the release of the lineup ( discount period ends May 9th  )  . Purchase your High Note membership HERE. Do I need tickets if I do not plan to sit in the Reserved Seating or General Admission Areas on the large green? Yes. While the large green is the best vantage point to enjoy the concerts on the main stage, for attendees who are not purchasing Reserved Seats or Main Lawn GA tickets to sit on the green, there is a nominal entrance fee into Coachman Park ( $5 plus applicable fees in advance  )  allowing these attendees to roam between the smaller stages and also sit with blankets and lawn chairs on the Sunset Bluff over-looking the green. Kids under 12 are FREE in the two General Admission areas only when accompanied by an adult GA ticket holder. Personal blankets ( 6x8  )  and lawn chairs are permitted in the GA area behind the Reserved Seating on the large green and also on the Sunset Bluff. Please see the map above. Do I need to bring a chair? Seats are provided if you purchased a Reserved Seat on the large green. For attendees who purchase General Admission tickets, personal blankets ( 6x8  )  and lawn chairs, folding chairs, camp chairs, and the like are permitted in the two designated GA areas 1  )  behind the Reserved Seats on the large green ( Main Lawn GA  )  or 2  )  on the Sunset Bluff overlooking the green ( Sunset Bluff GA  ) . All festival attendees also have access to two smaller stages located in Coachman Park’s lower plaza and pier as well as different vendor, food and bar areas. However, blankets and lawn chairs are NOT permitted in these other areas which are standing room ONLY with some available festival seating and high tops provided. Can I bring in my own food or drinks? No. Outside food and beverages are NOT permitted. Festival food vendors will offer a variety of food options and soda, water, beer and wine are available for purchase. While Clearwater Jazz Holiday is a cashless event, some vendors may accept cash. Can I bring my pet? Domestic animals, excluding service animals, are not permitted at Coachman Park at Clearwater Jazz Holiday as it is a programmed event. Please email info@clearwaterjazz.com or call 727-461-5200. Special accommodations in the Reserved Seating Area, ( i.e. aisle seats, space for a service animal, etc.  )  should be requested at the time of purchase. Availability is limited. Please contact us early. All festival attendees have access to two smaller stages located in Coachman Park’s Lower Plaza and Promenade Pier as well as different vendor, food and bar areas. However, blankets and lawn chairs are NOT permitted in these other areas which are standing room ONLY with some available festival seating and high tops provided. Service Animals only are allowed in these other areas. The event supports the rights and attendance of all persons with disabilities that rely on the special skills of a trained service animal to access the festival. The event does not support pets being misrepresented by their owners as service animals, when they are not. Florida law defines a service animal as “any dog or miniature horse that is individually trained to do work or perform tasks for the benefit of an individual with a disability. A miniature horse must be no more than 38 inches in height and no more than 100 pounds in weight. The work or tasks performed by a service animal must be directly related to the handler’s disability.” Emotional support or comfort animals are not considered service animals under the ADA and therefore are not allowed. Please note that all service dogs and miniature horses, including those from out of state are required to have a valid rabies certificate. Please email info@clearwaterjazz.com or call 727-461-5200 for special accommodations. While in Coachman Park during the Clearwater Jazz Holiday, service animals must be harnessed, leashed or always tethered, unless special circumstances exist. A guest whose service animal poses a threat to the safety of other guests and employees or whose animal is not house broken, may be asked to escort the animal off the premises. Can I purchase ADA Accessible Seating? ADA tickets in every price range are available for purchase by calling the ETIX box office 1-800-514-3849 to place an order. Please make sure you purchase accessible seating when you order tickets. We strive to ensure that all of our guests have a great experience. If you need additional assistance while you are at the festival, please make sure you let us know by asking a festival volunteer or staff member. You may also reach out to our office with any questions 727-461-5200 or info@clearwaterjazz.com . Follow this link to Information about Accessible and Handicap Parking in Clearwater and see the Parking & Getting to Coachman Park section on this page. How can I volunteer? Please register as a volunteer at www.clearwaterjazz.com . The volunteer registration opens late June or early July. In the meantime, please email volunteer@clearwaterjazz.com so we know you are interested in volunteering. We will add you to our volunteer list and keep you informed. When the volunteer section opens, you will create a Username & Password to log into the system, and select dates, times and volunteer areas of service, which you can manage at any time by logging back into the system. How do I obtain a Media Credential? CLICK HERE to review the Media Credential application process. All media requests must be sent to media@clearwaterjazz.com. Safety Guidelines KNOW BEFORE YOU GO: 46TH CLEARWATER JAZZ HOLIDAY What Not to Bring - Please Leave the Following Items at Home: -Outside food or beverage (Food and beverage vendors will be available on-site during event  ) -Tents, pop-up tents -Umbrellas -Coolers -Oversized Bags larger than 12” x 6” x 12” -Smoking or vaping -Alcohol or illegal drugs -Glass containers, cans, and aluminum bottles, Camelbacks -Fireworks, fire starters, or open flames -Lasers, strobe lights, air horns, noise makers -Confetti, glitter, balloons -Professional audio, photography (with detachable lenses  )  , camcorders, and video equipment are PROHIBITED -Selfie sticks -Drones -Unauthorized vending of any kind -Unauthorized solicitations, handbills, sampling, giveaways, etc. -Weapons of any kind and other dangerous or hazardous devices or substances This list may be modified without notice. Official Policies Ticket & Entry Requirements - Every person must have a ticket to enter the festival. Children under 12 are free when accompanied by an adult General Admisison ticket holder. - A purchaser’s ticket (and a VIP credential, where applicable  )  is a revocable license, subject to termination with denial of admission or removal from the festival at the discretion of festival organizers, upon refund of the purchase price. - Tickets obtained from an unauthorized source may be stolen, illegal, counterfeit, or lost and if so, may be seized and cancelled without compensation. There are no refunds or exchanges. - Event times are subject to change. - Ticket holders and VIP credential holders may be requested to produce identification documents upon entrance to the venue or in any case where money is refunded. Behavior & Conduct - Guests are expected to behave respectfully and in accordance with festival policy, state and local laws. Guests are subject to ejection, without compensation, should the holder act in a disorderly, threatening or intoxicated manner, or in a manner that festival organizers deem unsafe or interfering with others’ enjoyment of the festival. Public safety officials are present at the festival. Any violation of the law while attending this event may result in the holder being removed from the premises without refund of any portion of the ticket price or charges. - Clearwater Jazz Holiday reserves the right to deny entry to any guest for any reason. - Festival attendees may not solicit contributions or distribute literature on the festival premises. Security & Safety - All persons, bags and personal items are subject to inspection at the event. Please review “What Not to Bring” list of items. By purchasing a festival ticket (or VIP credential where applicable  )  , and by entering the festival, you consent to such searches and waive any related claims that may arise. If you elect not to consent to such searches or refuse to be searched, you may be denied entry to the event without refund or other compensation. - Festival security and law enforcement are located throughout the festival area to ensure a safe and secure environment. Please also do not hesitate to contact our onsite volunteers and staff if any assistance is needed. -If you experience odd behavior or see something you know shouldn’t be somewhere, say something. Report suspicious behavior to any security, staff, volunteer, or medical team member. - Smoking is prohibited at the festival. - If severe weather becomes a threat and we need to interrupt, delay, or cancel programming, stage announcements will be made. We will also post updates on social media ( Facebook - /CLEARWATERJAZZ ; Instagram - @CLEARWATERJAZZ )  and email ticket purchasers. Programming will resume when deemed safe. Click here for the latest weather in Clearwater. Reentry Policy - Reentry to the festival is not permitted for General Admission and Reserved Seat ticket holders. Any General Admission and Reserved Seat ticket holders who leave at any point during the festival will not be allowed back into the festival. - Only attendees with VIP access and an official VIP credential will be allowed to renter designated festival areas after exiting. Any changes to this policy will be posted here and at the event. No Refunds or Exchanges / Artists Subject to Change and Cancellation - Clearwater Jazz Holiday is the largest event of the Clearwater Jazz Holiday Foundation, which also delivers year-round music appreciation and instructional Education & Outreach programs, online education resources, unique performance opportunities, special funding, and learning experiences. Purchasing tickets to attend Clearwater Jazz Holiday events, including the annual festival, supports the Clearwater Jazz Holiday Foundation, and sustains its festival, its year-round education & outreach initiatives, and its other special events. - The Clearwater Jazz Holiday is an outdoor event. All ticket sales are final--rain or shine. By purchasing a Clearwater Jazz Holiday festival ticket, purchaser understands and agrees all funds will be non-refundable, for any reason, including without limitation, if the event is delayed or must be cancelled in whole or in part due to weather, federal, state, and/or local mandates, pandemics, acts of God, acts of terrorism, or for any other reason. This includes unforeseen circumstances, such as your illness, travel issues, loss of employment, duplicate purchases, failure to use proper ticket or credential, or any other reason. - All advertised artists have confirmed their appearance well in advance of the festival. However, some artists may cancel their appearance through no fault of Clearwater Jazz Holiday due to medical, hardship, or other reasons, beyond the control of Clearwater Jazz Holiday. Therefore, all artists, performance times, and stages are subject to change and cancellation without notice. You are purchasing a ticket for a day certain (or multiple days certain  )  of a festival presenting multiple artists over a four-day event - not a specific artist set. In the event of an artist cancellation Clearwater Jazz Holiday may schedule replacement artists. There are no refunds in the event of artist cancellations, artist changes, and/or schedule changes as well as any festival vendor changes. - If you do not consent to all of the above terms, please do not purchase a ticket. Use of this online site and ticket purchasing, sponsorship and High Note Society membership, through Clearwater Jazz Holiday, www.clearwaterjazz.com & www.Etix.com affirms your agreement to waive and release all claims against Clearwater Jazz Holiday for refunds, chargebacks, reimbursement, or other relief for any reason. All purchasers hereby waive and release any and all rights to seek chargebacks with their credit card companies and/or bank. - Clearwater Jazz Holiday is not responsible for tickets purchased through a third party or secondary market. Please note if you purchased through a third party, there will be no record of purchase nor means to notify you of changes. You purchase at your own risk. There are no refunds. - In the event Clearwater Jazz Holiday offers a refund, exchange, or credit toward future events, Clearwater Jazz Holiday reserves the right to designate deadlines for acceptance. A failure to accept by the deadline will result in no refund, exchange, or credit. Inclusivity & Zero Tolerance -All are welcome at Clearwater Jazz Holiday regardless of race, color, national origin, gender, gender identity, gender presentation, sexual orientation, age, body size, disability, appearance, religion, citizenship or pregnancy. We have a zero-tolerance policy for discrimination or harassment of any kind. * These policies may be amended at any time* IF YOU DO NOT CONSENT TO ALL THE TERMS SET FORTH ABOVE, PLEASE DO NOT PURCHASE A TICKET, SPONSORSHIP, HIGH NOTE SOCIETY MEMBERSHIP, OR ATTEND THE EVENT. BY PURCHASING TICKETS, SPONSORSHIPS, AND HIGH NOTE SOCIETY MEMBERSHIPS, AND/OR BY ATTENDING THE EVENT, YOU ARE AGREEING TO ALL TERMS OF PURCHASE AND THESE POLICIES CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501( c  )  ( 3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA ( 1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Hotels & Accommodations Complete your Clearwater Jazz Holiday Experience with a stay at our HOST HOTEL Overflow Hotels for the Clearwater Jazz Holiday Promo Code: JAZZ Promo Code: JAZZ For all other places of interest in Pinellas County, check out: For transportation needs in Pinellas County, check out: Jazz Holiday Previous Artists CLEARWATER JAZZ HOLIDAY HISTORICAL DATES AND MUSIC ARTISTS NUMBER YEAR/DATES ARTIST(S  ) 1st Annual Oct 24 – Nov 2, 1980 Woody Herman 2nd Annual Oct 23 – Nov 1, 1981 Buddy Rich 3rd Annual Oct 26 – 31, 1982 Dizzy Gillespie 4th Annual Oct 20 – 30, 1983 Herbie Mann 5th Annual Oct 18 – 21, 1984 Dave Brubeck , Richie Cole 6th Annual Oct 17 – 20, 1985 Count Basie Orchestra , Mose Allison 7th Annual Oct 16 – 19, 1986 Stan Getz , Ramsey Lewis , Michel Petrucciani 8th Annual Oct 15 – 18, 1987 Nancy Wilson , Dirty Dozen ,The Roy Meriwether Trio, Phil Woods , Tito Puente, Rare Silk 9thAnnual Oct 13 – 16, 1988 Dirty Dozen Brass Band , Maynard Ferguson , McCoy Tyner 10th Annual Oct 19 – 22, 1989 Poncho Sanchez , Sonny Rollins , Bobby Enriquez 11th Annual Oct 18 – 21, 1990 Houston Persons/Etta Jones, Tuck & Patti 12th Annual Oct 17 – 20, 1991 Ramsey Lewis , Ernie Watts Quartet , New York Voices 13th Annual Oct 15 – 18, 1992 Nat Adderly, Tuck & Patti 14th Annual Oct 14 – 17, 1993 Bela Fleck & The Fleckstones , Dirty Dozen Brass Band , Arturo Sandoval with Ernie Watts 15thAnnual Oct 13 – 16, 1994 Chuck Mangione , The Rippingtons , Hiroshima , Arturo Sandoval , Acoustic Alchemy 16th Annual Oct 19 – 22, 1995 Spyro Gyra , Acoustic Alchemy , Michel Camilo 17th Annual Oct 13 – 16, 1996 Tito Puente , Stephan Grappelli, Keiko Matsui , Herbie Mann 18thAnnual Oct 16 – 19, 1997 Diane Schurr , Boney James , The Rippingtons , Al Dimeola 19th Annual Oct 15 – 18, 1998 Count Basie Orchestra , Etta James, Kevin Mahogany , Stanley Clarke 20th Annual Oct 9 – 10, & 14 – 17, 1999 Earl Klugh , Freddy Cole , T.S. Monk , David Benoit , Jason Marsalis , Tom Scott & LA Express , Michael Franks , Tito Puente , Dizzy Tribute, Patti Austin , Spyro Gyra , Oleta Adams 21st Annual Oct 1 – 22, 2000 Dee Dee Bridgewater , Stanley Clarke , Yellowjackets , Patti Austin , Monty Alexander , Oleta Adams , Terence Blanchard 22nd Annual Oct 18 – 22, 2001 Jane Monheit , Nnenna Freelon , Boney James , Los Hombres Caliente , Poncho Sanchez 23rd Annual Oct 17 – 20, 2002 The Chick Corea Elektric Band, Lou Rawls , Jonathon Butler , A Tribute to Jobim, James Moody with Marlena Shaw 24th Annual Oct 16 – 19, 2003 Kim Waters , Chuck Loeb and Jeff Kashiwa , Paquito D’Rivera’s Brazilian Dream featuring New York Voices ; Jon Cleary , Lizz Wright, Herbie Hancock 25th Annual Oct 14 – 17, 2004 Allon Sams , Rick Braun , Big Z & The SophistiKatz, Victor Wooten , Branford Marsalis , Pepper & Fine Thyme , Tony Vacca & World Rhythms , Dan Moretti , Chris Botti , The Neville Brothers , Nate Najar Quartet , Uptown Vocal Jazz Quartet , Adela Dalto, Big Bad Voodoo Daddy 26th Annual Oct 13 – 16, 2005 Fred Johnson, Brian Culbertson featuring Eric Darius , ABCD with Billy Norris , Nestor Torres , Trio! (Stanley Clarke , Bela Fleck & Jean-Luc Ponty )  , Les Sabler & Citiheat, Sakesho with Andy Narell, Rayford Griffin , Koko Taylor , Boney James , Coolie Family Gospel Singers, Liquid Soul , Ramsey Lewis Trio , Irvin Mayfield and the New Orleans Jazz Orchestra 27th Annual Oct 19 – 22, 2006 Kenny Drew Jr. Quartet , Kenny G , Bossacucanova , Mindi Abair , Richard Elliot , Valerie Gillespie , Jose Valentino Ruiz , Jazz to the Maxx, John Pizzarelli , Manhattan Transfer , Chuck Owen & The Jazz Surge , Don Byron Ivey-Divey Trio with Edward Simon & Billy Hart, Buckwheat Zydeco, Cherry Poppin' Daddies 28th Annual Oct 18 – 21, 2007 Air Force Band Falconaires , George Benson , Ray & Friends, Jazz Surge with Chuck Owen , Summer Storm with Norman Brown , Peabo Bryson, Jeff Lorber & Marion Meadows , Michael Ross Quartet , Brian Bromberg , Arturo Sandoval , Medeski Martin & Wood , Hendrick Meurkens Samba , Lynne Arriale Trio , Joe Grandsen Quartet , Natalie Cole 29th Annual Oct 16 – 19, 2008 BK Jackson , Kyle Eastwood Band , Tony Bennett , Karen Benjey , Stefon Harris & Blackout , Joe Sample , David Sanborn , Ken Loomer Big Band , Grace Kelly Quintet , Brubeck Brothers Quartet , Big Bad Voodoo Daddy , The Venturas , Eldar Djangirov Trio , Joey DeFrancesco Trio , Patti Austin 30th Annual Oct 15 – 18, 2009 Tom Brantley Collective, Mike MacArthur & Nate Najar , Al Jarreau , The Organic Trio, Joe Baione Quartet , Nicole Henry , Chris Botti , Gumbi Ortiz & the Latino Projekt , Les Sabler , Clearwater Jazz Holiday 30 th Anniversary ETREME Tribute, Boney James , Marcus Roberts Trio, Brian Bromberg , The Neville Brothers 31st Annual Oct 14 – 17, 2010 Jarred Armstrong, Little Feat , Dr. John & The Lower 911 , The Organic Trio, Kyle Wolverton , Norman Brown with Brenda Russell & Jessy J , O Som Do Jazz & Helios Orchestra, Sean Chambers , Level 10 , Tizer , Soulive , Mark Barrios , Jonathan Fritzen , Eric Darius & Lalah Hathaway 32nd Annual Oct 13 - 16, 2011 Kevin Eubanks, Trombone Shorty, Brian Culbertson, Maceo Parker, Christian McBride & Inside Straight, Dianne Reeves 33rd Annual Oct 18 – 21, 2012 Bonnie Raitt, The Avett Brothers, Mindi Abair & Friends featuring Jeff Golub & David Pack, Esperanza Spalding 34th Annual Oct 17 – 20, 2013 Chicago, Lisa Casalino, The Ries Brothers, Gumbi Ortiz & New Groove City, Jane Monheit, Paul Brown & Larry Carlton, Chris Godber, Acme Jazz Garage with Belinda Womack, Level 10, Average White Band, Tower of Power, Have Gun, Will Travel, Lake Street Dive, Amos Lee & Brandi Carlile 35th Annual October 16 - 19, 2014 Earth, Wind & Fire, Buster Cooper Quartet, Changing Keys, Spyro Gyra, Dirty Dozen Brass Band, Theo Valentin, Al Downing Jazz All Stars, Dr John & the Nite Trippers, Marcia Ball, Terrance Simien, Belinda Womack, Julie Black, Tomkats Jazz Orchestra, Edward Sharpe & The Magnetic Zeros, Trombone Shorty, Spirit Family Reunion, Crash 36th Annual October 15-18, 2015 Sheryl Crow, The Avett Brothers, Gladys Knight, The O'Jays, Buddy Guy, Gloria West & The Gents, The James Suggs Quintet with Dave Styrker, Poncho Sanchez & His Latin Band, Mindi Abiar & The Boneshakers, Jack Wilkins Blue & Green Project, Phill Fest, Nicole Henry, Big Sam's Funky Nation, Quesbe Sisters, Langhorn Slim & The Law 37th Annual October 13-16, 2016 UB40, Kool & The Gang, Grace Potter, Commodores, Trombone Shorty & Orleans Avenue, Bach to the Future featuring the Silverman Brothers, Crescent City Dream featuring Dwayne White, Flow Tribre, Preservation Hall Jazz Band, Show Biz Kids Steely Dan Tribute & Event Band, Fred Johnson Quartet featuring Cliff Downs, Brian Bromberg Full Circle Band, The Mavericks, The Ries Brothers, The Lone Bellow & Houndmouth 38th Annual October 19-22, 2017 Kenny Loggins, Michael McDonald, The Avett Brothers, Scott Bradlee's Post Modern Jukebox, Big Bad Voodoo Daddy, The Temptations, The Four Tops, Anderson East, The James Hunter Six, Jon Cleary, Jason Miles Presents \"Celebrating the Music of Weather Report\" featuring Jeff Coffin & Carter Beauford (of The Dave Mathews Band  )  , Theo Croker, Shaun Martin, Mino Cinelu, Gerald Veasley & Karen Briggs, Honey Island Swamp Band, La Lucha featuring Jeff Rupert & Marty Morell, Helios Jazz Orchestra, Mama's Batch, Alex Harris & Band, Erica DiCeglie 39th Annual October 18-21, 2018 The Doobie Brothers, George Thorogood & The Destroyers, JJ Grey & Mofro, The Devil Makes Three, Morris Day & The Time, Sheila E., Karl Denson's Tiny Universe - Eat a Bunch of Peaches, Marcus Miller, Lao Tizer Band featuring Chieli Minucci, Karen Briggs & Nelson Rangell, Mindi Abair & The Boneshakers, Danny Kusz, Adam Hawley, Alex Harris, Greg Billings Band, Betty Fox Brass Band, Clearwater Jazz Collective featuring La Lucha, Thomas Carabasi, Jeremy Carter, Valerie Gillespie, John Lamb, Mark Moultrup, Nate Najar, Larue Nickelson, Gumbi Ortiz, Jamie Perlow, James Suggs and Butch Thomas 40th Annual October 17-20, 2019 Chicago, Alison Krauss, Boyz II Men, Trombone Shorty & Orleans Avenue, Blood, Sweat & Tears, Yonder Mountain String Band, Robert Randolph & The Family Band, The Soul Rebels, Marcia Ball, Parsonsfield, Polyrhythmics, 40th Anniversary Tribute to Jazz Vocalists featuring Karen Benjey, Erica DiCeglie, Valerie Gillespie, Fred Johnson, Theo Valentin, Belinda Womack & La Lucha, Jazmin Ghent, Ashley Smith & The Random Occurence, Gloria West and The Gents, University of Miami's Frost Jazz Ensemble featuring Dafnis Prieto, Ruth Eckerd Hall/Clearwater Jazz Holiday Youth Jazz Band with special guest Dafnis Prieto, Clearwater Jazz Holiday's Young Lions Jazz Master Sessions featuring James Suggs 42nd Annual October 14-17, 2021 Kool & The Gang, Snarky Puppy, Gloria Gaynor, Big Bad Voodoo Daddy, Lettuce, Ariella, Gumbi Ortiz & The Electrik Renedevous, Eric Marienthal featuring The Sliverman Brothers, Gloria West and The Gents, Special EFX All-Stars, Jason Miles Presents to Grover with Love, Joe Marcinek Band, Lemon City Trio, Lucy Woodward and Dustbowl Revival 43rd Annual October 14-16, 2022 Charlie Wilson, Trombone Shorty & Orleans Avenue, Gov't Mule + Old Crow Medicine Show, St. Paul & the Broken Bones, The War & Treaty, Average White Band, Dumpstaphunk, Justin-Lee Schultz, The Champ Jaxon Band 44th Annual October 19-22, 2023 The Beach Boys with Good Vibrations Orchestra, Gladys Knight, Kenny Wayne Shephard, Gipsy Kings, Trampled By Turtles, Los Lobos, Christone \"Kingfish\" Ingram, Average White Band, Dustbowl Revial, Preservation Hall Band, Grace Kelly, Joey Alexander, Ghost-Note, Tom Braxton, Tomkatz Jazz Orchestra, Roosevelt Collier, Daniela Soledade with Nate Najar Quartet, Latin Jazz Knights, Scone Cash Players, Electric Piquete, POCKiT, John O'Leary/Trace Zacur & Friends Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "text": "About Us – The ClearWater Foundation Visit our websites: Future Chicken ClearWater Farm Our Work Global Impact Guiding Principles About Us Our History News Contact us Donate Donate ☰ Our History Starting our journey in 2006, the ClearWater Futures Foundation has weathered many changes and challenges. From tremendous highs to tumultuous lows, we’ve embraced every challenge and overcome every obstacle to become the thriving beacon of hope, purpose and community we are today. Discover our journey CFF Founder and Board Chair Annabel Slaight, C.M., O. Ont. Annabel holds the Order of Canada and the Order of Ontario for nurturing a passion for education through science and nature among generations of Canadian children.  She was honoured as a Fellow of the Royal Canadian Geographical Society and was a King Charles III Coronation Medal recipient in 2025.  She is a Canadian media pioneer who created magazines, books and TV for kids under the OWLkids banner, reaching over 60 million families. She is the founding editor for OWL magazine and creative behind Future Chicken.  Annabel co-founded Ladies of the Lake, and was an appointee to the formative Lake Simcoe Coordinating Committee. Our Board of Directors Tracy Smith Board Vice Chair and Chair of the Governance and Nominations Committee Tracy is a retired District Manager from the Ontario Ministry of Natural Resources, where he led environmental initiatives, including the development of the Lake Simcoe Protection Plan. With a career focused on sustainable resource management and environmental policy, he also served as Vice President and Trustee on the Board of Directors for Forests Canada, contributing to national forest conservation strategies and supporting efforts in biodiversity and climate resilience. Lynn Haight Board Treasurer and Chair of the Finance and Audit Committee Lynn has retired from a distinguished 30-year career in executive financial management, having held senior leadership roles in major international financial and insurance institutions headquartered in Canada. Her roles included Chief Financial Officer and Chief Operating Officer of Foresters Financial, Controller of Manulife Financial, and Vice President at Scotiabank. Alongside her corporate leadership, Lynn has been deeply engaged in global development through voluntary governance roles. She has chaired or served on the Boards of Directors for several international organizations, including the World Agroforestry Center, the Consortium of International Agricultural Research Centers, and the Standards Council of Canada. She has also contributed to the oversight of United Nations programs, serving on Management Oversight Committees for UNHCR and UNESCO. Lynn holds an MA from Oxford University, is a Fellow Chartered Accountant (FCA) in both Canada and the UK, a Fellow of the Canadian Association of Management Consultants, and a certified Canadian Director (ICD.D) Surbhi Jain Board Secretary Surbhi is a Senior Policy Advisor with the Ontario Ministry of the Environment, Conservation and Parks, based in Toronto, Canada. She plays a key role in shaping provincial climate change policy, focusing on the design and implementation of programs and strategies to reduce greenhouse gas emissions. Surbhi brings a diverse background in environmental and clean energy sectors, with prior experience at the Ontario Ministry of the Environment and Climate Change, Opus One Solutions, Heliolytics, and TREC Renewable Energy Co-operative. Her career has also included work in strategic communications, public relations, partnership development, marketing, and event management—complementing her policy expertise with a broad understanding of stakeholder engagement and outreach. She holds a Master’s degree in Environmental Science with a specialization in Natural Resources Management and Policy from the University of Toronto. Hon. Gloria T. Epstein QC Director The Honourable Gloria Epstein, K.C . brings over 45 years of experience in the Canadian legal system—as a lawyer, trial judge, appellate judge, and leader of complex government reviews. Her distinguished career has been marked by legal excellence, public service, and a deep commitment to social justice. Following her retirement from the bench, Justice Epstein earned her Mediator Accreditation from the London School of Mediation in 2021, a credential recognized by the Chartered Institute of Arbitrators. She is now a member of Arbitration Place, where she serves as both a mediator and arbitrator. Justice Epstein has made significant contributions beyond the courtroom. She founded the McMurtry Garden of Justice, serves as Co-Chair of the Ontario Justice Education Network, and sits on the Boards of Directors of the Canadian Women’s Foundation and the Sinai Health Foundation. She is also a member of the Smith School of Business Advisory Board and previously served on the national board of Pathways to Education. Her leadership and volunteerism have been widely recognized. She is a recipient of the University of Toronto Arbor Award and the YWCA Women of Distinction Award. In recognition of her contributions to law and society, she has been awarded three honorary Doctor of Laws degrees: from the Law Society of Ontario (2019), the University of Toronto (2022), and Queen’s University (2023). Damian Chen Director Damian is the Founder and CEO of ColorShadow Communications and GetDMS Inc. He is an accomplished tech entrepreneur with nearly three decades of industry experience. A leader in digital transformation and cloud-based solutions, Damian has guided the creation of over 100 world-class digital platforms, including several industry firsts in healthcare, transportation, and entertainment. His expertise spans strategy, business intelligence, and system architecture, driving innovation across a diverse range of clients—from multinational corporations and government agencies to not-for-profit organizations. Lisa M. Lyons Johnston Director Lisa is an accomplished senior executive with three decades of global experience in the creative industries, spanning traditional and digital media, music, publishing, and television content distribution. As President and Publisher of Kids Can Press for 15 years, Lisa guided the award-winning Canadian publisher into new markets and formats, including ebooks and audiobooks. Her digital media expertise includes launching Canada’s first kids’ video-on-demand subscription service, overseeing Max Trax Digital Music, and leading groundbreaking content initiatives across emerging platforms. Lisa is widely recognized for her leadership and industry contributions. She received the 2015 Leadership Award from Women in Communications and Technology and was named one of Canada’s Top 100 Most Powerful Women by the Women’s Executive Network in 2018. She has represented Canadian publishing on official cultural trade missions to China and Latin America and is a sought-after speaker at major international book fairs and media conferences. Lisa has served on the boards of the Ontario Science Centre and Ontario Creates and currently sits on the Emmy Noether Circle at the Perimeter Institute for Theoretical Physics. She is also a member of the International Women’s Forum, where she serves on the Executive Committee of the Canadian Forum Toronto Chapter as Chair of Programming. Our Advisory Board Elizabeth Dowdeswell OC OOnt. Honourary Chair of the Special Advisor Group Elizabeth previously served as the 29th Lieutenant Governor of Ontario and  as President and CEO of the Council of Canadian Academies. Her career spans provincial, federal, and international roles, with a focus on public engagement in policy, education, and communication. She was the founding CEO of Canada’s Nuclear Waste Management Organization and is an adjunct professor at the University of Toronto. From 1993 to 1998, she was Under-Secretary General of the UN and Executive Director of the UN Environment Program, where she modernized the agency and addressed global environmental challenges. Earlier, she was Assistant Deputy Minister at Environment Canada, overseeing national weather services.Ms. Dowdeswell sits on several boards and advisory panels, holds nine honorary degrees, and received the Memorial Gold Medal from Charles University in Prague. John Brace Former CFF Director, Special Advisor John is the Chair of Northland Power Inc., appointed to the role in December 2019 after serving as the company’s Chief Executive Officer from 2003 until his retirement in 2018. He joined Northland in 1988 and held a range of leadership roles across risk management, development, construction, and operations. As CEO, John successfully led the company through many of its key growth initiatives in clean and green energy development. With decades of experience in the energy sector, John has also served as Chair and President of the Association of Power Producers of Ontario and was a member of the Electricity Conservation and Supply Task Force. He holds a Bachelor of Science in Engineering Physics from Queen’s University and is a member of the Institute of Corporate Directors, holding the ICD.D designation. To get in touch with our Board of Directors, please email Tammy.Labombard@theclearwaterfoundation.com Our Chief Executive Officer – Ex-Officio Director Susan Doyle Chief Executive Officer, Board Ex-Officio LinkedIn Connect with me! Susan is the current CEO of the ClearWater Futures Foundation that holds a global mandate in ecological innovation, environmental leadership development, eco-educational research, nature-based learning and mental wellbeing. Her experience in trusted partnership development and community building has spanned appointments to various committees, boards and as an effective executive non-profit coach in Ontario. Before joining CFF, Susan led large, diverse, unionized, and multi-disciplinary teams in various healthcare sectors. Her experience includes complex and multifaceted capital projects and funding portfolios, regulatory compliance, effective financial and budget management, development of policies and procedures, large scale change projects, strategic and operational planning, government relations strategies and quality stakeholder engagement strategies. Susan has spoken internationally on topics of innovation, inclusion, and development. She has a Master’s degree in Social Work and extensive executive education including governance, and performance measurement from Harvard University (John F. Kennedy School of Government) in the United States and finance management from Rotman School of Management in Canada. Our Foundation Experts Susan Doyle Chief Executive Officer Connect with me! Jennifer Gidge Resource Development and Communications Connect with me! Suzanne Portsmith Business Manager Our ClearWater Farm Experts Sheri Bryant Education, Events & Outreach Programs Grace Harding Regenerative Farming Alex Smyth Sustainable Food Doug Rees Capital Development, Maintenance and Facilities Our Consultancy & Advisory Experts Mohith VJ Kumar Chief Partnership & Innovation Officer LinkedIn To get in touch with our team, please email info@theclearwaterfoundation.com Our Partners In Impact Developing impactful initiatives with partners is key to the ClearWater Futures Foundation’s mandate to “create ripples.” If you have an idea you would like to propose or see any initiative currently underway you would like to expand on please contact Partnerships . Purpose-Driven Funders Strategic Program Collaborators Our Government Partnerships Academic Affiliations International Community Champions Community and Grassroots Organizations Canadian Charitable Number: CRA #842146284RR00001 We acknowledge that ClearWater Farm stands on land with a rich history as a meeting\n place for Indigenous communities and early settlers, where knowledge, culture, and goods were exchanged\n under the shade of the over 200-year-old Trading Tree. The ClearWater Futures Foundation is committed to\n reconciliation by honoring this legacy, learning from Indigenous perspectives, and fostering meaningful\n relationships built on trust, respect, and collaboration. We strive to weave Indigenous knowledge and\n practices into our work, contributing to a shared future that reflects the principles of truth and\n reconciliation in Canada. © The ClearWater Futures Foundation, All Rights Reserved. Contact us Join our email community! Canadian Charitable Number: CRA #842146284RR00001 We acknowledge that ClearWater Farm stands on land with a rich history as a meeting\n place for Indigenous communities and early settlers, where knowledge, culture, and goods were exchanged\n under the shade of the over 200-year-old Trading Tree. The ClearWater Futures Foundation is committed to\n reconciliation by honoring this legacy, learning from Indigenous perspectives, and fostering meaningful\n relationships built on trust, respect, and collaboration. We strive to weave Indigenous knowledge and\n practices into our work, contributing to a shared future that reflects the principles of truth and\n reconciliation in Canada. © The ClearWater Futures Foundation, All Rights Reserved."
    },
    {
      "url": "https://www.clearwaterjazz.com/about_us_education.html",
      "text": "Education and OutreachClearwater Jazz Holiday Education and Outreach YEAR-ROUND IMPACT In addition to sustaining the longstanding festival tradition, Clearwater Jazz Holiday Foundation, a 501(c  )  (3  ) not-for-profit organization and proud winner of the 2016 Clearwater Regional Chamber’s Judge’s Choice Nonprofit of the Year, delivers year-round innovative programs, exciting performance opportunities, special funding, and creative learning experiences. CLICK HERE TO DONATE TODAY Join the family of partners below or DONATE to help expand the reach! INNOVATION AND CREATIVITY Celebrating the art form of Jazz with meaningful music appreciation and instructional experiences for people of all ages, backgrounds and abilities. INNOVATIVE PROGRAMS Innovative initiatives are changing lives and providing special experiences for people of all ages and backgrounds, from the very young to the elderly and from varying socio-economic backgrounds. CJH YOUNG LIONS PROGRAM YOUNG LIONS JAZZ MASTER SESSIONS A one-of-a-kind instructional experience for Bay area jazz students with group clinics, master class sessions, and performance opportunities involving university jazz educators and local jazz professionals. The Program occurs at a main event every December as well as in schools throughout the year. Clearwater Jazz Holiday Thanks Marcia P Hoffman School of the Arts, Al Downing Tampa Bay Jazz Association, St. Petersburg College and Yamaha For supporting the Young Lions Jazz Master Sessions . Young Lions Jazz Master \"Virtual\" Sessions Expanding upon our popular YOUNG LIONS JAZZ MASTER SESSIONS PROGRAM FREE VIRTUAL MUSIC LESSONS and MASTER CLASS INSTRUCTIONAL SESSIONS ZOOM PLATFOM Approximately 45-60 minute sessions …and visit THE STUDIO for ARCHIVED SESSION RECORDINGS and OTHER MATERIALS Clearwater Jazz Holiday Thanks Our Supporters Expanding the Reach of the Young Lions Jazz Master “Virtual Sessions i ncluding The Anderson Foundation Al Downing Tampa Bay Jazz Association UPCOMING SESSIONS Stay Tuned! CJH HISTORY OF JAZZ PROGRAMMING HISTORY OF JAZZ OUTREACH PROGRAM Interactive, musical presentations featuring local musicians offered to schools (including Title I  )  and other special groups covering the culture, history, and feel of jazz and its evolution as a unique, American art form. By the Spring of 2020, CJH had impacted over 30,000 students with this innovative program and has also adapted it to provide meaningful experiences to older adults in our community, memory care centers, as well as organizations and schools serving people with special needs. Clearwater Jazz Holiday Thanks Pinellas Community Foundation, Pinellas Realtor Organization, Landon Korabek Foundation, and Rotary Club of Largo for supporting the History of Jazz Outreach Program . STOP-TIME SERIES with Frank Williams Enhancing our enduring HISTORY OF JAZZ OUTREACH PROGRAM A Comprehensive VIDEO and AUDIO HISTORY OF JAZZ ARCHIVE Produced with our friend and long-time education partner FRANK WILLIAMS VISIT the STOP-TIME SERIES page and start your journey through time Clearwater Jazz Holiday Thanks Pinellas Realtor Organization and Pinellas Community Foundation For their support of the STOP-TIME SERIES and History of Jazz Outreach Program MY JOURNEY WITH JAZZ In-Person PROGRAM My Journey with Jazz is a music mentoring program in a unique game format where students learn about important people, places and music that shaped the history of jazz. It delivers a fun and meaningful experience to afterschool and summer programs in economically challenged or underserved communities. What started as a pilot effort at the Clearwater Neighborhood Family Center has grown to serve many others including Mattie Williams NFC, High Point NFC, the Greater Regional Area Youth Development Initiative, Union Academy NFC, Sanderlin NFC and the Pinellas Sheriff's Police Athletic League. Clearwater Jazz Holiday Thanks Duke Energy, Pinellas Community Foundation, Landon Korabek Foundation and Seaside National Bank & Trust For supporting the My Journey with Jazz Program . My \"Virtual\" J ourney with Jazz A collection of EDUCATIONAL VIDEOS highlighting the People, Places, and Music covered in CJH’S MY JOURNEY WITH JAZZ PROGRAM Engaging the Family of Musicians who bring this wonderful program to NEIGHBORHOOD FAMILY CENTERS and other groups in our COMMUNITY VISIT the my “virtual” journey with jazz page Clearwater Jazz Holiday Thanks Pinellas Community Foundation, Duke Energy Foundation, and the Pinellas County Sheriff’s Office For their Support of the My “Virtual” Journey with Jazz Program CJH GIVE THEM A STAGE PROGRAM GIVE THEM A STAGE & THEY WILL SHINE CJH is known for showcasing young, incredibly talented, home-grown musicians, helping these aspiring artists to build confidence, hone their craft, and develop fans through special learning and performance opportunities. Whether at the festival, throughout the year at CJH events, or at special CJH corporate and outreach partner functions, these experiences are invaluable opportunities for young musicians to network, promote their art, and develop important planning and communication habits. In many instances these artists enjoy an opportunity to play with more established professionals and also benefit from a paid gig! Clearwater Jazz Holiday Thanks The Anderson Foundation and the many CJH donors For supporting the My Journey with Jazz Program. If you or your organization have interest in featuring young musicians at your next event or if you would like to sponsor a trio of Young Lions for an at home back yard or front porch concert please email info@clearwaterjazz.com and let’s give them a stage! BUILD-A-GUITAR PROGRAM An annual initiative designed to engage the greater family of CJH corporate partners and other supporters around a unique team building program where participating teams assemble special guitars which are donated to CJH outreach partners. CJH also provides onsite group guitar lessons throughout the year with these outreach partners, typically neighborhood family centers in economically challenged and underserved communities. CJH also has a fun virtual adaptation of the lessons. You can enjoy the Full Recorded Sessions of JJ Patishall’s Basic Guitar Series (for beginners  )  for FREE courtesy of Clearwater Jazz Holiday Foundation. Click Here Clearwater Jazz Holiday Thanks Best Corporate Events for donating its wonderful Build-A-Guitar® Charitable Program and giving the gift of music to young people in our community and The Anderson Foundation For supporting guitar lessons. CJH INSPIRES CJH identifies special opportunities to inspire young musicians with the gift of music. CJH collects donated instruments and also works with partners to help inspire young people to continue on their musical journey. Whether it is for a school jazz or band program, a committed student who may not otherwise be able to afford an instrument outside of the school system, or a dedicated proven talent, these gifts of beginner and professional grade instruments are a symbol of CJH’s strong belief in these young talents and the power of music to change lives. Clearwater Jazz Holiday Thanks RS Berkley, Best Corporate Events, and others for helping to make a difference in the lives of many talented young performers. ABOUT FRANK WILLIAMS Frank T. Williams III, a 40-year + educator, band director, clinician, author, adjudicator, and composer, is a long-time CJH education partner, important to the development of many CJH Outreach programs. THANK YOU TO ALL THE MUSICIANS who make Clearwater Jazz Holiday Foundation Education & Outreach So Special! Special Funding CJH has a long history of providing special funding in support of youth music and jazz education. Jazz & Band Programs This support includes annual contributions to middle and high school jazz ensembles and band programs participating in CJH’s History of Jazz Outreach Program, Young Lions Jazz Master Sessions, and School Give Back Program. Scholarships CJH also offers scholarships through the Pinellas Education Foundation to graduating high school seniors who demonstrate a unique music background and/or aspirations for careers involving music as well as to other students with interests in various facets of event production. In 2019, CJH additionally launched the Frank T. Williams III Summer Camp Scholarships which create meaningful jazz camp opportunities throughout the state for deserving young music students. Jazz Program at the Marcia P. Hoffman School of the Arts Lastly, CJH celebrates its longtime partnership with Ruth Eckerd Hall and is proud to provide annual funding to Marcia P. Hoffman School of the Arts at Ruth Eckerd Hall to support its renowned youth jazz program so that very talented Bay area jazz students can learn at a high level and experience exciting year-round performance opportunities across the CJH platform including the festival every October. Creative Learning Experiences CJH offers unique, event-based learning experiences. Students in area high schools and universities participate in various facets of event production including photography, journalism, stage and video production, culinary arts, graphic design and merchandising. St. Petersburg College MIRA Program CJH’s partnership with the Music Industry and Recording Arts Program at St. Petersburg College is now in its sixth year! CJH developed and delivers a special series of classroom discussions for students to gain real-world insight into the business of music plus the opportunity to volunteer / shadow, network, meet industry professionals and intern with CJH stage crew, production, artist hospitality and operations. The class has become one of the program’s most fun and coveted student opportunities. Operation Graduate Summer Workshop CJH developed a special annual workshop complementing the United Way’s successful credit recovery/graduation track program. educating participating students about CJH’s year-round impact while inspiring volunteerism and networking. We thank the following additional Partners for supporting and believing in #CJHOutreach : GET INVOLVED AND MAKE A DIFFERENCE! Education is a core component to the Foundation’s mission. If you would like to join our effort to support music & arts education in Tampa Bay or otherwise become part of the wonderful Clearwater Jazz Holiday family education and outreach team, please contact our office at 727-461-5200 or email deb@clearwaterjazz.com . Your financial support helps to sustain and grow these wonderful programs and initiatives. Please consider making a donation to the Foundation. CLICK HERE TO DONATE TODAY We appreciate your support and look forward to partnering with you! CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c  )  (3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/contact-us/index.html",
      "text": "Contact UsClearwater Jazz Holiday Contact Us CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. PO BOX 7278 CLEARWATER, FL 33758 Phone 727-461-5200 Physical address - 600 Cleveland Street, Ste 204 Clearwater, FL 33755 Steve Weinberger CEO Clearwater Jazz Holiday Foundation, Inc. steve@clearwaterjazz.com Deborah Flurnoy Operations Manager Clearwater Jazz Holiday Foundation, Inc. deb@clearwaterjazz.com Gary Hallas Consultant / Sponsor/Vendor Inquiries Clearwater Jazz Holiday Foundation, Inc. gary@clearwaterjazz.com Ralph Reid Jazz Force Chair Clearwater Jazz Holiday Foundation, Inc. Volunteer Coordinator Clearwater Jazz Holiday Foundation, Inc. volunteer@clearwaterjazz.com Artist Submissions Clearwater Jazz Holiday Foundation, Inc. Music Committee music@clearwaterjazz.com CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501( c  )  ( 3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA ( 1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 You may also contact us by completing this form. Please fill in all required fields and we will respond ASAP. Clearwater Jazz Holiday info@clearwaterjazz.com (727 )  461-5200 600 Cleveland Street, Suite 204 Clearwater, FL 33755 * Required Fields First Name: * Last Name: * Email Address: * Phone: Fax: Address: City: State: Zip: Message: Sign up to our Newsletter: Yes No Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/about-us/",
      "text": "About UsClearwater Jazz Holiday Clearwater Jazz Holiday The Clearwater Jazz Holiday is a multi-day, world-class, live, music festival, enjoyed by thousands of fans taking place the third week of every October and now in its 46th year. The music festival has evolved from a series of concerts on the back of a flatbed truck and at venues around Clearwater into an annual, international, music festival that draws tens of thousands of visitors each year to beautiful Coachman Park in Clearwater, against the backdrop of the Gulf of Mexico, warm breezes, brilliant sunsets, and one of the world’s greatest beaches. The festival features a combination of legendary and relevant musical artists and a gathering of an amazingly diverse fan base. Over its 45-year history, a long and impressive list of legendary jazz talents have made stops in Clearwater such as Woody Herman, Buddy Rich, Dizzy Gillespie, Herbie Mann, Dave Brubeck, Tito Puente, Stephan Grappelli, Stan Getz, and the Count Basie Orchestra. The Jazz Holiday’s modern-day, diverse line-up covers a wide array of musical styles: straight ahead and smooth jazz, swing, blues, jamband, rock, folk, Americana, funk, and Zydeco and showcases a new generation of artists, emerging stars, and classic legends including Tony Bennett, Earth, Wind & Fire, Chicago, Bonnie Raitt, Trombone Shorty, The Avett Brothers, Brandi Carlile, Gov't Mule, Esperanza Spalding, Marcus Roberts, Mindi Abair, Dirty Dozen Brass Band, Medeski, Martin & Wood, Soulive, Christian McBride, Bela Fleck, Boney James, Brian Culbertson, Spirit Family Reunion, Amos Lee, Lake Street Dive, Edward Sharpe & the Magnetic Zeros, Buddy Guy, Gladys Knight, Commodores, Kool & The Gang, UB40, Grace Potter, Sheryl Crow, Michael McDonald and Kenny Loggins and the list goes on and on…. 45 years has shaped a unique magical and magnetic destination experience built on incredible community support. The true magic stems from those who built, shaped and implemented the experience, many of which share a multi-generational bond with it. The festival is organized and supported by the Clearwater Jazz Holiday Foundation. The Foundation’s dedicated and engaged Board of Directors is composed of community leaders, who oversee production of the festival and various innovative education and outreach initiatives. The Foundation also orchestrates the popular Jazz Force committee of lead volunteers who work tirelessly to operationally implement the four-day celebration every October and manage hundreds of services needed to accommodate thousands of visitors. The Foundation’s wonderful family of corporate and strategic partners and its popular High Note Society membership help to sustain and grow this timeless tradition. Clearwater Jazz Holiday programs are also funded in part by grants from the State of Florida, Department of State, Division of Arts and Culture and the Florida Council on Arts & Culture and the Pinellas County Commission through the Cultural Development Grants Program of the Cultural Affairs Department. \"This Project is Sponsored in part by the State of Florida through the Division of Arts and Culture and the National Endowment for the Arts.\" For more information about the Jazz Holiday or volunteering during the event, please call (727  )  461-5200 or email us at info@clearwaterjazz.com Clearwater Jazz Holiday Foundation 2016 Winner Clearwater Regional Chamber Judge’s Choice Nonprofit of the Year The Clearwater Jazz Holiday music festival and its annual activities and initiatives supporting its mission are organized, produced, and implemented by the Clearwater Jazz Holiday Foundation, Inc. and have a substantial economic and cultural impact in the Bay Area. Dedicated volunteer members of the Board of Directors are community leaders and work closely with staff by actively participating on key standing committees such as Music, Education, Community Outreach, Corporate Partnerships, High Note Society, Budget & Finance, Governance, Commitments & Credentials, and Policy & Procedures. 2025 Foundation Board Victor Lucas, President John Kurnik, Vice President Donna Yarbrough, Secretary Stephanie Smith, Treasurer Collin Heimensen Chris McAdoo Lee Maidenberg Linda Larkins Jeni Mitchell Allon Sams Bob Childress Christen Gonzalez David Ruppel Joanie Sigal Tom Nurse Christie Sullivan Doug Whittington Nils Sedwick Mark Perry Ralph Reid Phil Henderson, Jr. - Advisory Oliver Kugler - Advisory Staff Steve Weinberger, CEO Deborah Flurnoy, Operations Manager Gary Hallas, Marketing & Operations Consultant I t is the mission of the Clearwater Jazz Holiday to be the leading proponent of jazz entertainment and education in Florida through the annual presentation of a world-class, live music festival in Clearwater, Florida during the third week of October and to promote tourism to Pinellas County as a key component of this celebration. Jazz Force The Jazz Force is an all volunteer standing committee of the Clearwater Jazz Holiday Foundation. The committee is comprised of lead operational volunteers who assist the Foundation to implement, oversee, and manage operations at the annual Clearwater Jazz Holiday music festival. 2025 Jazz Force Ralph Reid - Jazz Force Chair Mark Perry Stephanie Smith Leslie DiPaci Shawn Flurnoy Doug Whittington Mark Quering Lee Maidenberg Jeni Mitchell Ellen Michael-Perez Bob Corry Kim Corry Jessica Stephens Chris Cleaver Sheree Johnson Adam Dohrman Anjum Perfetti Jack Geller Pat Perzel-Geller Karen Ferreri Rick Lundy Steve Jones Jen Jones Sean Schrader Brittany Maxwell Justin Hasenour Andres Gonzalez Derek Schaening Ileana Figueroa Kristie Townsend Zach Townsend Leslie Patterson Tom Nurse John Kurnik John Dunn Mark Searcy Drew Phillips Jared Jones Kat Tracy Leslie Patterson Beth Becknell Sherry Dye Ed Collins Contact Us CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. PO BOX 7278 CLEARWATER, FL 33758 Phone 727-461-5200 Physical address - 600 Cleveland Street, Ste 204 Clearwater, FL 33755 Steve Weinberger CEO Clearwater Jazz Holiday Foundation, Inc. steve@clearwaterjazz.com Deborah Flurnoy Operations Manager Clearwater Jazz Holiday Foundation, Inc. deb@clearwaterjazz.com Gary Hallas Consultant / Sponsor/Vendor Inquiries Clearwater Jazz Holiday Foundation, Inc. gary@clearwaterjazz.com Ralph Reid Jazz Force Chair Clearwater Jazz Holiday Foundation, Inc. Volunteer Coordinator Clearwater Jazz Holiday Foundation, Inc. volunteer@clearwaterjazz.com Artist Submissions Clearwater Jazz Holiday Foundation, Inc. Music Committee music@clearwaterjazz.com CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501( c  )  ( 3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA ( 1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 You may also contact us by completing this form. Please fill in all required fields and we will respond ASAP. * Required Fields First Name: * Last Name: * Email Address: * Phone: Fax: Address: City: State: Zip: Message: Sign up to our Newsletter: Yes No Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/volunteer/index.html",
      "text": "Volunteer / Clearwater Jazz Holiday About the Volunteer Program Thank you for your interest in volunteering at this year's On the Green in VOLUNTEER SIGN UP OPEN NOW! Volunteer Waiver 2025 Thank you for your Support! Have a large group or organization that wants to Volunteer? Please email volunteer@clearwaterjazz.com for information on the 2025 event. What do volunteers do? Volunteering is fun and a great way to meet new people! Volunteers work in all available areas throughout the event. Merchandise, Food Service, Hospitality and Ambassadors are just a few examples of the areas where volunteers are needed. Volunteers are also needed before and after the event for setup and breakdown. This event would not be a success without our volunteers. How long do volunteer shifts last? Volunteer shifts average about four hours long depending on the area. How old do I have to be to volunteer? The minimum age for volunteers is 16. Younger volunteers are welcome, but we ask that they work along with Mom or Dad. No volunteers under 21 are allowed to help in the wine and beer tents for obvious reasons. When do I check in? Please report to the Volunteer Check-In Area located on the corner of Cleveland & Osceola at least 30 minutes before your shift. Do I get anything for volunteering at the Clearwater Jazz Holiday? All volunteers receive a t-shirt, an unframed poster, a volunteer pin and a meal/beverage. You will also have the satisfaction of volunteering your time to one of the largest community events in Clearwater. What should I wear? Comfort is KEY! Comfortable shoes are a MUST! Wear shorts, a t-shirt or whatever you are most comfortable in. You may also want to bring a sweater or jacket, as the evenings may be cool. Who do I contact to change my volunteer time? Simply log-in with your username & password to manage your shift dates and times. The volunteer site will be open in late June through October 13th. After October 13th - NO CHANGES will be made to the online schedules. We look forward to working with you this year! Have additional questions? Please email volunteer@clearwaterjazz.com or call us at 727-351-2927 Sign Up Click Here to Sign up NOW We look forward to seeing you in October 16-19, 2025 Thank You for your support! Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/sponsorship.html",
      "text": "Sponsorship Opportunities Choose a CLEARWATER JAZZ HOLIDAY SPONSORSHIP that works for you! Align with a 46-Year Community Tradition of Significant, Sustained Economic and Cultural Community Impact Customize a Unique Marketing Plan and VIP Experience that meets your Marketing Goals 5 Exciting & Effective S ponsorship Platforms! Click the Following Link to Learn More Clearwater Jazz Holiday Music Festival CJH Year-Round Education & Outreach CJH Presents Monthly Music Series The Bill Horne Community Day CJH Benefactor Partner Year-Round Impact and Visibility! Customize Your Plan Contact our Team for More Information about Custom Opportunities that Fit your Budget & Marketing Goals Gary Hallas 727-895-6264 gary@clearwaterjazz.com CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c  )  (3  )  NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352  )  . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/ticketing.html",
      "text": "Ticketing for 2022 Clearwater Jazz Holiday Ticketing 2022 Choose Your Experience! October 14-16, 2022 A Special Presentation at Buy Tickets NOW! All prices will increase the day of the show GA Admission Opportunities GA Grandstand Open Seating: $25.00 + Fee GA Infield Area $30.00 + Fee GA Grandstand Open Seating GA attendees purchase first-come, first-served tickets to stadium seating. GA Attendees can also take advantage of a variety of first-come, first-served sitting and viewing areas including the grass berm behind the stage, the Tiki Bar, and various concourse high-tops and picnic tables. GA Infield Area A limited number GA Infield Area tickets are available for purchase which grant attendees access to the infield behind the VIP Hospitality and Reserved Seating areas (blankets permitted / NO CHAIRS )  . GA Infield Area ticket holders can also take advantage of a variety of first-come, first-served sitting and viewing areas including the grass berm behind the stage, the Tiki Bar, and various concourse high-tops and picnic tables. Kids 4 and under FREE with paid adult GA ticket Reserved Seating Opportunities Reserved Seating: $50.00-$90.00 + Fee VIP / Reserved Seating: $175.00-$200.00 + Fee Reserved Seating Area A limited number of stage-front, assigned seats will be available for purchase in the Reserved Seating Area. Reserved Seating Area ticket holders have access to the Infield along with a special Food & Beverage Area, as well as access to the main concourse stadium concessions and restrooms. VIP / Reserved Seating The best reserved seats come with VIP Hospitality Area access! A limited number of stage-front, assigned, VIP reserved seats will be available for purchase in the first several rows, which also grant VIP Reserved Seat ticket holders access to the VIP Hospitality Area. Access to the VIP Hospitality Area comes with a catered VIP food offering, tickets to exchange for VIP Hospitality Area beverages (beer, wine, soda, and water  )  , and executive festival restrooms. VIP Reserved Seat ticket holders have access to the Infield along with a special Food & Beverage Area, as well as access to the main concourse stadium concessions and restrooms. All attendees will have access to the main concourse where they can also purchase food and beverage from a variety of great festival vendors. Corporate Partner Packages and Special Group Sales There are a variety of unique ways for your company or special group to enjoy the festival including Group General Admission Experience, Group VIP Hospitality Area Experience, Group CJH Bistro Experience, or CJH Executive Suite Experience. Please direct all inquiries to: info@clearwaterjazz.com . Group General Admission Experience Subject to availability, there are several unique areas situated around the stadium seating bowl for groups to enjoy a Group General Admission Experience together. In addition to a special general admission seating area designated for your group, GA Attendees can also take advantage of a variety of other first-come, first-served sitting and viewing areas including the grass berm behind the stage, the Tiki Bar, and various concourse high-tops and picnic tables. Group VIP Hospitality Area Experience Access to the VIP Hospitality Area comes first-come, first served stage-front seating, a catered VIP food offering, tickets to exchange for VIP Hospitality Area beverages (beer, wine, soda, and water  )  , and executive festival restrooms. VIP Hospitality Area pass holders also have access to the GA Infield Area, special GA Food & Beverage Area on the infield, as well as access to the main concourse stadium concessions and restrooms. Group CJH Bistro Experience Join the CJH family of support, including our upper tier High Note Society members and special guests, in the CJH Bistro, an exclusive open-air, covered entertainment deck with connected VIP suites, situated on the 200 executive level. The CJH Bistro has its own food and bar service, first-come first served club seating, lounge-like entertainment areas, and restrooms. CJH Bistro pass holders also access to the stage-front, first come-first served VIP Hospitality Area on the field with all the privileges of VIP Hospitality Area pass holders. CJH Executive Suite Experience A very limited number of Executive Suites are available for purchase on each of the three-festival evenings. CJH Corporate Partners purchasing a suite will enjoy a private suite of up to 20 attendees, situated on the 200 executive level, with its own food service and private open-air club seating. Executive Suite Attendees also have access to the exclusive CJH Bistro as well as VIP Hospitality Area on the field. VIP Parking may also be available with select packages and subject to availability For additional information on Suites, Corporate Packages or Special Group Sales email info@clearwaterjazz.com Purchase Promoter Package $600 Thank you for supporting the Clearwater Jazz Holiday music festival, an annual Tampa Bay Area tradition, produced by the Clearwater Holiday Foundation, Inc., a 501( c  )  ( 3  )  not-forprofit organization, and now in its 43rd year. Your contribution helps to sustain this important tradition and further the reach of the Foundation’s amazing year-long education programs. As a Promoter, you are creating an opportunity for many others to experience the unique celebration that is Clearwater Jazz Holiday. Your partnership as a Promoter guarantees that others will have increased access to world-class music in our beautiful backyard. This year’s festival is October 14th-16th in beautiful BayCare Ballpark, Clearwater, FL. Once announced, you may view the full lineup and daily schedules at www.clearwaterjazz.com . 2022 Promoter Benefits 20 General Admission rain or shine tickets ( days of your choice  ) Listing in the 2022 Tampa Bay Times Official Guide to the Clearwater Jazz Holiday The tickets are fun gestures for employees, clients, and prospects. CJH can also alternatively donate the 20 GA tickets on your company’s behalf for use by the following 2022 designated CJH outreach partners. For more info or to purchase your Promoter package, please call 727-461-5200 Purchase Parking NOW! **NOTE TO VIP / RESERVED TICKET PURCHASERS You will print your ticket( s  )  for entry when purchased. VIP Credentials will need to be picked up at the Will Call / VIP Entrance at the South Gate of BayCare Ballpark, located on the Southside of the BallPark by presenting your printed ticket/receipt with matching verification. No tickets will be reassigned without prior notification to info@clearwaterjazz.com and approved by Clearwater Jazz Holilday representative. NO CREDENTIALS WILL BE SHIPPED. PHOTO ID WILL BE REQUIRED FOR PICK-UP. Online VIP ticket sales will close October 13 at 5 p.m. , after that tickets will be available for purchase if available at the Will Call / VIP Entrance. VIP Attendees must be 21 years old with proper ID to receive a drink wristband. Please drink responsibly. CLEARWATER JAZZ HOLIDAY IS A QUALIFIED 501( C3  )  ORGANIZATION ( 62-02153266-10  )  . CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FRESHFROMFLORIDA.COM OR BY CALLING TOLLFREE WITHIN THE STATE 1-800 HELP-FLA. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. FLORIDA DEPT. OF AGRICULTURE & CONSUMER SERVICES: CH15231 FEDERAL ID: 58-1910442 * A SPECIAL PRESENTATION ** RAIN OR SHINE. NO TICKET REFUNDS. NO EXCHANGES. NO RE-ENTRY ***SCHEDULE & ARTISTS SUBJECT TO CHANGE Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    },
    {
      "url": "https://www.clearwaterjazz.com/about_us_cjh.html",
      "text": "About the Clearwater Jazz Holiday Clearwater Jazz Holiday The Clearwater Jazz Holiday is a multi-day, world-class, live, music festival, enjoyed by thousands of fans taking place the third week of every October and now in its 46th year. The music festival has evolved from a series of concerts on the back of a flatbed truck and at venues around Clearwater into an annual, international, music festival that draws tens of thousands of visitors each year to beautiful Coachman Park in Clearwater, against the backdrop of the Gulf of Mexico, warm breezes, brilliant sunsets, and one of the world’s greatest beaches. The festival features a combination of legendary and relevant musical artists and a gathering of an amazingly diverse fan base. Over its 45-year history, a long and impressive list of legendary jazz talents have made stops in Clearwater such as Woody Herman, Buddy Rich, Dizzy Gillespie, Herbie Mann, Dave Brubeck, Tito Puente, Stephan Grappelli, Stan Getz, and the Count Basie Orchestra. The Jazz Holiday’s modern-day, diverse line-up covers a wide array of musical styles: straight ahead and smooth jazz, swing, blues, jamband, rock, folk, Americana, funk, and Zydeco and showcases a new generation of artists, emerging stars, and classic legends including Tony Bennett, Earth, Wind & Fire, Chicago, Bonnie Raitt, Trombone Shorty, The Avett Brothers, Brandi Carlile, Gov't Mule, Esperanza Spalding, Marcus Roberts, Mindi Abair, Dirty Dozen Brass Band, Medeski, Martin & Wood, Soulive, Christian McBride, Bela Fleck, Boney James, Brian Culbertson, Spirit Family Reunion, Amos Lee, Lake Street Dive, Edward Sharpe & the Magnetic Zeros, Buddy Guy, Gladys Knight, Commodores, Kool & The Gang, UB40, Grace Potter, Sheryl Crow, Michael McDonald and Kenny Loggins and the list goes on and on…. 45 years has shaped a unique magical and magnetic destination experience built on incredible community support. The true magic stems from those who built, shaped and implemented the experience, many of which share a multi-generational bond with it. The festival is organized and supported by the Clearwater Jazz Holiday Foundation. The Foundation’s dedicated and engaged Board of Directors is composed of community leaders, who oversee production of the festival and various innovative education and outreach initiatives. The Foundation also orchestrates the popular Jazz Force committee of lead volunteers who work tirelessly to operationally implement the four-day celebration every October and manage hundreds of services needed to accommodate thousands of visitors. The Foundation’s wonderful family of corporate and strategic partners and its popular High Note Society membership help to sustain and grow this timeless tradition. Clearwater Jazz Holiday programs are also funded in part by grants from the State of Florida, Department of State, Division of Arts and Culture and the Florida Council on Arts & Culture and the Pinellas County Commission through the Cultural Development Grants Program of the Cultural Affairs Department. \"This Project is Sponsored in part by the State of Florida through the Division of Arts and Culture and the National Endowment for the Arts.\" For more information about the Jazz Holiday or volunteering during the event, please call (727  )  461-5200 or email us at info@clearwaterjazz.com Education and Outreach Don't Miss Out - Stay Informed Be Social With Us Facebook Instagram YouTube Twitter Email October 16, 2025 © 2004-2025 Clearwater Jazz Holiday All rights reserved. CLEARWATER JAZZ HOLIDAY FOUNDATION, INC. IS A QUALIFIED 501(c)(3) NONPROFIT ORGANIZATION. CONSULT YOUR TAX ADVISOR. YOUR CONTRIBUTIONS ARE TAX DEDUCTIBLE TO THE\n    AMOUNT ALLOWED BY LAW. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES ONLINE AT WWW.FLORIDACONSUMERHELP.COM OR BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (1-800-435-7352). REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL,\n    OR RECOMMENDATION BY THE STATE. FLORIDA REGISTRATION # CH15231 Website Designed by Little Frog Innovations, Inc. Experience Festival Info Partners About Us Lineup NAVIGATION Navigation Home Experience Festival Info Partners About Us Lineup"
    }
  ]
}