{
  "fuentes": [
    {
      "url": "https://clematisad.com/about-us/",
      "email": "cropped-clematis-ad@2x-180x180.png"
    },
    {
      "url": "https://clematisad.com/about-us/",
      "email": "cropped-clematis-ad@2x-192x192.png"
    },
    {
      "url": "https://clematisad.com/about-us/",
      "email": "cropped-clematis-ad@2x-270x270.png"
    },
    {
      "url": "https://clematisad.com/about-us/",
      "email": "cropped-clematis-ad@2x-32x32.png"
    },
    {
      "url": "http://www.corachieclematis.co.uk/contact-us/",
      "email": "gardencentre@corachieclematis.co.uk"
    },
    {
      "url": "http://www.corachieclematis.co.uk/contact-us/",
      "email": "wholesale@corachieclematis.co.uk"
    },
    {
      "url": "https://www.eventsfy.com/venue/clematis-social-219-clematis-st",
      "email": "nito@clematissocialwpb.com"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://www.clematissocialwpb.com/?lightbox=dataItem-ikmqtt51",
      "email": "lan@clematissocialwpb.com"
    },
    {
      "url": "https://www.rogersonclematiscollection.org/about-us",
      "email": "info@rogersonclematiscollection.org"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "email": "contact@brottar.com"
    },
    {
      "url": "https://www.jkvstudio.com/contact",
      "email": "info@jkvstudio.com"
    },
    {
      "url": "https://www.clematistechsol.com/contact.php",
      "email": "info@clematistechsol.com"
    },
    {
      "url": "https://clematisstreet.org/clematis-social/",
      "email": "voltaire-sushi-jack-clematis-street-500x383@2x.jpg"
    }
  ],
  "mails": [
    "contact@brottar.com",
    "contact@staffboard.de",
    "cropped-clematis-ad@2x-180x180.png",
    "cropped-clematis-ad@2x-192x192.png",
    "cropped-clematis-ad@2x-270x270.png",
    "cropped-clematis-ad@2x-32x32.png",
    "gardencentre@corachieclematis.co.uk",
    "info@clematistechsol.com",
    "info@jkvstudio.com",
    "info@rogersonclematiscollection.org",
    "lan@clematissocialwpb.com",
    "nito@clematissocialwpb.com",
    "voltaire-sushi-jack-clematis-street-500x383@2x.jpg",
    "wholesale@corachieclematis.co.uk"
  ],
  "nombre_sitio": "clematissocialwpb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clematisad.com/about-us/",
      "text": "About us - % Home Our Services Branding Digital Marketing Website & Mobile App Video Production Our Portfolio Our Approach Blog Contact us Menu Home Our Services Branding Digital Marketing Website & Mobile App Video Production Our Portfolio Our Approach Blog Contact us Get in Touch About Clematis Advertising We offer a wide range of services to help businesses reach their target audience. Clematis Advertising is a full-service advertising and marketing agency in Dubai and India with over ten years of experience helping businesses achieve their goals. We know what you want! In the competitive space of marketing and advertising, our highly experienced & creative team of professionals bring out the best ideas to help your vision meet the world. Whether you are looking to develop a website, launch your app or need some help with digital marketing strategies – Clematis Advertising can provide it with all. We offer brilliant solutions that will make the most of every opportunity and reach out to potential customers seamlessly ! Our Team Experience is ordinary. Our team not only goes beyond years of experience but believes in the power of big and creative ideas. With our team of highly competitive, tenacious and energetic professionals, any challenge becomes as easy as a Sunday morning. Subscribe to our Newsletter Name Email Subscribe Facebook Instagram Linkedin Youtube Whatsapp Quick Links Home Our Services Our Portfolio Our Approach Contact us MOre About Clematis Clematis Group Portfolio Blog Careers Get Started Branding Digital Marketing Website & Mobile App Video Production Talk to us Our Presence Dubai Chennai Hyderabad Twitter Facebook Dribbble Youtube Pinterest Medium © 2022 All rights reserved Get in Touch Name Mobile Email Company Name Branding Digital Marketing Website & Mobile App Video Production Website/Social Media URL (If any) Message Send"
    },
    {
      "url": "http://www.corachieclematis.co.uk/contact-us/",
      "text": "contact us | Corachie Clematis Home about us contact us Corachie Clematis ² Navigation Garden Centre Winter Fuels Wholesale Haulage Tranjack Home / contact us contact us Corachie Clematis Wholesale, Haulage and Tranjack Corachie Clematis Taynuilt Argyll PA35 1HY Tel : 01866 822 266 Fax : 01866 822 570 Email: wholesale@corachieclematis.co.uk Corachie Clematis Garden Centre and Corachie Winter Fuels Corachie Clematis Garden Centre Bridge Of Awe Taynuilt Argyll PA35 1HT Tel / Fax : 01866 822 149 Email: gardencentre@corachieclematis.co.uk Comments or questions are welcome. * indicates required field Name: * Email: * Subject: * Message: * CAPTCHA Code: * Looking for more information about climbers? Check out our Corachie Plant Database Garden Centre Opening Hours 01866 822149 Summer: March to September 10am - 5pm Every Day Winter: October to February 10am - 4pm Wednesday to Saturday Christmas: 24th Dec - 6th Jan Closed When the Garden Centre is Closed please phone us for product enquiries Useful Phone Numbers Corachie Garden Centre: 01866 822149 Corachie Wholesale: 01866 822266 Corachie Winter Fuels - Please phone Garden Centre when open and Wholesale outside Garden Centre opening hours CORACHIE CLEMATIS – Home Garden Centre Winter Fuels Wholesale Haulage Tranjack Corachie Plant Database Corachie Knowledge Base About  – Corachie Clematis About – Corachie Winter Fuels Delivery – Corachie Winter Fuels contact us CORACHIE WINTER FUELS Firewood Wood Briquettes Wood Pellets Bottled Gas Peat Coal Corachie Clematis © 2025. All Rights Reserved. Powered by WordPress . Designed by"
    },
    {
      "url": "https://www.eventsfy.com/venue/clematis-social-219-clematis-st",
      "text": "Clematis Social in West Palm Beach, FL | Eventsfy we feedback Back home / venue / clematis social 0 Fans Track Review Edit Venue Report Add Images Add Event × Report problem for : Clematis Social Sign In SIGN IN SIGN UP Forgot password? 0 Fans Track Review Edit Venue Report Add Images Clematis Social nito@clematissocialwpb.com clematissocialwpb.com/ (561) 833-6500 View on Map 219 Clematis St west palm beach, FL 33401 Show venue on map Like and Share this Venue Copy venue link Venue Information Downtown West Palm's newest nightlife venue. This upscale lounge has pool tables, ping ping tables and always spinning the hottest beats all night. Perfect place to celebrate with semi-private rooms and tables. Located in the heart of Clematis Street. Add comment Upcoming Events (0) Clematis Social nito@clematissocialwpb.com clematissocialwpb.com/ (561) 833-6500 View on Map 219 Clematis St west palm beach, FL 33401 Show venue on map Like and Share this Venue Copy venue link × Copy event link MORE INFO PROMOTE × Title for  :Clematis Social Sign In SIGN IN SIGN UP Forgot password? × Please provide your feedback How can we make Eventsfy better for YOU? * Email * Send Feedback"
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://www.clematissocialwpb.com/?lightbox=dataItem-ikmqtt51",
      "text": "CLEMATISSOCIALWPB Skip to content lan@ClematisSocialWPB.com (561) 833-6500 Home About Us Events Gallery Reservations Contact Us Menu Home About Us Events Gallery Reservations Contact Us lan@ClematisSocialWPB.com (561) 833-6500 Home About Us Events Gallery Reservations Contact Us Menu Home About Us Events Gallery Reservations Contact Us A New Light Life Experience Discover the ultimate West Palm Beach vibe at Clematis Social – where style meets energy, and every night is an unforgettable experience VIP TABLE RESERVATION Exclusive Nights Discover Our Exciting Atmosphere Welcome to Clematis Social – where the nights come alive with vibrant beats, killer cocktails, and electric energy. Every Thursday, Friday, and Saturday, we turn up the heat, serving exclusive vibes and unforgettable experiences. This is West Palm Beach nightlife at its best—bold, buzzing, and built for you. Corporate Events Elevate your corporate gathering with a chic setting, curated drinks, and a lively vibe that leaves a lasting impression. Bachelorette Celebrate your last fling before the ring in style with the ultimate bachelorette experience at Clematis Social. Lounge Bar Relax, unwind, and sip signature cocktails in our sophisticated lounge bar with an ambiance like no other. Dance Party Hit the dance floor and feel the pulse of West Palm Beach’s hottest beats all night long. Events Private Events Host your next unforgettable event at Clematis Social! Whether it’s a birthday, corporate gathering, or milestone celebration, our stylish West Palm Beach venue offers customizable spaces, curated cocktails, and a vibrant nightlife vibe. Let us bring your vision to life and make it a night to remember! Client Satisfaction 0 % Dance Floors 0 + Service Satisfaction 0 % Name Email Phone Address Type Of Event Number of People Preferred Day Preferred Time Message Submit Now Additional Services We Are The Biggest Club In Town Beyond unforgettable nights, we offer a full range of services to elevate your experience – from VIP table reservations to personalized event planning, all in the largest and most iconic club in West Palm Beach. Explore Now BRANDED EVENTS Showcase your brand in a stylish, dynamic setting that brings your vision to life with flair. COMMERCIAL SHOOTS Capture stunning visuals and vibrant scenes at West Palm Beach’s most energetic nightlife venue. BIRTHDAY PARTIES Celebrate your big day with friends, drinks, and unforgettable moments on a night made just for you. DANCE FLOOR Take over the dance floor and feel the energy pulse through West Palm Beach’s hottest beats. Inquire For VIP Table Reservation Name Email Phone Date Time Party INQUIRE NOW Our Events Upcoming Events Join us for the most anticipated events in West Palm Beach, where every night offers a new experience. From themed parties to live DJ performances, our calendar is packed with unforgettable nights designed to keep you coming back for more. 09\nThursday Ladies Night Ladies Drink Free 9AM-12AM $124 Titos | Espolon | Jameson No Cover All Night RESERVE VIP 13th Friday December Sexy Santa No Cover Before 11pm Happy Hour 9AM-11PM 50% off Everything For Everyone RESERVE VIP Fridays Fridays No Cover Before 11pm Happy Hour 9AM-11PM 50% off Everything Table Reservation Can Text 561-833-6500 RESERVE VIP GALLERY Our Memories Relive the energy and excitement of Clematis Social through our curated gallery of unforgettable moments. From vibrant dance floors to chic private events, these snapshots capture the essence of West Palm Beach’s premier nightlife destination. View More Career Job Inquiries Interested in joining the Clematis Social team? Reach out to us for exciting career opportunities in West Palm Beach’s premier nightlife destination. INQUIRE NOW Home About Us Events Gallery Reservations Contact Us Home About Us Events Gallery Reservations Contact Us Phone (561) 833-6500 Email lan@ClematisSocialWPB.com Address 219 Clematis St. West Palm Beach, FL 33401 Copyright © 2024 Clematis Social Scroll to Top"
    },
    {
      "url": "https://www.rogersonclematiscollection.org/about-us",
      "text": "About Us — Rogerson Clematis Garden Home About About Us Accreditation In the News Clematis Clematis Care Resources Shop Clematis Sales Collector's Corner Sales Gift Shop Visit Visit the Garden Road Closure What's in Bloom? Request A Group Tour Request A Private Class Activities Classes & Events Month-At-A-Glance Support Join the Board Become a Member Volunteer Donate Members Membership Renewal Newsletters (Members) Library (Members) Board Contact Search Home About About Us Accreditation In the News Clematis Clematis Care Resources Shop Clematis Sales Collector's Corner Sales Gift Shop Visit Visit the Garden Road Closure What's in Bloom? Request A Group Tour Request A Private Class Activities Classes & Events Month-At-A-Glance Support Join the Board Become a Member Volunteer Donate Members Membership Renewal Newsletters (Members) Library (Members) Board Contact Search About About Us Accreditation In the News About Us With more than 2,400 individual clematis representing nearly 960 taxa, that is, distinct species or cultivated varieties (cultivars), the Rogerson Clematis Garden contains the most comprehensive collection of clematis within a public garden in North America. Started by Brewster Rogerson in 1971, the collection contains unique and exceptionally rare plants, as well as historic clematis and the newest hybrids. In 2018 the Rogerson Clematis Collection was awarded full accreditation in the Plant Collections Network, an initiative of the American Public Gardens Association in cooperation with the U.S. Department of Agriculture. C. 'Fairy Blue' CRYSTAL FOUNTAIN C. 'Louise Rowe' Clematis patens from Manchurian seed C. 'Duchess of Albany' C. 'Kimiidera' C. 'Comtesse de Bouchaud' (pronounced \"boo-show\") C. 'Warszawska Nike' (syn. 'Warsaw Nike') C. 'Arabella' C. 'Betty Corning' C. 'Mayleen' C. 'Semu' C. 'Halina 'Noll' Clematis sp. wild-collected, Anniston AL Large-flowered hybrid seed head C. 'Vince Denny' (potentially invasive in temperate climates) C. 'Bill MacKenzie' Clematis triternata var. variegata (Japan via Hinkley) Clematis alpina 'Pamela 'Jackman' C. 'Hagley Hybrid' C. integrifolia seedling in Test Garden C. 'Daniel Deronda' C. 'Piilu' LITTLE DUCKLING C. 'Walenburg' C. 'Alionushka' C. 'Helios' Our Mission and Board The Friends of the Rogerson Clematis Collection (FRCC) was formed in 2004 to ensure that Brewster Rogerson’s amazing collection of clematis would be maintained and nurtured over time. Since 2005, the collection has grown from a group of beautiful plants in pots to an assemblage of beautiful plants in a delightful garden. Mission We cultivate clematis and community. Vision Honoring our roots and taking new paths to advance a distinctive garden celebrating an exceptional collection of clematis. The Friends group is guided by a Board of Directors. Officers Amy Chase Herman, President Nancy Gronowski, Vice President Dina Trachta, Treasurer Peggy Wros, Recording Secretary Colleen Keyes, Membership Secretary Directors Sophie Bayard, Volunteer Coordinator Mike Bostwick Diane Harris Agnes Kwan Hilliary Montero Kym Pokorny Other Roles Linda Beutler, Curator Susan Toler, Site Manager Nancy Stanton-Chek, Garden Manager Kathy Hemphill, Librarian Sylvia Hoffman, Bookkeeper History From a Collection to a Garden Brewster Rogerson, founder of the collection, was first drawn to clematis because of their incredible diversity. While still a professor of English at Kansas State University, he bought four vines in 1971 and ended up spending the rest of his life acquiring varieties and species from all over the world. Over the years he became a leading expert in the genus and was a founding member of the International Clematis Society (1984), for which he wrote 100 “Clematis of the Month” articles. In search of a climate conducive to growing as many kinds of clematis as possible, Brewster moved to Oregon in 1981. He initially settled in Eugene. Then in 1987, through the generosity of Bob Gutmann, he was able to house the collection at Gutmann Nursery in North Plains, west of Portland. In 2005, Brewster transferred ownership of the collection to the newly-formed nonprofit Friends of the Rogerson Clematis Collection. When the collection threatened to outgrow its home at Gutmann Nursery, the Friends group was fortunate to find a home with the City of Lake Oswego at Luscher Farm, a farm-park on the outskirts of the city and part of Lake Oswego’s Parks and Recreation Department. Brewster Rogerson remained actively involved with the collection and the garden until his health began to fail. Brewster passed away at age 94 in May 2015. His dedication and love for clematis created a legacy that is now permanently housed in a beautiful garden for all to visit and enjoy. The Rogerson Clematis Collection is located at Luscher Farm, part of the Lake Oswego Parks and Recreation Department. Back to Top Rogerson Clematis Garden, 125 Rosemont Road, West Linn, OR, 97068, United States 971.777.4394 info@rogersonclematiscollection.org The Rogerson Clematis Garden is located at Luscher Farm, part of Lake Oswego's Park & Recreation system. 125 Rosemont Rd, West Linn, OR  |  971-777-4394"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "text": "Contact BROTTAR: Get in Touch for Premium Service & Inquiries\n – BROTTAR® OFFICIAL Skip to content Great news! Shipping is now available to Canada & the UK! 🚚✨ Shop now! Home Contact Wholesale About Us FAQs Log in Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Home Contact Wholesale About Us FAQs Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Search Log in Cart Item added to your cart View cart Check out Continue shopping Contact We’d Love to Hear From You At BROTTAR, we value every question, comment, and piece of feedback from our customers. Whether you’re curious about our products, need assistance with your order, or simply want to share your thoughts, our dedicated team is here to help. Multiple Ways to Connect Email: For prompt support, drop us a message at Contact@brottar.com . Contact Form: Fill out our online form available on this page for quick inquiries and we’ll get back to you within 24 hours. Customer Support: Our dedicated support team is available during business hours to provide personalized assistance and ensure your satisfaction. Our Commitment to You We believe in building lasting relationships with our customers through transparency, responsiveness, and exceptional service. Every inquiry is important, and we strive to ensure that your experience with BROTTAR is seamless and satisfying. Visit Our Website Explore our online catalog and discover how our premium products can elevate your living space. We’re here to assist you every step of the way—from product selection to post-purchase support. Thank you for choosing BROTTAR. We look forward to connecting with you! Contact form Name Email * Phone number Comment Send Support About Us Shipping & Delivery Return & Refund Policy Terms & Conditions Privacy Policy Wholesale FAQs Blog At BROTTAR, every detail matters. Founded by visionary entrepreneurs with a passion for design and excellence, our brand was born out of the desire to merge artistic innovation with everyday functionality. Our journey began with a single idea: to redefine the way you display your most cherished items. Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Payment methods PayPal Venmo © 2025, BROTTAR® OFFICIAL Powered by Shopify Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.jkvstudio.com/contact",
      "text": "Contact | Get In Touch Now — jkv studio 0 Skip to Content SOCIAL MEDIA CONTENT PRODUCTION Contact Open Menu Close Menu Contact SOCIAL MEDIA CONTENT PRODUCTION Open Menu Close Menu SOCIAL MEDIA CONTENT PRODUCTION Contact Let’s work together Name * First Name Last Name Email * Phone * (###) ### #### What services are you interested in? * Full-Service Social Media Management Content Production Graphic Design/ Web-Design A Blend of Things What is your budget? How did you hear about us? Network (a friend told me about you) Linkedin Social Media Message * Thank you! Contact Phone +41 76 544 68 99 E-Mail info@jkvstudio.com a swiss-based creative studio Work With Us Contact Us Internships Our Expertise Social Media Content About Us The Agency The Team info@jkvstudio.com +41 76 544 68 99 All rights reserved 2025 © JKV Studio GmbH"
    },
    {
      "url": "https://www.clematistechsol.com/contact.php",
      "text": "Clematis Technology Solutions India Pvt Ltd Who We Are? What We Do? Careers Blog Reach Us Reach Us Home » Reach US GET IN TOUCH Please fill out the form below to get in touch. We aim to respond to all enquiries within 3 working days. Your name* You filled this out wrong. Your E-mail* You filled this out wrong. Subject* You filled this out wrong. Your message* You filled this out wrong. Cant read the image? click here to refresh Reach Us US Office CLEMATIS INC, 8765, Stockard Drive, Unit 101, Frisco, TX 75034. Email info@clematistechsol.com Offshore Delivery Centers Unit - 103A, 1st Floor, Trade Fair Office Building Hitex Exhibition Center, Izzat Nagar, Hyderabad - 500084 Tel - +91-40-40140738 Mobile +919063237273 Email info@clematistechsol.com © 2019 Clematis Technology Solutions India Pvt Ltd Privacy Policy / Terms & Conditions / Business With Us / Sitemap"
    },
    {
      "url": "https://clematisstreet.org/clematis-social/",
      "text": "Clematis Social Nightclub - 21+ Skip to content Search for: Home About Us Dine + Drink Dance Travel Blog Previous Next Clematis Social West Palm Beach’s Newest Nightclub No strangers to the downtown nightclub scene, Cleve Mash and Mike Mash have been staples of the West Palm Beach nightlife industry for over 20 years. Going down memory lane, Clematis Social started off as the infamous Monkey Club which turned to everyones favorite, “Dr Feelgoods”, and morphed into the Pawn Shop, and now, Clematis Social. IYKYK Inspired by Miami’s Design District and Wynwood Miami , the Mashes went over the top in transforming Clematis Social into an aesthetic pleasing nightclub that rivals even the best clubs Miami Beach has to offer. The outside mural is painted by Amanda Valdez with the interior illuminating vibrantly under state of the art lighting creating one of the most unique nightclub laser show experiences. With a massive Co2 jet cooling system, club goers can stay cool while dancing to the sounds of the area’s best DJs. Do you want to dance? Those who enter Clematis Social will be greeted with cages suspended above the dance floor and a pulsating sound system that makes you feel the music to your core. The front bar area features ping pong and large sized chess if you need to take a break. When is Clematis Social Open? Clematis Social is open Thursday through Sunday. Party goers can stay dancing till 4am every Friday and Saturday and 3am on Thursdays & Sundays. Clematis Social is located at 219 Clematis Street, West Palm Beach, FL 33401.  If you are looking to host your birthday party on Clematis Street or purchase bottle service at Clematis Social, please contact Evolve Nightlife. Address 219 Clematis St West Palm Beach, FL 33401 Phone Number (561) 833-6500 Hours of Operation Thursday 9am – 3am Friday 11am – 4am Saturday 9pm – 4am Sunday 9pm – 3am Online Reviews Lenny Mauricio 2024-12-03T02:08:08+00:00 Share This Amazing Location! Facebook X Pinterest Vk Related Posts Voltaire Nightclub – 526 Clematis Street Gallery Voltaire Nightclub – 526 Clematis Street February 28th, 2018 HOTELS | RESTAURANTS | REAL ESTATE | BLOG | ADVERTISE HERE © Copyright 2010 - | SEO Services by ilocal SEO | All Rights Reserved Facebook Yelp X Page load link"
    }
  ]
}