{
  "fuentes": [
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://tastychomps.com/2023/01/inside-look-clermont-brewing-company-in-historic-downtown-clermont-craft-beer-cocktails-artisanal-food-and-live-music.html",
      "email": "nicole@mpactorlando.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://tastychomps.com/2023/05/4-6-happy-hour-menu-at-clermont-brewing-company.html",
      "email": "nicole@mpactorlando.com"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "info@secureitsecurities.com",
    "kim@parkwaybrewing.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com",
    "nicole@mpactorlando.com"
  ],
  "nombre_sitio": "clermontbrewingcompany.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://tastychomps.com/2023/01/inside-look-clermont-brewing-company-in-historic-downtown-clermont-craft-beer-cocktails-artisanal-food-and-live-music.html",
      "text": "Inside Look: Clermont Brewing Company in Historic Downtown Clermont – Craft Beer, Cocktails, Artisanal Food, and Live Music | Tasty Chomps: A Local's Culinary Guide Facebook Instagram Twitter Youtube Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials Search TASTYCHOMPS ORLANDO FOOD BLOG Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Wednesday, September 10, 2025 Sign in / Join About Foodie Faves Interviews Food Travels Recipes Contact Facebook Instagram Twitter Vimeo Youtube Tasty Chomps A Local's Culinary Guide Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials More Search Inside Look: Clermont Brewing Company in Historic Downtown Clermont – Craft Beer, Cocktails, Artisanal Food, and Live Music By Ricky Ly Jan 12, 2023 In Beer Clermont Orlando Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print 5118 Have you heard of this new craft brewery and eatery in historic Downtown Clermont? It’s called the Clermont Brewing Company – the place for Craft Beer, Cocktails, Artisanal Food, and Live Music when you are in Clermont. Voted the Best Place to Have Drinks in the 2022 Best of South Lake, Clermont Brewing Company has an on-site brewery and guests can taste exquisite seasonally changing craft beers, thin crust Neapolitan pizzas cooked in their 800 degree imported pizza oven and gourmet salads while listening live to Central Florida’s finest musicians and entertainers. The wings here are marinated 24 hours in Brewmaster Eric’s Hazy IPA, dusted with Chef Damien’s special dry rub with a touch of heat, smoked in our house smoker, and then finished off in their 800-degree oven. There’s a neighborhood, backyard barn, block party feel to the place – it’s somewhere fun to go for sure in the historic Downtown Clermont area, especially to try fantastic craft beer and pizza. View this post on Instagram A post shared by Orlando Food & Travel Guide (@tastychomps) We recently spoke with co-founder Darren Johnson about Clermont Brewing Company – read on below! Featured Menu Dishes Smoked Chicken Dip House smoked chicken tossed with buffalo sauce, cream cheese, sour cream, blended cheeses, house smoked bacon, green onions, pickled jalapeños for garnish. Served with corn tortilla chips. $12 Nach-Yo Average Nachos Choice of marinated house smoked pork or Korean BBQ chicken, with CBC beer cheese, shredded cheese, tomatoes, avocado, sour cream, pickled jalapeños, green onions and sriracha drizzle. Served with corn tortilla chips. $15 “Dream On” Sushi Roll Shrimp tempura and cream cheese, topped with krab, avocado, eel sauce, tempura flakes and spicy mayo. $18 The CBC Pizza House smoked chicken, bacon, cheddar and jack cheeses, green onions, and a cilantro-chipotle ranch drizzle. $18 Diablo Pizza Spicy tomato sauce, mozzarella, hand cut sopressa salami and pepperoni, peppadews and basil. $17 Interview with Clermont Brewing Company’s Co-Founder Darren Johnson The CBC is such an awesome place – from the brewery to the 400 (800) degree pizza oven to the backyard live music – what was your vision for CBC when you first started? To create a fun experience where you could share communal food, drinks and listen to live music. Downtown Clermont really needed more hospitality establishments to kick-off the redevelopment engine. Loved that peanut butter beer – what are some special things about the brewery that people should know? We brew 10-16 beers including many seasonal and even a seltzer. Our head brewer loves coming up with new creative beers. This week he is releasing a new white chocolate stout. What are your most popular items right now at CBC? Beer is the Mexican Lager, Hazy IPA, Sangria & Margaritas on tap, food- pizza is king followed by our smoked chicken dip, dream on sushi roll and our Korean BBQ tacos. We strive for artisanal food and craft cocktails. Tell us about your background – from event production industry to food industry – what made you decide to go into the food world? Having a 40 year career in hospitality creating a killer guest experience is first and foremost for all of my clients and events. I parlayed that expertise and knowledge into more permanent venues like CBC, The Southern on 8th and our other hospitality related ventures. It’s really all about the experience and that includes the look, feel, the lighting, the décor, music, seating, menu, beverage options, safety and cleanliness. All of those things combined is what creates the ultimate guests experience. Now doing that every second you are open is the ultimate challenge and its hard, very hard, especially today! What are some of your favorite memories around food growing up? Growing up in the 60’s/70’s my memories included Swansons TV dinners, fried baloney sandwiches, chicken pot pie and other various frozen meals, nothing that tripped any culinary switches. My 4 years in Marines taught me to eat anything there was and that really broaden my pallet. It wasn’t until my event planning career that I started to visit the top resorts in the world and got to experience some of the greatest chefs and cuisines. Your wife is multigenerational in the Clermont area – what are some of her memories of Clermont growing up and the food scene? The most exciting food memories for her was when Burger King and Wendy’s arrived in Clermont. There was still dirt roads back in the 70’s/80s. The Crown Restaurant, Rusty Fox and RJ Grunts were the top places to eat. What are your upcoming plans for the menu? What are some new dishes guests will likely see and when will they be available? New dishes are in the works and hope to release the new menu in February. We’re looking at adding some Asian influences like a fried Pork/Shrimp burger, a BADASS burger with brisket, pulled pork, Texas sausage, and onion straws for the real carnivores, 4 new killer sushi rolls and 3 new killer salads. HAPPY HOUR SPECIALS 3:00pm – 6:00pm, Monday – Friday Happy Hour Beers, Wines & Cocktails Craft Beers $3, House Wine $3, Cocktails $4 SMOKIN’ WING WEDNESDAY & DUELING PIANOS Wings available from 3 p.m. until they’re gone. Stick around for Dueling Pianos starting at 7 p.m. Live Music – Wednesday thru Sunday Wednesday Wings Holiday & Special Events Bring the whole family while enjoying our air-conditioned taproom, covered patio or our beautiful backyard beer garden at the Clermont Brewing Company. HOURS TUESDAY – THURSDAY: 3:00PM – 10:00PM FRIDAY AND SATURDAY: 11:30AM – 12:00AM (MIDNIGHT) SUNDAY: 11:30AM – 10:00PM CLERMONT BREWING COMPANY 750 W. DESOTO STREET CLERMONT, FL 34711 Home Tags: featured Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print Must Read Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Ricky Ly - UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Ricky Ly - H Mart Orlando Announces Opening Date – September 25, 2025 Ricky Ly - New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek Tiffany Nguyen - Inside Look: Tempo + Grace at Aloft Lake Nona Hotel Ricky Ly - Previous article 10 New Orlando Restaurants To Try in 2023 Next article Jollibee Opens January 18th in East Orlando – Here’s a Sneak Peek Look Inside Related Articles Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 H Mart Orlando Announces Opening Date – September 25, 2025 New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek LEAVE A REPLY Cancel reply Log in to leave a comment Downtown Magazine PRO Facebook Instagram Twitter Youtube About Foodie Faves Interviews Food Travels Recipes Contact TastyChomps.com A Local's Culinary Guide About Foodie Faves Interviews Food Travels Recipes Contact Latest Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Orlando Sep 7, 2025 0 Established in 1992 as a family-owned eatery in Jacksonville, Florida,... UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Orlando Sep 3, 2025 0 The Walt Disney World Swan and Dolphin Food &... H Mart Orlando Announces Opening Date – September 25, 2025 Orlando Aug 30, 2025 0 The highly anticipated Korean market H Mart in Orlando... Popular Is The Krusty Krab Restaurant Opening in Florida? Orlando Jul 10, 2021 0 The Krusty Krab is a fictional fast food restaurant in the American animated... 20 Best Brunch Spots in Orlando for Spring 2021 Best of Apr 14, 2021 0 Springtime in Orlando means lots of warmth and sunshine,... 900 Degreez Food Truck  – featuring Wood-Fired Oven Pizzas food trucks May 15, 2014 0 Artisan Pizza in just 90 seconds - all served... Sitemap About Foodie Faves Interviews Food Travels Recipes Contact © 2008- Present. TastyChomps.com . All Rights Reserved."
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://tastychomps.com/2023/05/4-6-happy-hour-menu-at-clermont-brewing-company.html",
      "text": "Happy Hour Hit List: NEW $4-$6 Happy Hour Menu at Clermont Brewing Company | Tasty Chomps: A Local's Culinary Guide Facebook Instagram Twitter Youtube Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials Search TASTYCHOMPS ORLANDO FOOD BLOG Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Wednesday, September 10, 2025 Sign in / Join About Foodie Faves Interviews Food Travels Recipes Contact Facebook Instagram Twitter Vimeo Youtube Tasty Chomps A Local's Culinary Guide Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials More Search Happy Hour Hit List: NEW $4-$6 Happy Hour Menu at Clermont Brewing Company By Tiffany Nguyen May 24, 2023 In American Clermont Local Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print 3491 Did you know there is a new craft brewery and eatery in historic Downtown Clermont? It is called the Clermont Brewing Company and it is the place for craft beer, cocktails, artisanal food, Tuesday night Bingo, and live music Friday through Sunday. Voted “Best Place for Drinks” in the Best of South Lake Awards , Clermont Brewing Company has an on-site brewery where guests can taste exquisite seasonally changing craft beers paired with thin crust Neapolitan pizzas cooked in their 800 degree imported pizza oven while enjoying live music by Central Florida’s finest musicians and entertainers.  For the live music calendar, click here. Bring your family and friends and grab a seat in one of their three dining areas. Choose from their elevated farmhouse inspired indoor dining to their covered patio or their vibrant beer garden. Every Tuesday at 6:30pm is Bingo night.  Come grab a seat and play for cash prizes. Hosted by Off Beat. Guests can also enjoy their Happy Hour menu available Tuesday through Friday from 3pm – 6pm. Here is an inside look at the Happy Hour menu at Clermont Brewing Company: LOADED CBC FRIES – Garlic seasoned crispy fries, melted colby jack cheese, queso blanco, applewood bacon, chipotle ranch, and scallions. SEASONED FRIED PICKLES – Seasoned pickle chips, fried to perfection. Served with chipotle ranch. BREWER’S NACHOS – Blue/white corn tortilla chips smothered in warm queso blanco, pico de gallo, pickled jalapenos, salsa verde, sour cream, house made salsa, and chipotle sauce. Choice of: oak smoked beef brisket, smoked pork or Korean bbq chicken KOREAN CHICKEN TACOS – Two flour tortilla filled with house smoked chicken, toasted sesame slaw, house pickled red onions and jalapenos, scallions, sriracha aioli, white & black sesame seeds. CALIFORNIA ROLL – Classic California roll with krab, avocado and cucumber. Topped with toasted sesame seeds. HOG WINGS – Crispy, mini pork shanks tossed in a sweet soy garlic sauce and scallions. Served with ranch dressing and carrots sticks. (3 pieces) All house beers, wines, margarita, sangria, and well drinks are $4 each. Be sure to check out Clermont Brewing Company the next time you are in the area! Hours Tuesday – Thursday: 3:00pm – 10:00pm Friday And Saturday: 11:30am – 12:00am (Midnight) Sunday: 11:00am – 10:00pm Clermont Brewing Company 750 W. Desoto Street Clermont, Fl 34711 clermontbrewingcompany.com Tags: featured Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print Must Read Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Ricky Ly - UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Ricky Ly - H Mart Orlando Announces Opening Date – September 25, 2025 Ricky Ly - New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek Tiffany Nguyen - Inside Look: Tempo + Grace at Aloft Lake Nona Hotel Ricky Ly - Previous article New Japanese-Inspired Brunch Experience: illume at JW Marriott Orlando Bonnet Creek Resort & Spa Next article Taste! Central Florida Returns August 18, 2023 – Fighting Childhood Hunger in Central Florida Related Articles Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 H Mart Orlando Announces Opening Date – September 25, 2025 New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek LEAVE A REPLY Cancel reply Log in to leave a comment Downtown Magazine PRO Facebook Instagram Twitter Youtube About Foodie Faves Interviews Food Travels Recipes Contact TastyChomps.com A Local's Culinary Guide About Foodie Faves Interviews Food Travels Recipes Contact Latest Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Orlando Sep 7, 2025 0 Established in 1992 as a family-owned eatery in Jacksonville, Florida,... UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Orlando Sep 3, 2025 0 The Walt Disney World Swan and Dolphin Food &... H Mart Orlando Announces Opening Date – September 25, 2025 Orlando Aug 30, 2025 0 The highly anticipated Korean market H Mart in Orlando... Popular Is The Krusty Krab Restaurant Opening in Florida? Orlando Jul 10, 2021 0 The Krusty Krab is a fictional fast food restaurant in the American animated... 20 Best Brunch Spots in Orlando for Spring 2021 Best of Apr 14, 2021 0 Springtime in Orlando means lots of warmth and sunshine,... 900 Degreez Food Truck  – featuring Wood-Fired Oven Pizzas food trucks May 15, 2014 0 Artisan Pizza in just 90 seconds - all served... Sitemap About Foodie Faves Interviews Food Travels Recipes Contact © 2008- Present. TastyChomps.com . All Rights Reserved."
    }
  ]
}