{
  "fuentes": [
    {
      "url": "https://krishderrico.com/clermont-history-historic-downtown-clermont/",
      "email": "krish@krishderrico.com"
    },
    {
      "url": "https://www.westcler.org/our-team/directory/index",
      "email": "info@westcler.org"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://clermontdowntown.com/contact/",
      "email": "director@clermontdowntown.com"
    },
    {
      "url": "https://sltablet.com/2025/05/31/the-florida-property-shop-celebrates-grand-opening-in-historic-downtown-clermont/",
      "email": "rfarr47938@aol.com"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "kat@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "dharmi@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "events@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "info@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "kat@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "noah@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "rachel@mydowntown.ca"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "email": "scda@rachelb75.sg-host.com"
    }
  ],
  "mails": [
    "dharmi@mydowntown.ca",
    "director@clermontdowntown.com",
    "events@mydowntown.ca",
    "info@mydowntown.ca",
    "info@westcler.org",
    "kat@mydowntown.ca",
    "krish@krishderrico.com",
    "noah@mydowntown.ca",
    "rachel@mydowntown.ca",
    "rfarr47938@aol.com",
    "scda@rachelb75.sg-host.com",
    "tstuder@astrosecuritymonitoring.com"
  ],
  "nombre_sitio": "clermontdowntown.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://krishderrico.com/clermont-history-historic-downtown-clermont/",
      "text": "Clermont History in Historic Downtown Clermont. Visit The Historic Village! Searching Clermont Relocation Guide Orlando Relocation Guide Home Buyer Guide Moving To Clermont Fl Property Search Featured Listings Selling Market Updates Home Seller Guide What’s My Home Worth? Communities Waterfront Communities Clermont Chain of Lakes Harris Chain of Lakes Clermont Chain of Lakes Homes for Sale New Construction Ardmore Reserve The Canyons at Highland Ranch Crestview Esplanade at Highland Ranch 55 Plus Communities Best 55 Plus Communities in Clermont Florida Esplanade at Highland Ranch Heritage Hills Summit Greens Kings Ridge Palms At Serenoa Trilogy Solivita Clermont Fl Communities Crestview Magnolia Pointe Johns Lake Estates Waterbrooke Johns Lake Landing Arrowhead Estates Terrace Grove Hunter’s Run Legends Minneola Fl Communities Park View At The Hills Ardmore Reserve The Canyons at Highland Ranch The Reserve at Minneola Home Living Here Schools Schools in Clermont Fl Private Schools in Clermont Fl Stores in Clermont Fl | Explore Shopping and Restaurants Best Neighborhoods in Clermont Fl Moving To Clermont Fl Living in Clermont Fl Downtown Clermont FL | South Lake Downtown Area Clermont History – Historic Downtown Clermont Meet Krish Blog Contact Facebook instagram youtube pinterest 352-613-3644 ✕ Clermont History – Historic Downtown Clermont June 26, 2019 Categories Local Lifestyle Tags central florida city of clermont clermont clermont fl clermont fl downtown clermont fl real estate clermont florida clermont history clermont homes for sale clermont houses for sale clermont real estate downtown clermont downtown clermont fl historic village historical downtown clermont south lake Clermont History: Historic Downtown Clermont Clermont’s History is Charming Historic Downtown Clermont is about Clermont’s History. Discovered in 1884 and incorporated in 1916, Clermont is full of Historical charm. For instance, there are photos of Montrose Street, the first car in Clermont, photos in the 1920’s, and 1940’s photos. In addition, you can find more photos in the YouTube video below. Location Clermont is located 30 minutes west of Downtown Orlando. Clermont’s historic village is located right at the corner of West Avenue and West Osceola Street. Besides that, it is quiet and very serene. It is a small part of the downtown Clermont area. In addition, it is located off Lake Minneola at Waterfront Park. See the Full YouTube Video Here: Name Change In June 2019, the South Lake County Historical Society changed it’s name to The Clermont Historical Society. Therefore, the Historic village is a collaboration between the Clermont Historical Society and The City of Clermont. In addition, all the homes on the site moved here on different dates. The Quonset Hut – World War II Museum The military used Quonset Huts for living and working quarters in WWII. This Quonset hut showcases many artifacts that were donated by military veterans. Therefore, it is a place of honor, stories and a place of sacrifice and love for one’s country. God Bless The United States of America. The Cooper Memorial Library There’s a modern Cooper Memorial Library that we use today and there’s the original one. The original was built in 1914 by the current City Hall. After that, the building moved to the Historic Village in 2009. Inside the Library there are many artifacts. You will find old newspapers, cameras, video equipment, and history books. In addition, there is a library card catalog, tourist marketing materials from the Citrus boom, and old radios. Suggested Read: Downtown Clermont FL – South Lake Downtown Area Moving To Clermont Florida Clermont Florida Relocation Guide Clermont Relocation Guide The Kern House Alexander and Eleanor Kern were part of the first pioneers to settle. Alexander Kern put his signature on the original legal notice for the town of Clermont on June 8th 1891. Most importantly, he was one of the 31 Pioneers that put his signature on the document. After that, It was built in 1885 and moved to the Historic Village in 2006. Improvement Made by The Kern’s In addition, he was responsible for the first public water system in Clermont. He was the owner of the Wilson general merchandise store. Many of the items were donated by area locals and are not originally from the Kern’s. However, it is a great replica of what it used to look like. The Townsend House James and Sally Townsend lived here. The Townsend family was a big part of Clermont in the early days. They were the first African-American residents to settle in Clermont in 1895. Most importantly, The Townsend started the first school for African-American children in Clermont. In addition, Sally was a midwife who they say estimated that she delivered well over a thousand babies. After that, the home moved here in 2002. It was to my surprise to find an outhouse – Clermont’s very Own Outhouse! The Herring Hooks Schoolhouse The Herring Hooks family were from New Jersey. The Hooks family had a crucial role being part of the early Pioneers in Clermont. Most importantly, they created one of the earliest colonies and projects made in the history of Florida. However, it was Harry Hooks made the official sale of thousands of acres. This schoolhouse is a replica of the original. Added to Historic Village in 2013. Fact Reveal! In conclusion, according to Lake County’s biography site, “They incorporated as the Clermont Improvement Company under the laws of New Jersey…with A. F. Wrotnoski, General manager and Treasure. Selecting the name CLERMONT for their town site, from Wrotnoski’s birthplace in France”. Therefore, Clermont, Florida is named after Clermont-Ferrand in France. Similarly, that is a very interesting fact! Suggested Read: Downtown Clermont FL – South Lake Downtown Area Moving To Clermont Florida Clermont Florida Relocation Guide Clermont Relocation Guide Connect With Us In conclusion, whether you are buying a home, selling a home, thinking of moving to the Orlando Area or just browsing, make sure you get the latest market updates, tips on selling, moving hacks and so much more by following Krish on YouTube , Pinterest , Facebook , and Instagram. Related posts May 23, 2023 Things to Do in Kissimmee, Florida, other than Disney Continue Reading February 21, 2023 Top 5 Things to do in Clermont, Florida Continue Reading December 20, 2022 3 Top-Rated Downtown Clermont Restaurants Continue Reading Search ✕ Archives Archives Select Month April 2025 March 2025 January 2025 May 2024 March 2024 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 September 2022 June 2022 February 2022 August 2021 April 2021 March 2021 February 2021 January 2021 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 Categories Buying Celebration Clermont Communities Florida Real Estate Home Decor Local Lifestyle Mom Life New Construction Orlando Retiring in Orlando Selling Working in Florida Olympus Executive Realty 16903 Lakeside Dr., Suite 6 PO Box 560343 Montverde FL, 34756 Facebook instagram youtube pinterest Cell/Text: 352-613-3644 Email: krish@krishderrico.com Business Hours: Mon – Sat: 10:00AM – 6:00PM Sunday: Closed Copyright ©  Krish D’Errico    |   All Rights Reserved   | Login |   Custom Website by Real Estate Tomato"
    },
    {
      "url": "https://www.westcler.org/our-team/directory/index",
      "text": "Staff Directory | West Clermont | Staff Directory Skip to Main Content Open main menu Our Story Show sub menu for Our Story About Us By the Numbers District Map Our Facilities Our History Our Mission and Vision Our Roadmap Portrait of a Graduate Press Releases Publications & Newsletters Quality Profile Recent News State of the Schools Town Halls West Clermont Words (Blog) #LoveWC Our Team Show sub menu for Our Team Board of Education Departments Schools Staff Directory Superintendent and CEO Treasurer and CFO Our Student Experience Show sub menu for Our Student Experience Academics Arts, Athletics, and Activities Safety and Security Whole Learner Student Services WC Your Future Event Calendar Finance Show sub menu for Finance School Finances Financial Reports Financial Reporting Awards Archived Financial Information Purchase Order Terms and Conditions Public Record Requests Treasurer Staff Directory Reporting Fraud Our Community Show sub menu for Our Community Advocacy Alumni Business Advisory Council Citizens Advisory Commission Communities and Local Governments CommunityShare Facility Rental Facility Tours Flyer Distribution Request West Clermont Flyers Partners in Education Spiritwear Town Halls Volunteer WC Education Foundation #LoveWC Stay Connected Social Media Commenting Guidelines HUB Search Home Our Team Staff Directory Index STAFF DIRECTORY To browse the list of staff members at each school, select the school below: Amelia Elementary Clough Pike Elementary Holly Hill Elementary Merwin Elementary Summerside Elementary Willowville Elementary Withamsville-Tobasco Elementary West Clermont Middle School West Clermont High School To browse the list of staff members by department, select the department below: Child Nutrition Communication and Engagement Enrollment Human Resources Operations Student Services Teaching and Learning Technology Treasurer's Office To find the contact information for a specific employee, search our district staff directory using the search function below: First Name Last Name Search by Name Department Select Department West Clermont School District Contact and Connect Notices and Compliance Our Community Alumni Business Advisory Council Communities and Local Governments Partners in Education Spiritwear Stay Connected West Clermont Education Foundation Our Story Our Student Experience Academics Arts, Athletics, and Activities Athletics Clubs and Organizations Fine Arts WC Your Future Whole Learner Student Services Child Nutrition Health Clinics Mercy HealthPlex WolfPack Pantry Wolves Wellness Center Our Team Board of Education Departments Communication and Engagement Enrollment Human Resources Operations Teaching and Learning Technology Schools Amelia Elementary Clough Pike Elementary Holly Hill Elementary Merwin Elementary Summerside Elementary West Clermont High School West Clermont Middle School Willowville Elementary Withamsville-Tobasco Elementary Wolf Pup Preschool Staff Directory Superintendent and CEO Treasurer and CFO School Finances Volunteer WolfPack Hub Child Nutrition Search by Department Staff Directory HOME Our Story Our Team Our Student Experience Our Community Work Volunteer Give Connect Enroll WolfPack Hub This site provides information using PDF, visit this link to download the Adobe Acrobat Reader DC software . West Clermont SCHOOL DISTRICT 4350 Aicholtz Road Cincinnati, Ohio 45245 P: 513.943.5000 F: 513.752.6158 Our Story Our Team Our Student Experience Our Community Follow us on Facebook (opens in new window) Follow us on Twitter (opens in new window) Follow us on Instagram (opens in new window) Follow us on YouTube (opens in new window) Follow us on LinkedIn (opens in new window) Follow us on Linktree (opens in new window) Email us Copyright © 2023 West Clermont Schools. Privacy Policy ADA Policy Site Map Annual Notices Submit Feedback Powered by SchoolNow®"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://clermontdowntown.com/contact/",
      "text": "Contact Clermont Main Street | Get in Touch with Us — Clermont Main Street Skip to Content Open Menu Close Menu About About Our History Our Team Get Involved Volunteer Donate Sponsorships Events Event Calendar Farmers Market First Friday Food Trucks Wine Stroll Vendor Hub Directory Resources Contact 0 0 DONATE Open Menu Close Menu About About Our History Our Team Get Involved Volunteer Donate Sponsorships Events Event Calendar Farmers Market First Friday Food Trucks Wine Stroll Vendor Hub Directory Resources Contact 0 0 DONATE Folder: About Back About Our History Our Team Folder: Get Involved Back Volunteer Donate Sponsorships Folder: Events Back Event Calendar Farmers Market First Friday Food Trucks Wine Stroll Vendor Hub Directory Resources Contact DONATE Get in Touch with Clermont Main Street We’d love to hear from you! Whether you're a local business owner, a potential volunteer, or just have a question about what’s happening downtown, this is the place to start. Please fill out the form below and someone from our team will be in touch with you soon. Email director@clermontdowntown.com Name * First Name Last Name Email * Phone (###) ### #### Which best describes you? * I have a general question or feedback to share. I am a business owner/operator and want to learn more about Clermont Main Street. I want to learn more about volunteering. I want to learn more about sponsorship opportunities. I want to learn more about donor opportunities. Other Message or Questions * Tell us a little more about how we can help or what you're interested in. How did you hear about us? This helps us track our marketing efforts. Downtown event Social media A local business Word of mouth Other Thank you! Privacy Policy | Terms + Conditions | Cookies Policy | Accessibility Statement Contact | About | Donate | Volunteer © 2025 Clermont Main Street. All rights reserved. Made with love at Roots Creative Co."
    },
    {
      "url": "https://sltablet.com/2025/05/31/the-florida-property-shop-celebrates-grand-opening-in-historic-downtown-clermont/",
      "text": "The Florida Property Shop Celebrates Grand Opening in Historic Downtown Clermont | South Lake Tablet Facebook Instagram Front Page Features News The South Lake Community Churches and Fellowship Clubs Community Organizations Obituaries Pets Schools Sports/Wellness Sports Wellness Business Events Upcoming Events Weekly Meetings Fundraisers Concerts and Theater Calendar of Events Submit Your Event FREE SUBSCRIPTION South Lake Business Directory Search South Lake Tablet Front Page Features News The South Lake Community Churches and Fellowship Clubs Community Organizations Obituaries Pets Schools Sports/Wellness Sports Wellness Business Events Upcoming Events Weekly Meetings Fundraisers Concerts and Theater Calendar of Events Submit Your Event FREE SUBSCRIPTION South Lake Business Directory [pro_ad_display_adzone id=\"510\"] Business Front Page The Florida Property Shop Celebrates Grand Opening in Historic Downtown Clermont May 31, 2025 The Florida Property Shop, a woman-owned real estate brokerage specializing in both local and international sales, has officially opened its newest office in historic downtown Clermont. Located at 827 W Montrose Street, the firm has been a trusted name in Central Florida real estate for 18 years. Offering a full range of services—including buying, selling, long-term rentals, and property management—the Florida Property Shop continues to serve the diverse needs of the South Lake community and beyond. To mark the occasion, the South Lake Chamber of Commerce hosted a ribbon cutting ceremony, welcoming the business to the vibrant downtown district and celebrating its ongoing commitment to the region. TAGS The Florida Property Shop Facebook Twitter Email Previous article Lake County Launches “Growth Management Workshop Series” Next article Beta Theta-ESA Celebrates 13-Year Sponsorship Journey as Student Graduates with Honors Michelle Delaney RELATED ARTICLES MORE FROM AUTHOR Events Blessed Sacrament Hosts Two-Day Community Event to Benefit Social Hall Renovations (Oct 10 and 11) Events Family History Research: Beginning Genealogy Classes- Session 3  (October 1) Clubs Planting Knowledge In The Community: Plants For Cooper Memorial Library And Clermont City Hall Current Month september VFW Bingo VFW Post 5277 855 W. DeSoto St 07 mar (mar 7) 6:30 pm 26 dec (dec 26) 9:30 pm VFW Bingo Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS\nBingo starts at 6:30 doors open at 5 PM all are welcome.\n😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO.\nFood and beverages Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS Bingo starts at 6:30 doors open at 5 PM all are welcome. 😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO. Food and beverages are available. NO SMOKING come make a friend or be one. 50/50 with 3 prizes Time March 7 (Friday) 6:30 pm - December 26 (Friday) 9:30 pm Location VFW Post 5277 855 W. DeSoto St Organizer Veterans of Foreign Wars post 5277 Bob Farrell 855 W. Desoto Street Clermont Florida 34711 Calendar GoogleCal VFW Bingo VFW Post 5277 855 W. DeSoto St 25 apr (apr 25) 6:30 pm 13 feb (feb 13) 9:30 pm VFW Bingo Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS\nBingo starts at 6:30 doors open at 5 PM all are welcome.\n😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO.\nFood and beverages Event Details VFW 855 W. Desoto St. Clermont Fla. 34711 DOWNSTAIRS Bingo starts at 6:30 doors open at 5 PM all are welcome. 😊WE ROLLED BACK OUR PRICES TO 10 YEARS AGO. Food and beverages are available. NO SMOKING come make a friend or be one. 50/50 with 3 prizes Time April 25 (Friday) 6:30 pm - February 13 (Friday) 9:30 pm Location VFW Post 5277 855 W. DeSoto St Organizer Veterans of Foreign Wars post 5277 Bob Farrell 855 W. Desoto Street Clermont Florida 34711 Calendar GoogleCal Adv. Email Marketing: Grow Contact Lists, Personalize Messages & Create Re Mid-Florida SCORE Webinar presentations 11 sep 10:00 am 11:30 am Adv. Email Marketing: Grow Contact Lists, Personalize Messages & Create Re Sept 11 Memorial Ceremony Clermont Arts and Recreation Center 3700 S US Hwy 27, Clermont, FL 34711 11 sep 10:00 am Sept 11 Memorial Ceremony Event Details Join the Clermont Fire Department and the Clermont Police Department for their Annual September 11 Memorial Ceremony. \n\nTogether, they will honor and remember the lives lost and the heroic actions of Event Details Join the Clermont Fire Department and the Clermont Police Department for their Annual September 11 Memorial Ceremony. Together, they will honor and remember the lives lost and the heroic actions of first responders on that tragic day Time (Thursday) 10:00 am Location Clermont Arts and Recreation Center 3700 S US Hwy 27, Clermont, FL 34711 Calendar GoogleCal Dealing with Difficult DNA: Endogamy, High-RoH, and Other Hazards (Sept 11) COOPER MEMORIAL LIBRARY 2525 Oakley Seaver Drive 11 sep 4:30 pm 6:30 pm Dealing with Difficult DNA: Endogamy, High-RoH, and Other Hazards (Sept 11) Event Details The Pastfinders of South Lake  - Navigating complex DNA scenarios more Event Details The Pastfinders of South Lake  – Navigating complex DNA scenarios can create difficulties in genealogical research. However, there are tools and techniques available to differentiate and interpret DNA data in situations where the Leeds Method and WATO do not work. We will compassionately and clearly review the various challenges, ways to identify circumstances, and discuss tools and techniques to develop a hypothesis. Bring your favorite notetaking device, attendees will learn strategies to resolve mysteries and clarify relationships even when parents are closely related or when dealing with other challenging situations in genetic genealogy. Speaker: Kate Penney Howard – Kate Penney Howard is a genetic genealogist and speaker specializing in endogamy and breaking down challenging research barriers with DNA. She brings decades of experience in family research and hundreds of successfully solved genetic genealogy cases. Known for her compassionate approach, Kate helps clients uncover ancestral mysteries while providing them with more complete family medical histories and a stronger sense of identity. Her presentations captivate audiences by seamlessly blending historical context, technical guidance, and well-placed humor that keeps listeners engaged throughout. Kate discovered her passion for teaching during her cancer journey, finding fulfillment in sharing knowledge with fellow genealogists. She approaches her work with integrity, deliberately addressing historical injustices and dispelling common myths in her presentations. Her speaking engagements include RootsTech, Strathclyde Institute for Genealogical Studies, East Coast Genetic Genealogy Conference, the International Congress on Medieval Studies, the Society for German Genealogy in Eastern Europe, the International Association of Jewish Genealogical Societies, the New England Regional Genealogical Consortium, and the Foundation for East European Family History Studies, in addition to many state and county level organizations. Kate studied vocal music and earned a Master of Divinity from Christian Theological Seminary in Indianapolis in 2011. She has served as a pastor in Fort Wayne since her ordination in 2012 How to Attend – We invite you to join Pastfinders and Kate Penney Howard on Thursday, September 11th, 2025. To register for the Zoom link, https://tinyurl.com/DNASept11PSLC5pm . Alternatively, you may attend the presentation at Cooper Memorial Library and view Ms. Howard on the large screen.  While attending, you will have the opportunity to connect with like-minded individuals, enjoy refreshments, and gain new insights.  A live Q&A session will be available for all participants. To learn more about the Pastfinders of South Lake County Genealogical Society, please visit PastfindersSLC.org Time (Thursday) 4:30 pm - 6:30 pm Location COOPER MEMORIAL LIBRARY 2525 Oakley Seaver Drive Calendar GoogleCal How to Develop Your Marketing Plan Mid-Florida SCORE Webinar presentations 11 sep 5:30 pm 8:00 pm How to Develop Your Marketing Plan Using Reference Solutions to Grow your Small Business Mid-Florida SCORE Webinar presentations 12 sep 11:00 am 12:30 pm Using Reference Solutions to Grow your Small Business Recent Articles Blessed Sacrament Hosts Two-Day Community Event to Benefit Social Hall Renovations (Oct 10 and 11) September 10, 2025 Family History Research: Beginning Genealogy Classes- Session 3  (October 1) September 10, 2025 Planting Knowledge In The Community: Plants For Cooper Memorial Library And Clermont City Hall September 9, 2025 New Beginnings Pantry in Urgent Need of Donations September 9, 2025 Cops N’ Cones for Kids: A Sweet Day of Community Fun (Sept 22) September 8, 2025 Article Categories Business Churches and Fellowship Clubs Community Organizations Concerts and Theater Events Features Front Page Front Page Featured Fund Raisers Health Meetings News Obituaries Pets Schools Sports Wellness The South Lake Community Uncategorized Copyright © 2022-2024 - South Lake Tablet - A Buena Vista Publishing Company. All Rights Reserved. X X"
    },
    {
      "url": "https://mydowntown.ca/member-resources/our-team/",
      "text": "Our Team Staff and Board of Management - St. Catharines Downtown Association Skip to content St. Catharines Downtown Association Do More in the Core. Search for: Member Resources Invest Contact Land Acknowledgment Menu Search for: Home Gift Cards Discover Shop Dine Play Explore Events Downtown Walking Tours Events Calendar Sponsorship Opportunities Where to Park Parking Fees About What is the SCDA Sponsorship Opportunities News Cycling Downtown Learn More About Urban Street Trees in the BIA Welcome to the Pollinator Project Member Resources About SCDA Our Team Staff and Board of Management Promotional Opportunities Garbage and Recycling Graffiti City and Government Resources Member Info Sessions Member Communications Board and Committees Invest Programs and Incentives Property Information Contact Land Acknowledgment Home / Member Resources / Our Team Staff and Board of Management Our Team Staff and Board of Management The St. Catharines Downtown Association team is made up of our staff and board members. Click below to view the Code of Conduct. Code-of-Conduct-for-St-Catharines-Downtown-Association-Board-of-Directors-and-Staff.docx Download (Communications Strategy relocated to Member Communications subsection) Staff Staff members carry out all activities of the Association as dictated by the board and its committees, comprised of BIA member volunteers.   The association staff is comprised: Katherine (Kat) Dodge , Executive Director kat@mydowntown.ca 905-685-8424 Ext. 1 Jennifer Blackledge , Events Director events@mydowntown.ca 905-685-8424 Ext. 3 Anne Kalagian , Executive Assistant info@mydowntown.ca 905-685-8424 Ext. 0 Noah Medel, Maintenance Manager noah@mydowntown.ca 905-685-8424 Ext. 4 Dharmi Gohil, Marketing & Communications Coordinator dharmi@MyDowntown.ca 905-685-8424 Our staff members are here to support and advocate for you and have a variety of responsibilities. The team hosts and organizes all meetings of the Association manages and administers financial affairs, addresses member concerns and complaints, communicates parking, traffic, streetscaping and by-law issues and ideas from the membership to the City and/or region, issues a monthly online newsletter, initiates personal contacts, and maintains the membership database, responds to requests for information from the local community as well as tourist-oriented agencies and individuals, and works with community stakeholders. Contact our office at info@mydowntown.ca or call 905-685-8424. Board of Management The board runs concurrently with City Council and nominations and elections of board members are done at the same time as the municipal elections, unless a board member has resigned and there is a vacant spot to fill in the interim. The current Board of Management for the 2022-2026 term: There is currently a vacancy on the Board of Directors; the position closes Wednesday, August 20, 2025 Click here to learn more about the vacancy Rev. Karen Orlandi ; representing Tony’s Fish Market, 379 St. Paul Street Chair, Executive Sharvin Keshavarznia ; Full Circle Property Groups, 13 Queenston Street Treasurer, Executive Katie MacCabe ; Wandering Spirits, 31 James Street Secretary, Executive Stephen Bedford ; representing Fourteen Church Street Property Inc., 14 Church Street David Cooperman ; Cooperman Real Estate Inc, 8 Church Street Joe Critelli ; Critelli’s Fine Furniture, 129 King Street & Critelli Modern Furniture, 169 St. Paul Street Milan Curcic ; Niagara Food Tours, 214 King Street Orhan Kerim ; Erroll’s Shoe & Luggage Repair, 60 St. Paul Street Jake Mach ; representing Restaurant Capelin, 31 James Street Jennifer McKenna ; Little Chief & Co., 163 St. Paul Street Councillor Robin McPherson ; City Council Representative Amy Morrison ; The Boot Shop, 46 James Street If you would like to reach a member of our Board of Management, or for general questions and concerns, please contact the St. Catharines Downtown Association office at info@mydowntown.ca or call 905-685-8424. (Information about Meetings – Board of Management and Committee – has been relocated to Board Meetings and Committee Meetings ) More About Member Resources Member Resources About SCDA Created in 1973, the St. Catharines Downtown Association is a provincially legislated, not-for-profit Business Improvement Area (BIA). More About SCDA & New Member Welcome Member Resources Promotional Opportunities Take a look at ongoing and upcoming opportunities to get involved! More About Promotional Opportunities Member Resources Advocacy & Leadership Our commitment to fostering a vibrant, thriving downtown is at the heart of what we do. More About Advocacy & Leadership Member Resources Garbage and Recycling Collection boundaries, schedules and important waste collection information. More About Garbage and Recycling Member Resources Graffiti Any criminal activity should be reported to the police and to the Downtown Association. More About Graffiti Member Resources City and Government Resources Useful links for members. More About City and Government Resources Member Resources Member Info Sessions Resources for members to download. More About Member Info Sessions Member Resources Member Communications Email communications for members More About Member Communications Member Resources Board and Committees Meeting information for the Board of Management and for SCDA Committees More About Board and Committees St. Catharines Downtown Association Do More in the Core. St. Catharines Downtown Association 80 King Street, Main Floor, St. Catharines, Ontario, Canada, L2R 7G1 OFFICE HOURS | Monday – Friday, 8:30am – 4:30pm PHONE | 905-685-8424 Contact Us Sign Up Sign up to receive the latest happenings, updates and news from Downtown St. Catharines delivered directly to your inbox. Facebook Twitter Instagram © 2025 St. Catharines Downtown Association Privacy Policy Terms & Conditions Sitemap This website uses cookies to improve your experience. By using our site, you agree to the terms outlined in our Privacy Policy. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT [ Placeholder content for popup link ] WordPress Download Manager - Best Download Management Plugin Close By 2041, Downtown St. Catharines will look at lot different than it does today with an estimated 30% increase in population density. This level of development will have significant implications for the Urban Forest (UF) in the BIA. Currently, tree planning and maintenance is generally divided between two departments: Community, Recreation & Culture Services and Municipal Works. These two departments are responsible for the entire UF in the City of St. Catharines which is an incredible amount of responsibility. An expanded Urban Forestry team would amplify and assist the work being done already, allowing for greater capacity, interdepartmental collaboration, and external participation from the public. An expanded Urban Forestry team can provide many services for the City, to ensure these urban forests are properly valued and maintained into the future. × Imagine grabbing your bike and riding along the Twelve Mile Creek to your favourite restaurant downtown! Once trees are established as natural assets and partnerships are created, these urban trees can be protected through the implementation of municipal by-laws. These efforts will provide urban trees with the proper resources to grow into mature infrastructure under the guidance of an urban forest technician. From there, we can improve connectivity between the St. Catharines Downtown BIA and Twelve Mile Creek. Improving connectivity with Twelve Mile creek will help the SCDA to activate and monitor this area for its potential as an environmental & tourist asset. With this action, the SCDA can also advocate for improved multi-modal transportation routes and monitor their value for the downtown BIA. × In a forest, some trees provide shade for other species to thrive beneath the canopy – while others share nutrients in the soil so that diversity can thrive! Similar to these forest trees, the best way to create strength and resilience for a sustainable urban forest is through the establishment of formal partnerships. To bring more harmony between the City wide greening efforts, a formal partnership could exist between the City of St. Catharines’ Green Committee and the SCDA’s own StreetScape & Sustainability Committee. This would establish a cooperative force to ensure that urban street trees are effectively managed and prioritized as important infrastructure for the Downtown core. These partnerships can be extended to other groups that will improve our collective efforts to provide a sustainable urban forest for many years to come such as: The City of St. Catharines Niagara Region Niagara Peninsula Conservation Authority Vineland Research & Innovation Niagara College Land Care Niagara Trout Unlimited Bring Back the Brookies ncStewards Many more! × We all love trees for their natural radiance: they provide us with shade, greenery, and a sense of community. For many of us, trees are the reference for where we call home. Like many other animals, we use trees to keep us cool, to get around and to keep us safe. Since trees are so important, it can be difficult to truly capture the infrastructural importance of trees for our communities and the environment. This is where our first step comes into play. By reclassifying USTs, we will help establish these trees as valuable, sustainable, and significant assets for the City. The City of St. Catharines Asset Management department works to provide longevity for their assets, guide decisions, provide guidance for maintenance and rehabilitation, analyze costs/benefits, and strategically integrate this infrastructure with community objectives. “Natural asset management is a meaningful way for municipalities to respond to the impacts of climate change.” Cassandra Pacey, Asset Manager, City of Waterloo (August 2022) By reclassifying trees as assets, particularly with an emphasis on Climate Change adaptation, the City of St. Catharines will ensure that the services trees provide us are justly appraised and appreciated, so that proper management of these assets can create a sustainable investment into the future. × When a tree falls in the city, does it make a sound? Under the direction of the Urban Forest Manager & with the proper by-laws in place, every urban forest tree will be provided with various protections to prevent unmonitored losses: Long-term maintenance Developer accountability for equal-value replacements Funds or subsidies for private property owners for replacing trees Tree inspections and assessments Investigations on maintenance and replacement strategies Many municipalities have varying urban forest management by-laws that help protect their urban canopy. By exploring these protections, the City of St. Catharines can help protect our urban forest investments and reduce costly retroactive efforts to replace lost value. × While the law can help protect the existing tree population, the City of St. Catharines can invest in effective planning to ensure that new trees are provided with the proper ingredients to thrive and grow into maturity. Each tree will require its own unique considerations and should be appraised by a professional. The primary considerations include: LOCATION : Determining available sites within the Downtown core for new trees. SPECIES SELECTION : Selecting hardy species that can survive within the conditions of an urban environment, while ensuring that the diversity of the urban forest remains high (this creates resilience against disease and climate change). SITE PREPARATIONS: Preparing the site is arguably the most important step to ensuring longevity in a tree population; if a tree doesn’t have the opportunity to establish stability within its environment, it will not likely reach its full potential for size and age. There are multiple factors to consider: Tree Species Canopy potential Stature Hardiness (i.e. resilience to drought, weather conditions, sunlight, etc) Leaf Size (shade capacity) Soil Conditions (i.e. compaction, nutrient accessibility, moisture availability, etc.) Is the soil too compacted for a sapling to establish itself? Perhaps a soil cell system and potential mycorrhizal amendments will do the trick! Is the site not suitable for in-ground tree planting? Perhaps a large, mobile tree planter would be more suitable. There are a lot of creative ways to integrate green technology to ensure a flourishing urban canopy! × Sign Up for News and Updates Sign up to get the latest updates, events, and news from Downtown St. Catharines delivered directly to your inbox. Email Address * Name * X Go to mobile version"
    }
  ]
}