{
  "fuentes": [
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "button-foursquare-1@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "button-foursquare-1@3x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "button-tripadvisor-logo-5@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "button-tripadvisor-logo-5@3x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "siri-restaurants-tripadvisor-4@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "siri-restaurants-tripadvisor-4@3x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "snippet-foursquare-logo-1@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "email": "snippet-foursquare-logo-1@3x.png"
    },
    {
      "url": "https://www.bloomberg.com/news/articles/2024-03-21/miami-beach-hotel-offers-to-swap-all-night-drinking-for-condos",
      "email": "inquiry1@bloomberg.net"
    },
    {
      "url": "https://www.nbcmiami.com/news/local/clevelander-hotel-owners-submit-plan-to-turn-south-beach-landmark-into-housing-development/3140688/",
      "email": "southflorida-web@3x.png"
    }
  ],
  "mails": [
    "button-foursquare-1@2x.png",
    "button-foursquare-1@3x.png",
    "button-tripadvisor-logo-5@2x.png",
    "button-tripadvisor-logo-5@3x.png",
    "inquiry1@bloomberg.net",
    "siri-restaurants-tripadvisor-4@2x.png",
    "siri-restaurants-tripadvisor-4@3x.png",
    "snippet-foursquare-logo-1@2x.png",
    "snippet-foursquare-logo-1@3x.png",
    "southflorida-web@3x.png"
  ],
  "nombre_sitio": "clevelander.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://maps.apple.com/place?q=The+Clevelander+South+Beach&ll=25.7808069,-80.1306963&auid=16988447503252253979&lsp=9902&address=1020+Ocean+Dr,+Miami+Beach,+FL++33139,+United+States",
      "text": "The Clevelander South Beach in Miami Beach, FL United States - Apple Maps Apple Maps Search Guides Directions Have a Business on Maps? Manage Your Business The Clevelander South Beach The Clevelander South Beach Hotel · Miami Beach, Florida Directions Call Website Book More Claim This Place TRIPADVISOR (2K) 4.1 COST $ $ $ $ Atmosphere Tripadvisor Amenities & Services Tripadvisor Exterior Tripadvisor All Photos Tripadvisor Ratings & Reviews 4.1 (2,031) A great hotel with really friendly and welcoming staff. The hotel is situated right in the middle of Ocean Drive with an awesome bar right outside the hotel! The staff at every shift were nothing shor A4435TJdanielc Last week We are from Tampa and I get held at work on Saturday the day of our check in so we called and let them know and they took care of us noting it for Kristy at the desk when we checked in. Upon Arrival s P807FNrichardp Last week I was welcomed and checked in by Michelle from the front desk. She was very kind and helpful. I arrived early and she upgraded my room and gave me a great view. The trip started off great for me. She michaelamelikan Last month Good to Know Wheelchair Accessible Swimming Pool Spa Free Wi-Fi Beachfront Paid Private Parking On-Site Street Parking Wheelchair Accessible Swimming Pool Spa Free Wi-Fi Beachfront Paid Private Parking On-Site Street Parking 24-Hour Front Desk Room Service Suites Televisions Accepts Credit Cards More Featured in Guides Top Things to Do on Ocean Drive Also at This Location Game On Sports Bar 38% (8) C-LEVEL Rooftop Terrace 100% (1) Details Website clevelander.com Phone +1 (877) 532-4006 Address 1020 Ocean Dr Miami Beach, FL  33139 United States More on Tripadvisor Claim This Place"
    },
    {
      "url": "https://www.bloomberg.com/news/articles/2024-03-21/miami-beach-hotel-offers-to-swap-all-night-drinking-for-condos",
      "text": "Miami Beach’s Clevelander Hotel Offers to Swap All-Night Drinking for Condos - Bloomberg Skip to content Bloomberg the Company & Its Products The Company & its Products Bloomberg Terminal Demo Request Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Customer Support Customer Support Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Products and Account Information Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Contracts and Orders Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Sign In Subscribe Search Live TV Markets Chevron Down Economics Industries Tech Politics Businessweek Opinion More Chevron Down US Edition Chevron Down Menu Subscribe Wall Street South: South Florida’s Financial Power Latin American Wealth Palm Beach Parties On ‘Impossible’ Traffic Mess Back Forward CityLab Miami Beach Hotel Offers to Swap All-Night Drinking for Condos Jesta Group have proposed developing two 12-story towers Former Mayor criticizes tactics to convince city authorities Facebook X LinkedIn Email Link Gift Expand People walk past the Clevelander South Beach Hotel in Miami Beach, Florida. Photographer: Joe Raedle/Getty Images Facebook X LinkedIn Email Link Gift Gift this article Contact us: Provide news feedback or report an error Confidential tip? Send a tip to our reporters Site feedback: Take our Survey New Window Facebook X LinkedIn Email Link Gift By Anna J Kaiser March 21, 2024 at 3:37 PM UTC Bookmark Save The owners of Miami Beach’s legendary Clevelander hotel are offering to give up its hard-partying ways in a bid to reshape the city’s Art Deco skyline. Jesta Group is pitching construction of two 12-story luxury condominiums. The Montreal-based owner said it would keep the hotel intact, but would surrender its outdoor entertainment license, which for decades has allowed the venue to hold raucous parties for up to 700 people until 5 a.m. Jesta would also drop a lawsuit against the city after authorities tried to limit late-night alcohol sales and reduce noise. Home BTV+ Market Data Opinion Audio Originals Magazine Events News Markets Economics Technology Politics Green Crypto AI Work & Life Wealth Pursuits Businessweek CityLab Sports Equality Management & Work Market Data Stocks Commodities Rates & Bonds Currencies Futures Sectors Economic Calendar Explore Newsletters Explainers Pointed News Quiz The Big Take Graphics Submit a Tip About Us Terms of Service Do Not Sell or Share My Personal Information Trademarks Privacy Policy Careers Made in NYC Advertise Ad Choices Help © 2025 Bloomberg L.P. All Rights Reserved."
    },
    {
      "url": "https://www.nbcmiami.com/news/local/clevelander-hotel-owners-submit-plan-to-turn-south-beach-landmark-into-housing-development/3140688/",
      "text": "Clevelander owners submit plans to turn Miami Beach hotel into housing – NBC 6 South Florida Skip to content Main Navigation Search Search for: Local Weather Video On Your Side Investigates Responds Newsletters TV Listings Watch 24/7 Create profile / Log in Dashboard Email preferences Sign out Trending 🌪️Hurricane Season 6 to Know 📺Watch News 24/7 🔎 Send a Tip What’s Being Built Here Money Chat Dangerous Drive Newsletters How to Stream Expand Miami Beach Clevelander Hotel owners submit plan to turn South Beach landmark into housing development The proposal calls for an 18-story housing high-rise with 137 residential units and a ground-floor restaurant. By NBC6 and Chris Hush • Published October 24, 2023 • Updated on October 24, 2023 at 6:47 pm BOOKMARKER NBC Universal, Inc. The owners of the Clevelander Hotel and Bar are stirring up controversy in Miami Beach after submitting plans to turn the iconic landmark into a housing development. The proposal calls for an 18-story affordable housing high-rise, with more than 120 residential units and a ground-floor restaurant. That's shorter than the 30 stories suggested last month. At least 40% of the units would be affordable housing, and the existing art deco-style Clevelander Hotel and Essex buildings will remain. Watch NBC6 free wherever you are WATCH HERE One of Clevelander's owners spoke to NBC6 in September, explaining their perspective on the plans. “It provides affordable housing in an area that is drastically underserved, and it creates a new iconic architecture in a neighborhood that wants to transform,\" said Anthony O'Brien, senior managing director of the Jesta Group. An 18-story development is reportedly still too large for Commissioner Alex Fernandez, who released a statement saying the project could open the door to overdevelopment in the Art Deco District. He also argues that not only will the high-rise stick out like a sore thumb in the historic district, but it won’t be affordable enough for the residents in the area. “This is a slap to the face to its heritage, to its culture, its residents and residents who value historic preservation,\" Fernandez argued. \"There’s nothing affordable about this. You’re talking about housing for people who could make 90 or 90,000 with studios at about $2,100 a month. So, how is that really affordable?” “I will agree with you that there are affordable rentals that are dramatically lower for people that are impoverished,\" said Alexander Tachmes, an attorney for the Clevelander. \"This is more along the lines of workforce housing.” Local 6 to Know 9 hours ago 6 to know – Top stories of the day Wilton Manors 15 mins ago Roofer killed after falling from five-story building in Wilton Manors: Police Fernandez claims the owners are taking advantage of the state’s Live Local Act, which incentivizes affordable housing and allows developers to bypass local zoning ordinances. Miami Beach Mayor Dan Gelber said he's worried others will follow suit. \"If they can get that done than any other parcel in the area can do exactly the same thing at the same height or higher, which would be the end of Ocean Drive,\" Gelber said. The Miami Beach Planning Board on Tuesday will consider proposals aimed at lowering heights allowed for new buildings within a mile of Ocean Drive. Fernandez is a sponsor of the two legislative initiatives and says he will be present Tuesday to address the significant impacts of the Live Local Act and work to protect Miami Beach's unique character. A planning board is reviewing the submitted proposal for the Clevelander. Any action likely won't happen until commissioners meet in December. This article tagged under: Miami Beach South Florida South Beach on now Live: NBC6 South Florida News @ 4PM Trending Stories Lawsuits Paperwork error at Doral car dealership leads to arrest of U.S. Coast Guard officer YNW Melly Rapper YNW Melly seeks to replace legal team amid Broward double murder re-trial Pembroke Pines Police investigating ‘suspicious' deaths of man and woman in Pembroke Pines Florida Florida education commissioner to investigate teacher comments on Kirk assassination 9/11 anniversary Bald eagle lands on Florida fire station during 9/11 remembrance ceremony Weather Forecast Facebook Instagram TikTok Youtube About NBC 6 Our News Standards Submit Tips for Investigations Newsletters Contact Us Xfinity: Internet, TV, streaming, more WTVJ Public Inspection File WTVJ Accessibility WTVJ Employment Information FCC Applications Terms of Service Advertise with us Send Feedback Privacy Policy Your Privacy Choices CA Notice Ad Choices Copyright © 2025 NBCUniversal Media, LLC. All rights reserved Close Menu Create profile / Log in Dashboard Search for: Newsletters News NBC 6 News Local US & World Weather Weather alerts Hurricane Season On Your Side Investigates Responds Submit a tip PolitiFact Impact With Jackie Nespral Voices With Jawan Strader South Florida Live Entertainment Traffic Sports Community About NBC 6 Our News Standards Submit a Consumer Complaint Submit Photos and Video Contests TV Schedule Our Apps Newsletters TV Schedule Cozi TV Follow Us Facebook Instagram TikTok Youtube Contact Us"
    }
  ]
}