{
  "fuentes": [
    {
      "url": "https://18birdies.com/golf-courses/club/8eed97f0-86ac-11e4-8c28-020000005b00/clewiston-golf-course",
      "email": "robbie.rush@clewiston-fl.gov"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/clewiston/clewiston-golf-course",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "email": "ballers-logo-white-png-landscape_x60@2x.png"
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "email": "info@ballerscrazygolf.co.uk"
    },
    {
      "url": "https://firstteefloridagoldcoast.org/10600-2/",
      "email": "robbie.rush@clewiston-fl.gov"
    },
    {
      "url": "https://seminoletribune.org/golf-pro-is-ace-in-hole/",
      "email": "tribune@semtribe.com"
    }
  ],
  "mails": [
    "ballers-logo-white-png-landscape_x60@2x.png",
    "customerservice@golflink.com",
    "info@ballerscrazygolf.co.uk",
    "robbie.rush@clewiston-fl.gov",
    "tribune@semtribe.com"
  ],
  "nombre_sitio": "clewiston-fl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://18birdies.com/golf-courses/club/8eed97f0-86ac-11e4-8c28-020000005b00/clewiston-golf-course",
      "text": "Clewiston Golf Course - Scorecards, Reviews | 18Birdies Best Golf App 190k Ratings star star star star star 4.9 Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Follow Us Navigations Clewiston Golf Course Length 6353 yds Rating 70.6 Slope 120 3.5 star star star star-o star star-o 32 Reviews 39 Followers Address: 1200 San Luiz Ave Phone: +1 (863) 983-1448 Email: Robbie.Rush@clewiston-fl.gov Website: http://www.clewiston-fl.gov/ Available Services Driving Range(Mat) Putting Green Practice Bunker Motor Cart Pull Cart Golf Club Rental Club Fitting Pro Shop Golf Lessons Restaurant Receptions Changing Room Locker Room Lodging Share to: Scorecard Clewiston White 6353 yds (120/70.6) for Men White 6353 yds for Women Yellow 5647 yds (113/67.6) for Men Yellow 5647 yds for Women Red 5052 yds (104/63.6) for Men Red 5052 yds (107/68) for Women Hole Par Handicap White 1 4 9 349 2 3 7 171 3 4 5 368 4 4 11 367 5 5 15 476 6 4 3 414 7 4 1 428 8 5 13 479 9 3 17 129 OUT 36 3181 TOT Hole Par Handicap White 10 4 4 354 11 4 2 426 12 5 16 455 13 3 10 192 14 4 12 355 15 3 18 144 16 5 14 503 17 4 8 394 18 4 6 349 IN 36 3172 TOT 72 6353 View Scorecards for Courses Worldwide Course Reviews 3.5 out of 5 star star star star-o star star-o 32 Reviews Value 3.6 star Course Condition 3.3 star Course Difficulty Hard Green Speed Medium Pace of Play Fast Steele Buker star star star star star-o Dec 26, 2024 Logan Mantz handicap 9.9 star star star star-o star-o Feb 23, 2024 Arnold Moore star star star star star-o Jan 11, 2024 Nick B star star-o star-o star-o star-o Jun 4, 2023 The greens are in the worst condition I’ve ever seen. The price of 45 dollars for 18 is an absolute joke for what the course offers. I will not be revisiting this course to say the least. Michael Davis handicap 14.0 star star-o star-o star-o star-o Apr 20, 2020 Greens were sanded and in terrible shape View More Course Reviews Download 18Birdies to View Course Insights Including Hole-by-Hole Stats & More · Golf GPS · Stats · Scorecards · Courses Worldwide google-play Followers(39) Leaderboards Clewiston - Best Gross (All times) 1 J. Zellmer -6 (66) 2 J. Zellmer -5 (67) 3 D. Bleier -2 (70) 4 N. smith +1 (73) 5 S. Newgard +2 (74) View Complete Leaderboard Company About Us Our Mission Featured In Shop Features Digital Caddy School AI Swing Analyzer Community Tournaments Golf Courses Resources Contact Us Become an Ambassador FAQs Premium Membership Follow Us © 18Birdies, LLC.All Rights Reserved. Legal Information Terms of Service Privacy Policy"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/clewiston/clewiston-golf-course",
      "text": "Clewiston Golf Course, Clewiston, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Clewiston Public 3.5 1 Review Clewiston Golf Course Designed by Styles & Van Kleeck and opened in 1929 Clewiston - Clewiston , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Course Details Holes: 18 Par: 72 Length: 6353 yards Slope: 120 Rating: 70.6 Driving Ranges: Yes The 18-hole \"Clewiston\" course at the Clewiston Golf Course facility in Clewiston , Florida features 6353 yards of golf from the longest tees for a par of 72. The course rating is 70.6 and it has a slope rating of 120. The estimated green fees for 18 holes is $51. Clewiston Golf Course Golf Club has an onsite driving range with 4 practice tees. Designed by Styles & Van Kleeck, the Clewiston golf course opened in  1929. Estimated Green Fees $51 These rates are an estimate of what you might expect to pay at Clewiston with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Clewiston HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT White 70.60/120 349 171 368 367 476 414 428 479 129 3181 354 426 455 192 355 144 503 394 349 3172 6353 Yellow 66.60/113 328 161 351 353 457 352 329 434 114 2879 347 312 415 178 347 126 451 304 288 2768 5647 Red 63.60/104 314 152 288 301 371 301 303 364 71 2465 284 305 397 165 337 83 439 294 283 2587 5052 Red (L) 68.00/107 314 152 288 301 371 301 303 364 71 2465 284 305 397 165 337 83 439 294 283 2587 5052 Par 4 3 4 4 5 4 4 5 3 36 4 4 5 3 4 3 5 4 4 36 72 Swipe to See full table Clewiston Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Clewiston Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 What Golfers are Saying 3.5 Based on 1 Review Write a review Add a Photo Drop Photo Here or Click to Upload Submit Max C. Reviewed October 10, 2010 The course is well maintained and the tiny crowned greens on the back nine are a real challenge. Golf staff if cordial and friendly. DO NOT ruin your experience by going into the restaurant. Incredibly inhospitable and rude staff that will make you NOT want to come back. Skip that and go to Sonny's down the street and you'll have a fun experience all in all. Read More Nearby cities with courses Belle Glade 1 Course 1201 San Luiz Ave, Clewiston, FL 33440-4118 (863) 983-1448 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://ballers-crazy-golf.myshopify.com/pages/contact-us",
      "text": "Contact Us – Ballers Crazy Golf Skip to content Menu Home About Our Course Events Events menu Taste of London Summer Standon Calling England Rugby Pub in the Park - Marlow Arsenal FC Taste of London Festive Pricing FAQs Contact Us Search again View cart Contact Us Our course provides the perfect entertainment to a whole host of events and occasions. Whether it's private parties, weddings, corporate hire or events. Get in touch to discuss your requirements. info@ballerscrazygolf.co.uk Name Email Phone Number Message Sign up for updates Promotions, news and events. Directly to your inbox. Subscribe Copyright © 2025, Ballers Crazy Golf . Powered by Shopify Close Cart Shopping Cart Your cart is currently empty. Enable cookies to use the shopping cart t:\n\n                        \n                        \n                          e (- ) Remove Item Quantity Discount: - Subtotal £0.00 Tax included and shipping calculated at checkout Checkout Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://firstteefloridagoldcoast.org/10600-2/",
      "text": "Clewiston Golf Course - First Tee - Florida Gold Coast Skip to content About Contact Youth Safety Search for: Search Bar Toggle Donate Main Menu Toggle Programs Palm Beaches Programs Program Locations Special Needs Programs Veterans Programs Community Outreach Programs Testimonials ACE College Scholarships Youth on Course School Programs Partnerships Partners & Sponsors Get Involved Ways To Give Golf Equipment Donations About Annual Report Directors & Staff Treasure Coast Programs Program Locations Special Needs Programs Veterans Programs Community Outreach Program Testimonials ACE College Scholarships Youth on Course School Program Partnerships Partners & Sponsors Get Involved Ways to Give Golf Equipment Donations About Annual Report Directors & Staff Broward Programs Program Locations Special Needs Programs Veterans Programs Community Outreach Programs Testimonials ACE College Scholarships Youth on Course School Programs Partnerships Partners & Donors Events & Get Involved Ways to Give Golf Equipment Donations About Annual Report Directors & Staff Events Dear Coach News Register My Child! Donate Clewiston Golf Club 1201 San Luiz Ave, Clewiston, FL 33440 Tuesday Class Ages 6 – 11 years old Date: COMING SOON!!! Time: 3:30 – 5:00 pm Cost: $10.00 per child Questions? Contact Coach Robbie Rush, PGA at (561) 358-5189 or [email protected] Join our Newsletter! Email (Required) Select a Chapter (Required) -- select Chapter -- Palm Beaches Broward Treasure Coast Open instagram in a new window Open twitter in a new window Open facebook in a new window Contact Us First Tee – Florida Gold Coast 7301 N Haverhill Road Riviera Beach, FL 33407 Tel. 561-842-0066 Serving St. Lucie, Martin, Palm Beach and Broward Counties First Tee Intranet Terms of Use Privacy Statement © 2025"
    },
    {
      "url": "https://seminoletribune.org/golf-pro-is-ace-in-hole/",
      "text": "Golf pro is ace in hole • The Seminole Tribune Skip to content Wednesday, September 10, 2025 Top Menu Home News Community Education Sports Health Arts & Entertainment Seminole Scenes Hard Rock/Seminole Gaming Seminole Tribe of Florida General Counsel Jim Shore, 80, Passes Away Reservations hear from college representatives Ahfachkee students to attend high school, college simultaneously this fall Business expo, health fair to be held Aug. 21 Cypress Billie completes Harvard program The Seminole Tribune Official Newspaper of the Seminole Tribe of Florida News Community Education Sports Health Arts & Entertainment Hard Rock/Seminole Gaming Seminole Scenes Announcements X Search for: You are here Home > Sports > Golf pro is ace in hole Golf pro is ace in hole Sports by Eileen Soler - September 24, 2013 April 13, 2015 BIG CYPRESS — Two decades as a big sugar executive plus 13 years as Clewiston’s municipal golf director is an ace in the hole for the Seminole Tribe with the recent hire of a new Big Cypress golf instructor, Adolfo Pena. “I’m part of the bigger plan to bring a casino and hotel here and to bring golf to the entire community, Tribal members and outsiders,” Pena said. The “bigger plan” includes completing construction of a permanent, professional driving range on West Boundary Road not far from Billie Swamp Safari and moving forward with ideas to someday expand the range into a regulation PGA golf course. A golf repair and pro shop is also on the wish list. Pena credited Big Cypress Councilman Mondo Tiger’s vision for Big Cypress as a destination location. The hotel and casino, destined for construction near Billy Swamp Safari, will hopefully attract affluent visitors to the reservation’s golf amenities. Meanwhile, Pena is standing in for Ahfachkee School golf coach Amos Mazzant who is out because of medical reasons, and he will soon begin teaching the game to elders. Pena said students learn how to play the game for competition while putting character-building lessons to work, such as patience, trust and teamwork. Elders benefit most from the low-impact physical movement that golf requires, such as walking hole to hole and swinging clubs. “All Tribal members will have a place to enjoy a recreational activity that is ageless,” he said. Of Cuban decent, Pena moved with his family to Clewiston at age 2. After graduating from Florida Atlantic University, he worked for U.S. Sugar Corp. first in accounting then in real estate and public relations. Eventually, his enthusiasm for golf turned his head from the high-powered corporate world to a job opening for a golf director at Clewiston Golf Course. “Because golf is my passion, I took the city (Clewiston) up on the job. That’s how I met so many Seminole Tribe members,” Pena said. Relationships formed on the golf course with some of Big Cypress’ notable residents who frequently use the municipal facility, including Councilman Tiger and Regional Housing manager Cicero Osceola. But the Tribe’s vision for golf is not just about Big Cypress, Pena said. Part of his job entails creating a golf program that will also bring recognition to Seminole attractions in Brighton and Hollywood. “And we hope to do it first class all the way,” Pena said. For now, focus is on building interest for golf inside Seminole communities.  Ahfachkee School golfers and elders from all reservations make a good start. Pena is already familiar with some people from hosting clinics and fundraising tournaments at the Clewiston venue. His professional and personal contacts at Florida Gulf Coast University (FGCU) enable him to schedule special training and motivational events with Tribal students and FGCU head golf coach Brent Jensen. “We’d love to feed our teen golfers into FGCU. First they should enjoy the game – the score doesn’t matter. But ultimately you want to be a good player, a competent player and someone who will go on the tour,” Pena said. “For the Seminole kids, we just have to look back in history to warriors doing the best they can with all they are given.” Students must maintain a 2.5 GPA to participate. There are no requirements for elders. Share on Facebook Share Share on Twitter Tweet Share on Pinterest Share Share on LinkedIn Share Share on Digg Share Eileen Soler Post navigation Previous article Two-time champion Kiauna Martin excels on the softball diamond Next article Cowhands put careers to competition Recent Posts Seminole Tribe of Florida General Counsel Jim Shore, 80, Passes Away Reservations hear from college representatives Ahfachkee students to attend high school, college simultaneously this fall Business expo, health fair to be held Aug. 21 Cypress Billie completes Harvard program Social Instagram 0 Followers Submit a Story Idea Do you know of an upcoming event, have a news tip, or just have an idea for a future story? Email Us September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 « Aug Latest Updates Could not authenticate you. Follow Us Online Ads About Us Contact Us Subscribe Advertise Deadlines History Archives Privacy Policy Terms and Conditions Follow Us © 2025 The Seminole Tribune Powered by WordPress | Theme: AccessPress Mag Top"
    }
  ]
}