{
  "fuentes": [
    {
      "url": "https://safeandvaultcompany.co.uk/contact-us/",
      "email": "enquiries@burtonsecurity.com"
    },
    {
      "url": "https://www.club-vault.com/story",
      "email": "admin@megavaultinc.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "apclerks@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "ar@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "backgrounds@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "provider@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "acctmgr@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "backgrounds@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "clinicaldocuments@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "dataprivacy@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "documents@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "mro@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "ohphysicalreview@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "rms@vaulthealth.com"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "email": "sales@vaulthealth.com"
    },
    {
      "url": "https://www.club-vault.com/private-events",
      "email": "admin@megavaultinc.com"
    },
    {
      "url": "https://dcvault.com/",
      "email": "dcvault@dcvault.org"
    },
    {
      "url": "https://dcvault.com/",
      "email": "events@dcvault.org"
    },
    {
      "url": "https://www.vault-light.com/pages/contactus",
      "email": "vault_light_wht_150x@2x.png"
    },
    {
      "url": "https://www.vault-light.com/pages/contactus",
      "email": "info@vault-light.com"
    },
    {
      "url": "https://www.club-vault.com/visit",
      "email": "admin@megavaultinc.com"
    },
    {
      "url": "https://www.thevaultcollective.com/pages/contact-us",
      "email": "copy_of_the_vault_collective_70f553d6-159c-4ffc-9874-b3cc1bd37b77_250x@2x.png"
    },
    {
      "url": "https://www.thevaultcollective.com/pages/contact-us",
      "email": "rhodeisland@thevaultcollective.com"
    },
    {
      "url": "https://www.thevaultcollective.com/pages/contact-us",
      "email": "vermont@thevaultcollective.com"
    },
    {
      "url": "https://www.thevaultcollective.com/pages/contact-us",
      "email": "info@thevaultcollective.com"
    },
    {
      "url": "https://www.club-vault.com/gallery",
      "email": "admin@megavaultinc.com"
    },
    {
      "url": "https://vaulthealthclub.ie/about-us/",
      "email": "admin@vaulthealthclub.ie"
    },
    {
      "url": "https://www.club-vault.com/",
      "email": "admin@megavaultinc.com"
    },
    {
      "url": "https://www.vaultinsurance.com/contact",
      "email": "claimsfnol@vault.insurance"
    }
  ],
  "mails": [
    "acctmgr@vaulthealth.com",
    "admin@megavaultinc.com",
    "admin@vaulthealthclub.ie",
    "apclerks@vaulthealth.com",
    "ar@vaulthealth.com",
    "backgrounds@vaulthealth.com",
    "claimsfnol@vault.insurance",
    "clinicaldocuments@vaulthealth.com",
    "copy_of_the_vault_collective_70f553d6-159c-4ffc-9874-b3cc1bd37b77_250x@2x.png",
    "dataprivacy@vaulthealth.com",
    "dcvault@dcvault.org",
    "documents@vaulthealth.com",
    "enquiries@burtonsecurity.com",
    "events@dcvault.org",
    "info@thevaultcollective.com",
    "info@vault-light.com",
    "mro@vaulthealth.com",
    "ohphysicalreview@vaulthealth.com",
    "provider@vaulthealth.com",
    "rhodeisland@thevaultcollective.com",
    "rms@vaulthealth.com",
    "sales@vaulthealth.com",
    "vault_light_wht_150x@2x.png",
    "vermont@thevaultcollective.com"
  ],
  "nombre_sitio": "club-vault.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://safeandvaultcompany.co.uk/contact-us/",
      "text": "Contact Us | Safe + Vault | Get In touch with the Safe and Vault Company Skip to content Toggle menu Search for: 01484 663388 Contact us Safes Counter Safes Custom + Bespoke Safes Data Safes Deposit Safes Fire Safes High Security Safes Home + Office Safes Hotel Safes Key Safes Laptop Safes Luxury Safes Medical Safes Reconditioned Safes Underfloor Safes Wall Safes Waterproof Safes Whisky Safes Secure Boxes Cabinet + Cupboard Safes Cash Boxes Gun Safes + Cabinets Post Boxes Vehicle Safes Security Access Control ATM Security Counter Terror and High Security Door Defenders High Security Steel Doors Vaults Panic Rooms and Safe Rooms Portable Strongrooms Safes Vaults Safe Deposit Boxes Strongroom and Vault Doors Strongrooms and Vaults Locks Abloy Cliq Safe Locks Servicing Safes See all Safes Counter Safes Custom + Bespoke Safes Data Safes Deposit Safes Fire Safes High Security Safes Home + Office Safes Hotel Safes Key Safes Laptop Safes Luxury Safes Medical Safes Reconditioned Safes Underfloor Safes Wall Safes Waterproof Safes Whisky Safes Secure Boxes See all Secure Boxes Cabinet + Cupboard Safes Cash Boxes Gun Safes + Cabinets Post Boxes Vehicle Safes Security See all Security Access Control ATM Security Counter Terror and High Security Door Defenders High Security Steel Doors Vaults See all Vaults Panic Rooms and Safe Rooms Portable Strongrooms Safes Vaults Safe Deposit Boxes Strongrooms and Vaults Strongroom and Vault Doors Locks Locks Abloy Cliq Safe Locks Servicing Contact Us Get in touch with the Safe and Vault Company Contact our friendly sales team for the very best security advice and service. To contact us, please complete the form below or contact us by phone for the very best safe, vault and security advice. Name * Email * Phone Company Address Street Address Address Line 2 City County / State / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which product or service are you interested in? Message * CAPTCHA Facebook This field is for validation purposes and should be left unchanged. Burton Security Limited Brockholes Business Park Rock Mill Road Huddersfield HD9 7BN United Kingdom T. 01484 663388 Accreditations + awards 01484 663388 Send an email Products Safes Secure Boxes Security Vaults Locks ATM Security Safe & Vault About Us FAQs Safe Servicing News Contact Us Terms & Conditions Contact us Burton Security Limited Brockholes Business Park Rock Mill Road Holmfirth HD9 7BN Find us The Burton Security Group Privacy Policy © Safe and Vault Company Limited 2025. Branding and website by Dave Holloway × product(s) added to cart → ×"
    },
    {
      "url": "https://www.club-vault.com/story",
      "text": "Story — Club Vault 0 Skip to Content Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Story Serving south florida since 2010. Private event rental venue. The perfect space for your next - Wedding - Engagement party - Bar-mitzva / Bat-mitzva - Quinceañera - Birthday party - Corporate event - Holiday party - Day party LEAD STAFF Cobie Swissa Owner Ronen Zaguri General Manager Alex Passos Event Coordinator Will Palamaras Event Coordinator RECENT PRESS Kipp Harbor Times Feature Vanguard Review Nameless Paper Review BOOK WITH US Contact 2801 Greene Street, Bay 4 Hollywood, FL. 33020 admin@megavaultinc.com (954) 546-1942 Club Vault Made with Squarespace ﻿ Hours Mon–Fri 12pm-12am Sat 12pm-2am Sun 12pm–2am Make a Reservation"
    },
    {
      "url": "https://www.vaulthealth.com/contact",
      "text": "Contact Vault Learn More About First Advantage Services Read Press Release Skip to main content FOR CANDIDATES FOR CLIENTS Show submenu for Services Services Background Checks Drug Screening Health Screening Recovery Monitoring Show submenu for Industries Industries Aviation Transportation Construction Healthcare Education Energy & Utilities Staffing Government Financial & Business Services Manufacturing Retail Nonprofit Show submenu for Technology Technology Client & Candidate Experience Platforms Integrations Show submenu for Resources Resources Blog Webinars Trainings White Papers & Fact Sheets About Open main navigation Close main navigation Show submenu for Services Services Services Background Checks Drug Screening Health Screening Recovery Monitoring Show submenu for Industries Industries Industries Aviation Transportation Construction Healthcare Education Energy & Utilities Staffing Government Financial & Business Services Manufacturing Retail Nonprofit Show submenu for Technology Technology Technology Client & Candidate Experience Platforms Integrations Show submenu for Resources Resources Resources Blog Webinars Trainings White Papers & Fact Sheets About Try Vault FOR CANDIDATES FOR CLIENTS Try Vault Contact Us Our experts are here to help. Get in touch to learn about our comprehensive workforce screening services. Complete the form below or call 215-396-5500, Option 6 to reach a Vault Sales Executive. For Clients and Vendors Recovery Monitoring Clients and Participants Recovery Monitoring Participant Inquiries rms@vaulthealth.com 215-396-5500 \"Option 1\" Recovery Monitoring Client Inquiries rms@vaulthealth.com 215-396-5500 \"Option 1\" Workforce Screening Clients Workforce Drug and Alcohol, Occupational Health, and Clinical Testing Services acctmgr@vaulthealth.com 215-396-5500 “Option 4” Commercial Driver Medical Examinations and Return to Work Case Management ohphysicalreview@vaulthealth.com 215-396-5500 “Option 3” Sales Inquiries sales@vaulthealth.com 215-396-5500 “Option 6” Background Screen Inquiries Backgrounds@vaulthealth.com 215-396-5500 “Option 2” Finance and Procurement Departments For inquiries regarding billing or invoices, please contact: Accounts Receivable Department AR@vaulthealth.com Accounts Payable Department APclerks@vaulthealth.com Procurement Department Provider@vaulthealth.com Submitting Documents to Vault To submit documents related to services performed for a donor: Commercial Driver Medical Exams Fax: 215-396-5424 clinicaldocuments@vaulthealth.com Commercial Driver Medical Exam (Corrections Only) Fax: 215-396-5418 clinicaldocuments@vaulthealth.com Clinical Results and Corrections Fax: 215-396-5616 clinicaldocuments@vaulthealth.com Chain of Custody and Breath Alcohol Forms Fax: 215-396-5610 documents@vaulthealth.com For Candidates Obtain or Dispute Your Information Disputing Items from a Report To obtain a copy of your drug test result or request a split to be tested please email mro@vaulthealth.com . To obtain a copy of your background report, file a dispute, or file a dispute due to human trafficking please email backgrounds@vaulthealth.com . For any question regarding our data privacy practices or to exercise any applicable data privacy right please email dataprivacy@vaulthealth.com . If you are unable to contact us by email for any of these requests, please call us at 800.732.3784 . Get More Than a Demo See how Vault can help you address your workforce screening needs. We’ll evaluate your current processes and create a pilot program geared toward reducing risk, providing better support, and saving time and money. Try Us Privacy  Notice Terms & Conditions Accessibility Vault Workforce Screening SM All rights reserved. Services Background Checks Drug Screening Health Screening Industries Aviation Transportation Construction Healthcare Education Energy & Utilities Staffing Government Financial & Business Services Manufacturing Retail Nonprofit Technologies Integrations Our Technology About Contact Blog Resources"
    },
    {
      "url": "https://www.club-vault.com/private-events",
      "text": "Contact 2 — Club Vault 0 Skip to Content Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Private Events For private event bookings please contact our events coordinator listed below. Cobie Swissa (954) 661-0081 admin@megavaultinc.com 2801 Greene Street Hollywood, FL 33020 Contact 2801 Greene Street, Bay 4 Hollywood, FL. 33020 admin@megavaultinc.com (954) 546-1942 Club Vault Made with Squarespace ﻿ Hours Mon–Fri 12pm-12am Sat 12pm-2am Sun 12pm–2am Make a Reservation"
    },
    {
      "url": "https://dcvault.com/",
      "text": "DC Vault Toggle navigation Login Facilities Registration Training Non-Profit Staff Schedule Events Social WELCOME TO DC VAULT Over 0 Championship Medalists! Learn More DC VAULT DC Vault is the Premiere Pole Vault club in the Washington, DC Metro Region. Serving the District of Columbia, Virginia, Maryland, Delaware and Pennsylvania, DC Vault provides year-round training for beginner through elite-level athletes. Come Visit our Training Facilities The most complete training program in the region! DCV PREP PG KIDS Through a variety of partnerships, DC Vault provides training at 4 facilities in the Washington, DC metropolitan area. Each facility has been uniquely outfitted with a wide array of specialized equipment provided by the club, allowing for training targeted to athletes of all skill levels. Check out the DC Vault Home Training Facility! Previous Next Meet DC VAULT EDWARD LUTHY President Head Coach Edward Luthy - President / Head Coach Coach Luthy's experience spans over 30 years as a pole vault coach. During that time he has instructed countless athletes at all levels of competition. Having developed his own training system with roots based in Russian pole vault programs, he believes that strict adherence to step by step technical progression provides each athlete with the greatest opportunity to obtain their maximum potential and perform consistently throughout their competitive career. Primarily a self trained pole vaulter, he cleared a competitive PR of 17'1\" (5.20m) before succumbing early on to an Achilles tendon injury. He competed on a full scholarship for Western Michigan University from 1999-2001, the All Army Track Team from 1993-1995 and earned varsity letters at 3 different high schools. A few athletes who have trained extensively with or are still training under Coach Luthy, and the accomplishments they have achieved during their careers include: Bill Deerring - 1996 Olympic Trials Finalist / 1989 MI State Champion Geoff Fairbanks - 2002 NCAA National Championships Finalist / 1998 MI State Champion Janice Keppler - 2012 Olympic Trials Finalist / 2007 NCAA Division I National Championships Finalist / Eastern Michigan University Record Holder Howard Booth - 2013 World Masters Champion / Masters State Record Holder in MI, OH, IL, IN Olivia Gruver - USA NCAA Division I National Record Holder / 2x NCAA Division I National Champion / 2015 MD State Champion-Record Holder Abbey Alcon - Dominican Republic National Record Holder / 2016 NACAC U21 Bronze Medalist Calvin Pitney - NCAA Division III National Champion / 2015 USATF Youth National Champion-Record Holder / 4x MD State Champion Molly Minnig - 2x Ivy League Champion / University of Pennsylvania Record Holder Robert Mercer - 2x MEAC Conference Champion / Howard University Record Holder Coaching Certifications National Pole Vault Coaches Association - Pole Vault Coaching Certification National Pole Vault Safety Certification Board - Pole Vault Safety Certification National Federation of High School Associations - Pole Vault Coaching Certification Coaching Positions Pole Vault Coach: DC Vault 2008-present Pole Vault Coach: University of Maryland 2008-2010 and 2016-present Pole Vault Coach: National Pole Vault Association 2018-present Pole Vault Adviser: Howard University 2013-2015 Pole Vault Adviser: Catholic University of America 2010-2016 Pole Vault Coach: Ann Arbor Pole Vault Club 2005-2008 Pole Vault Coach: Eastern Michigan University 2003-2008 Pole Vault Coach: Western Michigan University 2002-2003 Pole Vault Coach: Loy Norrix High School 1996-1998 Pole Vault Coach: Mitchel's Pole Vault Clinic 1996-2000 Assistant Pole Vault Coach: Sky Jumpers Pole Vault Clinics 1990-1992 Pole Vault Coach: Paw Paw High School 1990-1991 Pole Vault Coach: Lawrence High School Pole Vault Clinic 1988 Assistant Pole Vault Coach: Mitchel's Pole Vault Clinic 1988-1991 CHAD ACKERMAN Assistant Coach Chad Ackerman - Assistant Coach Coach Ackerman has over 12 years of pole vaulting experience. Growing up in Pennsylvania, he competed in the pole vault for his high school track team, claiming multiple invitational championship titles and claiming his district championship title. \n                    Later, while attending Penn State University, he was responsible for building the Penn State Pole Vault Club team from 1 participant to a total of 10 members, whom he instructed. \n                    Simultaneously Coach Ackerman worked with high school pole vaulters at McDowell. In 2018 Coach Ackerman relocated to the DC area and joined DC Vault in order to continue his own training. Soon after arriving, coach Ackerman proved himself to be an invaluable member of the organization and today assists with instruction of beginners through emerging elite athletes, as well as a wide range of administrative tasks. Certifications National Pole Vault Coaches Association - Pole Vault Coaching Certification National Pole Vault Safety Certification Board - Pole Vault Safety Certification National Federation of High School Associations - Pole Vault Coaching Certification LAUREN ROSE Administrative Assistant Lauren Rose - Administrative Assistant As the original DC Vault member, Lauren Rose has been an integral part of the organization since 2008, supporting DC Vault as a fiercely loyal athlete, an assistant coach and team administrative assistant.\n                    From behind the scenes, Lauren keeps DC Vault running by organizing events, keeping track of our coaching certifications and much more. CHRIS SPIESS Assistant Coach Video Production Chris Spiess - Assistant Coach / Video Production Coach Spiess began his vaulting career with DC Vault in 2014 as a sophomore in high school. After several County and Regional Championship titles, as well as one State Championships title, he emerged as a promising collegiate vaulter for the University of Maryland and a Volunteer Coach with DC Vault. \n                    Due to Coach Spiess's extensive knowledge of the inner workings of DC Vault - having worked his way through the organizations beginner, intermediate and emerging elite programs - he has the ability to single handedly instruct and lead athletes at a variety of levels. Certifications National Pole Vault Coaches Association - Pole Vault Coaching Certification National Pole Vault Safety Certification Board - Pole Vault Safety Certification National Federation of High School Associations - Pole Vault Coaching Certification TIMOTHY SANTOSA Assistant Coach Web Developer Strength Coach Timothy Santosa - Assistant Coach / Web Developer / Strength Coach Coach Tim joined the DC Vault Level I program as a high school sophomore in 2012. Progressing quickly, he was offered a Level III training slot with the DC Vault Emerging Elite group in 2014. Despite injury, he successfully claimed 3 Regional Championship titles, 1 County Championship title and took Gold at the Maryland 4A State Championships with a height of 13'6\" in 2015. Going on to attend the University of Maryland as a Computer Science major, Coach Tim continued his training in the DC Vault Emerging Elite program and began instructing Level I and II athletes in 2016. Since then, he has taken on increasingly complex coaching duties and become a core member of the DC Vault team. Additionally, Coach Tim leads the Beginner/Intermediate Strength Training program and is the current webmaster for DCVault.com Certifications National Pole Vault Coaches Association - Pole Vault Coaching Certification National Pole Vault Safety Certification Board - Pole Vault Safety Certification National Federation of High School Associations - Pole Vault Coaching Certification Training Schedule DC VAULT EVENTS Visit our events page to learn about all of our upcoming and past events. May 9th, 2025 - 2200 East Capitol Street NE - Washington, DC CAPITOL HILL FLY-KIDS OPEN HOUSE June 27th-28th, 2025 - 2200 East Capitol Street NE - Washington, DC 2025 POLE VAULT CHAMPIONSHIPS July 21st-July 25th / July 28th-August 1st / August 4th-August 8th, 2025 - 2200 East Capitol Street NE - Washington, DC 2025 FLY KIDS SUMMER CAMPS! Recurring - 2200 East Capitol Street NE - Washington, DC Free Pole Vault Clinics! Contact us at events@dcvault.org to register for upcoming events ADDRESS 2200 East Capitol Street NE Washington, DC Contact Us Find us on..."
    },
    {
      "url": "https://www.vault-light.com/pages/contactus",
      "text": "Contact Us Vault Light Customer Support Your cart Close cart Your cart is currently empty. Subtotal $0.00 $0.00 Taxes and shipping calculated at checkout Checkout One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. FIRST-TIME ORDERS WITH EMAIL SIGNUP GET 10% OFF (Discount doesn't apply to clearance.) | FAST & FREE SHIPPING over $50 Search Account Log in Or create an account We're here to help 844-521-5055 info@vault-light.com Cart COLLECTION SHOP LIGHTING BEST SELLERS WHAT'S NEW TRADE FAVORITES CEILING WALL TABLE LAMPS ALABASTER ADA DESIGNS SHOP BY FINISH BRASS BRONZE BLACK GOLD STAINLESS STEEL VIEW MORE... SHOP BY TREND ALABASTER MODERN LIGHTING NATURE-INSPIRED SPUTNIK GLASS GLOBE GEOMETRIC LIGHTING ART DECO LIGHTING FUTURISTIC LIGHTING CHROME LIGHTING TRANSITIONAL ARCHITECTURAL MID CENTURY LIGHTING VIEW MORE... SHOP BY ROOM DINING ROOM LIGHT KITCHEN LIGHT LIVING ROOM BEDROOM BATHROOM VIEW MORE... CLEARANCE TRADE CUSTOMER SERVICE ABOUT US CONTACT US FAQ'S CATALOG COLLECTION SHOP LIGHTING BEST SELLERS WHAT'S NEW TRADE FAVORITES CEILING WALL TABLE LAMPS ALABASTER ADA DESIGNS SHOP BY FINISH BRASS BRONZE BLACK GOLD STAINLESS STEEL VIEW MORE... SHOP BY TREND ALABASTER MODERN LIGHTING NATURE-INSPIRED SPUTNIK GLASS GLOBE GEOMETRIC LIGHTING ART DECO LIGHTING FUTURISTIC LIGHTING CHROME LIGHTING TRANSITIONAL ARCHITECTURAL MID CENTURY LIGHTING VIEW MORE... SHOP BY ROOM DINING ROOM LIGHT KITCHEN LIGHT LIVING ROOM BEDROOM BATHROOM VIEW MORE... CLEARANCE TRADE CUSTOMER SERVICE ABOUT US CONTACT US FAQ'S CATALOG COLLECTION SHOP LIGHTING BEST SELLERS WHAT'S NEW TRADE FAVORITES CEILING WALL TABLE LAMPS ALABASTER ADA DESIGNS SHOP BY FINISH BRASS BRONZE BLACK GOLD STAINLESS STEEL VIEW MORE... SHOP BY TREND ALABASTER MODERN LIGHTING NATURE-INSPIRED SPUTNIK GLASS GLOBE GEOMETRIC LIGHTING ART DECO LIGHTING FUTURISTIC LIGHTING CHROME LIGHTING TRANSITIONAL ARCHITECTURAL MID CENTURY LIGHTING VIEW MORE... SHOP BY ROOM DINING ROOM LIGHT KITCHEN LIGHT LIVING ROOM BEDROOM BATHROOM VIEW MORE... CLEARANCE TRADE CUSTOMER SERVICE ABOUT US CONTACT US FAQ'S CATALOG icon-account icon-account icon-arrow-right icon-arrow-down icon-arrow-next icon-arrow-prev icon-slideshow-next icon-slideshow-previous icon-comment icon-heart icon-cart icon-bag icon-close icon-glasses icon-menu icon-minus icon-play icon-plus social-seach social-facebook social-fancy social-instagram social-pinterest social-rss social-twitter CONTACT US Corporate Office 5600 West Jefferson Blvd Los Angeles, CA 90016 (Visits by Appointment-Only. We are NOT a showroom or a retail store.) QUESTIONS/comments Questions about your order, have a product question or need a quote, please email and contact one of our knowledgeable representatives for assistance! As we continually to strive and work hard towards delivering a better shopping experience for our customers, we look forward to your comments and feedback as well. Monday thru Friday 9:00 AM - 5:00 PM (Pacific Time) Saturday and Sunday (Closed) Labor Day 9/1 Monday (Closed) CUSTOMER SERVICE CONTACT US SHIPPING & RETURNS FAQS TRADE CATALOG The Company PRIVACY POLICY TERMS & CONDITIONS NEWS VAULT BLOG SOCIALS © 2025 Vault Light Search"
    },
    {
      "url": "https://www.club-vault.com/visit",
      "text": "Visit — Club Vault 0 Skip to Content Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit schedule a showing Please provide contact information and desired time for showing. Contact 954-661-0081 admin@megavaultinc.com Location 2801 Greene Street, Bay 4 Hollywood, FL. 33020 Showing Hours Mon–Thu 10am–7pm Fri 10pm–5pm Contact 2801 Greene Street, Bay 4 Hollywood, FL. 33020 admin@megavaultinc.com (954) 546-1942 Club Vault Made with Squarespace ﻿ Hours Mon–Fri 12pm-12am Sat 12pm-2am Sun 12pm–2am Make a Reservation"
    },
    {
      "url": "https://www.thevaultcollective.com/pages/contact-us",
      "text": "Contact Us\n– THE VAULT COLLECTIVE Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search New His Clothing Tops Bottoms & Overalls Coats & Jackets Designer XL & Up More Antique (Pre-1950s) Designer Gift Cards Vintage Home Hers Clothing Dresses Jumpsuits Tops Bottoms Jeans Outerwear Tee Shirts Lingerie & Sleepwear Shoes Sweaters Designer XL & Up More Antique (Pre-1950) Designer Gift Cards Vintage Home Theirs/All Clothing Accessories All Tops All Bottoms All Dresses/Suits/Sets All Tee Shirts All Jeans All Lingerie & Sleepwear Shoes Sweaters Designer XL & Up More Antique (Pre-1950) Designer Gift Cards Vintage Home Local Collections Shop Rhode Island Gypsum Vintage Gold Dust Vintage Pinkham Road Retro Pillbox Holiday Sir Milky Quartz Siren & Saint Vintage Gonzo's Trading Post Junque Shop Temperature’s Rising Avu Vintage Shop Vermont Gypsum Vintage Project Object Vintage The Getup Vintage Gold Seam Vintage Katnip Vintage Fieldery MV Vintage The Rolling Thunder adbad goods Landa Vintage Fringe Vintage About Us Sell With Us Contact Vermont Rhode Island Employment Community Updates Search Log in Cart 0 items New His His Menu His Clothing Clothing Menu Clothing Tops Bottoms & Overalls Coats & Jackets Designer XL & Up More More Menu More Antique (Pre-1950s) Designer Gift Cards Vintage Home Hers Hers Menu Hers Clothing Clothing Menu Clothing Dresses Jumpsuits Tops Bottoms Jeans Outerwear Tee Shirts Lingerie & Sleepwear Shoes Sweaters Designer XL & Up More More Menu More Antique (Pre-1950) Designer Gift Cards Vintage Home Theirs/All Theirs/All Menu Theirs/All Clothing Clothing Menu Clothing Accessories All Tops All Bottoms All Dresses/Suits/Sets All Tee Shirts All Jeans All Lingerie & Sleepwear Shoes Sweaters Designer XL & Up More More Menu More Antique (Pre-1950) Designer Gift Cards Vintage Home Local Collections Local Collections Menu Local Collections Shop Rhode Island Shop Rhode Island Menu Shop Rhode Island Gypsum Vintage Gold Dust Vintage Pinkham Road Retro Pillbox Holiday Sir Milky Quartz Siren & Saint Vintage Gonzo's Trading Post Junque Shop Temperature’s Rising Avu Vintage Shop Vermont Shop Vermont Menu Shop Vermont Gypsum Vintage Project Object Vintage The Getup Vintage Gold Seam Vintage Katnip Vintage Fieldery MV Vintage The Rolling Thunder adbad goods Landa Vintage Fringe Vintage About Us About Us Menu About Us Sell With Us Contact Contact Menu Contact Vermont Rhode Island Employment Community Updates Contact Us General Questions? Email our Office or find us on Insta: @the.vault.collective Reach Our Stores: Rhode Island Open 11-7 Daily 235 Westminster Street, Providence, RI 02903 401-250-2587 Email our Rhode Island Shop Insta: @thevaultri Vermont Open 11-7 Daily 145 Cherry Street, Burlington VT 05401 802-448-0651 Email our Vermont Shop Insta: @thevaultvt Quick links Search Shop Gift Cards Contact Us Newsletter Subscribe Country/region United States (USD $) Canada (USD $) United States (USD $) © 2025, THE VAULT COLLECTIVE Powered by Shopify Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025, THE VAULT COLLECTIVE Powered by Shopify Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://www.club-vault.com/gallery",
      "text": "Gallery — Club Vault 0 Skip to Content Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Contact 2801 Greene Street, Bay 4 Hollywood, FL. 33020 admin@megavaultinc.com (954) 546-1942 Club Vault Made with Squarespace ﻿ Hours Mon–Fri 12pm-12am Sat 12pm-2am Sun 12pm–2am Make a Reservation"
    },
    {
      "url": "https://vaulthealthclub.ie/about-us/",
      "text": "About Us - The Vault Skip to content About Us Personal Training Classes Classes Timetable Memberships Ten10 Cafe Events About Us Personal Training Classes Classes Timetable Memberships Ten10 Cafe Events JOIN NOW about us Welcome to the  vault health CLUB where fitness meets fun Your journey to your best self starts with a one-to-one session with our coaches, to kickstart your journey and keep a steady progress. From absolute beginners to professional competitors, we have you covered with tailored training and bespoke nutrition plans. With 2 free weight areas and large range of diverse equipment, The Vault gives you a 360 degree workout. If motivation is your thing our classes give you the supportive community to keep going, from yoga to high-energy ride and Circuit, catering to all levels. But wait, there’s more! It’s not just about fitness here; we organise exclusive, fun events that take us on outward-bound adventures for mind and body. Mountain hike, anyone? Like you, our friendly staff are passionate about a wide range of fitness interests, so there’s always someone ready to guide you every step of the way. Our goal is to help you unlock your potential and reach your fitness goals with a smile on your face. workout zones Personal Training Studio Women's only studio Education Studio CORE strength ZONE 2 Full free weight areas FUNCTIONAL TRAINING ZONE TRX workout area UPCOMING EVENTS VIEW MEMBERSHIPS WOMENS ZONE WOMENS ZONE We get it, gyms can be intimidating so if you want to be your best self but feel a little self conscious we offer a women’s zone and private studios. You get the results you want as you tone up and get fit in a supportive environment with the same equipment you’d find on the main gym floor. - FREE WEIGHTS - CARDIO MACHINES - CROSS TRAINER - STEPPER - SQUAT RACK - BIKE - AMT - TREADMILL - HIP THRUST MACHINE We like to think of it as a sanctuary of support and wellness. Feel Welcome, Feel Good, Feel Fitter! MEET OUR FITNESS FAMILY Like you our dynamic dream team is passionate about fitness and a balanced lifestyle. More than just trainers, we’re your personal cheerleaders, coaches and motivators, dedicated to creating the best version of you. With a unique and diverse range of skills that blend multi sporting expertise, energy, and enthusiasm, we’re here to make each fitness journey tailored to your needs. From smashing personal records to conquering new challenges together, we know that a varied approach to training brings the best results. Join us and let’s write your fitness story, where each chapter is filled with strength, determination and a whole lot of fun. Let’s unleash your potential and conquer those goals LUKE LEARN MORE OLIVIA LEARN MORE PETE LEARN MORE JAY LEARN MORE PETE LEARN MORE TOMMY LEARN MORE SEAN LEARN MORE CAITLIN LEARN MORE Emelie LEARN MORE SEAN LEARN MORE CAITLIN LEARN MORE Patrycja LEARN MORE Patrycja LEARN MORE SEAN TRAINER CAITLIN TRAINER KEEP UP TO DATE WITH THE LATEST DOWNLOAD THE APP You can easily reserve classes by downloading our app for convenient access to our booking system. As a member, you can secure your spot in classes up to 10 days in advance! Additionally, through the platform, you have the flexibility to manage your bookings, follow tailored workout plans, and engage in ongoing gym challenges. App Store Google Play MEMBERSHIPS CLASSES TIMETABLE CONTACT US Instagram Facebook Envelope Phone-alt Map-marker-alt Belgard Square West, Tallaght, Dublin 24, D24A2PX The Vault © 2025 │ PRIVACY POLICY │ BUILT BY ASHBOURNE MANAGEMENT OPENING HOURS MON - THUR - 5:30am - 10pm FRI - 5:30am - 9pm SAT - 8am - 7pm SUN - 9am - 5pm BANK HOLIDAYS - 9am - 5pm The Vault © 2025 │ PRIVACY POLICY │ BUILT BY ASHBOURNE MANAGEMENT MEET LUKE fitness philosophy Balance out your workouts, rest and listen to your body. FITNESS BACKGROUND The gym kept me focused, grounded & out of trouble growing up. It’s inspired me to help others to do the do same. I’ve worked in a boxing club & have a background in boxing & mixed martial arts. FAVOURITE FITNESS QUOTE What doesn’t challenge you, doesn’t change you. MEET OLIVIA fitness philosophy It’s never too late to start, no matter your fitness level, don’t compare yourself to others, find what works for you & enjoy it. FITNESS BACKGROUND I found a passion for health & fitness, & wanted to inspire/help others achieve their goals. My own fitness journey began years ago in Fit4Less Tallaght & I haven’t looked back. FAVOURITE FITNESS QUOTE Mindset is everything, consistency is key. MEET PETE fitness philosophy Ruthless execution of the basics will always prevail. FITNESS BACKGROUND Played lots of sports as a child like football, basketball, badminton, tennis, boxing & started in the gym at 14. I began coaching friends at20, then got qualified. I’ve been coaching professionally for over a decade now and love it! my top training tip Leave nothing to chance. Cut through all the confusion & accelerate your results by hiring a coach! favourite fitness quote The best time to plant a tree was 20 years ago, the next best time is today! MEET JAY fitness philosophy I am always here to help you achieve your goals. FITNESS BACKGROUND Always loved football, then got into the gym at 16 & haven’t looked back since. MY TOP TRAINING TIP Have goal in mind, make a plan, & work towards it. FAVOURITE FITNESS QUOTE Lightweight baby. MEET Tommy fitness philosophy Physical & mental fitness go hand in hand, so why neglect either? FITNESS BACKGROUND I’m in the industry over 7 years & have a wide range of interests & experience from Boxing to bodybuilding. I’ve used fitness as an outlet for my mental health and highly encourage others to do the same (if they aren’t already). MY TOP TRAINING TIP DO NOT compare your journey with others,  maximize your strengths & inspire others.”someone else’s”, it’s not healthy, take your time & monitor your own progress in. FAVOURITE FITNESS QUOTE Know yourself, accept your limitations, maximize your strengths & inspire others. MEET SEAN fitness philosophy It’s you VS. you. The only person you should be comparing yourself to & trying to beat, is you. 1% improvements add up. FITNESS BACKGROUND Played basketball for years, love swimming & hiking. I have a degree in science & I’m passionate about all things nutrition & fitness MY TOP TRAINING TIP Train with intention & TRACK your lifts. FAVOURITE FITNESS QUOTE The secret of change is to focus all of your energy, not on fighting the old but on building the new. MEET CAITLIN fitness philosophy Ruthless execution of the basics will always prevail. FITNESS BACKGROUND Played lots of sports as a child like football, basketball, badminton, tennis, boxing & started in the gym at 14. I began coaching friends at20, then got qualified. I’ve been coaching professionally for over a decade now and love it! my top training tip Leave nothing to chance. Cut through all the confusion & accelerate your results by hiring a coach! favourite fitness quote The best time to plant a tree was 20 years ago, the next best time is today! MEET EMELIE fitness philosOphy It’s never too late to start lifting weights!! FITNESS BACKGROUND My fitness journey began in 1994 as a PE Teacher, I’ve been bodybuilding internationally since 2004, & l’ve won numerous titles. I’m currently an international elite pro judge for the IFBB (International Fitness Bodybuilding Federation) judging around the world at competitions like the Arnold Classics, Europeans & World Championships. MY TOP TRAINING TIP Always warm up before lifting, & activate & connect with the muscles. FAVOURITE FITNESS QUOTE Bodybuilding It’s a sport without age. It’s never to late to begin training. MEET PATRYCJA fitness philosOphy It’s never too late to start lifting weights!! FITNESS BACKGROUND My fitness journey began in 1994 as a PE Teacher, I’ve been bodybuilding internationally since 2004, & l’ve won numerous titles. I’m currently an international elite pro judge for the IFBB (International Fitness Bodybuilding Federation) judging around the world at competitions like the Arnold Classics, Europeans & World Championships. MY TOP TRAINING TIP Always warm up before lifting, & activate & connect with the muscles. FAVOURITE FITNESS QUOTE Bodybuilding It’s a sport without age. It’s never to late to begin training."
    },
    {
      "url": "https://www.club-vault.com/",
      "text": "Club Vault 0 Skip to Content Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Open Menu Close Menu Gallery Home Story Visit Private Events vip table Reservation Gallery 2801 Greene Street, Bay 4 — Hollywood, Fl — (954) 546-1942 Contact 2801 Greene Street, Bay 4 Hollywood, FL. 33020 admin@megavaultinc.com (954) 546-1942 Club Vault Made with Squarespace ﻿ Hours Mon–Fri 12pm-12am Sat 12pm-2am Sun 12pm–2am Make a Reservation"
    },
    {
      "url": "https://www.vaultinsurance.com/contact",
      "text": "Contact | Vault Insurance Skip to content Close About Us Vault Difference Our Story Careers Partner With Us Agent Experience Become A Vault Agent Products Coverage Overview Homeowners Auto Collections Excess Liability Vault Custom Yacht Aviation Commercial Knowledge Hub Articles Resources In The News Connect Contact Us Request a Quote Submit a Claim Pay a Bill Agent Login SEARCH About Us Vault Difference Our Story Careers Partner With Us Agent Experience Become A Vault Agent Products Coverage Overview Homeowners Auto Collections Excess Liability Vault Custom Yacht Aviation Commercial Knowledge Hub Articles Resources In The News Connect Contact Us Request a Quote Submit a Claim Pay a Bill Agent Login CONTACT US Thanks for your interest in Vault Insurance. Protecting your legacy is our top priority, and we are here to help answer any questions you may have. Please use the form, and we’ll be in touch shortly. You can also reach us anytime by calling 1-844-36-VAULT (82858) . Please be advised that claims should NOT be submitted via the contact form. To report a claim, please call us at: 1-844-388-LOSS (5677) Or reach out via email: claimsfnol@vault.insurance Florida 300 First Avenue South, Suite 401 St. Petersburg, Florida 33701 Florida 515 N Flagler Dr. Suite 1200 West Palm Beach, FL 33401 NEW YORK 24 West 40th St. Suite 300 New York, NY 10018 844 36 VAULT (82858) 1-844 388 LOSS (5677) - Claims OUR COVERAGE Homeowners Auto Collections Excess Liability Custom Yacht Aviation Commercial USEFUL LINKS Contact Request a Quote Submit a Claim Pay a Bill Agent Login LOCATIONS 300 First Ave South, Suite 401 St. Petersburg, Florida 33701 24 West 40th St, Suite 300 New York, NY 10018 515 N Flagler Dr, Suite 1200 West Palm Beach, FL 33401 300 S Wacker Dr, Suite 1050 Chicago, IL 60606 Vault is the marketing name used by Vault Reciprocal Exchange, a Florida-domiciled reciprocal insurance exchange managed by Vault Risk Management Services, LLC as its attorney-in-fact, Vault E&S Insurance Company, an Arkansas-domiciled surplus lines insurer, and their affiliates. Certain products and services may be provided by affiliates. Copyright © 2025 Vault. All rights reserved. | Terms of Use | Privacy Policy | Agreements | Licensing"
    }
  ]
}