{
  "fuentes": [
    {
      "url": "https://www.pembrokegolfclub.ca/pembroke-golf-club/about-us/",
      "email": "pembrokegolf@bellnet.ca"
    },
    {
      "url": "https://pembrokefs.ie/contact-us/",
      "email": "info@pembrokefs.ie"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "afaulkner@pembrokepinescc.com"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "cpense@pembrokepinescc.com"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "jcaruso@totalgolfmanagment.com"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "jdouglas@pembrokepinescc.com"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "jfrancher@pembroke.events"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "email": "kmason@totalgolfmanagement.com"
    },
    {
      "url": "https://www.club19pembrokelakes.com/contact.aspx",
      "email": "info@ppines.com"
    },
    {
      "url": "https://www.club19pembrokelakes.com/contact.aspx",
      "email": "sfowler@ppines.com"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "email": "membership@lhymca.com"
    },
    {
      "url": "https://www.club19pembrokelakes.com/",
      "email": "sfowler@ppines.com"
    }
  ],
  "mails": [
    "afaulkner@pembrokepinescc.com",
    "cpense@pembrokepinescc.com",
    "info@pembrokefs.ie",
    "info@ppines.com",
    "jcaruso@totalgolfmanagment.com",
    "jdouglas@pembrokepinescc.com",
    "jfrancher@pembroke.events",
    "kmason@totalgolfmanagement.com",
    "membership@lhymca.com",
    "pembrokegolf@bellnet.ca",
    "sfowler@ppines.com"
  ],
  "nombre_sitio": "club19pembrokelakes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pembrokegolfclub.ca/pembroke-golf-club/about-us/",
      "text": "About Us - Pembroke Golf Club Subscribe to Our Public Newsletter Book Online or Call For Tee Times 613-732-1665 Book a Tee Time Online HOME ABOUT US GOLF PHOTO ALBUM EVENTS JUNIORS MEMBERS CONTACT US A Bit of History The Pembroke Golf Club was established in 1922 as a nine hole golf course. It remained that way until 1982 when the second nine was added by architect Graham Cooke. Today, the golf course stretches over 6,700 years in a full championship layout. There are four sets of tees for a variety of skill levels. Competitive History Men, women and junior members of the Pembroke Golf Club are involved in a variety of competitive events in the Ottawa Valley. As a member of the Ontario Golf Association and the Ottawa Valley Golf Association (OVGA), the Pembroke Golf Club participates in the annual Intersectional matches. These OVGA events take place throughout the region and clubs move up or down in various levels given their results. These head-to-head match play events have a number of different categories and all members categories of our club (men, senior men, women, senior women and juniors) compete. Also in the Ottawa Valley are a number of annual team competitions. The storied Gordon Cup is a 14-man team event where male members participate in a number of qualifying rounds throughout the year in order to earn a position on the team. The event is held annually on Labour Day weekend and sees 14-man teams from Pembroke, Deep River, Mississippi, Arnprior and Renfrew golf clubs battle it out for Ottawa Valley bragging rights. The club has won the Gordon Cup twice in the past six years (unbelieveably, both time in a playoff!) Pembroke Golf Club was a founding member of this historic event. On the women's side, the women members also go through a season-long qualifiying to earn a spot on the team to compete for the O'Brien Cup. This is also a long-time, traditional event within which Pembroke's teams have a rich history in competiting and celebrating wins. The event also travels to clubs throughout the Valley where 12-member teams of women compete annually in August. There are a number of other team events that allow all member groups, regardless of age or ability, to represent the Cub in fun, competitive tournaments held throughout the Valley. These include the Ashley-Brown Cup (senior men), the Quattrocchi Cup (7+ handicap men), the Fraser Cup (10+ handicap men), the Longpre Cup (15+ handicap men) and the Blakely Cup (juniors). In addition, many of our members compete at events in the Ottawa zone including regional and provincial championships. The Pembroke Golf Club has a great history of producing competitive golfers in all categories. The Professional Staff Dan Shields, CPGA Head Professional and Owner Dan grew up in Pembroke and has been back in the area for 26 years. In addition to operating the Pembroke Golf Club for the past 20 years, he just completed his 25th season of overseeing the operation of the Island Brae Golf Club. After completing his post-secondary education at McGill and Carleton universities, Dan finished the requirements to become a Head Golf Professional in the Canadian Professional Golfers’ Association (Canadian PGA). He began working in the golf industry at 15 years of age and has been involved in the golf business for over 30 years. He worked as an Associate Golf Professional at two of the most prestigious golf courses in the country – The Royal Ottawa Golf Club and the Thornhill Country Club. Dan also spent five years as the Golf Professional/Manager at the Arnprior Golf Club prior to purchasing the Island Brae Golf Club. He has extensive experience in all areas of the business including: teaching, tournament organization, merchandising, membership, promotion, accounting, human resources, food and beverage operations, golf course financing, golf course maintenance, etc. 253 Golf Course Road Pembroke, Ontario K8A 7M1 Phone: 613-732-1665 Email: pembrokegolf@bellnet.ca © 2025 Copyright Pembroke Golf Club | All rights reserved Designed by Forward Thinking"
    },
    {
      "url": "https://pembrokefs.ie/contact-us/",
      "text": "Contact Us - Pembroke Facilities Services Services About Us Contact Us Hamburger Toggle Menu Get in Touch Services About Us Contact Us Hamburger Toggle Menu Contact us Contact Form Name Email Phone Number Subject Your message (optional) Get in Touch Location Address: Unit 3, Crossland Business Park, Ballymount Road Lower, Dublin 12, D12VOCP Phone +353 1292 1640 E-Mail info@pembrokefs.ie Pembroke Facility Services was founded to fulfill the growing demand for dependable, high-quality M&E and building fabric services. Services Home Services About Us Contact Us Socials Linkedin ©2023 Copyright by Vision Digital Solutions"
    },
    {
      "url": "https://pembrokepinescc.com/contact/",
      "text": "Contact Us | Pembroke Pines Country Club Skip to content TEE TIME PUBLIC MEMBERS CALENDAR TEE TIME Calendar Pembroke Pines GOLF Tee Times Golf Course Outings/Tournaments Practice Range Indoor Golf Simulators Golf Pro Shop Golf Lessons Membership EVENTS Venues Weddings Corporate Events Banquets/Celebrations Golf Outings 603 Vendors 1759 GRILLE About Menu 1759 Events CONTACT Careers Contact Us Gift Cards Blog How Can We Help You Today? Contact Us Whether you're looking to book a tee time, plan an event, or share your experience with us, we're eager to hear from you. Your feedback helps us continually improve our services and ensure an exceptional experience for all our guests. Key Contacts Kate Mason General Manager (603) 783-8900 (x101) kmason@totalgolfmanagement.com Julie Caruso Director of Sales (603) 210-1365(x181) jcaruso@totalgolfmanagment.com Amy Faulkner Food & Beverage Manager (603) 210-1365(x2) afaulkner@pembrokepinescc.com Jacklyn Francher Event Coordinator & Wedding Specialist (603) 210-1365(x182) jfrancher@pembroke.events Jon Douglas Head Golf Professional (603) 210-1365(x2) jdouglas@pembrokepinescc.com Charlie Pense Golf Course Superintendent (603) 210-1365 cpense@pembrokepinescc.com Directions Pembroke Pines Country Club 45A Whittemore Road Pembroke, NH 03275 (603)-210-1365 Hours: 8 am - 6 pm seven days a week Need a Donation for Your Event? Request golf rounds or restaurant gift certificates for your charitable fundraiser. Donation Request Form Contact Pembroke Pines We value your feedback and are always here to assist you. Whether you have a question, comment, or suggestion, we'd love to hear from you! General Contact Information Name (Required) First Last Email (Required) Phone Have a Question or Comment? (Required) CAPTCHA Facebook This field is for validation purposes and should be left unchanged. Ready to Hit the Fairways? Secure your spot on our course now! Booking a tee time at Pembroke Pines Country Club is easy and convenient with our online reservation system. Whether you're planning a leisurely round or a competitive game, our beautiful course and exceptional facilities are poised to make your golfing experience unforgettable. Don't miss the opportunity to play on one of New Hampshire's premier golf courses—reserve your tee time today! Book Tee Time A Destination for Your Special Events Weddings Say 'I do' in a lovely setting with indoor and outdoor options. Our skilled team ensures every detail of your special day is perfect. Learn more Golf Outings Whether it's a corporate evnet or a golf outing, our banquet spaces and catering services provide a refined atmosphere for any occasion. Learn More Celebrations From large gatherings to intimate get-togethers, our venue is perfect for any celebration, offering customizable packages to suit your unique needs. Learn More 1759 Grille Unwind & Savor: A Delicious Escape at Pembroke Pines. Menu Discover Our Sister Course Experience Canterbury Woods, just a short drive away. 18 holes of scenic NH golf Enjoy a full round on our beautifully designed course, showcasing New Hampshire's stunning landscape. Thoughtfully designed greens Our course features expertly crafted greens with subtle contours and diverse chipping areas, adding interest and variety to your short game experience. Visit Canterbury Woods Pembroke Pines 45A Whittemore Road Pembroke, NH 03275 603 - 21 0 - 1365 Golf tee times course Tournaments Practice Range Indoor Simulators pro Shop Lessons Membership Events Venues Weddings Corporate Events Celebrations Golf Outings 603 Vendors 1759 Grille About Menu Events -Privacy Policy- Powered by: BrandIt Marketing Solutions -Terms and Conditions- © 2025 Total Golf Management. All rights reserved."
    },
    {
      "url": "https://www.club19pembrokelakes.com/contact.aspx",
      "text": "Contact & Directions skip to main content Search Website Search About Gallery Feedback Weddings Social Corporate Golf Plan your event Skip Navigation Links Home > Contact & Directions Contact & Directions Club 19 10500 Taft St. Pembroke Pines, FL  33026 Phone:  954-538-3731 Email: info@ppines.com Susan Fowler Director of Catering & Events Club Tours by Appointment Please contact Susan Fowler to arrange a tour of our Club! sfowler@ppines.com Subscribe to our Newsletter Connect with Us The PERFECT Venue for\r\nThe Perfect Event! Contact (954) 538-3731 sfowler@ppines.com 10500 Taft St, Pembroke Pines, FL 33026 At the Pembroke Lakes Golf & Racquet Club Contact (954) 538-3731 sfowler@ppines.com 10500 Taft St, Pembroke Pines, FL 33026 At the Pembroke Lakes Golf & Racquet Club Site Map Home | Contact & Directions | Site Map | Cookie Preferences | Privacy Policy | Do Not Sell or Share My Info Copyright ©2025, Club 19. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Preferred Vendor List Do Not Sell or Share My Info Directions Contact & Directions Site Map Privacy Policy Purchase Policy"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "text": "Contact - Lakeland Hills Family YMCA Skip to content LAKELAND HILLS FAMILY Y LAKELAND HILLS FAMILY Y MENU LAKELAND HILLS FAMILY Y Search for: JOIN REGISTER GIVE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login X CLOSE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login REGISTER HERE Give Search for: Contact 2025-08-25T10:48:20-06:00 Contact Us Lakeland Hills YMCA is community-centered, bringing people of all ages and backgrounds together, to nurture potential and mobilize local communities to effect lasting and meaningful change. We look forward to helping you with your needs and answering any questions you may have. Feel free to contact us via the form below or through a membership representative at one of our local YMCAs. Contact Us Form × Contact Lakeland Hills Family Y Name * First Last Email * Who do you want to contact? * President and Chief Executive Officer, Alex Martinez Fund Development Associate, Dante Gonzalez Health & Wellness Director, Kelly Najjar Assistant Camp and Program Director, Quentin Pickering Camp & Youth Program Director, Linnea Berry Website Manager, Carmen Fritsch HR Director, Renee Dorn Chief Operating Officer, Devon Maloney Assistant Aquatics Director & Swim Lesson Coordinator, Yash Kothari Controller, Gail Shelby Fitness Director, Gerry Gessie Member Services Coordinator, Hope Hornick IT Director, Jonathan Ogintz Aquatics Manager/Lifeguard Coordinator, Sydney Jasinski Vice President Fund Development, Kaite Burke Community Engagement Manager, Kelly Horvath Early Childhood Learning Center Director, Michele Leaman Buildings and Grounds Assistant Director, Mika Newman Buildings and Grounds Director, Mike Ambrosi Membership Administrator/Day Camp Bookkeeper, Nancy Dunham Member Services Director, Reneé Welch Vice President Marketing and Membership, Rosemary Linder Day Competitive Swim Team & HR Administrator, Sarah Gulbin Senior Program Director, Shannon Bujoreanu Chief Financial Officer, Robert Marzan Early Childhood Learning Center Program Specialist & I-SWAP Manager, Cynthia Rodriguez Message * CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ Close Lakeland Hills Family YMCA 100 Fanny Road Mountain Lakes, NJ Phone: 973-334-2820 membership@lhymca.com Frequently Asked Questions What are your facility hours? Our hours are: Monday – Friday 5:00 A.M – 10:30 P.M. Saturday – Sunday 7:00 A.M. – 6:00 P.M. Directions Can I access other YMCA’s with my Lakeland Hills YMCA membership? Yes. We are proud to offer our members access to YMCA facilities across the United States and Canada that participate in Nationwide Membership. This way, our members can use the Y as often as they like, making it easier to achieve their health and wellness goals. Are group exercise classes available? Yes. We have over 65 weekly classes offered from Yoga to HIT. These classes offer a great workout in a class setting, and are all included with your membership. Can I bring a friend? Yes. As a member, you are given 3 guest passes per year. You can bring a friend up to 3X for free. After that there is a fee. Guests/friends can use facility a max of 3X per year and then must become a member. Is there a trial membership to try out the Y? Yes. We have a 1-Week Trial Membership for free.  After that, we have several options that you can choose as a new member. What benefits do I get with my membership? Full Privilege Membership entitles you to use the pool, basketball gymnasium, Health and Fitness Training Center, general membership locker rooms, as well as group fitness, yoga, spinning classes, and all aqua exercise classes. Plus, three free guest passes per year and a fitness orientation. Some age restrictions apply. Long Term Locker Membership offers full privilege membership plus an assigned locker and towel service in an adult only locker room which includes steam room, sauna and TV. What are the pool hours? For Pool Hours and available swim times, please visit our schedules page where you can download swim times as well as gymnasium and group fitness class times. Do you offer financial assistance? Yes. We offer financial aid to ensure that no one is turned away from a Y program or service due to an inability to pay. Visit our Financial Assistance page for more information. STAY CURIOUS Want to know more about how you can make an impact in the community? Fill out this simple form to learn how to get involved. About Us Join Give Volunteer Test Contact Leadership Team Register Privacy Policy Member Login Facility Hours Y Hours Mon-Fri: 5:00am-10:15pm Sat-Sun: 7:00am – 5:45pm Desk Hours Mon-Fri: 8:00am-8:00pm Sat-Sun: 8:00am – 4:00pm Learn more >> CONNECT WITH US Copyright © Lakeland Hills YMCA Lakeland Hills YMCA | 100 Fanny Road | Mountain Lakes, NJ 07046 | 973.334.2820 Site designed by Daxko Toggle Sliding Bar Area Page load link Both Tai Chi classes will be cancelled Thursday, September 11. Last chance this week to register for fall classes, which begin Monday, September 8. Registration available 24/7 online. + +"
    },
    {
      "url": "https://www.club19pembrokelakes.com/",
      "text": "Club 19 Pembroke Lakes skip to main content Search Website Search About Gallery Feedback Weddings Social Corporate Golf Plan your event Subscribe to our Newsletter Connect with Us The PERFECT Venue for\r\nThe Perfect Event! Contact (954) 538-3731 sfowler@ppines.com 10500 Taft St, Pembroke Pines, FL 33026 At the Pembroke Lakes Golf & Racquet Club Contact (954) 538-3731 sfowler@ppines.com 10500 Taft St, Pembroke Pines, FL 33026 At the Pembroke Lakes Golf & Racquet Club Site Map Home | Contact & Directions | Site Map | Cookie Preferences | Privacy Policy | Do Not Sell or Share My Info Copyright ©2025, Club 19. All Rights Reserved. Powered by Back to Top My Account Log Out Log In Search Search Preferred Vendor List Do Not Sell or Share My Info Directions Contact & Directions Site Map Privacy Policy Purchase Policy"
    }
  ]
}