{
  "fuentes": [
    {
      "url": "https://pranafoods.ca/pages/contact-us",
      "email": "bilingual_140x@2x.png"
    },
    {
      "url": "https://pranafoods.ca/pages/contact-us",
      "email": "image_menu_aout_25_beurre_370x230@2x.jpg"
    },
    {
      "url": "https://pranafoods.ca/pages/contact-us",
      "email": "image_menu_aout_25_dej_370x230@2x.jpg"
    },
    {
      "url": "https://pranafoods.ca/pages/contact-us",
      "email": "prana_organic_140x@2x.png"
    },
    {
      "url": "https://www.pranapets.com/pages/contact",
      "email": "info@pranapets.com"
    },
    {
      "url": "https://prana.co/pages/contact",
      "email": "contact@prana.co"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-tampa-bay/club-prana.html",
      "email": "club@clubprana.com"
    },
    {
      "url": "https://prana-eol.org/about-us/",
      "email": "img_6718-scaled_010e010e1@2x.jpg"
    },
    {
      "url": "https://prana-eol.org/about-us/",
      "email": "prana-top-logo2_017c00451@2x.png"
    },
    {
      "url": "https://prana-eol.org/about-us/",
      "email": "prana2_009600961@2x.png"
    },
    {
      "url": "https://prana-eol.org/about-us/",
      "email": "prana2_00b400961@2x.png"
    },
    {
      "url": "https://www.pranaleisuregroup.com/contact-us",
      "email": "andrew@pranaleisuregroup.com"
    },
    {
      "url": "https://www.pranaleisuregroup.com/contact-us",
      "email": "robert@pranaleisuregroup.com"
    },
    {
      "url": "https://www.thepranaresorts.com/contact-us",
      "email": "info@thepranaresorts.com"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "email": "171162158@n08.jpg"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "email": "43649676@n07.jpg"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "email": "club@clubprana.com"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "email": "general@2x-19baca12.png"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "email": "icons@2x-3e01d8a8.png"
    }
  ],
  "mails": [
    "171162158@n08.jpg",
    "43649676@n07.jpg",
    "andrew@pranaleisuregroup.com",
    "bilingual_140x@2x.png",
    "club@clubprana.com",
    "contact@prana.co",
    "general@2x-19baca12.png",
    "icons@2x-3e01d8a8.png",
    "image_menu_aout_25_beurre_370x230@2x.jpg",
    "image_menu_aout_25_dej_370x230@2x.jpg",
    "img_6718-scaled_010e010e1@2x.jpg",
    "info@pranapets.com",
    "info@thepranaresorts.com",
    "prana-top-logo2_017c00451@2x.png",
    "prana2_009600961@2x.png",
    "prana2_00b400961@2x.png",
    "prana_organic_140x@2x.png",
    "robert@pranaleisuregroup.com"
  ],
  "nombre_sitio": "clubprana.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pranafoods.ca/pages/contact-us",
      "text": "Contact Us | Questions, Comments and Inquiries | Prana Foods Skip to content Shop All Shop All Breakfast Overnight Chia & Oats Granolove Nut butters Chia Seeds Gluten-free Oats Flakes Topping & Superfood Breakfast Boxes Snacks Bean Me Up Trail Mixes Salty Snacks Sweet Snacks Allergen Free Granola Bar Cookies Dried Fruits Snacking boxes Ingredients Nuts Seeds Dried Fruits Nut & Seed Butters Flour & Oats Chocolate Fairtrade Sugar Our favourites New arrival On sale Best sellers Fairtrade products Goodies to Wear & Carry Recipes Breakfast Appetizers and Sides Soups Salads Drinks Main Courses Desserts Snacks Who we are Our story Our mission Blog Canada United States Account Follow us Cart Spend $59 more and get free shipping! Spend $100 more and get free shipping! Spend $59 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $100 more and get free shipping! Spend $59 more and get free shipping! Your cart is empty Free shipping starting at --free-ship-amount--* in --province-name--. Shop All Shop All Breakfast Overnight Chia & Oats Granolove Nut butters Chia Seeds Topping & Superfood Breakfast Boxes Snacks Bean Me Up Trail Mixes Salty Snacks Sweet Snacks Cookies Allergen Free Granola Bar Dried Fruits Snacking Boxes Ingredients Nuts Seeds Dried Fruits Nut Butters Gluten-free Flours & Oats Chocolate Fairtrade Sugar Our favourites New arrival On sale Best Sellers Fairtrade products Goodies to Wear & Carry The best breakfast for your morning routine Our butters, with their incomparable texture and taste Recipes Breakfast Appetizers and Sides Soups Salads Drinks Main Courses Desserts Snacks Who we are Our story Our mission Blog locate store your account search shopping cart En Fr change language Canada United States Contact us Do not hesitate to consult our FAQ , which will answer most of your questions about our products and how the website works. Please note that we do not sell products from our office. If you still have a question, you can contact us by phone or email. Our team is available to assist you Monday to Friday - 9AM to 5PM (EST). By phone : 1-844-447-7262 By email : Select the topic of your request below and fill in the form or email us at service@pranafoods.ca Bulk ingredients Buying Club inquiry Careers Customer assistance Donation / Sponsorship request for non profit organization Influencer / Blogger / Content Creator collaboration or partnership requests Media request Partnership and sponsorship request Reseller request for Canada Supplier contact Crave for change From breakfast to late-night cravings, we’re here to make plant-based eating easy, delicious, and inspiring—with organic, natural goodness every step of the way. Follow us on our site Shop all Subscription Recipes Contact us FAQ Terms of Service Affiliate program Privacy Policy Buying Club Blog Refund Policy Newsletter Subscribe to receive updates, access to exclusive deals, and more. Subscribe Language English Language English français © prana organic Powered by Shopify"
    },
    {
      "url": "https://www.pranapets.com/pages/contact",
      "text": "Contact Prana Pets Free Consultations! Tap to call 1-800-368-0016 FREE SHIPPING ON ORDERS OVER $39.95 JOIN THE VIPP CLUB & SAVE! Find anything you need DOG CONDITIONS Mobility & Coat Care Chews CBD for Dogs Cushing's Puppies Breathing & Colds Calming Nervous System & Brain Health Hip & Joint Support Urinary & Kidney Support Liver Support Gut Health for Dogs Senior Dogs CAT CONDITIONS CBD for Cats Kittens Breathing & Colds Calming Nervous System & Brain Health Hip & Joint Supplements Urinary & Kidney Support Liver Support Gut Health for Cats Senior Cats BUNDLES Cushing's Bundles CBD Symptom Packs Immune Support Bladder Support Respiratory Bundles Gift Cards ABOUT SCHEDULE A CALL GUARANTEE AUTOSHIP & SAVE SHIPPING FAQs BECOME A WHOLESALER PET HEALTH BLOG JOIN OUR TEAM REVIEWS RETURNS CONTACT 365 GUARANTEE Log in Register View cart 0 DOG CONDITIONS Mobility & Coat Care Chews CBD for Dogs Cushing's Puppies Breathing & Colds Calming Nervous System & Brain Health Hip & Joint Support Urinary & Kidney Support Liver Support Gut Health for Dogs Senior Dogs CAT CONDITIONS CBD for Cats Kittens Breathing & Colds Calming Nervous System & Brain Health Hip & Joint Supplements Urinary & Kidney Support Liver Support Gut Health for Cats Senior Cats BUNDLES Cushing's Bundles CBD Symptom Packs Immune Support Bladder Support Respiratory Bundles Gift Cards ABOUT SCHEDULE A CALL GUARANTEE AUTOSHIP & SAVE SHIPPING FAQs BECOME A WHOLESALER PET HEALTH BLOG JOIN OUR TEAM REVIEWS RETURNS CONTACT Join VIP Club for 20% Off Log in Register 0 Contact Prana Pets Ask Our Experts Now We want to hear from you!  Questions, comments, concerns, product or pet-related, we're here to help however we can. Corporate HQ 430 Indiana St., Suite 100 Denver, CO 80401-5012 Email us using the form below and our Customer Happiness Team will reply within one business day, usually within hours on a weekday. Monday - Friday 9 am ET - 7 pm ET, feel free to call us at +1 800.368.0016 , if you need a faster reply. Schedule a Call with a Pet Health Expert Name Email Phone Number (optional) Message Customer Service Contact My Account Shipping Guarantee Explore About Shop Reviews Blog FAQs Careers Legal Join VIP Club Connect +1 800.368.0016 Email Schedule a Call No statements on this website have been evaluated by the U.S. Food and Drug Administration. These products are not intended to diagnose, treat, cure, or prevent any disease. No statements on this website have been evaluated by the U.S. Food and Drug Administration. These products are not intended to diagnose, treat, cure, or prevent any disease. © 2025 Prana Pets"
    },
    {
      "url": "https://prana.co/pages/contact",
      "text": "Contact us through this form, or feel free to email us at contact@pran\n – Prana.co Skip to content How It Works Science Features About Us Contact Us FAQ Shop Now How It Works Science Features About Us Contact Us FAQ Shop Now Shop Now Item added to your cart Check out Continue shopping Contact Us Use this form to contact us, or email us directly: contact@prana.co Name Email * Phone number Comment Send Quick links How It Works Science Features About Us Contact Us FAQ Shop Now Copyright Ⓒ 2025 Prana Tech LLC, All Rights Reserved Privacy Policy | Terms & Conditions . Our technology is covered by U.S. Patent #11,172,850. Additional patents are pending. © 2025, Prana.co Powered by Shopify Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-tampa-bay/club-prana.html",
      "text": "ï»¿ Club Prana - Rooftop bar in Tampa Bay | The Rooftop Guide Rooftop Bars Europe North America Central America & Caribbean South America Asia Middle East Oceania Africa Rooftop Pools Inspiration Sign up North America Rooftop bars in Tampa Bay Tampa Bay rooftop bar Club Prana $ $ $ $ $ 5th floor Ybor City Images belong to the bar Last updated: June 10, 2025 Club Prana Rooftop Bar Tampa Bay Skyline No Year round No Overview 5 level night club for views and fun. Club Prana is one of Tampa's hottest and largest nightclubs, spanning over 5 floors and where each floor has its individual style and music format. Up top is the The Sky Bar, the real cherry on the cake, with two bar-tending stations and a tropical bar, a dance floor, reggae music, lounge chairs and a panoramic view of Tampa's party district and skyline. The terrace feels like a large VIP area, though all are welcome. Located in Ybor City, just northeast of downtown Tampa, Club Prana is a perfect rooftop bar in Tampa Bay for those looking for a great party night out, with a vibrant atmosphere, a mixed crowd and great views. Open four nights a week from about 9pm, Club Prana might not be buzzing straight away, but to avoid the lines it is recommended to be in good time. Watch Location & Map 1619 E 7th Ave, Tampa, FL 33605 Contact +1 813-241-4139 club@clubprana.com Visit website Facebook Instagram Opening Hours Monday: Closed Tuesday: Closed Wednesday: Closed Thursday: 22.00 - 03.00 Friday: 21.00 - 03.00 Saturday: 21.00 - 03.00 Sunday: Closed FAQ What is the Club Prana dress code? The Club Prana dress code is smart casual. Aim to look clean, smell nice and look as though you made some effort to come out. Rating By: Rikard Fredricson Rikard has spent the last 10 years exploring, enjoying, researching and working with rooftop venues. During these years he has visited more than 700 rooftops across the globe. The experience he has gained is used to create helpful, in-depth and accessible content, and to share his knowledge and rooftop expertise with fellow rooftop-lovers. Hot Read Elevated swims Dive into the best rooftop pools around the globe Dazzling heights Head sky-high and explore the tallest rooftop bars in the world Explore Browse all the cities & articles at The Rooftop Guide Follow The Rooftop Guide More rooftop bars in Tampa Bay Sal Y Mar Sal Y Mar rooftop bar brings a large slice of Riviera Maya-vibes to the heart of Midtown Tampa. Inspired by the beautiful city of Tulum, the 4 900 square feet rooftop mixes indoor and outdoor seating, where you are surrounded with... Beacon Rooftop Bar Perched on top of the luxurious JW Marriott Tampa Water Street, Beacon invites to Tampaâs highest public rooftop & cocktail experience. Located on the 27th floor, and subtly drawing from local flora and fauna, the spaceâs colors capture the quintessential... Azura Rooftop Spacious and very open-air, the comfy Azura Rooftop offers panoramic views over St Pete Beach, Intracoastal Waterway and the Gulf of Mexico. Extra fantastic right around the colorful and amazing ocean sunset... View All You may also like Article 10 best rooftop bars for a beautiful sunset Article 7 proven tips for the ultimate rooftop experience Article Swim at the best rooftop pools in the world Article 9 amazing hotels with rooftop bar Complete guide 54 best rooftop bars New York Complete guide 23 best rooftop bars Miami Complete guide 8 best rooftop bars Orlando Complete guide 29 best rooftop bars Los Angeles Collaboration Timeless watches for timeless views Everything is better with a nice view! Explore Top 10 Popular cities Book your hotel Features Swedish version Follow Facebook Instagram YouTube TikTok Pinterest Snapchat X LinkedIn Threads Newsletter Business About us Collaborate with us Contact us Collaborations Legal Privacy Policy © Copyright 2015-2025 | by therooftopguide.com | All Rights Reserved."
    },
    {
      "url": "https://prana-eol.org/about-us/",
      "text": "About Us - Prana Juegos en poker reglas. 20bet Casino Login App Sign Up : Money Bags es un excelente juego para que los niños interactúen con las monedas, aprendan a contar dinero y a hacer cambios. Casino You Can Pay By Phone Bill - Kerching recibe juegos de casino en vivo de Extreme, un popular proveedor que ofrece ruleta, baccarat y blackjack. Free Online Bingo Slots Games : Puedes obtener hasta 80 monedas por un cóctel, zapatos y una vela, mientras que los palos de naipes pagan de 5 a 50 monedas por combinaciones estándar de 3 a 5 de símbolos coincidentes. Casinos en la provincia de buenos aires. France Pari Casino Review And Free Chips Bonus Visualmente, las cosas son exactamente lo que esperarías del equipo, vibrantes y nítidas, con un excelente nivel de habilidad. Top 10 Best Online Casinos Australia El casino se asegura de que la mayoría de sus transacciones se procesen el mismo día hábil. Aunque la elección es excelente para el consumidor, el gran volumen de nuevos sitios puede desanimar a los nuevos jugadores, sin embargo, hay algunas cosas que pueden hacer que elegir un nuevo casino en línea sea un proceso simple. Resultado de la lotería del chance. Bingo Call Sheet Todo lo que necesita hacer cuando juega es apostar por la mano del Jugador o la Banca para ganar, o por las manos para empatar. Casino Slots Tips And Tricks BetMGM Canadá tiene la mayoría de los elementos de un casino en línea ganador. Fastbet Casino No Deposit Bonus Codes For Free Spins 2025 VIRTUAL TOUR BOOK NOW PAST EVENTS Home The Garden <BACK Attractions Projects & Past Events Expressions <BACK Activities Lessons Treasures <BACK Fashion <BACK Kids Outerwear Covers & Wraps Earth Living <BACK Wellbeing Compassion Connect Prana Practices Pranarchive Celebrations <BACK Events-Workshops Book a Visit Gallery About Us <BACK Mission & Vision Founder – board Faculty Newsletter Earthday Contact Us Donate No products in the cart. Book Now Home The Garden Attractions Projects & Past Events Expressions Activities Lessons Treasures Fashion Kids Outerwear Covers & Wraps Earth Living Wellbeing Compassion Connect Prana Practices Pranarchive Celebrations Events-Workshops Book a Visit Gallery About Us Mission & Vision Founder – board Faculty Newsletter Earthday Contact Us Donate About Us Home / About Us Mission To help all to explore life-force through various nature activities and enhance the quality of life. Below are the guiding principles: Conserve Nature Embrace nature activities and discover wellness Align with the natural elements of the earth (sunlight, water and soil) for a balanced life-style Love inner self and enhance the quality of life Vision All pervading life-force (i.e. Prana) is the binding force of the universe and is all for us to experience and explore in our lifetime. Our goal is to experience prana in every moment of our conscious existence through various nature-centric & earth-living activities, such as: conservation of soil-water and other natural resources, responsible food-practices, mindful health practices, yoga, open-air performing arts. Such experiences of Prana will enhance the quality of life leading to self-discovery and self-love. FOUNDERS Dr. Debleena Banerji , the Artistic Director of Prana has been the driving force behind this novel project at the Garden. Although her 20+ years scientific career spans between gutsy deep-sea excursion along the Mid-Atlantic Ridge and projects in deep-water Gulf of Mexico oil-exploration, she has gradually transitioned in to promoting awareness about earth-living in the greater Houston community. Her passion lies in sharing knowledge about how to establish a balanced existence by harmonizing creative and analytical attributes of oneself. In the recent past, she has produced and directed classics like Selfish Giant and Alice in Wonderland in contemporary drama form. Dr. T. Raja , the Executive Director of Prana has maintained a very successful dual career in the realm of earth science as well as in the world of music. While his professional career is in the petroleum industry (Phd in Geology) as one of the ace discoverers of Deepwater Gulf of Mexico exploration for the supermajor Royal Dutch Shell, he has also been a very well-known tabla player in the Houston music arena for last 20+ years. His music school at Katy highlights world percussion and was covered by Houston Chronicle in 2009 for this unique contribution to the greater Houston community. He has performed with many well-known musicians in India and US including Ustad Ashish Khan, Pandit Keshav Ginde, Dr. Paul Katz,  Amit Kumar, Abbos Kosimov, Rekha Surya, Dhananjay Kaul et al. Currently he also teaches various genres of drums at Durgabari Kala Bhavan & Arya Samaj of Houston. He has served as the President of Tagore Society of Houston (a non-profit organization) between 2008 and 2011, and pioneered numerous collaborative projects with esteemed local organizations such as UH, Asia Society, Museum of Fine Arts, India Culture Center, Bangladesh Association of Houston etc. He currently serves at the Board of Directors of Tagore Society of Houston and designs various domestic and international cultural events for TSH. He also grooms the young performers of Tagore Society Youth Orchestra ( https://youtu.be/e5znwHuj7ZA ). Raja has been part of an experimental fusion band called Essence of Prana. Wise Owls “A wise old owl lived in an oak The more he saw the less he spoke The less he spoke the more he heard Why can’t we all be like that bird?” -Edward Hersey Richards The Wise Owls at Prana help us stay aligned with the mission of educating the friends of Prana about the nuances of nature and the goodness of earth life-style. Coming from different walks of life then, the Wise Owl is one of the most versatile and creative team that advices Prana to keep it flowing. Chetan Bhat Experience: Youth Activities Jay Malhotra Experience: Engineering & Media Jenn Pickering Experience: Permaculture Julio Sanchez Experience: Infrastructure Manash Chakrabarty Experience: Construction Mary Carol Edwards Experience: Biologist Mrinal Choudhury Experience: Advising Piyali Sengupta Experience: Creative Art Pradip Taulkdar Experience: Engineering Rob Pickett Experience: Design Rohan-Mandakini Banerjee Experience: Media & Website Sonali Patil Experience: Advising Sourav-Sayani Ghosh Experience: Media & Art Contact Us 35482 Royal Road, Pattison, TX 77423, USA 281-757-5669 – Debleena Banerji dbanerji93@gmail.com EIN number: 84-4002658 Virtual Tour Newsletter Sign-up Volunteer Sign-up Leave an Impression Projects Let us make Prana our conscious existence. Contact Us 35482 Royal Road, Pattison, TX 77423, USA 281-757-5669 – Debleena Banerji dbanerji93@gmail.com EIN number: 84-4002658 Social Media Links Leave this field empty if you're human: × Home The Garden Attractions Projects & Past Events Expressions Activities Lessons Treasures Fashion Kids Outerwear Covers & Wraps Earth Living Wellbeing Compassion Connect Prana Practices Pranarchive Celebrations Events-Workshops Book a Visit Gallery About Us Mission & Vision Founder – board Faculty Newsletter Earthday Contact Us Donate"
    },
    {
      "url": "https://www.pranaleisuregroup.com/contact-us",
      "text": "Contact Us | Prana Leisure Group top of page Home About Prana Marketing Partner With Us More Use tab to navigate through the menu items. Contact Us Contact Us Want to make your holiday park a runaway success? Get in touch for a quick, no obligation chat. Office: Belmont house, 76 Shielfield terrace Berwick upon tweed TD152EE Contact Details: robert@pranaleisuregroup.com 07500 874938 andrew@pranaleisuregroup.com 07530042310 Get in Touch Please fill out the form. One of the team members will be in touch shortly with complete discretion. First Name Last Name Email Phone Number Write a message By submitting this form, you accept that you have read our Privacy Policy and agree to the collection of the data provided in order to fulfil your request. Submit Thanks for submitting! Our team will soon contact you :D © 2023 by Prana Leisure Group Ltd. SERVICES Land / Acquisitions Prana Marketing Unique Planning Solution COMPANY About Prana Contact Us Privacy Policy Connect with us: Terms & Conditions bottom of page"
    },
    {
      "url": "https://www.thepranaresorts.com/contact-us",
      "text": "Contact Us | Prana Resort top of page Home Events Corporate Weddings Restaurants Jalsa - The Fine Dine River Deck Cafe Adventures Resort Rooms Suite Rooms Luxury Tents Deluxe Rooms Offers ☰ Reviews and Testimonial Contact Us Amenities Locate Us More Use tab to navigate through the menu items. Get in Touch ​Prana Resorts & Banquets, Mumbai-Pune Highway, Ravet, Pune 412101 1800-890-0667 info@thepranaresorts.com Contact Us Please take a moment to fill out the form. Name Email Code Contact Information Special Instructions Submit Thanks for submitting! Location SURVEY NO 421/1A/1 RAVET, SAMEER, LAWNS BACKSIDE, MUMBAI PUNE, HIGHWAY PIMPRI CHINCHWAD, PUNE, MAHARASHTRA, INDIA, 412101 Refund Policy Terms and Conditions Privacy Policy Contact Us 1800-8900-667 / +91 9225588901 info@thepranaresorts.com Maps and Layout bottom of page"
    },
    {
      "url": "https://www.flickr.com/people/clubprana/",
      "text": "About Club  Prana | Flickr Explore What’s New New! Recent Photos Trending Events The Commons Flickr Galleries World Map Camera Finder New! Flickr Blog Prints The Print Shop Prints & Wall Art Photo Books ✨ Get Pro Pro Plans Stats Dashboard Get Auto-Uploadr Log In Sign Up ✨ Get Pro Log In Explore What’s New New! Camera Finder New! Trending Events The Commons Flickr Galleries Flickr Blog The Print Shop Prints & Wall Art Photo Books About Jobs Blog Advertise Developers Guidelines Help Privacy Terms Cookies English Club  Prana Follow Give Pro Club Prana 281 Followers • 125 Following 101,059 Photos Tampa, USA Joined 2009 Club  Prana Give Pro Club Prana 281 Followers • 125 Following 101,059 Photos Tampa, USA Joined 2009 Follow Save Cancel Drag to set position! About Photostream Albums Faves Galleries Groups Only 5 Story Night CLub In The Tampa Bay Area! Showcase Joined October 2009 Occupation Nightclub Hometown Ybor City Current city Tampa Country USA Email club@clubprana.com Website http://www.clubprana.com Most popular photos Most faved View all Photos of Club  Prana Testimonials Nothing to show. About Jobs Blog Advertise Developers Cookies Guidelines Privacy Terms Help Report abuse English Privacy Terms Connecting people through photography. About Jobs Blog Advertise Developers Cookies Guidelines Report abuse Privacy Terms English Privacy Terms Connecting people through photography."
    }
  ]
}