{
  "fuentes": [
    {
      "url": "https://www.sierraclub.org/mother-lode/tahoe/about-us-0",
      "email": "amesl@sbcglobal.net"
    },
    {
      "url": "https://www.sierraclub.org/mother-lode/tahoe/about-us-0",
      "email": "theochoas3@charter.net"
    },
    {
      "url": "https://clublakevenue.com/lodging-and-travel/",
      "email": "info@vipweddingtransportation.com"
    },
    {
      "url": "https://www.festivalofclubs.com/about-us",
      "email": "sean@alchemymedia.co.uk"
    },
    {
      "url": "https://www.rockislandlakeclub.com/contact",
      "email": "info@rockislandlakeclub.com"
    },
    {
      "url": "https://www.cedarlakeclub.com/",
      "email": "rsardelli@cedarlakeclub.com"
    },
    {
      "url": "https://www.leighoak.com.au/contact-us",
      "email": "leighoak.info@mvrc.net.au"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "abrix@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "asackett@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "aweber@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "esmith@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "jyatsko@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "lkellogg@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "sbrown@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "tchadwick@clubhouse-intl.org"
    },
    {
      "url": "https://clublakevenue.com/fall-festival/",
      "email": "fallfestival@clublakevenue.com"
    }
  ],
  "mails": [
    "abrix@clubhouse-intl.org",
    "amesl@sbcglobal.net",
    "asackett@clubhouse-intl.org",
    "aweber@clubhouse-intl.org",
    "customerservice@encorepack.com",
    "esmith@clubhouse-intl.org",
    "fallfestival@clublakevenue.com",
    "info@rockislandlakeclub.com",
    "info@vipweddingtransportation.com",
    "jyatsko@clubhouse-intl.org",
    "leighoak.info@mvrc.net.au",
    "lkellogg@clubhouse-intl.org",
    "rsardelli@cedarlakeclub.com",
    "sales@encorepack.com",
    "sbrown@clubhouse-intl.org",
    "sean@alchemymedia.co.uk",
    "tchadwick@clubhouse-intl.org",
    "theochoas3@charter.net"
  ],
  "nombre_sitio": "clublakevenue.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sierraclub.org/mother-lode/tahoe/about-us-0",
      "text": "About Us | Sierra Club Skip to main content Shape Combined Shape Combined Shape Shape Combined Shape ic_video_youtube_black SC Logo_Horiz Web Black Tahoe Area Group Join Renew Donate Tahoe Area Group Home About Us Contact Us Conservation News and Updates Single-Use Plastics Ban Campaign Tahoe Keys Weeds Washoe Meadows State Park Get Involved Outings and Events Recorded Presentations News Blog TRPA Must Prioritize Transparency and a Carrying Capacity Study for Lake Tahoe Quarterly eNewsletters About Us The Tahoe Area Sierra Club promotes the environmental and ecological health of Lake Tahoe and the Lake Tahoe Basin. • We educate • We involve members and community • We work to clarify the issues that sustain the quality of life both for the waters and lands. • We advocate for the people who want to preserve the Lake for generations to come. We sponsor informative community events highlighting environmental issues and showcasing some of our best artists and adventurers. Membership is open to all interested in taking care of what has been called the “Gem of the Sierra”.  We are always looking for volunteers to help with fundraising, community meetings, outings and involvement in one of our committees. For information please contact:  Cindy Ochoa at  TheOchoas3@charter.net Tahoe Area Sierra Club PO Box 16936 South Lake Tahoe, Ca 96151 Executive Committee: Acting Group Chair:  Lily Hays Conservation Chair:  Laurel Ames Amesl@sbcglobal.net Lynne Paulson Karan Duron Carolyn Willette Treasurer:   Kelley Pedigo Join/Donate to the Sierra Club today! Join Donate Sign up is Processing Thank you! Sign up for Tahoe Area Group Emails Sign Up! With this action you affirm you want to receive regular phone and text communications from Sierra Club and may vote on policy designated by the Sierra Club Board. Contact Us Sierra Club News Why Public Lands Need Protection More Than Ever The Trump administration wants to sell off our shared lands. We need to meet this moment. This Is How Climate Change Transformed a Maryland Neighborhood Extreme conditions are impacting Takoma Park's trees Parks Need More Than Promises Members of the House Natural Resources Committee gathered last week in Wyoming under the towering Grand Teton for a field hearing that highlighted... This Land Is Your Land A mother and daughter pedal across Wyoming as public lands hang in the balance From Yosemite to Glacier, a Month of Action United People to Honor History, Parks, and Public Lands All August, Sierra Club Volunteers and Activists Came Together to Celebrate and Defend Public Lands. More Sierra Club news Find us on facebook Find us on instagram Find us on youtube Privacy Policy/Your California Privacy Rights Terms and Conditions of Use Your Privacy Choices Cookie Policy Sierra Club® and \"Explore, enjoy and protect the planet\"® are registered trademarks of the Sierra Club. © Sierra Club 2025 . The Sierra Club Seal is a registered copyright, service mark, and trademark of the Sierra Club."
    },
    {
      "url": "https://clublakevenue.com/lodging-and-travel/",
      "text": "Lodging and Travel - Club Lake Venue Skip to content Club Lake Venue Where rustic marries elegance Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Lodging & Travel Make the most of your visit to Club Lake by exploring the lodging and travel options nearby. Friendly service, clean rooms, and comfortable surroundings every time. These hotels are located directly next to each other and are highly recommended or your lodging needs. Off of Hwy 441, these modern roadside hotels are 7 miles from Club Lake. Holiday Inn Express & Suites Orlando 238 South Line Drive Apopka, Florida 32703 BOok online Hampton Inn & Suites Orlando-Apopka 321 S. Lake Cortez Drive, Apopka, Florida, 32703 book online Transportation Service VIP Wedding Transportation info@vipweddingtransportation.com 407.601.7766 Learn More find your way around Home About Us Weddings + Events Explore Club Lake FAQs Contact Us Home About Us Weddings + Events Explore Club Lake FAQs Contact Us gallery @2023 Club Lake VENUE, ALL RIGHTS RESERVED SITE DESIGN BY DAVEY & KRISTA + Club Lake VENUE find us elsewhere find your way around Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. find us elsewhere"
    },
    {
      "url": "https://www.festivalofclubs.com/about-us",
      "text": "About Us | Festival of Clubs 2024 Club Award Winners About Us Club Awards  - all you need to know Ticket information Background to the Club Awards How to enter & the categories The Judging Process Where is the event this year? How do I get there? Travel and parking Accommodation More information & contact details Meet our sponsors 2024 Club Award Winners About Us Club Awards  - all you need to know Ticket information Background to the Club Awards How to enter & the categories The Judging Process Where is the event this year? How do I get there? Travel and parking Accommodation More information & contact details Meet our sponsors About Us For over 55 years it has been our privilege to champion clubland and the important role that licensed clubs play, right at the heart of their communities. Now, we own a portfolio of magazines, events, websites and social media platforms across the hospitality industry. From print magazines and electronic titles to leading industry events , websites and social media, Club Mirror's role, with the support of sister titles Club Rugby, Club Football, Club Cricket and Clubhouse Europe, continues apace with regular updates and weekly bulletins. Our army of experts We're proud to work alongside an army of club-supporting suppliers and sponsors, experts in their fields who recognise the value of clubs and who proffer advice and answers to questions on all-things club-related. You know who you are and your support is invaluable. New to the market? Clubland is a welcoming arena and we are the forum for new expertise and insights. So if you want to get involved, then now’s the time. From equipment maintenance and security to food hygiene and food supplies for clubs operating takeaways, there are plenty of opportunities to share best practice and best advice. Our army of clubs Clubs remain some of the most agile, resilient and adaptable businesses in the UK. Clubland has faced many challenges over the years –  for many that includes BOTH World Wars - and always overcome adversity. And here they are - thriving. Care to join us? We continue to stand shoulder-to-shoulder with our clubs, club suppliers and club supporters. You are very welcome to join us. Club Magazines & Websites Club Mirror – www.clubmirror.com The Club Bulletin – electronic newsletter (new launch) The Sports Club Bulletin – electronic newsletter (new launch) Clubhouse Europe, in association with the Club Managers Association of Europe – www.clubhouseeurope.com Club Rugby – www.clubrugby.org.uk Club Football – www.clubfootball.org.uk Club Cricket – www.clubcricket.org.uk Club Report – annual industry bible Club Journal, published on behalf of the Club & Institute Union – available at the CIU-run website www.wmciu.org.uk Sports Club Management – one-off specials Racing Club Bulletin – Racedays and discounts for clubs and their members (in conjunction with courses run by The Jockey Club and Arena Racing Company ) Club Awards and Events Awards Club Awards (part of Festival of Clubs) - www.festivalofclubs.com Clubhouse Awards Hospitality Social Media Awards – www.hsma.biz Suppliers of the Year Awards Sports Club Awards Club Recognition Awards CAMRA Club of the Year Club Act of the Year Community Rugby Awards Events Golf Club Society Golf Days Club Association Lunches Sports Club Associations Lunches Training sessions Exhibitions & Road Shows Beer Festivals Racedays Rugby Tonight Broadcasts - audience takeovers The Team Our team boasts over 200 years’ publishing experience. Clubland is our prime focus, with unparalleled knowledge of, and contacts within, the sector. This is closely followed by the broader hospitality sector and sporting arena, all supported with an exceptional events team, fantastic freelancers and a unique understanding of the fields we operate within. With companies such as EMAP and Reed Business Publishing, Quantum and  VNU, The Daily Mirror and AMV BBDO under our collective belts. We’ve been trained by the best. And with clients such as Sainsbury’s, Harvester, Heineken, BT, ITP, Ladbrokes, Santander and NatWest, we’ve worked with the best too. Office Windsor Office: Club Awards, Link Spaces, Botanica Ditton Park, Riding Court Road, Slough, SL3 9LL Tel 07789 870709 Email: sean@alchemymedia.co.uk ​ Sponsors and Partners 2024 Club Award Winners About Us Club Awards  - all you need to know Meet our sponsors Terms & Conditions | Privacy Policy | About Us"
    },
    {
      "url": "https://www.rockislandlakeclub.com/contact",
      "text": "Contact — Rock Island Lake Club 0 Skip to Content Weddings About Planner's Blog Vow & Vision Contact 2025 Wedding Package Open Menu Close Menu Weddings About Planner's Blog Vow & Vision Contact 2025 Wedding Package Open Menu Close Menu Weddings About Planner's Blog Vow & Vision Contact 2025 Wedding Package Get in touch. Appointments Since we are a private venue and host weddings frequently, all visits must be made by appointment only. Location 485 Glen Road Sparta, NJ 07871 Contact Information info@rockislandlakeclub.com 973.512.3995 - call or text us Schedule a visit Although pictures are a great way to showcase our venue, nothing beats seeing it with your own eyes. Our venue specialist is standing by, ready to hear about your vision, answer questions and set up a tour for you to come explore in-person! Your Name * First Name Last Name Partner's Name * First Name Last Name Preferred pronouns Where did you find us? * Instagram The Knot Blog Post Here Comes the Guide TikTok Referral Local Google Search/Maps Attended a wedding here Somewhere else (please mention in your message!) Email * Phone * (###) ### #### Estimated number of guests * Tell us more! Thank you! Rock Island Lake Club does not share or sell your personal information to other companies/vendors. 485 Glen Road Sparta, NJ 07871 Join our online community. Schedule a Visit 973.512.3995 info@rockislandlakeclub.com Sister Venue > Planning Resources Vendors Virtual Tour The Aspen House 2025 Wedding Package Copyrighted by Rock Island Lake Club 2025"
    },
    {
      "url": "https://www.cedarlakeclub.com/",
      "text": "The Cedar Lake Club | Private Golf Course | Clayville, NY - Home Home (315) 839-5838 Member Login Contact Home Member Login The Club Membership The Course Become A Member Guest Fees Club Policies Reciprocal Clubs Golf Instruction Junior Golf Activities & Leagues Men's League Ladies League Dining Grove Beach Events & Calendar Outside Events Club Calendar Contact Directions Contact & Directions Slide1 The Course Championship Golf • 4 Star Rating • Beautiful Views TOUR THE COURSE Slide2 Membership Private Club Membership has its privileges. Take the first step today. LEARN MORE Slide3 Golf Outings Professionally Run Golf Outings, Charity Events & Tournaments START HERE Slide4 Fun Activities We've got something for everyone. Truly a family-friendly atmosphere. CLUB CALENDAR Slide5 PGA Instruction Our Professional Staff is here to get your game in order. Open to everyone. LEARN MORE The Cedar Lake Club \"Excelling In The Private Country Club Experience\" The Cedar Lake Club plays host to one of the most beautiful and challenging 18 Hole golf courses in the Central New York region. Our member-owned facility is noted for its small, sloping greens and lush, fertile fairways. The club is operated by General Manager/Director of Golf Ryan McCarty, and maintained by Head Superintendent PJ Dugan. Cedar Lake has access to a natural, spring fed lake we utilize to ensure premium playing conditions year round. Our location provides the perfect ambiance for members and guests. It's just minutes away from Utica & Syracuse...but feels like a world away. When you become a member of The Cedar Lake Club, you join a family of people who love the game of golf and indulge in a superior level of staff service. On our private golf course, members and their guests have several dining options, social activities, and a private beach. Camping is also available, along with many outdoor activities for everyone. Be a World away. We invite you to join us today. What's Happening @ Cedar Lake? Golf Outings Are you looking for a great venue for your non-profit fundraiser or company outing? Learn More Membership Experience all the privileges our Private Golf Club has to offer our members. Learn More Private Events Enjoy exquisite cuisine & unparalleled panoramic views & of the lake & golf course. Learn More Activities We've got a lot more than just golf. Check out our Events Calendar today. Learn More Discover Herkimer County's Hidden Gem Considering Membership? Watch Our Video Excellent Golf. Full Service Private Club Amenities. One of the top vacation destinations in the beautiful Adirondack Mountain Region. This is truly a place where time seems to stand still. Who wouldn't want to live here? To be blessed to play golf on such a beautiful course as well...wow! Central New York's Best Kept Secret Membership Offerings Click Here Upcoming Events Fri, Sep 12,  9:00am : Birdies Fore Babies Golf Outing (course closed until 2pm) Sun, Sep 14,  8:30am : Ultimate Scramble Mon, Sep 15,  8:00am : Fall Aeration(Course Closed) Tue, Sep 16,  9:00am : Ladies TML Wed, Sep 17, 12:00am : Men's WNL Tue, Sep 23,  9:00am : Ladies TML Tue, Sep 30,  9:00am : Ladies TML View Full Calendar Recent News New Member Promotion New golf members who join Cedar Lake Club now will receive a 25% discount on their membership for each of the next 5 years. Contact Ray for details or click on the lick below. Click Here © The Cedar Lake Club • 382 Rider Road • Clayville, NY 13322 Tel: (315) 839-5838 • Contact • Sitemap • Website by: The RWM Company Follow via Facebook Follow on Instagram Contact Us Today! The Club Membership The Course Become A Member Guest Fees Club Policies Reciprocal Clubs Golf Instruction Junior Golf Activities & Leagues Men's League Ladies League Dining Grove Beach Events & Calendar Outside Events Club Calendar Contact Directions Contact & Directions The Cedar Lake Club 382 Rider Road Clayville, NY 13322 × × Club Calendar Check out all that's going on at Cedar Lake. You don't have to be a member for our open events! Click Here"
    },
    {
      "url": "https://www.leighoak.com.au/contact-us",
      "text": "Contact LeighOak Sports Club | Get in Touch Today | Leighoak Eat & Drink What's on Become a Member Bottle Shop Contact Opening Hours: 10AM - 4AM 7 DAYS A WEEK Phone: (03) 9569 9954 Book Now CONTACT US Click here to sign up for our free membership program and get access to discounted drink prices, specials, weekly members’ night with cash draws and our bottleshop. To make a booking or for further information, please contact: Phone (03) 9569 9954 Email leighoak.info@mvrc.net.au Address 1555 Dandenong Rd, Oakleigh VIC 3166 OPENING HOURS Monday 9:00am-5:00am Tuesday 9:00am-5:00am Wednesday 9:00am-5:00am Thursday 9:00am-5:00am Friday 9:00am-5:00am Saturday 9:00am-5:00am Sunday 10:00am-5:00am ‍ PARKING DETAILS Parking is available in our Leighoak Club car park on Dalgety St, right off of Dandenong Rd. Additionally, you can often find free street parking in the surrounding streets – but always check for permits and other parking restrictions. GETTING HERE Train The Oakleigh railway station (on the Dandenong/Pakenham line) is approximately 1 km south of the Leighoak Club. Bus There are several bus services close to Leighoak with regular stops on Dandenong Rd and Atkinson St, just 200m from the bus interchange. GET IN TOUCH WITH US TODAY CONTACT 1555 Dandenong Rd Oakleigh VIC 3166 Phone: (03) 9569 9954 Email: leighoak.info@mvrc.net.au HOURS 10AM - 4AM 7 DAYS A WEEK Full Name Email Phone Tell us more about your enquiry Select One... General Enquiry Book a Function Membership Careers Do you have an RSA? Yes No Upload Resume Type of function? How many people? By completing this form, I acknowledge that I have read, and I agree to the terms and conditions of the Moonee Valley Racecourse Privacy Policy I would like to receive communications from Moonee Valley Racecourse and their partners about campaigns, products, offers and initiatives Before you submit, please complete security check contact-us Thank you for getting in touch. We will be in contact soon. Error. It seems that something is missing. CONTACT US 1555 Dandenong Rd, Oakleigh VIC 3166 Phone: (03) 9569 9954 Email: leighoak.info@mvrc.net.au OPENING HOURS 10AM - 4AM 7 DAYS A WEEK RESPONSIBLE GAMBLING ‍ Gambler's Help Responsible Gambling Foundation Money Smart Privacy Policy Terms & Conditions Responsible Service of Gaming Careers OUR VENUES ‍‍ Junction Club Legends The Valley"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "text": "Staff | Clubhouse International Log in as: CLUBHOUSE COALITION FACULTY STARTUP Forgot password? Enter your email above and click here. To start a new Clubhouse Membership or re-activate a former Clubhouse Membership, click below: START NEW CLUBHOUSE MEMBERSHIP > Portal > Careers find a clubhouse Donate What We Do Our Impact Resources News + Stories About Us Get Involved Donate Overview What Clubhouses Do Advocacy Events Research Clubhouse Directory FAQ Overview About Mental Illness Clubhouse Outcomes ROI Financial Information Our Donors Corporate Partners Overview How Clubhouses Work Start a Clubhouse Accreditation Quality Standards Training Employment Articles News Clubhouse Tours Clubhouse Stories Member Stories Clubhouse International Videos Mission and History Our Organization Portal Privacy Policy Contact Us Overview Donate Monthly Giving Ways to Give Careers Become an Employer Sign Up Staff Clubhouse International’s staff members bring a wide range of experience and knowledge to the day-to-day operations of the organization. Sign up for news and updates Joel D. Corcoran, Executive Director and Chief Executive Officer Joel D. Corcoran Executive Director and Chief Executive Officer Joel D. Corcoran, M.Ed., is responsible for all of Clubhouse International's operations, programs, finances and communications. Joel has worked in the field of community mental health and psychiatric rehabilitation since 1981. Before assuming his position at Clubhouse International in 1995, his career included working at a large state psychiatric hospital, as a case manager, a residential director, a Clubhouse director and as an administrator in a multi-state mental health agency. He has been an advocate for state and national mental health services reform and for people living with mental illness to have a role in the design and evaluation of those services. Joel also has traveled extensively throughout the world, working to support the development and quality improvement of Clubhouse programs, helping them become strong and enduring resource centers for people living with mental illness. He has been an active advocate for quality services, dignified opportunities and full citizenship for people living with mental illness. He has worked with local, state, national and international governments, public and private health agencies, advocacy groups and educational institutions. In his role as the Executive Director of Clubhouse International, he has provided a system of training, Accreditation, technical assistance and consultation on local, state and national levels to government, family members, providers and consumer organizations interested in Clubhouse development. Jack Yatsko, Chief Operating Officer Jack Yatsko Chief Operating Officer Jack Yatsko has been with Clubhouse International since 2002, and his career in mental health spans 30 years. He began his Clubhouse career in Hawaii in 1989 at Friendship House, the first Clubhouse program in Hawaii. Jack works closely with our Training Bases and Faculty for Clubhouse development; helps develop new Clubhouses; and provides technical assistance to many existing Clubhouses and groups or individuals seeking to learn more about the Clubhouse Model. Jack continues to reside in Hawaii although his travels take him across the globe. He has a Master’s degree in Social Work from the University of Hawaii. Kelly Brockmeier, Chief Marketing Officer Kelly Brockmeier Chief Marketing Officer Kelly Brockmeier serves as Clubhouse International’s Chief Marketing Officer. In this role, she develops marketing/communications strategies that elevate the organization’s global visibility and brand presence while driving awareness of the incredible lifesaving work being done by Clubhouse communities across the globe. Prior to joining Clubhouse International, Kelly led marketing communications teams at two veteran service organizations, including Wounded Warrior Project (WWP). At WWP, she drove brand awareness strategies for the US-based nonprofit, with special attention focused on increasing awareness of the unique mental health needs of veterans. Kelly studied journalism at Florida State University where she received her bachelor’s degree. She worked in TV newsrooms across the state of Florida, eventually leading her own newsroom in Jacksonville. In 2019, Kelly earned her master’s degree in integrated marketing & communications from Northwestern University’s Medill School. She and her family reside just outside St. Augustine, FL. Sarah DeSouza Brown, Program Officer Sarah DeSouza Brown Program Officer Sarah DeSouza Brown worked at Genesis Club in Worcester, MA, USA for 11 years. She started as an Intern in the Membership Services Unit in her senior year of the Psychology program at Worcester State University. Shortly thereafter, she was hired as a Vocational Staff in the Career Development Unit to oversee the education and young adult initiatives. While helping to grow and develop the education and young adult programs' vision and funding, Sarah became the manager of those initiatives. Sarah earned her Master’s Degree in Rehabilitation Counseling from Assumption University in 2014 and was appointed as a board member for the Commission for Rehabilitation Counselor Certification (CRCC) to represent the student perspective in the Rehabilitation Counseling profession from 2013 to 2015. In 2021, she joined the Faculty for Clubhouse Development to support Clubhouses via accreditation and consultation. Driven by her passion for the Clubhouse model of rehabilitation and for the growth and expansion of Clubhouse programs around the world, Sarah looks forward to joining Clubhouse International as a Program Officer. Sarah is originally from Brazil and has been living in Massachusetts, USA since she moved there with her family in 1995. She enjoys the opportunity to travel and immerse herself into new cultures and especially treasures trips to Brazil to visit her family. Sarah is the mom of a toddler and “dog-mom” of a shihtzu named Charlie Brown. Together with her husband, they look forward to warmer New England days to enjoy the outdoors together! Teri Chadwick, Director of Development Teri Chadwick Director of Development Teri Chadwick joined Clubhouse International in early 2018 and has overall responsibility for fundraising growth. In her role, she works closely with the Board of Directors to engage and expand support from individuals, corporations and foundations. She also works with the Clubhouse team to promote and market Clubhouse International around the world. Teri brings extensive experience in fundraising, marketing and organizational development from her career as a nonprofit professional in St. Louis, Missouri USA, where she has held chief executive, marketing and development roles for national and international organizations. You can connect with Teri on LinkedIn at www.linkedin.com/terichadwick . Teri earned a B.S. in Magazine Journalism from the University of Florida and an M.S. in Organizational Leadership Quinnipiac University. She’s held her CFRE (Certified Fundraising Executive) certification since 2004. Teri is an avid reader, and enjoys hiking and snowboarding with her husband Ken and their dog Routt. “ Even if you’re on the right track, you’ll get run over if you just sit there. ” — Will Rogers Casey Edmonds, Project Officer, South Carolina Clubhouse Expansion Project Casey Edmonds Project Officer, South Carolina Clubhouse Expansion Project Casey has over 15 years of experience in the non-profit and for-profit sectors, working in senior level roles in corporate wellness, clinical and behavioral health, community management, public policy and consulting. She is a member of NAMI Greenville and serves on the regional board of NPCA. Casey holds certifications as an International Project Manager, Community Development Delivery Professional and ESG expert. With a degree in Public Health-Health Sciences from Furman University, Casey has conducted an Independent Study in community health, and has edited and published over 500 online articles. As Project Officer, South Carolina Clubhouse Expansion Project, Casey is charged with the establishment of the Clubhouse Coalition in South Carolina, as well as the promotion and expansion of accredited Clubhouses. Casey’s work will focus on education, advocacy and engagement of the direct community and key stakeholders to ensure the mission, research and people of Clubhouses across the globe are visible and used as an instrument of hope and innovation and inspiration for the Carolina community. Lee Kellogg, Program Officer Lee Kellogg Program Officer Lee Kellogg works closely with the other program officers in supporting Clubhouse Accreditation, Training, and Clubhouse Development. He received his B.S. from Michigan State University and his M.A. from Goddard College. Lee started his career at Thresholds in Chicago, first as a job coach and then as the Vocational Team Leader. Lee spent the next 17 years as the director of Genesis House in Michigan until he started with Clubhouse International in the fall of 2015. During his Genesis House years, Lee was very active in leading the Michigan Clubhouse Coalition and was also a member of the Clubhouse International Advisory Council. Anita Brix Lambaek, European Program Officer Anita Brix Lambaek European Program Officer Anita Brix Lambaek has been on the staff of Clubhouse International since October 2015. Anita works closely with the European Clubhouses to strengthen their quality through Accreditation. Before joining Clubhouse International, Anita started her work with Clubhouses back in 2007, when she was hired as a staff member in Kildehuset- Fountain House in Aalborg. In 2010 she became involved with the start-up of a Clubhouse in Frederikshavn, Denmark in 2010 and became Director of the Clubhouse in 2012. Anita has been involved with the Danish Clubhouse Coalition as a board member since 2011. Anita holds an M.A degree in Public Administration from Aalborg University and a B.A in Nutrition and Health from Aarhus University. Anita is married and she and her husband have three children. They enjoy spending time with their small breed of Icelandic Horses. Anna Sackett Rountree, Director of Communications Anna Sackett Rountree Director of Communications As Director of Communications, Anna is responsible for representing and amplifying the impact of Clubhouse International. Anna drives public awareness and engagement by managing strategy and tactics for print and digital communications campaigns; curating and managing social media and website content; and leveraging organizational activities and events to elevate Clubhouse International’s story. Anna is committed to advancing the voices of people living with mental illness by helping build the Clubhouse International brand and expanding its resources. Anna was selected as a Hilton scholar as part of a special initiative for social change leaders working at a Conrad N. Hilton Foundation's Hilton Prize Laureate organization. Click here for more. In her previous role as Development Officer at Clubhouse International, Anna was instrumental in developing and implementing initiatives and events to grow constituency, meet financial goals, influence key stakeholders, and build partnerships with global mental health advocates. Anna brings experience in the field of human rights, writing and editing. She has worked as an Associate Producer at CBS/60 Minutes, as an Assistant Human Rights Officer at the United Nations, where she wrote analytical reports on human rights resolutions, and as an Editor at the International Rescue Committee where she wrote and edited the Governance and Rights Sector Framework. Anna holds a M.A. degree in International Affairs from New School University, and a B.A. in Political Science with a double minor in French and International Relations from Binghamton University. Anna enjoys reading, traveling and spending time with her family and friends. Liz Smith, Development Manager Liz Smith Development Manager As Development Manager, Liz Smith provides fundraising support to advance and expand Clubhouse International's mission. Liz is passionate about the power of philanthropy to create meaningful social change and foster community impact. Liz brings extensive experience in nonprofit development and operations, having worked with organizations of diverse sizes, missions, and geographic reach. Liz began her career in the arts and holds a BA in Dance and Nonprofit Management from Dean College in Franklin, MA, USA. Liz has been a CNP (Certified Nonprofit Professional) since 2024. Liz is a military spouse and has lived in various regions across the United States. Originally from Northern New York, Liz currently resides with her family outside Kansas City. She enjoys volunteering within the military community, exploring the local area, and spending time with her family and friends. Mike Tibbles, Program Officer Mike Tibbles Program Officer In his role at Clubhouse International, Mike supports accreditation visits, training, and new Clubhouse development. Grounded in his own journey of mental health recovery, Mike draws on more than a decade of Clubhouse experience, including service as Executive Director of Connections Place in Victoria, BC, Canada and as Program Manager of Pathways Clubhouse in Richmond, British Columbia. Since 2021 he has also served on the Faculty for Clubhouse Development, consulting with Clubhouses worldwide to strengthen quality and fidelity to the Model. Earlier in his career, Mike spent over ten years in human resources leadership, guiding teams of HR professionals and supporting thousands of employees across retail, hospitality, and aviation businesses. A Chartered Professional in Human Resources (CPHR), he is known for clear communication, respectful collaboration, and a steady focus on inclusive workplaces. Originally from Northern Canada and now settled amid the coastal mountains of British Columbia’s Lower Mainland, Mike is an avid reader who loves to travel. In his free time, Mike enjoys pausing for coffee and good conversation with friends. Amber Weber, Employment Program Officer Amber Weber Employment Program Officer Amber Weber is a social service worker for the state of Utah with more than 20 years of professional experience working with people with mental illness. Ms. Weber earned her BSW in Social Work from the University of Utah. She was the Associate Director for five years and acted as the interim Executive Director twice in her tenure at Alliance House in Salt Lake City. Prior to that, she worked for eight years as the Alliance House Transitional Employment coordinator and has trained staff and Clubhouse members from over 30 Clubhouses internationally through the comprehensive colleague training program at Alliance House. Since 2010, Amber has been a member of the Clubhouse International faculty, accrediting and consulting with Clubhouses worldwide to provide fully realized evidence-based Clubhouse Model approaches. She was recruited as the Executive Director in July 2019 by the Summit County Clubhouse Board of Directors to establish the newest Clubhouse in Utah, Summit County Clubhouse, in Park City, Utah Amber is very excited for her next adventure with Clubhouse International as the Employment Program Officer. Awards + Recognition Get involved and make a difference. DONATE Our Work About Mental Illness What Clubhouses Do Mental Health Advocacy Clubhouse Outcomes Clubhouse FAQ Resources Articles Library Community Clubhouse Directory Careers Get Involved Become a Corporate Partner Employ a Member Open a Clubhouse Donate Organization Mission and History Organization Gift Acceptance Policy Privacy Policy Contact Sign up for news and updates Connect: (c) 2025 Clubhouse International Home Find a Clubhouse What We Do Overview What Clubhouses Do Advocacy Events Research Clubhouse Directory FAQ Our Impact Overview About Mental Illness Clubhouse Outcomes ROI Financial Information Our Donors Corporate Partners Resources Overview How Clubhouses Work Start a Clubhouse Accreditation Quality Standards Training Employment Articles News + Stories News Clubhouse Tours Clubhouse Stories Member Stories Clubhouse International Videos About Us Mission and History Our Organization Portal Privacy Policy Contact Us Get Involved Overview Donate Monthly Giving Ways to Give Careers Become an Employer Sign Up Donate Translate »"
    },
    {
      "url": "https://clublakevenue.com/fall-festival/",
      "text": "Fall Festival - Club Lake Venue Skip to content Club Lake Venue Where rustic marries elegance Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Club Lake's annual fall festival Activities Our activities this year will include, but not limited to, two hayrides,* corn maze, toddler maze, pumpkin patch, Country Store, play structures, high strikers, football area, basketball area, The Cow Wash, and much more! Pumpkin chunkin’ and tennis ball launching from an air cannon are also available. * Please note that hayrides are available on scheduled times on Fridays and all day Saturdays & Sundays. Hours Our 2025 Fall Festival will be open 4 days a week. Thursdays, Fridays, Saturdays, and Sundays we will be open from 10am – 6pm. The play/activity area will close at 5pm. The Country Store and Pumpkin Patch will remain open until 6pm. We will be CLOSED MONDAY – WEDNESDAY! 2025 Fall Festival Dates: September 27th – October 31st. **If inclement weather is upon CL, we reserve the right to shut down activities and if necessary stop all operations completely… with no notification.** join the fun Pricing $18.95 Per Person Per Day (Hayrides will be available on Fridays at scheduled times) Infants are FREE (We ask ‘if the child can walk and play’ to PLEASE pay) **Watch and Listen For Special Pricing** DISCOUNTS We offer group discounted rates at $1.00 off regular admission price per ticket. Group reservations are needed at least 48 hours in advance and must be paid in advance. For group rates there must be a minimum of 20 paying guests. Arrangements and payment must be made by only one person representing the entire group. Military discount per family is 10% off admission price. Discount is for up to 5 people. All participants must be present with person bearing ID at time of entry. Everyone must purchase a general admission wristband to enter the back of the farm where all the activities are located. Even if you do not want to participate in the activities you will need to purchase an admission wristband. THE PUMPKIN PATCH AND THE COUNTRY STORE ARE ALWAYS FREE TO COME INTO! Note : All participants must be present with person bearing military ID at time of entry for discount to apply. Parking Club Lake will provide free and safe parking for all of our guests. REMEMBER: THE PUMPKIN PATCH AND THE COUNTRY STORE ARE ALWAYS FREE TO COME INTO SO PUMPKINS CAN BE PURCHASED AND WHAT A GREAT PHOTO OP THE PUMPKIN PATCH IS!!! Frequently asked questions WHAT DOES THE ADMISSION PRICE INCLUDE? When you pay the admission fee you are entitled to unlimited hay rides, use of play structures, unlimited entrances to the corn maze, toddler maze, duck races, play structures, football and basketball areas and more. ARE THERE ANY ADDITIONAL COSTS ONCE I PAY FOR ADMISSION? Yes. All items at the concession stand are available. Pumpkins for chunkin’ and tennis balls for launching are available. WE RANDOMLY GIVE THESE PUMPKINS AND/OR TENNIS BALLS OUT FOR FREE…MAYBE YOU WILL BE A LUCKY ONE! Vendors will sell their own items. WHAT IS THE REFUND POLICY? Tickets are non-refundable. Club Lake 3403 Rock Springs Road Apopka, Florida 32712 TEL: 407-886-1077 EMAIL: fallfestival@clublakevenue.com Contact Us find your way around Home About Us Weddings + Events Explore Club Lake FAQs Contact Us Home About Us Weddings + Events Explore Club Lake FAQs Contact Us gallery @2023 Club Lake VENUE, ALL RIGHTS RESERVED SITE DESIGN BY DAVEY & KRISTA + Club Lake VENUE find us elsewhere find your way around Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. Home I. About Us II. Weddings + Events III. Fall Festival IV. Lodging & Travel V. Contact Us VI. find us elsewhere"
    }
  ]
}