{
  "fuentes": [
    {
      "url": "https://clubfiftyone.co.uk/contact/",
      "email": "enquiries@clubfiftyone.co.ek"
    },
    {
      "url": "https://clubfiftyone.co.uk/contact/",
      "email": "enquiries@clubfiftyone.co.uk"
    },
    {
      "url": "https://club45usa.com/our-board/",
      "email": "larry@club47usa.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "abrix@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "asackett@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "aweber@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "esmith@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "jyatsko@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "lkellogg@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "sbrown@clubhouse-intl.org"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "email": "tchadwick@clubhouse-intl.org"
    },
    {
      "url": "https://www.club51palmcoast.org/contact",
      "email": "club51palmcoast@outlook.com"
    },
    {
      "url": "https://www.club51palmcoast.org/contact",
      "email": "clubscopc@outlook.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "vip@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "boats@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "dining@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "eservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "events@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reception@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.alliancesafeoregon.org/staff-and-board",
      "email": "info@oralliance.org"
    }
  ],
  "mails": [
    "abrix@clubhouse-intl.org",
    "asackett@clubhouse-intl.org",
    "aweber@clubhouse-intl.org",
    "boats@palmtreeclubmiami.com",
    "club51palmcoast@outlook.com",
    "clubscopc@outlook.com",
    "dining@palmtreeclubmiami.com",
    "enquiries@clubfiftyone.co.ek",
    "enquiries@clubfiftyone.co.uk",
    "eservations@palmtreeclubmiami.com",
    "esmith@clubhouse-intl.org",
    "events@palmtreeclubmiami.com",
    "forms@tambourine.com",
    "gabe@journeysherwood.org",
    "info@journeysherwood.org",
    "info@oralliance.org",
    "jyatsko@clubhouse-intl.org",
    "larry@club47usa.com",
    "leadershipboard@journeysherwood.org",
    "lkellogg@clubhouse-intl.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "reception@palmtreeclubmiami.com",
    "reservations@palmtreeclubmiami.com",
    "sbrown@clubhouse-intl.org",
    "scott@journeysherwood.org",
    "tchadwick@clubhouse-intl.org",
    "vip@palmtreeclubmiami.com"
  ],
  "nombre_sitio": "club51palmcoast.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clubfiftyone.co.uk/contact/",
      "text": "Contact Club 51 | Apply For Membership in Marylebone London Intelligent Fitness Contact Home Studio About Blog Shop Contact Home Studio About Blog Shop Contact Apply For Membership Drop Us A Message! Get in touch today to start your life changing journey! Drop Us A Message! Get in touch today to start your life changing journey! Name Email Phone Number How Did You Hear About Us? Message Submit Your Enquiry! Location 51 New Cavendish Street, London, W1G 9TG Hours Open Daily: 6am to 9pm By Appointment Only\nApply Today! Contact +44 (0)203 982 3856 enquiries@clubfiftyone.co.uk Socials Instagram Facebook LinkedIn X Email Subscribe to our Newsletter! How To Find Us 51 New Cavendish Street, London, W1G 9TG Club 51’s flagship Marylebone studio is easily accessible via the Bakerloo Line or the Jubilee Line. Take either line to Bond Street Station, exit and head northwest on Oxford Street until you reach New Cavendish Street. Turn right onto New Cavendish Street, and you’ll find our studio at number 51. “When I started working with Jon I could do only 9 press-ups, but since working on my core strength and lower back I can now do more than 100 in a session.” Natasha Bedingfield Award Winning Singer & Songwriter \"Jon is not just one of the best fitness trainers I have ever had but also the best educator and motivator to make sure you get the best out of your body.\" Jo Wood Media Personality & Entrepreneur \"Jon has been an inspirational force for me. With a mixture of interval training as well as strength and conditioning exercise, I have noticed my body to be firmer, stronger and leaner.\" Whitney Port Television Personality & Fashion Designer “When I started working with Jon I could do only 9 press-ups, but since working on my core strength and lower back I can now do more than 100 in a session.” Natasha Bedingfield Award Winning Singer & Songwriter \"Jon is not just one of the best fitness trainers I have ever had but also the best educator and motivator to make sure you get the best out of your body.\" Jo Wood Media Personality & Entrepreneur \"Jon has been an inspirational force for me. With a mixture of interval training as well as strength and conditioning exercise, I have noticed my body to be firmer, stronger and leaner.\" Whitney Port Television Personality & Fashion Designer Rent Our Gym Studio Our premium fitness studio in Marylebone is available to hire for private use, both on an hourly or daily basis. Our premium fitness studio in Marylebone is available to hire for private use, both on an hourly or daily basis. Get In Touch Copyright © 2025 Intelligent Fitness | Powered by Big Picture Web | Design by Go Up Privacy Policy | Terms of Use | SiteMap"
    },
    {
      "url": "https://club45usa.com/our-board/",
      "text": "OUR BOARD | Club 47 USA larry@club47usa.com HOME SIGN UP ABOUT US OUR BOARD EVENTS GALLERY CONTACT US Select Page OUR BOARD MEMBERS \"Make American Great Again\" Larry Snowden (President) A co-founder of Club 47 USA, club President Larry Snowden is a twenty two year member of the Palm Beach County Republican Executive Committee and served as a Board Member of the Palm Beach County Republican Party from 2009 through 2022. From 2016 through 2021 Larry served as the coordinator and lead driver of the volunteer driver team for President Donald Trump’s Presidential Motorcade in Palm Beach County. Larry has worked as an advisor and volunteer for many Republican campaigns. He previously served as President of the Allen West for Congress 2012 campaign and was President and CEO of the Allen West Foundation. A Trump supporter from the very beginning, Larry supported his wife, Sue in her role as Chair of the 2016 Donald Trump for President Campaign in Palm Beach County.  Larry is a recipient of the Republican Party Jean Pipes award for volunteerism. Prior to political involvement, Snowden had a forty two year career as a sales executive in the wireless communications field. Thirty two of those years were spent as an executive with Motorola, Inc. Snowden retired in 2011 as a Vice President of Sales for a large wireless products distributor. Linda Stoch (Vice President) Linda Stoch is a grassroots Republican activist in Palm Beach County.  Linda is a member of the Board of Directors of the Republican Party of Palm Beach County and serves as the Event Chair.  Linda served as Vice Chair for Donald J Trump for President 2016 PBC and has worked on many Republican Presidential, Gubernatorial, Senate, Congressional and Local City Council Campaigns.  Linda was an Alternate Delegate at the 2016 Republican Convention. Linda has served as part of the Presidential Advanced Air Force One Arrival Team 2017 – Present; was the 2015 Recipient of the Jean Pipes Award given by the Republican Party of Palm Beach County for Volunteer Service. Linda is a co-founder of the Palm Beach County Chapter of the Carson Scholars Fund that has placed Dr. Ben Carson Reading Rooms in Palm Beach County Public and Charter Schools creating a literacy enriched environment for children to develop their reading skills. Linda has resided in Palm Beach County since 1981 and is a Small Business owner of Innovative Interiors by Linda.  She is a Wife, Mother and Grandmother. Linda is an American Citizen by Choice and is proud to be living in the United States the greatest Country on Earth … God Bless America! Sue Snowden (Secretary-Treasurer) Sue Snowden has been volunteering in Republican politics for over 40 years. She was the Palm Beach County Chair of the Trump for President Campaign in 2015-2016 and has been a Palm Beach Co. Republican Party Committeewoman for 25 years. For four years while Donald Trump was President, Sue assisted the Presidential Advance Team with the “Friends and Family” welcoming of the President on Air Force One on the tarmac. Sue is a Vice President of the Boca Raton Regional Republican Club and Treasurer of Club 47 USA. Sue represented Florida as an Alternate Delegate to the Republican National Convention in 2016 and represented Florida as Delegate in 2020. Sue has been managing Republican campaign “victory” offices for many years, and was the Volunteer Director and in charge of the campaign office operations for the Allen West for Congress Campaign. Sue was awarded the Palm Beach County Republican Party “Jean Pipes” award in 2009, the Great Republican Volunteer Award” in 2014 by the Republican Party of Florida, and in 2020 Sue and her husband, Larry, received a contribution and dedication award from the Republican Party of Palm Beach County. Sue Snowden has been married to Larry Snowden for 50 years. Facebook © 2025 Club 47 USA, Inc., not affiliated with, authorized, endorsed, or sponsored by Donald J. Trump for President Inc. or any of its affiliates."
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://clubhouse-intl.org/about-us/organization/staff/",
      "text": "Staff | Clubhouse International Log in as: CLUBHOUSE COALITION FACULTY STARTUP Forgot password? Enter your email above and click here. To start a new Clubhouse Membership or re-activate a former Clubhouse Membership, click below: START NEW CLUBHOUSE MEMBERSHIP > Portal > Careers find a clubhouse Donate What We Do Our Impact Resources News + Stories About Us Get Involved Donate Overview What Clubhouses Do Advocacy Events Research Clubhouse Directory FAQ Overview About Mental Illness Clubhouse Outcomes ROI Financial Information Our Donors Corporate Partners Overview How Clubhouses Work Start a Clubhouse Accreditation Quality Standards Training Employment Articles News Clubhouse Tours Clubhouse Stories Member Stories Clubhouse International Videos Mission and History Our Organization Portal Privacy Policy Contact Us Overview Donate Monthly Giving Ways to Give Careers Become an Employer Sign Up Staff Clubhouse International’s staff members bring a wide range of experience and knowledge to the day-to-day operations of the organization. Sign up for news and updates Joel D. Corcoran, Executive Director and Chief Executive Officer Joel D. Corcoran Executive Director and Chief Executive Officer Joel D. Corcoran, M.Ed., is responsible for all of Clubhouse International's operations, programs, finances and communications. Joel has worked in the field of community mental health and psychiatric rehabilitation since 1981. Before assuming his position at Clubhouse International in 1995, his career included working at a large state psychiatric hospital, as a case manager, a residential director, a Clubhouse director and as an administrator in a multi-state mental health agency. He has been an advocate for state and national mental health services reform and for people living with mental illness to have a role in the design and evaluation of those services. Joel also has traveled extensively throughout the world, working to support the development and quality improvement of Clubhouse programs, helping them become strong and enduring resource centers for people living with mental illness. He has been an active advocate for quality services, dignified opportunities and full citizenship for people living with mental illness. He has worked with local, state, national and international governments, public and private health agencies, advocacy groups and educational institutions. In his role as the Executive Director of Clubhouse International, he has provided a system of training, Accreditation, technical assistance and consultation on local, state and national levels to government, family members, providers and consumer organizations interested in Clubhouse development. Jack Yatsko, Chief Operating Officer Jack Yatsko Chief Operating Officer Jack Yatsko has been with Clubhouse International since 2002, and his career in mental health spans 30 years. He began his Clubhouse career in Hawaii in 1989 at Friendship House, the first Clubhouse program in Hawaii. Jack works closely with our Training Bases and Faculty for Clubhouse development; helps develop new Clubhouses; and provides technical assistance to many existing Clubhouses and groups or individuals seeking to learn more about the Clubhouse Model. Jack continues to reside in Hawaii although his travels take him across the globe. He has a Master’s degree in Social Work from the University of Hawaii. Kelly Brockmeier, Chief Marketing Officer Kelly Brockmeier Chief Marketing Officer Kelly Brockmeier serves as Clubhouse International’s Chief Marketing Officer. In this role, she develops marketing/communications strategies that elevate the organization’s global visibility and brand presence while driving awareness of the incredible lifesaving work being done by Clubhouse communities across the globe. Prior to joining Clubhouse International, Kelly led marketing communications teams at two veteran service organizations, including Wounded Warrior Project (WWP). At WWP, she drove brand awareness strategies for the US-based nonprofit, with special attention focused on increasing awareness of the unique mental health needs of veterans. Kelly studied journalism at Florida State University where she received her bachelor’s degree. She worked in TV newsrooms across the state of Florida, eventually leading her own newsroom in Jacksonville. In 2019, Kelly earned her master’s degree in integrated marketing & communications from Northwestern University’s Medill School. She and her family reside just outside St. Augustine, FL. Sarah DeSouza Brown, Program Officer Sarah DeSouza Brown Program Officer Sarah DeSouza Brown worked at Genesis Club in Worcester, MA, USA for 11 years. She started as an Intern in the Membership Services Unit in her senior year of the Psychology program at Worcester State University. Shortly thereafter, she was hired as a Vocational Staff in the Career Development Unit to oversee the education and young adult initiatives. While helping to grow and develop the education and young adult programs' vision and funding, Sarah became the manager of those initiatives. Sarah earned her Master’s Degree in Rehabilitation Counseling from Assumption University in 2014 and was appointed as a board member for the Commission for Rehabilitation Counselor Certification (CRCC) to represent the student perspective in the Rehabilitation Counseling profession from 2013 to 2015. In 2021, she joined the Faculty for Clubhouse Development to support Clubhouses via accreditation and consultation. Driven by her passion for the Clubhouse model of rehabilitation and for the growth and expansion of Clubhouse programs around the world, Sarah looks forward to joining Clubhouse International as a Program Officer. Sarah is originally from Brazil and has been living in Massachusetts, USA since she moved there with her family in 1995. She enjoys the opportunity to travel and immerse herself into new cultures and especially treasures trips to Brazil to visit her family. Sarah is the mom of a toddler and “dog-mom” of a shihtzu named Charlie Brown. Together with her husband, they look forward to warmer New England days to enjoy the outdoors together! Teri Chadwick, Director of Development Teri Chadwick Director of Development Teri Chadwick joined Clubhouse International in early 2018 and has overall responsibility for fundraising growth. In her role, she works closely with the Board of Directors to engage and expand support from individuals, corporations and foundations. She also works with the Clubhouse team to promote and market Clubhouse International around the world. Teri brings extensive experience in fundraising, marketing and organizational development from her career as a nonprofit professional in St. Louis, Missouri USA, where she has held chief executive, marketing and development roles for national and international organizations. You can connect with Teri on LinkedIn at www.linkedin.com/terichadwick . Teri earned a B.S. in Magazine Journalism from the University of Florida and an M.S. in Organizational Leadership Quinnipiac University. She’s held her CFRE (Certified Fundraising Executive) certification since 2004. Teri is an avid reader, and enjoys hiking and snowboarding with her husband Ken and their dog Routt. “ Even if you’re on the right track, you’ll get run over if you just sit there. ” — Will Rogers Casey Edmonds, Project Officer, South Carolina Clubhouse Expansion Project Casey Edmonds Project Officer, South Carolina Clubhouse Expansion Project Casey has over 15 years of experience in the non-profit and for-profit sectors, working in senior level roles in corporate wellness, clinical and behavioral health, community management, public policy and consulting. She is a member of NAMI Greenville and serves on the regional board of NPCA. Casey holds certifications as an International Project Manager, Community Development Delivery Professional and ESG expert. With a degree in Public Health-Health Sciences from Furman University, Casey has conducted an Independent Study in community health, and has edited and published over 500 online articles. As Project Officer, South Carolina Clubhouse Expansion Project, Casey is charged with the establishment of the Clubhouse Coalition in South Carolina, as well as the promotion and expansion of accredited Clubhouses. Casey’s work will focus on education, advocacy and engagement of the direct community and key stakeholders to ensure the mission, research and people of Clubhouses across the globe are visible and used as an instrument of hope and innovation and inspiration for the Carolina community. Lee Kellogg, Program Officer Lee Kellogg Program Officer Lee Kellogg works closely with the other program officers in supporting Clubhouse Accreditation, Training, and Clubhouse Development. He received his B.S. from Michigan State University and his M.A. from Goddard College. Lee started his career at Thresholds in Chicago, first as a job coach and then as the Vocational Team Leader. Lee spent the next 17 years as the director of Genesis House in Michigan until he started with Clubhouse International in the fall of 2015. During his Genesis House years, Lee was very active in leading the Michigan Clubhouse Coalition and was also a member of the Clubhouse International Advisory Council. Anita Brix Lambaek, European Program Officer Anita Brix Lambaek European Program Officer Anita Brix Lambaek has been on the staff of Clubhouse International since October 2015. Anita works closely with the European Clubhouses to strengthen their quality through Accreditation. Before joining Clubhouse International, Anita started her work with Clubhouses back in 2007, when she was hired as a staff member in Kildehuset- Fountain House in Aalborg. In 2010 she became involved with the start-up of a Clubhouse in Frederikshavn, Denmark in 2010 and became Director of the Clubhouse in 2012. Anita has been involved with the Danish Clubhouse Coalition as a board member since 2011. Anita holds an M.A degree in Public Administration from Aalborg University and a B.A in Nutrition and Health from Aarhus University. Anita is married and she and her husband have three children. They enjoy spending time with their small breed of Icelandic Horses. Anna Sackett Rountree, Director of Communications Anna Sackett Rountree Director of Communications As Director of Communications, Anna is responsible for representing and amplifying the impact of Clubhouse International. Anna drives public awareness and engagement by managing strategy and tactics for print and digital communications campaigns; curating and managing social media and website content; and leveraging organizational activities and events to elevate Clubhouse International’s story. Anna is committed to advancing the voices of people living with mental illness by helping build the Clubhouse International brand and expanding its resources. Anna was selected as a Hilton scholar as part of a special initiative for social change leaders working at a Conrad N. Hilton Foundation's Hilton Prize Laureate organization. Click here for more. In her previous role as Development Officer at Clubhouse International, Anna was instrumental in developing and implementing initiatives and events to grow constituency, meet financial goals, influence key stakeholders, and build partnerships with global mental health advocates. Anna brings experience in the field of human rights, writing and editing. She has worked as an Associate Producer at CBS/60 Minutes, as an Assistant Human Rights Officer at the United Nations, where she wrote analytical reports on human rights resolutions, and as an Editor at the International Rescue Committee where she wrote and edited the Governance and Rights Sector Framework. Anna holds a M.A. degree in International Affairs from New School University, and a B.A. in Political Science with a double minor in French and International Relations from Binghamton University. Anna enjoys reading, traveling and spending time with her family and friends. Liz Smith, Development Manager Liz Smith Development Manager As Development Manager, Liz Smith provides fundraising support to advance and expand Clubhouse International's mission. Liz is passionate about the power of philanthropy to create meaningful social change and foster community impact. Liz brings extensive experience in nonprofit development and operations, having worked with organizations of diverse sizes, missions, and geographic reach. Liz began her career in the arts and holds a BA in Dance and Nonprofit Management from Dean College in Franklin, MA, USA. Liz has been a CNP (Certified Nonprofit Professional) since 2024. Liz is a military spouse and has lived in various regions across the United States. Originally from Northern New York, Liz currently resides with her family outside Kansas City. She enjoys volunteering within the military community, exploring the local area, and spending time with her family and friends. Mike Tibbles, Program Officer Mike Tibbles Program Officer In his role at Clubhouse International, Mike supports accreditation visits, training, and new Clubhouse development. Grounded in his own journey of mental health recovery, Mike draws on more than a decade of Clubhouse experience, including service as Executive Director of Connections Place in Victoria, BC, Canada and as Program Manager of Pathways Clubhouse in Richmond, British Columbia. Since 2021 he has also served on the Faculty for Clubhouse Development, consulting with Clubhouses worldwide to strengthen quality and fidelity to the Model. Earlier in his career, Mike spent over ten years in human resources leadership, guiding teams of HR professionals and supporting thousands of employees across retail, hospitality, and aviation businesses. A Chartered Professional in Human Resources (CPHR), he is known for clear communication, respectful collaboration, and a steady focus on inclusive workplaces. Originally from Northern Canada and now settled amid the coastal mountains of British Columbia’s Lower Mainland, Mike is an avid reader who loves to travel. In his free time, Mike enjoys pausing for coffee and good conversation with friends. Amber Weber, Employment Program Officer Amber Weber Employment Program Officer Amber Weber is a social service worker for the state of Utah with more than 20 years of professional experience working with people with mental illness. Ms. Weber earned her BSW in Social Work from the University of Utah. She was the Associate Director for five years and acted as the interim Executive Director twice in her tenure at Alliance House in Salt Lake City. Prior to that, she worked for eight years as the Alliance House Transitional Employment coordinator and has trained staff and Clubhouse members from over 30 Clubhouses internationally through the comprehensive colleague training program at Alliance House. Since 2010, Amber has been a member of the Clubhouse International faculty, accrediting and consulting with Clubhouses worldwide to provide fully realized evidence-based Clubhouse Model approaches. She was recruited as the Executive Director in July 2019 by the Summit County Clubhouse Board of Directors to establish the newest Clubhouse in Utah, Summit County Clubhouse, in Park City, Utah Amber is very excited for her next adventure with Clubhouse International as the Employment Program Officer. Awards + Recognition Get involved and make a difference. DONATE Our Work About Mental Illness What Clubhouses Do Mental Health Advocacy Clubhouse Outcomes Clubhouse FAQ Resources Articles Library Community Clubhouse Directory Careers Get Involved Become a Corporate Partner Employ a Member Open a Clubhouse Donate Organization Mission and History Organization Gift Acceptance Policy Privacy Policy Contact Sign up for news and updates Connect: (c) 2025 Clubhouse International Home Find a Clubhouse What We Do Overview What Clubhouses Do Advocacy Events Research Clubhouse Directory FAQ Our Impact Overview About Mental Illness Clubhouse Outcomes ROI Financial Information Our Donors Corporate Partners Resources Overview How Clubhouses Work Start a Clubhouse Accreditation Quality Standards Training Employment Articles News + Stories News Clubhouse Tours Clubhouse Stories Member Stories Clubhouse International Videos About Us Mission and History Our Organization Portal Privacy Policy Contact Us Get Involved Overview Donate Monthly Giving Ways to Give Careers Become an Employer Sign Up Donate Translate »"
    },
    {
      "url": "https://www.club51palmcoast.org/contact",
      "text": "CONTACT | Club 51 top of page HOME ACTIVITIES CALENDAR UPCOMING EVENTS PAST EVENTS MEMBERSHIP CONTACT MENU MORE MEMBERS ABOUT US Location 51 N Old Kings Rd, Palm Coast, FL 32137 Phone (386) 446-5632 CONTACT AND LOCATION Address 51 N Old Kings Rd, Palm Coast, FL 32137 Parking is available on site Contact Us Today! Tel: 386 446-5632 Email: club51palmcoast@outlook.com GET IN TOUCH Thanks for submitting! STAY UP TO DATE Subscribe to get exclusive updates Email * Join Our Mailing List I want to subscribe to your mailing list. Club 51 at Social Club of Palm Coast ©2025  PROUDLY CREATED by Pineiro Marketing Group, Inc. bottom of page"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "text": "Contact Us | Palm Tree Club Miami Skip to Content Palm Tree Club Miami (305) 865-7100 Rooms & Suites Offers Live Events Restaurant Happenings Our Neighborhood Gallery About Us Book Now Connect With Palm Tree Club Let’s Hear From You! Palm Tree Club Miami 1819 79th Street Causeway North Bay Village, FL 33141 Hotel Phone: 305-865-7100 Front Desk Inquiries: reception@palmtreeclubmiami.com Reservations: r eservations@palmtreeclubmiami.com Restaurant Phone: 786-204-1366 Email: dining@palmtreeclubmiami.com Marina Email: boats@palmtreeclubmiami.com Radio Channel: #71 Live Events Email: VIP@palmtreeclubmiami.com Thank you for reaching out! We will be in touch shortly. First Name * Last Name * Email Address * Comments Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit FREQUENTLY ASKED QUESTIONS Live Music & Events What time does the live music start? Doors open at 3 PM. Is there a cover charge for guests to enjoy the live music? Only for ticketed events. Get your tickets on Posh: https://posh.vip/g/ptc-miami . Do I need a reservation to see the live music? Not unless it's a ticketed event. How long does the live music performance last? Sunset parties typically go until 12 AM. Is the music indoors or outdoors? Both. Do you have a schedule or calendar for upcoming live music performances? Yes! Be sure to check our socials and website for more details: www.palmtreeclubmiami.com . Do you offer special deals or promotions? For offers and experiences, check our OpenTable: Palm Tree Club Miami Restaurant - North Bay Village, FL | OpenTable . Are there specific days or nights dedicated to live music? Typically Saturdays and Sundays, but please check our website for more details! What time will the DJs perform at the events we've published? Stay tuned to our social media for updates on set times. What’s the dress code for events? Come as you are—sneakers, flip-flops, heels, sequins, or bikini tops. Feel free to wear jeans, shorts, or even your suit (but we hope you lose the tie). Hotel General Information Is there a minimum age to check in? Yes, guests must be 21 years or older to check-in and will be required to present a valid photo ID, in addition to their method of payment. What time is check-in and check-out? Check-in time: 4pm Check-out time: 11am Can I check in early or check out late? Early check-in or late check-out may be available upon request, subject to availability. Please contact the front desk for more information. How late can I check-in? Our front desk is available 24 hours. What is required to check-in? Guests must be 21 years or older to check in and will be required to present a valid photo ID in addition to their method of payment. Is parking available at the hotel? Yes, complimentary on-site parking is available for all hotel guests. Can I store my luggage before or after I check out? Yes, complimentary luggage storage is available at our Front Desk. Is the hotel accessible for guests with disabilities? Yes, we have accessible rooms, ramps, and elevators for your convenience. Please inform us of any specific needs prior to your arrival. Are there any extra charges or resort fees? $20 plus taxes Resort Fee is applied to all reservations. Is the hotel pet-friendly? Yes. A non-refundable $100 pet fee applies. Room and Facilities Do the rooms include complimentary Wi-Fi? Yes, free Wi-Fi is available in all rooms and public areas of the hotel. When will my room be cleaned, and how do I request additional items? Your room will receive full cleaning service every third day of your stay. For any requests, such as extra towels or amenity refills, please contact the Front Desk at any time. Are there any amenities in the rooms? Our rooms come with air conditioning, a flat-screen TV, minibar, safe, Bluetooth speaker, hair dryer, and ironing board. Check the room description for specific details. Do you have accessible rooms? We offer three accessible room types - our Accessible Classic King and Accessible Classic Double, Accessible Deluxe King. For more specifics, check out our Accessibility page. Is there a smoking policy in the hotel? Our hotel is smoke-free, and smoking is only allowed in designated areas. Please ensure compliance with our smoking policy. A $250 cleaning fee will be applied if any odor is found in the room. Do you offer breakfast? Brunch begins at 11am. Do you have a restaurant or bar on-site? Yes, we have Palm Tree Club Miami Restaurant. Open daily, our restaurant serves up coastal-American food in a casual dining environment, with all your favorites & Miami’s best sunset views! Do you offer laundry and dry cleaning services? Yes, laundry and dry cleaning services are available. Booking and Payments Does the hotel accept traveler’s checks as payment? No, we do not accept traveler’s checks as payment. Does the hotel require any deposit at check in? Yes, at check-in, we require a $150 incidental deposit per stay, in addition to the room and tax charges. This is just a hold on the credit card. If the guest doesn’t incur any incidentals or make any purchases during their stay, the hold will be released within 5 to 7 business days after check-out. Does the hotel require any deposit prior to checking in? Pre-stay deposits are dependent upon the rate plan reserved. What type of credit cards are accepted at the hotel? MasterCard, Visa, American Express, and Discover are all accepted. What is your cancellation policy? Cancellation policy depends on the reservation rate booked. We offer rates with a refundable reservation up to 72 hours before arrival, as well as discounted non-refundable rates. Can I book directly on your website? Yes, we recommend booking directly through our website for the best rates and special offers. Can I modify or cancel my reservation after booking? Cancellation/Modification policy depends on the reservation rate booked. We offer rates that may be cancelled or modified up to 72 hours before arrival, as well as discounted non-refundable rates that do not allow cancellations or modifications. Special Requests and Policies Can I send a package to the hotel? Yes, we’re happy to accept packages prior to your arrival. Please be sure that the name of the registered guest is included in the delivery information and be sure to use our Security/Receiving address: 1819 79th Street Causeway North Bay Village, FL 33141 Can I request special accommodations or amenities (e.g., flowers, champagne, etc.)? Yes, we can arrange special requests for a fee. Please contact us ahead of time to ensure availability. Do you offer shuttle service to the airport? We do not offer this service directly, however, our concierge services may assist in making a shuttle reservation with a 3rd party company. Additional Services Can I book tours or activities through the hotel? Yes, we’d be happy to assist with booking. Please stop by the front desk to inquire about available options. Our concierge team can also help with making reservations. Do you have a gym or fitness center? Yes, we have a brand-new fitness center, and it’s open 24 hours a day for your convenience! Reservations & Ticketing How can I contact the restaurant if I have further questions? You can reach us at 786-204-1366 or email us at dining@palmtreeclubmiami.com . Will there be commissions for promoters who refer clients? For more information, email VIP@palmtreeclubmiami.com . Contact Information How can I contact the hotel if I have further questions? You can reach us at 305-865-7100 or email us at reception@palmtreeclubmiami.com . Our team is available 24/7 to assist you. Join the Crew Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Palm Tree Club Miami Palm Tree Club Miami 1819 79th Street Causeway                        North Bay Village, FL                         33141 HOTEL: (305) 865-7100 reception@palmtreeclubmiami.com reservations@palmtreeclubmiami.com RESTAURANT: (786) 796-0846 dining@palmtreeclubmiami.com MARINA: boats@palmtreeclubmiami.com Radio Channel: #71 LIVE EVENTS & PRIVATE TABLES: VIP@palmtreeclubmiami.com events@palmtreeclubmiami.com Our hotel properties include Palm Tree Hotel, Palm Tree Crew Hotel, and Palm Tree Club, all operating under the Palm Tree Crew umbrella. facebook instagram pinterest Contact & FAQs Palm Tree Club Miami  2025. All Rights Reserved Accessibility Privacy Policy Sitemap Consent Preferences Hotel Web Design by close"
    },
    {
      "url": "https://www.alliancesafeoregon.org/staff-and-board",
      "text": "Staff and Board | Alliance for a Safe Oregon Menu Focus Areas Focus Areas Keeping kids safe Secure gun storage can protect kids and keep our youth safe. Preventing firearm suicides Firearms represent the leading cause of suicide death in Oregon, with more than half of all suicides by firearm. Supporting our Veterans If you are a vet or service member who is having a hard time, know that you are not alone. Preventing school & mass shootings All of us want to live in communities where we can attend concerts and go to the movies, and feel safe. Keeping illegal guns out of our communities We need to ensure the gun industry follows ethical business practices, and bad actors are held accountable. Preventing shootings & homicides Those whoâve been most impacted by gun violence also most understand solutions. Get Involved Get Involved 2025 Legislative Agenda Take action to save lives during the 2025 Legislative Session. Volunteer to make change Change requires all of us. Bring your skills and time to help us create a better future for all of us. About About Who We Are Learn more about the Alliance, our history, and how we work. Mission and Vision Safer communities are possible. Our Team Meet our team and see open positions. Contact Us Find our contact information and get in touch. Oregon's Gun Laws Today, Oregon has had weak gun laws that put our communities at risk. 2024 Annual Report Learn how our work is making a difference. Donate Donate Join our Monthly Giving Circle Join us in our ongoing efforts to reduce gun violence in Oregon, and around the country. Make a Single Donation Make a single gift to support our daily operations. Join the alliance Link Staff and Board Staff and Team Amie Wexler Executive Director Asianique Savage Director of Metro Violence Prevention Diane Peterson Volunteer Coordinator Rena Mahajan Development Director Steve Schneider Firearm Suicide Program Director Board Becca Uherbelau Executive Director Oregon Donor Alliance Constantin Severe Deputy General Counsel Oregon Governor's Office Drew Mayer Senior Counsel SB Energy Gloria Ochoa-Sandoval Advocacy Director Unite Oregon Michela Bedard Executive Director Period Renee Hopkins Executive Director Alliance for Gun Responsibility Rep Sarah Finger-McDonald State Representative Oregon House District 16 Sujata Joshi Project Director Improving Data and Enhancing Access - Northwest at the Northwest Portland Area Indian Health Board Advisory board Jess Marks Consultant Jenn Lynch Partner Portland Seed Fund Rutilla Galvan-Rodriguez Executive Director of Diversity, Equity, Inclusion & Belonging High Desert Education Service District Career opportunities Interested in joining our team? Check out our open positions below. Open Positions Join our Action Alerts Team Sign up for our email list, and help us build the Alliance. Be the first to know when we need to make our voices heard. Join now Quick links Get Involved Donate About Us Contact Privacy Policy info@oralliance.org 541-204-0753 Â© 2024. Alliance for a Safe Oregon. P.O. Box 12233, Portland, OR 97212"
    }
  ]
}