{
  "fuentes": [
    {
      "url": "http://adenacorporation.com/atp-contact/",
      "email": "j.stasa@adenacorporation.com"
    },
    {
      "url": "http://adenacorporation.com/atp-contact/",
      "email": "r.rhoades@adenacorporation.com"
    },
    {
      "url": "https://www.clubadena.com/the-course.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.clubadena.com/entertain.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.clubadena.com/wellness.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.clubadena.com/",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.clubadena.com/pro-shop.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "email": "info@clubspot.app"
    },
    {
      "url": "https://www.clubadena.com/membership.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.adena.org/contact-us",
      "email": "financialcounselingteam@adena.org"
    },
    {
      "url": "https://www.adena.org/contact-us",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.adena.org/contact-us",
      "email": "media@adenacommunications.org"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "ryan.payne@adenacorporation.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "help@adenadev.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "m.cass@adenadev.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "m.cotter@adenadev.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "m.garrison@adenadev.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "m.schmidt@adenadev.com"
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "email": "ryan.payne@adenadev.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.clubadena.com/connect.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.clubadena.com/equestrian.html",
      "email": "info@clubadena.com"
    },
    {
      "url": "https://www.sunandfungolfassociation.com/wec-club-adena---golden-ocala.html",
      "email": "info@sunandfungolfassociation.com"
    },
    {
      "url": "https://adenacoffee.com/about-us/",
      "email": "info@adenacoffee.com"
    }
  ],
  "mails": [
    "contact@clubcarwash.com",
    "financialcounselingteam@adena.org",
    "help@adenadev.com",
    "info@adenacoffee.com",
    "info@clubadena.com",
    "info@clubspot.app",
    "info@reception-plus.de",
    "info@sunandfungolfassociation.com",
    "j.stasa@adenacorporation.com",
    "logo@2x.png",
    "m.cass@adenadev.com",
    "m.cotter@adenadev.com",
    "m.garrison@adenadev.com",
    "m.schmidt@adenadev.com",
    "media@adenacommunications.org",
    "r.rhoades@adenacorporation.com",
    "ryan.payne@adenacorporation.com",
    "ryan.payne@adenadev.com"
  ],
  "nombre_sitio": "clubadena.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://adenacorporation.com/atp-contact/",
      "text": "Contact - Adena Skip to content Facebook Twitter LinkedIn Instagram Subcontractor Portal Bid Room Who We Are About Leadership What We Do Delivery Methods Self-Perform Adena SPG Adena Craft Adena Themed Portfolio Palmers Contracting Amusement Commercial/Retail K-12 Education Higher Education Healthcare Multi-Family / Student Housing Senior Living Adena Industrial Industrial Information Working at Adena Careers Employee Benefits Employee Portal Contact Contact Rich Rhoades Vice President of Strategic Planning Phone: 417.291.0373 Email: r.rhoades@adenacorporation.com Joseph Stasa Executive Director of Themed Portfolio Phone: 407.267.0603 Email: j.stasa@adenacorporation.com Themed Portfolio Headquarters 2240 Commerce Point Dr. Lakeland, Florida 33801 Phone: 863.937.9378 Contact Us * Name: * Phone: * Email: * Message: Affiliations & Certifications Mansfield Corporate Office 1310 West Fourth Street Mansfield, Ohio 44906 Phone: 419.529.4456 Fax: 419.529.4288 Greater Columbus Office 6816 Lauffer Road Columbus, Ohio 43231 Phone: 614.865.9000 Central Florida Office 2725 S. Combee Road Lakeland, Florida 33801 Phone: 863.937.9378 Fax: 863.816.3031 Gunnison Colorado Office 234 N Main St 3C-1 Gunnison, CO 81230 Phone: 970.707.4055 © 2020 Adena Corporation"
    },
    {
      "url": "https://www.clubadena.com/the-course.html",
      "text": "The Course | GOLF | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER \"Dramatic and unforgettable\" GOLF DIGEST BOOK A TEE TIME SCORE CARD An Unparalleled Golfing Experience C lub Adena offers avid golfers and professionals alike, a unique experience while on this expansive 18 hole course. Like no other course in Ocala, enjoy vistas beyond compare and elevations that transport golfers to another level making for an unforgettable challenge. GOLF MEMBERSHIP Elevate your golfing experience to new heights with Club Adena's Exclusive Golf membership! Learn More by connecting with our team and join a community of passionate golf enthusiasts who appreciate the perfect blend of challenge, luxury and camaraderie. WOMEN’S LEAGUE Club Adena is proud to present an exclusive league for all members at the Club who have a passion for golf. With curated programming and flexible schedules, female members can enjoy exclusive access to seasoned professionals and shine on the course! TOURNAMENT TYPES: MEN’S WOMEN’S JUNIOR CORPORATE CHARITY TOURNAMENTS Interested to know more? Reach out to our membership team for all scheduled tournaments at the club and learn how you can participate. LEARN MORE SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.clubadena.com/entertain.html",
      "text": "ENTERTAIN | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Best in Class Facilities Celebrate in style and at the ultimate location. Let our team host your special event with the vistas of Club Adena as your backdrop. O ur team is currating an unforgettable experience for all members to participate in and services to use. For more information reach out to our team by clicking the button below CONNECT For exciting updates and highlights at The Club follow us on all of our social media platforms. WEDDING CORPORATE EVENTS EXPERIENCE RESTAURANTS SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.clubadena.com/wellness.html",
      "text": "WELLNESS | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Best in Class Wellness Take your wellness to the next level R elax and unwind at our luxurious Club Adena Spa or elevate your health at our World-class Club Adena Health Centre. Access the best and leading professionals, enjoying every moment of rest and relaxation. For exciting updates and highlights at The Club follow us on all of our social media platforms. SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.clubadena.com/",
      "text": "Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Welcome to The Club, the best in class Welcome to Club Adena, where world class amenities redefine the art of living. Tee Off on our pristine 18 hole golf course, designed to challenge and captivate enthusiasts of the sport. Savor an exquisite farm-to-table dining experience that elevate your plate with each delectable bite, setting a new standard of culinary excellence. EXPLORE THE COURSE Previous Next A Club of Luxury and Distinction Dive into a world of racquets and rallies as we  introduce the latest sports sensation at our club-tennis and pickleball! Elevate your game and embrace the thrill of the court as we bring you two exciting additions to our roster of activities. Elevate your lifestyle at Club Adena The perfect destination. The ultimate membership. Savour the ultimate in luxury with 5-star services and amenities at one club. Enjoy premium services including a world renowned health facility that includes access to industry health care technologies, exclusive to members at Club Adena. LEARN MORE PLAY ENTERTAIN WELLNESS SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.clubadena.com/pro-shop.html",
      "text": "Pro Shop | GOLF | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Equipped for all your needs HOURS OF OPERATION: 8:00 am to 6:00 pm Daily Contact us: info@clubadena.com 352-400-4653 THE PROSHOP Discover a curated collection of top-tier golf equipment and apparel. From cutting-edge fashion from the course, our Proshop is your one-stop destination to elevate your game in unparalleled style. SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name E-Mail Datenschutz name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "text": "ClubSpot Club Management - Contact Us top of page Home Solutions Custom Club App Membership Management Online Club Lotto Data Security Club Communications Group Messaging Club Events Ticketing Customer Stories Contact Contact - Support Contact - Sales Blog Pricing Meet The Team How To Setup Guide Admin Tutorials User Tutorials More... Use tab to navigate through the menu items. Get a Demo Login Need support? Get in touch! For the quickest response time for general customer support or ticketing queries, contact us via our  live chat button at the bottom right of the screen. You can also reach us using the support email and contact number below where a member of our team will get in touch with you as soon as possible. Live Chat via orange button in right corner below Quickest Response ​ ​ Email: support@clubspo t.app Mob: 087 032 2866 ​ CAVAN DIGITAL HUB, KILMORE BUSINESS PARK, DUBLIN RD. CAVAN Enjoying your experience with ClubSpot? We'd love to hear from you! Click here to leave us a review! Company Home About Us Contact Us Careers FAQs Privacy Policy GDPR Club Referrals Terms of Service Contact Email: info@clubspot.app Mob: 087 032 2866 Stradone, Cavan, H12 Y066 © ClubSpot 2022 All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.clubadena.com/membership.html",
      "text": "Membership | GOLF | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Exclusive Golf Membership Plans GOLF MEMBERSHIP All golf memberships enjoy the use of all amenities at Club Adena with preferred tee time reservations. YOUNG EXECUTIVE GOLF MEMBERSHIP Members under 40 years of age will enjoy the use of all facilities at Club Adena including the following: Spa and Swimming Pool Tennis & Pickleball Courts Lounge Bar Dining Room 18 Hole Golf Course SOCIAL MEMBERSHIP Members will enjoy all amenities on the property including: Spa and Swimming Pool Tennis & Pickleball Courts Lounge Bar Dining Room CORPORATE GOLF MEMBERSHIP Corporate memberships will be entitled to an allowance of up to four title members and will enjoy the use of the following amenities Spa and Swimming Pool Tennis & Pickleball Courts Lounge Bar Dining Room NATIONAL GOLF MEMBERSHIP National membership must live 75 miles from the club and will enjoy the use of the following amenities Spa and Swimming Pool Tennis & Pickleball Courts Lounge Bar Dining Room SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.adena.org/contact-us",
      "text": "Contact Us When autocomplete results are available use up and down arrows to review and enter to select. MyChart Pay Your Bill Contact Us Careers (740) 779-7500 Find a Provider Specialties Behavioral Health Heart and Vascular Institute Dermatology Emergency Care Gastroenterology General Surgery Lab Services Neurology Oncology Orthopedics Pediatrics Primary Care Pulmonology Spine Care Sports Medicine Urgent Care Women's Health See All Specialties Locations Emergency Care (ER) Family Medicine Hospitals Pediatrics Primary Care Specialty Care Urgent Care See All Locations Patients & Visitors For Visitors Price Transparency MyChart Pay Your Bill Patient & Visitor Information Safety and security News & Events Media resources Newsroom Health Focus Blog Upcoming Events Walk with a Doc / Just Walk About Adena About Adena Our Culture Our History Adena Health Foundation Community Health Adena Mobile Clinic Awards & Accolades Board of Trustees Volunteer Opportunities For Providers Overview Medical Education Patient Referrals MyChart Pay Your Bill Contact Us Careers (740) 779-7500 Find a Provider Specialties Behavioral Health Heart and Vascular Institute Dermatology Emergency Care Gastroenterology General Surgery Lab Services Neurology Oncology Orthopedics Pediatrics Primary Care Pulmonology Spine Care Sports Medicine Urgent Care Women's Health See All Specialties Locations Emergency Care (ER) Family Medicine Hospitals Pediatrics Primary Care Specialty Care Urgent Care See All Locations Patients & Visitors For Visitors Price Transparency MyChart Pay Your Bill Patient & Visitor Information Safety and security News & Events Media resources Newsroom Health Focus Blog Upcoming Events Walk with a Doc / Just Walk About Adena About Adena Our Culture Our History Adena Health Foundation Community Health Adena Mobile Clinic Awards & Accolades Board of Trustees Volunteer Opportunities For Providers Overview Medical Education Patient Referrals Search Connect With Us We're here when you need us. (740) 779-7500 If you are experiencing a medical emergency, please call 9-1-1 Contact Us Schedule An Appointment (740) 779-7500 Find a Provider (740) 779-FIND (3463) This line is available 8 a.m. – 4:30 p.m. Monday through Friday. Adena Health System 272 Hospital Road Chillicothe, Ohio 45601 ( map ) https://www.adena.org Medical Center Numbers Adena Regional Medical Center (740) 779-7500 Adena Fayette Medical Center (740) 779-7500 Adena Greenfield Medical Center (937) 981-9400 Adena Pike Medical Center (740) 947-2186 Department Numbers Billing Department 877-771-7030 Patient Information 740-779-7531 Human Resources 740-779-7562 TTY Phone Number 740-779-7931 Financial Aid Department FinancialCounselingTeam@adena.org Communications Media Injuries Patients & Visitors Find a Provider Types of Care Locations MyChart Pay Online For Visitors Health Care Professionals Medical Education Patient Referrals Provider Job Search Online Physician/APP Verification In the Community Community Health Adena Health Foundation Adena Mobile Clinic Adena Careers Events News Contractor Services Volunteer Billing and Insurance Price Transparency - Calculate Your Estimate Adena Regional Medical Center Price Transparency Adena Greenfield Medical Center Price Transparency Adena Pike Medical Center Price Transparency Adena Fayette Medical Center Price Transparency Language assistance available: Español (Spanish) | नेपाली (Nepali) | العربي (Arabic) | Soomaali (Somali) | 中文 (Chinese) | 廣東話 (Cantonese) | Русский (Rusian) | Français (French) | Tiếng Việt (Vietnamese) | አማርኛ (Amharic) | 한국어 (Korean) | မြန်မာ (Burmese) | ትግሪኛ (Tigrinya) | हिन्दी (Hindi) | Kiswahili (Swahili) Section 1557 Notice of Nondiscrimination | Disclaimer | Patient Rights & Privacy Policy | Employees | Adena Health Plan © 2009-2025 Adena Health System. All Rights Reserved."
    },
    {
      "url": "https://adenadev.com/leadership-team/",
      "text": "Leadership Team | Adena Development Skip to content Formerly Springfield Properties, LLC 1310 W. Fourth St. 419-529-4424 help@adenadev.com About Us Leadership Team Our Services Portfolio Projects News Adena Development Leadership Adena Development is a family-owned business that understands what is important from an owner’s perspective.  We partner with our clients and guide them through the development process to accomplish their goals.  Our approach is to support each client in the way they need, while bringing ideas and perspective to the table which are thought provoking and value minded.  Our ability to assist in all aspects including acquisition, financing, design, rehab, construction, and sale, helps make our clients’ vision a reality. Our Leadership Randy Payne Co-Founder of Adena Development & President of Adena Corporation 32 years of experience in the construction industry Bachelor of Engineering, Construction Management Randy began his career with Adena Corporation in 1988 as an estimator, just thirteen short years later he became president, and then the sole owner. Adena Corporation has long been known as a trusted, elite construction management and general construction firm.  Randy recognized the value of self-perform work and the need to provide jobs for the local area.  Therefore over the years, Adena Corporation with Randy’s leadership has added and grown business divisions that perform concrete, masonry, carpentry, steel erection and fabrication. The Adena brand implements approximately $150MM worth of construction annually and employees over 400 team members.  In 2014, Randy co-founded the development entity to support the local real estate market and strengthen his diverse business model.  Despite rapid growth, Randy’s values remain the same – relationships, quality craftsmanship, individualized service and community partnerships. Randy’s devotion, hard work, and passion toward the construction industry and real estate development have led to their many successes. Jim Schmidt Co-Founder of Adena Development, CEO of MKC Architects & President of University Housing Solutions 35 years of experience in the architecture and real estate industry Bachelor of Science in Architecture Jim joined MKC Architects in 1983 and is firm Principal and CEO. Jim has performed design work on numerous civic and education projects throughout his career, with a specialty in designing inspirational spaces. Jim has focused his expertise in project master planning, conceptual design and the development of innovative and cost effective architectural designs. Jim spends his time focusing on private-led development, in particular student housing. His role is to ensure the development of the design is consistent with the owner’s expectations and to create integrity centered, innovative designs. Jim’s involvement in many local and state board of directors has given him the opportunity to inform others about the practice of architecture and its effects on people, places and cultures. The combined experience and expertise of Adena Development’s founders is like no other! Our Staff Ryan Payne ● Construction Project Manager ryan.payne@adenadev.com 419-529-4456 ext. 292 Meghan Schmidt ● Director of Development m.schmidt@adenadev.com 419-989-5639 MacKenize Cass ● Acquisition & Leasing Director m.cass@adenadev.com 419-529-4424 Matthew Garrison ● Property Manager m.garrison@adenadev.com 419-610-4330 Matthew Cotter ● Assistant Property Manager m.cotter@adenadev.com 567-560-7540 419-529-4424 1310 W. Fourth St. Mansfield, OH 44906 © 2020 Adena Development"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.clubadena.com/connect.html",
      "text": "Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Connect with us VIEW WELCOME PACKAGE MEMBERSHIP WELCOME PACKAGE All golf memberships enjoy the use of all amenities at Club Adena with preferred tee time reservations. For exciting updates and highlights at The Club follow us on all of our social media platforms. Or Email: info@clubadena.com SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.clubadena.com/equestrian.html",
      "text": "EQUESTRIAN | Welcome to The Club... the best in class - Club Adena Skip to Main Content HOME GOLF The Course The Clubhouse Membership Pro Shop CLUBS ENTERTAIN EQUESTRIAN Stables POLO Watch THE RESIDENCES FUTURE CLUB AMENITIES ADENA VITA CONNECT REGISTER Coming Soon World-class equestrian facilities in the heart of horse country For more information on boarding, stable availability or to learn more about the programming coming to Club Adena, reach out to our Program Director or leave your information below. REQUEST MORE INFO For exciting updates and highlights at The Club follow us on all of our social media platforms. SUBMIT REGISTER TO STAY CONNECTED Sign up for Membership info and to be among the first to receive updates and invitations. CLUB ADENA 950 NW 75th Street, Ocala, FL 34475 352-400-4653 info@clubadena.com Copyright © 2025 Calibrex Develoments. All rights reserved. *Prices subject to change without notice E&OE. **All Renderings are artists concept. Site design and branding by Ryan Design International | PRIVACY POLICY | ACCESSIBILITY"
    },
    {
      "url": "https://www.sunandfungolfassociation.com/wec-club-adena---golden-ocala.html",
      "text": "WEC Club Adena & Golden Ocala Home About Membership New Members Membership Renewal Events 2025 Events 2026 Events Contact Testimonials Links Past Trips Sun and Fun Golf Association - Golf Travel Specialists Club Adena Golden Ocala Golf and Equestrian Club Sunday, March 2, 2025: Guests arrive at the World Equestrian Center's Riding Academy Hotel, check-in time is 3:00pm. If you arrive early, consider viewing some of the Equestrian Exhibitions and/or Show Competitions that may be happening Sunday afternoon. 5:30pm Welcome Cocktail Reception(Open Bar) followed by Welcome Dinner in a Private Dining Room at the World Equestrian Center (Casual Attire). Monday, March 3, 2025: 6:30am Breakfast service begins in Stirrups Restaurant at the nearby Equestrian Hotel. Golf is scheduled this morning off property at Golden Ocala Golf and Equestrian Club located about 6 minutes away, driving from the WEC. Please arrive at least 30 minutes before your tee time so you'll have time to get ready prior to your tee time. 10:00am Tee Times begin. Today's round is a 2 best of 4 team competition. No planned dinner tonight, you might consider one of the restaurants on the WEC campus or nearby in Ocala. Tuesday, March 4, 2025: 6:30am Breakfast service begins in Stirrups Restaurant at the nearby Equestrian Hotel. Golf is scheduled this morning off property at Club Adena Golf Course located about 20 minutes driving from the WEC. Please arrive at least 30 minutes before your tee time so you'll have time to get ready prior to your tee time. 10:00am Tee Times begin. Today's round is a 2 best of 4 team competition. 5:30pm Cocktail Reception(Open Bar) followed by Awards Dinner in a Private Dining Room at the World Equestrian Center (Casual Attire). Wednesday, March 5, 2025: 6:30am Breakfast service begins in Stirrups Restaurant at the nearby Equestrian Hotel. 11:00am Hotel check out time. Have a safe trip home and thanks for joining us in Ocala at the World Equestrian Center! Many of our SFGA Members may be familiar with the sleepy town of Ocala as you've no doubt driven right by it while traveling north or south on I75. We are always searching for new venues and believe we've found a reason to exit I75 in Ocala! Join us at one of Florida's trendiest new resorts, the World Equestrian Center.  This $800 Million Dollar Equestrian Centric Resort is a mecca for the Equestrian community and it should be since its the largest equine facility in the U.S.  The World Equestrian Center's 388 acre facilities were designed with the ultimate comfort of the horse, rider, and spectators in mind. Facilities include Two Exposition Centers, a state-of-the-art Equestrian Competition Venue offering six climate-controlled indoor arenas and 23 cutting-edge, outdoor arenas, and Stabling to accommodate nearly 3,000 horses. Show grounds are multidisciplinary meaning they can host - Hunt and Jump, Dressage, and Breed shows, making this facility incredibly unique. You may be asking yourself, what about accommodations for people? The WEC has you covered in grand style! In 2021 they opened the luxurious 248 room Equestrian Hotel and on April 1, 2024 they opened the upscale 390 room Riding Academy Hotel. Our group will stay in the new Riding Academy Hotel's spacious King Studios. Other resort amenities include, seven restaurants (including a horse-shaped bar in the Yellow Pony Pub), a wine program curated by an in-house master sommelier, a 7,000 sqft. Spa, two swimming pools and high-end Retail Shops such as Lugano Diamonds. Our golf will take place at two of Ocala's best private Country Club's. Golden Ocala Golf & Equestrian Club, a Ron Garl design with several interesting tribute holes to St. Andrews, Augusta National, Royal Troon and more. We'll also play the recently opened Club Adena - featuring elevation changes, limestone-quarry lakes, rugged rock faces, and Spanish moss-draped oak trees.  We only have space for 28 golfers and encourage our members to register for this event before it sells out! The World Equestrian Center plays host to a vast array of multipurpose meetings, conventions and events that draw thousands of visitors, guests can see everything from dog shows, car shows, comic cons, home and garden expos and so much more while staying at WEC. The World Equestrian Center Events Schedule has not been updated to include March 2025. However on Sunday March 3, 2024 they hosted the Equestrian National Grand Prix, the Ocala Boat Show and and Equestrian International Show Jumping Competition. We will email all our participants the WEC Events during our stay once they are published. Three nights at the World Equestrian Center's brand new Riding Academy Hotel in a comfortable King Studio Room. Breakfast each morning in the World Equestrian Center's Stirrup's Restaurant. Welcome Reception (open bar) followed by Group Dinner on our first night (March 2, 2025) Awards Reception (open bar) followed by Group Dinner on our last night (March 4, 2025) Two Rounds of Golf with Carts and Practice Range Balls Prior to each round. Golf will be played at: Golden Ocala Golf and Equestrian Club - A Ron Garl design with several tribute holes paying homage to St. Andrews, Royal Troon & Augusta National. Club Adena Golf Course - Ocala's newest private club. Two tournament rounds where the formats are: 2 Best of 4 and Odds & Even, four person team play. Tournament entry fees are included in your package price. Prizes will be awarded. The resort fee is included and provides internet access via Wifi, fitness center access, self-parking, swimming pool and more. Gratuities on planned meals, Taxes and Resort fees are included. We'll stay at The Riding Academy Hotel in Ocala, Florida—the newest, 390-room addition to the impressive campus of World Equestrian Center, the largest equestrian competition venue in the United States.A seamless blend of superior comfort and equestrian charm, The Riding Academy Hotel offers upscale, pet-friendly accommodations and authentic hospitality in the heart of horse country. Our participants will stay in King Studio guest rooms featuring upscale furnishings with desirable in-room amenities, such as coffee makers and Sub-Zero refrigerators, 65 inch TVs and pull-out sleeper sofas. Unique artwork charms and delights, while thoughtful touches and luxurious finishes provide guests with all the warmth and comfort of home. Amenities include the a Shuttle Service around the World Equestrian Center's expansive campus, complimentary Self-parking, Seven Restaurants on property - choose from fast casual to fine dining, Pool and Outdoor Sundeck, Fitness Center and High Speed Wifi. GOLDEN OCALA GOLF AND EQUESTRIAN CLUB ​ Golden Ocala Golf & Equestrian Club boasts a well maintained 18-hole championship private course designed by golf course architect Ron Garl. The majestic course at Golden Ocala incorporates eight masterfully recreated tribute holes from some of the world’s finest golf courses including: Augusta National Golf Club (Home of the Masters Tournament), Augusta, GA, USA Royal Troon Golf Club, Scotland Baltusrol Golf Club, Springfield, NJ, USA Muirfield Village Golf Club, Scotland St. Andrews Links, Scotland During 2015 and 2016, Golden Ocala Golf & Equestrian Club hosted the Coates Golf Championship, an official LPGA Tour event that featured 120 of the top female golfers in the world. Na Yeon Choi shot 16 under par and won the event in 2015 by one shot over Lydia Ko, Ha Na Jang and Jessica Korda. In 2016 South Korean Ha Na Jang finished at 11 under par and won beating Brooke Henderson by two shots.          It's always a fun course to play and we think our members will love it! CLICK HERE TO REGISTER Golf & Adventure Travel Expeditions, Inc. organizes and operates trips for the Sun and Fun Golf Association. Golf & Adventure Travel Expeditions, Inc. is a registered seller of travel with the State of Florida. Registration No. ST-34491 ©2024 Golf and Adventure Travel Expeditions Inc. Club Adena The Golf Courses: Golden Ocala Golf and Equestrian Club Our Hotel: CLICK HERE TO REGISTER WORLD EQUESTRIAN CENTER, CLUB ADENA & GOLDEN OCALA COUNTRY CLUB A) $1,995 Per Person Per Golfer, Double Occupancy or $3,990 Per Couple both Golfing B) $1,495 Per Non-Golfer, Double Occupancy or $3,490 Per Couple, Golfer & Non-Golfer C) $2,495 Per Golfer Single Occupancy D) $440 Extra Night - King Studio Room, State and Local Taxes, Breakfast in Stirrups Restaurant Golden Ocala Golf and Equestrian Club CLUB ADENA ​ Club Adena formerly known as Adena Golf & Country Club has recently reopened. The club was created by Frank Stronach who made his fortune in the automobile parts industry and founded the $35 billion automotive parts supplier Magna International, a Canadian behemoth. Stronach, diversified his wealth and became a breeder of thoroughbred horses, owner of multiple racetracks, such as Santa Anita in California and Gulfstream Park in Florida and owner of cattle and horse farms in Canada and Central Florida and Ocala. His love of thoroughbred horses is what brought him to Ocala and eventually his developement of Club Adena - a premium, members-only, full service club.  Shortly after it opened in 2015, the golf course was recognized by \"Golf Digest\" as one of the Best New Courses in America. But in the summer of 2018, the club abruptly closed because of a family disagreement that resulted in years of legal proceedings. The litagation has ended and now Club Adena is part of a high-end residential development featuring an exclusive private golf course that the SFGA will play. The 18-hole golf course was built around limerock mining quarries that provide up to 80 feet of elevation change from tee to green on some holes. A feature of the property are waterfalls which feed into lake quarries of blue water and provide a dramatic backdrop on multiple holes. Moss draped live oaks provide tranquil scenery and line the well-groomed fairways and greens.  Be sure to bring your camera. Club Adena Club Adena Golf Course Club Adena March 2-5, 2025 Ocala, Florida ***** CLICK HERE TO REGISTER ***** Event Details: Sun and Fun Golf Association 399 Palm Coast Pkwy SW Suite 2 Palm Coast FL 32137 USA info@sunandfungolfassociation.com +1 (904) 823 - 3083 Package Inclusions: Package Prices: World Equestrian Center Events: CLICK HERE TO REGISTER THIS TRIP IS LIMITED TO THE FIRST 28 GOLFERS THAT REGISTER. WE HOPE YOU WILL CONSIDER JOINING YOUR SFGA FRIENDS! Tentative Itinerary: View on Mobile"
    },
    {
      "url": "https://adenacoffee.com/about-us/",
      "text": "About Us - Adena Coffee Menu About Us Our Beans Boutique Speciality Commercial Coffee Origin Sumatera Flores Bali Our Impact Contact info@adenacoffee.com Instagram Linkedin We provide meaningful coffee that promotes livelihood and sustainability Our Story From a humble, yet meaningful beginning Adena coffee has a fascinating origin story as a community initiative that aimed to provide a new collective memory for a former conflict area through the shared love of people, nature, culture, and coffee. Initially conceived as a passion project within the community, Adena grew from a small endeavour into a full-fledged business. Our commitment to quality community, and the cultural significance of coffee has allowed us to thrive and expand beyond our humble beginnings. The word “Adena” holds special significance for the company, as it is derived from one of Indonesian local languages – Kaimana, where it means “mother”. This choice of name refletcs the nurturing and community-centric ethos that Adena ambodies. Adena truly believes that coffee can not ever seperated from the people who produce it. Our goal isn’t just about coffee, it’s about connection. Just as coffee sparks conversations. Adena believes in fostering dialogues that matter. Our team is your confidents, your companian on this journey of conscious consumption. Our Approach Empowering community & bringing the truest Indonesian coffee to the world Developing origins by implementing sustainable, transparent & traceable coffee through agroforestry & best practice in post-harvest technology. Opening-up more proccessing units in Indonesia by partnering with the local communities and enhancing their production capability. Going global and representing Indonesia through high-quality, meaningful and sustainable coffee. Our Values A Brew of Empathy Inspired by the vibrant people, the nature & the culture of the motherland, we're rewriting the narrative of coffee processing with a dash of style and a whole lot of heart, nurturing a movement that ripples through communities and ecosystems. It's a commitment to a world where coffee is a catalyst for change by championing fair wages, empowering local talents, and endorsing sustainable farming practices. Origin Renaissance Adena celebrates the artistry of life, as we celebrate the craft of coffee-processing. We're processing our beans like they're art, coaxing out distinct flavours and aromas from every origin, experimentally. Blending bespoke technology and locally sourced wisdoms, we process our coffee like a caffeinated cosmos that is way more than just a buzz. The Bean Odyssey Traverse our origins, take a journey across mountains, jungles, and realms unknown, in pursuit of the perfect bean. Adena is about experiencing the heartbeat of coffee farms, where coffee isn't just a beverage; it's a revolution wrapped in a cup, a kaleidoscope of culture, conscience. We source our beans from dedicated farmers who toil the fertile lands with respect for nature. Shaking hands with the guardians of our land? Yeah, that's our jam. From Beans to Your Embrace Our beans are harvested with the same love your mom puts into her garden, ensuring a taste that's both familiar and extraordinary. We roast (& blend?) these beans with that magical ingredient called nostalgia. Our recipes are a whisper from generations past, an ode to the cosy kitchens where love and coffee percolated together. Here's to every mom who brewed love into every cup, and here's to the coffee that feels like coming home. Our Services Ethical Sourcing and Fair Trade Practices We cultivate strong partnerships with coffee farmers, ensuring they receive fair compensation for their high-quality beans. We actively support knowledge-sharing workshops, empowering farmers with sustainable farming practices and fostering a collaborative environment. Market Customisation Focusing on customer needs by customising our green beans offering based on the cupping profile target that includes : The cupping profile target The end product (e.g. for espresso blend, competitions, filter, and others Calculation of the expected shipment time and approximate volume Adena internal assessment on the cupping profile based on different process, origins and ease of production in timely manner Compilation of above in a buyer’s recommendation proposal. Quality Control Beyond End-Product We do more than only “quality control”. We do continuous improvement to bring the best quality coffee to you. We do quality check on each stages: new harvest, offer samples, pre shipment samples, arrival samples Quality checks on green beans physical analysis and its sensory evaluation according to CQI standard. Analysis that we check are: Color Odor Screen Size Moisture % Defect Counts Triage % Density Innovation & Experimental Processing Focus on innovative post-processing methods. We seek new methods of fermentation and drying to achieve unique cupping characteristics. Impact Documentation on Every Origin We continuously deliver and measure our impact to the origins. Leadership Team Abyatar Founder  & CEO Bayu Winata Co-Founder & CFO Joseph Juan Co-Founder & COO Gonzaga Business Head From local to global. We have been trusted by top leading brands accross global. Every Sip Uplifts, Every Bean Tells a Story. About Adena Our Product Coffee Origin Our Impact Contact Have a question in mind? CONTACT US © 2024 • Adenacoffee"
    }
  ]
}