{
  "fuentes": [
    {
      "url": "https://theparkpeople.org/Who-We-Are/About-Us",
      "email": "info@theparkpeople.org"
    },
    {
      "url": "https://www.coab.us/",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "email": "info@safehavencommunityservices.org"
    },
    {
      "url": "https://coab.us/43/Parks",
      "email": "info@coab.us"
    },
    {
      "url": "https://coab.us/43/Parks",
      "email": "president@abbaseball.com"
    },
    {
      "url": "https://coab.us/38/Boards-and-Committees",
      "email": "cityclerk@coab.us"
    },
    {
      "url": "https://coab.us/38/Boards-and-Committees",
      "email": "info@coab.us"
    },
    {
      "url": "https://coab.us/463/Atlantic-Beach-Dog-Park",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.tdrpd.org/27/About-Us",
      "email": "info@tdrpd.org"
    },
    {
      "url": "http://www.coab.us/Directory.aspx",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://coab.us/Directory.aspx?did=83",
      "email": "info@coab.us"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/fall-festival-city-atlantic-beach-recreation-special-events",
      "email": "khogencamp@coab.us"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/fall-festival-city-atlantic-beach-recreation-special-events",
      "email": "mindy@kidsoutandabout.com"
    },
    {
      "url": "https://www.tdrpd.org/156/Community-Rec-Center",
      "email": "angelo@tdrpd.org"
    },
    {
      "url": "https://www.tdrpd.org/156/Community-Rec-Center",
      "email": "caroline@tdrpd.org"
    },
    {
      "url": "https://www.tdrpd.org/156/Community-Rec-Center",
      "email": "info@tdrpd.org"
    },
    {
      "url": "http://coab.us/2132/Special-Event-Request",
      "email": "info@coab.us"
    },
    {
      "url": "http://coab.us/2132/Special-Event-Request",
      "email": "recreation@coab.us"
    },
    {
      "url": "http://www.coab.us/Facilities/Facility/Details/Donner-Park-amp-Gail-Baker-Community-Cen-7",
      "email": "info@coab.us"
    },
    {
      "url": "https://coab.us/Facilities/Facility/Details/Donner-Park-amp-Gail-Baker-Community-Cen-7?p2df",
      "email": "info@coab.us"
    },
    {
      "url": "https://coab.us/Directory.aspx?did=79",
      "email": "info@coab.us"
    },
    {
      "url": "https://bpca.ny.gov/about/leadership/",
      "email": "info.bpc@bpca.ny.gov"
    },
    {
      "url": "https://www.coab.us/13/Recreation-Division",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.coab.us/13/Recreation-Division",
      "email": "recreation@coab.us"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "email": "311@toronto.ca"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "email": "help@torontohousing.ca"
    }
  ],
  "mails": [
    "311@toronto.ca",
    "angelo@tdrpd.org",
    "asset-1@2x.png",
    "caroline@tdrpd.org",
    "cityclerk@coab.us",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "help@torontohousing.ca",
    "info.bpc@bpca.ny.gov",
    "info@coab.us",
    "info@safehavencommunityservices.org",
    "info@tdrpd.org",
    "info@theparkpeople.org",
    "khogencamp@coab.us",
    "mindy@kidsoutandabout.com",
    "president@abbaseball.com",
    "recreation@coab.us",
    "tkramer@thisistheplace.org",
    "you@domain.com"
  ],
  "nombre_sitio": "coab.us",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://theparkpeople.org/Who-We-Are/About-Us",
      "text": "About Us The Park People Search × Search Menu Who We Are About Us Our Staff & Board Sponsors & Partners Contact Us Press Room What We Do Intro Capital Projects Robinson Park Playground Save Our Sundial Denver Digs Trees Tree Sale Tree Planting Guide Tree Care Guide Sign up for a Tree Application Reminder Frequently Asked Questions Mile High Tree Champions TreeForce: Workforce Development Park Legacy Program Gates Tennis Center Community Greening Hub Community Forester Sign up for a Registration Reminder! Inscríbase en Community Forester Community Tree Adoptions Preguntas-frecuentes FAQ for CLG Tree Adoption Community Connectors Community Climate Ambassadors Irrigation Solutions Rainwater Harvesting Solutions City Water & Other Solutions Community Resources Be A Smart Ash Resources for Residents Pruning Project Information Community Greening Projects Get Involved Sign Up For Our Newsletter Volunteer with Us Learn Our Blog Ways to Give Ways to Give Donate Online Thursday, September 11, 2025 Who We Are About Us About Us The Park People is a private 501(c)(3) nonprofit organization working with communities to plant trees and improve parks for a healthy, resilient future. We are passionate about our local parks, our city trees, and other shared community resources. We believe that healthy parks help grow healthy communities. We believe that our community forest not only makes our neighborhoods beautiful places to live, but provides critical functions to the health, well-being, and sustainability of urban life. And we believe that all Denver residents should have access to these critical urban resources. We work towards our mission by raising private funds for capital improvement projects of various sizes and through several ongoing programs: Denver Digs Trees , Community Forester , Mile High Tree Champions , TreeForce , and Park Legacy . We are Denver's oldest and primary city-wide park advocacy group and longest-standing tree organization. We have infused tens of millions of dollars into the city's public spaces, and we have planted more than 60,000 trees in Denver. Learn more about What We Do . Our History The Park People was created in 1969 by a small group of park enthusiasts who banded together to raise private funds to support Denver's extensive parks and recreation system. We are a separate entity from Denver's Department of Parks and Recreation, but have worked in close partnership with the department since our founding. In our 50+-year history, The Park People has infused many millions of dollars into Denver's parks through the restoration of existing park infrastructure, such as fountains and historic park buildings, and through new construction, such as playgrounds and recreation facilities. Our projects include sites in Denver's highest profile parks like the Washington Park Boat House, Cheesman Park Pavilion, Civic Center Esplanade, and City Park fountains. We also value the city's lesser known community treasures, such as the beloved Sundial & Plaza in Cranmer Park, the historic James Fleming House in Platt Park, and the award-winning Gates Tennis Center in Cherry Creek. And we look for high-need projects, such as playground builds in neighborhoods that lack access to recreation resources. Learn about our Capital Projects . The Park People is best known as the home of Denver Digs Trees , a beloved, city-wide tree distribution program founded in 1991. The program's roots grow from the initiative of a small group of neighbors in West Wash Park who organized around kitchen tables to bring affordable trees to plant throughout their neighborhood in the 1980's. These scrappy neighbors distributed 50 trees out of residents' garages their first year. Their initiative expanded in scope and was adopted by The Park People in response to a city-wide need for affordable trees. Denver Digs Trees has since become a cherished community tradition, known throughout the city as a provider of carefully selected tree species appropriate for our arid climate and urban environment. We are proud to provide affordable trees to residents in all of Denver's neighborhoods and place particular emphasis on distributing trees in under-canopied neighborhoods. Since 1991, Denver Digs Trees has distributed more than 60,000 trees to Denver residents. Learn more about Denver Digs Trees and our other urban forestry programs . Support for The Park People comes from individual donations, program fees, foundation and government grants, and corporate sponsorships. The Park People is managed and executed by a small staff, a dedicated Board of Trustees, and many hundreds of volunteers each year. Find out how you can Get Involved and how you can Contribute . CONTACT US 303.722.6262 info@theparkpeople.org 450 Decatur St. Denver, CO 80204 STAY CONNECTED Login Terms Of Use Privacy Statement Copyright 2025 by The Park People Back To Top"
    },
    {
      "url": "https://www.coab.us/",
      "text": "The Atlantic Beach Official Website! | Official Website Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Calendar News Jobs Projects Requests Utilities Government Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx City Commission Meeting Agendas Meeting Calendar Meeting Minutes Meeting Videos (Live & Archived) Priorities Find Your Precinct /QuickLinks.aspx Boards/Committees Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Environment Call Before You Cut Stewardship Committee Tree City USA Tree Protection Regs Tree Removal Permits Tree Service Providers /QuickLinks.aspx SPOTLIGHTS What's Good in Atlantic Beach Attend our free workshop to help your landscaping thrive! Ready to make your Florida landscape thrive? Join Amy Franqui, a Duval County Master Gardener with UF/IFAS Extension, for our \"HOW Series\" (Hands-On Workshops). Read on... It's hurricane season. Are you prepared? Additional Info... /CivicAlerts.aspx NEWS & CALENDAR Stay Up To Date City Addressing Wastewater Treatment Facility Odor (Sept. 8, 2025 Update) The City of Atlantic Beach is actively responding to a recent increase in odor from the Wastewater Treatment Facility and is committed to improving the air quality in our community. Read on... Help Keep the Right-of-Way Safe and Clear While we understand residents may place objects in these areas with good intentions — such as improving curb appeal or managing traffic — these items can create safety hazards and interfere with city services. Read on... Sidewalk and Crosswalk Improvements on Plaza Starting on August 25, the City of Atlantic Beach will begin a project to replace the sidewalk along the south side of Plaza, from the five-way intersection to the entrance of the Post Office. Read on... VIEW ALL NEWS /CivicAlerts.aspx MEETINGS EVENTS MEETINGS September 2025 Sun Mon Tue Wed Thu Fri Sat 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Mon, Sep 22 City Commission Meeting Tue, Sep 23 Community Development Board (CDB) Meeting Wed, Sep 24 Environmental Stewardship Committee (ESC) Meeting VIEW FULL CALENDAR /Calendar.aspx EVENTS September 2025 Sun Mon Tue Wed Thu Fri Sat 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Thu, Sep 11 Tai Chi Sun, Sep 14 Yoga in the Park Sun, Sep 14 Farmers Market Mon, Sep 15 Yoga VIEW FULL CALENDAR /Calendar.aspx ATLANTIC BEACH COMMISSION Meet the Members Curtis Ford Mayor Bruce Bole Mayor Pro Tem - Seat 2 Thomas Grant Seat 3 Candace Kelly Seat 4 Jessica Ring Seat 5 Meeting Agendas Meeting Calendar Meeting Minutes /QuickLinks.aspx Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Submit a Request Get Involved Serve on a Committee Stay in the Know Subscribe to eNews Suscribe to Recreation eNews Volunteer /QuickLinks.aspx Helpful Links Archives Bids Budget Code of Ordinances Permits Public Notices Stay in the Know Tree Removal Permits Water/Sewer Services Watch City Commission Meetings /QuickLinks.aspx Using This Site Site Map Accessibility ADA Coordinator Announcements Calendar Contact Us Copyright Notices Events Fair Housing Stay in the Know /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "text": "Contact Safe Haven Community Services: Get in Touch for Foster, Kinship, and Adoption Support — Safe Haven Community Services 0 Skip to Content About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School Open Menu Close Menu Open Menu Close Menu About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School About Folder: Services Back Foster Care Kinship Care Adoption Folder: Training Back Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Folder: Care Giver Portal Back Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery Folder: FAQs Back Foster FAQs Kinship FAQs Adoption FAQs Donate English Back Back-To-School We take pride in delivering exceptional customer service. We Would Love To Connect With You… If you have any questions, please don't hesitate to contact us through the contact form. You can also reach us by email or phone from 9 a.m. to 5 p.m. CST, Monday through Friday. Click on one of the forms below and we will get back to you promptly . Foster Care Foster Care Inquiry Form What services are you interested in? Foster to adopt Foster (only) Respite (only) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for foster children? * Gender preference to foster: * boy(s) girl(s) Any gender Age preference to foster: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your foster care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . kinship care Kinship Care Inquiry Form What services are you interested in? Kinship-Foster to Adopt Kinship Straight to Adopt Kinship to Permanent Legal Conservatorship (PMC) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Name of child's kinship worker: First Name Last Name Phone of Child's kinship worker: (###) ### #### Name of caregiver(s) DFPS worker: First Name Last Name Phone of caregiver(s) DFPS worker (###) ### #### List all children placed in your care by DFPS: Child 1 First Name Last Name Child 1 DOB MM DD YYYY Child 2 First Name Last Name Child 2 DOB MM DD YYYY Child 3 First Name Last Name Child 3 DOB MM DD YYYY Child 4 First Name Last Name Child 4 DOB MM DD YYYY Child 5 First Name Last Name Child 5 DOB MM DD YYYY Child 6 First Name Last Name Child 6 DOB MM DD YYYY Thank you for reaching out to Safe Haven with your kinship care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Adoption Adoption Inquiry Form What services are you interested in? Foster to adopt Straight Adopt Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for adoption/foster children? * Gender preference to adopt: * boy(s) girl(s) Any gender Age preference to adopt: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your adoption inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . General Info General Information Name * First Name Last Name Email * Phone (###) ### #### Subject * Message * Thank you for reaching out to Safe Haven! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Email info@safehavencommunityservices.org Phone (713) 988-7233 (SAFE) Address 8100 Washington Ave. Suite 167 Houston, TX 77007 Sign Up For Our Newsletter Family Focused Treatment Association Partner Affiliates Texas Department of Family and Protective Services Child Welfare League of America Greater Houston Permanency Collaborative Safe Haven Community Services Safe Haven Community Services is a licensed and funded 501(c)(3) nonprofit child-placing agency under the Texas Department of Family and Protective Services EIN: 74-3025434 Additional Services Safe Haven Youth Ranch Selim Behavioral Health Contact Us 713.988.7233 (SAFE) Office Location 8100 Washington Ave, Suite 167 Houston, TX 77007 Site Home About Volunteer Family Gallery Sign Up For Our Newsletter Services Foster Care Adoption Kinship Care Training Annual Training New Family Training Donate CELEBRATING 20 YEARS OF SERVICE!"
    },
    {
      "url": "https://coab.us/43/Parks",
      "text": "Parks Division | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Guide to Atlantic Beach Parks Atlantic Beach Dog Park Beaches Veterans Memorial Park Merchant Marine Monument Bull Memorial Park & Adele Grage Donner Park and Community Center Donner Park Splash Pad Dutton Island Preserve Campsites @ Dutton Island Howell Park Jack Russell Park Oceanside Rotary Skate Park Russell Park Tennis Court / Skate Park Camera Johansen Park Jordan Park and Community Center Musical Play Garden River Branch Preserve Rose Park Tide Views Preserve Walking Tours Through AB Walking Track Home Departments Neighborhoods Department Parks Division Parks Division The City of Atlantic Beach features active and passive parks throughout the community, providing opportunities for recreational enjoyment. In addition, the City has more than two miles of white sandy beaches with ocean access, as well as a paddle trail in the Dutton Island and Tide Views Preserve (400 acres of marshland) on the Intracoastal Waterway. To report a maintenance concern with a City park, please email info@coab.us . Click here to reserve amenities at one of our parks for parties and other events and activities, and to reserve beach wheelchairs (this amenity is free). For other information about recreational permits or special events, contact the Recreation Division at (904) 247-5828 or email recreation@coab.us. Additional resources: Parks Master Plan Jacksonville Intracoastal Salt Marsh Paddling Guide Disability resources: Do you have an idea to make the City of Atlantic Beach parks more accessible for everyone? Email info@coab.us or call (904) 247-5804. Meanwhile, check out our Learning and Living with Disabilities Guide and Blog . Here is a spotlight on some of our parks and community centers Bull Memorial Park Ocean Boulevard, Seventh Street and East Coast Drive Named after Richard Bull. Located at 716 Ocean Blvd. A memorial rock honors the memory of Richard Bull, Robert B. David, Jack J. Ahern Jr and Solomon Sturdivant. An active park with the following amenities a tennis court, grill, playground, half basketball court, public restroom, and an open play area. Bull Park is also home to Adele Grage Cultural Center and Gulliford Hall. Adele Grage Cultural Center and Gulliford Hall 716 Ocean Boulevard Located in Bull Memorial Park, the Adele Grage Cultural Center and Gulliford Hall consist of 2,500 square feet with a meeting/reception room (open for public reservation), a full-use kitchen, computers, a small theater, and the City of Atlantic Beach Recreation and Special Events offices. Donner Park & Gail Baker Community Center 2072 George Street Named after E.H. Donner. An active park located at 2072 George Street with the following amenities: baseball/softball field, a flag football program, soccer practice field, pickleball courts, tennis courts, playground, two pavilions, two basketball courts, grills, and public restrooms. Donner Park is home to Gail Baker Community Center, which has a large community room, and a full kitchen -- and is available to reserve for parties and other events. The Center is home to the City's annual Fall Festival, Movies in the Park, and Holiday Toy Party, and has activities that include Homework Assistance/Tutoring, Senior Activities, and more. Dutton Island Preserve 1600 Dutton Island Way A passive park with the following amenities: 9,000 feet of nature trails, camping area, a fishing and viewing area, a canoe/kayak launch, pavilions, picnic area, and restrooms. A marked canoe trail navigates a paddle to Tide Views Park. Reservations are required for camping. Howell Park 810 Seminole Road Named after former Mayor Billy Howell. Located at 401 Seminole Road.  A passive park that has more than 2,000 feet of trails, a picnic area, and ponds. Jordan Park and Jordan Community Center 1671 Francis Avenue Named after Rev. William Holsey Jordan. An active park with a community center, playground, two basketball courts, two pavilions, grills, and public restrooms. Jordan Park is also home to the City’s annual Egg Hunt held the Saturday before Easter and The Beaches Habitat for Humanity Educational Assistance Program. A musical garden for people of all abilities sponsored by the Beaches Kiwanis Club and Florida League of Mayors! Rose Park 1 Orchid Street An active park with the following amenities: a soccer field, playground, and dog park. Jack Russell Park 800 Seminole Road Named after James L. Russell.  An active park with the following amenities: six tennis courts, two racquetball courts, Oceanside Rotary Skate Park, grills, three baseball/softball fields, a basketball court, a large pavilion, three picnic areas, two playgrounds, and a concession stand. Russell Park is home to the Atlantic Beach Athletic Association, First Coast Soccer, and Atlantic Beach Farmer's Market.  Also at Russell Park, the City hosts an annual Family Fun Day and Camp Out Under the Stars in October for area families. The Atlantic Beach Athletic Association is home to youth baseball and T-Ball leagues for boys and girls 3 to 12 years old.  For more information on spring or fall sign-ups, call (904) 434-8283, email president@abbaseball.com,  or visit the Atlantic Beach Baseball website . Tide Views Preserve 1 Begonia Street A passive park with the following amenities: a scenic view of the Intracoastal Waterway, 2,500 feet of nature trails, restrooms, canoe/kayak launch, a fishing area, and Sunset Pier. Johansen Park 1300 Seminole Road Named after Preben Johansen.  Located between West Park and East Park Terraces, Johansen Park is a 12-acre passive park in the Selva Marina neighborhood. Just blocks from the ocean, Johansen has a canopy of trees and grassy areas for picnicking. This park hosts the Spring Arts in the Park with food and music and displays from many local artists; Theatre in the Park: Beaches WellFest; and the AB Jazz Festival. It also has an official City Heritage Tree . Selva Preserve 11th Street and Selva Linkside Selva Preserve is a protected piece of land conserved for its environmental benefits and public use. The preserve provides vital wildlife habitat and helps with stormwater management for the surrounding community. It also has a beautiful trail for recreation and exercise. History and Conservation In 2018, the City of Atlantic Beach acquired the Selva Preserve property with assistance from the non-profit organization, The Public Trust. This acquisition was a \"win-win solution\" that allowed for the construction of five single-family homes on the upland portion of the property while preserving the wetland areas. The name \"Selva\" is associated with the larger Selva Marina neighborhood, a well-established community that was once home to the Selva Marina Country Club. The country club, now the Atlantic Beach Country Club, and the surrounding residential area have a long history in the city, with the Selva Preserve being a part of this larger community. Amenities and Activities While Selva Preserve is a protected space, it's also designed for public enjoyment. The conservation agreement included a provision for creating a greenway, or trail, for the public to use. This enables residents and visitors to enjoy the natural beauty of the area. The preserve is a testament to the City's commitment to balancing urban development with the preservation of natural landscapes. Selva Preserve Map Selva Preserve Fact Sheet Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://coab.us/38/Boards-and-Committees",
      "text": "Boards and Committees | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Home City Hall City Commission Boards and Committees Boards and Committees Citizen involvement is vitally important to the City of Atlantic Beach. Democracy requires participation. If you want to serve your fellow citizens and get up front and personal with local government, we encourage you to review the opportunities below: STANDING COMMITTEES • Board Member Review Committee (BMRC) • Community Development Board (CDB) • Environmental Stewardship Committee (ESC) • Arts, Recreation, and Culture Committee (ARCC) • General Employees’ Pension Board of Trustees (G-PBOT) • Police Officers’ Pension Board of Trustees (P-PBOT) Board and Committee meeting videos To view Board and Committee meeting videos, visit https://atlanticbeachfl.swagit.com/boards ADA notice: If you like for us to provide a meeting video with closed-captioning, please email cityclerk@coab.us or call (904) 247-5809. Join A Board or Committee To be considered for a board or committee, you must first complete an online application. Click Here to access the application page. Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://coab.us/463/Atlantic-Beach-Dog-Park",
      "text": "Atlantic Beach Dog Park - 268 Aquatic Drive | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Atlantic Beach Dog Park Beaches Veterans Memorial Park Merchant Marine Monument Bull Memorial Park & Adele Grage Donner Park and Community Center Donner Park Splash Pad Dutton Island Preserve Campsites @ Dutton Island Howell Park Jack Russell Park Oceanside Rotary Skate Park Russell Park Tennis Court / Skate Park Camera Johansen Park Jordan Park and Community Center Musical Play Garden River Branch Preserve Rose Park Tide Views Preserve Home Departments Neighborhoods Department Parks Division Guide to Atlantic Beach Parks Atlantic Beach Dog Park Atlantic Beach Dog Park - 268 Aquatic Drive Dog Park to be closed the week of Sept. 15, 2025 Dog Park to be closed the week of Sept. 15, 2025 Just a heads up, the Aquatic Dog Park will be closed the week of September 15th for some improvements. We'll be re-sodding the area and adding dirt under the walking path to fix some severe erosion. We're excited for you and your furry friends to see the new-and-improved park! Hours Open from 7 a.m. to 8 p.m. (as of July 2025). If hours are adjusted, the new hours will be posted here. Park may be closed for maintenance, as needed. Dog Park membership Please print and complete the Application, Waiver and Park Rules Form and the Record of Shots Form below.  Shot records must be completed and signed by a Veterinarian before access cards and dog tags will be issued.  Bring completed forms to the Cashier’s Counter at City Hall, 800 Seminole Road, with your payment. The membership fee is $50 per year for the first dog and $25 for each additional dog (three dogs are allowed), plus sales tax.  Memberships are on a calendar-year basis, expiring on Dec. 31 of each year. Member fees are prorated for partial-year memberships (see 2025 Fee Schedule ).  Lost cards may be replaced for $15. Dog Park Documents Dog Park Application, Waiver, and Park Rules Forms Dog Park Record of Shots Form Dog Park 2025 Fee Schedule Tips for Using the Dog Park Report problems or issues with the Dog Park here or email info@coab.us. Frequently Asked Questions Where is the Dog Park? 268 Aquatic Drive just off Atlantic Boulevard next to Sunrise Community Church and across from Beaches Aquatic Center. Are there separate areas for small and large dogs? Yes, there is a separate fenced, gated area for small dogs, although any registered dog may be in the large dog area at the owner’s discretion. Is there fresh drinking water? Yes, there is fresh drinking water for the dogs and their escorts (non-filtered, non-chilled tap water). What amenities are in the park? Park amenities include a dog rinsing station, fresh water drinking stations, poop bag dispensers, trash cans, and benches. Your dog must be off leash once inside the park. The hours of operations are from 7:30 a.m. to dusk.  The park may be closed for maintenance as needed. Are there restrooms at the park? No. Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.tdrpd.org/27/About-Us",
      "text": "About Us | Truckee-Donner Rec & Park, CA Skip to Main Content Facebook Instagram YouTube Search About Us Facilities Programs Register Online Activity Guide Home About Us 2024 Annual Report Inspiring Creative, Active Lives for a Healthy Mountain Community TDRPD has been providing recreation and park services since 1963. The District philosophy is to provide recreation and park programs and facilities for everyone in the community.  Research data shows that 75% of our 17,000 population is involved with a District program or uses a facility every year.  The District has a history of working with citizen groups to generate volunteers and funding for new facilities. Financial Statements District Map District Boundary Map TDRPD's district spans throughout 2 counties (Nevada County & Placer County) TDRPD has been progressive and creative in its development of facilities History 2022 Truckee Regional Park Lighting and Field Alignment Project - $1,000,000 for new start of the art lighting and fields realigned to accommodate all field sports - Park Bond Act grant of $180,000 Contractors Association of Truckee Tahoe builds a downtown park at Community Art Center with donated funds of $800,000. District receives $52,000 grant from Nevada County for the project Tahoe Food Hub donates and installs a Growing Dome at Regional Park 2021 Land lease with Sierra Nevada Children’s Museum to build children’s museum at Regional Park Land lease with Friends of the Library to build a library at Regional Park Phase 6 of Truckee Bike Park completed with community donations of $75,000 Received grant of $396,000 from the State of California for covid relief Received $1.7 million grant from California Boating & Waterways for Donner Lake Boat Ramp Renovations Contractors Association of Truckee Tahoe builds a downtown park at Community Art Center 2020 Ponderosa Golf Course Irrigation project .  Grant from Truckee Tahoe Airport District for $1,000,000 and a grant from Truckee Donner Public Utility District for $227,000 Received grant from Back Country Alliance for parking improvements to West End Beach to utilize during winter months. Received $150,000 grant from California Arts Commission for Forest/Fire art exhibit 2019 Recreation area master plan for Regional Park completed 2018 Phase 5 of Truckee Bike Park completed - $100,000 project with donated community funds Tahoe Pyramid Bike way Project - $1,000,000 State of California Grant 2017 TDRPD wins CARPD Award for Best Recreation & Park District in California We are currently working with a citizen group to build a new skate park. To-date the group has raised $100,000+ for the project, see more information here about the proposed Rocker Memorial Skatepark . Currently working with a citizen group to complete Phase 5 of the Truckee Bike Park (at $100,000) with hopes to increase the estimated 45,000 visitations per year 2016 The district received $2.1 million grant from the State of California for the next phase of the Tahoe Pyramid Bikeway . Construction to begin in 2017 Completed and opened the Truckee Community Swimming Pool , a 26,000 sq.ft facility that includes a recreation pool and competition lap pool ($9.2 million total) Received $50,000 grant from the Truckee Rotary Community Foundation to install new HVAC systems at our Community Arts Center Refinanced District Certificates of Participation for a savings of $165,000 per year and $3.5 million total over the life of the bond 2015 District raised $1.9 million from community donations to build the Community Swimming Pool Truckee Professional Rodeo donated funds to install a sponsor’s deck at the Rodeo Arena ($25,000 total cost) District completed a section of the Tahoe Pyramid Bikeway from Farad to Puny Dip at a cost of $634,000 with a State of California grant for $425,000 and $209,000 donation from the Tahoe Pyramid Bikeway Foundation Phase 4 of the Truckee Bike Park was completed with volunteer labor and community donations at the cost of $100,000 2014 Renovated our former recreation center into a Performing Arts venue with District funds of $200,000 and community donations of $100,000 in services, material, and labor Working with the Truckee Donner Railroad Society, a miniature riding train was installed at Truckee River Regional Park that's given over 6,000 rides free-of-charge Phase 3 of the Truckee Bike Park was completed entirely with volunteer labor and community donations at the cost of $90,000 In conjunction with and funded by the Truckee Public Art Committee, artistic bike racks were installed at various parks 2013 Constructed the second phase of Truckee Bicycle Pump Track with volunteer labor and community donations with material costs at $60,000 in addition to a District contribution of $15,000 2012 Constructed one-acre Truckee Bicycle Pump Track (to compliment current BMX track) entirely with volunteer labor and community donations with material costs at $50,000 along with a District contribution of $15,000 2011 Created a volunteer Public Art Commission which creates public art displays at the Community Recreation Center showcasing adult and youth art every quarter 2010 The district received Best Recreation & Park District in the State of California from the California Association of Recreation & Park Districts 2009 Constructed 40,000 sq.ft. Community Recreation Center at $7 million under budget The new facility includes a two-court gymnasium, indoor running track, exercise equipment, two climbing walls (top-rope and bouldering), preschool/afterschool rooms, dance/exercise rooms, community classrooms, meeting spaces, pro kitchen facilities, District offices, community art displays, various seating areas, and fireplaces. Funded with grants ($785,000), developer fees, donations ($130,300), and certificates of participation, the new Community Recreation Center won the CARPD Award for the Best New Facility in the State of California 2008 Town of Truckee, Truckee Airport District, and Truckee Donner Land Trust purchased a local private golf course and donated it to TDRPD at the cost of $3.6 million Ponderosa Golf Course is now operated by TDRPD and opens to the public at reduced rates 2007 Received grants and donations to establish a sailing program for youth and adults ($31,000) Received grant ($65,000) for Legacy Trail 2006 Received California Energy Commission grant of $20,000 for energy saving measures 2005 Completed renovation of Community Pool at Truckee High School Bocce ball courts installed at River View Sports Park Worked with Truckee Donner Public Utility District to construct a Biomass demonstration building (alternative energy heat source burning wood chips) paid by the utility district at the cost of $250,000, then re-purposed as the TDRPD mechanic's shop 2004 District negotiated with a developer for the donation of a 14-acre parcel for the location of the new community center at a value of $3,000,000 The district received CARPD Award for the Best Recreation & Park District in the State of California 2003 Completed Phase 2 of River View Sports Park including two sports fields, bathroom, picnic shelter, parking, playground equipment, and a BMX track Funded by a loan ($2,000,000 at 2.9%) from the CIEDB and a $490,000 grant from the State Park Bond Act of 2000 The District received the CARPD Award for the Best New Facility in the State of California for the River View Sports Park 2002 Completed Phase 1 construction of two fields at River View Sports Park, funded entirely by mitigation fees and with land donated by Sanitation Agency on a long term lease (valued at $1,000,000) Partnered with Children’s Museum to build an interactive museum and indoor playground ($400,000 from grants and donations) 2001 District staff built an outdoor ice rink with refrigeration equipment, dasher boards, and flooring purchased from other closed ice rinks (saving $100,000 in startup costs) 2000 Built a handicap-accessible fishing pier ($131,000) with a grant from Fish and Game, providing the only handicap-accessible fishing pier in Reno/Tahoe region 1999 Built only the second park district-owned skate park in California by negotiating with a contractor to save $100,000 TDRPD provides varied Recreation Programs for all ages in the community as shown below: Youth Sports for grades 1-12, including basketball, girls softball, ice hockey, lacrosse, flag football, golf, sports camps, triathlon, track, downhill, and sailing Adult sports including softball, basketball, volleyball, disc golf, golf, tennis, soccer, indoor soccer, rock climbing, pickleball, ping pong, bocce ball, women and men’s ice hockey, broomball Teen programs including dances, classes, trips, sports, camps. Preschool and afterschool programs, camps, trips. Family programs including concerts (our free weekly summer concerts attract an average of 1500 people per show). special events (Easter Egg Hunt, Halloween Parade, ski swap, Big Truck Day, July 4 th (attracting 5,000 people) Aquatic programs including swim lessons for children in Truckee through the schools, private lessons, special events, lap swimming, recreation swimming, exercise and scuba classes, birthday parties Fifty contract classes including exercise classes, art, crafts, ceramics, , music, investment, life coaching, dance, acting, yoga, martial arts, foreign language, wellness, puppy & dog training, gardening, ice skating lessons, etc. Adult and Youth Theater Special needs population classes including ceramics, exercise, water aerobics. TDRPD has been on the cutting edge of new innovations, programs and facilities for many years. We realize that there is more to recreation than traditional programming.  The District continues to develop programs and facilities to meet the changing needs of our community.  We have a dedicated staff that always gives the extra effort and searches for ways to make new ideas happen, as seen by our accomplishments above.  People continually comment on how the District is the best part of our community and that they are amazed at all the offerings and facilities we provide. We offer programs and facilities that equal communities many times our size, because of our creative funding, volunteer efforts, and complete dedication to providing quality recreation opportunities for Truckee. Agendas & Minutes Employment Athletics Recreation Leader Preschool Teacher Swim Instructor Climbing Wall Instructor Recreation Leader Aqua Fitness Instructor Board of Directors Staff Directory Finance Policy Manual Bids TDRPD Email Newsletter Subscription Master Plan Survey Agendas & Minutes Employment FAQs Rentals Blog Staff Directory Employment Rentals Locations Sponsorships Events FAQ /QuickLinks.aspx 10981 Truckee Way Truckee, CA 96161 Phone: 530-582-7720 Fax: 530-582-7724 info@tdrpd.org © 2020 Truckee-Donner Recreation & Park District Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.coab.us/Directory.aspx",
      "text": "Staff Directory • Atlantic Beach • CivicEngage Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Meeting Videos Staff Directory Home Staff Directory Staff Directory Search the Directory Category: Staff Directory City Attorney City Clerk's Office City Commission City Manager Engineer Finance Utility Billing and Customer Service Human Resources Information Technology Neighborhoods Building Parks Planning/Community Development Code Enforcement Recreation Police Animal Control Public Utilities Public Works First Name: Last Name: Search The following is an alphabetical listing of the various departments located within our organization. Click on any of the departments for a listing of the contacts within that department. Categories Telephone City Attorney 904-247-5813 City Clerk's Office 904-247-5821 City Commission 904-247-5809 City Manager 904-247-5817 Engineer Finance 904-247-5800 Utility Billing and Customer Service 904-247-5816 Human Resources 904-247-5820 Information Technology 904-247-5858 Neighborhoods Building 904-247-5826 Parks Planning/Community Development 904-247-5800 Code Enforcement 904-247-5855 Recreation 904-247-5828 Police 904-247-5859 Animal Control 904-247-5866 Public Utilities 904-247-5886 (Monday-Friday 7:30am-4:30pm) Public Works 904-247-5834 (Monday-Friday 7:30am-4:30pm) Address Holder http://www.coab.us/directory.aspx?DID= Enter search terms to display a list of entries in the Staff Directory. JavaScript is required, and must be turned on, for a listing to appear on this Directory entry page. We apologize for any inconvenience this may cause. Live Edit Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Contact First Name Last Name Email Department - Select Department - Dining Events Media / Press General Admission Weddings Corporate Groups Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://coab.us/Directory.aspx?did=83",
      "text": "Staff Directory • City Manager Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Meeting Videos Staff Directory Home Staff Directory City Manager Physical Address: 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904-247-5817 Fax: 904-247-5805 City Manager Staff Members Staff Name Title Email Phone Additional Phone Killingsworth, Bill City Manager 904-247-5817 HOGENCAMP, KEVIN DEPUTY CITY MANAGER 904-247-5804 WALSH, ADRIANNA EXECUTIVE ASSISTANT TO THE CITY MANAGER 904-247-5808 Return to Staff Directory Live Edit Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/fall-festival-city-atlantic-beach-recreation-special-events",
      "text": "Fall Festival - City of Atlantic Beach Recreation & Special Events | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Fall Festival - City of Atlantic Beach Recreation & Special Events *The event has already taken place on this date: Sat, 10/09/2021 Come down to the Gail Baker Community Center for our Fall Festival on October 9 from 11 a.m. - 2 p.m. This free, family-friendly event will have something for everyone. Enjoy food, games, music, and crafts. Be sure to bring your lawn chairs and enjoy the day with family and friends. Click here for more information about this activity Please help us keep this calendar up to date! If this activity is sold out, canceled, or otherwise needs alteration, email mindy@kidsoutandabout.com so we can update it immediately. If you have a question about the activity itself, please contact the organization administrator listed below. City of Atlantic Beach Cultural Arts & Recreation Department *Times, dates, and prices of any activity posted to our calendars are subject to change. Please be sure to click through directly to the organization’s website to verify. Location: Donner Park Community Center, Atlantic Beach, FL 2072 George St, Atlantic Beach , FL , 32233 United States See map: Google Maps Phone: 904-247-5834 Contact name: Kevin Hogencamp Email address: khogencamp@coab.us Click for more information The event has already taken place on this date: 10/09/2021 Time: 11am - 2pm Price: FREE Ages All Ages Adults & kids together Adults without kids Tags: Event Annual event Festival/fair Food event Giveaway Outdoors Event Performance Fall Arts Health / fitness Outdoors Nature/Outdoors Hands-on Arts and Crafts Arts: Performance Music Web Service Pinterest Share on Facebook Tweet Widget Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.tdrpd.org/156/Community-Rec-Center",
      "text": "Steve Randall Community Recreation Center | Truckee-Donner Rec & Park, CA Skip to Main Content Facebook Instagram YouTube Search About Us Facilities Programs Register Online Activity Guide Home Facilities Community Rec Center Steve Randall Community Recreation Center The Steve Randall Community Recreation Center is a multi-use facility complete with a gymnasium, fitness center, climbing wall, dance room, meeting rooms, kitchen, and more. TEEN CODE OF CONDUCT FORM MAIN OFFICE HOURS Mon.-Fri.: 8:30am - 5:30pm Sat.-Sun.: Closed Closed Wed.: 12pm - 1pm Schedules Fitness Center Mon. - Fri. 6am-8pm Sat. 8am-1pm Sun. 8am-12pm Adult (18+) Drop-In Pickleball Tue. & Thu. 10:30am - 2:30pm Sun. 8am - 12pm Mon. & Fri. 1:30pm-3:30pm Adult (18+) Drop-In Basketball Mon., Wed. & Fri. 11:30am - 1:30pm Rent Out the Recreation Center Meeting Rooms Capacity: 50 people per room (4 rooms total) seated without tables/30 dining Rental Fee Includes: Timing: 6am-11pm (cleanup | exit of facility completed by 11:30pm) Staff during arrival time and exit time Public Wi-Fi Power outlets available One large room splits into four smaller rooms: 50 people per room, 200 max all four rooms Room #3 includes sink (handwashing only) Rooms #2 and #4 have outside patio access Kitchen use for additional fee Tables and chairs included tablecloths recommended (Max Tables: 20, Max Chairs: 200) Gymnasium Full Gym C apacity: 1200 people seated without tables/ 500 dining Rental Fee Includes: Timing: 6am-11pm (cleanup | exit of facility completed by 11:30pm) Staff during arrival time and exit time ½ Gym rentals for sports only - Special Events must rent Full Gym 6 Basketball Hoops, 4 Pickleball Courts, 2 Volleyball Courts Public Wi-Fi Tables and chairs included ( Max tables: 50, Max chairs: 500 ) Kitchen with serving window use for additional fee Fitness Center FITNESS CENTER Mon. - Fri. 6am-8pm Sat. 8am-1pm Sun. 8am-12pm Dance Room Capacity: 20 people Rental Fee Includes: Timing: 6am-11pm (cleanup | exit of facility completed by 11:30pm) Wooden dance floor & Mirrors Staff during arrival time and exit time Public Wi-Fi Lawn Area Capacity: 250 people Rental Fee Includes: Timing: 6am-11pm (cleanup | exit of facility completed by 11:30pm) Staff during arrival time and exit time Kitchen use for additional fee Conference Room Capacity: 10 people Rental Fee Includes: Timing: 6am-11pm (cleanup | exit of facility completed by 11:30pm) Staff during arrival time and exit time Seating for 10, executive chairs Public Wi-Fi White-Board Screen available, no projector Angelo Tenorio Athletic Program Supervisor Email Angelo Caroline Bechdolt Athletic Program Coordinator Email Caroline Fitness Track Climbing Wall Preschool Kids Korner Butterfly Display Agendas & Minutes Employment FAQs Rentals Blog Staff Directory Employment Rentals Locations Sponsorships Events FAQ /QuickLinks.aspx 10981 Truckee Way Truckee, CA 96161 Phone: 530-582-7720 Fax: 530-582-7724 info@tdrpd.org © 2020 Truckee-Donner Recreation & Park District Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://coab.us/2132/Special-Event-Request",
      "text": "Special Event Request | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Permits Rentals Reserve a Wheelchair Special Event Request Home Departments Neighborhoods Department Recreation Division Permits & Rentals Special Event Request Special Event Request Planning a Large Special Event? If your event meets any of the following criteria, it requires special approval from the City of Atlantic Beach: Over 50 attendees Involves vendors (e.g., food trucks, wedding planners, DJs, face painters) - bounce houses/inflatables are NOT allowed. Includes a road closure Request for alcohol exemptions Needs City equipment or staff (e.g., park rangers, tables, extra trash cans) A minimum of 60 days' notice is required for review and approval. Depending on the nature of your event, you may be responsible for: Hiring City staff (e.g., off-duty officers, park rangers) Providing extra portable toilets Providing a facility deposit that will be refundable after the event To begin the process: Fill out a Special Event Request at www.coab.us/recpermits . Our team will review your submission and provide the next steps. Please note that completing the form does not mean that your event will be approved. Questions? (904) 247-5828 recreation@coab.us Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "http://www.coab.us/Facilities/Facility/Details/Donner-Park-amp-Gail-Baker-Community-Cen-7",
      "text": "Facilities • Donner Park & Gail Baker Community Center Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Home Facilities Get Directions Google Bing Donner Park & Gail Baker Community Center 2072 George Street Atlantic Beach, FL 32233 Rating This facility has not yet been rated. Facilities Feature Overview View all facilities Donner Park & Gail Baker Community Center 1 Donner copy.jpg Features Baseball / Softball Basketball Football Grill Internet Meeting Rooms Parking Pavilion Picnic Areas Playground Restrooms Tennis Water Donner Park –\r\nNamed after E.H. Donner. An active park located at 2072 George St. with the\r\nfollowing amenities: a baseball field,\r\ntennis/pickleball court, playground, two pavilions, two basketball courts, grills, and restrooms. Donner Park is also home\r\nto the Gail Baker Community Center. Click HERE to reserve. ▲ Back to top Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://coab.us/Facilities/Facility/Details/Donner-Park-amp-Gail-Baker-Community-Cen-7?p2df",
      "text": "Facilities • Donner Park & Gail Baker Community Center Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Home Facilities Get Directions Google Bing Donner Park & Gail Baker Community Center 2072 George Street Atlantic Beach, FL 32233 Rating This facility has not yet been rated. Facilities Feature Overview View all facilities Donner Park & Gail Baker Community Center 1 Donner copy.jpg Features Baseball / Softball Basketball Football Grill Internet Meeting Rooms Parking Pavilion Picnic Areas Playground Restrooms Tennis Water Donner Park –\r\nNamed after E.H. Donner. An active park located at 2072 George St. with the\r\nfollowing amenities: a baseball field,\r\ntennis/pickleball court, playground, two pavilions, two basketball courts, grills, and restrooms. Donner Park is also home\r\nto the Gail Baker Community Center. Click HERE to reserve. ▲ Back to top Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://coab.us/Directory.aspx?did=79",
      "text": "Staff Directory • Public Utilities Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Meeting Videos Staff Directory Home Staff Directory Public Utilities Physical Address: 902 Assisi Lane Jacksonville, FL 32233 Phone: 904-247-5886 (Monday-Friday 7:30am-4:30pm) Emergency Phone: AFTER HOURS ONLY 904-247-5834 Staff Name Title Email Phone Additional Phone STEPHENS, TROY Public Utilities Director 904-247-5875 WALKER, CHRIS Division Director 904-247-5878 SMITH, JAMIE Administrative Assistant 904-247-5886 Return to Staff Directory Live Edit Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://bpca.ny.gov/about/leadership/",
      "text": "Leadership - BATTERY PARK CITY AUTHORITY\t\t -\t\tBATTERY PARK CITY AUTHORITY Leadership Your browser does not support iFrames HUGH L. CAREY BATTERY\n\t\t\t\t\t\t\t\t\tPARK CITY AUTHORITY Sign Up to Receive Our Newsletter! Leave this field empty if you're human: Sep 09 Rain 0 in Temp 71 °F Wind 2.24 mph Tide High tide: HIGH 10:08 PM Low tide: Low 4:23 PM About Who We Are Leadership Board Meetings & Materials Visit Museums & Memorials Public Art Public Spaces Parks Get Around Community Center 6 River Terrace Bring Your Class Events Event List Annual Events Event Calendar News Press Blog Alert Subscription Apply Procurement Opportunities Employment Opportunities Permits Residential Life Public Safety Buildings Closing Information Schools Get Involved ReadyBPC Housing Affordability BPC Seniors Resiliency and Sustainability Resiliency Sustainability Biodiversity Public Info Newsletter Sep 09 Rain 0 in Temp 71 °F Wind 2.24 mph Tide High tide: HIGH 10:08 PM Low tide: Low 4:23 PM Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann is an urban planner who has worked on planning, housing, parks, and infrastructure challenges for almost 20 years in New York City. He joins BPCA from design and engineering firm Arup, where he was an Associate Principal and the City Planning Leader for the East Coast working on transportation, housing policy, and climate adaptation projects. Prior to Arup, Raju was the Director of Land Use and Deputy Chief of Staff for the New York City Council, where he led a team of planners and lawyers working with Council Members, City agencies, and communities to develop planning strategies for neighborhoods across New York City. Raju grew up in Morningside Heights and now lives in Brooklyn. He received his BA in Philosophy from Columbia University and his MA in Urban Planning from the University of Michigan. He is a board member of MoMA PS1 and on the advisory board of the New York Housing Conference. DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 Donald Capoccia is the managing principal and founder of BFC Partners, a real estate development company that has been involved in the planning, development and construction of some 12,500 units of housing in New York City with a combined value of $4.5B. His projects also include approximately 2,000,000SF of neighborhood retail and community facility uses. Mr. Capoccia began his development and construction activities in New York City in 1982, just prior to the completion of a Masters Degree Program in Urban Planning at Hunter College, and after completing a BA in Urban Studies from the University of Buffalo in 1979. Mr. Capoccia and BFC have focused predominately on the production of affordable housing, investing in a concentrated geographic strategy that has helped spur the resurgence of key New York City neighborhoods; the East Village, East Harlem, Williamsburg and Downtown Brooklyn. Mr. Capoccia has pioneered the production, and promoted the importance of affordable home ownership opportunities to these neighborhoods. Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha is a senior executive with over 30 years of experience at some of the world’s largest and most complex global financial institutions. She is a strategic leader, problem solver and collaborator. In her latest role at AIG she served as Executive Vice President and Chief Information Officer, leading technology strategy and operations worldwide. Martha joined AIG in 2015 as Chief Auditor, where she transformed the Audit operating model by promoting more active stakeholder engagement during global change initiatives, and set up an organization with a proven track record of delivering measurable, sustainable results that drive business performance. Prior to AIG, Martha spent three decades at JPMorgan, where she drove the creation and execution of strategies to transform disparate teams and infrastructures to achieve simplified and high-performing outcomes in audit, compliance, credit risk, technology and operations. She also played a leadership role in all of the merger and integration efforts that are now part of the JPMorgan Chase operating platform. Martha is a graduate of Cornell University, with a B.S. in Human Development and Family Studies and a M.B.A. in Accounting and Finance. Martha has a longstanding commitment, both personally and professionally, to the advancement of women and girls and serves as Board Co-Chair of the Women’s Refugee Commission. She believes passionately that women’s contributions play a critical role in the community, business and government. LESTER PETRACCA Member Confirmed June 20, 2013 LESTER PETRACCA Member Confirmed June 20, 2013 As President of Triangle Equities, Lester Petracca has transformed a family owned business, which began in 1916 as a specialized construction firm, into a thriving, successful, full-service real estate company. Triangle Equities opened its doors in 1992, specializing in public/private partnerships developing real estate throughout New York. These successful projects include the recent development of Triangle Junction, a 300,000 square foot Target anchored center in the heart of Brooklyn, contributing to the revitalization of the Flatbush Avenue retail corridor. Additionally, Triangle had previously worked with the City and local community groups to bring both Triangle Plaza and Triangle Center to the Queens neighborhood of College Point, creating retail and entertainment projects that were also catalysts for revitalization.These are just a few of Triangle Equities’ projects which illustrate the success of working hand in hand with public entities and community groups. Triangle continues to create, own, manage and operate quality developments throughout the New York Metropolitan area. Mr. Petracca prides himself in working closely with the communities in which he invests and develops. He actively contributes to: Queens Chamber of Commerce, Brooklyn Center for the Performing Arts, Flatbush Development Corporation, College Point Board of Trade, YMCA, American Cancer Society, MS Society, Queens Child Guidance, Queens Theater in the Park, Tuesdays Children, and Manhasset Police Athletic League. Mr. Petracca has successfully built a business based on sincerity, respect and loyalty. Triangle has consistently grown with Mr. Petracca’s leadership that initiates hard work and dedication. CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 Catherine McVay Hughes served 20 years on Manhattan Community Board 1, more than half that time as Chair or Vice-Chair. She also chaired its World Trade Center Redevelopment Committee for seven years. She has been a leader in caring for the community by working with diverse community and labor groups, elected officials and governmental agencies at City, State and Federal levels. After Superstorm Sandy, she was appointed Co-Chair of New York Rising Community Reconstruction Program for Southern Manhattan and is a founding member of CB1’s “Manhattan Tip” Resiliency Task Force and a member of the NY/NJ Metropolitan Storm Surge Working Group. She was also appointed to the Princeton University School of Engineering and Applied Science Andlinger Center for Energy and the Environment External Advisory Council, Climate Coalition for Lower Manhattan: FiDi-Seaport Resilience Master Plan, CERES Presidents Council, Lower Manhattan Development Corporation, and South Street Seaport Museum Board. She also served on the Earth Institute at Columbia University Advisory Board, Downtown Alliance Board of Directors, The Trust for Governors Island, The Battery Conservancy Board of Trustees, Manhattan Solid Waste Advisory Board and US EPA WTC Expert Technical Panel. McVay Hughes has a Master of Business Administration from The Wharton School of the University of Pennsylvania (1987) and a Bachelor of Science degree in Civil Engineering from Princeton University (1982). Anthony Kendall Member Confirmed June 20, 2018 Anthony Kendall Member Confirmed June 20, 2018 Anthony “Tony” S. Kendall was elected Chairman and Chief Executive Officer of Mitchell & Titus, LLP, the nation’s largest minority controlled accounting and consulting firm in 2009. As Chief Executive Office he is responsible for the vision, leadership and strategic direction of the firm. Tony has approximately 30 years’ experience providing professional services to Fortune 500 companies and various industries, including telecommunications, financial services, technology, hospitality, multimedia and entertainment. His clients also include emerging market entities, partnerships, private foundations and the Federal government. Tony has provided advisory services including investigative and dispute resolution services, wind-down accountings and expert witness testimony for a number of corporations and professional service firms. Tony earned an MBA in Finance and Taxation and a B.S. in Accounting from Binghamton University, and he graduated from Harvard Business School’s Owner/President Management Program. He is a Certified Public Accountant in New York, Illinois, Kentucky, and Tennessee and in several other states. Tony is also a Certified Fraud Examiner. Tony is the Audit Committee Chairperson for the Alvin Ailey American Dance Theatre and the National Urban Fellows. His civic and community involvement includes: past president of The Binghamton University Alumni Association and board member of the University’s Foundation and he served on the Honorable Scott M. Stringer, New York City Comptroller’s, Transition Committee. Recently, Tony served on the Public Company Accounting Oversight Board’s (PCAOB’s) Standing Advisory Group. Additionally, Tony formerly served as the Audit Committee Chairperson for Project Renewal, Inc.; the Upper Manhattan Empowerment Zone; and was a board member of the New York State Society of Certified Public Accountants’ Career Opportunities in the Accounting Profession program to name a few. Tony has won numerous awards and recognition and has moderated and participated on many panels. In 2012, New York’s WPIX-TV featured Tony in a special segment on CEOs in honor of Black History Month. ANGELA PINSKY Member Confirmed June 6, 2024 ANGELA PINSKY Member Confirmed June 6, 2024 Angela Pinsky is Head of Government Affairs and Public Policy for Google New York, where she manages public and government relations in the Tri-State area. Previously, Angela served as Executive Director for the Association for a Better New York (ABNY), Senior Vice President for Management Services and Government Affairs at the Real Estate Board of New York (REBNY), and as Deputy Chief of Staff at the Office of the Deputy Mayor for Economic Development and Rebuilding during the Bloomberg administration. In addition to BPCA, Angela currently serves as a board member for the Meatpacking BID, Building Skills New York and the Regional Plan Association. Angela received her Masters in Urban Planning from New York University and her Bachelors of Arts from Johns Hopkins University. CLINTON PLUMMER Member Confirmed June 6, 2024 CLINTON PLUMMER Member Confirmed June 6, 2024 Clint serves as Chief Executive Officer of Rise Light & Power in New York City, where he oversees the operations of the existing generation facility as well as the development of new projects, strategic partnerships, and the transition of the Ravenswood into a premier energy provider as part of New York’s CLCPA and other initiatives. Clint is the Project Executive and has developed and implemented strategies that secured revenue agreements and other key entitlements necessary for the construction of several ground-breaking projects. A 15-year veteran of New York’s clean energy industry, Plummer previously served as Head of Market Strategies and New Projects for Ørsted U.S. Offshore Wind, a leading offshore wind developer. In this capacity, he secured customer agreements for more than 2GW of new offshore wind projects in New York and New Jersey. Previously, Plummer worked as Vice President of Development for Deepwater Wind, where he grew its United States market for offshore wind energy and positioned it as a respected and responsible market leader. From 2009 to 2011, Plummer led the pre-construction development of Deepwater Wind’s Block Island Wind Farm, the first of its kind in the United States. In 2013, he spearheaded the company’s successful efforts to acquire the Bureau of Ocean Energy Management’s first competitively leased offshore wind site, as well as to scope the project now known as Deepwater ONE. Additionally, Plummer drove the company’s successful efforts to secure a Power Purchase Agreement with the Long Island Power Authority for the South Fork Wind Farm, the first in New York. Allie Atlas Chief of Staff Allie Atlas Chief of Staff Allie Skayne Atlas currently serves as the Chief of Staff of the Battery Park City Authority. Prior to joining the Authority, she served as the Chief of Staff of the New York City Department of Education’s Division of Teaching and Learning, overseeing five offices comprised of 600 staff members and a budget of more than $500M. In addition to supporting day-to-day operations, Ms. Atlas led high-priority work, including staff professional development, communications, new program design, and union negotiations. She also worked at the NYC Criminal Justice Coordinator’s Office where she was the program manager for an interagency task force on truancy, chronic absenteeism, and school engagement, and spent time at the 9/11 Memorial & Museum in public affairs in the lead up to the Memorial’s opening in 2011 through its first year of operation. Ms. Atlas has a Master’s Degree in Public Administration with a focus in policy analysis from NYU’s Wagner Graduate School of Public Service and a Bachelor of Arts in English and American Literature from NYU. Sharmila Baichu Chief Human Resources Officer Sharmila Baichu Chief Human Resources Officer Sharmila Baichu is a Human Resources professional with over 20 years of experience in graduated roles.  She has worked in both the public and private sectors including financial services, healthcare and most recently construction. She also held an HR Director role with Hudson River Park Trust.  Teaching is Sharmila’s second passion. As such, she taught 2nd and 3rd grades in Bedford Stuyvesant, Brooklyn and test preparation for the SAT and SHSAT.  Sharmila holds a Bachelor of Business Administration Degree from Pace University and a Masters of Early Education from Long Island University.  She is also certified as a Senior Professional in Human Resources (SPHR, SHRM-SCP). Sharmila has a true passion for providing HR solutions for organizations by helping them build their HR infrastructure through technology, compliance and people. She enjoys coaching leaders to inspire and empower their teams and mentoring junior HR professionals to reach their full potential. Terence Cho Vice President of Real Estate Terence Cho Vice President of Real Estate Terence Cho currently serves as Vice President of Real Estate for the Battery Park City Authority and is responsible for leading the development and implementation of strategies to protect the public interest in the Authority’s management of its approximately 45 ground leases and other agreements with the developers of residential, commercial, hotel, and not-for-profit sites across the neighborhood’s 92 acres. Prior to joining BPCA, Mr. Cho spent six years at Empire State Development, New York State’s economic development agency, where he led many public-private partnerships such as the Belmont Park Redevelopment Project, Penn Station Area Redevelopment Project, High-Line Moynihan Connector, Queens West Development Project, 42nd Street Development Project, and the Victoria Theater Redevelopment Project. Mr. Cho began his career in the private sector at Lehman Brothers Holdings, Inc. and various private real estate brokerage firms and developers. At BPCA, Mr. Cho works with professionals across the Authority in driving efforts in pursuit of the Authority’s affordable housing goals, the City and State’s financial well-being, developing strategies to develop various assets in BPCA’s portfolio and managing obligations under BPCA’s agreements with building owners and occupants. Mr. Cho received a Bachelor of Arts from the University of Pennsylvania and a Masters in Business Administration from the University of Michigan. Pamela Frederick Chief Financial Officer Pamela Frederick Chief Financial Officer Ms. Frederick, joined the BPCA in November 2017.  In her prior role as Director and Derivatives Specialist at Citi Private Bank, she focused on providing a range of hedging solutions and tactical investments to ultra high net worth clients with a focus on Commercial  Real Estate and in the use of interest rate derivatives as a risk management tool.\u000b\u000bPrior to joining Citi in 2005, she worked with GE Capital in the Structured Finance Energy Group, focused on structured equity, lending  and mezzanine investments.  In addition, she worked at Fieldstone Private Capital Group and the Overseas Private Investment Corporation, providing infrastructure project finance and M&A advice to corporate and public sector clients.  She also worked for the Chase Manhattan Bank in Global Mergers & Acquisitions and in Restructuring. She holds a B.A. in Economics and an M.B.A. in Finance from the University of Michigan, Ann Arbor and attended Ecole des Hautes Etudes Commerciales in Jouy en Josas, France.  She is a FINRA Registered Securities Representative; her  licenses include  Series 7 and Series 63. She resides in the Town of Greenwich, Connecticut  where she was elected to serve on the town council (RTM), headed the Finance Committee and served as Chair of the Special Committee on Retirement Benefits.  In 2016, she was named by The Network Journal as one of the 25 Influential Black Women in Business. Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman is a Registered Landscape Architect and accomplished design and construction professional with over 16 years of experience in managing projects from concept to final delivery. Heather leads with a proactive approach to problem solving with an emphasis on developing innovative solutions to logistically complex project challenges. Since receiving her Master of Landscape Architecture at The City College of New York, Heather has been involved in a diverse portfolio of projects across many sectors with experience in new build commercial development, waterfront resiliency, and infrastructure projects. Heather brings extensive experience in managing complicated projects and is recognized for her collaborative leadership style, driving impactful outcomes through transparency and communication. Prior to joining BPCA, Heather worked at MNLA, where she designed and managed multiple waterfront projects including a 1.5 mile stretch along Hudson River Park and the East River Esplanade redevelopment adjacent Rockefeller University’s River Campus. For the last nine plus years, she has worked for Cumming Group, a project management and owner advisory firm serving as a Vice President of project management, acting as a Project Executive for a variety of projects including New York Climate Exchange, the NYNJ Port Authority Midtown Bus Terminal Replacement project, and Northwell’s Lloyd and Victoria Goldman Cancer Care Pavilion on the Upper East Side. Having worked in both the design realm and built environment, she brings a unique knowledge base to her new role as Senior Vice President of Design and Construction. Craig Hudon Vice President, Parks Programming Craig Hudon Vice President, Parks Programming Craig Hudon, Director of Parks Programming, has been developing and implementing groundbreaking programming and events in Battery Park City for more than 16 years.  He has overseen the expansion of cultural, educational and creative arts programming presented by Battery Park City Authority focusing on live music and theater series, and nature, art and wellness classes for all ages.  Prior to joining Battery Park City Parks, Craig worked in marketing and events at Snowbird Ski Resort where he spearheaded bringing in a new era of world-class Freeriding competitions to the resort, as well as many concerts, festivals and competitions.  He started his career as an environmental educator through his work in Shenandoah National Park and as Assistant Director at Bristol Regional Environmental Centers in Connecticut. Craig received a B.S. in Recreation Studies from Ithaca College. Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan joined the Battery Park City Authority with an extensive 15-year career in the public sector. Most recently, she served as the Chief Diversity Officer of the Governor’s Office of Storm Recovery (GOSR), where she cofounded and developed that agency’s Office of Diversity and Civil Rights, leading the Minority and Women-Owned Business Enterprise (MWBE), Federal Section 3, and Fair Housing and Equal Opportunity (FHEO) programs for New York State’s $4.4 billion disaster recovery spend. Under Jahmeliah’s leadership, the agency surpassed NY State’s 30% goal for MWBE utilization all four years of her tenure. Prior to GOSR, Jahmeliah held several policy and management positions in the Bloomberg Administration, including Executive Director for Intergovernmental Affairs for New York City’s Department of Education, Chief of Staff for the Mayor’s Office of Contract Services, and Senior Legislative Analyst for the Mayor’s Office of Legislative Affairs. Ms. Nathan has a Master’s Degree in Public Administration from Long Island University and a Bachelor of Arts in Philosophy, Politics and Law from Binghamton University. She has also served as an adjunct professor at CUNY’s Hostos Community College, where she lectured on Public Administration and Public Policy. Nicholas Sbordone Vice President, Communications & Public Affairs Nicholas Sbordone Vice President, Communications & Public Affairs Nick Sbordone came to the Battery Park City Authority after spending his career in New York City government across three mayoral administrations. At BPCA, Nick works closely and on a daily basis with the local community, media, elected officials, and partner organizations on the Authority’s full range of public-facing initiatives. Beginning his career in 2001 at the Mayor’s Office of Operations as a policy analyst, Nick helped prepare the bi-annual Mayor’s Management Report. Moving to the Taxi & Limousine Commission he worked on a range of issues affecting the taxi and for-hire vehicle industry, including wheelchair accessibility and the sale of new taxicab medallions. Then, at the Department of Information Technology & Telecommunications he served as government affairs director and spokesman and for the 311 non-emergency information and services hotline, for 911 system modernization, cable television and broadband, cybersecurity, and the City’s open data and free WiFi initiatives. Born and raised in Brooklyn – with a sojourn in central New Jersey – his passions include history, architecture, sports and U.S. presidential trivia, and all things New York City. His is a familiar face at community meetings and assorted public gatherings across downtown Manhattan, so please feel free to stop over and say hello. Ryan Torres Vice President , Parks Operations Ryan Torres Vice President , Parks Operations Ryan Torres is an accomplished parks operations professional with more than two decades of progressive experience in horticulture, maintenance, sustainability, and safety. Ryan started her career as a fourth-generation horticulturist focusing on design and sales within all things landscape management. She consulted for municipalities in arboriculture and instructed adult classes at the New York Botanical Garden and other organizations on various horticulture topics. Before starting at BPCA, Ryan work as the Horticulturist for the Town of North Hempstead in Nassau County, NY, where she oversaw the 12-acre botanic garden and assisted with over 100 acres of open spaces within the town. In 2014, Ryan started working at Battery Park City Authority as the Assistant Director of Horticulture, where she supervised staff and scheduled the day-to-day operations of the department, maintained budgets, and oversaw all purchases. Four years later Ryan was promoted to Assistant Vice President of Parks Operations where she shared the collaborative supervision of more than 60 employees, pioneered the Zero Waste Committee, Safety Advisory Committee and Dog Waste Composting Program, and created standard-operating procedures and policies for the department, as well as led and participated in all departmental and interdepartmental meetings. Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid joined the Battery Park City Authority in 2014 after five years with the City of New York in various roles during the Bloomberg Administration. Beginning her career in 2009 as a Licensing Specialist at the NYC Business Integrity Commission (BIC), she worked to help eliminate organized crime and other forms of corruption from the public wholesale markets, trade waste, and shipboard gambling industries. In 2011, she became BIC’s Complaints Coordinator, a role in which she drove more than 3,000 incoming complaints and inquiries to satisfactory resolution. For these efforts BIC earned a 100% success rate and multiple excellence in customer service citations. Alexis later became the Special Assistant to the BIC Commissioner, and then served as Special Advisor to the Battery Park City Authority to the President and Chief Operating Officer. In her current role at the Authority, Alexis oversees implementation of a variety of special projects and events, including the organization’s annual Earth Day programs with local schools. Alexis holds a Bachelor of Science degree in Public Relations and a Master’s Degree in International Communications from St. John’s University. Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann is an urban planner who has worked on planning, housing, parks, and infrastructure challenges for almost 20 years in New York City. He joins BPCA from design and engineering firm Arup, where he was an Associate Principal and the City Planning Leader for the East Coast working on transportation, housing policy, and climate adaptation projects. Prior to Arup, Raju was the Director of Land Use and Deputy Chief of Staff for the New York City Council, where he led a team of planners and lawyers working with Council Members, City agencies, and communities to develop planning strategies for neighborhoods across New York City. Raju grew up in Morningside Heights and now lives in Brooklyn. He received his BA in Philosophy from Columbia University and his MA in Urban Planning from the University of Michigan. He is a board member of MoMA PS1 and on the advisory board of the New York Housing Conference. DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 Donald Capoccia is the managing principal and founder of BFC Partners, a real estate development company that has been involved in the planning, development and construction of some 12,500 units of housing in New York City with a combined value of $4.5B. His projects also include approximately 2,000,000SF of neighborhood retail and community facility uses. Mr. Capoccia began his development and construction activities in New York City in 1982, just prior to the completion of a Masters Degree Program in Urban Planning at Hunter College, and after completing a BA in Urban Studies from the University of Buffalo in 1979. Mr. Capoccia and BFC have focused predominately on the production of affordable housing, investing in a concentrated geographic strategy that has helped spur the resurgence of key New York City neighborhoods; the East Village, East Harlem, Williamsburg and Downtown Brooklyn. Mr. Capoccia has pioneered the production, and promoted the importance of affordable home ownership opportunities to these neighborhoods. Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha is a senior executive with over 30 years of experience at some of the world’s largest and most complex global financial institutions. She is a strategic leader, problem solver and collaborator. In her latest role at AIG she served as Executive Vice President and Chief Information Officer, leading technology strategy and operations worldwide. Martha joined AIG in 2015 as Chief Auditor, where she transformed the Audit operating model by promoting more active stakeholder engagement during global change initiatives, and set up an organization with a proven track record of delivering measurable, sustainable results that drive business performance. Prior to AIG, Martha spent three decades at JPMorgan, where she drove the creation and execution of strategies to transform disparate teams and infrastructures to achieve simplified and high-performing outcomes in audit, compliance, credit risk, technology and operations. She also played a leadership role in all of the merger and integration efforts that are now part of the JPMorgan Chase operating platform. Martha is a graduate of Cornell University, with a B.S. in Human Development and Family Studies and a M.B.A. in Accounting and Finance. Martha has a longstanding commitment, both personally and professionally, to the advancement of women and girls and serves as Board Co-Chair of the Women’s Refugee Commission. She believes passionately that women’s contributions play a critical role in the community, business and government. LESTER PETRACCA Member Confirmed June 20, 2013 LESTER PETRACCA Member Confirmed June 20, 2013 As President of Triangle Equities, Lester Petracca has transformed a family owned business, which began in 1916 as a specialized construction firm, into a thriving, successful, full-service real estate company. Triangle Equities opened its doors in 1992, specializing in public/private partnerships developing real estate throughout New York. These successful projects include the recent development of Triangle Junction, a 300,000 square foot Target anchored center in the heart of Brooklyn, contributing to the revitalization of the Flatbush Avenue retail corridor. Additionally, Triangle had previously worked with the City and local community groups to bring both Triangle Plaza and Triangle Center to the Queens neighborhood of College Point, creating retail and entertainment projects that were also catalysts for revitalization.These are just a few of Triangle Equities’ projects which illustrate the success of working hand in hand with public entities and community groups. Triangle continues to create, own, manage and operate quality developments throughout the New York Metropolitan area. Mr. Petracca prides himself in working closely with the communities in which he invests and develops. He actively contributes to: Queens Chamber of Commerce, Brooklyn Center for the Performing Arts, Flatbush Development Corporation, College Point Board of Trade, YMCA, American Cancer Society, MS Society, Queens Child Guidance, Queens Theater in the Park, Tuesdays Children, and Manhasset Police Athletic League. Mr. Petracca has successfully built a business based on sincerity, respect and loyalty. Triangle has consistently grown with Mr. Petracca’s leadership that initiates hard work and dedication. CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 Catherine McVay Hughes served 20 years on Manhattan Community Board 1, more than half that time as Chair or Vice-Chair. She also chaired its World Trade Center Redevelopment Committee for seven years. She has been a leader in caring for the community by working with diverse community and labor groups, elected officials and governmental agencies at City, State and Federal levels. After Superstorm Sandy, she was appointed Co-Chair of New York Rising Community Reconstruction Program for Southern Manhattan and is a founding member of CB1’s “Manhattan Tip” Resiliency Task Force and a member of the NY/NJ Metropolitan Storm Surge Working Group. She was also appointed to the Princeton University School of Engineering and Applied Science Andlinger Center for Energy and the Environment External Advisory Council, Climate Coalition for Lower Manhattan: FiDi-Seaport Resilience Master Plan, CERES Presidents Council, Lower Manhattan Development Corporation, and South Street Seaport Museum Board. She also served on the Earth Institute at Columbia University Advisory Board, Downtown Alliance Board of Directors, The Trust for Governors Island, The Battery Conservancy Board of Trustees, Manhattan Solid Waste Advisory Board and US EPA WTC Expert Technical Panel. McVay Hughes has a Master of Business Administration from The Wharton School of the University of Pennsylvania (1987) and a Bachelor of Science degree in Civil Engineering from Princeton University (1982). Anthony Kendall Member Confirmed June 20, 2018 Anthony Kendall Member Confirmed June 20, 2018 Anthony “Tony” S. Kendall was elected Chairman and Chief Executive Officer of Mitchell & Titus, LLP, the nation’s largest minority controlled accounting and consulting firm in 2009. As Chief Executive Office he is responsible for the vision, leadership and strategic direction of the firm. Tony has approximately 30 years’ experience providing professional services to Fortune 500 companies and various industries, including telecommunications, financial services, technology, hospitality, multimedia and entertainment. His clients also include emerging market entities, partnerships, private foundations and the Federal government. Tony has provided advisory services including investigative and dispute resolution services, wind-down accountings and expert witness testimony for a number of corporations and professional service firms. Tony earned an MBA in Finance and Taxation and a B.S. in Accounting from Binghamton University, and he graduated from Harvard Business School’s Owner/President Management Program. He is a Certified Public Accountant in New York, Illinois, Kentucky, and Tennessee and in several other states. Tony is also a Certified Fraud Examiner. Tony is the Audit Committee Chairperson for the Alvin Ailey American Dance Theatre and the National Urban Fellows. His civic and community involvement includes: past president of The Binghamton University Alumni Association and board member of the University’s Foundation and he served on the Honorable Scott M. Stringer, New York City Comptroller’s, Transition Committee. Recently, Tony served on the Public Company Accounting Oversight Board’s (PCAOB’s) Standing Advisory Group. Additionally, Tony formerly served as the Audit Committee Chairperson for Project Renewal, Inc.; the Upper Manhattan Empowerment Zone; and was a board member of the New York State Society of Certified Public Accountants’ Career Opportunities in the Accounting Profession program to name a few. Tony has won numerous awards and recognition and has moderated and participated on many panels. In 2012, New York’s WPIX-TV featured Tony in a special segment on CEOs in honor of Black History Month. ANGELA PINSKY Member Confirmed June 6, 2024 ANGELA PINSKY Member Confirmed June 6, 2024 Angela Pinsky is Head of Government Affairs and Public Policy for Google New York, where she manages public and government relations in the Tri-State area. Previously, Angela served as Executive Director for the Association for a Better New York (ABNY), Senior Vice President for Management Services and Government Affairs at the Real Estate Board of New York (REBNY), and as Deputy Chief of Staff at the Office of the Deputy Mayor for Economic Development and Rebuilding during the Bloomberg administration. In addition to BPCA, Angela currently serves as a board member for the Meatpacking BID, Building Skills New York and the Regional Plan Association. Angela received her Masters in Urban Planning from New York University and her Bachelors of Arts from Johns Hopkins University. CLINTON PLUMMER Member Confirmed June 6, 2024 CLINTON PLUMMER Member Confirmed June 6, 2024 Clint serves as Chief Executive Officer of Rise Light & Power in New York City, where he oversees the operations of the existing generation facility as well as the development of new projects, strategic partnerships, and the transition of the Ravenswood into a premier energy provider as part of New York’s CLCPA and other initiatives. Clint is the Project Executive and has developed and implemented strategies that secured revenue agreements and other key entitlements necessary for the construction of several ground-breaking projects. A 15-year veteran of New York’s clean energy industry, Plummer previously served as Head of Market Strategies and New Projects for Ørsted U.S. Offshore Wind, a leading offshore wind developer. In this capacity, he secured customer agreements for more than 2GW of new offshore wind projects in New York and New Jersey. Previously, Plummer worked as Vice President of Development for Deepwater Wind, where he grew its United States market for offshore wind energy and positioned it as a respected and responsible market leader. From 2009 to 2011, Plummer led the pre-construction development of Deepwater Wind’s Block Island Wind Farm, the first of its kind in the United States. In 2013, he spearheaded the company’s successful efforts to acquire the Bureau of Ocean Energy Management’s first competitively leased offshore wind site, as well as to scope the project now known as Deepwater ONE. Additionally, Plummer drove the company’s successful efforts to secure a Power Purchase Agreement with the Long Island Power Authority for the South Fork Wind Farm, the first in New York. Allie Atlas Chief of Staff Allie Atlas Chief of Staff Allie Skayne Atlas currently serves as the Chief of Staff of the Battery Park City Authority. Prior to joining the Authority, she served as the Chief of Staff of the New York City Department of Education’s Division of Teaching and Learning, overseeing five offices comprised of 600 staff members and a budget of more than $500M. In addition to supporting day-to-day operations, Ms. Atlas led high-priority work, including staff professional development, communications, new program design, and union negotiations. She also worked at the NYC Criminal Justice Coordinator’s Office where she was the program manager for an interagency task force on truancy, chronic absenteeism, and school engagement, and spent time at the 9/11 Memorial & Museum in public affairs in the lead up to the Memorial’s opening in 2011 through its first year of operation. Ms. Atlas has a Master’s Degree in Public Administration with a focus in policy analysis from NYU’s Wagner Graduate School of Public Service and a Bachelor of Arts in English and American Literature from NYU. Sharmila Baichu Chief Human Resources Officer Sharmila Baichu Chief Human Resources Officer Sharmila Baichu is a Human Resources professional with over 20 years of experience in graduated roles.  She has worked in both the public and private sectors including financial services, healthcare and most recently construction. She also held an HR Director role with Hudson River Park Trust.  Teaching is Sharmila’s second passion. As such, she taught 2nd and 3rd grades in Bedford Stuyvesant, Brooklyn and test preparation for the SAT and SHSAT.  Sharmila holds a Bachelor of Business Administration Degree from Pace University and a Masters of Early Education from Long Island University.  She is also certified as a Senior Professional in Human Resources (SPHR, SHRM-SCP). Sharmila has a true passion for providing HR solutions for organizations by helping them build their HR infrastructure through technology, compliance and people. She enjoys coaching leaders to inspire and empower their teams and mentoring junior HR professionals to reach their full potential. Terence Cho Vice President of Real Estate Terence Cho Vice President of Real Estate Terence Cho currently serves as Vice President of Real Estate for the Battery Park City Authority and is responsible for leading the development and implementation of strategies to protect the public interest in the Authority’s management of its approximately 45 ground leases and other agreements with the developers of residential, commercial, hotel, and not-for-profit sites across the neighborhood’s 92 acres. Prior to joining BPCA, Mr. Cho spent six years at Empire State Development, New York State’s economic development agency, where he led many public-private partnerships such as the Belmont Park Redevelopment Project, Penn Station Area Redevelopment Project, High-Line Moynihan Connector, Queens West Development Project, 42nd Street Development Project, and the Victoria Theater Redevelopment Project. Mr. Cho began his career in the private sector at Lehman Brothers Holdings, Inc. and various private real estate brokerage firms and developers. At BPCA, Mr. Cho works with professionals across the Authority in driving efforts in pursuit of the Authority’s affordable housing goals, the City and State’s financial well-being, developing strategies to develop various assets in BPCA’s portfolio and managing obligations under BPCA’s agreements with building owners and occupants. Mr. Cho received a Bachelor of Arts from the University of Pennsylvania and a Masters in Business Administration from the University of Michigan. Pamela Frederick Chief Financial Officer Pamela Frederick Chief Financial Officer Ms. Frederick, joined the BPCA in November 2017.  In her prior role as Director and Derivatives Specialist at Citi Private Bank, she focused on providing a range of hedging solutions and tactical investments to ultra high net worth clients with a focus on Commercial  Real Estate and in the use of interest rate derivatives as a risk management tool.\u000b\u000bPrior to joining Citi in 2005, she worked with GE Capital in the Structured Finance Energy Group, focused on structured equity, lending  and mezzanine investments.  In addition, she worked at Fieldstone Private Capital Group and the Overseas Private Investment Corporation, providing infrastructure project finance and M&A advice to corporate and public sector clients.  She also worked for the Chase Manhattan Bank in Global Mergers & Acquisitions and in Restructuring. She holds a B.A. in Economics and an M.B.A. in Finance from the University of Michigan, Ann Arbor and attended Ecole des Hautes Etudes Commerciales in Jouy en Josas, France.  She is a FINRA Registered Securities Representative; her  licenses include  Series 7 and Series 63. She resides in the Town of Greenwich, Connecticut  where she was elected to serve on the town council (RTM), headed the Finance Committee and served as Chair of the Special Committee on Retirement Benefits.  In 2016, she was named by The Network Journal as one of the 25 Influential Black Women in Business. Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman is a Registered Landscape Architect and accomplished design and construction professional with over 16 years of experience in managing projects from concept to final delivery. Heather leads with a proactive approach to problem solving with an emphasis on developing innovative solutions to logistically complex project challenges. Since receiving her Master of Landscape Architecture at The City College of New York, Heather has been involved in a diverse portfolio of projects across many sectors with experience in new build commercial development, waterfront resiliency, and infrastructure projects. Heather brings extensive experience in managing complicated projects and is recognized for her collaborative leadership style, driving impactful outcomes through transparency and communication. Prior to joining BPCA, Heather worked at MNLA, where she designed and managed multiple waterfront projects including a 1.5 mile stretch along Hudson River Park and the East River Esplanade redevelopment adjacent Rockefeller University’s River Campus. For the last nine plus years, she has worked for Cumming Group, a project management and owner advisory firm serving as a Vice President of project management, acting as a Project Executive for a variety of projects including New York Climate Exchange, the NYNJ Port Authority Midtown Bus Terminal Replacement project, and Northwell’s Lloyd and Victoria Goldman Cancer Care Pavilion on the Upper East Side. Having worked in both the design realm and built environment, she brings a unique knowledge base to her new role as Senior Vice President of Design and Construction. Craig Hudon Vice President, Parks Programming Craig Hudon Vice President, Parks Programming Craig Hudon, Director of Parks Programming, has been developing and implementing groundbreaking programming and events in Battery Park City for more than 16 years.  He has overseen the expansion of cultural, educational and creative arts programming presented by Battery Park City Authority focusing on live music and theater series, and nature, art and wellness classes for all ages.  Prior to joining Battery Park City Parks, Craig worked in marketing and events at Snowbird Ski Resort where he spearheaded bringing in a new era of world-class Freeriding competitions to the resort, as well as many concerts, festivals and competitions.  He started his career as an environmental educator through his work in Shenandoah National Park and as Assistant Director at Bristol Regional Environmental Centers in Connecticut. Craig received a B.S. in Recreation Studies from Ithaca College. Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan joined the Battery Park City Authority with an extensive 15-year career in the public sector. Most recently, she served as the Chief Diversity Officer of the Governor’s Office of Storm Recovery (GOSR), where she cofounded and developed that agency’s Office of Diversity and Civil Rights, leading the Minority and Women-Owned Business Enterprise (MWBE), Federal Section 3, and Fair Housing and Equal Opportunity (FHEO) programs for New York State’s $4.4 billion disaster recovery spend. Under Jahmeliah’s leadership, the agency surpassed NY State’s 30% goal for MWBE utilization all four years of her tenure. Prior to GOSR, Jahmeliah held several policy and management positions in the Bloomberg Administration, including Executive Director for Intergovernmental Affairs for New York City’s Department of Education, Chief of Staff for the Mayor’s Office of Contract Services, and Senior Legislative Analyst for the Mayor’s Office of Legislative Affairs. Ms. Nathan has a Master’s Degree in Public Administration from Long Island University and a Bachelor of Arts in Philosophy, Politics and Law from Binghamton University. She has also served as an adjunct professor at CUNY’s Hostos Community College, where she lectured on Public Administration and Public Policy. Nicholas Sbordone Vice President, Communications & Public Affairs Nicholas Sbordone Vice President, Communications & Public Affairs Nick Sbordone came to the Battery Park City Authority after spending his career in New York City government across three mayoral administrations. At BPCA, Nick works closely and on a daily basis with the local community, media, elected officials, and partner organizations on the Authority’s full range of public-facing initiatives. Beginning his career in 2001 at the Mayor’s Office of Operations as a policy analyst, Nick helped prepare the bi-annual Mayor’s Management Report. Moving to the Taxi & Limousine Commission he worked on a range of issues affecting the taxi and for-hire vehicle industry, including wheelchair accessibility and the sale of new taxicab medallions. Then, at the Department of Information Technology & Telecommunications he served as government affairs director and spokesman and for the 311 non-emergency information and services hotline, for 911 system modernization, cable television and broadband, cybersecurity, and the City’s open data and free WiFi initiatives. Born and raised in Brooklyn – with a sojourn in central New Jersey – his passions include history, architecture, sports and U.S. presidential trivia, and all things New York City. His is a familiar face at community meetings and assorted public gatherings across downtown Manhattan, so please feel free to stop over and say hello. Ryan Torres Vice President , Parks Operations Ryan Torres Vice President , Parks Operations Ryan Torres is an accomplished parks operations professional with more than two decades of progressive experience in horticulture, maintenance, sustainability, and safety. Ryan started her career as a fourth-generation horticulturist focusing on design and sales within all things landscape management. She consulted for municipalities in arboriculture and instructed adult classes at the New York Botanical Garden and other organizations on various horticulture topics. Before starting at BPCA, Ryan work as the Horticulturist for the Town of North Hempstead in Nassau County, NY, where she oversaw the 12-acre botanic garden and assisted with over 100 acres of open spaces within the town. In 2014, Ryan started working at Battery Park City Authority as the Assistant Director of Horticulture, where she supervised staff and scheduled the day-to-day operations of the department, maintained budgets, and oversaw all purchases. Four years later Ryan was promoted to Assistant Vice President of Parks Operations where she shared the collaborative supervision of more than 60 employees, pioneered the Zero Waste Committee, Safety Advisory Committee and Dog Waste Composting Program, and created standard-operating procedures and policies for the department, as well as led and participated in all departmental and interdepartmental meetings. Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid joined the Battery Park City Authority in 2014 after five years with the City of New York in various roles during the Bloomberg Administration. Beginning her career in 2009 as a Licensing Specialist at the NYC Business Integrity Commission (BIC), she worked to help eliminate organized crime and other forms of corruption from the public wholesale markets, trade waste, and shipboard gambling industries. In 2011, she became BIC’s Complaints Coordinator, a role in which she drove more than 3,000 incoming complaints and inquiries to satisfactory resolution. For these efforts BIC earned a 100% success rate and multiple excellence in customer service citations. Alexis later became the Special Assistant to the BIC Commissioner, and then served as Special Advisor to the Battery Park City Authority to the President and Chief Operating Officer. In her current role at the Authority, Alexis oversees implementation of a variety of special projects and events, including the organization’s annual Earth Day programs with local schools. Alexis holds a Bachelor of Science degree in Public Relations and a Master’s Degree in International Communications from St. John’s University. Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann President & Chief Executive Officer Appointed in 2023 Raju Mann is an urban planner who has worked on planning, housing, parks, and infrastructure challenges for almost 20 years in New York City. He joins BPCA from design and engineering firm Arup, where he was an Associate Principal and the City Planning Leader for the East Coast working on transportation, housing policy, and climate adaptation projects. Prior to Arup, Raju was the Director of Land Use and Deputy Chief of Staff for the New York City Council, where he led a team of planners and lawyers working with Council Members, City agencies, and communities to develop planning strategies for neighborhoods across New York City. Raju grew up in Morningside Heights and now lives in Brooklyn. He received his BA in Philosophy from Columbia University and his MA in Urban Planning from the University of Michigan. He is a board member of MoMA PS1 and on the advisory board of the New York Housing Conference. DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 DONALD CAPOCCIA Chairman Confirmed June 15, 2011; Elected Chair October 25, 2023 Donald Capoccia is the managing principal and founder of BFC Partners, a real estate development company that has been involved in the planning, development and construction of some 12,500 units of housing in New York City with a combined value of $4.5B. His projects also include approximately 2,000,000SF of neighborhood retail and community facility uses. Mr. Capoccia began his development and construction activities in New York City in 1982, just prior to the completion of a Masters Degree Program in Urban Planning at Hunter College, and after completing a BA in Urban Studies from the University of Buffalo in 1979. Mr. Capoccia and BFC have focused predominately on the production of affordable housing, investing in a concentrated geographic strategy that has helped spur the resurgence of key New York City neighborhoods; the East Village, East Harlem, Williamsburg and Downtown Brooklyn. Mr. Capoccia has pioneered the production, and promoted the importance of affordable home ownership opportunities to these neighborhoods. Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha J. Gallo Vice Chair Confirmed June 19, 2018 Martha is a senior executive with over 30 years of experience at some of the world’s largest and most complex global financial institutions. She is a strategic leader, problem solver and collaborator. In her latest role at AIG she served as Executive Vice President and Chief Information Officer, leading technology strategy and operations worldwide. Martha joined AIG in 2015 as Chief Auditor, where she transformed the Audit operating model by promoting more active stakeholder engagement during global change initiatives, and set up an organization with a proven track record of delivering measurable, sustainable results that drive business performance. Prior to AIG, Martha spent three decades at JPMorgan, where she drove the creation and execution of strategies to transform disparate teams and infrastructures to achieve simplified and high-performing outcomes in audit, compliance, credit risk, technology and operations. She also played a leadership role in all of the merger and integration efforts that are now part of the JPMorgan Chase operating platform. Martha is a graduate of Cornell University, with a B.S. in Human Development and Family Studies and a M.B.A. in Accounting and Finance. Martha has a longstanding commitment, both personally and professionally, to the advancement of women and girls and serves as Board Co-Chair of the Women’s Refugee Commission. She believes passionately that women’s contributions play a critical role in the community, business and government. LESTER PETRACCA Member Confirmed June 20, 2013 LESTER PETRACCA Member Confirmed June 20, 2013 As President of Triangle Equities, Lester Petracca has transformed a family owned business, which began in 1916 as a specialized construction firm, into a thriving, successful, full-service real estate company. Triangle Equities opened its doors in 1992, specializing in public/private partnerships developing real estate throughout New York. These successful projects include the recent development of Triangle Junction, a 300,000 square foot Target anchored center in the heart of Brooklyn, contributing to the revitalization of the Flatbush Avenue retail corridor. Additionally, Triangle had previously worked with the City and local community groups to bring both Triangle Plaza and Triangle Center to the Queens neighborhood of College Point, creating retail and entertainment projects that were also catalysts for revitalization.These are just a few of Triangle Equities’ projects which illustrate the success of working hand in hand with public entities and community groups. Triangle continues to create, own, manage and operate quality developments throughout the New York Metropolitan area. Mr. Petracca prides himself in working closely with the communities in which he invests and develops. He actively contributes to: Queens Chamber of Commerce, Brooklyn Center for the Performing Arts, Flatbush Development Corporation, College Point Board of Trade, YMCA, American Cancer Society, MS Society, Queens Child Guidance, Queens Theater in the Park, Tuesdays Children, and Manhasset Police Athletic League. Mr. Petracca has successfully built a business based on sincerity, respect and loyalty. Triangle has consistently grown with Mr. Petracca’s leadership that initiates hard work and dedication. CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 CATHERINE McVAY HUGHES Member Confirmed June 20, 2017 Catherine McVay Hughes served 20 years on Manhattan Community Board 1, more than half that time as Chair or Vice-Chair. She also chaired its World Trade Center Redevelopment Committee for seven years. She has been a leader in caring for the community by working with diverse community and labor groups, elected officials and governmental agencies at City, State and Federal levels. After Superstorm Sandy, she was appointed Co-Chair of New York Rising Community Reconstruction Program for Southern Manhattan and is a founding member of CB1’s “Manhattan Tip” Resiliency Task Force and a member of the NY/NJ Metropolitan Storm Surge Working Group. She was also appointed to the Princeton University School of Engineering and Applied Science Andlinger Center for Energy and the Environment External Advisory Council, Climate Coalition for Lower Manhattan: FiDi-Seaport Resilience Master Plan, CERES Presidents Council, Lower Manhattan Development Corporation, and South Street Seaport Museum Board. She also served on the Earth Institute at Columbia University Advisory Board, Downtown Alliance Board of Directors, The Trust for Governors Island, The Battery Conservancy Board of Trustees, Manhattan Solid Waste Advisory Board and US EPA WTC Expert Technical Panel. McVay Hughes has a Master of Business Administration from The Wharton School of the University of Pennsylvania (1987) and a Bachelor of Science degree in Civil Engineering from Princeton University (1982). Anthony Kendall Member Confirmed June 20, 2018 Anthony Kendall Member Confirmed June 20, 2018 Anthony “Tony” S. Kendall was elected Chairman and Chief Executive Officer of Mitchell & Titus, LLP, the nation’s largest minority controlled accounting and consulting firm in 2009. As Chief Executive Office he is responsible for the vision, leadership and strategic direction of the firm. Tony has approximately 30 years’ experience providing professional services to Fortune 500 companies and various industries, including telecommunications, financial services, technology, hospitality, multimedia and entertainment. His clients also include emerging market entities, partnerships, private foundations and the Federal government. Tony has provided advisory services including investigative and dispute resolution services, wind-down accountings and expert witness testimony for a number of corporations and professional service firms. Tony earned an MBA in Finance and Taxation and a B.S. in Accounting from Binghamton University, and he graduated from Harvard Business School’s Owner/President Management Program. He is a Certified Public Accountant in New York, Illinois, Kentucky, and Tennessee and in several other states. Tony is also a Certified Fraud Examiner. Tony is the Audit Committee Chairperson for the Alvin Ailey American Dance Theatre and the National Urban Fellows. His civic and community involvement includes: past president of The Binghamton University Alumni Association and board member of the University’s Foundation and he served on the Honorable Scott M. Stringer, New York City Comptroller’s, Transition Committee. Recently, Tony served on the Public Company Accounting Oversight Board’s (PCAOB’s) Standing Advisory Group. Additionally, Tony formerly served as the Audit Committee Chairperson for Project Renewal, Inc.; the Upper Manhattan Empowerment Zone; and was a board member of the New York State Society of Certified Public Accountants’ Career Opportunities in the Accounting Profession program to name a few. Tony has won numerous awards and recognition and has moderated and participated on many panels. In 2012, New York’s WPIX-TV featured Tony in a special segment on CEOs in honor of Black History Month. ANGELA PINSKY Member Confirmed June 6, 2024 ANGELA PINSKY Member Confirmed June 6, 2024 Angela Pinsky is Head of Government Affairs and Public Policy for Google New York, where she manages public and government relations in the Tri-State area. Previously, Angela served as Executive Director for the Association for a Better New York (ABNY), Senior Vice President for Management Services and Government Affairs at the Real Estate Board of New York (REBNY), and as Deputy Chief of Staff at the Office of the Deputy Mayor for Economic Development and Rebuilding during the Bloomberg administration. In addition to BPCA, Angela currently serves as a board member for the Meatpacking BID, Building Skills New York and the Regional Plan Association. Angela received her Masters in Urban Planning from New York University and her Bachelors of Arts from Johns Hopkins University. CLINTON PLUMMER Member Confirmed June 6, 2024 CLINTON PLUMMER Member Confirmed June 6, 2024 Clint serves as Chief Executive Officer of Rise Light & Power in New York City, where he oversees the operations of the existing generation facility as well as the development of new projects, strategic partnerships, and the transition of the Ravenswood into a premier energy provider as part of New York’s CLCPA and other initiatives. Clint is the Project Executive and has developed and implemented strategies that secured revenue agreements and other key entitlements necessary for the construction of several ground-breaking projects. A 15-year veteran of New York’s clean energy industry, Plummer previously served as Head of Market Strategies and New Projects for Ørsted U.S. Offshore Wind, a leading offshore wind developer. In this capacity, he secured customer agreements for more than 2GW of new offshore wind projects in New York and New Jersey. Previously, Plummer worked as Vice President of Development for Deepwater Wind, where he grew its United States market for offshore wind energy and positioned it as a respected and responsible market leader. From 2009 to 2011, Plummer led the pre-construction development of Deepwater Wind’s Block Island Wind Farm, the first of its kind in the United States. In 2013, he spearheaded the company’s successful efforts to acquire the Bureau of Ocean Energy Management’s first competitively leased offshore wind site, as well as to scope the project now known as Deepwater ONE. Additionally, Plummer drove the company’s successful efforts to secure a Power Purchase Agreement with the Long Island Power Authority for the South Fork Wind Farm, the first in New York. Allie Atlas Chief of Staff Allie Atlas Chief of Staff Allie Skayne Atlas currently serves as the Chief of Staff of the Battery Park City Authority. Prior to joining the Authority, she served as the Chief of Staff of the New York City Department of Education’s Division of Teaching and Learning, overseeing five offices comprised of 600 staff members and a budget of more than $500M. In addition to supporting day-to-day operations, Ms. Atlas led high-priority work, including staff professional development, communications, new program design, and union negotiations. She also worked at the NYC Criminal Justice Coordinator’s Office where she was the program manager for an interagency task force on truancy, chronic absenteeism, and school engagement, and spent time at the 9/11 Memorial & Museum in public affairs in the lead up to the Memorial’s opening in 2011 through its first year of operation. Ms. Atlas has a Master’s Degree in Public Administration with a focus in policy analysis from NYU’s Wagner Graduate School of Public Service and a Bachelor of Arts in English and American Literature from NYU. Sharmila Baichu Chief Human Resources Officer Sharmila Baichu Chief Human Resources Officer Sharmila Baichu is a Human Resources professional with over 20 years of experience in graduated roles.  She has worked in both the public and private sectors including financial services, healthcare and most recently construction. She also held an HR Director role with Hudson River Park Trust.  Teaching is Sharmila’s second passion. As such, she taught 2nd and 3rd grades in Bedford Stuyvesant, Brooklyn and test preparation for the SAT and SHSAT.  Sharmila holds a Bachelor of Business Administration Degree from Pace University and a Masters of Early Education from Long Island University.  She is also certified as a Senior Professional in Human Resources (SPHR, SHRM-SCP). Sharmila has a true passion for providing HR solutions for organizations by helping them build their HR infrastructure through technology, compliance and people. She enjoys coaching leaders to inspire and empower their teams and mentoring junior HR professionals to reach their full potential. Terence Cho Vice President of Real Estate Terence Cho Vice President of Real Estate Terence Cho currently serves as Vice President of Real Estate for the Battery Park City Authority and is responsible for leading the development and implementation of strategies to protect the public interest in the Authority’s management of its approximately 45 ground leases and other agreements with the developers of residential, commercial, hotel, and not-for-profit sites across the neighborhood’s 92 acres. Prior to joining BPCA, Mr. Cho spent six years at Empire State Development, New York State’s economic development agency, where he led many public-private partnerships such as the Belmont Park Redevelopment Project, Penn Station Area Redevelopment Project, High-Line Moynihan Connector, Queens West Development Project, 42nd Street Development Project, and the Victoria Theater Redevelopment Project. Mr. Cho began his career in the private sector at Lehman Brothers Holdings, Inc. and various private real estate brokerage firms and developers. At BPCA, Mr. Cho works with professionals across the Authority in driving efforts in pursuit of the Authority’s affordable housing goals, the City and State’s financial well-being, developing strategies to develop various assets in BPCA’s portfolio and managing obligations under BPCA’s agreements with building owners and occupants. Mr. Cho received a Bachelor of Arts from the University of Pennsylvania and a Masters in Business Administration from the University of Michigan. Pamela Frederick Chief Financial Officer Pamela Frederick Chief Financial Officer Ms. Frederick, joined the BPCA in November 2017.  In her prior role as Director and Derivatives Specialist at Citi Private Bank, she focused on providing a range of hedging solutions and tactical investments to ultra high net worth clients with a focus on Commercial  Real Estate and in the use of interest rate derivatives as a risk management tool.\u000b\u000bPrior to joining Citi in 2005, she worked with GE Capital in the Structured Finance Energy Group, focused on structured equity, lending  and mezzanine investments.  In addition, she worked at Fieldstone Private Capital Group and the Overseas Private Investment Corporation, providing infrastructure project finance and M&A advice to corporate and public sector clients.  She also worked for the Chase Manhattan Bank in Global Mergers & Acquisitions and in Restructuring. She holds a B.A. in Economics and an M.B.A. in Finance from the University of Michigan, Ann Arbor and attended Ecole des Hautes Etudes Commerciales in Jouy en Josas, France.  She is a FINRA Registered Securities Representative; her  licenses include  Series 7 and Series 63. She resides in the Town of Greenwich, Connecticut  where she was elected to serve on the town council (RTM), headed the Finance Committee and served as Chair of the Special Committee on Retirement Benefits.  In 2016, she was named by The Network Journal as one of the 25 Influential Black Women in Business. Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman Senior Vice President, Design & Construction Heather Fuhrman is a Registered Landscape Architect and accomplished design and construction professional with over 16 years of experience in managing projects from concept to final delivery. Heather leads with a proactive approach to problem solving with an emphasis on developing innovative solutions to logistically complex project challenges. Since receiving her Master of Landscape Architecture at The City College of New York, Heather has been involved in a diverse portfolio of projects across many sectors with experience in new build commercial development, waterfront resiliency, and infrastructure projects. Heather brings extensive experience in managing complicated projects and is recognized for her collaborative leadership style, driving impactful outcomes through transparency and communication. Prior to joining BPCA, Heather worked at MNLA, where she designed and managed multiple waterfront projects including a 1.5 mile stretch along Hudson River Park and the East River Esplanade redevelopment adjacent Rockefeller University’s River Campus. For the last nine plus years, she has worked for Cumming Group, a project management and owner advisory firm serving as a Vice President of project management, acting as a Project Executive for a variety of projects including New York Climate Exchange, the NYNJ Port Authority Midtown Bus Terminal Replacement project, and Northwell’s Lloyd and Victoria Goldman Cancer Care Pavilion on the Upper East Side. Having worked in both the design realm and built environment, she brings a unique knowledge base to her new role as Senior Vice President of Design and Construction. Craig Hudon Vice President, Parks Programming Craig Hudon Vice President, Parks Programming Craig Hudon, Director of Parks Programming, has been developing and implementing groundbreaking programming and events in Battery Park City for more than 16 years.  He has overseen the expansion of cultural, educational and creative arts programming presented by Battery Park City Authority focusing on live music and theater series, and nature, art and wellness classes for all ages.  Prior to joining Battery Park City Parks, Craig worked in marketing and events at Snowbird Ski Resort where he spearheaded bringing in a new era of world-class Freeriding competitions to the resort, as well as many concerts, festivals and competitions.  He started his career as an environmental educator through his work in Shenandoah National Park and as Assistant Director at Bristol Regional Environmental Centers in Connecticut. Craig received a B.S. in Recreation Studies from Ithaca College. Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan Vice President of Administration and Senior Advisor for Diversity Contracting Jahmeliah Nathan joined the Battery Park City Authority with an extensive 15-year career in the public sector. Most recently, she served as the Chief Diversity Officer of the Governor’s Office of Storm Recovery (GOSR), where she cofounded and developed that agency’s Office of Diversity and Civil Rights, leading the Minority and Women-Owned Business Enterprise (MWBE), Federal Section 3, and Fair Housing and Equal Opportunity (FHEO) programs for New York State’s $4.4 billion disaster recovery spend. Under Jahmeliah’s leadership, the agency surpassed NY State’s 30% goal for MWBE utilization all four years of her tenure. Prior to GOSR, Jahmeliah held several policy and management positions in the Bloomberg Administration, including Executive Director for Intergovernmental Affairs for New York City’s Department of Education, Chief of Staff for the Mayor’s Office of Contract Services, and Senior Legislative Analyst for the Mayor’s Office of Legislative Affairs. Ms. Nathan has a Master’s Degree in Public Administration from Long Island University and a Bachelor of Arts in Philosophy, Politics and Law from Binghamton University. She has also served as an adjunct professor at CUNY’s Hostos Community College, where she lectured on Public Administration and Public Policy. Nicholas Sbordone Vice President, Communications & Public Affairs Nicholas Sbordone Vice President, Communications & Public Affairs Nick Sbordone came to the Battery Park City Authority after spending his career in New York City government across three mayoral administrations. At BPCA, Nick works closely and on a daily basis with the local community, media, elected officials, and partner organizations on the Authority’s full range of public-facing initiatives. Beginning his career in 2001 at the Mayor’s Office of Operations as a policy analyst, Nick helped prepare the bi-annual Mayor’s Management Report. Moving to the Taxi & Limousine Commission he worked on a range of issues affecting the taxi and for-hire vehicle industry, including wheelchair accessibility and the sale of new taxicab medallions. Then, at the Department of Information Technology & Telecommunications he served as government affairs director and spokesman and for the 311 non-emergency information and services hotline, for 911 system modernization, cable television and broadband, cybersecurity, and the City’s open data and free WiFi initiatives. Born and raised in Brooklyn – with a sojourn in central New Jersey – his passions include history, architecture, sports and U.S. presidential trivia, and all things New York City. His is a familiar face at community meetings and assorted public gatherings across downtown Manhattan, so please feel free to stop over and say hello. Ryan Torres Vice President , Parks Operations Ryan Torres Vice President , Parks Operations Ryan Torres is an accomplished parks operations professional with more than two decades of progressive experience in horticulture, maintenance, sustainability, and safety. Ryan started her career as a fourth-generation horticulturist focusing on design and sales within all things landscape management. She consulted for municipalities in arboriculture and instructed adult classes at the New York Botanical Garden and other organizations on various horticulture topics. Before starting at BPCA, Ryan work as the Horticulturist for the Town of North Hempstead in Nassau County, NY, where she oversaw the 12-acre botanic garden and assisted with over 100 acres of open spaces within the town. In 2014, Ryan started working at Battery Park City Authority as the Assistant Director of Horticulture, where she supervised staff and scheduled the day-to-day operations of the department, maintained budgets, and oversaw all purchases. Four years later Ryan was promoted to Assistant Vice President of Parks Operations where she shared the collaborative supervision of more than 60 employees, pioneered the Zero Waste Committee, Safety Advisory Committee and Dog Waste Composting Program, and created standard-operating procedures and policies for the department, as well as led and participated in all departmental and interdepartmental meetings. Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid Director of Workplace Culture and Engagement Alexis Torres Cid joined the Battery Park City Authority in 2014 after five years with the City of New York in various roles during the Bloomberg Administration. Beginning her career in 2009 as a Licensing Specialist at the NYC Business Integrity Commission (BIC), she worked to help eliminate organized crime and other forms of corruption from the public wholesale markets, trade waste, and shipboard gambling industries. In 2011, she became BIC’s Complaints Coordinator, a role in which she drove more than 3,000 incoming complaints and inquiries to satisfactory resolution. For these efforts BIC earned a 100% success rate and multiple excellence in customer service citations. Alexis later became the Special Assistant to the BIC Commissioner, and then served as Special Advisor to the Battery Park City Authority to the President and Chief Operating Officer. In her current role at the Authority, Alexis oversees implementation of a variety of special projects and events, including the organization’s annual Earth Day programs with local schools. Alexis holds a Bachelor of Science degree in Public Relations and a Master’s Degree in International Communications from St. John’s University. Resources: NY State Open Data RFP Opportunities Public Information Links BPC Parks Rules and Regulations Website Accessibility Language Services 中文(Chinese) English Kreyòl ayisyen (Haitian-Creole) Italiano (Italian) Русский (Russian) 한국어 (Korean) Español (Spanish) Contact Us: 200 Liberty Street, 24th Floor New York, NY 10281 (212) 417-2000 info.bpc@bpca.ny.gov Resources: NY State Open Data RFP Opportunities Public Information Links BPC Parks Rules and Regulations Website Accessibility Language Services 中文(Chinese) English Kreyòl ayisyen (Haitian-Creole) Italiano (Italian) Русский (Russian) 한국어 (Korean) Español (Spanish) Contact Us: 200 Liberty Street, 24th Floor New York, NY 10281 (212) 417-2000 info.bpc@bpca.ny.gov Copyright © 2025 BPCA / Site created by Revolver Studios Your browser does not support iFrames Required 'Candidate' login to applying this job. Click here to logout And try again Login to your account Enter Email Address: Password: Forgot Password? Save Password Reset Password Enter Email Address: Already have an account? Login Enter the username or e-mail you used in your profile. A password reset link will be sent to you by email. Close Account Activation Before you can login, you must activate your account with the code sent to your email address. If you did not receive this email, please check your junk/spam folder. Click here to resend the activation email. If you entered an incorrect email address, you will need to re-register with the correct email address. Your Email: Activation Code:"
    },
    {
      "url": "https://www.coab.us/13/Recreation-Division",
      "text": "Recreation Division | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Art Gallery Arts, Recreation, and Culture Committee Cultural Arts & Recreation Grant Program Class Schedule Events Calendar Acoustic Nights Artisans' Faire Atlantic Beach Farmers' Market Fall Festival Family Fun Day & Campout Under the Stars Twilight Movies in the Park Songwriters Concerts Permits & Rentals Permits Rentals Reserve a Wheelchair Special Event Request Programs Theater Youth Council Youth Sports Recreation Resources Beach Wheelchairs & ADA Access ADA Beach Access Map Atlantic Beach Dog Park Beaches Town Center Greater Jacksonville Paddling Guide North Beaches Art Walk Parks Visit Jacksonville Tennis in Atlantic Beach Volunteer! Home Departments Neighborhoods Department Recreation Division Recreation Division Atlantic Beach Music Fest Atlantic Beach Music Fest Atlantic Beach Music Fest Family Fun Day / Campout Under the Stars Family Fun Day / Campout Under the Stars Easter Egg Hunt - \"Bunny\" and \"Mrs. Bunny\" Easter Egg Hunt - train ride Easter Egg Hunt - face painting Arts in the Park 2024 Winners Arts in the Park Flag Football Program Cheerleading Program Artisans' Faire 2023 Artisans' Faire under the tent Songwriters Concerts @ Gulliford Hall Acoustic Night at Bull Park 1 attendees enjoying the music at Atlantic Beach Music Fest 2 Atlantic Beach Music Fest 3 Atlantic Beach Music Fest 4 IMG_2620 5 IMG_2652 6 20240330_114716 7 20240330_121832 8 IMG_2279 9 IMG_6266 10 IMG_6272 11 IMG_6212 12 IMG_3191 13 IMG_1775 14 IMG_5846 15 Songwriters 16 Acoustic Sept 21 The Recreation Division offers two community centers and one cultural center with recreational programs for your enjoyment. We provide opportunities for you and your family to participate in cultural and leisure activities while enjoying our many beautiful parks. The City of Atlantic Beach has approximately two miles of white sandy beaches with 19 ocean beach accesses. In addition to the beach, the City has about 65 acres of parkland, including Dutton Island Preserve on the Intracoastal waterway. The Recreation Division offers activities such as after-school and summer camp programs through the NE FL Boys & Girls Club, youth sports, and Special Events that include local talent concerts, Arts in the Park, Family Fun Day/Campout, Movies under the Stars, and Holiday celebrations for families and much more. Recreation & Community Events For upcoming recreational & community events, view the calendar of events . Call (904) 247-5828 or Email the Recreation Division for further information about our programs and facilities. Cultural Arts & Recreation Division 716 Ocean Blvd. Atlantic Beach, FL 32233 (904) 247-5828 Email the Recreation Division Sign up and be notified of upcoming Recreation & Community Event Programs . Facebook Follow us on Facebook Instagram Follow us on Instagram Requests & Comments For Parks maintenance concerns or issues, please contact the Public Works Department at 904-247-5834 or report a problem through the Citizen Request Tracker program . Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://torontohousing.ca/contact-us",
      "text": "Contact us | Toronto Community Housing Skip to main content Secondary navigation News and stories Events Careers Board and governance Partner with TCHC About Us Search Site search Search Menu Main navigation Current tenants Tenant guide Your tenancy and lease Your home Common areas Transfers and housing changes Your TCHC team Tax information Tenant Charter Tenant policies Services and support Tenant Service Hubs Request repairs, maintenance or pest control Affordable internet and mobile program Energy relief program Employment resources Community services directory Current building posters iHelp Tenant safety Community Safety Unit (CSU) Prepare for an emergency Safety guide Fire safety Identifying scams and fraud Accessibility in TCHC The built environment Accessibility in communications Accessibility in engagement R-PATH Committee Book a space Book a one-time private event Book a community event or program Programs and tenant engagement Tenant engagement Tenant Councils Tenant Advisory Committee Youth Tenant Advisory Committee Tenant Community Action Table (TCAT) Local Initiative Funding for Tenants (LIFT) Tenant Engagement System Review Youth programs Camp Inspire KickStart Midnight Basketball HeadstART Brook Restoration Pre-Apprenticeship program The Next Surgeon Community programs Be.Build.Brand. YouthWorx Community gardens Stop the Bleed True Vision Scholarships Investing in Our Diversity Scholarship Alexandra Park Revitalization Scholarship Don Summerville Scholarship Regent Park Scholarship The Centre for Advancing the Interests of Black People Centre Community Funds Building construction and revitalization Revitalization Alexandra Park Don Summerville Firgrove-Grassways Lawrence Heights Regent Park Swansea Mews Completed Revitalizations Capital repairs 10-year capital plan Deep building retrofits Planned Project Services Community updates Relocation and return Conservation Conservation resources for tenants Transparency Reporting Financial reporting Annual reports Access to information Make a freedom of information request Collection and use of personal information Insurance claims Report fraud Accountability offices Prospective tenants Market rent Affordable rent Subsidized rent (RGI) City resources Contact us Get in touch with us Feedback, compliments and complaints Tenant complaint process Tenant Human Rights Complaints Improving the tenant human rights process Sign up for email and text communications Staff directory Main navigation (Mobile) Current tenants Tenant guide Your tenancy and lease Your home Common areas Transfers and housing changes Your TCHC team Tax information Tenant Charter Tenant policies Services and support Tenant Service Hubs Request repairs, maintenance or pest control Affordable internet and mobile program Energy relief program Employment resources Community services directory Current building posters iHelp Tenant safety Community Safety Unit (CSU) Prepare for an emergency Safety guide Fire safety Identifying scams and fraud Accessibility in TCHC The built environment Accessibility in communications Accessibility in engagement R-PATH Committee Book a space Book a one-time private event Book a community event or program Programs and tenant engagement Tenant engagement Tenant Councils Tenant Council Elections: Nominations process Tenant Advisory Committee Youth Tenant Advisory Committee Tenant Community Action Table (TCAT) Local Initiative Funding for Tenants (LIFT) Tenant Engagement System Review Youth programs Camp Inspire KickStart Midnight Basketball HeadstART Brook Restoration Pre-Apprenticeship program The Next Surgeon Community programs Be.Build.Brand. YouthWorx Community gardens Stop the Bleed True Vision Scholarships Investing in Our Diversity Scholarship Alexandra Park Revitalization Scholarship Don Summerville Scholarship Regent Park Scholarship The Centre for Advancing the Interests of Black People Centre Community Funds Building construction and revitalization Revitalization Alexandra Park Don Summerville Firgrove-Grassways Lawrence Heights Regent Park Swansea Mews Completed Revitalizations Capital repairs 10-year capital plan Deep building retrofits Planned Project Services Community updates Relocation and return Conservation Conservation resources for tenants Transparency Reporting Financial reporting Annual reports Access to information Make a freedom of information request Collection and use of personal information Insurance claims Report fraud Accountability offices Prospective tenants Market rent Affordable rent Subsidized rent (RGI) City resources Contact us Get in touch with us Feedback, compliments and complaints Tenant complaint process Tenant Human Rights Complaints Improving the tenant human rights process Sign up for email and text communications Staff directory Secondary navigation (Mobile) News and stories Events Careers Board and governance Partner with TCHC About Us Contact us There are a variety of ways to contact TCHC. Depending on who you need to reach, you may want to give us a call, fill out a feedback form or contact our solutions team. We look forward to hearing from you. Get in touch with Toronto Community Housing Get in touch with Toronto Community Housing staff and client care by phone, email or online form. Feedback, compliments and complaints Provide your feedback, compliments and complaints through this form. Tenant complaint process Do you have an unresolved concern or a complaint you would like to escalate? Contact the Solutions team. Tenant Human Rights Complaints How to submit a human rights complaint Email and text communications Learn how we use email and text to communicate with tenants, and sign up to receive updates from us. Staff directory Access our staff directory here. Contact us for service, maintenance and other support. Back to top Contact TCHC Client Care Centre (24/7) Phone: 416-981-5500 Email: help@torontohousing.ca Client care request form Community Safety Unit Phone: 416-921-2323 City of Toronto Phone: 311 Email: 311@toronto.ca Website: toronto.ca Access to housing: housingconnections.ca Footer Tenant guide Terms of use & privacy Web accessibility Land acknowledgement Toronto Community Housing Instagram Toronto Community Housing Facebook Toronto Community Housing LinkedIn Toronto Community Housing X © Toronto Community Housing Corporation\n\t\t\t\t2025"
    }
  ]
}