{
  "fuentes": [
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "email": "juan@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/you-aint-seen-nothing-yet",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/you-aint-seen-nothing-yet",
      "email": "rebecca@coastalcountybrewing.com"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us",
      "email": "fred@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us",
      "email": "rebecca@coastalcounty.com"
    },
    {
      "url": "https://coastalhemp.co/pages/contact-us-questions-answers",
      "email": "life@coastalhemp.co"
    },
    {
      "url": "https://coastalcountybrewing.com/",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://guidetoflorida.com/pensacola/food-drink/coastal-county-brewing",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/pensacola/food-drink/coastal-county-brewing",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://coastalcountybrewing.com/food",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/the-red-tide",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/the-red-tide",
      "email": "rebecca@coastalcountybrewing.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/03/13/pensacolas-coastal-county-brewing-co-opens-east-olive-road/5023865002/",
      "email": "gregg@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/03/13/pensacolas-coastal-county-brewing-co-opens-east-olive-road/5023865002/",
      "email": "gregg@pnj.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/03/13/pensacolas-coastal-county-brewing-co-opens-east-olive-road/5023865002/",
      "email": "jnewby@pnj.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/new-beginnings",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/new-beginnings",
      "email": "rebecca@coastalcountybrewing.com"
    },
    {
      "url": "https://www.craftbeer.com/news/brewery-news/north-coast-brewing-company-announces-historic-leadership-changes",
      "email": "tagline@1x.png"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us#:~:text=We are led by our Owner and Head Brewer, Fred Thibodeaux.",
      "email": "fred@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us#:~:text=We are led by our Owner and Head Brewer, Fred Thibodeaux.",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us#:~:text=We are led by our Owner and Head Brewer, Fred Thibodeaux.",
      "email": "rebecca@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/new-flavors-for-a-new-day",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/f/the-latest-and-greatest",
      "email": "michaela@coastalcounty.com"
    }
  ],
  "mails": [
    "directory@guidetoflorida.com",
    "fred@coastalcounty.com",
    "gregg@pnj.com",
    "info@secureitsecurities.com",
    "jnewby@pnj.com",
    "juan@coastalcounty.com",
    "life@coastalhemp.co",
    "michaela@coastalcounty.com",
    "name@yoursite.com",
    "rebecca@coastalcounty.com",
    "rebecca@coastalcountybrewing.com",
    "tagline@1x.png"
  ],
  "nombre_sitio": "coastalcountybrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "text": "Jobs 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Coastal County Brewing is Pensacola's first destination brewery/restaurant.  We are a family-owned and operated restaurant located at 3041 East Olive Rd between 9th Avenue and Dreamland Skate Park.  We are looking for staff members who want to grow with us. If you are a reliable, dependable, self-motivated, over-achiever we would love to have you join our team. Must be able to pass background check. Taproom Beertenders(esses) Job Summary: Facilitate visitor enjoyment by performing a variety of customer service. duties including, but not limited to, greeting and serving customers and co-workers, providing education about our products and other products we carry, stocking bar, serving drinks, and maintaining cleanliness and orderliness of bar facilities. Essential Job Duties and Responsibilities: (Additional duties may be assigned) • Represent Coastal County as a brand Ambassador! • Provide excellent customer service to visitors. i.e.) Greet and serve visitors in a positive and friendly way. Greet everyone who visits the Tap Room with hello and goodbye. Treat everyone like a regular. • Interact with visitors to develop and maintain a favorable public image. Answer questions and educate guests about Coastal County Brewing, our beers and other products, the differences between beer styles as well as the history and culture around us and craft beer in general. • Educate customers on how to sample beer. (Color, Clarity, carbonation, head retention, aroma, mouthfeel/body, flavors, finish) • Promote other items we offer for sale. • Promote Coastal County events and specials. • Complete all paperwork involved to day-to-day operations (inventory sheets, gift certificate sheets, keg order forms, incident reports etc.) • Compile daily receipts and other paperwork per GNB procedure for processing. • Maintain comfort & cleanliness throughout the Tap Room, Storage Areas, cooler, office, and restrooms. • Ensure the Tap Room, bar and bar area, counters, sinks, utensils, coolers, shelving and storage areas are clean and comply with established sanitation standards, personal hygiene, and health standards at all times. • Report all equipment problems, bar maintenance issues, violations or substandard practices to your supervisor immediately upon encountering a problem. • Attend staff meetings, events and other functions required. • Promote good public relations and handle complaints and concerns of guests. • Report any issues to our draft system or building immediately to Tap Room Manager. • Assist with inventory procedures. Alert Supervisor about shortages or discrepancies. • Minimize waste by ensuring all sales go through POS system properly and the Draft & Cask Systems are operating optimally at all times. • Collect payment for all sales Scroll down to download our employment application.  Drop it off in person or scan and email to: michaela@coastalcounty.com Kitchen Cooks We are searching for professional, energetic kitchen staff members to be a part of Pensacola's first destination brewery concept. Job duties will include: line cook/prep cook. Plating/expo. Dish/utility Responsibilities: Able to take direction and guidance from the executive chef. Efficiently set up and stock all stations for guest service. Being able to follow all kitchen recipes and guidelines to ensure a consistent, quality product for our guests. Maintaining a clean and organized workspace during peak business while adhering to all safety and sanitation practices. Store all food products properly (first in first out) and check all food vendors for accuracy and quality. Work as a team while to help provide a positive, professional work environment with your coworkers and guests. Requirements: Proven work experience. References will be checked. Ability to lift 50 pounds and to be on your feet for long periods of time. Being able to use various equipment and cooking methods for efficiency and accuracy. Self-motivated individuals with a strong work ethic. all your efforts will be greatly appreciated. Scroll down to download our employment application.  Drop it off in person or scan and email to: juan@coastalcounty.com . Think you have what it takes?   How would you answer these typical interview questions? How many years have you been in the service industry? Are you interested in cross-training? What skills do you hope to learn here? How is your beer knowledge and what is your favorite beer? What is your availability? What days can you not work? Any long trips coming up? download our employment application Download PDF Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://coastalcountybrewing.com/f/you-aint-seen-nothing-yet",
      "text": "You Ain't Seen Nothing Yet! 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us",
      "text": "About Us 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs We are a Coastal Loving Community, making Tasty Brews for all Outdoor Adventure Lovers. Brewing Fun for the sun! About Us Our Story Born and raised in Pensacola, Fred Thibodeaux spent a lot of time at The Shopper: a local classified ads newspaper owned by his mother, Susan Thibodeaux.  After 44 years of being a staple publication of Pensacola, she decided to change the business and help him pursue his passion for brewing amazing craft beer.  As an avid fisherman and scuba diver, he wanted to bring his passions of brewing and the coastal scene together and offer a place for people to enjoy interesting food, craft beer, and a love of the outdoors. Meet the Brewer Working for corporate was never my thing.  So, after deciding to quit my job, my mom suggested to just do what you love.  At the time, I had a strong passion for fishing and home brewing.  I decided to apply to Ragtime Tavern in Jacksonville, FL as a server who could occasionally spend time with the “brew master.”  After a year of learning the basics, I was offered an assistant brewery position at the sister company, Gordon Biersch Brewpub, specializing in German Lager beer in Glendale, Arizona.  I spent a lot of time learning about brewing, hiking, mountain biking, and outdoor survival.  I then decided to push further into production brewing and began working for The Duck Rabbit Craft Brewery, which taught me about the finer points of brewing dark ale and barrel aging beers.  Then, I decided to move back to Florida to be near my family and the ocean.  I began working at Cigar City Brewing as a production brewer, where I quickly recognized the demand for great beer that focuses on the Florida lifestyle.  I was then hired at Wicked Barley Brewing to help them pursue their dream of running their own brewery, and it gave me the opportunity to teach other young brewers proper techniques for making great beer.  Seeing a small successful brewery open encouraged me to start my own brewery with my family in my hometown. A Destination Brewery We want Coastal County Brewing to be a community brewery for family, friends, and conversation: a local spot to relax, talk about beer, and spend time playing games or throwing disc golf with your dogs.  We have over two acres of space, with a beautiful patio and a large beer garden for great music and entertainment.  A friendly, knowledgeable staff will greet you with a smile, and make you feel at home.  And, plenty of Special Events will take you out of the ordinary and show you an incredible time.  There's always something to do at Coastal County while enjoying great beer, great food, and great people. Management Team We are operated by a close-knit group working together to make this the best local brewery for our community.  We constantly strive to surpass our own expectations, as well as our customers'.  Our General Management position belongs to Michaela Todd.  This all-star has had years of experience to prepare her for this venture.  She fearlessly faces any challenge laid before her to lead us into the future.  Our Chef and Kitchen Manager is Rudy Martinez.  His innovative ideas and recipes are transforming our kitchen into a streamlined purveyor of homestyle comfort foods.  Rebecca Hinson is our Brewery Ambassador and Marketing Manager.  She works diligently to keep everyone up to date on all things happening at the brewery, while striving to ensure that each event is a success.  We are led by our Owner and Head Brewer, Fred Thibodeaux.  He's quickly becoming the local favorite for his talent in brewing a different flavor for everyone's palate.  Stop in and say \"Hello\" to these Faces behind the Brews! Contact Michaela Get help booking a private party, set up your catering orders, or potentially finding a job by contacting our GM, Michaela Todd. email Contact Rebecca If your looking for more information about any of our upcoming special events, or you are a musician or vendor seeking a future appearance at the brewery, you'll want to talk to our Marketing & Events Manager, Rebecca Hinson. email Contact Fred Need to speak the owner directly?  Contact Fred Thibodeaux. email Sneak Peek... Check out what we have in store for you! These Smiling Faces speak for themselves.... Feel those CCBC Vibes! Take a peak at Where the Magic Happens... Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://coastalhemp.co/pages/contact-us-questions-answers",
      "text": "CoastalHemp Co Charleston | Contact Us | Get in Touch Skip to main content 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📦 Free Shipping on Orders over $75 📬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 📞 Get in Touch - 10am to 7pm ET 💬 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 💰Earn Rewards with Every purchase! 🤑 Shop Shop Categories Staff Picks Shop by Effect Shop by Brand Shop All Accessories Disposables Shop Vape Pens Shop Vape Cartridges Shop CBD Vape Pens Edibles Gummies Munchables Seltzers and Drinks Syrups CBD Gummies Mushrooms For Fun Functional - Micro Dose THCA Flower and Dabs THCa Flower THCa Dabs THCa Pre-Rolls Kratom Deals Daily Deal Monthly Mystery Box Bulk Deals Weekly Specials Learn More Blog Lab Results About Us Rewards Partner Ambassador Program Wholesale Program Shop Back Shop Shop All Back Shop All Accessories Shop Categories Staff Picks Shop by Effect Shop by Brand Disposables Back Disposables Shop Vape Pens Shop Vape Cartridges Shop CBD Vape Pens Edibles Back Edibles Gummies Munchables Seltzers and Drinks Syrups CBD Gummies Mushrooms Back Mushrooms For Fun Functional - Micro Dose THCA Flower and Dabs Back THCA Flower and Dabs THCa Flower THCa Dabs THCa Pre-Rolls Kratom Deals Back Deals Daily Deal Monthly Mystery Box Bulk Deals Weekly Specials Learn More Back Learn More Blog Lab Results About Us Rewards Partner Back Partner Ambassador Program Wholesale Program Get in touch Contact us Have questions? Shoot us an Email Contact Us. Share your thoughts below, and we'll review them as soon as possible. You can trust us to take your feedback seriously and help you find the right product or solution to your issue. Just fill out the form below or: Contact Us Reach us by Email life@coastalhemp.co We typically respond within one business day Reach us by Phone 888-433-4223 10 AM to 6 PM ET Physical Address Coastal Hemp Co 2612 Larch Lane Suite 102 Mt. Pleasant, SC 29466 Welcome to Coastal Hemp Co, where passion meets purpose. We are a hemp dispensary committed to revolutionizing wellness through the power of hemp. Our mission is to provide high-quality, sustainably sourced hemp products that enhance your well-being. Read More 569 Belle Station Blvd Mount Pleasant SC 29466 Open in maps Monday - Friday 10am - 7pm Saturday - Sunday 10am - 6pm Name Email Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. About Us We are more than just a dispensary—we are a community. P: 888-433-4223 Hours: 10 am - 7 pm ET M-F Saturday 10 am - 6 pm ET 2025 © CoastalHemp.Co Support Lab Results Shipping FAQ's Shipping Protection Rewards Wholesale Site About Us Contact Us Manage Subscriptions Terms&Policies Coupons & Discounts FDA Disclaimer Refund policy Privacy policy Terms of service Shipping policy Cancellation policy Contact information Powered by Shopify American Express Discover JCB Mastercard Visa Important Information THCA Flower: This product is not available for shipment to the following states: Alaska, Arizona, California, Colorado, Connecticut, Delaware, Idaho, Iowa, Michigan, Mississippi, Montana, Nevada, New Hampshire, New York, North Dakota, Oregon, Rhode Island, Utah, Vermont, Virginia, Washington, West Virginia Delta-8 : We are not able to ship Delta-8 products to the following states: Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Kentucky, Idaho, Iowa, Michigan, Mississippi, Montana, New York, Nevada, North Dakota, Oregon, Rhode Island, Utah, Vermont, Washington Amanita Mushrooms: Products containing Amanita mushrooms or extract are not available for shipment to Louisiana. FDA Disclosure The statements made regarding these products have not been evaluated by the Food and Drug Administration. The efficacy of these products has not been confirmed by FDA-approved research. These products are not intended to diagnose, treat, cure or prevent any disease. All products on this website contain .3% THC Delta-9 or less. No statement in this web site has been evaluated by the Food and Drug Administration (FDA). Furthermore, none of the statements in this web site should be construed as dispensing medical advice or making claims regarding the cure of diseases. Kratom : This product is not available for shipment to the following states: Alabama, Arkansas, Indiana, Rhode Island, Wisconsin; or the following counties: Sarasota County (Florida), San Diego (California), Oceanside (California), Alton (Illinois), Jerseyville (Illinois), Edwardsville County (Illinois), Columbus (Mississippi), Union County (Mississippi), Ascension (Louisiana), Franklin (Louisiana), Rapides (Louisiana) Search here... Cancel Popular products Choose options QWIN Puffy THCA Super Blend Disposables 2G $28.00 Choose options Road Trip Co. Road Trip Mushroom Gummies $28.00 Quick add Modern Herb Co Modern Herb Co Delta 9 Live Resin Gummies: Daytrip Blend $35.00 Choose options Woodstock Hemp Co Woodstock THCa Liquid Diamond Live Resin 2.0g Disposable $39.00 Your Cart You are $75.00 from free shipping. Leave a note with your order Your cart is currently empty. Browse our selections: Shop Disposables Edibles Mushrooms THCA Flower and Dabs Kratom Deals Learn More Subtotal: $0.00 USD Taxes and shipping calculated at checkout Checkout"
    },
    {
      "url": "https://coastalcountybrewing.com/",
      "text": "Coastal County Brewing Company - Brewery, Restaurant 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://guidetoflorida.com/pensacola/food-drink/coastal-county-brewing",
      "text": "Coastal County Brewing - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Pensacola Food & Drink Coastal County Brewing Coastal County Brewing Share Breweries 3041 E Olive Rd, Pensacola, Florida, 32514 Send Message 850-741-2973 Vote for Us! | Breweries Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Coastal County Brewing Visit Website https://www.coastalcountybrewing.com Online Social Profiles Phone Number 850-741-2973 Location 3041 E Olive Rd Pensacola , Florida , 32514 United States About Coastal County Brewing We are a family and pet friendly brewery restaurant with a volleyball court, bounce houses, and dog park. × Map View Get Directions Cancel FEATURED LISTINGS! Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 LIME Fresh Mexican Grill Plantation, FL 33324 Website (407) 383-5015 Leroy's Southern Kitchen & Bar Punta Gorda, FL 33950 Website 941-505-2489 READ AND REAP! Southern Comfort With a Side of Soul! Smoke in the Air, Crafts Everywhere! Changing the Game, One Cut at a Time MORE TO EXPLORE! Best of Florida Voting Best Breweries in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://coastalcountybrewing.com/food",
      "text": "Food 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Welcome We are a locally owned brewery and restaurant! We have food and beer available for carry out. Find out more Menu Options Full Menu (Front) Starters, Munchies, and Signature Sandwiches Full Menu (Back) Heavy Hitters, Gourmet Grilled Cheese Sandwiches, Kids, and Lighter Fare Coastal county Catering Catering Menu Everything you need to get ready for your next gathering. Downloads Take a closer peak out our Menu Options... 2025 CCB Menu Front (1) (1) (jpg) Download 2025 CCB Menu Back (1) (3) (jpg) Download Catering Menu (inside)n (4) (jpg) Download snacks & shareables 'Power Through' Pretzel Bites $9.95 Warm, Salted Pretzel Bites served with CCB Beer Cheese and Spicy Mustard. Pretzelsaurus $13.95 Giant, Bavarian-style Salted Soft Pretzel served with CCB Beer Cheese and Spicy Mustard. 'Gone Greek' Hummus Trio   $14.95 Traditional, spicy & one rotating flavor Hummus served with fresh veggies and warm pita points 'Poppin' Hot' Jalapeno Popper Dip    $11.95 Pickled  jalapenos, green onion, bacon, cheeses & spices served with chips & sticks. Served hot. 'Dippity Doo Dah' Dip Trio $14.95 'Bird's Got Bite' Buffalo Chicken Dip $11.95 Now you don't have to choose just one!  Enjoy a portion of CCB Beer Cheese, Jalapeno Popper Dip, and Buffalo Chicken Dip served with Tortilla Chips. 'Bird's Got Bite' Buffalo Chicken Dip $11.95 'Bird's Got Bite' Buffalo Chicken Dip $11.95 Tender, pulled chicken blended with spicy Buffalo sauce, Cream Cheese, Cheddar and Green Onions.  Served with Tortilla Chips. Going Green 'Greens & Things' House Salad   $9.95 Chopped greens, tomato, cucumber, red onion, sunflower seeds & cheese blend. 'Top Chef'   $14.95 Mixed greens ,Ham, Turkey, Swiss & Cheddar cheese, tomato, cucumber, and chopped bacon. Choose your favorite dressing Balsamic vinaigrette, 1000 Island, Blue cheese, or Ranch Salad Additions  $3.75 Add Pork, Chicken, Ham, or Turkey Munchies & Such Mac on Tap   $9.95 Macaroni & Cheese made with love. The Mac Daddy $13.95 Your Favorite CCB Mac & Cheese loaded to the max with BBQ Pulled Pork and all your favorite CCB Toppings! The Grilla' Dilla $13.95 Choice of Chicken, Pork or Bacon with grilled Peppers & Onions, and mixed Cheeses.  Pressed into a Flour Tortilla and Grilled to Perfection.  Served with chips & salsa. The Pecking Platter $10.95 Our famous House Made Smoked Chicken Salad served on a bed of fresh greens with Buttery Crackers for dipping. You're So Basic $6.95 CCB Beer Cheese and Salsa served with Tortilla Chips. Nacho Average Nachos $12.95 Tortilla Chips loaded with your choice of BBQ Chicken or Pork, Shredded Cheese, Beer Cheese, Jalapenos, Pickles, Green Onion, and a BBQ Sauce Drizzle. Signature sandwiches All sandwiches come with chips, slaw or Creole potato salad. The Coastal Cuban   $14.95 Hot off the press with smoked pulled pork, shaved Pit ham, bacon, Swiss cheese, pickle & CCB beer mustard loaded onto a Gambino roll. Triple Decker Club    $14.95 Shaved Pit ham, smoked turkey, bacon, Swiss & cheddar,  lettuce,  tomato & 1000 Island on toasted sour dough. The Brewbird     $12.95 Lightly smoked chicken mixed with green onion, celery and a savory blend of spices, served on toasted sour dough with bacon, lettuce, tomato, cheddar cheese & red onion. Irish Hangover Cure   $13.95 Corned Beef, Sauerkraut, and 1000 Island Piled high with Swiss Cheese on Toasted Marble Rye. Big Daddy BLT   $9.95 A Classic Favorite!  Crispy Bacon piled high on Toasted Sourdough.  Topped with Mayo, Lettuce, and Tomato. The Ragin' Cajun   $14.95 Turkey, Bacon, Pepperjack Cheese, Cajun Remoulade, Picked Banana Peppers, and Crispy Fried Onions on Toasted Sourdough. Hog Wild   $13.95 Classic BBQ Pulled Pork topped with House Slaw, Red Onion, and BBQ Sauce on a toasted bun.  (Substitute Pulled Chicken Upon Request.) PJ's Pig Out  $14.95 Pulled Pork, Crispy Bacon, and Shaved Ham on a King's Hawaiian Bun.  Topped with Melty Swiss and Sweet Heat Pepper Jelly. The Hungry Spartan  $13.95 Traditional Gyro Meat with Lettuce, Tomatoes, Red Onion, Feta, Hummus, and Creamy Tzatziki in a Toasted Pita Bread. Smile & Say Cheese - Grown-up grilled cheese sandwiches All Grilled Cheeses served on Buttered Sourdough with chips, slaw or Creole potato salad. The Big Poppa'   $13.95 CCB Jalapeno Popper Dip, Crispy Bacon, Melty Cheddar, and Sliced Jalapenos with a Hot Honey Drizzle Pork-Tastic    $13.95 House-Smoked Pulled Pork and Cheddar Cheese with a BBQ Sauce Drizzle. Homestyle     $12.95 Cheddar, Swiss, Bacon, and Tomato with Everything Bagel Seasoning. Mac Attack   $12.95 Generous Scoop of CCB Mac & Cheese topped with Sliced Cheddar. The Maple Monsieur   $13.95 Savory Tavern Ham, Cheddar, Swiss, and Dijon Mustard with a drizzle of sweet Maple Syrup. It's Betta' with Feta   $12.95 Feta Cream Cheese Spread, Spinach, and Tomato. THE LIGHTER SIDE Served with chips, slaw or Creole potato salad. The Pita Pecker   $14.95 Shaved Turkey, Feta Cream Cheese Spread, Lettuce, Tomato, Onion, Cucumber, and Banana Peppers on a Toasted Pita. The Ranch Hand    $13.95 Lightly Smoked Pulled Chicken blended with Buffalo Sauce with Lettuce, Shredded Carrots, Red Onion, and a light Ranch Drizzle wrapped in a Soft Flour Tortilla. South Beach Wrap     $13.95 Hummus, Spring Mix, Tomatoes, Shredded Carrots, Bell Peppers, Red Onion, and Cucumber wrapped in a Soft Flour Tortilla. For the YOungsters Kids meals come with chips, sticks or pickle bites & a fountain drink. Ham, Turkey or Grilled cheese Sandwich   $6.95 Ham or turkey with American cheese plain or toasted on white or sour dough mayo & mustard on the side. MAC & CHEESE   $6.95 Slow melted cheese over fresh noodles PB&J   $6.95 Simple and fast for anyone wanting a quick snack Cheese Quesadilla  $6.95 Cheese Blend Pressed and Melted in a flour tortilla. Call for pricing and additional information (850) 741-2973 Catering & Office Luncheons Let us do the work for you and prepare one of several party platters for your next event Chip & Dip Platters Sandwiches Kids Parties Outdoor Party Party Platters CALL FOR PRICING AND ADDITIONAL INFORMATION Dessert End your visit with something sweet! Ask your server about our Seasonal Selections! Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://coastalcountybrewing.com/f/the-red-tide",
      "text": "The Red Tide 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/03/13/pensacolas-coastal-county-brewing-co-opens-east-olive-road/5023865002/",
      "text": "Pensacola's Coastal County Brewing Co. opens on East Olive Road News Sports Play Opinion Advertise Obituaries eNewspaper Legals NEWS Coastal County Brewing Co. opens with craft brews, food and two-acre outdoor complex Jake Newby Pensacola News Journal A newly opened destination brewery unlike anything else in north Pensacola invites you to spend your day there. Coastal County Brewing Co. opens Friday at 3041 E. Olive Road with a full craft beer and food menu, a 92-seat indoor tap room and a two-acre outdoor beer garden and entertainment complex. \"I wanted it to be a place that has everything anyone could want from a brewery,\" Coastal County owner Fred Thibodeaux said Thursday, before the brewery's special \"neighbors night\" pre-opening party. \"Tons of variety, a beer garden, a dog park, plenty of parking. Everything.\" Most recently, Thibodeaux was a production manager at Wicked Barley Brewing Co. in Jacksonville. He mastered his craft there and also as an apprentice in Arizona and North Carolina. Thibodeaux, a self-proclaimed \"big nerd\" when it comes to the brewery and brewpub industry, has trained more than a few brewers along the way. And now, he's getting to embark on his own venture and execute his own vision in Pensacola, the town where he grew up. \"It's kind of like the handcuffs are off, to now have the freedom to do whatever I want and to experiment with every facet of brewing that I've researched over the past 10 years,\" Thibodeaux said. The original story: Pensacola brewery with huge outdoor entertainment complex coming to Olive Road this winter Flagship beers at the new neighborhood brewpub include the Bikini Wheat, Boudreaux's Brown, the Coastal Cream Ale, Fred's Red, Stout of the South and the Super Sundrop. All are priced at $6, and all are brewery mainstays. But you don't have to go nose deep into the suds. Coastal County offers its own home-brewed seltzers, ciders and meads, and sells canned wines, wine on drafts and vino by the bottle. There will also be a rotation of guest tap occupants at any given time, featuring beers from all over Florida, the southeast region and even as far out as Mexico, said Thibodeaux, who believes his personal specialty is traditional German lager. \"Even if you're not a big craft beer person, we still have something that's going to taste good,\" he said. \"And it's going to contribute to this experience.\" Downtown's newest brewery arrives: The 5 Barrel brewery opens in downtown Pensacola on South Palafox That experience extends out to the massive two-acre outdoor complex, which Thibodeaux is in the process of buying from his mother, the former Shopper Magazine owner and the property's owner for decades in Pensacola. There are boatloads of outdoor games ready to be played right now at Coastal County, including beer pong, corn hole, disc golf, ring toss, horseshoes, washers and more. Upwards of 60 outdoor seats are available between the picnic tables and the individual seats set up around the fire pit and in the dog play area. Then there's the beer garden area, which Thibodeaux holds close to his heart and his stomach. \"We're growing all of our spices and our herbs for our beer dinners in the kitchen here,\" he said Thursday. \"So when we do a beer dinner it's true farm to table.\" The dog area is filled with little ramps and obstacles for furry friends to play and climb on. There's a waste cleanup station and plenty of seating where dog moms and dads can relax with their Coastal County brews as the pets get their play on. What you'll see outside if you visit soon is just the beginning, Thibodeaux said. Stage two of the outdoor complex is still to come, and will include a 2,000-square-foot covered patio, a 4,000-square foot AstroTurf beer garden, a 1,000-square-foot paver fountain area. \"So you'll get a nice ambiance and the noise of the water,\" Thibodeaux said about the future fountain. \"Again, it's all about adding to the experience.\" Brewery Executive Chef Shaun Golden has added to the experience by designing a menu after already having the beer menu in his hands. He based some of his culinary concoctions on potential beer pairings. Golden describes his food as \"pub food with a little bit of flare to it.\" \"We've got three different flavors of hummus we serve all at the same time, so you can have a selection,\" Golden said. \"We're going to break into a little bit of vegetarian food, a little bit of vegan food, so everybody's got a chance to have a little something. We'll go into lunches, we'll go into brunches, that way we'll pair breakfast and brunch style food with ciders, lighter beers and seltzers.\" To start, Coastal County will be open from 4-9 p.m. on Wednesdays and Thursdays, noon until 11 p.m. on Fridays and Saturdays and noon until 9 p.m. on Sundays. The brewery will be closed on Mondays and Tuesdays. Those hours may not last longer than about a week, though. Thibodeaux expects Coastal County to begin opening earlier for lunch soon after St. Patrick's Day . Jake Newby can be reached at jnewby@pnj.com or 850-435-8538. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://coastalcountybrewing.com/f/new-beginnings",
      "text": "New Beginnings 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://www.craftbeer.com/news/brewery-news/north-coast-brewing-company-announces-historic-leadership-changes",
      "text": "North Coast Brewing Company Announces Historic Leadership Changes Skip to content Tickets on Sale for the Great American Beer Festival! Get Tickets Menu Beer Beer What is Craft Beer? Beer Styles Seasonals Independent Craft Brewer Seal American Craft Beer Week ® Beer Shipped to You USPS Shipping Equity Act Breweries Breweries Find a Brewery What is a Craft Brewery? This is Indie Beer Beer Travel Support Your Local Brewery Recipes Stories Education Education Beer 101 Beer Schools Beer History Educational Tools Beer Glossary Beer & Food Course Homebrewing Tasting Tools Mentorship Program DEI Mini-Grants Search Search for: Search Beer and Breweries North Coast Brewing Company Announces Historic Leadership Changes By: North Coast Brewing Co | May 28, 2019 Share Post Link to Facebook Link to article FORT BRAGG, Calif., – For over 30 years, independent craft brewery, North Coast Brewing Company , has produced sustainably crafted, award-winning beers in Fort Bragg, CA under the leadership of Co-Founder and President, Mark Ruedrich. Today, North Coast Brewing enters a new chapter with the announcement of Ruedrich’s retirement, the appointment of current Chief Operating Officer, Sam Kraynek, to CEO and the promotion of Sheila Martins to vice president. Doug Moody maintains his role as the brewery’s senior vice president and national director of sales. Since co-founding North Coast Brewing in 1988, Ruedrich has continued to pioneer innovative, exceptional brewing and business practices. His unwavering passion for brewing classic beer in new and inspired ways has set a standard of excellence in the industry. Possessing an uncompromised commitment to craft, quality and a will to do things differently, Ruedrich built and grew North Coast Brewing with a devotion to the brewery’s employees, community and the planet. Ruedrich’s goal of making a positive impact on the world can be seen through the brewery’s numerous environmentally and socially responsible practices, such as its philanthropic effort to support marine mammal research and rescue, and its status as a Certified B Corporation. “Leading North Coast Brewing for the past 30 years has been one of the greatest joys of my life. The craft beer industry has changed so much over the years, and it’s gratifying to see our continued success as the company enters a new era,” says Ruedrich. “Since day one, we’ve been focused on brewing quality, sustainably crafted beer that is all about the people, the brewing process and the ingredients we use. North Coast Brewing has never strayed from the values and principles we established at the onset. I am confident that Sam Kraynek will lead North Coast Brewing to continued success that harkens back to the brewery’s founding.” Kraynek has been an integral member of North Coast Brewing since 2013, most recently serving as COO, and assumes the role of CEO effective immediately. His notable business acumen and dedication to North Coast Brewing’s mission make him the ideal leader to bring the brewery into its next chapter. With impressive leadership experience in the food industry, Kraynek previously served as president and general manager of Rosarita Mexican Foods, a $50 million division of Beatrice Foods, and CEO of Thanksgiving Coffee Company, a Certified B Corporation in Fort Bragg, CA. “I’m honored and humbled to be named North Coast Brewing’s CEO and carry on Mark’s incredible legacy,” says Kraynek. “The spirit and heart of North Coast Brewing will continue in our daily work, our creative approach to craft beer and our best practices in sustainability, which have been a part of our DNA since the beginning. We celebrate our company’s founding and look to the future as one of the most sustainable breweries in the country, if not the world.” Another significant leadership change for North Coast Brewing is the appointment of Sheila Martins to vice president. Martins has been an integral part of the brewery since 1995, most recently serving as assistant vice president. In her new role, Martins will continue to manage the bridge between North Coast Brewing’s sales and production while working closely with Kraynek. Ruedrich will maintain his position on North Coast Brewing Company’s board of directors and will serve as a consultant for the brewery. To learn more about North Coast Brewing, please visit: https://northcoastbrewing.com/ . About North Coast Brewing Company: North Coast Brewing Company is an independent craft brewery producing sustainably crafted beers in Fort Bragg, CA for over 30 years. Known for its award-winning lineup of high-quality beers available in 48 U.S. states and internationally, North Coast Brewing also releases barrel-aged ales and popular seasonal offerings, including a Berliner Weisse series. A pioneer and innovator in the craft brewing industry, North Coast Brewing is a Certified B Corporation – committed to making the world a better place, one pint at a time. For more information on North Coast Brewing’s beer roster and philanthropic mission, please visit: https://northcoastbrewing.com/ . Follow along with North Coast Brewing Company on Instagram @NorthCoastBrewingCompany , Twitter @NoCoastBrewCo and Facebook @NorthCoastBrewingCompany . Contact Information: Grady Britton pr@gradybritton.com 503.972.8826 North Coast Brewing Co Independent craft brewery producing exceptional, award-winning beers in Fort Bragg, CA. \n#northcoastbrewing Favorites Find Breweries Beer 101 Course Beer & Food Course Find Recipes Learn About Beer Styles Est. Blood Alcohol Content Calculator Stay in Touch Contact Us Media & Photos About Mission Brewers Association American Homebrewers Association Privacy Policy Terms of Service Cookie Settings Newsletter Signup Sign up and we will deliver our newsletter to your inbox highlighting our latest and greatest stories. Get Newsletter! Connect CraftBeer.com is written by beer lovers for beer lovers. When you’re here, you’re surrounded by people who care about breweries and independence. That’s why we proudly wear the seal – and you can too. Read More ©2025 Craftbeer.com | Privacy Policy | Accessibility Statement"
    },
    {
      "url": "https://coastalcountybrewing.com/about-us#:~:text=We are led by our Owner and Head Brewer, Fred Thibodeaux.",
      "text": "About Us 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs We are a Coastal Loving Community, making Tasty Brews for all Outdoor Adventure Lovers. Brewing Fun for the sun! About Us Our Story Born and raised in Pensacola, Fred Thibodeaux spent a lot of time at The Shopper: a local classified ads newspaper owned by his mother, Susan Thibodeaux.  After 44 years of being a staple publication of Pensacola, she decided to change the business and help him pursue his passion for brewing amazing craft beer.  As an avid fisherman and scuba diver, he wanted to bring his passions of brewing and the coastal scene together and offer a place for people to enjoy interesting food, craft beer, and a love of the outdoors. Meet the Brewer Working for corporate was never my thing.  So, after deciding to quit my job, my mom suggested to just do what you love.  At the time, I had a strong passion for fishing and home brewing.  I decided to apply to Ragtime Tavern in Jacksonville, FL as a server who could occasionally spend time with the “brew master.”  After a year of learning the basics, I was offered an assistant brewery position at the sister company, Gordon Biersch Brewpub, specializing in German Lager beer in Glendale, Arizona.  I spent a lot of time learning about brewing, hiking, mountain biking, and outdoor survival.  I then decided to push further into production brewing and began working for The Duck Rabbit Craft Brewery, which taught me about the finer points of brewing dark ale and barrel aging beers.  Then, I decided to move back to Florida to be near my family and the ocean.  I began working at Cigar City Brewing as a production brewer, where I quickly recognized the demand for great beer that focuses on the Florida lifestyle.  I was then hired at Wicked Barley Brewing to help them pursue their dream of running their own brewery, and it gave me the opportunity to teach other young brewers proper techniques for making great beer.  Seeing a small successful brewery open encouraged me to start my own brewery with my family in my hometown. A Destination Brewery We want Coastal County Brewing to be a community brewery for family, friends, and conversation: a local spot to relax, talk about beer, and spend time playing games or throwing disc golf with your dogs.  We have over two acres of space, with a beautiful patio and a large beer garden for great music and entertainment.  A friendly, knowledgeable staff will greet you with a smile, and make you feel at home.  And, plenty of Special Events will take you out of the ordinary and show you an incredible time.  There's always something to do at Coastal County while enjoying great beer, great food, and great people. Management Team We are operated by a close-knit group working together to make this the best local brewery for our community.  We constantly strive to surpass our own expectations, as well as our customers'.  Our General Management position belongs to Michaela Todd.  This all-star has had years of experience to prepare her for this venture.  She fearlessly faces any challenge laid before her to lead us into the future.  Our Chef and Kitchen Manager is Rudy Martinez.  His innovative ideas and recipes are transforming our kitchen into a streamlined purveyor of homestyle comfort foods.  Rebecca Hinson is our Brewery Ambassador and Marketing Manager.  She works diligently to keep everyone up to date on all things happening at the brewery, while striving to ensure that each event is a success.  We are led by our Owner and Head Brewer, Fred Thibodeaux.  He's quickly becoming the local favorite for his talent in brewing a different flavor for everyone's palate.  Stop in and say \"Hello\" to these Faces behind the Brews! Contact Michaela Get help booking a private party, set up your catering orders, or potentially finding a job by contacting our GM, Michaela Todd. email Contact Rebecca If your looking for more information about any of our upcoming special events, or you are a musician or vendor seeking a future appearance at the brewery, you'll want to talk to our Marketing & Events Manager, Rebecca Hinson. email Contact Fred Need to speak the owner directly?  Contact Fred Thibodeaux. email Sneak Peek... Check out what we have in store for you! These Smiling Faces speak for themselves.... Feel those CCBC Vibes! Take a peak at Where the Magic Happens... Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://coastalcountybrewing.com/f/new-flavors-for-a-new-day",
      "text": "New Flavors for a New Day 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://coastalcountybrewing.com/f/the-latest-and-greatest",
      "text": "The Latest and Greatest... 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs A brewery built with family, friends, and a passion for great beer Brewed for the Coastal Lifestyle We are a brewery with a love for the outdoors.  Our mission is to brew delicious and refreshing beer for enjoying with any activity from boating to beach fun.  Stop in and try any one of our Lagers, IPAs, and fruited Sours.  We are sure to have something interesting for everyone to enjoy. Locally Brewed Driven by Creativity Variety for All All of the brewery beers are made in house using premium ingredients and advanced brewing techniques.  Our farm to table restaurant serves hand selected produce, meats, and cheeses sourced from the best suppliers on the Gulf Coast. Variety for All Driven by Creativity Variety for All Plenty of options in our brewery including beer, Wine, Cider, Mead, Hard Seltzer, Hard Tea, Food, and Appetizers.  We have several gluten free options as well as small plate vegetarian meals on our enticing restaurant menu. Driven by Creativity Driven by Creativity Driven by Creativity We invite you to taste several of our treated beverages ranging from tropical fruit flavors to delicious pastry style beer as we combine elements from our restaurant and brewery. Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Coastal County Brewing Company 3041 East Olive Road, Pensacola, Florida 32514, United States Open today 03:00 pm – 10:00 pm Social Coastal County Blog Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    }
  ]
}