{
  "fuentes": [
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "email": "juan@coastalcounty.com"
    },
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "email": "michaela@coastalcounty.com"
    },
    {
      "url": "https://www.gulfcoastnewsnow.com/article/entertainment-coastal-dayz-brewing/64386701",
      "email": "jason.drew@hearst.com"
    },
    {
      "url": "https://coastaldayzbrewery.com/events/boot-scoot-duckie-country-night-coastal-dayz/",
      "email": "alext@coastaldayzbrewery.com"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/coastal-dayz-brewery/65159",
      "email": "sayhi@coastaldayzbrewery.com"
    },
    {
      "url": "http://www.supportfortmyers.org/listing/coastal-dayz-brewery/65159",
      "email": "sayhi@coastaldayzbrewery.com"
    },
    {
      "url": "https://www.news-press.com/story/life/food/2023/03/30/fort-myers-brewery-weekend-party-planned-to-celebrate-5-years/70055837007/",
      "email": "rhgeorge@gannett.com"
    }
  ],
  "mails": [
    "alext@coastaldayzbrewery.com",
    "jason.drew@hearst.com",
    "juan@coastalcounty.com",
    "michaela@coastalcounty.com",
    "rhgeorge@gannett.com",
    "sayhi@coastaldayzbrewery.com"
  ],
  "nombre_sitio": "coastaldayzbrewery.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://coastalcountybrewing.com/jobs",
      "text": "Jobs 3041 EAST OLIVE RD, PENSACOLA, FL 32514 \n850-741-2973 Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs More Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Home The Beer Garden About Us Beverages Food Shop Events Weekly Schedule Party Rentals Jobs Coastal County Brewing is Pensacola's first destination brewery/restaurant.  We are a family-owned and operated restaurant located at 3041 East Olive Rd between 9th Avenue and Dreamland Skate Park.  We are looking for staff members who want to grow with us. If you are a reliable, dependable, self-motivated, over-achiever we would love to have you join our team. Must be able to pass background check. Taproom Beertenders(esses) Job Summary: Facilitate visitor enjoyment by performing a variety of customer service. duties including, but not limited to, greeting and serving customers and co-workers, providing education about our products and other products we carry, stocking bar, serving drinks, and maintaining cleanliness and orderliness of bar facilities. Essential Job Duties and Responsibilities: (Additional duties may be assigned) • Represent Coastal County as a brand Ambassador! • Provide excellent customer service to visitors. i.e.) Greet and serve visitors in a positive and friendly way. Greet everyone who visits the Tap Room with hello and goodbye. Treat everyone like a regular. • Interact with visitors to develop and maintain a favorable public image. Answer questions and educate guests about Coastal County Brewing, our beers and other products, the differences between beer styles as well as the history and culture around us and craft beer in general. • Educate customers on how to sample beer. (Color, Clarity, carbonation, head retention, aroma, mouthfeel/body, flavors, finish) • Promote other items we offer for sale. • Promote Coastal County events and specials. • Complete all paperwork involved to day-to-day operations (inventory sheets, gift certificate sheets, keg order forms, incident reports etc.) • Compile daily receipts and other paperwork per GNB procedure for processing. • Maintain comfort & cleanliness throughout the Tap Room, Storage Areas, cooler, office, and restrooms. • Ensure the Tap Room, bar and bar area, counters, sinks, utensils, coolers, shelving and storage areas are clean and comply with established sanitation standards, personal hygiene, and health standards at all times. • Report all equipment problems, bar maintenance issues, violations or substandard practices to your supervisor immediately upon encountering a problem. • Attend staff meetings, events and other functions required. • Promote good public relations and handle complaints and concerns of guests. • Report any issues to our draft system or building immediately to Tap Room Manager. • Assist with inventory procedures. Alert Supervisor about shortages or discrepancies. • Minimize waste by ensuring all sales go through POS system properly and the Draft & Cask Systems are operating optimally at all times. • Collect payment for all sales Scroll down to download our employment application.  Drop it off in person or scan and email to: michaela@coastalcounty.com Kitchen Cooks We are searching for professional, energetic kitchen staff members to be a part of Pensacola's first destination brewery concept. Job duties will include: line cook/prep cook. Plating/expo. Dish/utility Responsibilities: Able to take direction and guidance from the executive chef. Efficiently set up and stock all stations for guest service. Being able to follow all kitchen recipes and guidelines to ensure a consistent, quality product for our guests. Maintaining a clean and organized workspace during peak business while adhering to all safety and sanitation practices. Store all food products properly (first in first out) and check all food vendors for accuracy and quality. Work as a team while to help provide a positive, professional work environment with your coworkers and guests. Requirements: Proven work experience. References will be checked. Ability to lift 50 pounds and to be on your feet for long periods of time. Being able to use various equipment and cooking methods for efficiency and accuracy. Self-motivated individuals with a strong work ethic. all your efforts will be greatly appreciated. Scroll down to download our employment application.  Drop it off in person or scan and email to: juan@coastalcounty.com . Think you have what it takes?   How would you answer these typical interview questions? How many years have you been in the service industry? Are you interested in cross-training? What skills do you hope to learn here? How is your beer knowledge and what is your favorite beer? What is your availability? What days can you not work? Any long trips coming up? download our employment application Download PDF Coastal County Brewing Company 3041 East Olive rd, pensacola, fl 32514 850-741-2973 Copyright © 2018 Coastal County Brewing Company - All Rights Reserved. Powered by Party Time? It's a brand-new year, with brand-new chances for a special occasion... and there's no better place to celebrate than CCBC!  Book your next event here with us and enjoy all the amenities we have to offer! Contact Us Today"
    },
    {
      "url": "https://www.gulfcoastnewsnow.com/article/entertainment-coastal-dayz-brewing/64386701",
      "text": "Coastal Dayz Brewing Co. celebrates 7 years on Good Morning Gulf Coast Skip to content NOWCAST Gulf Coast News at 11 on NBC Watch on Demand Menu Search News Policies News Local News National News Gulf Coast Investigations Stories to Share Positively Gulf Coast Gulfcoasting Health Politics Entertainment Mr. Food Newslinks Traffic Upload Weather Weather Cams Weather Blog Hurricanes Hurricane Week Forecasting Our Future Sports High School Sports Cover Stories Live Streams Gulf Coast News on NBC Gulf Coast News on ABC About Us News Team Contact Very Local Jobs at Gulf Coast Internships Privacy Notice Terms of Use SUBSCRIBE TO EMAIL Weather Search Press enter to search Type to Search Search location by ZIP code ZIP Advertisement Coastal Dayz Brewing Co. celebrates 7 years on Good Morning Gulf Coast Coastal Dayz Brewing Co. celebrates 7 years on Good Morning Gulf Coast >> FRIENDS OF THE SHOW FOR A VERY LONG TIME. AND JASON'S GIVING US A PREVIEW OF THEIR WEEKEND HI, JASON. JEN. HEY, GREG. HAPPY FRIDAY. WE'RE HERE IN THE COASTAL DAYZ BREWING COMPANY. I CAN'T BELIEVE IT. THEY'RE CELEBRATING 7 YEARS IN BUSINESS RIGHT HERE. DOWNTOWN FORT MYERS, ALONG MCGREGOR BOULEVARD RIGHT ACROSS FROM PUBLIX. YOU CAN'T MISS HIM. >> AND THEY'VE GOT A WHOLE WEEKEND PLANNED FOR ALEX, GOOD MORNING. THANKS SO MUCH FOR BEING ON GULF COAST. THANKS COMING OUT OF BOUNDS. A LOVELY YOU GUYS HAVE BEEN WHAT YOU'VE BEEN ON THE SHOW. MORE THAN A HALF AND YOU'VE BEEN HERE 7 YEARS AND THIS LOCATION SERVING UP ALL THE GOOD STUFF AND YOU'RE DOING IT AGAIN THIS WEEKEND. THIS WEEKEND WILL BE OPEN SATURDAY AND SUNDAY, STARTING AT 11 O'CLOCK. >> WE HAVE A BIG PARTY ON THE PARKING LOT. WE'RE GOING TO HAVE LIVE MUSIC, 12 NEW BEERS TO TRUCKS WILL BE RELEASING A BRAND-NEW. HE'S GOT A PAIR AS WELL. STARTING TONIGHT, SAVING IT A VERY DELICIOUS IS FRUITY JUICY. GOTTEN SOME LITTLE BIT OF AN OR ORANGE SUCH EASY DRINKING BEER. SOUNDS LIKE BREAKFAST BEER. THE IT IS IT IS. >> SO WHAT ARE IN THIS IN THIS PAST COUPLE OF YEARS? HOW HAVE YOU SEEN EVERYTHING, YOU KNOW, CHANGE GROW? >> IT'S A OBVIOUSLY WE'VE GOT A LOT OF REGULARS AND ON THE COMMUNITY AROUND HERE IS REALLY SUPPORTED US THAT I'VE BEEN ABLE TO OPEN FOR 7 YEARS. SO BUSINESSES, PEOPLE ARE SAYING COMMUNITY AND, YOU KNOW, WE'RE GOING TO KEEP GOING. WE GOT LOT OF PEOPLE COMING IN. YOU GOT NEW BREWERIES OPEN UP AROUND US AND WE'RE JUST GOING TO BUILD THAT COMMUNITY AND >> CONCORD, THAT FAMILY BY THAT SAUCE. AND YEAH, YOU DO HAVE A NICE COMMUNITY. I KNOW THAT I FOUND OUT YESTERDAY THAT YOU WERE AT ANOTHER PLACE AND YOU GUYS WERE ALL HELPING EACH OTHER OUT AND SUPPORTING. THAT'S THAT'S THAT'S NICE. IT'S HARD FOR HIM BY. THAT'S WHAT MAKES THE SOUTHWEST COMMUNITY GREAT. YEAH. WELL, YOU'VE GOT SOME MUSIC TOMORROW AND SUNDAY. YES, TOMORROW AND SUNDAY ON THE MAIN SATURDAY. WE HAVE US ALL TO COME IN ON A NIGHT, BUT THE MUSIC ALL DAY AND THEN SUNDAY. >> WE HAVE 2 MORE MUSICIANS COMING OUT. ALSO IN THE FOOD BE SERVING UP SOME FOOD TRUCKS BOTH DAYS. SO COME HUNGRY, COME THURSDAY. ONE OF THE PARTY ARE I HATE THE PARTY STARTS AGAIN. 11 O'CLOCK TOMORROW. 11 O'CLOCK SUNDAY MORNING. THEY START POURING OUT. THE SIDES AND GET THE MUSIC GOING AND THEIR FOOD COOKED IN AND EVERYTHING OUT. SO 7 YEARS IN BUSINESS. THAT'S GREAT. YOU KNOW, IT'S WORTH COMING DOWN HERE. PLUS, YOU'VE GOT A PINT GLASSES AND T-SHIRTS AND YOU CAN GET >> I SAW THESE DOLLAR OFFS, YOU KNOW, LITTLE LITTLE LITTLE HANDY DANDIES AND YOUR FLIGHTS. YOU'VE GOT EVERYTHING. A LOOK AT ALL THE BEER. JOSH, IF YOU CAN PAN UP TO THE WALL THERE, THAT'S THAT'S THE BEER MENU. THERE. >> AND THE HAZY IPA IS THAT WE'RE GOING ORDER. HERE ARE GOVERNOR, CAROL, THAT YEAH. >> AND THIS IS COMING AFTER A JOB THAT YOU GET THIS. IT IS OUR HAZY THE WAY. JUST KICK THE CAN. >> I'LL TELL YOU, NO NUMBER. THIS IS SCRIPTED. DON'T DON'T WORRY. THERE'S 11 MORE. THERE'S 11 MORE. ALRIGHT? ALRIGHT. WELL, YOU KNOW, BUT HEY, TEARS AS CHEERS ACTUALLY, HERE'S THE POOR LITTLE EARLIER. THAT'S FINE. BUT YES, CHEERS TO YOU GUYS. COASTAL DAYZ BREWING COMPANY. 7 YEARS IN BUSINESS. AND YES, THERE WILL BE MORE BEER POURING WEEKEND LONG. YOU WANT ME TO HELP YOU CHANGE THAT TAP? OH, YEAH. JEN GREG. THE PLACE TO BE WHAT'S THE WEBSITE SO PEOPLE CAN CHECK IT OUT. COASTAL DAYZ BREWERY DOT COM AND THEN ALL OF A FACEBOOK. WE HAVE ALL THE INFORMATION AS WELL. AND OF COURSE, DON'T FORGET KONA. THE BREWERY KITTEN WE SITTING DOWN HERE RIGHT NOW. DON'T WORRY SHE'S ON THE FLOOR HERE ANYWAY. THE PARTY STARTS TOMORROW. WHILE THE PARTY STARTS. WHENEVER YOU WANT TO GET HERE, COASTAL DAYZ BREWING COMPANY, MCGREGOR DOWNTOWN FORT MYERS, HAPPY ANNIVERSARY. AND THANK YOU FOR YOUR CONTINUED TO CHESS. I APPRECIATE THANKS TO COME OUT, JEN GRAGG, I GOTTA GO CHANGE A KEG THAT TO THE TOUGH JOB. BUT SOMEBODY HAS TO DO AGAIN. >> ALL RIGHT. IT IS TURNING 78 YEARS OLD THIS WEEKEND CALLS TODAY'S BREWING IS CELEBRATING WITH A BIG VERSARY PARTY. YOU CAN JOIN IN THE FUN THIS Updated: 12:31 PM EDT Apr 4, 2025 Editorial Standards ⓘ Jason Drew Reporter Advertisement Coastal Dayz Brewing Co. celebrates 7 years on Good Morning Gulf Coast Updated: 12:31 PM EDT Apr 4, 2025 Editorial Standards ⓘ Jason Drew Reporter Coastal Dayz Brewery is gearing up for a weekend of food, fun, music, and of course the beer as they celebrate seven years of success.With a passion for beer and wanting to create a local place to visit with old friendz, meet new friendz and hang with fur-friendz, Coastal Dayz Brewery was created in April 2018. The Bethune family, hailing from Colorado, fell in love with the Fort Myers area and started their craft beer journey in a small corner building on McGregor. With Gary’s passion for beer, Lisa’s mind for business, Alana’s marketing talent, and, of course, little Ruby’s guidance (The Bethune’s miniature Aussie), Coastal Dayz Brewery became exactly what they hoped for.Within a year, the brewery was growing more than expected, and Gary needed someone to assist with brewing. Little did everyone know that the young man hired would become the future of the brewery! Alex Tatko came into the brewery as an assistant brewer in 2019 with a love of craft beer after graduating law school and discovering his passion is in the craft beer industry. With a homebrew contest win under his belt and lots of accolades, he immediately proved he was a hard-working young man and became an invaluable asset to the brewery.\" Coastal Dayz Brewery.\"Good Morning Gulf Coast's\" Jason Drew went Gulfcoasting to toast their success as they get ready for a weekend of celebrations. Owner Alex Tatko gave us a sneak peek at what they have planned for the anniversary weekend. Food trucks, live music, and they're unveiling a new \"Hazy Dayz\" beer to toast the occasion.\"Coastal Dayz Brewery is a brewery located in Downtown Fort Myers, Florida. Some say it’s the happiest brewery in the world, but we want you to check out the chill vibes for yourself.\" Coastal Dayz Brewery.Check out their website for more information at Coastal Dayz Brewery | Brewery in Fort Myers, Florida WATCH THE FULL STORY ABOVEDOWNLOAD the free Gulf Coast News app for your latest news and alerts on breaking news, weather, sports, entertainment, and more. FORT MYERS, Fla. — Coastal Dayz Brewery is gearing up for a weekend of food, fun, music, and of course the beer as they celebrate seven years of success. With a passion for beer and wanting to create a local place to visit with old friendz, meet new friendz and hang with fur-friendz, Coastal Dayz Brewery was created in April 2018. The Bethune family, hailing from Colorado, fell in love with the Fort Myers area and started their craft beer journey in a small corner building on McGregor. With Gary’s passion for beer, Lisa’s mind for business, Alana’s marketing talent, and, of course, little Ruby’s guidance (The Bethune’s miniature Aussie), Coastal Dayz Brewery became exactly what they hoped for. Latest Forecast ° F FEELS LIKE No weather data available HOURLY DAILY RADAR TRAFFIC Advertisement Within a year, the brewery was growing more than expected, and Gary needed someone to assist with brewing. Little did everyone know that the young man hired would become the future of the brewery! Alex Tatko came into the brewery as an assistant brewer in 2019 with a love of craft beer after graduating law school and discovering his passion is in the craft beer industry. With a homebrew contest win under his belt and lots of accolades, he immediately proved he was a hard-working young man and became an invaluable asset to the brewery.\" Coastal Dayz Brewery. \"Good Morning Gulf Coast's\" Jason Drew went Gulfcoasting to toast their success as they get ready for a weekend of celebrations. Owner Alex Tatko gave us a sneak peek at what they have planned for the anniversary weekend. Food trucks, live music, and they're unveiling a new \"Hazy Dayz\" beer to toast the occasion. \"Coastal Dayz Brewery is a brewery located in Downtown Fort Myers, Florida. Some say it’s the happiest brewery in the world, but we want you to check out the chill vibes for yourself.\" Coastal Dayz Brewery. Check out their website for more information at Coastal Dayz Brewery | Brewery in Fort Myers, Florida WATCH THE FULL STORY ABOVE DOWNLOAD the free Gulf Coast News app for your latest news and alerts on breaking news, weather, sports, entertainment, and more. Share Copy Link Copy {copyShortcut} to copy Top Picks President Trump spotlights crime in US cities: Here's what the data shows There's a section at Walmart that offers you savings every single day Nearly half of people with diabetes don't know they have it, new study finds Olympian AJ Hurt hits high note training for 2026 Winter Olympics Advertisement Latest Forecast ° F FEELS LIKE No weather data available HOURLY DAILY RADAR TRAFFIC Advertisement Loading more articles... Gulf Coast News Fort Myers Contact Us About WZVN-TV News Team Apps & Social Email Alerts Careers Internships Advertise with Gulf Coast Digital Advertising Terms & Conditions Broadcast Terms & Conditions News Policy Statements EEO Reports Captioning Contacts WBBH Public Inspection File Public File Assistance FCC Applications Licensing Hearst Television participates in various affiliate marketing programs, which means we may get paid commissions on editorially chosen products purchased through our links to retailer sites. ©2025, Hearst Television Inc. on behalf of WBBH-TV. Privacy Notice DAA Industry Opt Out Terms of Use Site Map Your Privacy Choices/(Opt-Out of Sale/Targeted Ads)"
    },
    {
      "url": "https://coastaldayzbrewery.com/events/boot-scoot-duckie-country-night-coastal-dayz/",
      "text": "Boot, Scoot, & Duckie – Country Night @ Coastal Dayz! | Coastal Dayz Brewery (239) 204-9665 Downtown Fort Myers Pet Friendly Hours Our Brewz About Location Food & Events News Contact (239) 204-9665 Downtown Fort Myers Pet Friendly Our Brewz About Hours Location Food & Events News Contact Boot, Scoot, & Duckie – Country Night @ Coastal Dayz! published August 30, 2024 08/30/2024 7:00pm - 10:00pm Location Coastal Dayz Brewery Y’all ready for a boot-stompin’, hat-tippin’, good time? It’z time to dust off those cowboy boots and head on down to Coastal Dayz Brewery! No Duckin’ Around! You don’t have to be a 0||||0 owner to participate in this duck-tastic event! We will be offering duck floaters on all our drinks, and we even concocted a special duck themed cocktail. That’s right, you’ll be able to get a rubber duck to add to your collection, so bring in your ducks and trade with your fellow jeep friendz Drinks: From an exclusive country-themed brew to a specialty cocktail, duck floaters and more Live Music: Caloosa River Band will be providing all the country fun for you to two-step to from 7-10pm! Food Truck : King’s Taco’s & Burritos will be on site serving from 6-9:30pm! Hatitude & Co Mobile Hat Bar Come design your very own hat and take it home the very same night! Brewery Hours Monday-Thursday 2:30pm-9pm Friday: 12:30pm-10pm Saturday 12:00pm-10pm Sunday:  11am-8pm Parking Info Get Directions Featured Brew Tap #07 Pirate’s Porter $7 16oz / 6.2% ABV A robust, dark beer with a light, foamy head. This is the true adult milk shake of beers! A higher ABV than the normal porter recipe gives it a bit of a kick but a malty mouth feel and flavor. It’s best flavor potential is met slightly warmer than when first poured, so let her sit a bit. Newsletter Sign Up! Tap news, events & more... Your Email Address * Name This field is for validation purposes and should be left unchanged. Coastal Dayz Brewery is a brewery located in Downtown Fort Myers, Florida. Some say it’s the happiest brewery in the world, but we want you to check out the chill vibes for yourself. Downtown Fort Myers 2161 McGregor Boulevard Fort Myers, FL 33901 (239) 204-9665 Directions / Parking Info ©2025 Coastal Dayz Brewery, All rights reserved. | Website Credit"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/coastal-dayz-brewery/65159",
      "text": "Coastal Dayz Brewery | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 77° Now 77° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Share Share Visit Website Coastal Dayz Brewery With 16 tapz, we’ve got our staples like Bimini Blonde and Pirate's Porter, and regularly feature a few specialty and guest tapz also. Inside the brewery, you’ll find friendly faces and a chill atmosphere while you enjoy one of our beer flights. Outside, you can relax under an umbrella on the patio and watch the world go by as you and your favorite people (and pets) spend the day or night in our... Load More With 16 tapz, we’ve got our staples like Bimini Blonde and Pirate's Porter, and regularly feature a few specialty and guest tapz also. Inside the brewery, you’ll find friendly faces and a chill atmosphere while you enjoy one of our beer flights. Outside, you can relax under an umbrella on the patio and watch the world go by as you and your favorite people (and pets) spend the day or night in our downtown paradise. We regularly have food vendors serving inside the brewery and you can also bring your own food in or have some delivered. Load Less 26.637322, -81.876433 239-204-9665 2161 McGregor Boulevard Fort Myers , FL 33919 United States sayhi@coastaldayzbrewery.com View Website Key Features Things to Do Arts & Entertainment Nightlife Attractions Breweries & Distilleries Gallery 26.637322, -81.876433 239-204-9665 2161 McGregor Boulevard Fort Myers , FL 33919 United States sayhi@coastaldayzbrewery.com View Website Key Features Things to Do Arts & Entertainment Nightlife Attractions Breweries & Distilleries What's Nearby City of Palms Park and Minor League Five-Plex City of Palms Park includes 6990 seats in the main seating area of the stadium, former location of Boston Red Sox Spring... Sidney & Berne Davis Art Center Florida Arts, Inc. nurtures innovation and excellence in the visual and performing arts via exhibitions, performances... Ford's Garage Fort Myers Casual American chow & 180+ craft beers served in vibrant, warm-hued digs with brick & wood decor. Our original location... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    },
    {
      "url": "http://www.supportfortmyers.org/listing/coastal-dayz-brewery/65159",
      "text": "Coastal Dayz Brewery | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Share Share Visit Website Coastal Dayz Brewery With 16 tapz, we’ve got our staples like Bimini Blonde and Pirate's Porter, and regularly feature a few specialty and guest tapz also. Inside the brewery, you’ll find friendly faces and a chill atmosphere while you enjoy one of our beer flights. Outside, you can relax under an umbrella on the patio and watch the world go by as you and your favorite people (and pets) spend the day or night in our... Load More With 16 tapz, we’ve got our staples like Bimini Blonde and Pirate's Porter, and regularly feature a few specialty and guest tapz also. Inside the brewery, you’ll find friendly faces and a chill atmosphere while you enjoy one of our beer flights. Outside, you can relax under an umbrella on the patio and watch the world go by as you and your favorite people (and pets) spend the day or night in our downtown paradise. We regularly have food vendors serving inside the brewery and you can also bring your own food in or have some delivered. Load Less 26.637322, -81.876433 239-204-9665 2161 McGregor Boulevard Fort Myers , FL 33919 United States sayhi@coastaldayzbrewery.com View Website Key Features Things to Do Arts & Entertainment Nightlife Attractions Breweries & Distilleries Gallery 26.637322, -81.876433 239-204-9665 2161 McGregor Boulevard Fort Myers , FL 33919 United States sayhi@coastaldayzbrewery.com View Website Key Features Things to Do Arts & Entertainment Nightlife Attractions Breweries & Distilleries What's Nearby Lee County Visitor & Convention Bureau The Lee County Visitor & Convention Bureau (VCB) is devoted to maintaining and building year-round tourism in Lee County... McGregor Cottage Discover Fort Myers' historic charm at the McGregor Cottage, built in 1925 and just minutes from the Edison Ford Winter... The Veranda The Veranda's romantic setting in two turn-of-the-century homes combined with their Southern regional cuisine, an... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    },
    {
      "url": "https://www.news-press.com/story/life/food/2023/03/30/fort-myers-brewery-weekend-party-planned-to-celebrate-5-years/70055837007/",
      "text": "Fort Myers brewery weekend party planned to celebrate 5 years News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals FOOD New brewery owner in Fort Myers has plenty to celebrate, with weekend party planned Coastal Dayz Brewery's new owner Alex Tatko was on his way to becoming a lawyer when his plans changed to the delight of local craft beer drinkers Robyn George Fort Myers News-Press Alex Tatko was well on his way to becoming a lawyer. Instead, he’s entering his sixth month as the owner of Coastal Dayz Brewery near downtown Fort Myers. “I was waiting on test results from the Florida Bar exam when I took a job as a bartender at Bury Me Brewing,” said Tatko, who attended the Ave Maria School of Law . “I had started keg washing and was about to learn how to brew beer when I got word Bury Me was closing.” That was in September 2019. Tatko, a homebrewer who had won awards in competitions in Washington and Orlando, then took a job at Coastal Dayz, working for Gary and Lisa Bethune who opened the brewery in April 2018. “It was a crash course on how to do stuff,” Tatko said. “Week by week I started taking on more responsibilities.” Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. The brewery expanded into double batching when he got there. “Gary and I were learning it together,” said Tatko, who was brewing by himself six months later. Restaurant news: Sanibel's new Mexican restaurant has history on its side The trio eventually began joking about Tatko one day taking over the brewery. The hints became more serious “over eight or nine months” before talks became serious. Then Hurricane Ian hit. “I had planned to take over before that,” said Tatko, who was staying with the Bethunes during and right after the storm. “It took us a couple of days to get here to see if there was any damage. I saw it was OK and two days later signed the papers. “The beer was still fine and I opened without power, working with just flashlights. I was telling people to go home because of the curfew.” Since Tatko had been the head brewer for three-plus years, the transition has been smooth as far as that goes. His biggest challenge has been the day-to-day business side. “I had been working in the back of the house and needed to learn the front, which was what Lisa did,” he said. Tatko is quick to credit assistants Caleb Jensen and Naomi Johnson with helping him the past several months. “They’ve really been my right and left hand,” Tatko said. “They’ve been my core.” Since taking over, there have been a few changes. The 10 taps and four guest taps are now 16 taps. The seltzer is his own as opposed to having a guest one. His core beers remain the same with the most popular being Seaz The Day — a hazy IPA that outsells all others two to one. “Wannabe, the blonde, is second,” said Tatko. With a three-barrel hot side and seven-barrel cold side, Tatko said he sells as much beer as he produces. “I expanded the patio when I got here,” he said. “We are in this spot for another four years. Our distributor wants us to go to Naples but we just don’t have the ability for that now. Cooler space is our biggest issue. We need to walk before we can run.” Dining scene: Downtown Cape Coral is about to get a new restaurant: 5 things to know In the meantime, Tatko and company are gearing up for the brewery’s two-day fifth-anniversary party on April 1-2. There will be beer releases (12 timed ones on Saturday alone), food vendors, live music (Bill Beck Music, Nostaljah Band, Claire Liparulo) axe throwing, DJ, sip & shop, a beer for a year giveaway and more. Can’t make it? Pet-friendly Coastal Dayz offers plenty on any given day, including live music bingo on Sundays, special release small batch Tuesdays and trivia on Wednesdays. A food vendor is usually on site 5-8 p.m. Tuesdays to Fridays and 2-6 p.m. Saturdays and Sundays. Stay up-to-date at coastaldayzbrewery.com or through Instagram and Facebook . Oh, and the Florida Bar exam results Tatko was waiting on? “I failed,” he said with a smile on his face. Coastal Dayz Brewery, 2161 McGregor Blvd. in Fort Myers, is open 3-9 p.m. Monday to Thursday; 1-10 p.m. Friday and Saturday; and 1-7 p.m. Sunday. Call (239) 204-9665 or go to coastaldayzbrewery.com for more information. Robyn George is a community content editor and food writer for The Fort Myers News-Press. Send scoops and news to rhgeorge@gannett.com . Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    }
  ]
}