{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.lakelandgov.net/departments/lakeland-police-department/lpd-police-citizen-advisory-board/",
      "email": "adaspecialist@lakelandgov.net"
    },
    {
      "url": "https://www.lakelandgov.net/departments/lakeland-police-department/lpd-police-citizen-advisory-board/",
      "email": "carol.ratcliff@lakelandgov.net"
    },
    {
      "url": "https://www.lakelandgov.net/departments/lakeland-police-department/lpd-police-citizen-advisory-board/",
      "email": "robin.tillett@lakelandgov.net"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "alicia@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "carolina@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "chloe@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jaynee@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jessica@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "tracey@visitfingerlakes.com"
    }
  ],
  "mails": [
    "adaspecialist@lakelandgov.net",
    "alicia@visitfingerlakes.com",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "carol.ratcliff@lakelandgov.net",
    "carolina@visitfingerlakes.com",
    "chloe@visitfingerlakes.com",
    "info.nairobi@skanem.com",
    "info@scibpaints.com",
    "jane@skanem.ke",
    "jaynee@visitfingerlakes.com",
    "jessica@visitfingerlakes.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "robin.tillett@lakelandgov.net",
    "sachen.gudka@skanem.com",
    "sales@finewineliquors.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "tracey@visitfingerlakes.com"
  ],
  "nombre_sitio": "cobandpenlakeland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.lakelandgov.net/departments/lakeland-police-department/lpd-police-citizen-advisory-board/",
      "text": "LPD Police Citizen Advisory Board | City of Lakeland Lakeland Police Department About Us We Will Never Forget Lakeland Police Fallen Heroes Memorial Table of Organization Administrative Bureau Neighborhood Services Investigative Services Special Services How Do I? Media Relations Video Library Social Media Policy Join Our Team High School Police Academy Explorer's Program Trades Summer Academy Trades Academy Application Lakeland PAL Locations Lakeland PAL Staff Board of Directors Lakeland PAL Programs Lakeland PAL Registration PAL Volunteer Opportunities Sponsors PAL Community Service Hours PAL ARCHERY TOURNAMENT Refuse To Lose Gang Task Force Common Gang Identifiers Signs Associated with Joining A Gang LPD Police Citizen Advisory Board Submit A Tip Contact Us City of Lakeland City of Lakeland Government Departments Community Businesses Fun Search Lakelandgov.net Search the site Government Departments Community Businesses Fun Home Departments Lakeland Police Department LPD Police Citizen Advisory Board LPD Police Citizen Advisory Board LakelandPD Contact LakelandPD Contact 863.834.6900 219 N Massachusetts Avenue Lakeland, FL  33801 × main content The Lakeland Police Citizen Advisory Board was formed in June of 2020, made up of nine citizens from across the Lakeland community. Each member of the Lakeland City Commission, City Manager, and Police Chief Ruben Garcia selected a representative to serve a term on the board. The LPCAB board is focused on discussing new agency programs, past police/citizen interactions, and providing insight on community needs to LPD staff. The goal of the board is to have an open dialogue with members of the Lakeland Police Department, allowing for continued development to enhance quality of life for our citizens and those visiting our beautiful city. Citizen Advisory Board By-Laws Contact: Carol Ratcliff Phone: 863.834.6907 carol.ratcliff@lakelandgov.net MEMBERS Dr. Shandale Terrell Chairman of the Lakeland Police Advisory Board Dr. Shandale Terrell, commonly known as Dale Terrell was born and raised in Lakeland, Florida and a graduated from Lakeland Senior High School. Dr. Terrell is an Educator for K-12 Polk County Public Schools. Dr. Terrell daily obligations are: educating special need students, analyzing academic, assessment data and mentoring students. He earned a Bachelor of Science Degree, majoring in Education from Florida A&M University; a Master of Science Degree in Education Leadership from Nova Southeastern University; and a Doctoral Degree in Education with a concentration in Higher Education Leadership and a minor in Urban Education from Nova Southeastern University. Dr. Terrell served as a Committee Member for the City of Lakeland (COL) Citizens Advisory Committee, the Citizens Advisory Budget Committee, and the Gang Task Force Committee. He served on the Board of Directors for the Lakeland Police Athletic League (PAL) Youth Leadership Program. Elena Giarratano Elena Giarrantano is an Employment Specialist with the AARP Senior Community Service Employment Program. Born and raised in Westchester County, NY, she is consistently involved with community programs such as the Combee Area Revitalization Effort, Combee Emergency Responders Team, the Lakeland Community Theatre Senior Troupe, and Guardian Ad Litem (10th Circuit). Carol Philipson Susan Ripley Susan Ripley has lived in Lakeland since 1978 when her family moved to Florida. She has been married 31 years to someone she met in high school and they have two grown children. As a youth, she was a Lakeland Police Explorer for four years. She has worked in child welfare for 30 years, currently as the Director of Foster Home Licensing for Heartland for Children who manages the child welfare system in Polk, Hardee, and Highlands counties. She also has her own private business doing private adoption related services (Southeastern Adoption Services), and currently serves on the LPD Advisory Board & Polk School Board Advisory Council. Veronica Roundtree Veronica Roundtree is a retired educator and healthcare worker with over 30 years of service, and previously served as a freelance writer for the Ledger and the New York Times. Though a Florida native, she is also an a vid traveller who has traveled to over 30 countries. Veronica holds degrees in Early Childhood Education and Management, Human Services, as well as a Masters Degree in HR Management. Veronica serves her community in various capacities, including on the Lakeland Electric Advisory Committee; as the chair of Summerwerx for youth employment; as the NAC Scholarship Chair; vice chair on the Habitat Board; the chair for Code Enforcement and as the president of the Valencia-Pinehurst Neighborhood Association. She a lso serves as the President of Basic Life Support, a 501(c)(3) non-profit organization. Dr. Sallie Stone Dr. Sallie Stone is a consummate professional with over twenty years of experience in educational leadership and management. She is the founder of Compass Smart Solutions educational consulting providing training, professional development, business coaching and motivational speaking for diverse groups around customized themes. As the owner of Well-done Events! multi-media services Dr. Stone has established a solid reputation for helping businesses and organizations promote their message through digital marketing and branding strategies. Dr. Stone is an experienced educator and administrator with 20 plus years of experience across academic levels to include elementary, secondary, adult, and higher-ed. She has extensive experience in working with charter schools in Florida and one highlight of her career includes being the founding Principal of a local collegiate charter high school. She has served as an adjunct professor/site supervisor with Grand Canyon University working with teachers in their clinical courses and principals in their internship courses. She currently serves as a substitute mentor for Kelly Educational Staffing providing support, professional development and evaluation processes for substitutes working in the Polk County School District. Dr. Stone is married with one daughter and loves spending time with family, taking care of her eighty-two-year-old mother, who is her inspiration. She seeks opportunities to partner with those who are passionate about changing the culture of communities to create a better place to live and work for all. Mathew Vancol Mathew Vancol is an IT and Marketing professional based out of Lakeland. He is the oldest of four children with two loving parents and his favorite girl in the world, his dog Nala. Mathew moved to Lakeland in 2006 and been in love with the city since then. His passion is people and people are his passion. Mathew loves to serve and has been that way since he was a kid. Being asked to be a part of the Lakeland Police Advisory Board, he was taken aback that he out of all people was asked to be part of the board. His journey to serving his community and his fellow law enforcement officers has made his purpose much more meaningful. Tom Williams Tom Williams grew up in Atlanta, GA and is the owner of Harvest Logistics, LLC. He holds a Forestry degree from Auburn University. With over 25 years of forestry experience, Tom has provided consulting services for private landowners and timber companies in Florida, Texas, Hawaii, and Belize. A frequent speaker at forestry conferences, Tom has made presentations internationally at conferences in Sweden and South France. A Lakeland resident of Lake Morton Historic District since the mid 90’s, Tom and his wife attend Strong Tower Church in the Parker Street area. Stephen Young Stephen Young is a representative of Downtown, Dixieland, Lake Morton, and Hollingsworth districts. He has a Bachelor’s degree in Criminology from the University of Florida, which he received after serving in the Marine Corps for eight years. He is a franchisee of three local 7-Eleven convenience stores. Stephen also owns multiple rental properties around the downtown area of Lakeland. He has been on the SAC committee at Scott Lake Elementary and currently sits on the Board of Directors at South Lakeland Baseball. Stephen has been a resident of Lakeland for 15 years and 3 out of 4 of his kids were born at Lakeland Regional. He is here to help bring the community together with the Lakeland Police Department in a variety of ways. LPD Police Citizen Advisory Board LakelandPD Contact LakelandPD Contact 863.834.6900 219 N Massachusetts Avenue Lakeland, FL  33801 × About Us We Will Never Forget Lakeland Police Fallen Heroes Memorial Table of Organization Administrative Bureau Neighborhood Services Investigative Services Special Services How Do I? Media Relations Video Library Social Media Policy Join Our Team High School Police Academy Explorer's Program Trades Summer Academy Trades Academy Application Lakeland PAL Locations Lakeland PAL Staff Board of Directors Lakeland PAL Programs Lakeland PAL Registration PAL Volunteer Opportunities Sponsors PAL Community Service Hours PAL ARCHERY TOURNAMENT Refuse To Lose Gang Task Force Common Gang Identifiers Signs Associated with Joining A Gang LPD Police Citizen Advisory Board Submit A Tip Contact Us swan STATS take ACTION record REQUESTS annual BUDGET watch LIVE | on DEMAND iMS get CONNECTED maps | geo DATA 228 S. Massachusetts Ave. | Lakeland, Florida 33801 | 863.834.6000 | Hours & Closing | Accessibility | Important Numbers | Site Map © 2025 City of Lakeland The City of Lakeland is committed to facilitating the accessibility and usability of its Website, lakelandgov.net, for all people with disabilities. If you use assistive technology (such as a Braille reader, a screen reader, or TTY) and the format of any material on this website interferes with your ability to access information, please contact us. If you do encounter an accessibility issue, please be sure to specify the Web page in your email, and we will make all reasonable efforts to make the page accessible for you. Users who need accessibility assistance can also contact our ADA Specialist at 863.834.8444 or ADASpecialist@lakelandgov.net . Our Website will be reviewed and tested on an ongoing basis, utilizing assistive technologies by users who have knowledge of and depend on the performance of these technologies."
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "text": "Visit Finger Lakes Staff & Board of Directors | Meet the Team Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content MENU SEARCH View Maps Maps View Guides Guides Join Our Newsletter Subscribe View Maps Maps View Guides Guides Join Our Newsletter Subscribe Things To Do FLXperience Passes On The Lakes Finger Lakes Beaches & Swimming Finger Lakes Kayaking & Paddleboarding Boat Rentals & Boat Tours Marinas & Boat Launches Fishing Roseland Waterpark & Wake Park Outdoors Trail Maps Hiking Biking Parks & Playgrounds Aerial Adventures & Zip Line Tours Skiing & Snowboarding Golf Bristol Mountain Roseland Waterpark & Wake Park Aerial Adventures & Zipline Tours Skiing & Snowboarding Spas & Wellness Yoga, Gyms & Fitness Centers FLX Well-Being Passport Shopping Locally Made Antiques Eastview Mall Gifts And Souvenirs Farmers Markets Downtowns & Districts Arts & Entertainment Nightlife Theater Art Galleries & Exhibits Movie Theaters Finger Lakes Gaming & Racetrack Hands On and Educational Classes Farms & Markets Farm Tours & Events Farmers Markets & U-Pick Farms Museums & History Museums & Landmarks Women's Rights Sonnenberg Gardens & Mansion Historic Park Ganondagan State Historic Site & Seneca Art & Culture Center Path Through History Scenic Drives & Vistas Top 9 Photography Locations Top 9 \"Leaf Changing\" Experiences Gardens Day Trips Corning And Southern Tier Niagara Falls And Buffalo Ithaca And Aurora Rochester And The Erie Canal Things To Do With Kids Top 10 Family Fun Finger Lakes Activities On A Rainy Day Events & Festivals Annual Events Summer Fourth Of July Ring Of Fire Fall Colors Naples Grape Festival Maple Weekend Concerts & Live Music CMAC Experience Holiday Events 5ks, Marathons & Triathlons FLXperience Passes Well-Being Passport Discover Downtown Geneva Passport Canandaigua Lake Wine Tasting Passport Restaurants Top Finger Lakes Restaurants Finger Lakes Restaurants On The Water Cuisine Types American Bakeries And Coffee Shops Breakfast & Brunch Brewpubs & Taverns Chinese Diners German Ice Cream & Desserts Indian International Italian Mexican Pizza Sushi Thai Vegan / Vegetarian Farm To Table Local Specialities Take Out & Delivery Wineries & Vineyards Wine Tours Canandaigua Lake Wine Trail Seneca Lake Wine Trail How To Wine & Beer Trail Take Out & Delivery Craft Beverages Breweries & Craft Beer Cideries & Distilleries ROC/FLX Craft Beverage Trail How To Beer And Wine Trail Tours Take Out & Delivery Places To Stay Hotels Lakefront Hotels Resorts Bed & Breakfasts Campgrounds & RV Parks Cabins Vacation Rentals Unique Places To Stay Motels Plan Your Trip Packages & Deals Visitors Guide Trails & Trip Ideas How To Beer And Wine Trail Canandaigua Wine Trail Seneca Lake Wine Trail Top Things To Do Top 10 Winter Activities Top 10 Winter Activities To Keep Warm Indoors Top 10 Ways To Find Comfort On A Rainy Day Top 10 Places To Read A Book In The Finger Lakes A Girls Getaway Top 10 Romantic Ways to Propose in the Finger Lakes Family Fun Family Time Outdoor Recreation History Women's History Trail Sightseeing & Arts Roadside Attractions and Routes 5 & 20 Trail The Picture Perfect Trail Arts & Photo Trail Culinary Castles, Lakes And Grapes Galore Colors Of The Season Must Do For Groups In The Finger Lakes Pet Friendly Hotels Restaurants Wineries & Craft Beverages Blog FAQs Newsletter Finger Lakes Maps Transportation Getting To The Finger Lakes Finger Lakes Facts Canandaigua Lake Seneca Lake Honeoye Lake Canadice Lake Hemlock Lake Conesus Lake Keuka Lake Cayuga Lake Owasco Lake Skaneateles Lake Otisco Lake New York State Erie Canal Ontario County NY Geneva Hotels Restaurants Wineries Shopping Canandaigua Hotels Restaurants Wineries Shopping Naples Hotels Restaurants Shopping Wineries Bristol & South Bristol Victor & Farmington Hotels Restaurants Shopping Bloomfield & West Bloomfield Manchester & Shortsville Richmond, Honeoye & Canadice Phelps & Clifton Springs Hopewell, Seneca, Gorham Historic Port Gibson Colleges & Universities Weather & Webcams What To Pack Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Meetings Meet In The FLX Resources Regions Of Ontario County Travel Guide Meet the FLX Team Venues Meeting & Event Space Hotel Meeting Space Creative Meeting Space Meeting Planner Tools Catering & Dining Services Entertainment & Attractions Transportation Services Team Building Maps Meet and Retreat Newsletter Meetings Profile Sheet Submit RFP Quick Submit RFP Groups Group Profile Sheet Meet the Team Uniquely FLX Sample Itineraries FLX Classic FLX Foodies FLX Seasonal FLX Wine & Craft Beverage FLX Knowledge Seekers FLX Active FLX Wellness FLX Youth Destination Resources Maps About the Region Tour Support Services Submit RFP Weddings Planning Tips & Ideas Proposals Top 10 Romantic Ways To Propose In The Finger Lakes Before The Big Day Wine Tours In The Finger Lakes Spa Treatments Transportation Wedding Venues Event Spaces Rehearsal Dinners Great Photo Spots Vendors Transportation Services Honeymoons Partners Industry Updates Visit Confidently Resources E-Learning Signage & PPE Industry Resources FLVC Industry Newsletter Industry Events Upcoming Dates Legacy Awards National Travel & Tourism Week Tourism Thursdays Education & Training FLVC University Marketing Academy Ambassador Program E-learning Tourism Destination Training Partner Portal Training Partner Portal Training Manage Your Google Listing Coop Marketing Joint Marketing Partner Benefits Research and Resources FLVC Strategic Plans Annual Report Visitor Profiles, Visitation, Economic Impact NYS and National Resources Why Visitors Matter (infographics, etc.) Brand Resources & Logos Diversity / Accessibility Partner Portal Login About Us Seminars Media Online Media Kit Video & Images Gallery Press Releases Big Industry News Story Ideas Research & Reports About Us Blog Meetings Groups Weddings Partners Media Blog Meetings Groups Weddings Partners Media Blog About Us Mission & Vision Board of Directors & Staff Join Our Team History & Location Results & Recognition Local Development Corporation Archives FLVC Strategic Plans Contact Us Privacy Policy Sitemap About Us Contact Us Privacy Policy Sitemap Finger Lakes Visitors Connection, Canandaigua Home About Us Board of Directors & Staff Share Finger Lakes Visitors Connection Team Alicia Richie Quinn, CDME President & CEO Leads FLVC as the destination marketing management organization for Ontario County. Oversees the strategic direction and long-term vision for promoting the region. Alicia@VisitFingerLakes.com (585) 394-3915 ext. 356 Tracey Burkey, CDME Vice President of Destination Development Leads meetings, conventions, and group sales efforts to attract business to the region. Supports destination development initiatives that enhance visitor offerings. Tracey@VisitFingerLakes.com (585) 394-3915 ext. 353 Jessica VanDeMar Marketing Director Develops and implements innovative marketing strategies to drive tourism and brand visibility. Jessica@VisitFingerLakes.com (585) 394-3915 Carolina Taylor PR & Communications Manager Manages media relations to build awareness and engagement, and creates content to tell the Ontario County's story. Carolina@VisitFingerLakes.com (585) 394-3915 Chloe Davis Partner Engagement Coordinator Acts as the primary point of contact for community and tourism partners. Develops and delivers partnership programs, training, and educational resources. Chloe@VisitFingerLakes.com (585) 394-3915 Jaynee Straw Administrative Assistant Provides support for daily operations and visitor services. Jaynee@VisitFingerLakes.com (585) 394-3915 Board of Directors Members of our Board of Directors complete a self-evaluation annually. David Hutchings Chairperson Sonnenberg Gardens Lisa FitzGerald 1st Vice Chairperson Finger Lakes Winery Tours Charles Parkhurst Secretary Lyons National Bank Steve Fuller Treasurer Bristol Mountain Michael Kauffman Immediate Past Chairperson EASTVIEW Christopher Vastola Rep. Board of Supervisors Town of Canadice Lenore Friend Finger Lakes Community College Sherry Brahm-French Arbor Hill Grapery and ExploreNaplesNY Sheryl Mordini 1795 Acorn Inn Mark Gilbride Lazy Acre Alpacas Lori Proper The Lake House on Canandaigua Russ Kenyon Kenyon & Kenyon Mike Roeder Todd Plouffe Indus Hospitality Group Naved Amed Geneva on the Lake Jim Cecere Vinifera / Finger Lakes Goods About Us | Contact Us | Privacy Policy | Sitemap Finger Lakes Visitors Connection 19 Susan B. Anthony Lane, Canandaigua, NY 14424 (585) 394-3915 ® I LOVE NEW YORK is a registered trademark and service mark of the New York State Department of Economic Development; used with permission View Our Guides Looking for some Finger Lakes inspiration? Join Our Newsletter For all your Finger Lakes information and deals © 2025 Finger Lakes Visitors Connection"
    }
  ]
}