{
  "fuentes": [
    {
      "url": "https://www.riverparkfunds.com/about",
      "email": "mkelly@riverparkfunds.com"
    }
  ],
  "mails": [
    "mkelly@riverparkfunds.com"
  ],
  "nombre_sitio": "cocoafl.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.riverparkfunds.com/about",
      "text": "About | RiverPark Funds Home About Funds News How to Invest Contact Us About RiverPark Who we are History Alignment of Interests Investment Philosophy Our Team Founded in 2006, RiverPark is a financial services group with over $1 billion* in assets under management. RiverPark has decades of experience and success in launching and managing funds both in the public and private capital markets and has built strong back office, middle office and compliance functions. * As of June 30, 2025. History RiverPark was founded in 2006. After initially focusing on institutional separate accounts, RiverPark Advisors, LLC was formed in July 2009 to launch the RiverPark family of mutual funds. RiverPark is 100% privately owned, with a majority held by employees. September 2009 RiverPark launches RiverPark Opportunity Fund as a hedge fund September 2010 RiverPark creates RiverPark Funds Trust RiverPark launches RiverPark Large Growth Fund, RiverPark Short Term High Yield Fund and Wedgewood Fund as\r\n                    mutual funds March 2012 RiverPark converts RiverPark Opportunity Fund to the RiverPark Long/Short Opportunity Fund as a mutual\r\n                    fund September 2013 RiverPark launches RiverPark Strategic Income Fund June 2014 RiverPark launches RiverPark Ventures, L.P. September 2016 RiverPark launches RiverPark Floating Rate CMBS Fund as an interval fund RiverPark launches RiverPark Ventures II, L.P. November 2018 RiverPark converts RiverPark Floating Rate CMBS Fund from an interval fund to a mutual fund October 2019 RiverPark launches RiverPark Ventures III, L.P. July 2022 RiverPark launches RiverPark Ventures IV, L.P. June 2023 RiverPark launches RiverPark/Next Century Growth Fund January 2024 RiverPark launches RiverPark/Next Century Large Growth Fund January 2025 RiverPark launches RiverPark Partners Alignment of Interests RiverPark believes strongly in investing alongside its shareholders. RiverPark portfolio managers and\r\n                  employees collectively have over $25 million invested in our own strategies. Investment Philosophy We are committed to building portfolios with strong fundamentals that aim to provide superior returns over\r\n                  multiple economic cycles. We are differentiated by our long-term perspective and our focus on research-driven\r\n                  strategies. Our Team Morty Schaja Chief Executive Officer and Managing Partner Kenny Gilison Chief Operating Officer and Chief Compliance Officer Matt Kelly Chief Marketing Officer Morty Schaja Chief Executive Officer and Managing Partner × Morty graduated from Tel-Aviv University in 1975 with a BS in Physics and from Columbia University in 1976\r\n                    with an MBA in finance and accounting. From 1977 to 1985, Morty was Vice President for Consulting with Data\r\n                    Resources, Inc., a leading economic consulting and forecasting firm. From 1986 through 1987 he was a Senior\r\n                    Analyst with Donaldson, Lufkin & Jenretteâs Stock Index Department. From 1987 until 1990, Morty was\r\n                    Executive Vice President of First Security, a registered investment advisor and hedge fund. From February\r\n                    1991 through March 2006, Morty had various responsibilities with Baron Capital, leading to his position as\r\n                    President and Chief Operating Officer, where he managed the growth of the firm from $40 million in assets\r\n                    under management to over $15 billion. As CEO and a founding partner of RiverPark Capital, Morty has\r\n                    responsibility for all of the firmâs business activities as well as overseeing the firmâs risk management,\r\n                    compliance and trading infrastructure and participating in the portfolio management process. Kenny Gilison Chief Operating Officer and Chief Compliance Officer × Mr. Gilison received a B.A. from the University of Virginia in 1987 and a J.D., magna cum laude, from the\r\n                    University of California, Hastings College of Law in 1991. Prior to joining RiverPark in April 2014, Kenny\r\n                    served as Managing Principal at Westbrook Partners in charge of all operations in France. Mr. Gilison opened\r\n                    Westbrook's Paris office in 2003 and served on the Investment Committee. Prior to joining Westbrook, Mr.\r\n                    Gilison was Director of Acquisitions and a member of the Executive Committee for STAM Europe, a Paris-based\r\n                    asset management firm working with a variety of private equity funds. Prior to joining STAM Europe, Mr.\r\n                    Gilison was the founder and head of GMAC Commercial Mortgage's Paris office. He joined the company in 1999\r\n                    and was responsible for GMACCM investments throughout Europe. Beginning in 1997, Mr. Gilison was a senior\r\n                    member of the commercial real estate finance team at Deutsche Bank in New York. Prior to that time, Mr.\r\n                    Gilison was a practicing attorney concentrating in structured finance, corporate finance and real estate,\r\n                    most recently at Skadden, Arps, Slate, Meagher & Flom in New York. Matt Kelly Chief Marketing Officer × Matt Kelly joined RiverPark Capital in June of 2010 as a Partner with responsibility for marketing and\r\n                    distributing the firmâs asset management products. Prior to joining RiverPark, Matt was responsible for\r\n                    third-party distribution for the Baron Funds from 1997 to 2010. Matt has been in the mutual fund industry\r\n                    since 1995. He graduated from Lehigh University in 1991. Contact: mkelly@riverparkfunds.com Andy Appelbaum Managing Partner, RiverPark Ventures Conrad van Tienhoven Principal and Portfolio Manager Paul Genova Chief Financial Officer Conrad van Tienhoven Principal and Portfolio Manager × Conrad is the Portfolio Manager of the RiverPark Long/Short Opportunity Fund and the RiverPark Large Growth\r\n                    Fund and has served in these capacities since December 2022. Conrad joined RiverPark at its formation and\r\n                    has acted as Assistant Portfolio Manager on RiverPark Long/Short and RiverPark Large Growth since the\r\n                    inception of those Funds. He led the investments in internet media, ecommerce, hardware, software, and\r\n                    online business services as well as healthcare and healthcare technology. Prior to RiverPark, Conrad spent\r\n                    nine years at Baron Funds focused on these same sectors in various roles including Senior Analyst on the\r\n                    Baron iOpportunity Fund and the Baron Fifth Avenue Growth Fund. Conrad received a B.A. in Economics from the\r\n                    University of Texas at Austin in 1997. Andy Appelbaum Managing Partner, RiverPark Ventures × RiverPark Ventures was formed in April of 2014 to make venture capital investments in high growth, early\r\n                    stage business that we believe have significant opportunities to create leadership positions in their\r\n                    industries. Andy received a BA in Philosophy and Political Science, summa cum laude from SUNY\r\n                    Binghamton in 1988 and a JD from New York University School of Law in 1991. From 1991 through 1992, he was\r\n                    an associate with the New York office of Latham & Watkins, specializing in corporate transactions and\r\n                    restructuring. From 1992 through the present, Andy has been a serial entrepreneur with a focus on creating\r\n                    marketplaces and disrupting inefficient supply chains. The companies he has co-founded have spanned a broad\r\n                    diversity of industries, including technology, energy, food services, e-commerce, media and real estate.\r\n                    Andy is the co-founder of Cleaner Options, Seamless (formerly Seamless Web), mdenergy, Blue Ribbon Partners\r\n                    and domino Media Group. Prior to joining RiverPark Ventures, Andy was an active angel\r\n                    investor. As Managing Partner of RiverPark Ventures, Andy is responsible for all of the fund's business\r\n                    activities including deal sourcing and portfolio management. Paul Genova Chief Financial Officer × Paul received his bachelorâs degree in accountancy from Bentley College in 1999. From 1999 to 2002, Paul\r\n                    was a Senior Auditor for Pustorino, Puglisi and Co., Grant Thornton, LLP and PricewaterhouseCoopers, LLP,\r\n                    whereby he led various high profile audit engagements in their respective capital markets groups. In 2003,\r\n                    Paul joined Exis Capital Management, Inc as a Senior Accountant, a multi-strategy / multi-prime broker /\r\n                    multi-manager hedge fund platform with assets reaching $1.5 billion under management. Within a yearâs time\r\n                    at Exis Capital Management, Inc., Paul was promoted to Controller whereby he was responsible for two\r\n                    master-feeder complex capital structures as well as managing a group of several back office members. Prior\r\n                    to joining RiverPark Capital LLC in May of 2008, Paul spent just under a year and a half as Controller at K\r\n                    Squared Capital Advisors, LP, a high-yield / distressed opportunities hedge fund with approximately $270\r\n                    million in assets under management. Edward L. Shugrue III Managing Director and Portfolio Manager Kristi Caruso Chief Administrative Officer Jim Brophy Head Trader/Research Edward L. Shugrue III Managing Director and Portfolio Manager × Mr. Shugrue is a Managing Director of the Company and a Portfolio Manager for the RiverPark Floating Rate\r\n                    CMBS Fund (RCRIX) which was launched in 2010 and internalized at RiverPark in 2018. Mr. Shugrue has over 30\r\n                    years of commercial real estate investing, lending and restructuring experience as an owner, lender and\r\n                    advisor. Prior to joining RiverPark, Mr. Shugrue served for 15 years as the CEO of Talmage (and its\r\n                    predecessors), an investment manager and special servicer in the CMBS and commercial mortgage loan industry\r\n                    with over $12 billion of relevant investment experience. From 1997 until 2003, Mr. Shugrue co-built one of\r\n                    the country's first commercial real estate mezzanine investment platforms in his capacity as the Chief\r\n                    Financial Officer of Sam Zell's Capital Trust, Inc. (now Blackstone Mortgage Trust). From 1991 to 1996, Mr.\r\n                    Shugrue was one of four people responsible for turning around, taking public and selling River Bank America,\r\n                    a New York bank. From 1988 through 1990, Mr. Shugrue was employed in the real estate group of Bear Stearns &\r\n                    Co. Inc. where he worked on principal, agency and securitization assignments. Mr. Shugrue is a former\r\n                    governor of the Commercial Mortgage Backed Securities Association. He is a guest lecturer at the Harvard\r\n                    Business School (where he wrote a case study) as well as numerous other universities. He has also published\r\n                    articles regarding CMBS in numerous publications including PREA Quarterly and CRE Finance World. Mr. Shugrue\r\n                    is a graduate of the University of Pennsylvania with a BA (honors) in political science and with a degree\r\n                    from the Wharton School. Kristi Caruso Chief Administrative Officer × Kristi received her bachelorâs degree as a teacher for the speech/hearing handicapped from New York\r\n                    University in 1996. From 1996 to 2006, Kristi worked at Baron Capital Inc. rising from a marketing intern to\r\n                    an administrative manager. Her roles included research support, trading operations, and human resource\r\n                    management. From 2006 to 2012, Kristi worked at RiverPark as Head Trader and Office Manager. In 2014 Kristi\r\n                    was named Chief Administrative Officer. Jim Brophy Head Trader/Research × Jim joined RiverPark in 2012 and has over 25 years of securities industry experience as both a buy and\r\n                    sell-side trader. Previously, he was a Managing Director in global equity sales and trading at Canaccord\r\n                    Genuity. From 2005 through 2009, Jim was the Head Trader and a Partner at Arience Capital, a value oriented\r\n                    long/short equity hedge fund with over $1bn in assets under management. He has held roles at Bank of\r\n                    America, ABN Amro, NatWest Markets. Jim is a graduate of the University of Michigan and holds an M.B.A. from\r\n                    New York Universityâs Stern School of Business where he earned a dual major in Finance and International\r\n                    Business. He is passionate about several charitable endeavors including The Princeton Wrestling Club (PWC),\r\n                    where he serves on The Board of Directors, and the Multiple Myeloma Research Foundation (MMRF). In 2016, he\r\n                    climbed Mt. Kilimanjaro with six cancer survivors to raise awareness for multiple myeloma. Kristin Cobb Investor Relations Officer and Compliance Officer Spencer Krug Partner, RiverPark Ventures Danny Cohen Investor, RiverPark Ventures Kristin Cobb Investor Relations Officer and Compliance Officer × Kristin joined RiverPark as an Associate in February 2013. From 2010 to 2012 Kristin was a Compliance and\r\n                    Operations Intern for GLG Ore Hill LLC. In 2011 Ore Hill was acquired by Man Investments Inc., where Kristin\r\n                    then transitioned into a US Institutional Business Development and Investor Relations Management Intern from\r\n                    2012 to 2013. Kristin received her Bachelor's Degree in Organizational Management and Development, with a\r\n                    Finance concentration, from New York University in 2014. Spencer Krug Partner, RiverPark Ventures × Spencer is a Partner at RiverPark Ventures. Spencer is involved with all aspects\r\n                    of RPVâs investment process, with a particular focus on deal sourcing, due diligence, financial modeling and\r\n                    managing portfolio companies. Prior to joining RiverPark, Spencer served as a Consultant with L.E.K., a\r\n                    global management consulting firm, specializing in due diligence projects for private equity firms and\r\n                    corporate strategy engagements. Spencer was also one of the first hires for CampusProtein, a leading sports\r\n                    nutrition marketplace catered to the college demographic. Spencer received his B.S. and M.B.A. from the\r\n                    Indiana University â Kelley School of Business where he studied Accounting and Financial Analysis. While at\r\n                    Indiana, Spencer taught an introductory business course to a cohort of freshman students. Spencer is a\r\n                    licensed Certified Public Accountant (CPA). Danny Cohen Investor, RiverPark Ventures × Danny is an Investor at RiverPark Ventures where he is involved in all aspects of the fundâs investment\r\n                    process. Prior to joining RiverPark, he spent two years in the Business Graduate Program at Thomson Reuters\r\n                    â originally in the Automotive Practice Group and most recently on the Applied Innovation team, the\r\n                    companyâs global growth engine. Danny received his B.A. in Political Science from the University of\r\n                    Michigan. During his sophomore year, he co-founded snack food startup Funkinâ Seeds which he ran with four\r\n                    friends until a successful exit in March 2017. During his time at Michigan, Danny interned at hedge fund\r\n                    Scoggin Capital Management and RPV portfolio company Via Transportation, where he helped launch service\r\n                    expansions to Washington DC and New York-area airports. Olga Benis Corporate Controller Tetiana Pyrig Staff Accountant Rachel Kozachkov Receptionist Olga Benis Corporate Controller × Olga received her Bachelorâs Degree in Accounting from Baruch College Zicklin School of Business in 2001.\r\n                    Prior to joining RiverPark, Olga has held various positions in corporate accounting and financial planning\r\n                    and analysis roles with industry leaders such as BlackRock, GFI Group and Bloomberg. Olga joined RiverPark\r\n                    in July 2016 as a Corporate Controller. Tetiana Pyrig Staff Accountant × Prior to joining RiverPark, Tetiana worked at ADW Labs, Inc. from 2010 to 2015 as a Bookkeeper, where she\r\n                    created financial transactions by preparing and analyzing accounting records and financial reports. She was\r\n                    also responsible for processing payroll, preparing invoices, and managed multiple clients, projects and\r\n                    company improvement initiatives. Tetiana received her Bachelorâs Degree in Accounting and Business\r\n                    Administration with a minor in Sociology from Baruch College in 2015. After graduating, she traveled for 6\r\n                    months to 12 different countries. Tetiana joined RiverPark in May 2016. Rachel Kozachkov Receptionist × Rachel received a B.S. in Business Economics from SUNY Albany in 2023. Prior to joining RiverPark, Rachel\r\n                      held several leadership positions at Victoriaâs Secret, including Operations and Teams supervisor. Rachel\r\n                      joined RiverPark in May, 2024. Morty Schaja CEO and Managing Partner × Morty graduated from Tel-Aviv University in 1975 with a BS in Physics and from Columbia University in 1976\r\n                  with an MBA in finance and accounting. From 1977 to 1985, Morty was Vice President for Consulting with Data\r\n                  Resources, Inc., a leading economic consulting and forecasting firm. From 1986 through 1987 he was a Senior\r\n                  Analyst with Donaldson, Lufkin & Jenretteâs Stock Index Department. From 1987 until 1990, Morty was Executive\r\n                  Vice President of First Security, a registered investment advisor and hedge fund. From February 1991 through\r\n                  March 2006, Morty had various responsibilities with Baron Capital, leading to his position as President and\r\n                  Chief Operating Officer, where he managed the growth of the firm from $40 million in assets under management\r\n                  to over $15 billion. As CEO and a founding partner of RiverPark Capital, Morty has responsibility for all of\r\n                  the firmâs business activities as well as overseeing the firmâs risk management, compliance and trading\r\n                  infrastructure and participating in the portfolio management process. Close Mitch Rubin Chief Investment Officer and Managing Partner × Mitch Rubin received a BA in Economics and Political Science from the University of Michigan in 1988 and a JD\r\n                  from Harvard Law School in 1991. From 1991 to 1994, Mitch was an associate with the New York office of Latham\r\n                  & Watkins specializing in corporate finance transactions. From 1994 until joining Baron Capital in November of\r\n                  1995, Mitch was an equity research analyst for Smith Barney in emerging growth stocks. In 1995, Mitch joined\r\n                  Baron Capital as a research analyst covering consumer/retail, gaming/leisure/lodging and real estate. In 1999\r\n                  Mitch was co-portfolio manager for Baron Growth Fund. From the March 2000 inception through March 2006, Mitch\r\n                  was the portfolio manager for the Baron iOpportunity Fund and from the fundâs May 2004 inception to March 2006\r\n                  he was also the portfolio manager of Baron Fifth Avenue Growth Fund, a large cap growth fund. As CIO and a\r\n                  founding partner of RiverPark Capital, Mitch has responsibility for managing the firmâs investment-related\r\n                  research efforts and is the Portfolio Manager of the RiverPark Large Growth Fund and the RiverPark Long/Short\r\n                  Opportunity Fund. Close Matt Kelly Chief Marketing Officer × Matt Kelly joined RiverPark Capital in June of 2010 as a Partner with responsibility for marketing and\r\n                  distributing the firmâs asset management products. Prior to joining RiverPark, Matt was responsible for\r\n                  third-party distribution for the Baron Funds from 1997 to 2010. Matt has twenty years of experience in the\r\n                  mutual fund industry. Matt graduated from Lehigh University in 1991. Contact: mkelly@riverparkfunds.com Close David Sultan Head of Institutional Business Development × David Sultan joined RiverPark Capital in 2017 to lead its institutional business development efforts. Prior\r\n                  to joining RiverPark, David worked at J.P. Morgan Asset Management in the Endowments & Foundations Group where\r\n                  he advised clients about investments in J.P. Morgan strategies across all asset classes. Before that, David\r\n                  provided investment advice to high net worth individuals at J.P. Morgan Private Bank. Previously, David was a\r\n                  long/short portfolio manager in UBS's proprietary U.S. Equities Group focusing on the consumer and retail\r\n                  sectors and worked as a securities analyst at John A. Levin & Co. Prior to that, David spent over a decade at\r\n                  Credit Suisse First Boston as an M&A banker. He also worked as an analyst at McKinsey & Co. David received an\r\n                  AB from Harvard College in 1984 and an MBA from Harvard Business School in 1988. Close Conrad van Tienhoven Principal and Assistant Portfolio Manager × Conrad graduated from the University of Texas with a BA in Economics in 1997. He then joined Baron Capital as\r\n                  a junior analyst and covered the real estate and consumer/retail industries. In 2000, he became a senior\r\n                  analyst on the Baron iOpportunity Fund covering internet media, ecommerce, hardware, software, and online\r\n                  business services. In 2004, in addition to his information technology work, Conrad was made a senior analyst\r\n                  on the Baron Fifth Avenue Growth Fund. In this role, he worked as a generalist in large cap growth ideas.\r\n                  Conrad joined RiverPark Capital at its inception and is a senior research analyst within the firm. Close Edward L. Shugrue III Managing Director and Portfolio Manager × Mr. Shugrue graduated from the University of Pennsylvania in 1988 with a BA (honors) in Political Science and\r\n                  with a degree from the Wharton School of Business. Mr. Shugrue has over 30 years of commercial real estate\r\n                  investing, lending and restructuring experience as an owner, lender and advisor. Prior to joining RiverPark in\r\n                  November 2018, Mr. Shugrue served for 15 years as the CEO of Talmage (and its predecessors), an investment\r\n                  manager and special servicer in the CMBS and commercial mortgage loan industry with over $12 billion of\r\n                  relevant investment experience. From 1997 until 2003, Mr. Shugrue co-built one of the country's first\r\n                  commercial real estate mezzanine investment platforms in his capacity as the Chief Financial Officer of Sam\r\n                  Zell's Capital Trust, Inc. (now Blackstone Mortgage Trust). From 1991 to 1996, Mr. Shugrue was one of four\r\n                  people responsible for turning around, taking public and selling River Bank America, a New York bank. From\r\n                  1988 through 1990, Mr. Shugrue was employed in the real estate group of Bear Stearns & Co. Inc. where he\r\n                  worked on principal, agency and securitization assignments. Mr. Shugrue is a former governor of the Commercial\r\n                  Mortgage Backed Securities Association. He is a lecturer at the Harvard Business School (where he wrote a case\r\n                  study) and the Stanford Graduate School of Business. He has also published articles regarding CMBS in numerous\r\n                  publications including PREA Quarterly and CRE Finance World. Close Erik Diamond Portfolio Manager × Erik graduated from the University of Illinois with a BS in Finance in 1991. From 1991-1999, Erik served as\r\n                  an analyst for ESL Investments, Porter Felleman, First Manhattan and Gotham Partners, evaluating investments\r\n                  in equity and distressed securities. In 1999, Erik founded DCM Partners, a value-oriented investment\r\n                  partnership where he served as Chief Investment Officer and Managing Member through 2011. Erik joined\r\n                  RiverPark Capital in 2014. Close Kenny Gilison Chief Operating Officer and Chief Compliance Officer × Mr. Gilison received a B.A. from the University of Virginia in 1987 and a J.D., magna cum laude, from the\r\n                  University of California, Hastings College of Law in 1991. Prior to joining RiverPark in April 2014, Kenny\r\n                  served as Managing Principal at Westbrook Partners in charge of all operations in France. Mr. Gilison opened\r\n                  Westbrook's Paris office in 2003 and served on the Investment Committee. Prior to joining Westbrook, Mr.\r\n                  Gilison was Director of Acquisitions and a member of the Executive Committee for STAM Europe, a Paris-based\r\n                  asset management firm working with a variety of private equity funds. Prior to joining STAM Europe, Mr.\r\n                  Gilison was the founder and head of GMAC Commercial Mortgage's Paris office. He joined the company in 1999 and\r\n                  was responsible for GMACCM investments throughout Europe. Beginning in 1997, Mr. Gilison was a senior member\r\n                  of the commercial real estate finance team at Deutsche Bank in New York. Prior to that time, Mr. Gilison was a\r\n                  practicing attorney concentrating in structured finance, corporate finance and real estate, most recently at\r\n                  Skadden, Arps, Slate, Meagher & Flom in New York. Close Andy Appelbaum Managing Partner, RiverPark Ventures × RiverPark Ventures was formed in April of 2014 to make venture capital investments in high growth, early\r\n                  stage business that we believe have significant opportunities to create leadership positions in their\r\n                  industries. Andy received a BA in Philosophy and Political Science, summa cum laude from SUNY\r\n                  Binghamton in 1988 and a JD from New York University School of Law in 1991. From 1991 through 1992, he was an\r\n                  associate with the New York office of Latham & Watkins, specializing in corporate transactions and\r\n                  restructuring. From 1992 through the present, Andy has been a serial entrepreneur with a focus on creating\r\n                  marketplaces and disrupting inefficient supply chains. The companies he has co-founded have spanned a broad\r\n                  diversity of industries, including technology, energy, food services, e-commerce, media and real estate. Andy\r\n                  is the co-founder of Cleaner Options, Seamless (formerly Seamless Web), mdenergy, Blue Ribbon Partners and domino Media Group. Prior to joining RiverPark Ventures, Andy was an active angel investor.\r\n                  As Managing Partner of RiverPark Ventures, Andy is responsible for all of the fund's business activities\r\n                  including deal sourcing and portfolio management. Close Zack Semler Research Analyst × Zack graduated from the University of Michigan in 2021 with a degree in Sport Management. At Michigan, Zack\r\n                  was elected a member of the Sport Business Association and was a member of the UM varsity baseball team his\r\n                  freshman year before an injury ended his playing career. He volunteered at Ann Arborâs C.S. Mott Childrenâs\r\n                  Hospital. Zackâs work experience includes summer stints in marketing for the Portland Diamond Project baseball\r\n                  organization aiming to bring an MLB team to Portland, Oregon, and for the sport business networking\r\n                  organization Must Love Sports. Zack joined RiverPark in October 2021. Close Paul Genova Chief Financial Officer × Paul received his bachelorâs degree in accountancy from Bentley College in 1999. From 1999 to 2002, Paul was\r\n                  a Senior Auditor for Pustorino, Puglisi and Co., Grant Thornton, LLP and PricewaterhouseCoopers, LLP, whereby\r\n                  he led various high profile audit engagements in their respective capital markets groups. In 2003, Paul joined\r\n                  Exis Capital Management, Inc as a Senior Accountant, a multi-strategy / multi-prime broker / multi-manager\r\n                  hedge fund platform with assets reaching $1.5 billion under management. Within a yearâs time at Exis Capital\r\n                  Management, Inc., Paul was promoted to Controller whereby he was responsible for two master-feeder complex\r\n                  capital structures as well as managing a group of several back office members. Prior to joining RiverPark\r\n                  Capital LLC in May of 2008, Paul spent just under a year and a half as Controller at K Squared Capital\r\n                  Advisors, LP, a high-yield / distressed opportunities hedge fund with approximately $270 million in assets\r\n                  under management. Close Kristi Caruso Chief Administrative Officer × Kristi received her bachelorâs degree as a teacher for the speech/hearing handicapped from New York\r\n                  University in 1996. From 1996 to 2006, Kristi worked at Baron Capital Inc. rising from marketing intern to an\r\n                  administrative manager. Her roles included research support, trading operations, human resource management and\r\n                  marketing. From 2006 to present, Kristi has worked at RiverPark as Head Trader and Office Manager. Kristi is\r\n                  also an accomplished chef and recently completed training at the French Culinary Institute. Close Jim Brophy Head Trader/Research × Jim joined RiverPark in 2012 and has over 20 years of securities industry experience as both a buy and\r\n                  sell-side trader. Previously, he was a Managing Director in global equity sales and trading at Canaccord\r\n                  Genuity. From 2005 through 2009, Jim was the Head Trader and a Partner at Arience Capital, a value oriented\r\n                  long/short equity hedge fund with over $1bn in assets under management. He has held roles at Bank of America,\r\n                  ABN Amro, NatWest Markets. Jim is a graduate of the University of Michigan and holds an M.B.A. from New York\r\n                  Universityâs Stern School of Business where he earned a dual major in Finance and International Business. He\r\n                  is passionate about several charitable endeavors including The Princeton Wrestling Club (PWC), where he serves\r\n                  on The Board of Directors, and the Multiple Myeloma Research Foundation (MMRF). In 2016, he climbed Mt.\r\n                  Kilimanjaro with six cancer survivors to raise awareness for multiple myeloma. Close Kristin Cobb Associate × Kristin joined RiverPark as an Associate in February 2013. From 2010 to 2012 Kristin was a Compliance and\r\n                  Operations Intern for GLG Ore Hill LLC. In 2011 Ore Hill was acquired by Man Investments Inc., where Kristin\r\n                  then transitioned into a US Institutional Business Development and Investor Relations Management Intern from\r\n                  2012 to 2013. Kristin received her Bachelor's Degree in Organizational Management and Development, with a\r\n                  Finance concentration, from New York University in 2014. Close Justin Simon Operations Manager × Justin graduated from the University of Maryland, College Park in 2009 with a Bachelor's Degree in Economics\r\n                  and a concentration in Finance. While in school, Justin was a member of the Club Baseball program. Prior to\r\n                  joining RiverPark, Justin spent two years at Northern Trust Hedge Fund Services, providing Senior-level Middle\r\n                  and Back Office support for several multi-billion dollar AUM Hedge Fund clients. Justin began his career as an\r\n                  Operations Associate at Fir Tree Partners, a multi-strategy Hedge Fund with AUM north of $7 billion. Justin\r\n                  joined Riverpark in May 2014. Close Danny Cohen Investor, RiverPark Ventures × Danny is an Investor at RiverPark Ventures where he is involved in all aspects of the fundâs investment\r\n                  process. Prior to joining RiverPark, he spent two years in the Business Graduate Program at Thomson Reuters â\r\n                  originally in the Automotive Practice Group and most recently on the Applied Innovation team, the companyâs\r\n                  global growth engine. Danny received his B.A. in Political Science from the University of Michigan. During his\r\n                  sophomore year, he co-founded snack food startup Funkinâ Seeds which he ran with four friends until a\r\n                  successful exit in March 2017. During his time at Michigan, Danny interned at hedge fund Scoggin Capital\r\n                  Management and RPV portfolio company Via Transportation, where he helped launch service expansions to\r\n                  Washington DC and New York-area airports. Close Spencer Krug Partner, RiverPark Ventures × Spencer is a Partner at RiverPark Ventures. Spencer is involved with all aspects of\r\n                  RPVâs investment process, with a particular focus on deal sourcing, due diligence, financial modeling and\r\n                  managing portfolio companies. Prior to joining RiverPark, Spencer served as a Consultant with L.E.K., a global\r\n                  management consulting firm, specializing in due diligence projects for private equity firms and corporate\r\n                  strategy engagements. Spencer was also one of the first hires for CampusProtein, a leading sports nutrition\r\n                  marketplace catered to the college demographic. Spencer received his B.S. and M.B.A. from the Indiana\r\n                  University â Kelley School of Business where he studied Accounting and Financial Analysis. While at Indiana,\r\n                  Spencer taught an introductory business course to a cohort of freshman students. Spencer is a licensed\r\n                  Certified Public Accountant (CPA). Close Olga Benis Corporate Controller × Olga received her Bachelorâs Degree in Accounting from Baruch College Zicklin School of Business in 2001.\r\n                  Prior to joining RiverPark, Olga has held various positions in corporate accounting and financial planning and\r\n                  analysis roles with industry leaders such as BlackRock, GFI Group and Bloomberg. Olga joined RiverPark in July\r\n                  2016 as a Corporate Controller. Close Tetiana Pyrig Staff Accountant × Prior to joining RiverPark, Tetiana worked at ADW Labs, Inc. from 2010 to 2015 as a Bookkeeper, where she\r\n                  created financial transactions by preparing and analyzing accounting records and financial reports. She was\r\n                  also responsible for processing payroll, preparing invoices, and managed multiple clients, projects and\r\n                  company improvement initiatives. Tetiana received her Bachelorâs Degree in Accounting and Business\r\n                  Administration with a minor in Sociology from Baruch College in 2015. After graduating, she traveled for 6\r\n                  months to 12 different countries. Tetiana joined RiverPark in May 2016. Close Home About Funds News How to Invest Contact Us RiverPark Funds 156 West 56th Street, 17th Floor New York, NY 10019 Important Information The RiverPark Funds are distributed by SEI Investments Distribution Co., which is not affiliated with RiverPark Advisors, LLC, Wedgewood Partners, Inc., CrossingBridge Advisors, LLC, Next Century Growth Investors, LLC,  or their affiliates. Check the background of SEI Investments Distribution Co. on FINRA's BrokerCheck RiverPark is the brand name for RiverPark Advisors, LLC and its affiliated investment advisers. Investing involves risk including loss of principal. Accordingly, the purchase of Fund shares should be viewed as a long-term investment. There can be no assurance that a Fund will achieve its stated objectives. Some Funds may use leverage. If the securities decrease in value, a Fund that uses leverage may suffer a greater loss than would have resulted without the use of leverage. To the extent any Fund engages in short sales, losses are potentially unlimited and the expenses involved with the short strategy may impact the performance of the Fund. With the exception of the Wedgewood Fund and the RiverPark Floating Rate CMBS Fund, each Fund is \"diversified\", as that term is defined in the Investment Company Act of 1940. Bonds and bond funds are subject to credit risk, default risk, and interest rate risk and may decline in value as interest rates rise. High yield bonds involve greater risks of default or downgrade and are more volatile than investment grade securities, due to the speculative nature of their investments. Securities backed by commercial real estate assets are subject to securities market risks similar to those of direct ownership of commercial real estate loans including, but not limited to, declines in the value of real estate, declines in rental or occupancy rates and risks related to general and local economic conditions. In addition to the normal risks associated with investing, international investments may involve risk of capital loss from unfavorable fluctuation in currency values, from differences in generally accepted accounting principles or from social, economic or political instability in other nations. Investments in smaller companies typically exhibit higher volatility. To determine if a Fund is an appropriate investment for you, carefully consider the Fund's investment objectives, risk factors, charges and expenses before investing. This and other information may be found in the Fund's prospectus, which may be obtained by clicking here or calling 1-888-564-4517. Please read the prospectus carefully before investing. © 2020 RiverPark Advisors, LLC. All Rights Reserved.   | Legal Notices | Privacy Policy"
    }
  ]
}