{
  "fuentes": [
    {
      "url": "https://coconutsonthebeach.com/contact.php",
      "email": "info@coconutsonthebeach.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "aberdeenbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "chehalisbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "longbeachbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "oceanparkbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "raymondbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.coconutpalmsbeachresort.com/contact-us",
      "email": "cpiiassociation@festiva.com"
    },
    {
      "url": "https://www.coconutpalmsbeachresort.com/contact-us",
      "email": "cpbr2@latourgroup.com"
    },
    {
      "url": "https://www.coconutpalmsbeachresort.com/contact-us",
      "email": "info@vacationcondos.com"
    },
    {
      "url": "https://www.happypalmstays.com/area-guide/dining/coconuts-on-the-beach/",
      "email": "dev@bizcor.com"
    },
    {
      "url": "https://cbayresort.com/contact",
      "email": "coconutbay@atreborgroup.com"
    },
    {
      "url": "https://cbayresort.com/contact",
      "email": "coconutbay@group-promotions.com"
    },
    {
      "url": "https://cbayresort.com/contact",
      "email": "reservations@cbayna.com"
    },
    {
      "url": "https://shopcoconuts.com/about-us/",
      "email": "info@shopcoconuts.com"
    },
    {
      "url": "https://thecoconutpeople.in/pages/about-us",
      "email": "180x180_90x@2x.png"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://thespacecoastrocket.com/george-artz-founder-of-coconuts-on-the-beach/",
      "email": "dmckenzie@ircsheriff.org"
    },
    {
      "url": "https://thespacecoastrocket.com/george-artz-founder-of-coconuts-on-the-beach/",
      "email": "dropadime@cocoapolice.com"
    },
    {
      "url": "https://healthycoconuts.com/contact-us/",
      "email": "contact@healthycoconuts.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "admin@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "docgirls@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "execdirector@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "jniehoff@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "mwaite@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "office@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "pratty@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "rsniegoski@beachfc.com"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "email": "soccer@beachfc.com"
    },
    {
      "url": "https://www.coconutstanning.com/contact-form/",
      "email": "tan@coconutstanning.com"
    },
    {
      "url": "https://coconuts.co/contact/",
      "email": "info@coconuts.co"
    },
    {
      "url": "https://coconuts.co/contact/",
      "email": "membership@coconuts.co"
    },
    {
      "url": "https://www.pensacolacountryclub.com/meet-the-staff",
      "email": "aboston@pensacolacountryclub.com"
    }
  ],
  "mails": [
    "180x180_90x@2x.png",
    "aberdeenbranchbookings@greatnwfcu.com",
    "aboston@pensacolacountryclub.com",
    "admin@beachfc.com",
    "chehalisbranchbookings@greatnwfcu.com",
    "coconutbay@atreborgroup.com",
    "coconutbay@group-promotions.com",
    "contact@healthycoconuts.com",
    "cpbr2@latourgroup.com",
    "cpiiassociation@festiva.com",
    "dev@bizcor.com",
    "dmckenzie@ircsheriff.org",
    "docgirls@beachfc.com",
    "dropadime@cocoapolice.com",
    "execdirector@beachfc.com",
    "info.sbr@sugarbeachmauritius.com",
    "info@coconuts.co",
    "info@coconutsonthebeach.com",
    "info@shopcoconuts.com",
    "info@vacationcondos.com",
    "jniehoff@beachfc.com",
    "longbeachbookings@greatnwfcu.com",
    "membership@coconuts.co",
    "mwaite@beachfc.com",
    "oceanparkbookings@greatnwfcu.com",
    "office@beachfc.com",
    "pratty@beachfc.com",
    "raymondbranchbookings@greatnwfcu.com",
    "reservations.sugarbeach@yoursunlife.com",
    "reservations@cbayna.com",
    "rsniegoski@beachfc.com",
    "soccer@beachfc.com",
    "tan@coconutstanning.com"
  ],
  "nombre_sitio": "coconutsonthebeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://coconutsonthebeach.com/contact.php",
      "text": "Coconuts On The Beach | Restaurant & Bar Online Order Cocoa Beach Florida Live Music 2 Minutemen Cswy, Cocoa Beach, FL 32931 321-784-1422 Menus Main Menu Drink Menu Gift Cards Beach Rentals Gallery Photo Gallery Video Gallery Others Live Music Events Blog Career About us Contacts Coconuts On The Beach Get In Touch Our Address 2 Minutemen Cswy, Cocoa Beach, FL 32931 Call Us 321-784-1422 About us Contact us Main Menu Drink Menu Live Music Events Facebook Instagram Kitchen is open from 11am till 10pm 2 Minutemen Cswy, Cocoa Beach, FL 32931 321-784-1422 © 2025 www.coconutsonthebeach.com ., All Rights Reserved"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "text": "Contact Us Free Community Shred Day to be held at our Aberdeen, Raymond and Long Beach branch locations - Saturday, September 20th from 9AM to Noon. Bring your sensitive documents and mail to be securely destroyed on-site. Donations of canned goods for local food banks will be accepted. Close Alert Go to main content Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Search: Online Banking Login Login Username Register Bank Borrow Manage Discover Spend Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Share Savings HSAs Youth Accounts Christmas Club Investment Accounts Money Market IRAs Certificates Business Accounts Retirement & Investment Services Savings Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Loans Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Access Online Banking Mobile Banking EasyPay Protection Insurance Estate Planning Loan Payment Options Business Services Card Services Courtesy Pay Order Checks Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More About Us About Great NorthWest FCU Become a Member Membership Benefits Buy Local Spend Local Promotions Refer a Friend Career Opportunities Get Help Contact Us Frequently Asked Questions Disclosures & Agreements Provide Feedback Rates Locations Locations & ATMs Financial Education Great NorthWest Insider Great NorthWest Scholarships Credit Score Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Contact Us We're here when you need us. Have a question or need a hand? We’re here to help. Reach out by phone, text, email, or visit us in person—our team is ready to support you, wherever life takes you. Contact Us Quick Question? Get a quick answer during business hours. Text 3605339990 and a Member Service Representative will reply! Need a notary? Want to open a Safe Deposit Box? Have questions about filing a cardholder dispute? Skip the line at your local branch and Schedule an Appointment ! * Required Fields First Name: Last Name: Email Address: Message: Are you a current member of Great NorthWest FCU? Yes No Branch Information Filter by City All Cities All Cities Aberdeen, WA Chehalis, WA Long Beach, WA Ocean Park, WA Raymond, WA Filter by Service All Services All Services Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Aberdeen Branch 301 W. Wishkah Street Aberdeen, WA 98520 Get Directions Phone: 360-533-9990 TTY: 1-800-533-8396 Email Us Schedule an Appointment 24-Hour Drive-Thru ATM located across the street at 320 W. Wishkah St. You can also visit our Great NorthWest Financial Center. Located at 331 W. Wishkah St., this office houses our Retirement & Investment Services along with Mortgage and Business Lending. Lobby Hours: Mon: 9am - 6pm Tue: 9am - 6pm Wed: 9am - 6pm Thu: 9am - 6pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 6pm Tue: 8am - 6pm Wed: 8am - 6pm Thu: 8am - 6pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru Safe Deposit Boxes Night Deposit Coin Counter Notary Services Chehalis Branch 1601 N.W. Louisiana Avenue Chehalis, WA 98532 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 8:30am - 5:30pm Tue: 8:30am - 5:30pm Wed: 8:30am - 5:30pm Thu: 8:30am - 5:30pm Fri: 8:30am - 6pm Sat: 9am - 1pm Sun: Closed On-site ATM Notary Services Long Beach Branch 705 Pacific Ave. S. Long Beach, WA 98631 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Ocean Park Branch 1409 251st Pl. Ocean Park, WA 98640 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive Thru Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Raymond Branch 327 Commercial Street Raymond, WA 98577 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Go to main navigation Make it Great! Send Us A Message This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Call Center (360) 533-9990 (call or text) (800) 533-8396 Call Center Hours (PST) Monday - Friday: 8am - 6pm Saturday: 9am - 1pm Sunday: Closed Mailing Address 301 W. Wishkah St. Aberdeen, WA 98520 Routing Number: 325180333 Accessibility Statement Privacy Policy Disclosures Site Map © 2025 Great NorthWest Federal Credit Union Website by CUSG Facebook Instagram This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Search: Bank Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Investment Accounts Business Accounts Retirement & Investment Services Savings Rates Borrow Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Manage Online Banking Insurance Loan Payment Options Business Services Courtesy Pay Card Services Order Checks Discover About Great NorthWest FCU Become a Member Membership Benefits Promotions Career Opportunities Locations & ATMs Contact Us FAQs Provide Feedback Great NorthWest Insider Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Google ReCaptcha Error"
    },
    {
      "url": "https://www.coconutpalmsbeachresort.com/contact-us",
      "text": "Coconut Palms Beach Resort II | New Smyrna Beach, FL | Contact Us One Bedroom One Bedroom Bungalow One Bedroom Ocean View One Bedroom Partial Ocean View Two Bedroom Two Bedroom Ocean Front Three Bedroom Studio Specials About Us Things To Do Contact Us Blog Check Availability Contact Us home / Contact Us Let's get you where you need to be! Make a reservation: Our offices are open Monday through Friday from 9am-5pm. Please email info@vacationcondos.com To reach the board of directors, please email: CPIIAssociation@festiva.com Reach the front desk: Call (386) 428-1874 Want to receive an email? Send us a message at cpbr2@latourgroup.com and a representative will reach out to you. Lost Item? If you have left something behind, please complete our lost item reporting form with as much detail as possible about your missing item. You will receive periodic updates on the status of our search, and should your item be recovered, you will receive return options and payment instructions. All attorney correspondence must be mailed to the legal department at One Vance Gap Road, Asheville, North Carolina 28805 . Exceeded my expectations! Join The Conversation Will definitely be coming back! The room was very well maintained & furnished, and we enjoyed the balcony with ocean view. All the staff was very professional and helpful in answering questions. The weather was cool during our stay, so the heated pools were very nice. Will definitely be coming back! The room was very well maintained & furnished, and we enjoyed the balcony with ocean view. All the staff was very professional and helpful in answering questions. The weather was cool during our stay, so the heated pools were very nice. Will definitely be coming back! The room was very well maintained & furnished, and we enjoyed the balcony with ocean view. All the staff was very professional and helpful in answering questions. The weather was cool during our stay, so the heated pools were very nice. View More Reviews Useful Links Privacy Policy Terms and Conditions Association Documents Lost and Found Resort Travel & Xchange Pay Your Maintenance Fees Association Minutes and Resolutions Resort Map Owner's Corner Owner Portal Guest Directory Notice of Accessibility Resort Fact Sheet Join Our Newsletter Subscribe to our newsletter to learn more about upcoming events and specials in the area. * Local Weather New Smyrna Beach Coconut Palms Beach Resort II  |  611 S Atlantic Ave, New Smyrna Beach, FL 32169  |  386-428-1874 Your Privacy Choices * By submitting this form, you consent to receiving marketing communications from us.  Specifically, you expressly authorize LaTour Hotels & Resorts, Inc. (also d/b/a Vacationcondos.com), LaTour Group Management Canada, Inc., Resort Travel & Xchange, Inc., a Nevada corporation, to send marketing calls and/or text messages using an automatic telephone dialing system or prerecorded voice and/or to send emails about their products using automated technology to your telephone/cellular number(s) and/or email address provided above.  You understand that your mobile phone service provider may charge you fees for calls and text messages sent, and you agree that the Companies shall have no liability for the cost of such text messages.  You understand that you are not required to give your consent as a condition of any purchase.  You may unsubscribe from these communications at any time. View our Privacy Policy © 2025 Coconut Palms Beach Resort II."
    },
    {
      "url": "https://www.happypalmstays.com/area-guide/dining/coconuts-on-the-beach/",
      "text": "Enjoy a Meal at Coconuts On The Beach | Happy Palm Stays Stay In Cocoa Beach is now Happy Palm Stays! Not to worry, we are still the same family owned company. Click here to learn more. Vacation Rentals All Our Rentals Vacation Homes Condos & Communities Avalon Beach Banana River Resort Boardwalk Canaveral Sands Canaveral Towers Cape Crossing Cape Winds Cocoa Beach Club Cocoa Beach Towers Chateau by the Sea Flores Ocean Suites Fortebello Beachside Harbor Island Beach Club Indian Harbour Beach Club Michelina Monthly Rental Condos Ocean Walk Ola Grande Paradise Beach Club Pier Resort Royal Mansions Sandcastles Seabreakers Shorewood Siesta Del Mar Spanish Main By Location Cape Canaveral Cocoa Beach Fort Pierce Hutchinson Island Indian Harbour Indialantic Melbourne Melbourne Beach Merritt Island Satellite Beach Sebastian Pet-Friendly Rentals Monthly Rentals Management About Our Management Navigating the Rules: Key Steps To Be Compliant Area Guide Activities Attractions Blogs Dining Holidays Journeys Seasonal Guide Top 5 Best Lists FAQ’S About Us Contact My Fav's Vacation Rentals All Our Rentals Vacation Homes Condos & Communities Avalon Beach Banana River Resort Boardwalk Canaveral Sands Canaveral Towers Cape Crossing Cape Winds Cocoa Beach Club Cocoa Beach Towers Chateau by the Sea Flores Ocean Suites Fortebello Beachside Harbor Island Beach Club Indian Harbour Beach Club Michelina Monthly Rental Condos Ocean Walk Ola Grande Paradise Beach Club Pier Resort Royal Mansions Sandcastles Seabreakers Shorewood Siesta Del Mar Spanish Main By Location Cape Canaveral Cocoa Beach Fort Pierce Hutchinson Island Indian Harbour Indialantic Melbourne Melbourne Beach Merritt Island Satellite Beach Sebastian Pet-Friendly Rentals Monthly Rentals Management About Our Management Navigating the Rules: Key Steps To Be Compliant Area Guide Activities Attractions Blogs Dining Holidays Journeys Seasonal Guide Top 5 Best Lists FAQ’S About Us Contact × Name * First Email * Phone Message CAPTCHA LinkedIn This field is for validation purposes and should be left unchanged. Coconuts on the Beach Finding time to get away from the hustle and bustle of life to enjoy a well-earned getaway is important. Taking a moment to simply embrace the best that life has to offer is essential when it comes to finding a sense of well-being and balance. Travelers looking for a place where they can unwind in coastal style will quickly discover that Cocoa Beach, Florida has everything they’ve been looking for! From sugar-white sands and sun to endless surf, Cocoa Beach is a place to indulge the senses. It’s also an oasis of flavor waiting to be found! Visitors in the mood to make the most of an authentic beach bar and restaurant experience while they’re in town will want to make sure to enjoy a meal at Coconuts on the Beach restaurant while they’re here. Enjoy the Best of Beachside Flavor and Style at the Coconuts on the Beach Restaurant Coconuts on the Beach in Cocoa Beach is found at 2 Minutemen Causeway and is open to the dining public daily from 11:00 am until 10:00 pm. This laid-back beach hangout and eatery is easy to spot thanks to its vibrant façade and inspiring location near the water. While guests enjoying a meal at Coconuts on the Beach in Cocoa Beach can always dine indoors, it’s the sprawling patio overlooking the sand and water complete with tiki huts that draws the most attention. Just steps from the sand, this restaurant provides patrons with amazing views, and plenty of menu items to match! Coconuts on the Beach is also known and loved for its regular lineup of live music performances, amazing, handcrafted cocktails, and friendly service to top it all off. Menu Highlights Every stop at Coconuts on the Beach promises to be a treat for the tastebuds. Guests will want to start things off by ordering up appetizers for the table. Selections include options like poke nachos, bangin’ shrimp, coconut crusted shrimp, and island conch fritters too! Fresh soup and salad are available for those dining light with burgers and sandwiches readily available when a more robust dining experience is in order. Entrée selections at Coconuts on the Beach include fresh catch of the day as well as stuffed red snapper, jalapeno crusted mahi and lemon caper salmon. Whether you go with a lobster dinner or shrimps and scallops, it’s bound to be a palate-pleasing experience. Coconuts on the Beach has a full kid’s menu available as well as dessert options that include pineapple crème brulee and three-layer chocolate cake. Savor the Cocoa Beach Moment The next time travel plans bring you to Cocoa Beach, the team at Happy Palm Stays is here to make sure you have the luxurious vacation rental you deserve in place! Get in touch today to learn more and to start planning. Start Your Vacation Now Browse Rentals Contact Us Name * First Phone Number* * Email * Subject* * Message Facebook This field is for validation purposes and should be left unchanged. Subscribe to our mailing list Name* Last Name* Email * Comments This field is for validation purposes and should be left unchanged. Our Office Happy Palm Stays 5300 Ocean Beach Blvd Cocoa Beach, Fl. 32931 Give Us A Call (321) 900-4311 Quick Links Cocoa Beach Club Paradise Beach Club Cocoa Beach Condos Satellite Beach Condos Space Coast Vacation Rentals Pet-Friendly Cocoa Beach Rentals Last-Minute Cocoa Beach Rentals Last-Minute Melbourne Beach Rentals Last-Minute Space Coast Rentals Where We Manage Alphabetical Property List About Us Contact Us FAQ's Blog Owner Login © 2025 Happy Palm Stays Vacation Rentals ×"
    },
    {
      "url": "https://cbayresort.com/contact",
      "text": "Contact Us - Coconut Bay St Lucia Beach Resort & Spa Skip to content Coconut Bay Beach Resort & Spa Home Premium Inclusions Inclusions Image Dining Calabash La Luna Seasons Veggie Bistro Silk The Greathouse at Serenity Trattoria Veranda Coconut Walk Marketplace Flip Flops The Jerk Treehouse Bars Lobby Bar Harmony Pool Bar Sand Bar Paradise Beach Bar Peter John’s Lounge Splash Bar Swim-Up Pool Bar Pool & Beach Activity Pool Splash Pool Harmony Tiki Pool and Bar Harmony Oasis Pool Splash Plunge Pool Waterpark Beach Recreation & Activities Recreational Sports Water Sports Fitness The Zone Paintball Kitesurfing Entertainment Themed Dinners on The Pool Deck Karaoke & Beach Parties Resort Resort Image Harmony Adults-Only Wing Harmony Accommodations Splash Family-Friendly Wing Splash Accommodations Family Reunions Cocoland Waterpark The Zone Paintball Serenity Couples-Only Luxury Suite Resort Luxury Inclusions Luxury Suites Romance Romance Photo Weddings Wedding Packages Wedding Photography Vow Renewals Wedding Documentation Wedding Q&A Honeymoons Honeymoon Registry Romance Packages Couples Getaway Excursions Tours Image Tours Copy TREASURES OF ST. LUCIA Perfectly placed closest to the treasures of Saint Lucia, Coconut Bay offers guests many opportunities to behold the beauty of our legendary island. Above and below the seas, awe-inspiring scenes await. Visit the Adventure Saint Lucia desk (located in the resort lobby) to make your reservations for island excursions from SCUBA diving, snorkeling, deep sea fishing and sunset cruises to a jeep safari through the rainforest, horseback riding or ATV rides. Tours & Excursions Land Tours Sea Tours Thrilling Excursions Groups Wellness Spa Image Spa Copy SANCTUARY SPA Treat yourself to pure indulgence in the spa at Coconut Bay. This eight-room oasis offers the sounds of the ocean to soothe the senses while relaxing the body and mind. Guests can choose from a variety of treatments including signature organic therapies in oceanview treatment rooms featuring outdoor showers. Whether your desire is to soothe or rejuvenate the skin, our treatments and staff aim to please. Pick your own aloe stem, enjoy a massage for two outdoors, or just close your eyes and allow your mind to be renewed. We invite you to experience true pampering in paradise. SANCTUARY SPA Spa Services Spa Brochure More Gallery Image Gallery Copy EXPERIENCE Our island offers an enticing mix of Caribbean beaches, tropical blue waters filled with reefs, lush rainforests, and an interesting history. Visitors will find a seemingly endless array of activities within the island’s unparalleled natural attractions. More Kitesurfing Celebrations Registry Photo Gallery Videos FAQs Specials Specials Image Specials Copy BEST RATE GUARANTEE With Coconut Bay’s Best Rate Guarantee , you can relax knowing you’ve scored the lowest price but if, by chance you find a better rate within 24 hours of booking with us, we’ll happily match it! Special Offers Fall 2025 Sale Christmas + NY 2025 Sale Winter 2026 Sale Spring 2026 Sale Autumn 2025 Christmas 2025 + NY 2026 Winter 2026 Spring 2026 Summer 2026 Autumn 2026 Christmas 2026 + NY 2027 (877) 252-0304 1582 792260 Search: BOOK NOW CALL CALL | BOOK BOOK UK Home Premium Inclusions Dining Calabash La Luna Seasons Veggie Bistro Silk The Greathouse at Serenity Trattoria Veranda Coconut Walk Marketplace Flip Flops The Jerk Treehouse Bars Lobby Bar Harmony Pool Bar Sand Bar Paradise Beach Bar Peter John’s Lounge Splash Bar Swim-Up Pool Bar Pool & Beach Activity Pool Splash Pool Harmony Tiki Pool & Bar Harmony Oasis Pool Splash Plunge Pool Waterpark Beach Recreation & Activities Recreational Sports Water Sports Fitness The Zone Paintball Kitesurfing Waterpark Entertainment Resort Harmony Adults Only Harmony Accommodations Splash Fun For All Splash Accommodations Family Reunions Cocoland Waterpark The Zone Paintball Serenity at Coconut Bay Romance Weddings Wedding Packages Wedding Photography Vow Renewal Wedding Documentation Wedding Q&A Honeymoons Honeymoon Registry Romance Packages Couples Getaway Excursions Land Tours Sea Tours Thrilling Excursions Groups Wellness Spa Services Spa Brochure More Kitesurfing Celebrations Registry Photo Gallery Videos FAQs Specials Fall 2025 Sale Christmas + NY 2025 Sale Winter 2026 Sale Spring 2026 Sale Autumn 2025 Christmas 2025 + NY 2026 Winter 2026 Spring 2026 Summer 2026 Autumn 2026 Christmas 2026 + NY 2027 Resort Details P.O. Box 246 • Vieux Fort, Saint Lucia Resort Phone: (758) 459-6000 Resort Fax: (758) 456-9900 Resort Reservations: (758) 456-9999 Reservations North America Call: 877-252-0304 email: reservations@cbayna.com Hours: Monday – Friday (9 AM – 6 PM EST) Saturdays (10 AM – 5 PM EST) United Kingdom In the United Kingdom and Europe call: 44 1582 792260 email: coconutbay@group-promotions.com Hours: Monday – Friday (9 AM – 5 PM) Media Inquiries For media inquiries, please contact The Atrebor Group email coconutbay@atreborgroup.com \" * \" indicates required fields Name * First Last Phone Email * Postal Code Country * Afghanistan Albania Algeria American Samoa Andorra Angola Antigua and Barbuda Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Costa Rica Côte d'Ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Fiji Finland France French Polynesia Gabon Gambia Georgia Germany Ghana Greece Greenland Grenada Guam Guatemala Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Zealand Nicaragua Niger Nigeria Norway Northern Mariana Islands Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Puerto Rico Qatar Romania Russia Rwanda Saint Kitts and Nevis Saint Lucia Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia and Montenegro Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa Spain Sri Lanka Sudan Sudan, South Suriname Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Virgin Islands, British Virgin Islands, U.S. Yemen Zambia Zimbabwe Subject Rate Inquiry Wedding Inquiry Group Reservations Question concerning an existing reservation? General Message Special Offers? Marketing permission: I give my consent to Coconut Bay to be in touch with me via email using the information I have provided in this form for the purpose of news, updates and marketing. What to expect:  If you wish to withdraw your consent and stop hearing from us, simply click the unsubscribe link at the bottom of every email we send or click here .  We value and respect our personal data and privacy.  To view our privacy policy, please visit our website.  By submitting this form, you agree that we may process your information according with these terms. This field is hidden when viewing the form Target * default saint_lucia trinidad united_kingdom weddings CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ INFO About Us Specials Blog Loyalty Rates Sitemap FAQs Early Check-in Contact Us Privacy Policy Terms and Conditions Hurricane Pledge Best Rate Guarantee Newsletter Sign-up Unsubscribe Newsletter TRAVEL AGENTS Travel Agent Documents for Download Find an Agent Media Press Kit Awards & Recognitions Articles Press Releases Find Us How To Get Here Points of Interest Map Resort Fact Sheet Resort Map Contact Us Coconut Bay Beach Resort & Spa PO Box 246, Vieux Fort, Saint Lucia Resort Phone: 758-459-6000 Resort Reservations: 758-456-9999 North America Reservations: 877-252-0304 UK & Europe Reservations: 44 1582 792260 Distance from Airport Contact Us Coconut Bay Beach Resort & Spa PO Box 246, Vieux Fort, Saint Lucia Resort Phone: 758-459-6000 Resort Reservations: 758-456-9999 North America Reservations: 877-252-0304 UK & Europe Reservations: 44 1582 792260 INFO About Us Specials Blog Loyalty Rates Sitemap FAQs Early Check-in Contact Us Privacy Policy Terms and Conditions Hurricane Pledge Best Rate Guarantee Newsletter Sign-up Unsubscribe Newsletter TRAVEL AGENTS Travel Agent Documents for Download Find an Agent MEDIA Press Kit Awards & Recognitions Articles Press Releases FIND US How To Get Here Points of Interest Map Resort Fact Sheet Resort Map Specials Distance from Airport ©2025 Coconut Bay Beach Resort & Spa Go to Top By continuing, you agree to Coconut Bay Beach Resort & Spa’s Terms and Conditions and Privacy Policy . TRAVEL AGENTS LOGIN/REGISTER HERE X"
    },
    {
      "url": "https://shopcoconuts.com/about-us/",
      "text": ""
    },
    {
      "url": "https://thecoconutpeople.in/pages/about-us",
      "text": "About Us – The Coconut People Skip to content Home Shop Now Organic Virgin Coconut Oil Organic Coconut Sugar Face Care Face Scrubs Lip Balms The Lifestyle Collection Coconut Soap Holder Coconut Wood Spoon Coconut Candles Bamboo Toothbrush Coconut Bowls Coconut-Coir Dish Scrubber Combo Kits Blog About Us Contact Us Privacy Policy Return & Refund Policy Terms of Use Blog About Us Contact Us Shipping and Delivery Account Cart FREE & FAST SHIPPING Your cart is empty 🥥 10% OFF ON YOUR FIRST ORDER 🥥 Home Home Shop Now Organic Virgin Coconut Oil Organic Coconut Sugar Face Care Face Scrubs Lip Balms The Lifestyle Collection Coconut Soap Holder Coconut Wood Spoon Coconut Candles Bamboo Toothbrush Coconut Bowls Coconut-Coir Dish Scrubber Combo Kits Blog Blog About Us About Us Contact Us Contact Us About Us Why We Can’t Stop Being Coco-Nuts! Coconuts were always a big part of our tropical, Southern-Indian upbringing and we just had to bring its awesome-ness to everyone. It's a wonderful thing to be able to imbibe the best of different cultures around the world, and this is our eco-good contribution to the broader lives we've begun to lead. Our obsession with coconuts has also got a lot to do with their incredible versatility, sustainability and nurturing abilities. Born in tropical coastal lands and imbued with the labour of love by local plantation owners, this wonderful tree promises a sustainable and cleaner way of living. And that's what we are all about! It is the best instance of nature serving nature and we wanted to share this spirit with the whole world. Lovingly Called “The Tree Of Life” Around The World For centuries, people have explored various aspects of the coconut tree and the nutritional benefits it holds. Through this search have come some groundbreaking discoveries and remedies for wellness. Every fiber of its existence adds to life in some way or the other. Celebrated in cultures & traditions all-over the globe and even worshipped in many religions that have experienced its benefits, it has been rightly dubbed as \"Kalpavriksham\" or “The Tree Of Life”. Potent Ingredients Sourced From Nature's Lap Our carefully-curated ingredients and potent formulations provide blanket coverage to fulfil your skin's beauty and wellness needs. Often peppered with our humble coconut, our products will keep your wellness game strong. Coconuts In, Toxins Out. We Are Doing Beauty Better. All our products are carefully & scientifically formulated to make the most out of our all-time favourite coconut and nature's best ingredients. We are constantly in touch with our producers to ensure that rigorous standards are followed through, so that we get the choicest ingredients to cater to your skin's multiple needs and infuse it with nutrients that will keep it glowing and healthy. Environment First. We were one of the first companies in India to go plastic-free because we love the environment just as much as we love you. We love if something can be re-used or re-purposed effectively! The ideal example for this would be our glass jars, which can be easily up-cycled as part of your home décor, used to grow cute succulents for your work desk or store spices in your kitchen. We pack our products with bio-degradable, re-cyclable or re-usable packaging to ensure they don't end up as pollutants in landfills. We take sustainability all the way! Vocal For Local There is just something about knowing that what you are using is sourced, produced, assembled and made locally by people you can identify with. We believe in locally-grown, sourced and made products. This is why we have long-established ties with our producers and plantation owners, who never compromise on the quality of products and are an essential part of our Coco-family. Safeguarding Our Furry and Feathered Friends None of our products are tested on animals because we love our furry and feathered friends! All our products are made without putting any animal life in danger or harm. Welcome to our family. Meet the nutty folks! The Coconut People are wanderers, with their roots set firmly in the tropical estates of southern India - from Kerala to the Andamans. We’ve lived our lives in the coconut-rich fields of India’s coasts - and life here is different. Organic living is not a trend here, it’s a lifestyle. It permeates into each day of our existence - from edibles, oils, skin applicants, to even utensils! Each coconut here is grown naturally and organically, without chemical or synthetic fertilizers. Main menu Home Shop Now Blog About Us Contact Us Important Links Privacy Policy Return & Refund Policy Terms of Use Blog About Us Contact Us Shipping and Delivery Get 10% off on your first purchase No spam, only sweet emailers. Subscribe © The Coconut People"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://thespacecoastrocket.com/george-artz-founder-of-coconuts-on-the-beach/",
      "text": "George Artz, founder of Coconuts on the Beach passed away - The Space Coast Rocket Facebook Instagram Twitter Youtube Sign in Join Home 🚀 Advertise – Reach Brevard’s Most Engaged Audience! Events Register Beach Business Networking Seminar Causes Charity Christmas Community Entertainment Adult Air Shows Comedy Karaoke Kids Live Music Cover Bands Jazz Original Music Bands Parades Theater Plays Fairs Festivals Food Real Estate Auction Broker’s Open Open House Political Space Launch Sports Run Run/Walk Surfing Walk Submit a Story Sign in Welcome! Log into your account your username your password Forgot your password? Create an account Sign up Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email Search The Space Coast Rocket Present Facts. Ask Questions. Get Answers. Home 🚀 Advertise – Reach Brevard’s Most Engaged Audience! Events Register Beach Business Networking Seminar Causes Charity Christmas Community Entertainment Adult Air Shows Comedy Karaoke Kids Live Music Cover Bands Jazz Original Music Bands Parades Theater Plays Fairs Festivals Food Real Estate Auction Broker’s Open Open House Political Space Launch Sports Run Run/Walk Surfing Walk Submit a Story Home Cocoa Beach George Artz, founder of Coconuts on the Beach passed away George Artz, founder of Coconuts on the Beach passed away Support Local Small Business! Published on December 28, 2022 By Robert Burns Facebook Twitter Linkedin ReddIt Tumblr Telegram - Advertisement - The company made the following announcement on their Facebook page today. - Advertisement - On Friday, December 23rd, we lost our George Artz. He was the owner, creator and visionary of our iconic oceanfront establishment. It was started as a dream of his in the 70’s, and it’s because of him and his endless dedication, creativity, and hard work, that Coconuts on the Beach has turned into a world famous destination in the wonderful little town of Cocoa Beach, Fl. Many of the people who visit Coconuts on the regular are lifelong friends of George and his tight knit family whom he loved so dearly. His legacy will carry on through the hard work of his children and his dedicated employees, who were also like family to him. George was an incredibly special man, and if you were lucky enough to know him, well, you were lucky enough. Fly high, George, and rest easy. Thank you for all that you’ve accomplished! - Advertisement - Upcoming Events Upcoming Events Sep 12 7:30 pm - 9:00 pm Triggered Comedy Club featuring Preach Carter Sep 13 11:30 am - 2:30 pm Politics, Religion, and Society: A Panel Discussion and Luncheon Sep 26 7:30 pm - 9:00 pm Triggered Comedy Club featuring Clyde Gordon View Calendar Facebook Posts The Space Coast Rocket 5 days ago What's your take? Who's right, who's wrong, who made out the best in the end? What lesson can we take form this interaction? ... See More See Less Video View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email The Space Coast Rocket 5 days ago Car hit boat on trailer at 95/520 this morning. ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email The Space Coast Rocket 6 days ago 🚨 MISSING TEEN – PLEASE SHARE The Indian River County Sheriff’s Office is asking for the community’s help in locating 15-year-old Katie Brown. • Blonde hair / Hazel eyes • 5’0” / 120 lbs • Last seen heading east on 12th Street toward US Highway 1 • Wearing a black hoodie, blue jean shorts, and gray Crocs Case #: 25-95678 Contact: Det. D. McKenzie – 772-978-6240 / dmckenzie@ircsheriff.org Or call Treasure Coast Crime Stoppers at 1-800-273-8477 Every share helps bring Katie home safely. #MissingChild #IndianRiverCounty #KatieBrown #AmberAlert #CommunityAlert ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email The Space Coast Rocket 6 days ago 🚨 Flagler Fugitive Accused of Sexually Battering Child Under 12 Returned to Florida 🚨 After weeks of delays and legal wrangling in North Carolina, 72-year-old Kermit Booth—wanted on two counts of sexual battery on a child under 12—is now back in Florida custody. Flagler County Sheriff Rick Staly and his team personally traveled to North Carolina to bring Booth back after his second arrest on a governor’s warrant. He’s now being held at the Sheriff Perry Hall Detention Facility on $500,000 bond and faces life in prison if convicted. Sheriff Staly didn’t mince words: “I hope he enjoyed his flight back to Florida because it’ll probably be the last flight he takes. Hopefully, he’ll be spending the rest of his life in prison.” Booth’s case stretches back nearly two decades, with allegations dating between 2006–2009 when the victim was just 6 to 9 years old. The victim bravely came forward again in 2023, allowing investigators to relaunch the case and uncover new evidence. Sheriff Staly thanked Governor Ron DeSantis, NC Governor Roy Cooper, Macon County Sheriff Holbrooks, and Florida Commissioner of Agriculture Wilton Simpson for their roles in making this extradition possible. Booth’s return marks the beginning of what Sheriff Staly says will hopefully be long-overdue justice for the victim. ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email The Space Coast Rocket 6 days ago Have you seen this vehicle? It is a gold colored 2010-2013 model, 4-door Honda Accord last seen heading North on Indian River Drive just after 4:30 PM. The driver is described as a white or Hispanic male with bushy sideburns and a mustache. This vehicle was involved in a hit and run crash involving a pedestrian in the 800-block of Indian River Dr. The pedestrian suffered minor injuries as a result of being hit. Patrol officers are asking anyone with information to please text or email dropadime@cocoapolice.com or call our non emergency line at 321-639-7620 (option 4). Residents along Riverside Dr. are asked to review any home security video between 4:30 and 5 PM for a gold Honda Accord. ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email More like this Cocoa Beach Ron DiMenna, Founder of Ron Jon Surf Shop, Dies at 88 Ron DiMenna, founder of Ron Jon Surf Shop, has died at 88. From a single NJ store to a worldwide surf brand, his legacy shaped beach culture and conservation. September 7, 2025 Cocoa Beach Traffic Stop on Bicycle Leads to Major Drug Bust in Cocoa Beach COCOA BEACH, Fla. — What began as a routine traffic stop on a bicyclist... August 18, 2025 Cocoa Beach Traffic Stop Leads to Arrest of 13-Time Convicted Felon, Over 20 Grams of Fentanyl Seized From Under Child’s Car Seat A routine traffic stop this weekend turned into a major drug bust after a... July 7, 2025 Home 🚀 Advertise – Reach Brevard’s Most Engaged Audience! Events Register Beach Business Networking Seminar Causes Charity Christmas Community Entertainment Adult Air Shows Comedy Karaoke Kids Live Music Cover Bands Jazz Original Music Bands Parades Theater Plays Fairs Festivals Food Real Estate Auction Broker’s Open Open House Political Space Launch Sports Run Run/Walk Surfing Walk Submit a Story © Newspaper WordPress Theme by TagDiv"
    },
    {
      "url": "https://healthycoconuts.com/contact-us/",
      "text": "Contact Us | Healthy Coconuts Coconut Oil Coconut Milk Coconut Water Coconut Benefits Recipes Contact Us Coconut Oil Coconut Milk Coconut Water Coconut Benefits Recipes Contact Us Coconut Oil Coconut Milk Coconut Water Coconut Benefits Recipes Contact Us Top Insights Coconut Benefits Coconut Oil Coconut Oil Skincare Routine for Dry Skin April 23, 2025 Coconut Benefits Coconut Water Coconut Water During Pregnancy: Benefits and Safety Explained April 23, 2025 Coconut Water Happy Belly vs National Coconut Water Brands April 19, 2025 © Copyright 2025 Healthy Coconuts. | All rights reserved |  Powered by 401 Digital Get In Touch With Us Got Any Questions? We’re here to help—and we actually like talking to humans.  Whether you have questions about coconut products, need recipe tips, or just want to share your latest coconut experiment (success or disaster—we’ve been there), reach out. No bots, no scripted replies—just real people who love coconut as much as you do. Email contact@healthycoconuts.com We check this inbox daily and aim to reply within 24 hours. Home About Healthy Coconuts Contact Us Affiliate Disclosure Coconut Oil Coconut Milk Coconut Water © Copyright 2025 Healthy Coconuts. | All rights reserved |  Powered by 401 Digital"
    },
    {
      "url": "https://www.beachfc.com/about/leadership-staff/beach-fc-staff",
      "text": "Beach FC | Beach FC Staff Christine Crews Administrator EMAIL Tammy Renshaw Administrator EMAIL Karl Greaves ECNL Girls Director EMAIL Jason Niehoff Director, Advanced & Recreation EMAIL Wayne Pratt ECRL & NPL Director of Player Development Travel Boys U9-U14 EMAIL Ryan Sniegoski ECNL Boys Director Travel Boys U15-U19 EMAIL Mark Waite Director Soccer & Futsal EMAIL Steve Danbusky Executive Director Email Dennis Blackmore Tournament Director Columbus Day, Spring Classic EMAIL Proud Members Of Address Beach FC 3052 Buckner Blvd Virginia Beach, Virginia 23453 Phone: 757-689-3352 Contact Us Phone/Email Phone: 757-689-3352 Contact Us © Beach FC. All rights reserved. © Demosphere International, Inc. All rights reserved."
    },
    {
      "url": "https://www.coconutstanning.com/contact-form/",
      "text": "Contact | Coconuts Tanning Salon & Boutique Skip to content Leave Us A Review! ABOUT US PROMOTIONS (860) 257-8118 Book now HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP Menu ABOUT US PROMOTIONS Call Now Book Now Leave Us A Review! 860-257-8118 Book now Leave Us A Review! ABOUT US PROMOTIONS (860) 257-8118 Book now HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP Call Now Book Now 860-257-8118 Book now HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP coconuts tanning salon & boutique Contact Welcome to our professional spa salon where you can find any type of treatment for your specific needs or preferences! We'd love to hear from you Stay Connected Have a question for our team? Give us a call at 860-257-8118 or use the form below. Call Us Facebook Tiktok Instagram Google Visit Us 825 Cromwell Ave Rocky Hill, CT 06067 860-257-8118 Tan@coconutstanning.com Mon – Fri: 8:30 am – 8 pm Saturday: 9 am – 5 pm Sunday: 10 am – 1 pm DETAILS 50% Cancellation Fee applied to appointments canceled within 24 Hours. 100% Cancellation Fee applied to No Call/No Show Appointments. Questions? Leave A Message. Send Message Your #1 tanning destination located in Rocky Hill, CT. We pride ourselves on having some of the best sun beds and spray tan equipment in the industry. Stop by today. Hours Coconuts is open 7 days/week 8:30am – 8:00pm Mon-Fri 9:00am – 5:00pm Saturday 10:00am – 1:00pm Sunday Address Coconuts Tanning Salon & Boutique 825 Cromwell Avenue Rocky Hill, CT 06067 Driving Directions Navigation Menu HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP Contact Us Facebook-f Instagram Tiktok Twitter Pinterest Yelp (860) 257-8118 eNewsletter Sign Up © 2023 Coconuts Tanning Salon & Boutique. All Rights Reserved. | Coconuts Privacy Policy | Terms of Use Website Design & Marketing Done By Northland Marketing LLC Your #1 tanning destination located in Rocky Hill, CT. We pride ourselves on having some of the best sun beds and spray tan equipment in the industry. Stop by today. Hours Coconuts is open 7 days/week 8:30am – 8:00pm Mon-Fri 9:00am – 5:00pm Saturday 10:00am – 1:00pm Sunday Address Coconuts Tanning Salon & Boutique 825 Cromwell Avenue Rocky Hill, CT 06067 Driving Directions Navigation HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP HOME UV TANNING SPRAY TANS AIRBRUSH TANNING COMPETITION TANNING WAXING SPA & SALON SERVICES TEETH WHITENING EYEBROW & LASH SERVICES THREADING FACIALS & SKINCARE NAIL SERVICES MASSAGE, REFLEXOLOGY & REIKI HAIR STYLING SERVICES SMOOTHIES CONTACT SHOP Contact Us Facebook-f Instagram Tiktok Twitter Pinterest Yelp (860) 257-8118 eNewsletter Sign Up © 2022 Coconuts Tanning Salon & Boutique. All Rights Reserved. | Coconuts Privacy Policy | Terms of Use Website Design & Marketing Done By Northland Marketing LLC About Us AIRBRUSH TANNING Competition Tanning Contact EYEBROW & LASH SERVICES EYELASH EXTENSIONS FACIALS & SKINCARE Hair Styling Services Home Massage Services Nail Services Privacy Policy Promotions Smoothies Teeth Whitening Terms And Conditions Thank You Page THREADING UV Tanning WAXING"
    },
    {
      "url": "https://coconuts.co/contact/",
      "text": "CONTACT COCONUTS | Coconuts Skip to main content Skip to footer Menu Home About Us Advertising Announcements Contact Us Directory Editorial Policies Events Jobs Newsletters Podcast Grove: Coconuts Brand Studio [displaycurrentcat] Thursday | September 11, 2025 Coconuts Shop Newsletters Join Coco+ Login CONTACT COCONUTS How can we help you? For general inquiries, please email info@coconuts.co or fill out the form below. For advertising inquiries, please fill out the form in our Advertising Section . For COCO+ Membership inquiries, please email us at membership@coconuts.co or check out our FAQs . Your Name (Required) Your Email (Required) Your Message CAPTCHA Become a Patron Login Footer Company About Us Advertising Announcements Contact Us Directory Editorial Policies Events Jobs Newsletters Grove: Coconuts Brand Studio Our Cities Bali Bangkok Hong Kong Jakarta KL Manila Singapore Yangon Join COCO+ Pay what you want, starting at US$5 / year. Copyright © 2025 Coconuts Media Limited. All Rights Reserved. Terms Of Service Privacy Policy Back to top Home Popular Newsletters"
    },
    {
      "url": "https://www.pensacolacountryclub.com/meet-the-staff",
      "text": "Meet Our Team - Pensacola Country Club Drop Down Navigation Home About Our Club Club History Meet Our Team Contact Club Amenities Golf Golf Course Golf Instruction Meet Our Team Annual Calendar LGA Tennis Tennis Facility Meet Our Team Dining Menus Youth Aquatics Fitness Membership Wedding & Events Guest Information Menu Home About Our Club Club History Meet Our Team Contact Club Amenities Golf Golf Course Golf Instruction Meet Our Team Annual Calendar LGA Tennis Tennis Facility Meet Our Team Dining Menus Youth Aquatics Fitness Membership Wedding & Events Guest Information Member Login HTML Generator Meet Our Team Side Navigation Our Club Club History Meet Our Team Contact Our Club Club History Meet Our Team Contact Meet Our Team Meet Your Team Maggie Bleau, Director of Membership & Marketing Maggie Bleau joined Pensacola Country Club as the Director of Membership & Marketing in December 2024. From Maggie: \"I started my career in hospitality and the Marriott brand, from there I moved into private clubs at the Union League Club of Chicago as a Business Development Manager just about a decade ago.  It was in this role that I began to craft my skill set. The General Manager trained me to understand what it is to belong to a private club to sell memberships. For ninety days he had me mirror members, have conversations with every department head and many members, learn the storytelling, and know the history of the ULCC. I did regular tours of the clubhouse with the Director of the Art Collection to learn the artists and works we had. I could speak to every corner of the clubhouse. It was in this position that I knew I wanted to be more than a manager. I am a passionate leader that thrives on connecting people. I have successfully reopened an athletic club after a three-year delay in renovations; I have learned how to gracefully sell a club with two campuses and golf at two different country clubs. I am eager to meet you all and grow and engage the membership.\" Contact Maggie at [email protected] . Chris McCullar, Director of Racquets Chris McCullar is currently serving in his 20th year as the Director of Tennis at Pensacola Country Club. He has great passion for all of the programs offered at Pensacola Country Club, with Junior programming always being extremely active. Before his time in Pensacola, Chris was the Director of Tennis at The Club at Rock Creek in Fairhope, AL, where he developed the junior program into one of the best in the state. Chris attended Rhodes College in Memphis, TN, where he received his Bachelor of Arts and played #1 singles and doubles for three of his four collegiate years. He is also a formerly nationally ranked junior player, and formerly ranked #1 in the state of Alabama. Chris has a wife, Wendy and three children, Will, Max and Jackson. Contact Chris at [email protected] . Jennifer Naar, Events Coordinator Jennifer Naar is a Pensacola native and has served our Membership on our F&B Team since 2019. Having owned her own wedding planning and event details business since 2010, Jennifer has used her creativity and drive to help make each event memorable for all in attendance and has been a part of thousands of events locally over the last decade. She is excited to be the Events Coordinator at PCC and looks forward to putting on many beautiful and successful events. Contact Jennifer at [email protected] . Andrew Boston, Director of Golf Andrew joined the Pensacola Country Club staff in April of 2023 as the Director of Golf. Andrew attended high school in State College, Pennsylvania before graduating from the Professional Golf Management Program at Coastal Carolina University. Since graduating, he has spent time working at facilities such as Cherry Hills Country Club, Sea Island Golf Club, Ocean Forest Golf Club and, most recently, as the Head Golf Professional at the Old Town Club in Winston-Salem, North Carolina. He and his wife, Danielle, a former golf professional herself, have a son, Archer. They enjoy spending time exploring new restaurants, visiting the beach and playing golf together. Contact Andrew at [email protected] . Alex Marshall, Director of Greens & Grounds Alex joined the Pensacola Country Club team in December of 2023 as the Director of Greens & Grounds. Alex is a native of the Mississippi coast where he graduated high school. After a junior college baseball stint, Alex received his Bachelor of Science degree with a concentration in Golf and Sports Turf Management from Mississippi State University. Alex interned at facilities such as Fallen Oak, Old Waverly, and The Preserve Golf Club while getting his degree. Upon graduating, Alex spent 2016-2022 as an assistant superintendent at Old Overton Club. Alex and his wife, Taylor, moved to Gulf Breeze in January of 2022 for Alex to pursue the Superintendent role at Tiger Point Golf Club. Alex and Taylor have a daughter, Holly, who enjoys time at the beach, zoo, and long walks with her spaniels. Contact Alex at [email protected] . Bill Hewett, Executive Chef Chef Bill Hewett joined the Pensacola Country Club team in June 2024 relocating from Naples, Florida where he worked as Chef de Cuisine at Grey Oaks Country Club and Executive Chef at Cedar Hammock Golf and Country Club. He is a member of the American Culinary Federation and has over 25 years of culinary experience. After graduating from Johnson and Wales with a Degree in Culinary arts, he moved to Atlanta, Georgia where his past work experience included Cherokee Town and Country Club, Executive Chef at Augusta Country Club, Chef/Owner of Atlanta Culinary Concepts and Chef Instructor at Art Institute of Atlanta and Le Cordon Bleu, where he taught a variety of classes including cooking fundamentals, garde manger, international cuisines, American regional, catering and buffet courses. Bill is excited about joining the PCC team and looks forward to having a positive impact on the Culinary Program. Contact Chef Bill at [email protected] . Audrey Davida Thompson, Youth Director | Pool & Cabana Manager Audrey began working at Pensacola Country Club as the Assistant Pool & Cabana Manager in Spring of 2013, taking on the role of Youth Director in the fall of 2015. With more than 30 years of experience in the service industry and an equal number of years' experience working with children on a personal and a volunteer level, Audrey has involved herself with programs including the Junior Chamber of Commerce, CASA, Underprivileged Children's Christmas Charities, Farley Community Church VBS, and the Ronald McDonald House Charities. Audrey makes it a personal commitment to ensure that every child that comes to the Club has an enjoyable and memorable experience, and she takes great pride in watching our Club’s youth grow and flourish through these experiences. Audrey has four grown boys aged 36, 34, 32 and 25, and has one grandson whom she adores. For enjoyment, Audrey spends time on the water kayaking and sailing, learning to speak French, as well as exploring Pensacola on her bicycle. Contact Audrey at [email protected] . Jennifer Jens, BeachLIFE Fitness Coordinator Jennifer Jens is the owner and coordinator of BeachLIFE Fitness. Jennifer and her BeachLIFE Fitness team have tought fitness classes at Pensacola Country Club for almost a year with programs tailored to an array of interests and age groups. Jennifer received her BS in Exercise Science from Gonzaga University. She has recieved certifications in the following: ACSM Certified Personal Trainer; AFAA & NASM Group Fitness; YogaFit Hatha Yoga Instructor; Spinning Certified; Certified Children’s Coach; Registered DoD Contractor. Jennifer is now a Mom of 2 and US Airforce Wife with18 Years of Experience in Health and Fitness Industry. Contact Jenn at [email protected] . Josie Ynfante, Communications Director Josie is a Pensacola native who began working at Pensacola Country Club in 2018 on the Food & Beverage team while attending the University of West Florida for Marketing & Communications. She has since worked in various departments around the club from the pool, to the tennis center, to the front desk and more, gaining an understanding of all aspects of the club. Before coming back full time to serve as Communications Director in 2022, Josie also worked with the Studer Family of Companies. Josie is passionate about solving problems and developing creative and informative content to keep members and staff well-informed. In her free time, Josie enjoys spending time with her pets and husband, doing outdoor activities, and making art. Contact Josie at [email protected] . Mark Cooper, Building Superintendent Mark Cooper joined the Pensacola Country Club team in 2014 and has over 50 years of experience in the maintenance field, with a background in Electrical and AC maintenance. He worked in the building maintenance department at The Veranda of Pensacola and as a maintenance supervisor for local property managers. Mark retired from General Motors with 34 years of seniority in 2009 as a Job Setter/ Team Leader. He moved from the Ann Arbor / Detroit area to Pensacola in 2011 and resides in Milton with his wife, Teresa, and their spoiled pets. Contact Mark at [email protected] . Chance Caylor, Lead Assistant Superintendent ﻿Chance joined PCC as the Lead Assistant Superintendent in 2024 after starting his career at Ross Bridge of the Robert Trent Jones Golf Trail. He is an Auburn, Alabama native and supports anything involving the Auburn Tigers. Chance graduated from the University of West Alabama, and was a four-year letterman on the golf team. When he’s not on the golf course, whether working or playing, Chance and his wife, Devin, enjoy spending time with their dogs, cooking new foods, and being with friends. Lucas Pedrotti, Assistant Tennis Pro Lucas is originally from Caxias do Sul, Brazil where he was ranked the #1 player in his state and a top 20 player nationally. He came to the United States to play at Bloomberg University in Pennsylvania where he played 2 years at #1 singles and doubles and earned first team PSAC Conference Honors. He finished his playing career at the University of West Florida where he earned his degree in Finance in 2021. Lucas began his coaching career in 2016 in Brazil where he worked with low-income children teaching the game of tennis. He has worked locally at both the RG Tennis Academy in Pensacola and most recently at Shoreline Tennis Center in Gulf Breeze. Lucas brings an infectious positivity to his tennis instruction, and we are very excited about him being a member of our team. PENSACOLA COUNTRY CLUB 1500 Bayshore Drive,\r\n\t\t\t\t\t\t\t\t\t\t\t\tPensacola, Florida 32507 Contact (850) 455-7364 [email protected] Follow Us Copyright © Pensacola Country Club All Rights Reserved. Powered by Northstar Technologies Member Login"
    }
  ]
}