{
  "fuentes": [
    {
      "url": "https://www.cityofcocoabeach.com/522/Special-Events",
      "email": "andrea.segarra@cityofcocoabeach.com"
    },
    {
      "url": "https://chocolatefest.us/about/pcf-leadership-team/",
      "email": "info@chocolatefest.us"
    },
    {
      "url": "https://www.cocoabeach.com/contact/",
      "email": "customerservice@wctravel.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.vieravoice.com/calendar/cocoa-beach-friday-fest/event_93826cda-22e6-11ed-b597-576f09b16ec3.html",
      "email": "media@bluewatercreativegroup.com"
    }
  ],
  "mails": [
    "andrea.segarra@cityofcocoabeach.com",
    "customerservice@wctravel.com",
    "gabe@journeysherwood.org",
    "info@chocolatefest.us",
    "info@journeysherwood.org",
    "leadershipboard@journeysherwood.org",
    "media@bluewatercreativegroup.com",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "scott@journeysherwood.org"
  ],
  "nombre_sitio": "cocoabeachmainstreet.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cityofcocoabeach.com/522/Special-Events",
      "text": "Special Events | Cocoa Beach, FL - Official Website Skip to Main Content RIP CURRENT BEACH SAFETY WARNING High Risk of Rip Currents Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In How Do I... Government Services Residents Business Visitors Search Home Government Departments Leisure Services Special Events Special Events There are two types of Special Events in the City of Cocoa Beach. First are events that are run by City personnel. Examples of these are the Fall into Winter 5K Run, Breakfast with Santa, and the annual Easter Egg Hunt. The other type of events held within the City by organized and sponsored by outside parties. Examples of these would be the Easter Surf Contest and The Cocoa Beach Art Show. Want in hold a Special Event in Cocoa Beach? The City of Cocoa Beach celebrates special events for their contributions to cultural, community and economic growth. We are pleased you have selected Cocoa Beach as the site for your special event. Cocoa Beach strives to provide excellent customer service while facilitating your event needs. City Event Coordination staff oversee the outdoor special event permitting process. We serve as a resource to assist event organizers during event planning and will coordinate the collaborative involvement of City resources. Depending on the scope of your event, a number of City departments may be involved in the logistics necessary to produce a safe and successfully executed event. The Outdoor Special Event Permit Application will facilitate these requirements. The Special Event Resolution has been developed for you to use as a reference while you complete your application. The Resolution provides a review of the process and key information needed during the planning stages of your event. Application Process To begin the application process, submit the Special Events Application through the City’s OpenGov portal. Once received, City staff will review your submission and follow up with any requests for additional information or documentation. After all required materials have been provided, you will be invited to a Special Events Committee meeting. This meeting includes representatives from key City departments and is designed to review your event details, address safety considerations, and finalize logistics to help ensure a successful event. For complete information on hosting special events in the City of Cocoa Beach, including application requirements, fees, and approval processes, please refer to Chapter 14: Special Events of our Code of Ordinances. Below is a breakdown of documents and responsibilities associated with each stage of the process: Documents Required for the Special Events Committee Meeting: Complete site plan Complete parking plan (including property owner approvals, if applicable) Sanitation site plan (trash and portable toilets – number determined by the City) Dune protection plan (if required) Letter from upland property owner authorizing use of the location (if required) Notification letter or postcard to surrounding businesses/residents (if required by ordinance) Proof of insurance naming the City of Cocoa Beach as an additional insured Security needs (number of officers determined by Police and Fire Departments) Documents Required Before the Permit Can Be Issued: All required items listed above must be on file Sea Turtle Lighting Permit (if event occurs between March 1 and November 1) Proof of Temporary Business Tax Receipts for all event vendors Payment of all applicable City fees Event Promoter Responsibilities: Schedule building inspections, if required Schedule Fire inspections, if required Schedule lifeguards through Brevard County, if required Post-Event Requirements: Remove all signs and banners within 24 hours of event completion Clean up the event site immediately after the event ends Remove all trash cans and portable toilets within 24 hours (or by the following Monday if the event ends on a weekend or holiday) If you have any questions, please contact the City Event Coordination Staff at 321-868-3252 or via email . We are here to support you throughout the planning process and look forward to helping make your event a success in the City of Cocoa Beach. Contact Us Recreation Center 321 Ramp Road Cocoa Beach, FL 32931 Ph: 321-868-3274 Hours Monday through Thursday 9:00 AM to 9:00 PM Friday 9:00 AM to 5:30 PM Closed on the weekends and all major holidays. Special Events Calendar Tue, Oct. 14 Coffee with the City Manager Tue, Nov. 11 Coffee with the City Manager View All Events /Calendar.aspx Aquatic Center Aquatic Center Classes/Programs Aquatic Center Fees & Rentals Aquatic Center Rules & Regulations Cocoa Beach Country Club A Public Facility 19th Hole Course Rates Leagues Programs Frightful Fairway 5K (Fall Into Winter 5K) Pickleball Sports Venues Ball Fields Cocoa Beach SkatePark Offenhauser Recreation Center - Gym Tennis Club Parks Parks with Beach Access Neighborhood Parks Boat Ramps Parks with Tennis & Pickleball Courts Green Space Parks Maritime Hammock Preserve Dog Park Weddings and Receptions Special Events Beaches Beach Access Beach Parking Beach Rules Beach Safety Drown Zero Agendas & Minutes Parking Sign Up for CBNN Events Calendar Report a Concern Public Safety Contact Us City Hall 2 S. Orlando Ave P.O. Box 322430 Cocoa Beach, FL 32932-2430 Business Hours: 8:30am-4:30pm Phone: 321-868-3200 City Directory (Link) Email Disclaimer (Link) Quick Links Departments Boards & Committees FAQ's Brevard County State of Florida /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://chocolatefest.us/about/pcf-leadership-team/",
      "text": "PCF Leadership Team - Paradise Chocolate Fest Home About Gallery Fest Thinks Green Foundation History & Achievements PCF Leadership Team Rediscover The Ridge Contact Events Buy Tickets at the Fest! Event Schedule Fest Fun For All Ages Chocolate, Wine & Brew & Spirits! Paradise Chocolate Fest Chocolate Cuisine Challenge All About Books! Young Authors Writing Contest Chocolate Thunder Motorcycle Run Chocolate Chase Get Involved Donate Paradise Camp Fire Book To Participate Beneficiaries Vendors Volunteer Get There Sponsors Become A Sponsor Press Paradise Chocolate Fest A benefit for non profit youth organizations on the ridge! PCF Leadership Team 2025 Youth on the Ridge Community Foundation / Paradise Chocolate Fest Leadership Team Paradise Chocolate Fest Founders, Bill & Pam Hartley, owners, Joy Lyn’s Candies Youth on the Ridge Community Foundation / Paradise Chocolate Fest Executive Director, Debbie LaPlant Moseley Youth on the Ridge Community Foundation / Paradise Chocolate Fest Board of Directors President, Bryon Dixon, Mission Linen Vice President, Hope Stambaugh, Thomas Welding & Manufacturing Secretary, Barbara Triebswetter, Paradise Piranhas Swim Team Treasurer, Dana Donnallen, 5th Sun retired Directors Sarah Hansen, Chico Unified School District Meg Helms, Tri Counties Bank Carol Peterson, Publisher Paradise Post Newspaper, retired Paradise Chocolate Fest Advisory Committee Tom Baker, Attorney at Law Jessica Cummings, Graphic Designer Steve Ferchaud, Artist Patti Lloyd, Paradise Art Center Bruce Murray, owner Technigraphics Kevin Spellman, Captain San Rafael Fire Department, Retired Jon Warren, partner Matthews, Hutton and Warren CPAs Jason Weinrich, Watershed Media 2025 Beneficiaries - Achieve Charter School, Boy Scouts Troop 316, Cub Scouts Pack 316, Friends of Outdoor Adventures, Gold Nugget Museum, Northern California Ballet, Paradise Elks Lodge, Paradise Friends of the Library, Paradise High School Cheer, Paradise Host Lions Club, Paradise Piranhas Swim Team, Paradise Recreation & Park District, Paradise Rotary Interact, Paradise Stronger, Paradise Veterans American Legion, Rainbow Girls & Ridgeview High School. For additional information, please contact: Debbie LaPlant Moseley, Executive Director Youth on the Ridge Community Foundation / Paradise Chocolate Fest, IRS Tax Exempt - # 27-0772654 P.O. Box 8188 Chico, CA 95927 • 530/342-4896 • info@chocolatefest.us • www.chocolatefest.us Paradise Chocolate Fest © 2025 | Paradise Chocolate Fest Site Developed By MC2"
    },
    {
      "url": "https://www.cocoabeach.com/contact/",
      "text": "Get In Touch With Us . . . | CocoaBeach.com Facebook X Instagram Pinterest Cocoa Beach 77 ° overcast clouds humidity: 92% wind: 12mph NNE H 83 • L 79 82 ° Fri 82 ° Sat 82 ° Sun 81 ° Mon Weather from OpenWeatherMap stay Find the Perfect Hotel in the Cocoa Beach Area! play Outdoor Adventures At The Beach… Charter Fishing Nature & Eco-Tours Wind & Water Sports Golfing Area Attractions Arts & Culture Museums & Historic Sites Performance Theatres Health & Beauty Salons & Spas Tattoo Shops Shopping Surf & Skate Shops Apparel & Accessories Galleries, Gifts & Home Decor Shopping Malls Specialty Shops dine Area Restaurants Bars & Clubs events more MEDIA Photo Gallery Video Album COMMUNITY Relocation Guide Area Churches Our History TRAVEL TOOLS Airport, Bus & Train Info Driving Directions Search Get In Touch With Us . . . HOTEL BOOKINGS: For help or questions regarding online hotel reservations, e-mail customerservice@wctravel.com or call and speak with a customer care representative. Give Promo Code 15198 when calling. * Reservations Center Hours: Open 24 Hours a Day, 7 Days a Week * Customer Service is available Monday through Friday, 8 AM through 8 PM, CST * TOLL FREE 1-888-254-0637, USA and Canada * International Toll Free 00-800-84469370 or 1-210-507-5997 GENERAL COMMENTS AND QUESTIONS: CocoaBeach.Com is happy to assist you with any questions you may have, and we appreciate your valuable feedback about how we can serve you better. Feel free to ask a question, report an error on the site, or send your comments or suggestions about our site by filling out the following form. Your Name (required) Your Email (required) Your Message 13 + 7 = Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video File Upload Show menus, flyers, forms and more to your customers File Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly on front page Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video File Upload Show menus, flyers, forms and more to your customers File Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly on front page Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video File Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × Listing Plans Address/Phone Address/Phone Map & Directions Map & Directions Ratings & Reviews Ratings & Reviews Business Description Business Description Images Images Website Link Website Link Email Inquiries Let potential customers email you right from your listing Email Inquiries Send to Friends Allows visitors to send their friends a link to your listing Send to Friends Hours of Operation Hours of Operation Pmt. Types Accepted Let customers know what credit cards/payments you accept Pmt. Types Accepted Digital Coupons Give potential customers somethings they REALLY want...COUPONS! Digital Coupons Social Media Links Direct users to your Facebook & Twitter pages Social Media Links YouTube Video Embed a YouTube video on your listing page YouTube Video Menu Upload Menu Upload Preferred Position Appear at the top of your listing category Preferred Position Front Pg. Highlight Appear randomly in Featured Listings on front page! Front Pg. Highlight Category Billboard Ad FREE 300x150 Display Ad in Your Category! Category Billboard Ad basic $69 per month Address/Phone Map & Directions Ratings & Reviews Business Description 350 Characters Images 3 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up classic $199 per month Address/Phone Map & Directions Ratings & Reviews Business Description 750 Characters Images 7 Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons 1 Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up epic $299 per month Address/Phone Map & Directions Ratings & Reviews Business Description Unlimited Images Unlimited Website Link Email Inquiries Send to Friends Hours of Operation Pmt. Types Accepted Digital Coupons Unlimited Social Media Links YouTube Video Menu Upload Preferred Position Front Pg. Highlight Category Billboard Ad sign up × X"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.vieravoice.com/calendar/cocoa-beach-friday-fest/event_93826cda-22e6-11ed-b597-576f09b16ec3.html",
      "text": "Cocoa Beach Friday Fest | Calendar | vieravoice.com Skip to main content Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home About Us Contact Us Advertise Viera Means Business Events Viera Today Business People on the Move Columnists Beyond the Curb Lagoon Straight Talk Inside the Ropes Charlotte's Web The Pantry Rat Community Food Health Schools Sports Photos Videos e-Edition Kids News Site search Search About Us Contact Us Advertise Viera Means Business Events Directory Facebook Job Listings Senior Life 77° Mostly Cloudy Melbourne, FL (32940) Today Mostly cloudy this morning. Scattered thunderstorms developing this afternoon. High near 85F. Winds NNE at 10 to 20 mph. Chance of rain 50%.. Tonight Scattered thunderstorms during the evening. Cloudy skies after midnight. Low 76F. Winds N at 5 to 10 mph. Chance of rain 40%. Updated: September 11, 2025 @ 8:26 am Full Forecast Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Site search Search Home About Us Contact Us Advertise Viera Means Business Events Viera Today Business People on the Move Columnists Beyond the Curb Lagoon Straight Talk Inside the Ropes Charlotte's Web The Pantry Rat Community Food Health Schools Sports Photos Videos e-Edition Kids News This event has passed free Cocoa Beach Friday Fest This event occurred on\n            \n\n            \n                Friday, September 16th, 2022\n                \n                    @ 6:00 pm – 10:00 pm Downtown Cocoa Beach Free http://facebook.com/events/1360241961129500 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Theme is Making Honkytonk Great Again. Street party with live music by the Blue Diamond Band.  Craft vendors, food trucks and DJ Tom Tritt. Past dates Fri, Sep 16, 2022 @ 6:00 pm Download schedule Schedules Occurred Friday, September 16th, 2022 @ 6:00 pm – 10:00 pm Venue Downtown Cocoa Beach Minutemen Causeway Cocoa Beach, Browse Nearby Restaurants Shopping Coffee Movie Theaters ATMs Gas Stations Contact Cocoa Beach Main Street 321-693-3159 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Signature Events Viera Bright Lights Battle - Dec. Boomer Bash/Senior Expo Scarecrow Stroll -October 1 Event Calendar Sep 11 Patriot Day Remembrance Ceremony Thu, Sep 11, 2025 Sep 11 World Trade Center Memorial at the Avenue Viera Thu, Sep 11, 2025 Sep 12 Annual Blingo Movie Night Fundraiser Fri, Sep 12, 2025 Sep 13 Turtle Krawl 5K Sat, Sep 13, 2025 Read more Facebook YouTube Sections Home Business Community Schools Sports Events Viera Today Photos Videos Services Place an Ad Promote Your Event Business Directory Search Weather Advertise with Us Contact Information vieravoice.com 7350 Shoppes Drive, Suite 102 Melbourne, FL 32940 Phone: 321-242-1235 Email: media@bluewatercreativegroup.com × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Bluewater Creative Group 7350 Shoppes Drive, Suite 102, Melbourne, FL | Privacy Policy"
    }
  ]
}