{
  "fuentes": [
    {
      "url": "https://tampamagazines.com/directory-restaurants/listing/coconut-charlies-beach-bar-grill/",
      "email": "logo_darkmode@2x.png"
    },
    {
      "url": "https://www.visitpanamacitybeach.com/partners/contact-us/",
      "email": "info@visitpanamacitybeach.com"
    },
    {
      "url": "https://www.visitpanamacitybeach.com/partners/contact-us/",
      "email": "publicrecords@visitpanamacitybeach.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "emilyh@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "angie@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "annemarie@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "ashley@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "carolina@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "colleen@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "davis@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "erica@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "gary@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "gerry@ommac.co.uk"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "jeff@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "joanne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "josh@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "juliek@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "laurenb@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "lynne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "mary@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "oleg@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "rich@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "rob@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "sean@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "suzanne@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "tammy@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "todd@visitgreaterps.com"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "email": "will@visitgreaterps.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    }
  ],
  "mails": [
    "angie@visitgreaterps.com",
    "annemarie@visitgreaterps.com",
    "ashley@visitgreaterps.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "carolina@visitgreaterps.com",
    "cdungca@diamondheadtheatre.com",
    "colleen@visitgreaterps.com",
    "davis@visitgreaterps.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "emilyh@visitgreaterps.com",
    "erica@visitgreaterps.com",
    "gary@visitgreaterps.com",
    "gerry@ommac.co.uk",
    "info@visitpanamacitybeach.com",
    "jeff@visitgreaterps.com",
    "jmartin@diamondheadtheatre.com",
    "joanne@visitgreaterps.com",
    "josh@visitgreaterps.com",
    "juliek@visitgreaterps.com",
    "kmatsuno@diamondheadtheatre.com",
    "laurenb@visitgreaterps.com",
    "logo_darkmode@2x.png",
    "lynne@visitgreaterps.com",
    "mary@visitgreaterps.com",
    "oleg@visitgreaterps.com",
    "productions@diamondheadtheatre.com",
    "publicrecords@visitpanamacitybeach.com",
    "rich@visitgreaterps.com",
    "rob@visitgreaterps.com",
    "rtandal@diamondheadtheatre.com",
    "sean@visitgreaterps.com",
    "suzanne@visitgreaterps.com",
    "tammy@visitgreaterps.com",
    "todd@visitgreaterps.com",
    "vgreen@diamondheadtheatre.com",
    "will@visitgreaterps.com"
  ],
  "nombre_sitio": "coconutcharliespanamacitybeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tampamagazines.com/directory-restaurants/listing/coconut-charlies-beach-bar-grill/",
      "text": "Coconut Charlie's Beach Bar & Grill - Tampa Magazine No Result View All Result Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture ADVERTISE SUBSCRIBE ABOUT PURCHASE A COPY DIGITAL ISSUES EMAIL NEWSLETTERS CONTACT US SHOP MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout No Result View All Result No Result View All Result Coconut Charlie's Beach Bar & Grill by April 24, 2025 Share on Facebook Share on Twitter All Listings 2020-21 Tampa Bay Charity Register > Coconut Charlie's Beach Bar & Grill Coconut Charlie's Beach Bar & Grill Category: 2023 Best Beach/Waterfront Restaurant Best New Restaurant Best Seafood Restaurant Coconut Charlie's Beach Bar & Grill 6100 Gulf Blvd St Pete Beach FL 33706 (727) 360-7041 Visit Website Back to All Listings Back to Charity Register 6100 Gulf Blvd, St Pete Beach, FL 33706 St Pete Beach [instagram-feed] Next Post Black Friday Deals in Tampa Bay Local Knowledge Food & Drink Home & Garden Travel Moving Tampa Sporting Health Tampa Culture Advertise About Subscribe Purchase a Copy Digital Issues Email Newsletters Contact Privacy Policy © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network. No Result View All Result Tampa Culture Food and Drink Home & Garden Travel Moving Tampa Sporting Health Local Knowledge Advertise About Subscribe Purchase a Copy Shop Digital Issues Email Newsletters Contact MY ACCOUNT Your Membership Profile Update Billing Card Login / Logout © 2023 Tampa Magazine. All rights reserved. Part of the Tampa Magazines Network."
    },
    {
      "url": "https://www.visitpanamacitybeach.com/partners/contact-us/",
      "text": "Contact us | Panama City Beach Staff Contact Information Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip to main content MENU CLOSE SEARCH SEARCH CLOSE Follow Us At Home Bucket List Chasin' the Sun TV Fishing Resources Hosts Season 1 Season 2 Episode Five Episode Eight Episode Eleven Episode Four Episode Nine Episode One Episode Seven Episode Six Episode Ten Episode Thirteen Episode Three Episode Twelve Episode Two Season 3 Episode 1 Episode 10 Episode 11 Episode 12 Episode 13 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 8 Episode 9 Season 4 Episode Eight Episode Eleven Episode Five Episode Four Episode Nine Episode one Episode Seven Episode Six Episode Ten Episode Thirteen Episode Three Episode Twelve Episode two Season 5 Episode Eight Episode Eleven Episode Five Episode Four Episode Nine Episode One Episode Seven Episode Six Episode Ten Episode Three Episode Twelve Episode Two Season 6 Episode Eight Episode Eleven Episode Five Episode Four Episode Nine Episode One Episode Seven Episode Six Episode Ten Episode Three Episode Twelve Episode Two Season 7 Episode 1 Episode 10 Episode 11 Episode 12 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 8 Episode 9 Season 8 Episode 1 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Season 9 Episode 1 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 8 Episode 9 Episode 10 Season 10 Episode 1 Episode 2 Episode 3 Episode 4 Episode 5 Episode 6 Episode 7 Episode 8 Special Offers Sponsors Where To Watch Location & Festival Info Chasin' the Sun Photo Galleries Festival Schedule Special Offers Media Contact Information Press Kit Press Kits Press Photos Press Releases Request Assistance Story Ideas Military Partners Contact Us Career Opportunities Partner Login Request a Partner Account Pitch Us an Idea Resources Beach Safety Industry Resources Marketing Resources Request for Qualifications Tourist Development Council Visitor Research Hurricane Information Pier Park Attractions Events Restaurants Stores Sales UNwineD Buy Tickets Location & Event Info Special Offers Recipes Fun For All Move with Joy - Mobility Access Feel the Vibe - Visual Support Catch a Wave - Hearing Support Chill at Will - Neurodiversity Support MENU CLOSE Contact Us Partner Login Pitch Us an Idea Resources Contact Us Partner Login Pitch Us an Idea Resources CLOSE Partners | Contact Us | Share Contact Us The Visitors Information Center for Panama City Beach, Florida is located at 17001 Panama City Beach Parkway. The administrative offices are open 8 a.m. to 5 p.m., Monday through Friday. Call (850) 233-5070 to reach the administrative office or email info@visitpanamacitybeach.com . Toll Free: 1-800-PCBEACH (722-3224) Canadian Toll-Free: 1-800-553-1330 Public Records Request Public record requests for Panama City Beach Convention & Visitors Bureau, Inc. dba Visit Panama City Beach are to be submitted to: Ms. Sharon Cook, Director of Administration, and Records Custodian 17001 Panama City Beach Parkway, Panama City Beach, Florida 32413 (850) 233-5070 If you would like to submit a public records request via email, please email publicrecords@visitpanamacitybeach.com . Visit Panama City Beach Staff Here at the Real. FUN. Beach., we have a Real. FUN. Team! While we’re all unique in our own special ways, the team at Visit Panama City Beach share one thing in common: our love for Panama City Beach! Whether we’re reminiscing at PCB gems like Goofy Golf, grabbing the best seafood along the Gulf Coast at a beachfront restaurant or enjoying a boat ride to Shell Island, our staff knows just how to PCB! Take a look around and get to know us, and don’t forget to stop by and let us know how you PCB! Administration Dan Rowe President & CEO \"I love looking at things from different perspectives. There is no better way to understand the lay of the land and feed my need for adventure than taking a ride with panhandle helicopters.\" Richard Sanders Vice President of Special Projects \"From award winning cuisine to world class entertainment events, Panama City Beach offers it all!\" Aaron Lee Vice President of Administration \"Capt. Anderson’s is the perfect place for me to unwind with my friends & family while enjoying one of the most extensive and exclusive wine and champagne list in the country. It's always a great time at Capt. Anderson’s when you have a combination of good friends, great food & amazing wine\" Sharon Cook Director of Administration \"The reason I moved to PCB in 2008….The Salt Water! Adventures at Sea is the best place to have salty fun on the salty water.\" Terri Hogg Administrative Services Manager \"For me there is no better way to experience a sunset than at Panama City Beach!\" Julie Gordon Film Commissioner \"Lights, Camera, & always so much action at the Real. Fun. Beach.\" Marketing Jayna Leach Senior VP of Marketing & Chief Marketing Officer \"Real. FUN. Shopping at Pier Park with Baybee the Bully makes for the perfect day in PCB!\" Michaelean Stewart Director of Interactive Marketing \"There is nothing better than taking the boat out to Shell Island and enjoying the turquoise water of PCB!\" Sydney Clifton Communications & Social Media Manager \"From carefree weekends as a child to relaxing moments as an adult, St. Andrews State Park's jetties have always been my happy place.\" Antonia Scharpe Marketing Coordinator \"Spending time with Ollie at the PCB dog beach is my favorite way to enjoy the day!\" Special Events Patrick Stewart Director of Special Events \"No better way to relax than fishing on the World's Most Beautiful Beaches.\" Paola Caballero Special Events Operations Manager \"White sand beaches, clear blue waters, and endless sunshine—there’s no better place to soak up the beauty of Florida than right here in PCB!\" Sage Mickey Special Events Coordinator \"There is no better way to experience the true essence of Real Fun Beach than soaking up the sun in St. Andrews State Park.\" Sports Chris O'Brien Director of Sports Marketing \"I love that you can go from the beach to birdwatching in the park in a matter of steps.\" Justin Kelley Sports Marketing Operations Manager \"As a past college baseball player, I enjoy spending the weekend watching baseball at the Publix Sports Park!\" Kristen Krasinskas Sports Business Development Manager \"From playing kickball at Publix Sports Park to reading on the beach, you can find me outside enjoying the warm PCB sunshine!\" Sales Steve Bailey Vice President of Sales \"As a boating enthusiast, I love Chasin' The Sun in Panama City Beach!\" Helen Adami Director of Destination Sales \"Living in PCB means I'm just steps away from a tropical paradise.\" Lauren Jenkins Sales Coordinator \"Tennis has always been a favorite activity of mine, and the courts at Frank Brown Park provide the perfect place for me to work on my serve! Just minutes away from the water, I love to wind down after a good match at the Real. Fun. Beach.\" Visitor Services Barrie Ainslie Director of Visitor Services \"The beautiful lodge & moss covered oak trees at Camp Helen offer a unique side of Panama City Beach.\" Traci Smith Visitor Information Specialist \"Dat Cajun Place-one of my favorite places on the beach that makes me feel like I’m “back home”.\" Bill Poteet Visitor Information Specialist \"The Pier at St. Andrews State park provides views of both the natural beauty of Panama City Beach, and its modern skyline.\" Leah Blissitt Visitor Services Specialist \"Pier Park is my entertainment go to place for REAL FUN, and the beach is right across the street.\" Pam Swafford Visitor Services Specialist \"Growing up here in the 70s meant meeting friends at the County Pier and spending endless hours in the sun, sand, and surf!  The County Pier is a great place to make memories!\" Contact Us Media Film Office Partners Sitemap Privacy Policy Real.Fun.Beach.Store © 2025 Travel PCB 17001 Panama City Beach Pkwy, Panama City Beach, FL 32413 * Phone: 850-233-5070 * Toll Free: 1-800-722-3224"
    },
    {
      "url": "https://www.visitgreaterpalmsprings.com/about-us/our-team-and-board/",
      "text": "Team & Board - Visit Greater Palm Springs Skip navigation Skip to main content Meetings Weddings Wedding Venues Iconic & Unique Homes Unique Venues Bachelorette Parties Honeymoons & Romantic Getaways Wedding Vendor Services Contact Us Travel Trade Getting Here Brochures & Promotional Materials What's New Media Library Resources & Training Itineraries Contact Us Media Press Releases In The News Media Library Media Assistance What's New Influencer Collaboration Request In the news featured Film Film Permits Services Location Information Contact Partner Portal Meetings Weddings Travel Trade Media Film Partner Portal Meetings Weddings Travel Trade Media Film Partner Portal Things To Do Attractions & Activities Acrisure Arena The Living Desert BMW Performance Center Palm Springs Aerial Tramway Palm Springs Air Museum Date Farms Sunnylands Windmills Moorten Botanical Garden Forever Marilyn Arts & Culture Native American Culture Agua Caliente Cultural Plaza Murals Palm Springs Art Museum Museums Art Galleries Movie Theaters Architecture Theater & Performing Arts Hiking & Trails Waterfalls San Jacinto Peak Palm Springs Aerial Tramway Tahquitz Canyon Indian Canyons Outdoors & Recreation ATV & Off-Road Rentals Stargazing Tennis Pickleball Hot-Air Ballooning & Air Tours Rock Climbing & Bouldering Horseback Riding & Polo Biking & Bike Rentals Footgolf Motorbike Rentals California Deserts Hot Springs Spas, Beauty & Wellness Spa Month Spas Resort Spas Natural Mineral Water Spas Mobile Spas Day Spas Golf Shopping El Paseo Shopping District Outlet Malls Farmers Markets Antique & Vintage Shopping Dog-Friendly Dog Friendly Hotels Dog Friendly Dining Dog Parks & Hiking Tours Midcentury Modern Tour Jeep & Humvee Sightseeing Free Things To Do Things To Do With Kids Events Events & Festivals Club Skirts Dinah Shore Weekend Modernism Week Joshua Tree Music Festival Acrisure Series Palm Springs International Film Festival The American Express La Quinta Art Celebration Greater Palm Springs LGBTQ+ Pride BNP Paribas Open Fashion Week El Paseo The Galleri Classic Coachella Valley Music & Arts Festival Stagecoach Country Music Festival Desert X Splash House Spa Month This Weekend Concerts & Live Music Food Festivals Art Festivals Film Festivals Submit An Event Restaurants & Nightlife All Restaurants Kid Friendly Casual Dining Fine Dining Dog-Friendly Restaurants Breakfast & Brunch Ice Cream & Sweets Nightclubs & Lounges Craft Breweries & Distilleries Casinos & Entertainment Happy Hours Sports Bars Wine DineGPS Newsletter Places To Stay Hotels & Resorts Vacation Rentals LGBTQ Hotels Luxury Hotels Hot Mineral Water Spa Hotels Pet Friendly Hotels Budget Friendly & Moderate Boutique Hotels & Inns RV Resorts & Rentals Timeshares Packages & Deals Plan Free Visitors Guide E-Newsletter Spa Month Summer Travel Sun Seeker Mindful Foodie Culture Connoisseur Enlightened Traveler Taste Trailblazer Nature Lover Community And Culture Accessible Travel Accessible Attractions Autism Travel LGBTQ+ Getaway Offers In The News Deals Spa Month Happy Hours Staycation Trip Ideas & Itineraries 3 Day Weekend In Greater Palm Springs Day Trip in Greater Palm Springs Relocation & Resources Digital Guides Travel Tips Work Remote Sustainability Original Video Series Weather Getting Here & Around Charging Stations Car Rentals and Transportation Visit Greater Palm Springs App Coachella Valley Cathedral City Places To Stay Things To Do Restaurants Coachella Restaurants Casinos & Live Entertainment Community Parks Desert Hot Springs Places To Stay Restaurants Mineral Water Day Pass Things To Do Indian Wells Places To Stay Spa Experiences Golf Restaurants Tennis Meetings & Events Say \"I do\" Indian Wells Blog e-newsletter Indio Places To Stay Things To Do Restaurants Vacation Rentals La Quinta Places To Stay Things To Do Restaurants Palm Desert Places To Stay Things To Do Restaurants Palm Springs Places To Stay Things To Do Restaurants Rancho Mirage Places To Stay Things To Do Restaurants Blog Things To Do Events Restaurants & Nightlife Places To Stay Plan Coachella Valley Blog Things To Do Events Restaurants & Nightlife Places To Stay Plan Coachella Valley Blog Search Home About Us Our Team & Board Share Team & Board JPA Executive Committee Joint Powers Authority (JPA) Executive Committee Waymond Fermon JPA  Executive Committee Chair Council Member, City of Indio Linda Evans JPA Executive Committee Vice Chair Mayor, City of La Quinta Nancy Ross JPA Executive Committee Member Mayor, City of Cathedral City Gary Gardner JPA Executive Committee Member Mayor Pro Tem, City of Desert Hot Springs Dr. Frank Figueroa JPA Executive Committee Member Council Member, City of Coachella Brian Penna JPA Executive Committee Member Council Member, City of Indian Wells Jan Harnik JPA Executive Committee Member Mayor, City of Palm Desert Jeffrey Bernstein JPA Executive Committee Member Council Member, City of Palm Springs Ted Weill JPA Executive Committee Member Mayor, City of Rancho Mirage V. Manuel Perez JPA Executive Committee Member 4th District Supervisor, County of Riverside Board of Directors Visit GPS Board of Directors Rolf Hoehn Board of Directors Chair Director of Business Development, Indian Wells Tennis Garden Peggy Trott Board of Directors Vice Chair ​General Manager, Kimpton Rowan Palm Springs Aftab Dada Treasurer Managing Director, Hilton Palm Springs Kate Anderson Board Member Director of Public Relations, Agua Caliente Band of Cahuilla Indians Lorraine Becker Board Member Advisory Council Member, Cabot's Pueblo Museum Sejal Bhakta Board Member Owner/Operator, Hampton Inn & Suites John Bolton Board Member Senior Vice President, Oak View Group Celeste Brackley Board Member General Manager, The Line & Saguaro Hotels Gary Cardiff Board Member Owner/President, Cardiff Limousine & Transportation Kenny Cassady Board Member Director of Business Development, Acme House Company Jay Chesterton Board Member Vice President of Hotel Operations and Food & Beverage, Fantasy Springs Resort Casino Dermot Connolly Board Member General Manager, La Quinta Resort & Club Tim Ellis Board Member Emeritus Principal, Ellis Hospitality Services Eddy Estrada Board Member Owner, Smarter Property Management ​ David Feltman Board Member Co-Founder, VRON of Palm Springs Shannon Gilbert Board Member General Manager, The Ritz-Carlton, Rancho Mirage Mark Girton Board Member VP/General Manager, Goldenvoice & Empire Polo Rob Hampton Board Member General Manager, Palm Springs Convention Center Dan Johnson Board Member General Manager, Grand Hyatt Indian Wells Resort & Villas Jerry Keller Board Member Owner, Lulu California Bistro Patrick Klein Board Member General Manager, The Gardens on El Paseo / El Paseo Village Kelly McLean Board Member Co-Owner, Poppy Vacation Rentals Nusrat Mirza Board Member General Manager, JW Marriott Desert Springs Resort & Spa Allen Monroe Board Member President/CEO, The Living Desert Lee Morcus Board Member Emeritus Owner, Kaiser Restaurant Group Liz Ostoich Board Member Owner, FARM and Tac/Quila Restaurants Brad Poncher Board Member Mentor/Consultant, Homewood Suites by Hilton La Quinta Greg Purdy Board Member VP of Marketing and Public Affairs, Palm Springs Aerial Tramway Tim Pyne Board Member General Manager, Renaissance Esmeralda Resort & Spa Saverio Scheri Board Member COO, Agua Caliente Casinos Bob Schneider Board Member Principal, Desert Consulting Ankit Sekhri Board Member General Manager, Two Bunch Palms Resort & Spa Barb Smith Board Member Partner, Eventis Destination Services Boris Stark Board Member CEO, Palm Desert Vacation Properties Ebony Stinson Board Member General Manager, DoubleTree by Hilton Golf Resort Palm Springs Joseph Tormey Board Member Director of Hospitality Program, CSUSB Palm Desert Campus Doug Watson Board Member CEO, Strategy | Innovation | Co. Staff Executive, Finance & Operations Executive Office Scott White President/CEO Sarah Goslin Executive Assistant & Board Administrator Finance & Administration Brian Kelty Vice President, Finance & Administration Andy Cloutier Director of Human Resources Jorge Rodriguez Accounting Manager Dan Tackett Staff Accountant Siong Teo Staff Accountant Operations Stefanie Kilcoyne Director of Technology and Operations Rebecca Kirkpatrick Analytics Manager Carlos Lerma Property Maintenance Manager Samuel Espinoza Help Desk Manager Cameron Vaughan Front Desk | Visitor Assistance Convention Sales Convention Sales Colleen Pace Chief Sales & Marketing Officer colleen@visitgreaterps.com Carolina Viazcan Vice President Of Sales carolina@visitgreaterps.com Rob Osterberg Director of Sales Operations Specialty Accounts/Sports rob@visitgreaterps.com Tammy Bucklin Director of Sales Southwest/Southern California tammy@visitgreaterps.com Anne Marie Mourhess Director of Group Sales Northern California & Pacific Northwest annemarie@visitgreaterps.com Lynne Bowis, CMP Director of Sales & Business Development lynne@visitgreaterps.com Will Trokey, CMP National Accounts Director Mid-Atlantic will@visitgreaterps.com Suzanne Aed National Accounts Director Mountain States/ Los Angeles/Orange County suzanne@visitgreaterps.com Mary Ryan National Accounts Director Midwest Region/International Meeting Requests mary@visitgreaterps.com Angie Day, CMP National Accounts Director Northeast & Canada angie@visitgreaterps.com Rich Ainsworth Small Meetings Manager rich@visitgreaterps.com Ashley Owens National Sales Manager Southeast ashley@visitgreaterps.com Emily Heggernes National Sports Sales Manager EmilyH@visitgreaterps.com Emily Alvarez-Zurita Convention Sales Coordinator Merve Gusroy Sales Data Specialist Rozanne Sutherland Convention Sales Coordinator Destination Experiences Destination Experiences Kahlia Gainey Senior Destination Experiences Manager Jackie Vega Senior Community Events Manager Elizabeth Jamison Destination Experiences Manager Marta Battle Destination Experiences Manager Alex Mercado Assistant Destination Experiences Manager Lauren Taylor Destination Experiences Specialist Melissa Bernal Destination Experiences Coordinator Yvonne Gonzalez Destination Experiences Coordinator Tourism Development Tourism Development Gary Orfield Director of Tourism Development gary@visitgreaterps.com Gerry Boyle Tourism Development Manager gerry@ommac.co.uk Joanne Ohanesian Tourism Development Manager joanne@visitgreaterps.com Julie Kawaguchi Tourism Development Manager juliek@visitgreaterps.com Oleg Nakonechny Tourism Development Manager oleg@visitgreaterps.com Partnership Partnership Davis Meyer Vice President of Government & Industry Relations davis@visitgreaterps.com Lauren Bruggemans Director of Sustainability & Community Engagement laurenb@visitgreaterps.com Sean Smith Director of Economic Development sean@visitgreaterps.com Erica Abarca Community Engagement Manager erica@visitgreaterps.com Josh Heinz Community Engagement Manager josh@visitgreaterps.com Laura Hunt Little Community Engagement Manager Marketing & PR Marketing Colleen Pace Chief Sales & Marketing Officer colleen@visitgreaterps.com Dana Fury Director of Marketing Samuel Thompson Director of Indian Wells Tourism Gary Forsyth Director of Palm Springs Tourism Krystal Kusmieruk Senior Marketing Manager Andrew McCauley Website Manager Caroline Polly Social Media Manager Jeffrey Farnsworth Marketing & Sales Coordinator jeff@visitgreaterps.com Celena Correa Digital Database Specialist Paola Fernandez Marketing Specialist Maya Jimenez Digital Marketing Specialist Anthony Ruiz Website Specialist Brand Development Julie Sinclair Director of Corporate Communications Miranda Caudell Senior Brand Marketing Manager Stacie Herndon Senior Graphic Designer Denise Marley Senior Graphic Designer Bob Wilson Brand Communications Specialist Media & Communications Todd Burke Vice President of Communications todd@visitgreaterps.com Joyce Kiehl Director of Communications Madison Morgan Media Relations Manager Halle Wells Communications Coordinator Request a Free Visitors Guide Sign up for our E-Newsletter Top VISIT GREATER PALM SPRINGS Toll-free: 800.967.3767 p: 760.770.9000 Visitor Center: Monday – Friday  8:00 am to 5:00 pm 70100 Highway 111 Rancho Mirage, CA 92270 Greater Palm Springs is a Certified Autism Destination™ Partner Portal About Us Our Team & Board Careers TBID Foundation Economic Development Contact Sitemap Privacy Policy Cookie Settings Agendas Partner Portal About Us Contact Sitemap Privacy Policy Cookie Settings Agendas PARTNERS & SPONSORS 1 /8 © 2025 Visit Greater Palm Springs. All rights reserved."
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    }
  ]
}