{
  "fuentes": [
    {
      "url": "https://cocoavillageplayhouse.com/events/announcement31",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/involved/volunteer",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/100-years",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/team",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/history",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "email": "info@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/boxoffice/season31",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/auditions/little_women",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/season/28",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/safety",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/event/announcement34",
      "email": "web@cocoavillageplayhouse.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa/arts-culture/cocoa-village-playhouse/",
      "email": "chosen-sprite@2x.png"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "info@cocoavillageplayhouse.com",
    "web@cocoavillageplayhouse.com"
  ],
  "nombre_sitio": "cocoavillageplayhouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://cocoavillageplayhouse.com/events/announcement31",
      "text": "31st Season Virtual Announcement Party | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart 31st Season Virtual Announcement Party 30th Season (2019-2020) Jul 31 WHEN: Friday, July 31 at 7:30 pm WHERE AND HOW TO WATCH: The LIVE stream will be available to view online on the following platforms: Facebook - The Historic Cocoa Village Playhouse (CVP) YouTube - HistoricCVP ABOUT THE VIRTUAL ANNOUNCEMENT PARTY: The Historic Cocoa Village Playhouse is once again distinguishing itself by producing a film to document and commemorate its 30th Season of Operation and announce its plans for its 31st Season of Broadway on Brevard. The Playhouse has long held a reputation for stellar production quality in Brevard County, and it plans to continue its commitment to live theatre in a changing world. It will announce its plans for its 31st Season programming on July 31st, 2020 at 7 PM in a short film highlighting its performances and performers throughout the past season. “Our goal with this is to not only announce our 31st Season, but also to let our performers and audiences know that we are thinking of them, we miss them, and we hope that they are safe until we see each other again,” says Chief Executive Officer, Dr. Anastacia Hawkins-Smith. “We hope that Playhouse regulars and volunteers will tune in with their loved ones, as well as, anyone who has a periphery knowledge of our theatre, and by the end of the broadcast we are confident that we will leave viewers with a heart full of hope.” The film will be available to view across multiple media including on the Playhouse’s website, official FaceBook and YouTube. The broadcast is replacing the “Announcement Party” that the Playhouse has held each year and has become a staple of the theatre community. The virtual “Announcement Party” will share some of the beloved memories of the past year as well as a sneak peek in the future, which staff members are confident will surprise anyone familiar with the Playhouse’s format and programming. Hawkins-Smith continues confidently, “I believe people will be surprised with our plans and am so excited to bring some new and different ideas to the community in addition to meeting our patrons expectations. The most important thing about this virtual party is that I want everyone to know that wherever they are in their life, they are not alone—we are here for you.” The “Virtual 31st Season Announcement Party” is free and can be streamed online at CocoaVillagePlayhouse.com or on any of the Playhouse’s social media platforms on July 31st at 7 PM. WIN PRIZES WHILE YOU WATCH: We are excited to be hosting TWO contests that will run during the live streaming of our Virtual Announcement Party. The first is an At-Home Red Carpet Fashion Show where two lucky winners will receive a set of Season Tickets. Dress in your fanciest party attire and upload a photo of you (and any participating friends and family) onto Facebook and/or Instagram using the hashtag #CVPFashionShow and tag us on FB @The Historic Cocoa Village Playhouse (CVP) and Instagram @historic_cvp The other contest will be our “31 Winners to Celebrate 31 Seasons of Broadway on Brevard.” All you have to do is comment during the LIVE stream on Facebook telling us what your favorite show has been over the last 30 years at the playhouse. Every comment posted during the LIVE stream starting at 7pm until it ends will automatically be entered to win one of our various prizes, which will include gift certificates to the playhouse, as well as, certificates from other Cocoa Village merchants. All winners will be randomly selected and announced by the following day, Saturday, August 1st, 2020. Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/involved/volunteer",
      "text": "Volunteer Opportunities | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Volunteer Opportunities The Historic Cocoa Village Playhouse is well known for having a dedicated team of volunteers that assist in keeping the theatre in operation. There are many different and diverse volunteer opportunities that help maintain our status of Broadway on Brevard. If you are interested in joining our team, we invite you to explore some of the opportunities listed below. Costuming The costuming department plays a vital role in creating the overall essence of a show. Costumes are an important storytelling tool that help create character and build on the development of any performance. Through the hard work of dedicated volunteers, The Playhouse prides itself with the opportunity to hand make and create all the costumes that appear on our stage. Whether it be sewing, ironing, crafting, or helping maintain our inventory, there is a place for any skill set in our costume shop. For more information about how to volunteer in our costuming department, contact Marsha, Sewing Room Manager, at: marshaCVP@gmail.com . Performing Arts Being a part of the performing arts within the community can be a wonderful and life changing experience. Regardless of the level of training and experience in the arts, we welcome everyone to join us for auditions at the theatre. Our volunteer performers consist of people in our community from all walks of life, including teachers, students, health care works, and military. Our volunteer performers help preserve and maintain a high professional quality of arts within the community. For more information on upcoming auditions, we invite you to visit our Auditions page . Front of House From checking tickets to helping patrons find their seat, Front of House is an essential part of any production at the Playhouse. Ushers play an important role in the audience experience as representatives of our historic theatre and serve as the first impression that patrons encounter as they attend a performance. Volunteers in Front of House maintain an image of excellence while carrying a friendly and professional composure. Ushers must be a minimum of 16 years of age or older. For more information about how to volunteer in our Front of House department, contact Nathaniel, Front of House Manager at: CVPUshering@gmail.com . Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/100-years",
      "text": "100th Celebration | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart 100th Celebration The Historic Cocoa Village Playhouse is a timeless gem that has been enchanting audiences for nearly a century! As we eagerly await the grand celebration of our 100th-year anniversary in 2024, we invite you to join us on this exhilarating journey down memory lane and into the future. For more information on our historic theatre, we invite you to learn more about our History . Since opening a century ago in 1924, The Historic Cocoa Village Playhouse has been a beacon of art, culture, and community in the heart of Cocoa Village. Originally “The Aladdin Theatre”, generations of theater enthusiasts have graced our walls, and each performance has left an indelible mark on the hearts of both performers and spectators alike. As we approach this momentous milestone, we are thrilled to announce that our team is diligently preparing an array of spectacular events and surprises that will make our centennial celebration an experience like no other. As cherished members of our community, we consider you an integral part of this journey. Mark your calendars, spread the word, and let the anticipation begin. Our 100th-year anniversary celebration begins on August 17, 2024, with a Diamond Gala which will be a once-in-a-lifetime event that will leave you spellbound and touched by the magic of theater. We invite you to keep checking this page for updates as we unfold surprises and announcements all season long! Thank you for being a cherished part of The Historic Cocoa Village Playhouse family – we can't wait to share this extraordinary milestone with you! *Below would be a list of events for the 100th as they are prepared, the first being for the Diamond Gala August 2024. This page should act as a beginning landing page that will continuously be updated throughout the 35th season as events and things are updated. Subscribe to 100th Celebration Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/team",
      "text": "Meet the Team | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Meet the Team The Cocoa Village Playhouse Board of Directors Robert Carman, Chairperson Lisa F. Crites, Vice-Chairperson Dewey Harris, Treasurer Stacy Landon, Secretary Andrea Beyel James Dwight Dr. Anastacia Hawkins-Smith, Emeritus Suzanne Hawkins Dr. Maxwell C. King, Emeritus Edward Kunigonis Trudy McCarthy Kim Mooty Robi Roberts Deborah Schenck Rashmi Shah Delores Spearman Mary Lu Tombleson-Harvey Susie Wasdin, Emeritus Bob Wetzel, Emeritus The Historic Cocoa Village Playhouse Staff Chief Executive Officer: Christopher Beavers Consulting Director: Dr. Anastacia Hawkins-Smith Technical Director and Sound Designer: Brian Brown Production Managers: Mark Cohn, Nathaniel Knepper-Quijano Artistic Directors: Megan Abbott, John Dudley, Sally Kalarovich, Nathaniel Knepper-Quijano, Pamela Larson, James Spiva Music Directors: Amanda Avey, Bob Barone, J. Thomas Black, Jr., Michael Law, Diane Spahr Lighting Designers: Ian Cook, Vinnie Cross, Paul Vaillancourt Lighting Console Operator: Nicole Shusterman Scenic Designer: Daniel Allen Resident Stage Manager: Robert Johnson Resident Costume Designer: Daniel Hill Resident Scenic Artist: Sheryl Koby Resident Master Carpenter: Harry Bilgray Production Assistants: Joseph Cox, Adison Estrada, Logan Hancock, Robert Holman, Kimberly Knepper, Chase Morgan, Allen Niles, Marsha Plog, Talliah Schreiber, Richard Tater, Shane Withrow Marketing Director: Benjamin Cox Marketing Consultant: Upstage Right Marketing Webmaster: Jonathan Goforth Accounts Payable: Kristy Cook Accounts Receivable: Judy Lacy Hospitality Manager : Mary Holman Human Resources Officer: Karen Stewart Ticket Office Manager: Savannah Lee Administrative Assistants: Lauren Abbott, Kaleigh Campbell, Phoebe Parker, Breanna Streeter Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/history",
      "text": "History of the Playhouse | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart History of the Playhouse Established as the Aladdin Theater, the doors opened to the public on August 18th, 1924, showing silent movies. Later, Brevard’s first “talkie” movie house became known as “the showplace of the Indian River Section”. Several owners and several decades later, the building was purchased by the City of Cocoa and renamed The Cocoa Village Playhouse. In August of 1984, Brevard Community College District Board of Trustees acquired the building for $1 with the understanding that the college would take the responsibility of ownership and make the theatre operate in the best interest of the community. The Trustees immediately established a 501(c)(3) not for profit Direct Support Organization with its own Board of Directors who were given the responsibility of raising funds to make the Playhouse self-supporting. Through donations from individuals, organizations, corporations and grants from Foundations, as well as the State of Florida, the Playhouse was restored, made operational, and began producing community based musicals in 1989 featuring local volunteer performers. In 1991, the Playhouse was accepted onto the National Register of Historic Places in Tallahassee and the official corporate name became The Historic Cocoa Village Playhouse, Inc. As the programming grew and became popular, the Stars of Tomorrow youth program was established in 1992 beginning with eight young people and now has over 250 participants each season featuring youth ages 7 through high school graduation. The program instructs them in not only the performing arts but life management skills as each “Star” is required to maintain a 3.0 grade point average in their classes. The performer base has now grown to over 600 volunteers who rotate throughout the productions each year with a core group known as the “Gold Star Performers” who perform in consecutive performances each season. An audience base of 2,100 season patrons support the Playhouse each year and performances are known to sell out to the public before the run of each production is finished. Over 55,000 audience viewers participate each year. Due to the growth of the programs, a Capital Campaign was conducted to raise $1.9 million dollars to build a Technical Support Annex on the property east of the historic building. The property was donated by Harrison Vanderslice. The construction of the three story Technical Support Annex was completed in 2008 and immediately became fully operational providing a scenic workshop, a costume construction area, expanded dressing rooms, a designated hair and makeup area, and a rehearsal studio. In the Spring of 2011, Brevard Community College returned ownership of the Playhouse to the City of Cocoa. Theatrical operations continued to be managed by the same 501(c)(3) not-for-profit organization, The Historic Cocoa Village Playhouse, Inc., while The City of Cocoa took the responsibility of maintaining the building. The City and the Playhouse jointly undertook a dynamic million-dollar renovation project resulting in the Playhouse opening its 23rd season on September 28, 2012 with a newly renovated auditorium, expanded orchestra pit, and enlarged balcony. The auditorium is now considered one of the most beautiful theatres in Florida. A $500,000 renovation project in the summer of 2014 funded by a Cultural Facilities Grant through the State of Florida was completed to upgrade the lobby and mezzanine areas of the theatre. In 2016, the Board of Directors took the opportunity to purchase the historic R.M. Rembert Building adjacent to the south of the Playhouse. A capital campaign will be launched in 2018 for the restoration and renovation of the Rembert Building which was built in 1910. It is intended for this acquisition to better serve our patrons and assist in the mission of the Playhouse. Known to all as “Broadway on Brevard”, this team of volunteers and staff are truly an example of one of the highest quality community theatres in our country. Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "text": "Contact Us | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Contact Us info@cocoavillageplayhouse.com (321) 636-5050 10:00 a.m. to 4:00 p.m. Tuesday – Friday and one hour before any ticketed event. To speak to one of our ticketing staff, call (321) 636-5050 or after business hours, leave a clear voice message with your name and telephone number and we will return your call. 300 Brevard Ave, Cocoa, FL Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/boxoffice/season31",
      "text": "31st Season (2020 – 2021) | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart 31st Season (2020 – 2021) Season Ticket Order Form - 31st Season (2020 – 2021) Stars of Tomorrow Season Ticket Order Form - 31st Season (2020 – 2021) For more information about tickets, visit our box office page . Watch the 31st Season Virtual Announcement Party Procedures to Keep You Safe As the Historic Cocoa Village Playhouse once again opens its doors to audiences, we are doing everything we can do keep our audiences, performers and staff safe. Here are a few procedures we have in place to keep you safe... Closure of will call to minimize unnecessary crowds Check your tickets for your seats Upon arrival, queue on the south side of the theatre noting the ground markings Please bring your own facial covering and wear to the theatre, we will provide you with a mask if you do not have one Your temperature will be taken upon arrival If you are experiencing any symptoms, we will issue you a gift certificate for a future performance Upon entry, please make use of our hand sanitizing stations Concessions and raffles will be suspended for the interim, however we will provide you with complimentary bottles of water at designated stations Programs will be found on the table to the left of your entry to the auditorium There will be no intermission, please locate the restroom nearest your seat Please follow the posted signage to maintain a one-way flow of traffic Designated arrival time for seating Limited seating based on social distancing policies to make sure each reservation is safe Our cast will not be greeting audiences after the show Spraying of all surfaces with industrial antiviral/antibacterial solution prior to audience members arrival Thank you for your help in keeping us all safe and for supporting this historic theatre. If you have any questions or concerns please contact us at The Historic Cocoa Village Playhouse 300 Brevard Avenue, Cocoa, FL 32922 321-636-5050 Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/",
      "text": "Experience Broadway on Brevard | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Front Menu About Us Box Office Performances Get Involved Experience Broadway on Brevard Located in beautiful downtown Cocoa Village, the Historic Cocoa Village Playhouse provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. With its family of local performers and technical staff, the Playhouse’s full line up of Broadway Musicals have earned it the nickname “Broadway on Brevard”. 36th Season Broadway on Brevard Season Ticket Form 36th Season Spotlight Series, Stars, Audition Information Authorized Ticket Sales Please be advised. In order to protect the public from any and all fraudulent activity, the Playhouse prohibits the reselling of tickets through third party sellers or markets. Many ticket resellers such as StubHub, Seat Geek, Vivid Seats, Tickets-Center and others offer tickets at highly inflated prices. All hard tickets and e-tickets have the original face value of the ticket printed on them. Additionally, we post our tickets prices on all advertising materials and here on our website. If you see tickets for sale higher than our advertised prices, please inform us and we will do what we can to have those tickets removed. Tickets found to be advertised for resale may be invalidated. Patrons attempting to use these invalidated tickets will not be admitted to events without purchasing a valid ticket through the Playhouse Box Office. WHEN YOU BUY FROM SOMEONE OTHER THAN THE PLAYHOUSE BOX OFFICE OR SPEKTRIX ONLINE TICKETING SERVICE: We cannot guarantee that your tickets are genuine. You almost always will pay more than face value. We cannot replace lost or stolen tickets. We cannot contact you with information on show cancellations, time changes, road closures or traffic updates, upcoming shows or other useful information. You are supporting businesses that make it harder for true fans to see their favorite performers without paying a premium charge. Please always check that you are buying directly from The Historic Cocoa Village Playhouse box office. When purchasing tickets via CocoaVillagePlayhouse.com, you will continue to our secure ticketing site, via our online ticketing company, Spektrix. Any other website you are on is NOT an authorized Cocoa Village Playhouse site. Current Playhouse production cast members are authorized to reserve and distribute tickets for Playhouse events. Tickets acquired from current cast members will be valid. No other outlets are authorized or supported. Upcoming Events Previous Next Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/auditions/little_women",
      "text": "Auditions for Little Women | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Auditions for Little Women 31st Season (2020-2021) Oct 11 - Oct 12 WHEN: Live On-site Auditions at The Historic Cocoa Village Playhouse Sunday, October 11 at 6:30 pm Monday, October 12 at 7pm (Must be 13 years or older to audition for this production) Virtual auditions will also be accepted and must be received by Sunday, Oct. 11 at 12 noon WHERE: The Historic Cocoa Village Playhouse 300 Brevard Avenue • Cocoa •  FL 32922 VIRTUAL AUDITION PREPARATION: If you are opting to audition with us virtually this season, please follow the instructions below. No Experience Necessary, we will train you! Record a video of your audition song and upload it to YouTube, Dropbox, Google Drive or another video hosting site that is easy to access and view publicly. Make sure that your video audition is 16 bars of music or no longer than 1 minute in length. Reminder to make sure that your video is set to public viewing. It is important that we hear your vocals in your video, so please make sure that you are singing with live accompaniment or pre-recorded background music only and not singing along with another pre-recorded vocalist. Please, NO a capella (singing without instrumental accompaniment) auditions for this production. We need to hear how you are on pitch with accompanied music. Send an active link to view your video to CVPauditions@gmail.com with “ Attn: Little Women Audition ” as the headline. CLICK HERE to fill out and submit an online Audition Application You will be contacted via email when we receive your video and information and are able to view your audition with any further instructions, if required. Virtual auditions for LITTLE WOMEN must be received by October 11 at 12 noon. If you are called back for a principal role, you will be asked to join us in person at the Playhouse for those dates ( Note: Callback auditions are closed to the public ) AUDITION PREPARATION FOR LIVE ON-SITE AUDITIONS: No Experience Necessary, we will train you! On-site audition dates for LITTLE WOMEN are Oct. 11 at 6:30pm and Oct. 12 at 7pm You will be required to wear a face mask and have your temperature checked to enter the theatre. Please keep a socially safe distance while in the theatre waiting to audition. Please limit vocal auditions to a maximum of 1 minute or 16 bars of music. Sheet music Is preferred (We provide a pianist). CD, Flash Drive or MP3 accompaniment must not contain pre-recorded vocals and must stop at 1 minute.  No smart phones or iPods/tablets, please. Flash drives with MP3 files are accepted at auditions as well. If you do not have a prepared song, you will be asked to sing “Happy Birthday” with the piano accompaniment (a pianist will be provided) No a capella (singing without instrumental accompaniment) vocals, please. You will also be given stage movement and/or dance to follow, unless noted under the show title. Please dress comfortably with correct shoes to move. ABOUT THE SHOW: LITTLE WOMEN: THE MUSICAL Through special arrangements with Music Theatre International (MTI) Music by Jason Howland • Lyrics by Mindi Dickstein • Book by Allan Knee Based on the beloved novel by Louisa May Alcott, Little Women follows the adventures of sisters, Jo, Meg, Beth and Amy March. Jo is determined to become a successful author, but first, she has to learn a few of life’s valuable lessons before discovering her own “astonishing” voice in the world. The powerful score soars with the sounds of personal discovery, heartache and hope! CHARACTERS: (Note: Casting will not be limited to the age range listed of the characters. Character ages are a suggestion and they must look like they visually go together.) Jo March – Female, 16 - 30 Our story’s protagonist. A Passionate and determined young author struggling to find her place in the world. She has the idea of writing Little Women and eventually becomes engaged to Professor Bhaer. Amy March – Female, 15 -26 The youngest, most energetic sister with a rather pompous air about her. She later marries Laurie. Doubles as the Troll in the operatic tragedy. Meg March – Female, 16 - 30 The world-weary, yet hopeful, oldest sister who yearns for a great life. She marries John and has twins with him. Doubles as Clarissa in the operatic tragedy. Beth March – Female, 16 - 30 The second youngest of the sisters. Timid and musical, Beth encourages and helps her sisters selflessly. Forms an unlikely friendship with the crotchety Mr Laurence. Doubles as Rodrigo 2 in the operatic tragedy. Marmee March – Female, 40 - 60 The March girls’ mother. She is the strong backbone of the family, who is courageous in spite of the difficult odds she faces. Doubles as the HAG in the operatic tragedy. Aunt March – Female, 50-70 A formidable, overbearing matron and great-aunt to the March sisters. The wealthy socialite in town. Theodore ‘Laurie’ Laurence – Male, 17 - 30 Lonely and charming boy next door who becomes firm friends with the March family. Proposes to Jo but eventually falls in love with and marries Amy. Doubles as Rodrigo in the operatic tragedy. Mr. John Brooke – Male, 20 - 40 Laurie’s tutor. A reserved and hard-working young man who only shows his tender side when he falls in love with Meg. Doubles as Braxton Prendergast in the operatic tragedy. Professor Bhaer – Male, 30 - 50 A sensible German professor boarding with Mrs Kirk. Persuades Jo that she is better than the “blood and guts stuff” she writes. Falls in love with, and eventually becomes engaged to Jo. Mr. Laurence – Male, 50 - 75 Laurie’s grandfather. A stiff and stern elderly man who eventually shows his softer side and becomes friends with Beth. Mrs. Kirk – Female, 40 - 70 The Irish owner of the boarding house in which Professor Bhaer and Jo meet. Ensemble consisting of singers and dancers to play the following roles: ball attendees, ice skaters, various characters in the Operatic Tragedy, and townspeople. What to expect if you are cast in Little Women: If you are cast, rehearsals may begin as soon as Tuesday, October 20 at 7pm. We typically rehearse from 7pm to 10pm on Mon-Fri, on Saturdays from 10am or 12 noon to 6pm, and 1pm to 6pm on Sundays. During the final week of technical rehearsals, we plan on rehearsing until 11 pm. There may be three times before we begin technical rehearsals that you may be asked to stay until 10:30 PM. Note: Not every cast member will be required to be at every rehearsal. The Director makes sure to create a well organized rehearsal schedule. Your time is very important, and we will try our best to make your time at CVP productive. If cast, your schedule requirements will be based on where you are placed in the show. In order for the Director to work with conflicts it is important that you let her know on your audition application. For this production of Little Women , please check and double check any conflicts you have between Sunday, October 11 through December 13, 2020 and let the Director know at the time of your audition. Thank you! PERFORMANCE DATES FOR LITTLE WOMEN: Friday, November 20 at 7:30 pm Saturday, November 21 at 2 pm  & 7:30 pm Sunday, November 22 at 2 pm * No Performance on Thanksgiving, Nov. 26 Friday, November 27 at 7:30 pm Saturday, November 28 at 2 pm  & 7:30 pm Sunday, November 29 at 2 pm Thursday, December 3 at 7:30 pm Friday, December 4 at 7:30 pm Saturday, December 5 at 2 pm  & 7:30 pm Sunday, December 6 at 2 pm ADDITIONAL POTENTIAL HOLDOVERS/ WHICH MAY OR MAY NOT BE SCHEDULED: Thursday, December 10 at 7:30 pm\\ Friday, December 11 at 7:30 pm Saturday, December 12 at 2pm & 7:30 pm Sunday, December 13 at 2 pm & 7:30 pm Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/season/28",
      "text": "28th Season (2017-2018) | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart 28th Season (2017-2018) Be Our Guest Season Start Tue, 08/01/2017 - 12:00 Subscribe to 28th Season (2017-2018) Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/safety",
      "text": "Health and Safety Measures | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Health and Safety Measures Updated: March 1st As we have done since reopening, we’ve been very intentional and gradual in our approach to our COVID-19 health and safety protocols. Based on recent trends and regulatory guidance, The Historic Cocoa Village Playhouse will be making adjustments to these measures, which may continue to change at any time without notice FACE COVERINGS Face coverings are optional for fully vaccinated Guests in both outdoor and indoor locations. We expect Guests who are not fully vaccinated to continue wearing face coverings at all times inside the theatre. PHYSICAL DISTANCING We have reduced distancing guidelines for patrons inside the theatre. Reservations may be directly next to you and parties may be seated directly in front and behind you. It’s important to remember that some experiences may remain temporarily unavailable. CLEANING We will continue the high standards for cleanliness and sanitation we’ve always set for ourselves. All surfaces are sprayed or fogged with industrial antiviral/antibacterial solution prior to and following all performances and events. Hand sanitizer stations will still be available throughout the theatre. Patrons are required to follow all posted signage and staff instructions. COVID-19 WARNING By entering The Historic Cocoa Village Playhouse, you are confirming that you and all persons in your party are not experiencing any of the following symptoms of COVID-19 identified by the Centers for Disease Control and Prevention at CDC.gov, including: Fever or chills, Cough, Shortness of breath or difficulty breathing, Fatigue, Muscle or body aches, Headache, New loss of taste or smell, Sore throat, Congestion or runny nose, and Nausea or vomiting. Parties are also confirming that all members have not been in contact with someone with confirmed or suspected COVID-19 symptoms without completing a quarantine or are not under any self-quarantine orders. By visiting The Historic Cocoa Village Playhouse you voluntarily assume all risks related to exposure to COVID-19. Thank you for your help in keeping us all safe and for supporting this historic theatre. If you have any questions or need to reschedule your reservation, please call our Ticket Office. The Historic Cocoa Village Playhouse 300 Brevard Avenue, Cocoa, FL 32922 321-636-5050 Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://cocoavillageplayhouse.com/event/announcement34",
      "text": "34th Season Announcement Party | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart 34th Season Announcement Party 33rd Season (2022-2023) Jul 8 The Historic Cocoa Village Playhouse 300 Brevard Avenue, Cocoa, FL 32922 Saturday, July 8, 2023 Please join us as we announce our exciting upcoming season of Broadway on Brevard! We look forward to seeing you! Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa/arts-culture/cocoa-village-playhouse/",
      "text": "Cocoa Village Playhouse - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Playhouses and Theaters Cocoa Village Playhouse Add to Wishlist Cocoa Village Playhouse The magnificent Historic Cocoa Village Playhouse first opened its door on August 18, 1924, as a theatre featuring the eras’ popular silent movies. Throughout the years the theater has changed the variety of performances from screen movies to musicals to Broadway plays. Known to all as ‘Broadway on Brevard’, local volunteers and staff provide the talent that preserves and maintains the highest professional quality of arts in the country. While waiting for the show to start, plan to come a little early and visit one of the area restaurants or simply take a stroll through the town visiting all the unique stores or even a romantic walk on the riverfront. Add to Trip Visit Website Direction 300 Brevard Ave. Cocoa, FL 32922 Contact 321-636-5050 Discover More nearCocoa Beach All Hotels Restaurants Events Add to Wishlist Juice N Java Cafe Cocoa Beach Sip into the season with a specialty coffee from Juice N Java Cafe. Add to Trip Add to Wishlist Coastal Market Cocoa Beach Cocoa Beach Fresh • Local • Coastal At Coastal Market, you’ll find everything from handcrafted deli sandwiches and fresh-baked pastries to fresh produce, premium meats, and specialty groceries. We even cater your gatherings with custom trays and menus. Stop by and taste why we’re Cocoa Beach’s favorite neighborhood market! Enjoy  1/2 Sandwich,… Add to Trip Add to Wishlist Fuji Yama THAI and sushi Cocoa Beach Lunch special starting at $12.95, name this ad get Asahi beer for only 5 bucks! Add to Trip Add to Wishlist Boardroom Cocoa Beach Located just steps away from main street, where you can enjoy our casual but trendy atmosphere. We offer the largest selection of boutique wines at the beach by both the glass and bottle; as well as craft, classics & local beer, seltzer and a variety of other beverages like house… Add to Trip Add to Wishlist 2georges oceanside bar & grill Cocoa Beach Enjoy a glass of house wine on us with any dinner purchase! Just minutes from the Cocoa Beach Pier and world-famous Ron Jon Surf Shop, 2georges oceanside bar & grill is a local favorite for fresh seafood, especially known for our world famous jumbo lump crab cakes. We also have… Add to Trip Add to Wishlist Cape Grill and Bar Cocoa Beach Come visit Cape Grill and Bar, the hidden jewel of Cape Canaveral, to try our made-from-scratch Prix Fixe lunch or dinner offerings! We are open to the public inside the Holiday Inn Club Vacations Resort. Both menus feature appetizers of house-made Crab Rangoon Flautas or Mozzarella Sticks, along with a… Add to Trip Add to Wishlist Rebellion Beachside Bar and Bistro Cocoa Beach Enjoy a revolving 4-course prix fixe menu for $45! We are excited to change up this menu as fresh, local ingredients become available! Here’s a sample of what may be available for your reservation! 1st Course: Crudo 2nd Course: Oyster Stew 3rd Course: Roasted Chicken with Mushrooms and Truffles OR… Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist Shark Tank Cocoa Beach Vacation Rentals Cocoa Beach Come to Shark Tank Vacation Rentals, your exclusive getaway just steps from downtown Cocoa Beach and the pristine shores of Florida’s Space Coast. Each unit in our newly renovated quadplex features two bedrooms, a bathroom, and a stylish blend of seaside charm and contemporary elegance. Spend your days surfing, relaxing… Add to Trip Add to Wishlist Space Coast Sights LLC Cocoa Beach Our family owned small business offers excursions that highlight Natural Florida (including hike options), a historic village with a waterfront park, and famous landmarks on sandy beaches. Visit coastal communities of Cocoa, Merritt Island, Cocoa Beach, and Cape Canaveral where dining, entertainment, wildlife, education, and relaxation await. Our sightseeing destinations… Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Kabob-a-licious Cocoa Beach Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a… Add to Trip Add to Wishlist Central Florida Kayaking Inc. Cocoa Beach Central Florida Kayaking offers guided kayak tours throughout Brevard County, including Merritt Island, Cocoa Beach, Melbourne, and other locations near Orlando. Kayaking tours explore the beauty of The Thousand Islands, mangrove tunnels, and the Indian River Lagoon. If you would like to see dolphins, manatees, and wild birds, or experience… Add to Trip Add to Wishlist Skull & Books VR Cocoa Beach Discover the Space Coast’s most unique adventure! Skull & Books VR combines the magic of a cozy used bookstore with the excitement of a cutting-edge VR arcade—all in one unforgettable destination. Whether you’re solving mysteries in an immersive VR escape room, battling alongside friends in multiplayer games, or just picking… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist MoonShine A Plant Based Kitchen MoonShine A Plant Based Kitchen is Cocoa Villages go to destination for fresh, flavorful, and 100% vegan cuisine. We specialize in creative plant based dishes, made from scratch and locally sourced ingredients when possible, offering a menu that’s nourishing as it is delicious. From vibrant bowls and comfort food classics... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist End of Summer Party Join us as we bid farewell to summer at Space Coast Harley-Davidson on Saturday, September 20 from 12-4p! We’ll have Live Music featuring Rising Lion, bikini bike wash, vendors and good food by Like Grandma’s Kitchen and SpaceCat’s Kitchen, plus, check out Bonehead Beard Care! Don’t miss out on the... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Comments This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    }
  ]
}