{
  "fuentes": [
    {
      "url": "https://www.ahtahthiki.com/",
      "email": "museum@semtribe.com"
    },
    {
      "url": "https://colliermuseums.com/speakers-bureau",
      "email": "elaina.gyure@colliercountyfl.gov"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "buyer@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "education@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "events@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "info@maritimeme.org"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "email": "reservations@maritimeme.org"
    },
    {
      "url": "https://www.nps.gov/subjects/southfloridacollections/contactus.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.coastalbreezenews.com/news/museum-of-the-everglades/article_db707d41-e12b-5234-ad25-c7f69db01b11.html",
      "email": "val@coastalbreezenews.com"
    },
    {
      "url": "https://friends-amis.org/about/contact-us/",
      "email": "fcwm-amcg@friends-amis.org"
    },
    {
      "url": "https://visitevergladescity.com/places/museum-of-the-everglades/",
      "email": "dsmallwood@cityofeverglades.org"
    },
    {
      "url": "https://visitevergladescity.com/places/museum-of-the-everglades/",
      "email": "info@visitevergladescity.com"
    },
    {
      "url": "https://www.nps.gov/subjects/southfloridacollections/everglades-national-park.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://colliermuseums.com/field-trips",
      "email": "elaina.gyure@colliercountyfl.gov"
    }
  ],
  "mails": [
    "app-promo-phones@2x.png",
    "buyer@maritimeme.org",
    "dsmallwood@cityofeverglades.org",
    "education@maritimeme.org",
    "elaina.gyure@colliercountyfl.gov",
    "events@maritimeme.org",
    "fcwm-amcg@friends-amis.org",
    "info@maritimeme.org",
    "info@visitevergladescity.com",
    "museum@semtribe.com",
    "reservations@maritimeme.org",
    "val@coastalbreezenews.com"
  ],
  "nombre_sitio": "colliermuseums.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ahtahthiki.com/",
      "text": "Official Museum of the Seminole Tribe of Florida Ah-Tah-Thi-Ki Museum About Us Princess Seminole Artist Experience Immokalee Teachers AIAC vendor Buy Tickets Now Support MEMBERSHIP Donate Sponsorship MMIP Pumpkins of Devil's Garden Directions Subscribe for Updates Virtual Tour Educator Resources Education Group Tours and Programs Field Trips Menu In observance of National Indian Day, the Ah-Tah-THi-Ki Museum will be closed on September 26, 2025. BOARDWALK Enjoy a mile long walk through the Everglades! WEST GALLERY Beautiful and Proud - Now Exhibiting MOSAIC Beautiful and Proud - Procession of Traditional Outfits NOOK Upcoming Exhibit - Ahfachkee Artist Spotlight Coming in September CHE-HUN-TAMO! In the Seminole language, Ah-Tah-Thi-Ki means a place to learn, a place to remember. We invite you to come to the Big Cypress Seminole Indian Reservation and learn about our exciting living history and culture! Our mission is to RESPECT, CELEBRATE, AND PRESERVE SEMINOLE CULTURE AND HISTORY WELCOME Nestled in the heart of the Everglades on the Big Cypress Seminole Indian Reservation, the Ah-Tah-Thi-Ki Museum is home to more than 200,000 works of art and historic objects. Come and learn about the Seminole people and experience their rich cultural and historical ties to the Southeast and Florida, as they have made Big Cypress their home since creation. VISIT Big Cypress Seminole Indian Reservation 34725 West Boundary Road, Clewiston, FL 33440 877-902-1113 Click here to view our admission prices Click here to find out more about our visitor COVID-19 guidelines Charging Stations: Please note DURING business hours we have four Blink Electric charging stations with J1772 type plugs.  No App is needed in order to use them. Ride Share: LYFT and UBER often drop off guests, HOWEVER, they do not make the return trip to this service area.\" Calendar of Events Exhibit Opening Celebration May 28, 2025 Seminole Artist Experience Seminole Hard Rock Hotel and Casino, Tampa July is Teacher Appreciation Month Register Here for Free Admission Seminole Artist Experience Seminole Hotel and Casino, Immokalee Pumpkins of Devil's Garden October 2025 American Indigenous Arts Celebration Nov. 7 & 8, 2025 Holiday Market: Shop Native Event December 2025 Earth Day the Native Way April, 2026 See more events Facebook Twitter YouTube Instagram Our Blog Yelp TripAdvisor Privacy Policy Terms and Conditions Hours of Operation Visit us 7 days a week 9 am to 5 pm 34725 West Boundary Road, Big Cypress Seminole Indian Reservation Email: museum@semtribe.com Telephone: 877-902-1113 Home Visit Us Happenings Exhibits Collections Store Get Involved Contact Us Search"
    },
    {
      "url": "https://colliermuseums.com/speakers-bureau",
      "text": "Collier County Museums Home Exhibits Event Calendar All Events Lectures Family Friendly Events Educational Programs Locations Collier Museum at Government Center Museum of the Everglades Immokalee Pioneer Museum at Roberts Ranch Naples Depot Museum Marco Island Historical Museum Education Historic Photo Archive Field Trips Speakers Bureau Museum Activities Paradise Found: 6,000 Years of People on Marco Island Connect Volunteer Rentals Press Volunteer Portal × Home Exhibits Events Locations Education Volunteer Connect ☰ Menu Speakers Bureau Bring the history of Southwest Florida to you with the Collier County Museums Speakers Bureau! The Collier County Museums are home to a passionate group of museum professionals who possess extensive knowledge on a variety of topics about our region’s history and culture. We look forward to sharing our love and knowledge of Collier County with you. Collier County Museums Speakers Bureau lectures are perfect for your organization, community, club, or class. Lectures are typically 45 minutes to 1 hour in length. They are available for free, although donations via check made out to the Collier County Museums are gratefully accepted. A minimum of 1 month notice before your preferred lecture date is required. While we cannot guarantee that your preferred date can be accommodated, we are happy to work with you to find alternatives. Learn about our speakers and the topics they offer below or by downloading the Collier County Museums Speakers Bureau catalog linked right. Ready to book a speaker? Email Curator of Education Elaina Gyure at Elaina.Gyure@colliercountyfl.gov with the following information: Your name, the organization you represent, preferred lecture date/and or time (if applicable), location where the lecture will take place, the topic/speaker you are interested in Speakers Bureau Catalogue 2025 Download Amanda Townsend, Collier County Museums Director Amanda Oswald Townsend has served her community in Collier County government for 21 years. She held various roles in the Public Services Department before becoming Director of Museums in 2016. She holds a Bachelor of Arts from New College of Florida and a Master of Arts in American Studies from the University of Alabama. Her professional and academic interests are in place studies and material culture, with a focus on Florida and the Twentieth Century. And Then There Were Five: A History of the Collier County Museum System From Oddity to Commodity: Representations of Florida in Postcards Snowbirds! Eleven Definitive Days in Collier County’s Cultural Identity Elaina Gyure, Curator of Education Elaina Gyure has been with the Collier County Museum system since 2018 and currently serves as the Curator of Education, where she manages educational programming for all five museums. She holds a bachelor’s degree in History and Historic Preservation from the College of Charleston in South Carolina, a master’s in Museum Studies from the University of Leicester, and a master’s in Nonprofit Management from the University of Central Florida. She has lived in southwest Florida since she was 4 years old and has a deep love for the region’s history and culture and sharing it with residents and visitors of all stripes. Meet the Museums: A Survey Course in Collier County History As Told by Artifacts: The History of Collier County in Historic Objects If These Walls Could Talk: The Architectural History of Southwest Florida Key Ingredients of Collier County Thomas Lockyear, Museum of the Everglades Manager Thomas Lockyear has been a museum professional for 17 years, having served as curator of the Key West Shipwreck Treasures Museum and at Historic Pigeon Key, as well as Executive Director of the History of Diving Museum in Islamorada before accepting his current position as Manager of Museum of the Everglades in Everglades City. A graduate of the University of Wisconsin – Madison (BS Art), Mr. Lockyear also holds a master’s degree from Florida Gulf Coast University (MA Ed). A Brief History of Everglades City The Train, the Trail, and the Origins of Florida Tourism Legends & Lore of the Everglades Dredges, Dynamite, & Determination — The Building of the Tamiami Trail Helen Midney, Immokalee Pioneer Museum Manager Helen Midney is the museum manager for the Immokalee Pioneer Museum at Roberts Ranch. She received her Bachelor’s degree from Bowdoin College in Maine. After working as an educator, college access counselor and environmental interpreter, she went on to earn her Master’s degree in Environmental Studies with a focus in Education from Florida Gulf Coast University. Helen is a resident of Immokalee and loves sharing her community and its history with locals and visitors alike. A Brief History of Immokalee Cattle Ranching and Florida Gardening and Agriculture in Southwest Florida, from the Pioneer Days to the Present Immokalee as a Model for Community Organizing and Social Justice Lisa Marciano, Naples Depot Museum Manager Lisa Marciano has grown up frequenting museums and historic sites throughout her adolescence. Her love of history and historic structures eventually transformed into a career and for the last 13 years she has worked with Collier County Museums in many capacities such as volunteer, Museum Assistant and Museum Manager. Lisa is currently the Museum Manager at the Naples Depot Museum. She holds a bachelor’s degree in History with a minor in Sociology/Anthropology and a master’s degree in Museum Studies from Johns Hopkins University. Lisa is also a long-term resident of Collier County and appreciates our local history. Railroading’s Finest Hour: The History of the Naples Depot Sites & Scenes: Collier County’s Historic Places Rising Above the Rails: The African American Experience Naples-on-the-Golf Rebecca Mazeroski, Marco Island Historical Museum Manager Rebecca Mazeroski is the Museum Manager for the Marco Island Historical Museum since 2020. She has an MBA in Museum Exhibition Planning from the University of the Arts in Philadelphia, PA. She has previously worked with the Ah-Tah-Thi-Ki Museum, Interpret Green Design Studio, The Clay Studio, and The Yager Museum. Camera Girl: Saloma Olds’ Marco Island Tommie Barfield: Queen of Marco © 2025 Collier County Museums. All rights reserved. Collier County Museums are operated by the Board of County Commissioners for Collier County, FL. For more information, visit www.CollierCountyFL.gov . Facebook Instagram"
    },
    {
      "url": "https://www.mainemaritimemuseum.org/team",
      "text": "Our Team | Staff, Interns, Volunteers & Board of Trustees — Maine Maritime Museum 0 Skip to Content Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Maine Maritime Museum Exhibits Cruises Give More Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Open Menu Close Menu Exhibits Cruises Give Folder: More Back Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours Weddings & Event Rentals Digital Guide Collection Education Camp Museum History Our Team Mission, Vision, Values Business Support Donation Requests & Guidelines The Rhumb Line Press Contact Store Win This Boat! Join Our Team A dedicated group of individuals–our staff, board of trustees, interns, and volunteers–make this museum a leading cultural institution and community pillar. As active stewards and educators of history and culture, of our historic site, and of our collections, we strive to inspire an ever-growing audience to experience the local, regional, and global stories of Maine. Leadership Team Featured Chelsea Lane, Director of Visitor Experience Read More → Kurt Spiridakis, Director of Boatbuilding Read More → Jason Morin, Director of Operations Read More → Luke Gates-Milardo, Director of Exhibits & Learning Read More → Chris Timm, Executive Director Read More → Rebecca Roche, Chief Advancement Officer Read More → Chris Jacobs, Director of Finance Read More → Kelly Page, Curator of Collections Read More → Current Opportunities Featured Visitor Service Assistants (Volunteer) Visitor Experience Associate Percy & Small Shipyard Guide (Volunteer) Donnell House Guide (Volunteer) Our Board of Trustees, comprised of a group of dedicated individuals, who collectively guide and advise museum policies. Board of  Trustees OFFICERS Thomas C. Whelan, Chair Loren B. Wright, Vice Chair Ross Burgess, Treasurer Lon F. Povich, Secretary TRUSTEES EMERITI Stephen C. Caulfield George H. McEvoy Jackson A. Parker William A. Rogers Elena D. Vandervoort David R. Weiss VOLUNTEER CHAIR Joan Knight TRUSTEES Greger C. Anderson William J. Brennan Tess Chakkalakal Joseph A. Drago Susan S. Duncan Kristin L. Fletcher Raymond E. Hender Leonard W. Langer Kenneth Moller John G. Morse Andrew Perry Carl D. Rapp Mandy Reynolds Thomas Sturgeon Thomas C. Whelan Nancy A. Wilkes Victoria M. Willock John Zittel Volunteer with Us A SENSE OF ACCOMPLISHMENT… As a nonprofit organization, the museum depends on its volunteers who annually contribute over $500,000 worth of their time, skills, and talents. As a Maine Maritime Museum volunteer, you will be able to work with others who share your interests and experience the sense of camaraderie that has lured people to the museum for over 50 years. There is something for everyone: maritime history, historic homes, gardening, art, education, and much more! Throughout the year, volunteers are invited to join in receptions, dinners, and cruises that celebrate their contributions. Volunteers who donate at least 15 hours of their time are also eligible for a complimentary membership and other exclusive benefits. VOLUNTEER LOG IN Looking for something else? To schedule a school visit for children, email us at education@maritimeme.org . To schedule a group tour for adults, email us at reservations@maritimeme.org . For weddings and private events, email us at events@maritimeme.org . For press inquiries, or anything else, email us at info@maritimeme.org . Prospective vendors for our museum store, email our store buyer at buyer@maritimeme.org . To inquire about donating an item to the collection, please complete this form . Have a question for the Curatorial Team? Submit a research request . Subscribe to Our Newsletter Sign up with your email address to receive news and updates. Email Address Sign Up Thank you! Plan Your Visit Cruises Exhibits The Bath Iron Works Story: By Land & Sea Calendar of Events Group Tours &   Charters Weddings & Rentals Digital Guide Collection & Research Education School Visits Learning Resources Our Programs Discovery Boatbuilding For Homeschool Camps Support Join Give Business Support Donation Requests & Guidelines About Museum History Our Team Mission, Vision, Values The Rhumb Line Press Win This Boat! Store Contact Location 243 Washington St Bath, ME 04530 Hours Monday – Sunday 9:30 am – 5:00 pm Closed Thanksgiving, Christmas & New Year’s Day, and occasionally if we get some weather. Questions? We’re here. info@maritimeme.org (207) 443-1316 ©2025 Maine Maritime Museum | Privacy Policy | Digital Guide | Instagram | Facebook | Volunteer Login"
    },
    {
      "url": "https://www.nps.gov/subjects/southfloridacollections/contactus.htm",
      "text": "Contact Us - Natural & Cultural Collections of South Florida (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel Natural & Cultural Collections of South Florida Contact Us Contact Us Whether you have a question about our work or would like to use our collections, please contact us through the email link below. Have something to donate? Give us some details. We’ll respond as quickly as we can. Thank you! Email us SFCMC Staff Bonnie Ciolino , Museum Curator (305) 242-7804 Michael Lorusso, Museum Specialist (305) 242-7888 Mailing Address South Florida Collections Management Center Everglades National Park 40001 State Road 9336, Homestead FL 33034 , Last updated: January 10, 2023 Tools Site Index Contact Us This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.coastalbreezenews.com/news/museum-of-the-everglades/article_db707d41-e12b-5234-ad25-c7f69db01b11.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://friends-amis.org/about/contact-us/",
      "text": "Contact Us - Friends of the Canadian War Museum | FCWM Skip to content About Overview What We Do Governance Contact Us Projects & Programs Museum Programs Personal Treasures Adopt-a-Book Program Book Room Friends Forums Latest Newsletters Events Torch Articles Resources Support Us Donate Become a Member Renew Membership Become a Volunteer Donate Now FR Donate Now FR About Contact Us Get in touch with the Friends using our contact form or mailing address. Get In Touch We love to hear from folks interested in the work we do and the Canadian War Museum. If you’d like to learn more about us or simply have a question, please complete the form and we’ll get back to you as soon as possible. Full Name * Email Address * Phone Number Subject Message * Name This field is for validation purposes and should be left unchanged. Mailing Address If you’d like to reach us by mail, our mailing address is as follows: Friends of the Canadian War Museum 1 Vimy Place Ottawa, Ontario K1A 0M8 E Mail: fcwm-amcg@friends-amis.org Telephone: (819)776-8618 Support the Friends Be a Donor Help the Friends support the Museum by becoming a donor today. Donate Now Why Volunteer? The Friends is an all-volunteer organization and needs interested people willing to provide time, knowledge and skills to support our mission. Apply today Why be a Member? If you have an interest in furthering the Friends purposes a membership may be for you. Join today About Overview What We Do Our Board of Directors Contact Us Projects & Programs Museum Programs Personal Treasures Adopt-a-Book Program Book Room Friends Forums Latest Newsletters Events Torch Articles Resources Support Us Donate Volunteer Join © 2025 Friends of the Canadian War Museum | FCWM. Legal Photo Credits to Canadian War Museum | Design by baytek"
    },
    {
      "url": "https://visitevergladescity.com/places/museum-of-the-everglades/",
      "text": "Museum of the Everglades - Welcome To Paradise, Everglades City & the Ten Thousand Islands Skip to content Toggle Navigation Things to Do Dine Visit a Park Big Cypress National Preserve Bear Island (Big Cypress) Collier Seminole State Park Naples Corkscrew Swamp Sanctuary Everglades National Forest Fakahatchee Strand State Park Jane Scenic Drive (Fakahachee Strand) Florida Panther National Wildlife Refuge Loop Road Scenic Drive (Big Cypress) Picayune Strand State Forest Ten Thousand Islands National Wildlife Refuge Learn Everglades Visitors Center Museum of the Everglades Everglades City Hall Bank of Everglades Everglades Society for Historic Preservation Explore Trail Town Everglades City School Fish Boat Paddle Hike Bike Birdwatch Hunt Worship News All News City Hall Community History Parks Recipes School Wildlife VEC Classifieds Place Classified Ad FAQ Events Mullet Rapper Mullet Rapper Archive Directory Add Listing Advertise Contact Toggle Navigation Things to Do Dine Visit a Park Big Cypress National Preserve Bear Island (Big Cypress) Collier Seminole State Park Naples Corkscrew Swamp Sanctuary Everglades National Forest Fakahatchee Strand State Park Jane Scenic Drive (Fakahachee Strand) Florida Panther National Wildlife Refuge Loop Road Scenic Drive (Big Cypress) Picayune Strand State Forest Ten Thousand Islands National Wildlife Refuge Learn Everglades Visitors Center Museum of the Everglades Everglades City Hall Bank of Everglades Everglades Society for Historic Preservation Explore Trail Town Everglades City School Fish Boat Paddle Hike Bike Birdwatch Hunt Worship News All News City Hall Community History Parks Recipes School Wildlife VEC Classifieds Place Classified Ad FAQ Events Mullet Rapper Mullet Rapper Archive Directory Add Listing Advertise Contact Museum of the Everglades Staff 2025-04-22T16:49:09-04:00 Museum of the Everglades Broadway Ave West Everglades City Map Map Learn and Visitors About Contact Photos Map First opened in 1927 as a commercial laundry, the building that now houses the Museum of the Everglades is one of several historic structures still standing as a testament to the town’s time as a once-bustling center of business and the region’s first County seat. The museum’s permanent and rotating exhibits provide visitors with an in-depth look at over 2,000 years of human history in the area and tell the stories of those adventurous enough – and tenacious enough – to settle “Florida’s Last Frontier”. Faithfully restored to its original, 1920s Collier-era appearance, the museum is listed on the National Register of Historic Places and is located 35 miles east of downtown Naples and less than 100 miles from Miami. Museum of the Everglades Website Phone: (239) 252-5026 Address: Broadway Ave West Everglades City Florida 34101 United States Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Enter your location Get Directions Travel mode Driving Walking Bicycling Public Transport Distance units Miles Kilometers Recently Viewed Loading... News about Everglades City, Chokoloskee, Port of the Islands, Lee Cypress, Big Cypress, and the 10,000 Islands. News about Everglades City, Chokoloskee, Port of the Islands, Lee Cypress, Big Cypress, and the 10,000 Islands. I would like to… Toggle Navigation Eat Visit A Park Learn Fish Boat Paddle Hike Bike Birdwatch Hunt News By Area Toggle Navigation Everglades City Chokoloskee Port of the Islands Goodland Big Cypress Lee Cypress Free Walking Maps Everglades City & Chokoloskee Contact Us VisitEvergladesCity.com is a project of Paradise Web‬, LLC. (941) 999-1237‬ info@VisitEvergladesCity.com Contact Us Contact Us VisitEvergladesCity.com is a project of Paradise Web‬, LLC. (941) 999-1237‬ info@VisitEvergladesCity.com Contact Us © Paradise Web, LLC   |   All Rights Reserved   | Terms, Conditions & Privacy |   Designed by Paradise Web Page load link Search for: FAQ's All Everglades City On The Water Port of the Island EC: Reserve Mcleod Park? Staff 2025-01-14T13:38:41-05:00 EC: Reserve Mcleod Park? Can I reserve the Mcleod Park for an event? To Reserve the City Park for an Event contact the City Clerk at (239) 695-4558 or email: Dsmallwood@cityofeverglades.org ( CityofEverglades.org ) Park: Drones in the Park? Staff 2023-12-09T10:15:54-05:00 Park: Drones in the Park? Can I fly my drone in Everglades National Park? No, drones and other unmanned aircraft are not allowed in the park, or any other National Park Service site. This includes model airplanes, quadcopters, etc. ( nps.gov ) Park: Which Park to Hunt Staff 2023-12-09T10:13:13-05:00 Park: Which Park to Hunt Where can I hunt in Everglades National Forrest? Hunting is permitted exclusively in Big Cypress Preserve. Visit our hunting page for more details. POI: Long Term Parking Staff 2023-12-09T10:07:15-05:00 POI: Long Term Parking Where can I park my car if I’m leaving in a boat for an extended trip? Check with The Ship Store at (239) 642-3133 or Port of the Islands Marina at (239) 389-0367. POI: Trip Time to the Ocean Staff 2023-12-09T10:07:22-05:00 POI: Trip Time to the Ocean How long does it take to get out to the ocean from Port of the Islands It usually takes around 45 minutes to cruise from the Port of the Islands to the ocean. The journey includes navigating through a long, no-wake zone canal, providing a delightful and unhurried ride. Bring a cover for sun protection during this slow and scenic route. About half an hour in, you’ll arrive at the expansive and naturally beautiful mangroves before reaching the open waters of the ocean. POI: Where can I park? Staff 2023-12-09T09:52:59-05:00 POI: Where can I park? In Port of the Islands, where can I park if I’m going out on the water? You can park in the parking lot by Port of the Islands Marina. Check with The Ship Store at (239) 642-3133 or Port of the Islands Marina at (239) 389-0367. Go to Top"
    },
    {
      "url": "https://www.nps.gov/subjects/southfloridacollections/everglades-national-park.htm",
      "text": "Everglades National Park - Natural & Cultural Collections of South Florida (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel Natural & Cultural Collections of South Florida Contact Us Everglades National Park An articulated shell and skull of a green sea turtle  from the Everglades National Park museum collection NPS Photo The Everglades National Park museum collection is one of the largest in the national park system. Start exploring here. This page introduces online sources for the natural and cultural histories of Everglades National Park. Historical and scientific information can be found in many places online. Some of the links below are to other National Park Service (NPS) web sites. More link to other libraries and archives. National Park Service information sites: Did you know that efforts to create Everglades National Park began in the 1920s but did not finish until the park was dedicated in 1947? One of the significant figures in the early history of the park was Ernest F. Coe, executive chairman of the Everglades National Park Association. Explore a finding aid to the Coe papers , which have been digitized. NPS reports, studies, maps, and management plans may be found on the NPS Electronic Technical Information Center web site. Notable among the reports and studies available is Wilderness on the Edge: A History of Everglades National Park . Photographs from the Everglades National Park archive are available through the Open Parks Network , a cooperative effort between the National Park Service and Clemson University. Not all photographs in the park collection are available online. Harpers Ferry Center, part of the National Park Service, houses the NPS history collection, commissioned art collection, AV and film collections, and other material, parts of which are available online in the NPGallery through the Harpers Ferry web page . We recommend searching using the word everglades and choosing list view when the results appear. A wealth of articles, reports, and other data about Everglades National Park is available through the NPS Data Store . Nearly 2900 entries date back as far as the late 1800s, well before Congress created the national park. Information about Everglades National Park held by other institutions: America's Swamp: The Historical Everglades Project \"includes the University of Florida's most important historical record collections documenting the despoiling of the Everglades and the development of South Florida\" in the late 1800s and early 1900s. Digitized personal papers include those from Governor Napoleon Bonaparte Broward, Governor William Sherman Jennings, May Mann Jennings, Thomas E. Will, Arthur E. Morgan, James E. Ingraham, and Ernest R. Graham. The University of Miami Digital Collections include the papers of Marjory Stoneman Douglas , author of River of Grass and activist instrumental in the preservation of the Everglades. U of M also maintains the records of the Woman's Club of Coconut Grove ; as the Housekeepers' Club in the early 1900s, the woman's club was instrumental in the creation of Royal Palm State Park, which served as the seed for Everglades National Park. The collections of the Library of Congress document the history and management of Everglades National Park, including the restoration of the Everglades ecosystem. For legislation relating to Everglades National Park, search the web site of the U.S. Congress . Florida International University hosts the Everglades Digital Library: Reclaiming the Everglades , with nearly 10,000 page images of primary source materials relating to south Florida environmental history. This digitized documentary evidence dates from1884 and covers topics such as the establishment of Everglades National Park, Native American land rights, agriculture, urban development, endangered species, invasive plants, and the role of women in the modern conservation movement. The Lynn and Louis Wolfson II Florida Moving Image Archives houses over 35,000 hours of video tape and 23 million feet of film documenting Florida history, including Miami TV station news stories about Everglades National Park. The George A. Smathers Libraries at the University of Florida have several collections related to the Everglades ecosystem, including Everglades National Park. From the Collections and Partners page , filter using everglades. The Samuel Proctor Oral History Program has interviewed many individuals for the Everglades Digital Library Oral Histories Collection , including several Miccosukee and Seminole people. Looking for natural specimens? The web site for Integrated Digitized Biocollections contains many specimens from Everglades National Park curated by institutions across the U.S., including our principal partner, the Florida Museum of Natural History. For more information about the museum and archive collections from Everglades National Park held at the South Florida Collections Management Center--the NPS museum facility in Everglades National Park--visit the Using the Collections page or contact the staff through the Contact Us page. Last updated: July 16, 2024 Tools Site Index Contact Us This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://colliermuseums.com/field-trips",
      "text": "Collier County Museums Home Exhibits Event Calendar All Events Lectures Family Friendly Events Educational Programs Locations Collier Museum at Government Center Museum of the Everglades Immokalee Pioneer Museum at Roberts Ranch Naples Depot Museum Marco Island Historical Museum Education Historic Photo Archive Field Trips Speakers Bureau Museum Activities Paradise Found: 6,000 Years of People on Marco Island Connect Volunteer Rentals Press Volunteer Portal × Home Exhibits Events Locations Education Volunteer Connect ☰ Menu Field Trips at the Collier County Museums About your field trip Planning Details We offer field trips at all five Collier County Museums. Due to their varying sizes, each can accommodate a different number of classes. Collier Museum at Government Center: 3 Classes per Day Museum of the Everglades: 1 Class per Day Immokalee Pioneer Museum at Roberts Ranch: 3 Classes per Day Naples Depot Museum (Closed for Hurricane Recovery): 2 Classes per Day Marco Island Historical Museum: 2 Classes per Day Collier Museum at Government Center and Immokalee Pioneer Museum at Roberts Ranch have space for coolers and picnic lunches on site. Parks can be recommended upon request. All Collier County Museum field trips are free! Field trips typically operate from 10am – 12pm, please make a note if your travel time is prohibitive. Field trips are scheduled on a first come, first serve basis. Which museum is right for you? 2nd Grade Field Trips (can be adapted for 1st & 3rd grades) Collier Museum at Government Center Museum of the Everglades Marco Island Historical Museum 4th Grade Field Trips (can be adapted for 5th grade) All Museums Middle and High School Field Trips (can be tailored to your curriculum needs) Collier Museum at Government Center Immokalee Pioneer Museum at Roberts Ranch Marco Island Historical Museum Need more information? Contact Curator of Education Elaina Gyure at Elaina.Gyure@colliercountyfl.gov Ready to book a field trip? Contact Curator of Education Elaina Gyure at Elaina.Gyure@colliercountyfl.gov with the following details: School name, grade level, number of classes in grade level, museum preference, potential dates you are interested in coming (dates cannot be guaranteed) © 2025 Collier County Museums. All rights reserved. Collier County Museums are operated by the Board of County Commissioners for Collier County, FL. For more information, visit www.CollierCountyFL.gov . Facebook Instagram"
    }
  ]
}