{
  "fuentes": [
    {
      "url": "https://www.floridashistoriccoast.com/directory/bull-crown-publick-house-restaurant/",
      "email": "cindy@thepiratemuseum.com"
    },
    {
      "url": "https://www.floridashistoriccoast.com/directory/bull-crown-publick-house-restaurant/",
      "email": "ssather@floridashistoriccoast.com"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "accountspayable@thecrownestate.co.uk"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "accountsreceivable@thecrownestate.co.uk"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "enquiries@thecrownestate.co.uk"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "enquiries@windsorgreatpark.co.uk"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "escheat.queries@burges-salmon.com"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "email": "pressoffice@thecrownestate.co.uk"
    },
    {
      "url": "https://www.inncollectiongroup.com/bulls-head-inn/contact-us/",
      "email": "info@bullsheadinn.co.uk"
    },
    {
      "url": "https://www.crownestatesagents.co.uk/contact-us/",
      "email": "enquiries@crownestatesagents.co.uk"
    },
    {
      "url": "https://www.colonialclub.org/staff-board",
      "email": "info@colonialclub.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "bpatruno@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "cepstein@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "gplant@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "jschwartz@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "mmarsico@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "rcarpenter@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "rrandall@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "smarino@colonialsd.org"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "email": "wwinchester@colonialsd.org"
    }
  ],
  "mails": [
    "accountspayable@thecrownestate.co.uk",
    "accountsreceivable@thecrownestate.co.uk",
    "bpatruno@colonialsd.org",
    "cepstein@colonialsd.org",
    "cindy@thepiratemuseum.com",
    "enquiries@crownestatesagents.co.uk",
    "enquiries@thecrownestate.co.uk",
    "enquiries@windsorgreatpark.co.uk",
    "escheat.queries@burges-salmon.com",
    "gplant@colonialsd.org",
    "info@bullsheadinn.co.uk",
    "info@colonialclub.org",
    "jschwartz@colonialsd.org",
    "mmarsico@colonialsd.org",
    "pressoffice@thecrownestate.co.uk",
    "rcarpenter@colonialsd.org",
    "rrandall@colonialsd.org",
    "smarino@colonialsd.org",
    "ssather@floridashistoriccoast.com",
    "wwinchester@colonialsd.org"
  ],
  "nombre_sitio": "colonialquarter.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floridashistoriccoast.com/directory/bull-crown-publick-house-restaurant/",
      "text": "Bull & Crown Publick House | St. Augustine & Ponte Vedra, FL Skip to content 79 ° F Trip Planner Radio 0 Saved Navigation Things to Do & Attractions History Outdoor Activities Family Fun Free Things to Do Shopping Arts & Culture Golf Sightseeing & Tours Spas & Wellness Paranormal Activities Must-Do Experiences on Florida's Historic Coast Discover the Trails of Florida’s Historic Coast: A Journey of Flavor, Spirits, and History Beaches St. Augustine Beach Ponte Vedra Beach Anastasia State Park Crescent Beach Vilano Beach Mickler’s Landing Butler Beach Explore the Beaches Places to Stay Hotels and Motels on Florida’s Historic Coast Resorts on Florida’s Historic Coast Condos & Private Rentals Campgrounds & RV Parks Bed & Breakfasts Vacation Deals Lodging with Meeting Space Sunkissed Staycations on Florida’s Historic Coast Girlfriend Getaways on Florida’s Historic Coast Golf Food & Drink Restaurants Breweries, Wineries & Distilleries Nightlife Sweet Spots Live Music on Florida’s Historic Coast Music Festivals Live Music Venues Events Submit Event Annual Events Music Festivals Major Holidays This Weekend in St. Augustine: Events & Things to Do Visitor Information Order Guide Subscribe to E-Newsletter Maps Deals Getting Here Parking Visitor Services Weather & Average Temperature Accessibility Medical Assistance Healthy Travel Information & How We Are Open Trip Planner Radio Meetings Religious & Spiritual Retreats Reunions Weddings Tour & Travel Planners Sports Planners Blogs Home Share Bull & Crown Publick House 53 St. George St. St. Augustine, Florida 32084 (904) 342-2857 Hours Open daily 11am-9pm Website Save Bull & Crown Publick House 53 St. George St. St. Augustine, Florida 32084 Details Open in Google Maps Map Email Overview Built on the original site of a skilled Minorcan carpenter, Francisco Pellicer, our British-style pub offers delicious burgers, fish & chips, and wings. Enjoy craft cocktails and cold beer while watching the buzz of the town from our spacious front deck located directly on St. George Street. Cuisines American Amenities Bar/Lounge Dinner Family-Friendly Full Bar Group-Friendly Happy Hour Live Music Lunch Outdoor Seating Pet-Friendly Reviews Trip Advisor Reviews Visitor Guide Newsletter 29 Old Mission Ave St. Augustine, FL 32084 (904) 829-1711 Things to Do & Attractions History Outdoor Activities Family Fun Free Things to Do Shopping Arts & Culture Golf Sightseeing & Tours Spas & Wellness Paranormal Activities Must-Do Experiences on Florida's Historic Coast Discover the Trails of Florida’s Historic Coast: A Journey of Flavor, Spirits, and History Beaches St. Augustine Beach Ponte Vedra Beach Anastasia State Park Crescent Beach Vilano Beach Mickler’s Landing Butler Beach Explore the Beaches Places to Stay Hotels and Motels on Florida’s Historic Coast Resorts on Florida’s Historic Coast Condos & Private Rentals Campgrounds & RV Parks Bed & Breakfasts Vacation Deals Lodging with Meeting Space Sunkissed Staycations on Florida’s Historic Coast Girlfriend Getaways on Florida’s Historic Coast Golf Food & Drink Restaurants Breweries, Wineries & Distilleries Nightlife Sweet Spots Live Music on Florida’s Historic Coast Music Festivals Live Music Venues Events Submit Event Annual Events Music Festivals Major Holidays This Weekend in St. Augustine: Events & Things to Do Visitor Information Order Guide Subscribe to E-Newsletter Maps Deals Getting Here Parking Visitor Services Weather & Average Temperature Accessibility Medical Assistance Healthy Travel Information & How We Are Open Meetings Religious & Spiritual Retreats Reunions Weddings Tour & Travel Planners Sports Planners Blogs © 2025 St. Augustine Ponte Vedra. All Rights Reserved. Media & Press About Us Contact Us Privacy Policy Accessibility GDPR FAQ This website uses cookies to ensure you get the best experience on our website. Learn More Accept Experience Builder Quick Search Search Location Map"
    },
    {
      "url": "https://www.thecrownestate.co.uk/contact-us",
      "text": "Contact us | The Crown Estate Skip to navigation Skip to main content Skip to footer Accessibility tools Search Menu About us About us Overview Purpose & strategy Leadership History Annual Report Governance Governance Overview Suppliers Our asset map FAQs Sustainability Sustainability Overview Supporting the net zero transition Decarbonising our business Stewarding nature Thriving communities Responsible business Our business Our business Overview Marine Marine Overview Our approach Marine Delivery Routemap Offshore wind Carbon capture Cables & pipelines Mineral resources Coastal Data & evidence Licensing & guidelines Marine planning Seabed notices Property & Places Property & Places Overview Our approach Development Retail & leisure Workplace Residential Land Land Overview Our approach Agriculture Minerals & mining The Windsor Estate The Windsor Estate Overview The Windsor Estate Windsor Great Park Careers Careers Want to make an impact? Hear from our people Diversity, Equity & Inclusion Marine internship programmes Opportunities News and Stories News and Stories All news and stories Press releases Stories Reports Videos FAQs Contact us Search Search this website: Submit Close search Scroll to top Contact us Visit, call or email. There are a variety of ways in which you can get in touch with us. Get in touch Press office: press mailbox Complaints: enquiries mailbox | complaints policy Invoices or payments: accountspayable@thecrownestate.co.uk or accountsreceivable@thecrownestate.co.uk Echeated properties: escheat.queries@burges-salmon.com London 1 St James’s Market London SW1Y 4AH General enquiries 020 7851 5000 enquiries@thecrownestate.co.uk Google maps Windsor Great Park The Great Park Windsor SL4 2HT General enquiries 01753 860 222 enquiries@windsorgreatpark.co.uk Google maps Customer Enquiries To get in touch with one of our managing agents, you can find the contact details through the search below. Search agents The Crown Estate 1 St James’s Market London SW1Y 4AH 020 7851 5000 Legal and Governance Terms of use Privacy statement Cookies statement Modern slavery and human trafficking statement Freedom of information User support and Accessibility Accessibility Sitemap Reporting and Feedback Whistleblowing Complaints © The Crown Estate 2025"
    },
    {
      "url": "https://www.inncollectiongroup.com/bulls-head-inn/contact-us/",
      "text": "The Bull's Head Inn | Beaumaris | Inn Collection Group Our App Gift Vouchers Christmas Contact Us Accessibility Part of The Inn Collection Group 10% off* your next booking Book direct for Best Price Book your summer getaway! Our Inns Location County Durham The Kingslodge Inn The Seaton Lane Inn Lake District The Ambleside Inn The Angel Inn The Coniston Inn The Pheasant Inn The Swan, Grasmere The Temperance Inn The Ullswater Inn The Wateredge Inn The Waterhead Inn The Wordsworth Hotel Lancashire The Midland Offshore North Wales The Bull's Head Inn The Swallow Falls Inn Northumberland The Amble Inn The Bamburgh Castle Inn The Commissioners Quay Inn The Hog's Head Inn The Lindisfarne Inn Tyne and Wear The Seaburn Inn The Tynemouth Castle Inn Yorkshire Dean Court The Black Swan The Harrogate Inn The Knaresborough Inn The Northallerton Inn The Ripon Inn The King's Head Inn The Stables, Whitby See all locations Offers Offers Enjoy a 2-night stay at one of our charming inns, with so many added extras, including dinner on your first night! Claim Offer Walk-Inn Breaks Loyalty rewards, exclusive perks and so much more right at your fingertips with our brand new app, including 10% off* your next stay. Join INN Join the INN Crowd Offers & Discounts INN The Know newsletter Gift Vouchers Food & Drink Group Bookings Business Booker Winter Breaks Christmas Staycations Golf-INN Getaways Win a Break Explore Explore Only in Northumberland will you find more castles than any other county in England and experience unrivalled wildlife opportunities. Find Out More Explore Northumberland When it comes to outstanding magnificent scenery, the Lake District is rolling in it. Find Out More The Lake District Choose your break Explore County Durham Explore Yorkshire Explore Tyne & Wear Explore North Wales Explore Lancashire Innspiration City Breaks Walking Holidays Romantic Breaks Family Holidays 12 Things to do in Northumberland Discover York About Us About Us We create inns where everyone would like to eat, drink, sleep, and explore from Discover More Come on Inn Join the team and be a part of this amazing growth journey Find Out More Careers No Link Our Inns Our Story News & Events Special Occasions Download Our App Our App Gift Vouchers Christmas Contact Us Accessibility Book a Room Book a Room 10% off* your next booking Book direct for Best Price Book your summer getaway!"
    },
    {
      "url": "https://www.crownestatesagents.co.uk/contact-us/",
      "text": "Contact Us | Crown Estate Agents Call Us 01268 711 133 Request a Valuation Book a valuation Property search Menu Home Contact Us Contact Us Please contact our friendly team by phone or email, or visit our office. Alternatively complete the form on this page and we will get in touch with you. Crown Estates, Endeavour House, Church Road, Ramsden Bellhouse, Billericay CM11 1RN 01268 711 133 enquiries@crownestatesagents.co.uk Get in Touch * required fields First Name: * Last Name: * Phone Number: * Email Address: * Message: Your Explicit Consent You must be 18 years or older to register for our property matching service through this website (\"Service\"). From time to time we will send you information about properties that we feel may be of interest to you and/or provide you with information about our valuation services. If you would like to receive information from us, please indicate this by selecting the appropriate box(es) below: I would like to hear about properties which you think might be of interest. I would like to hear about your valuation services. Our Privacy Policy and Notice describes how we use your data, who we might share it with and what rights you have. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Contact Us 01268 711 133 enquiries@crownestatesagents.co.uk Follow Us © 2025 Crown Estate Agents | Terms of Use | Privacy Policy & Notice | Cookies Policy | Cookie Preferences | Built by The Property Jungle ↑ Welcome Home About Us Sales Properties for Sale View Shortlist Our Fees Lettings Properties for Rent View Shortlist Contact Contact Us Request a Valuation Register PROPERTY SEARCH Buy Rent Location: Minimum Price: Min Price £50,000 £100,000 £150,000 £200,000 £250,000 £300,000 £350,000 £400,000 £450,000 £500,000 £550,000 £600,000 £650,000 £700,000 £750,000 £800,000 £850,000 £900,000 £950,000 £1,000,000 £2,000,000 £3,000,000 £4,000,000 £5,000,000 £6,000,000 £7,000,000 £8,000,000 £9,000,000 £10,000,000 Maximum Price: Max Price £50,000 £100,000 £150,000 £200,000 £250,000 £300,000 £350,000 £400,000 £450,000 £500,000 £550,000 £600,000 £650,000 £700,000 £750,000 £800,000 £850,000 £900,000 £950,000 £1,000,000 £2,000,000 £3,000,000 £4,000,000 £5,000,000 £6,000,000 £7,000,000 £8,000,000 £9,000,000 £10,000,000 Minimum Bedrooms: Min Beds 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms 7 Bedrooms 8 Bedrooms 9 Bedrooms 10 Bedrooms Property Type: Property Type Apartment Detached Land Office Semi-Detached Show Sold STC Properties Search Location: Minimum Price: Min Price £350 PCM £450 PCM £500 PCM £550 PCM £600 PCM £650 PCM £700 PCM £800 PCM £1000 PCM £1500 PCM £2000 PCM £3000 PCM £4000 PCM £5000 PCM £6000 PCM £7000 PCM £8000 PCM £9000 PCM £10,000 PCM Maximum Price: Max Price £350 PCM £450 PCM £500 PCM £550 PCM £600 PCM £650 PCM £700 PCM £800 PCM £1000 PCM £1500 PCM £2000 PCM £3000 PCM £4000 PCM £5000 PCM £6000 PCM £7000 PCM £8000 PCM £9000 PCM £10,000 PCM Minimum Bedrooms: Min Beds 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms 7 Bedrooms 8 Bedrooms 9 Bedrooms 10 Bedrooms Property Type: Property Type Apartment Detached Land Office Semi-Detached Show Let Agreed Properties Search Request a valuation Go now"
    },
    {
      "url": "https://www.colonialclub.org/staff-board",
      "text": "Staff & Board — Colonial Club Cart 0 Programs Services Events Volunteer Giving About Rentals Contact Back General Info Club 301 Classes Games Music & Entertainment Health & Wellness Committees & Clubs Trips & Excursions Back General Info Adult Day Center Case Management Supportive Home Care What's for Lunch Support Groups Back Events Calendar AleFest New Event Back Opportunities Sign Me Up Back Individual Giving Event Sponsorship Wish List Back Our Story Staff & Board Senior Advisory Council Courier Newsletter Annual Report Employment Cart 0 Programs General Info Club 301 Classes Games Music & Entertainment Health & Wellness Committees & Clubs Trips & Excursions Services General Info Adult Day Center Case Management Supportive Home Care What's for Lunch Support Groups Events Events Calendar AleFest New Event Volunteer Opportunities Sign Me Up Giving Individual Giving Event Sponsorship Wish List About Our Story Staff & Board Senior Advisory Council Courier Newsletter Annual Report Employment Rentals Contact Featured Melody Riedel Melody has worked for the Colonial Club Senior Activity Center since 1993. She has advanced in the organization and currently is the Director of Operations and Services. Read More → Laura Jennings Laura Jennings joined the Colonial Club in June of 2013 and assumed the duties of the Director of Support Services & Activities. Read More → Directors Meet The Team Featured Jean Gail Rosalie 2025-2026 Board of Directors Sarah Rublein, President Phil Wiednbeck, Vice President Carly Fenske, Secretary Jim Mastrangelo, Treasurer Mike Mullarkey, Board Member Patti Stockdale, Board Member Purpose To advise, govern, oversee policy and direction, and assist with the leadership and general promotion of Colonial Club Inc. so as to support the organization's mission and needs. Mission or purpose statement The Colonial Club Senior Activity Center is a progressive community-based nonprofit organization dedicated to enhancing the health and dignity of older adults in Northeast Dane County. Using consensus, empowerment and teamwork, we provide activities and services to meet the needs of our clientele. As an all inclusive organization and in conjunction with our Board, Advisory Council, volunteers and staff, we foster individuality, independence and inspiration for all seniors. Major responsibilities* Organizational leadership and advisement Organization of the board of directors, officers, and committees Formulation and oversight of policies and procedures, including annual review of Board bylaws Financial management, including adoption and oversight of the annual budget Development and oversight of long and short term strategic planning Adopts personnel policies that are carried out by Executive Director Annual work performance review of Executive Director Promotion of the organization Fundraising and outreach *Members of the board share these responsibilities while acting in the interest of the Colonial Club. Each member is expected to make recommendations based on his or her experience and vantage point in the community. Length of term Three years, which may be renewed up to a maximum of three consecutive terms, pending approval of the board. Meetings and time commitment The board of directors meets every other month on the fourth Thursday at 5 p.m. at Colonial Club. Due to holidays, November and December meeting dates will be re-scheduled at the Board's discretion. Committees of the board meet as frequently as needed, given their respective work agenda. Board members are asked to attend agency fundraising/special events as appropriate. Expectations of board members Attend and participate in meetings on a regular basis, and special events as able Participate on a standing committee of the board, and serve on ad-hoc committees as necessary Be alert to community concerns that can be addressed by the Colonial Club's mission, objectives and programs Help communicate and promote the Colonial Club mission and programs to the community The Colonial Club 301 Blankenheim Lane, Sun Prairie, WI, 53590, United States 608-837-4611 info@colonialclub.org Hours Mon 08:30 - 16:00 Tue 08:30 - 16:00 Wed 08:30 - 16:00 Thu 08:30 - 16:00 Fri 08:30 - 16:00 About Contact Home Privacy Policy (608) 837-4611 • 301 Blankenheim Lane, Sun Prairie, WI 53590 Donate Copyright 2019 Colonial Club EMAIL WEBMASTER"
    },
    {
      "url": "https://www.colonialsd.org/school-board",
      "text": "School Board - Colonial School District Skip To Main Content Close Menu Search Clear Search About Colonial Quick Facts Communications App District News E-Friday Folders Group calls, emails, and texts Social Media Equity, Inclusion, and Belonging (EIB) PA Future Ready Index (opens in new window/tab) History I'd Like To Know... Making A Difference Mission Non-Discrimination Statement Our Superintendent Points of Pride Staff Directory Student Spotlight Title I Program Volunteer Academics AVID Elementary Language Arts Report Card Guides Elementary Math Report Card Guides English As A Second Language PRIZE Summer Reading Grades 1-3 Reading Grade 4 Reading Who Was... (series) Grade 5 Reading What Was . . . (series) Where is . . . (series) Grade 6 Reading Grade 7 Reading Grade 8 Reading Grade 9 Reading Grade 10 Reading Grade 11 Reading Grade 12 Reading AP Language and Composition AP Literature and Composition AP Research Summer Reading Community Adult Evening School Current Session Information Frequently Asked Questions Business Partnerships Business Partner Form CITV Concerts Community Announcements Community Links Facilities Request Day of Service Day of Service - At Home Project Ideas Inclement Weather Communications Flexible Instruction Days Local Government Open Records Senior Citizen Programs Gold Card Member Matinee and Luncheon Gold Card Winter Concert and Breakfast Summer Camps Departments Central Registration Curriculum Comprehensive Plan How We Teach Reading at CSD Meet the Curriculum Staff Student Academic Achievement and Growth Data: 2022-23 Student Academic Achievement and Growth Data: 2023-24 Human Resources Be a Bus Driver Employment Opportunities Employee Resources Facilities & Operations CES Renovation Project Finance Audit Reports Budget Information Property Tax/Rent Rebate Programs Real Estate Tax FAQ ESSER Funds Requests for Proposals Food & Nutrition Services Colonial Catering Free & Reduced Meals Lunch and Breakfast Menus (opens in new window/tab) Finger Scanning Staff Meal Account Request Form SUN Bucks Program Pupil Services Annual Public Notice Compulsory Attendance Grief and Loss Resources Homeless Information Notification of Rights Special Education Programs Special Education Records Notice Student Assistance Program Student Health Services Contact Your School Nurse Student Health Services Forms When To Keep Your Child Home Student Records/Directory Information Suicide Prevention and Awareness Title IX Community Resources Technology Online Consent Software List Privacy Policy School-Issued Laptops or Tablets (1:1 Devices) Tech Support Transportation Colonial School Bus Safety Guidelines Non-Public School Information Transportation Change Requests Foundation About CSDEF Annual Campaign Donate to the Foundation Foundation Day Wristbands Cornhole Tournament Our Donors PW Alumni Association PWHS Athletic Honor Garden PW Scholarship Fund Staff Grants and Donations School Board Agendas and Minutes Archives (1997 through April 2018) Agendas and Minutes (opens in new window/tab) Board Members BoardDocs (opens in new window/tab) Committees Policies School Board Recognitions Students Parents/Guardians Staff Portal Alumni Find It Fast Facebook (opens in new window/tab) Twitter (opens in new window/tab) YouTube (opens in new window/tab) Instagram (opens in new window/tab) LinkedIn (opens in new window/tab) District Home Schools Plymouth Whitemarsh High School Colonial Middle School Colonial Elementary School Conshohocken Elementary School Plymouth Elementary School Ridge Park Elementary School Whitemarsh Elementary School Central Montco Technical High School Open Menu Logo Image Logo Title Students Parents/Guardians Staff Portal Alumni Find It Fast Open Search Search Clear Search Close Search About About Collaboration, Innovation, Inspiration With approximately 5,400 students and 750 employees, Colonial School District embraces a team approach to working and learning, encourages creative critical thinking to solve problems and fosters continuous improvement. Colonial Quick Facts Communications Equity, Inclusion, and Belonging (EIB) PA Future Ready Index (opens in new window/tab) History I'd Like To Know... Making A Difference Mission Non-Discrimination Statement Our Superintendent Points of Pride Staff Directory Student Spotlight Title I Program Volunteer Academics Academics Making learning relevant and fun Colonial School District’s academic curriculum challenges students to explore and discover new concepts and skills through project-based learning, integrated lessons and making real world connections. AVID Elementary Language Arts Report Card Guides Elementary Math Report Card Guides English As A Second Language PRIZE Summer Reading Community Community Location, location, location The Colonial School District covers Conshohocken Borough and Plymouth and Whitemarsh townships, in a thriving area of southeastern Pennsylvania that serves as a destination to live, shop, work and learn. Adult Evening School Business Partnerships CITV Community Announcements Community Links Facilities Request Day of Service Inclement Weather Communications Local Government Open Records Senior Citizen Programs Summer Camps Departments Departments Join Team Colonial Are you looking for a job in the Colonial School District? Click here to visit our Human Resources page! Central Registration Curriculum Human Resources Facilities & Operations Finance Food & Nutrition Services Pupil Services Technology Transportation Foundation Foundation Invest in Colonial Whether donating time, expertise or dollars, community support of the Colonial School District helps our schools to continue providing students the resources and experiences they need to be “future ready.” About CSDEF Annual Campaign Donate to the Foundation Foundation Day Cornhole Tournament Our Donors PW Alumni Association PWHS Athletic Honor Garden PW Scholarship Fund Staff Grants and Donations School Board School Board Going Paperless The Colonial School Board has moved to an online archive and organizational system called BoardDocs that houses all of the School Board meeting minutes, agendas, and policies. Many of the links to the right will take you directly to BoardDocs. Agendas and Minutes Archives (1997 through April 2018) Agendas and Minutes (opens in new window/tab) Board Members BoardDocs (opens in new window/tab) Committees Policies School Board Recognitions In This Section Agendas and Minutes Archives (1997 through April 2018) Agendas and Minutes (opens in new window/tab) Board Members BoardDocs (opens in new window/tab) Committees Policies School Board Recognitions Home > School Board In This Section Agendas and Minutes Archives (1997 through April 2018) Agendas and Minutes (opens in new window/tab) Board Members BoardDocs (opens in new window/tab) Committees Policies School Board Recognitions Board Members The nine members of the Colonial School Board are elected at large to serve the citizens of Conshohocken Borough and Plymouth and Whitemarsh Townships. The term of a board member is four years and the only compensation is the satisfaction of service to the community. Members attend more than 150 meetings and take part in official ceremonies and school functions each year. School Board Member Bios Beth Patruno, President Gail Plant, Vice President Richard Carpenter Jr. Chris Epstein Sharon Marino Mark Marsico Rasheda Randall Jeremy Schwartz William Winchester Jr. Beth Patruno, President A Whitemarsh Township resident, Beth Patruno was re-elected to a four-year term to the School Board in 2023, after having served a previous four-year term that began in December 2019. She was elected as Vice President in December 2021 and President in December 2022 and 2023. Mrs. Patruno is the director of a local preschool and has more than 10 years of experience teaching elementary school students in Philadelphia and working as a literacy specialist for Temple University’s College of Education. She served on the Ridge Park PTO Executive Board for five years, leading as co-president for three years. She has also been active in the Colonial Elementary School PTO. She volunteers with local community organizations, including her church. Mrs. Patruno holds a Bachelor of Arts degree from Gettysburg College and a Master of Science degree in Education from Drexel University. She has lived in the area since 2003 with her husband, Luciano, and her two children, Edward (Class of 2026) and Annie (Class of 2028), as well as two cats and a dog. Gail Plant, Vice President Mrs. Gail Plant brings more than 25 years of leadership experience from her career, church, and volunteer service to her role as a member of the Colonial Board of School Directors. She was re-elected to a four-year term on the Board in November 2021 and was elected Vice President in December 2022 and 2023. “I’m active with pursuing my dreams and goals, so when the call of action was ignited within me to run for a Colonial School Board Member seat in 2020, I responded with a firm ‘yes!’” Raised in an urban Philadelphia community, Mrs. Plant attended the Philadelphia public school system for her middle and high school years. She earned her Bachelor’s degree from Drexel University in Computer Information Systems and immediately began her 25+-year career. She received her Master’s Degree in Leadership Development in 2015 from Penn State University. Mrs. Plant’s family is one of her most joyous and proudest accomplishments. She is the wife of Ronald Plant and mother to three daughters — Sanahji, Zoraya, and Jaylah. They also include their Maltipoo, Nala, as part of the family. Mrs. Plant has lived in the Colonial Community for 15 years. “I firmly believe that our children’s overall wellbeing is of high priority and should be first and foremost when making decisions regarding their academics and overall interests,” said Mrs. Plant. “When I leave this earth, my aspiration is to have inspired all I came in contact with to open their minds and embrace all that God has planned for themselves, the community, the country, and the world.” Richard Carpenter Jr. A member of the Plymouth Whitemarsh High School Class of 1999, Rick Carpenter brings strong ties to the community and an extensive knowledge of technology to the Colonial School Board. “I'm excited to advocate for our students,” said Mr. Carpenter. “I hope members of the community find me approachable and willing to listen.” Mr. Carpenter is the president and owner of an information technology (IT) managed service provider in Blue Bell, Pa. His company offers IT consulting, provides help desk and managed security services for small businesses in the region, and donates time to work with nonprofit organizations on their IT infrastructure. He holds a bachelor's degree in IT from the College of William and Mary and a master's degree in Cybersecurity from Villanova. Outside of work, Mr. Carpenter can be found serving as division coordinator for Colonial Soccer, fields coordinator for Conshy Bulldogs Boys Lacrosse, and assistant division coordinator for Plymouth ABA Basketball, while coaching teams for soccer and basketball. He is also on the leadership council and is active in youth ministry at Storehouse Church. “This district has been such a positive for both me and my family,” said Mr. Carpenter. “I wanted to contribute to continuing Colonial's outstanding legacy as an asset to the community — and as a great place to learn and to work.” He married his wife Brooke in 2005. They have three boys: Cole, Tate, and Keene. Chris Epstein A Whitemarsh Township resident, Chris Epstein was re-elected to a four-year term to the School Board in 2023. Mrs. Epstein has volunteered extensively in Colonial schools having been active in various PTOs, the Plymouth Whitemarsh High School Post Prom Committee and the PWHS Band Boosters. She helped develop an after-school program at the Salvation Army in Philadelphia and assisted in mentoring children at a Salvation Army camp for 15 summers. Mrs. Epstein also serves as volunteer director of children’s ministry at her church. She has attended classes at Drexel University and Temple University. Sharon Marino An educational coach and consultant, Ms. Sharon Marino brings more than 20 years of experience working for the School District of Philadelphia to the Colonial School District, where she was appointed to the Colonial Board of School Directors in January 2021 and then re-elected in November 2023. “I am enjoying learning the systems, perspectives, and processes that support our school system and look forward to continuing to listen, learn, and collaborate with our students, families, educators, and community,” said Ms. Marino. While she was principal at McClure Elementary, the school improved their rating from “intervene” to “reinforce” on the School Progress Report and benefited from a number of grants to ensure access and opportunities for all students and their families. A proud member of the Philadelphia Academy of School Leaders and a Neubauer Fellow, Ms. Marino is using the knowledge and experience she gained as a teacher, coach, and principal to support current educational leaders in their craft. Ms. Marino has a Bachelor of Arts in English Literature from Rosemont College, a Masters in Elementary Education from St. Joseph's University, ESL (English as a Second Language) Certification from Penn State Abington, and Principal (K-12) Certification from Cheyney University. A resident of Conshohocken Borough, Ms. Marino has served on the Conshohocken Dog Park Committee and is a member of the Colonial Area Anti Racism and Social Equity Alliance. She is currently pursuing her Yoga/SEL teacher certification and plans to share her practice with teachers and students in underserved communities. Ms. Marino is married to her husband Mike and is “dog mom” to a pup named Dee. She enjoys traveling, playing softball, yoga, reading, and spending time with her father, siblings, and 14 nieces and nephews. Mark Marsico Bio coming soon! Rasheda Randall Mrs. Rasheda Randall brings more than 25 years of teaching experience and a dedication to service to her role on the Colonial Board of School Directors. She was appointed to the Board in December 2023. “Muhammad Ali said it best, ‘service to others is the rent you pay for your room here on earth,’” said Mrs. Randall. A graduate of Germantown Friends School, Mrs. Randall holds a Bachelor’s degree in Psychology with a Minor in Education from Bryn Mawr College, a Master’s Degree in Special Education from Arcadia University, and a Master of Science Degree in School and Mental Health Counseling from the University of Pennsylvania. She has used her education to teach in large urban school districts, as well as private and independent schools, where the student population has included incarcerated youth, undocumented youth, foster care and homeless youth, and adolescents receiving therapy in a behavioral health hospital. She currently teaches Special Education at a technology high school. Outside of the classroom, Mrs. Randall volunteers with Best Buddies, where she’s paired with an adult with special needs for social group outings like bowling or the movies. She also serves meals to people with food and shelter insecurity with her daughters through Philly Serves. Mrs. Randall lives in Plymouth Township with her husband Ahmed and is the proud parent of two daughters: Safiyah (Plymouth Whitemarsh High School Class of 2018 and recent Temple University graduate) and Rayannah (current PWHS student and member of the Bowling Team). The family has a box turtle named Optimus Prime and a rescue cat named Prince. “As the parent of Colonial School District students, I appreciate the support and guidance that my children receive from their teachers and support staff members daily,” said Mrs. Randall. “I look forward to learning about the many behind-the-scenes moving parts of a school district. I am excited to meet and dialogue with members of the Colonial School District community at both formal and informal events.” Mrs. Randall enjoys traveling, reading poetry, and learning about diverse cultures and languages. Her bucket list includes climbing to the summit of Mt. Kilimanjaro. Jeremy Schwartz Jeremy Schwartz brings his experience in finance and a sense of community to his role on the School Board. He was elected in 2023 to a four-year term. Mr. Schwartz, who holds a bachelor’s degree in accounting from Temple University, is currently employed in finance at the National Philanthropic Trust, one of the country’s largest grantmaking institutions. Previously he worked for a public accounting firm for 14 years. In the community, he serves on the Board of Trustees and holds the Treasurer role for a Lafayette Hill synagogue. He hopes to utilize his personal and professional background, along with other volunteer service, to further the mission of the Colonial School District. “School Board members should have the needs and well-being of all students, teachers, administrators, and all community members as the primary reason for getting involved, and I try to live by example while serving on the School Board,” he said. Mr. Schwartz has enjoyed the opportunity to meet teachers and students of all backgrounds across the District. Listening to students and teachers talk about the resources they have available to them, what they are doing to further their education, and what they are doing to make a positive impact on the world has been memorable. “I have a tremendous sense of community and look forward to meeting as many residents as I can to help foster the best environment possible for students and teachers,” he said. Mr. Schwartz lives in Whitemarsh Township with his wife and two children, a first-grader at Ridge Park Elementary School and a pre-schooler, and a boxer-mix named Violet. William Winchester Jr. Mr. William Winchester Jr. brings a dedication to being a voice for the community to his role as member of the Colonial Board of School Directors. “My favorite thing about being a School Board Director is knowing that I have a responsibility for the quality of education and, in turn, the ability to ensure we cultivate the best educated and most well-rounded students,” said Mr. Winchester. ”Our future is bright with these amazing children.“ His interests include making sure that the community’s concerns are addressed and encouraging efforts to stop bullying, intolerance, and intimidation. Originally from a small town in Delaware, Mr. Winchester served five years in the United States Marine Corps. He now holds a Bachelor of Science degree from Widener University and works in Biomedical Engineering Diagnostic Field Operations. As a volunteer in the community, Mr. Winchester is also the President of Brave Little Hearts for Michael and Friends, a nonprofit organization dedicated to supporting children with Congenital Heart Disease and their families. He has also coached Plymouth Little League and was involved in Cub Scouts and Boy Scouts of America with Pack 216. His family includes his wife Naomi and their four sons: William Lawrence, David Wallace, Izayah Johnathan, and Michael Richard Croix Winchester. Do you have a question? Click on an individual school board member's name to send him or her an email or click here to email the entire board . Beth Patruno , President Gail Plant , Vice President Richard Carpenter Jr. Chris Epstein Sharon Marino Mark Marsico Rasheda Randall Jeremy Schwartz William Winchester Jr. Upcoming School Board Meetings RSS Feeds Subscribe to Alerts September 18 , 2025 CBOSD General Meeting 7 : 00 PM Read More about CBOSD General Meeting October 13 , 2025 CBOSD Curriculum Committee Meeting 6 : 00 PM Read More about CBOSD Curriculum Committee Meeting October 16 , 2025 CBOSD General Meeting 7 : 00 PM Read More about CBOSD General Meeting October 22 , 2025 CSD Equity, Inclusion, and Belonging Committee Meeting 5 : 00 PM Read More about CSD Equity, Inclusion, and Belonging Committee Meeting November 3 , 2025 CBOSD Finance/Facilities Management & Transportation/Human Resources Committee Meetings 6 : 00 PM Read More about CBOSD Finance/Facilities Management & Transportation/Human Resources Committee Meetings Load More Events Logo Image 230 Flourtown Road Plymouth Meeting PA 19462 610-834-1670 Facebook (opens in new window/tab) Twitter (opens in new window/tab) YouTube (opens in new window/tab) Instagram (opens in new window/tab) LinkedIn (opens in new window/tab) The Colonial School District is committed to ensuring that all material on its website is accessible to students, faculty, staff and the general public. If you experience difficulty with the accessibility of any web pages or documents, please contact Kim Newell via e-mail at webmaster@colonialsd.org to request our materials in an alternate format. Privacy Policy Site Map Accessibility Statement Powered by Finalsite"
    }
  ]
}