{
  "fuentes": [
    {
      "url": "https://www.colonyclubohio.com/",
      "email": "packages@greercommunities.com"
    },
    {
      "url": "https://www.colonyclubohio.com/",
      "email": "rentaloffice@colonyclubohio.com"
    },
    {
      "url": "https://colonyclub.com/amenities/colony-hall/",
      "email": "cgraybeal@colonyclub.com"
    },
    {
      "url": "https://colonyclub.com/contact/",
      "email": "ircc@fourstarrealestate.com"
    }
  ],
  "mails": [
    "cgraybeal@colonyclub.com",
    "ircc@fourstarrealestate.com",
    "packages@greercommunities.com",
    "rentaloffice@colonyclubohio.com"
  ],
  "nombre_sitio": "colonyclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.colonyclubohio.com/",
      "text": "Property Management | Colony Club Apartments | Columbus OVERVIEW TERMS FLOOR PLANS PHOTOS TENANTS APPLY CONTACT TENANT PORTAL COLONY CLUB APARTMENTS A Property of Greer Communities, LLC Apply Now 1 & 2 BR Apartments in a Nature Infused Community Colony Club is nestled on several acres featuring green space, trees and a creek.  Ducks, rabbits and other wildlife are known to call us home as well.  We are conveniently located to Kroger (grocery), dining, banking, bus stops and pharmacy.  Nearby is Ohio State University, the new west campus technology development area, new retail shops and dining at Arlington Gateway and SR 315, 670 and downtown Columbus. We offer a quiet community in a serene environment close to where you will want to be. Our apartment homes feature concrete block construction between units for added sound and fire protection, central heat and air conditioning, refrigerator, stove, dishwasher and microwave, an \"ALL INCLUSIVE\" utility bundle and a dedicated Package Room.  Our management and maintenance team are top notch!  We can't wait to welcome you home! Terms PETS | Sorry, no pets DEPOSIT | $400 or Deposit Alternative APPLICATION FEE | $50 RENT RANGE | $900 - $1345 View our Property Brochure to learn more! AMENITIES Attended Package Room Green Space Sparkling Pool Sundeck Recently Remodeled On-Site Laundry Free Off-Street Parking On Site Resident Manager Fitness Room Dishwasher Microwave Patio/Balcony Options Car Wash Area Central Heating & Air Conditioning Walk-In Closet Options Smoke/Vape Free All-inclusive utility package (heat/air/gas/water) 24 Hour Flock Surveillance System Tenant Portal Window Coverings Quiet Environment Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Floor Plans 1 BEDROOM 600 sqft 2 BEDROOM OPEN 800 sqft 2 BEDROOM BREAKFAST BAR 800 sqft Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button PACKAGE ROOM PACKAGE ROOM HOURS Mon – Fri:   10:00 AM – 1:00 PM 4:30 PM – 6:00 PM Saturday:   12:00 PM – 2:00 PM Sunday:      CLOSED PACKAGE ROOM CONTACT Email: Packages@GreerCommunities.com Phone:   614.505.4700 ext. 2 We'd Like You To Know Smoking & vaping is not permitted We are a no pets community ﻿ We are a quiet environment with no parties, loud music, etc. Our Laundry Rooms are recently remodeled with easy access Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Online Portal computer icon - click to login to pay rent online Pay Rent Online Securely pay rent online from anywhere. Set up automatic payments so you pay on time. tool icon - click to submit a maintenance request Maintenance Request Quickly submit maintenance requests that go directly to our maintenance queue. computer icon - click to sign up to access online portal Sign Up Sign up today to pay rent, submit maintenance requests, and view your online account from anywhere. Contact Us Send us a message and we’ll get back to you as soon as possible. Contact Us Name Email Phone Message Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later Contact (614) 505-4700 RentalOffice@ColonyClubOhio.com 1190 Chambers Road, Columbus, OH 43212 Rental Office Hours Mon – Fri:   10:00 AM – 1:00 PM 3:00 PM – 6:00 PM Saturday:   11:00 AM – 2:00 PM Sunday:      CLOSED Sitemap | Accessibility © All Rights Reserved. Colony Club Apartments Share by:"
    },
    {
      "url": "https://colonyclub.com/amenities/colony-hall/",
      "text": "Colony Hall - Banquet Hall - Indian River Colony Club Home About Us About Us Social & Golf Memberships More Services Newsletters IRCC in the News Residents/Stories Our Location: The Space Coast Resident Testimonials Maintenance Program Real Estate Real Estate Home Listings Featured Home Floorplans Contact Real Estate Golf Golf Tournaments and Outings Hole by Hole Yardage Matrix Amenities Amenities At Ease Club Tennis Social Groups Pool Overview – Golf at IRCC Colony Hall Weddings at IRCC Galleries Photo Galleries Video Gallery US Military US Military History Contact/Directions Hours of Operation MENU 321-255-6000 Member Login Follow Us: Colony Hall Colony Hall Banquet Facilities\nMeetings, Weddings and Private Parties Book your Wedding, Bar/Bat Mitzvah, Corporate meetings and Private Parties Open to the public for banquet rentals and special events, and comfortably seats up to 220 guests. For standing events, such as cocktail parties, Colony Hall supports up to 300 guests. Colony Hall at Indian River Colony Club offers the perfect setting for your next special occasion or business function. Download Special Occasion Menu Download Colony Hall printable information Weddings at IRCC For your perfect day… the perfect wedding and reception at Indian River Colony Club. See More about Weddings at IRCC Features • Bridal Room\n• Chapel\n• Dance floor\n• Full Stage\n• Distinguished Red Oak Bar\n• Wi-Fi\n• Large Projection Screen For information or scheduling events, call our Club Events Manager at 321-255-6050. You can also email your requests for information to: cgraybeal@colonyclub.com . About IRCC View our introduction video IRCC Newsletters Join Our Newsletter Current Weather MELBOURNE/VIERA WEATHER Brochures Download IRCC Brochure Download Social Membership Brochure Home About Us Newsletters IRCC in the News Local Resources Resident Testimonials Amenities Colony Hall At Ease Club Pool Social Groups Tennis Real Estate US Military Golf Maintenance Memberships Available Contact Privacy Policy Cookies Notice Copyright © 2018 - 2025 Indian River Colony Club | Designed by Green Man Creations Disclaimer: The appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement. Home About Us About Us Social & Golf Memberships More Services Newsletters IRCC in the News Residents/Stories Resident Testimonials Our Location: The Space Coast Maintenance Program Real Estate Real Estate Home Listings Featured Home Floorplans Contact Real Estate Amenities Amenities At Ease Club Colony Hall Tennis Social Groups Pool Weddings at IRCC Golf Golf Overview – Golf at IRCC Hole by Hole Yardage Matrix Tournaments and Outings Galleries Photo Galleries Video Gallery US Military US Military History Contact/Directions Book A GetAway! This website uses cookies We use cookies to better understand how you interact with our website, and how to better serve our information to you, using third party tools such as Google Analytics, Google Tags, Google Ads, and Facebook. Cookies are also used to help personalize your experience on our website, track conversions, and to help serve our ads via Google and Facebook services based on your previous search history and web browsing behavior. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information . Cookie Settings Reject All Except Necessary Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description _GRECAPTCHA 5 months 27 days This cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks. cookielawinfo-checkbox-advertisement 1 year Set by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category . cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". CookieLawInfoConsent 1 year Records the default button state of the corresponding category & the status of CCPA. It works only in coordination with the primary cookie. viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes This cookie, set by Cloudflare, is used to support Cloudflare Bot Management. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. _ga_7VX52F0C6J 2 years This cookie is installed by Google Analytics. _gat_gtag_UA_6914591_1 1 minute Set by Google to distinguish users. _gcl_au 3 months Provided by Google Tag Manager to experiment advertisement efficiency of websites using their services. _gid 1 day Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description _fbp 3 months This cookie is set by Facebook to display advertisements when either on Facebook or on a digital platform powered by Facebook advertising, after visiting the website. fr 3 months Facebook sets this cookie to show relevant advertisements to users by tracking user behaviour across the web, on sites that have Facebook pixel or Facebook social plugin. VISITOR_INFO1_LIVE 5 months 27 days A cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface. YSC session YSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages. yt-remote-connected-devices never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. yt-remote-device-id never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. yt.innertube::nextId never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. yt.innertube::requests never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Cookie Duration Description b_fgNz- 1 day No description OmdalzGo 1 day No description wcgoR_rHEJPO 1 day No description YOi_HJFkKhuVQsCz 1 day No description SAVE & ACCEPT Powered by"
    },
    {
      "url": "https://colonyclub.com/contact/",
      "text": "Contact Us - Location/Directions - Indian River Colony Club Home About Us About Us Social & Golf Memberships More Services Newsletters IRCC in the News Residents/Stories Our Location: The Space Coast Resident Testimonials Maintenance Program Real Estate Real Estate Home Listings Featured Home Floorplans Contact Real Estate Golf Golf Tournaments and Outings Hole by Hole Yardage Matrix Amenities Amenities At Ease Club Tennis Social Groups Pool Overview – Golf at IRCC Colony Hall Weddings at IRCC Galleries Photo Galleries Video Gallery US Military US Military History Contact/Directions Hours of Operation MENU 321-255-6000 Member Login Follow Us: Contact Our Location Indian River Colony Club is conveniently located in Brevard County FL. We are in the beautiful town of Viera, minutes from the beaches, fine shopping, dining, area hospitals, arts and entertainment, Patrick Space Force Base, Kennedy Space Center, Orlando International Airport, Melbourne International Airport, and much more. To visit IRCC, take I-95 to exit 191 Wickham Road. Travel east on Wickham Road. Make a left turn onto Murrell Road (across the street from the Brevard Zoo). Gated entrance is on the right at Old Glory Blvd. 1936 Freedom Drive Viera (Melbourne), Florida 32940 Phone: 321-255-6000 email: ircc@fourstarrealestate.com General Hours of Operation * * Hours are subject to change depending on community events or holidays. Administration Office Mon – Fri: 8:00 AM – 5:00 PM Sat – Sun: Closed Closed on U.S. National Holidays Residential Maintenance Mon – Fri: 7:30 AM – 5:00 PM Sat: 7:00 AM – 5:30 PM Sun: Closed Holiday Weeks: 8:00 AM – 4:30 PM At Ease Club (Clubhouse) Clubhouse Administration Sun – Mon: 10:00 AM – 2:00 PM Tues – Sat: 10:00 AM – 5:00 PM Main Dining Room Closed Monday & Tuesday except for special events Wed – Sat: 11:00 AM – 2:00 PM – Lunch Wed – Sat: 5:00 PM – 8:00 PM – Dinner Sunday Brunch: 11:00 AM – 1:00 PM Sunday Breakfast Buffet: 10:00 AM – 1:00 PM 19th Hole Lounge Mon: 11:00 AM – to 3:00 PM – Hot Dogs Mon: 11:00 AM – 4:00 PM – Beverages & Snacks Tues – Sat: 11:00 AM – 8:00 PM Closed Sundays (except for special events) Four Star Real Estate Office Mon – Sat: 9:00 AM – 5:00 PM Sun: 1:00 PM – 5:00 PM Recreation Pro Shop Sunday: 8:00 AM – 1:00 PM Mon – Fri: 7:30 AM – 3:30 PM Saturday: 7:30 AM – 3:00 PM Fitness Center Monday: 7:00 AM – 5:00 PM Tues – Sat: 7:00 AM – 8:30 PM Sunday: 7:00 AM – 2:00 PM Golf Course, Driving Range, Practice Greens Daily: 7:30 AM – Dusk Pool Daily: Sunrise – Sunset Croquet Tennis, Bocce, Shuffleboard Courts, Pavilions Daily: Sunrise – Sunset Real Estate & General Questions Call us or complete the form below to receive our informational package. Thank you for your interest in Indian River Colony Club! First Name (required) Last Name (required) Your Email (required) Your Phone (required) Your Postal/Zip Code (required) Have you or your spouse served in the military? Yes No Do you or your spouse play golf? Yes No How did you hear about IRCC? (Choose all that apply) 55Places.com Air Force Magazine At Ease Magazine Caltrap College Football Program Facebook Advertisement Facebook 'Five Things' MOAACC Email FloridaForBoomers.com GolfAdvisor.com GolfCourseHome.com GolfLifeNavigators.com Google Ad Leatherneck Magazine Marine Corps Gazette MarineShop.net MOAA.org Ad Military Officer Magazine (MOAA) One Senior Place PrivateCommunities.com Senior Life The Long Blue Line Magazine The Montclairion Newsletter The Villages Daily Sun The Voice (TREA) TopRetirements.com TV Ad - Golf Network TV Ad - News 13 U.S. Naval History Magazine Viera Voice Newspaper Referred by a Member/Friend Internet Search Other If you chose \"Internet Search\", \"Referred by Member/Friend\", or \"Other\", please provide details: (What keywords did you search for? Name of member/friend who referred you? or, What other way did you find us?) Comments / Questions By checking this box, I agree with the Privacy Policy , Cookies Notice , and I consent to share my information with, and receive communications from Indian River Colony Club Please leave this field empty. About IRCC View our introduction video IRCC Newsletters Join Our Newsletter Current Weather MELBOURNE/VIERA WEATHER Brochures Download IRCC Brochure Download Social Membership Brochure Home About Us Newsletters IRCC in the News Local Resources Resident Testimonials Amenities Colony Hall At Ease Club Pool Social Groups Tennis Real Estate US Military Golf Maintenance Memberships Available Contact Privacy Policy Cookies Notice Copyright © 2018 - 2025 Indian River Colony Club | Designed by Green Man Creations Disclaimer: The appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement. Home About Us About Us Social & Golf Memberships More Services Newsletters IRCC in the News Residents/Stories Resident Testimonials Our Location: The Space Coast Maintenance Program Real Estate Real Estate Home Listings Featured Home Floorplans Contact Real Estate Amenities Amenities At Ease Club Colony Hall Tennis Social Groups Pool Weddings at IRCC Golf Golf Overview – Golf at IRCC Hole by Hole Yardage Matrix Tournaments and Outings Galleries Photo Galleries Video Gallery US Military US Military History Contact/Directions Book A GetAway! This website uses cookies We use cookies to better understand how you interact with our website, and how to better serve our information to you, using third party tools such as Google Analytics, Google Tags, Google Ads, and Facebook. Cookies are also used to help personalize your experience on our website, track conversions, and to help serve our ads via Google and Facebook services based on your previous search history and web browsing behavior. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information . Cookie Settings Reject All Except Necessary Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description _GRECAPTCHA 5 months 27 days This cookie is set by the Google recaptcha service to identify bots to protect the website against malicious spam attacks. cookielawinfo-checkbox-advertisement 1 year Set by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category . cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". CookieLawInfoConsent 1 year Records the default button state of the corresponding category & the status of CCPA. It works only in coordination with the primary cookie. viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes This cookie, set by Cloudflare, is used to support Cloudflare Bot Management. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description _ga 2 years The _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors. _ga_7VX52F0C6J 2 years This cookie is installed by Google Analytics. _gat_gtag_UA_6914591_1 1 minute Set by Google to distinguish users. _gcl_au 3 months Provided by Google Tag Manager to experiment advertisement efficiency of websites using their services. _gid 1 day Installed by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously. CONSENT 2 years YouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description _fbp 3 months This cookie is set by Facebook to display advertisements when either on Facebook or on a digital platform powered by Facebook advertising, after visiting the website. fr 3 months Facebook sets this cookie to show relevant advertisements to users by tracking user behaviour across the web, on sites that have Facebook pixel or Facebook social plugin. VISITOR_INFO1_LIVE 5 months 27 days A cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface. YSC session YSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages. yt-remote-connected-devices never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. yt-remote-device-id never YouTube sets this cookie to store the video preferences of the user using embedded YouTube video. yt.innertube::nextId never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. yt.innertube::requests never This cookie, set by YouTube, registers a unique ID to store data on what videos from YouTube the user has seen. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Cookie Duration Description b_fgNz- 1 day No description OmdalzGo 1 day No description wcgoR_rHEJPO 1 day No description YOi_HJFkKhuVQsCz 1 day No description SAVE & ACCEPT Powered by"
    }
  ]
}