{
  "fuentes": [
    {
      "url": "https://lamedusaseattle.com/get-in-touch",
      "email": "meredith@lamedusarestaurant.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "email": "carolineo@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://columbiahospitality.com/about/team/",
      "email": "info@columbiahospitality.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "carolineo@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "colcele@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "colsand@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "colsara@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "columbiacafe@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "colybor@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "email": "cst.augustine@crg1905.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.columbiarestaurant.com/about-us",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiasportswearvb.com/contactus.html",
      "email": "customer.service@mercer.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.1columbiaplace.com/get-in-touch",
      "email": "columbiaplacepm@regentproperties.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/join-our-team",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/historic-district-st-augustine",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/historic-district-st-augustine",
      "email": "cst.augustine@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/menusbylocation",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/hurricane-ian-update",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/in-the-news",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/faq",
      "email": "comments@crg1905.com"
    },
    {
      "url": "https://www.columbiarestaurant.com/accessibility-statement",
      "email": "comments@crg1905.com"
    }
  ],
  "mails": [
    "carolineo@crg1905.com",
    "colcele@crg1905.com",
    "colsand@crg1905.com",
    "colsara@crg1905.com",
    "columbiacafe@crg1905.com",
    "columbiaplacepm@regentproperties.com",
    "colybor@crg1905.com",
    "comments@crg1905.com",
    "cst.augustine@crg1905.com",
    "customer.service@mercer.com",
    "info@columbiahospitality.com",
    "info@reception-plus.de",
    "meredith@lamedusarestaurant.com"
  ],
  "nombre_sitio": "columbiarestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://lamedusaseattle.com/get-in-touch",
      "text": "Get in Touch — La Medusa Restaurant Columbia City Skip to Content Open Menu Close Menu Home Order Gift Certificates Get in Touch 0 0 Home Order Gift Certificates Get in Touch 0 0 Open Menu Close Menu Home Order Gift Certificates Get in Touch Have a Question? Ask it here… The best way to get in touch if you have questions is to use this form, or send us a text message. If you’d like to make a reservation please call or text us at the number below. (206) 723-2192 Ask a question here Please leave your name and email address so we can answer your question as quickly as possible.  If you prefer we contact you by phone please leave your phone number also!  PLEASE DO NOT USE THIS FORM FOR RESERVATION REQUESTS. First Name Last Name Email * Phone (###) ### #### What is your question? * Thank you for reaching out to us!  We will get back to you as soon as possible! Sign up here to receive occasional updates from us by email. Email Address Sign Up Thank you! We will post the menu our site on Tuesday evenings and by email on Wednesday.  We will have a limited number of meals available each weekend so make sure to plan ahead! La Medusa Restaurant    4857 Rainier Ave S. Seattle, WA 98118    206.723.2192"
    },
    {
      "url": "https://www.columbiarestaurant.com/ybor-city-tampa",
      "text": "Ybor City, Tampa | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Ybor City, Tampa Live music, gourmet food and more than 120 years of history. Visit The Original Columbia Restaurant in Ybor City, Tampa. RESERVATIONS Hours Of Operation: 11 a.m. - 9 p.m. Sunday through Thursday 11 a.m. -  10 p.m. Friday & Saturday To Order Convenient Curbside Pickup: CALL NOW For Events, Banquets And Catering: Contact us 2117 E. 7th Ave., Tampa, FL 33605 Donation & Sponsorship Requests Lunch Menu dinner Menu Flamenco Show Named \"One of Florida's Top Restaurants\" since 1967. Located at 2117 E. 7th Ave., the Columbia Restaurant has a total of 52,000 square feet with seating for up to 1,700 customers and encompasses an entire city block. It earned the \"Distinguished Restaurants of North America Award of Excellence\" 2005 - 2008, one of the most prestigious awards in the fine dining industry. 1903 Cafe Dining Room The 1903 corner saloon transformed into the Columbia Restaurant in 1905, using the same iconic bar. Today, the Cafe Dining room is one of 15 dining rooms in the restaurant. Read More 1935 The Red Room Opened in 1935 with the Don Quixote dining room, then known as the Red Lounge bar in the 1960s and '70s, this dining room once featured entrances to the restaurant's secret speakeasy. Read More 1937 El Patio Balcony The balcony above the Patio Dining Room features exquisite hand-painted tiles and expansive access to natural light. Read More 2001 La Familia Dining Room The Familia de Casimiro was named in honor of the founder of the restaurant, Casimiro Hernandez Sr., and is designed to resemble a Spanish wine cellar, with space for private meetings. Read More 1920 La Fonda Dining Room Once its own restaurant neighboring the Saloon Columbia, La Fonda became a Columbia Restaurant dining room at the start of Prohibition. Read More 1937 Kings Room The Kings Dining room offers private dining and a dance floor for special events such as banquets and ceremonies.  Portraits of past and present Kings & Queens of the Krewe of the Knights of Sant' Yago of Gasparilla hang on the walls. Read More 1937 Sancho Panza Dining Room This dining room, named for Don Quixote's faithful companion, opened the same year as El Patio because of the success of the Don Quoxite Dining Room. Read More 2001 Andalucia Dining Room This is one of two new dining rooms built in the restaurant since the 1950s. The Andalucia dining room seats up to 80 people. Read More 1935 Don Quixote Dining Room When the Don Quixote Room opened in 1935 it became not only Tampa’s first air-conditioned dining room, but also featured colorful tiles depicting the windmill-tilting character of Cervantes’ classic novel. Read More 1937 El Patio Dining Room The colorful mosaic-tiled fountain in the Patio Dining Room has a statue in the middle called \"Arion and the Dolphin.” The statue is a replica of a sculpture found in the ruins of Pompeii. Read More 1955 El Siboney Dining Room Opening on New Year’s Eve 1955, the Siboney Room once featured two fountains, sculptures, paintings, tapestries and antiques. Today, this ballroom hosts flamenco performances and large banquets. Read More 2002 Don Quixote Mezzanine In 2001, 4th-generation caretaker Richard Gonzmart rebuilt the original Don Quixote Mezzanine from the room's opening in 1935. Read More Room By Room - Ybor Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://columbiahospitality.com/about/team/",
      "text": "Columbia Hospitality | Hospitality Management & Consultancy Skip to Main Content About Company & Culture Team Columbia Cares Diversity, Equity & Inclusion Press Awards & Accolades Collection Solutions Our Approach Hotels & Resorts Restaurants & Bars Residential Golf Distinctive Venues Health, Wellness & Spas Support Services & Consulting Join Our Team Contact Us Join Our Team Contact Us About Company & Culture Team Columbia Cares Diversity, Equity & Inclusion Press Awards & Accolades Collection Solutions Our Approach Hotels & Resorts Restaurants & Bars Residential Golf Distinctive Venues Health, Wellness & Spas Support Services & Consulting Join Our Team Contact Us LEADERS, COLLABORATORS, AND MENTORS To know Columbia Hospitality is to appreciate a seasoned startup, fueled by an energized and charismatic team of leaders, empowered to make a difference in the lives of those around them. This is a team of truly remarkable people who acknowledge that hard work and smart work are one and the same, who applaud the importance of strong mentorship, and leading by example is second nature. Hospitality runs in their veins - they are collaborators and the very best at what they do. MEET THE TEAM All Leadership Business Development & Operations Finance & Accounting Food & Beverage Golf IT People & Culture Residential Sales, Marketing, & Revenue Management Senior Leadership Alaura Rice Director, Training Operations Alaura Rice Director, Training Operations Alaura Rice brings 18 years of experience in the service industry, with the last decade dedicated to a blend of operations and learning development. This unique background allows her to balance strategy with practicality, ensuring that training initiatives not only inspire but also drive measurable results. Guided by a mentor’s advice—“We spend most of our lives at work, so why not change how we experience it?”—Alaura is passionate about transforming workplace experiences to create environments where people thrive. As Director of Training Operations, Alaura empowers line-level team members through impactful training and drives operational efficiency with L&D initiatives across the organization. She continues to lead key programs with a renewed focus on service excellence. Working closely with leaders and trainers in the field, Alaura ensures training aligns with business goals and supports both individual and organizational growth. Outside of work, Alaura enjoys exploring new countries, savoring exciting food, visiting local coffee shops, and relaxing with her French bulldog, Zoey Leigh. She finds constant inspiration in the strength, grace, and humanity of her family and friends, always nurturing meaningful connections wherever she goes. ANDREW OLSEN Senior Vice President ANDREW OLSEN Senior Vice President As SVP, Andy leads the hotel consulting and asset management divisions, in addition to overseeing a variety of properties. Andy has held management positions with national hotel companies including Westin Hotels & Resorts, and Hilton Hotels Corporation. Andy also co-founded Seattle-based The Chambers Group, Inc. Discovering an opportunity to align with a group of industry peers and longtime friends who could provide the structure The Chambers Group needed, the company was acquired as a division of Columbia Hospitality in March 2011. Andy has served as director of management advisory services at Laventhol & Horwath for the Pacific Northwest region and is a current member of the International Society of Hospitality Consultants. Andy has been an adjunct faculty member at the Washington State University School of Hotel Business Management and serves on the advisory board for Washington State University’s hospitality program. He is also the former chair of the Washington Lodging Association. Andy is a Cornell University graduate with a B.S. from the School of Hotel Administration. Andy was born in Seattle but raised in Connecticut (from age 3 to 20), so, in essence Andy has East Coast/West Coast dual citizenship. ASHLEY ASHER Senior Director, Sales ASHLEY ASHER Senior Director, Sales As Senior Director of Sales, Ashley oversees the company-wide sales efforts, formulating strategic goals, mentorship and sales coaching and leads aggressive sales plans for group business at Columbia Hospitality properties. Ashley’s knowledge spans the hospitality spectrum, having worked across many market segments and disciplines within the sales world, including positions with luxury brands such as Four Seasons and Waldorf Astoria, as well as iconic properties like Ojai Valley Inn & Spa. Ashley is a University of Washington graduate and a native of northern California. She returned to the Pacific Northwest 12 years ago. She currently resides on Capitol Hill in Seattle with her husband. BRIAN FLAHERTY CEO BRIAN FLAHERTY CEO With over four decades of management and leadership experience, Brian has built a career spanning a broad range of hospitality enterprises. Based in the Seattle area since 1999, he played a pivotal role in launching Hotel 1000 while working with MTM Luxury Lodging. Brian also served as General Manager at Seattle’s iconic Four Seasons Olympic Hotel and the Bellevue Club/Hotel Bellevue. Brian is a Broward College graduate, and before setting his roots in the Pacific Northwest, he spent 16 years with Four Seasons Hotels and Resorts, leading teams across North America. His hospitality journey began with The Mariner Group in southwest Florida, creating the foundation for his lifelong passion for delivering exceptional guest experiences. Brian now resides on Mercer Island with his wife of over 40 years, Kitty. Together, they cherish time spent with their two daughters, son-in-law, grandson and close family and friends. Whether exploring the outdoor wonders of the Pacific Northwest, savoring food, and wine, traveling, or diving into his love for technology and reading, Brian thrives on meaningful connections and all the adventures life has to offer. Brooke Adams Vice President, Marketing Brooke Adams Vice President, Marketing As Vice President of Marketing, Brooke focuses on strategic brand communications and media relations, in addition to campaign creative oversight and team building. Brooke started her career supporting famed Italian restaurateur Sirio Maccioni, at New York City’s, Le Cirque. She took her depth of hospitality communications experience and applied it as Director of Public Relations at Eataly, launching its first U.S. location and developing media strategy and events. Upon moving to the West coast, Brooke joined Little Green Pickle, a Portland, Oregon based agency specializing in hospitality and tourism public relations where she worked for eight years and as Vice President, focused on business development and strategy. Brooke is a Middlebury College graduate with a B.A. in International Studies and speaks Italian and French. She has served as Chairperson of Middlebury Alumni Admissions Program and on the board as President of New York Celebrity Assistants. She lives in Seattle and is married with two Australian cattle dog mixes. Brooke loves foraging for mushrooms and hiking (usually accomplishing both at the same time). When she is not in the outdoors, she enjoys traveling, dining and venturing across the U.S.-Canadian border for dim sum in Richmond, BC. The best word to describe Brooke is: tenacious. CHUCK HILL President, CH Real Estate CHUCK HILL President, CH Real Estate As President of Columbia Hospitality Real Estate, Chuck leads real estate development activities and assists with business development and the overall growth of the company through various investment initiatives. Chuck’s expertise encompasses business and executive management, strategic planning, finance, property acquisition and disposition. Prior to joining Columbia Hospitality, Chuck was the CEO of Pistol Creek Company, a large, privately held investment company. Chuck also served as Controller for Lowe Enterprises Northwest, a real estate pension fund management company, where he was responsible for all areas of finance and accounting. Early in his career Chuck was an auditor and CPA with KPMG. Chuck is a Purdue University graduate with a Bachelor of Science degree in accounting. He resides in Seattle and enjoys hiking, biking, and boating, plus Seattle’s hot restaurant scene. He has summited Mt. Rainier and is teaching himself to play piano. The best way to describe Chuck is: honest. DAVE WILLIAMS Chief Financial Officer, CH, President Oppenheimer Ventures DAVE WILLIAMS Chief Financial Officer, CH, President Oppenheimer Ventures As CFO, Dave oversees all aspects of finance and accounting for Columbia Hospitality and its managed properties; accountable for all financial and fiscal management aspects of company operations, cost control systems, and evaluating investment opportunities for Columbia and its owners. A leader in the financial services industry for more than 20 years, Dave has an extensive background across a series of companies ranging from large publicly traded organizations to small private businesses. Dave has held positions as the CFO of Cascadia Capital and worked as SVP and CFO of various business divisions of Washington Mutual and JP Morgan Chase. Dave is a graduate of the Foster School of Business at the University of Washington.   He lives in Seattle with his wife and two teenagers and enjoys spending time with his family doing a variety of outdoor activities, including hiking, skiing, kayaking and golfing. Interesting fact, Dave writes left-handed but does everything else right-handed. He is adept at simplifying complex ideas and the best word to describe Dave is: problem-solver. DORIS CHRISTENSON Senior Vice President, Accounting/Finance DORIS CHRISTENSON Senior Vice President, Accounting/Finance As Senior VP of Accounting, Doris oversees operational accounting as well as payroll processing for all managed properties and guides the Seattle Support Center (SSC) accounting team. Doris is a highly respected financial professional with a huge depth of experience in the hospitality industry. Her hospitality career began at the Olympic/Four Seasons Hotel in Seattle. Initially joining the hotel as a housekeeper, she held positions in a variety of departments including reservations, front desk, sales, executive administration and finally in accounting as assistant controller. A Sumner, WA native, Doris is a graduate of Central Washington University with a bachelor’s degree in Finance. In her spare time, she loves spending time with family and enjoys traveling, reading and country western dancing. Doris grew up in Western Washington as one of six children (three boys and three girls) and they all get along! The best word to describe Doris is: focused. GREG PRESCOTT Senior Director, Talent GREG PRESCOTT Senior Director, Talent As Senior Director of Talent, Greg’s primary focus is the executive search arm of Columbia’s business, which includes sourcing the best hospitality talent across the globe to bring significant value to our clients. A passionate hospitality professional, Greg’s industry knowledge and experience is diverse and well-rounded, including business development, operations, human resources, and talent acquisition. Greg has been at the helm of our recruitment team for over a decade; overseeing the strategy to place more than 11,000 individuals internally during a time when Columbia increased its portfolio to 80+ managed properties. This includes over 600 leaders across Columbia and our Executive Search arm. Greg joined Columbia in 2011 when he was selected as the food and beverage manager at Salish Lodge & Spa. He subsequently served as the rooms division manager, as well as recruiter, talent manager, director of new business development, and director of organizational development for Columbia. In 2016, he was honored by 425 Business Magazine as a 30 under 30 awardee. In 2017, he received the same honors from Hotel Management Magazine. Greg is a Washington State University graduate with a bachelor’s degree in Hospitality Business Management. He enjoys traveling the world, experiencing different cultures, locales and hospitality properties and cultures. He is energized by connecting great people with great opportunities. He finds that there is no greater satisfaction than, “seeing people grow personally and professionally and knowing I had a small part in that journey.” He is a craftsman and a ‘MacGyver-style’ engineer and builder. And the best word to describe Greg is: ambitious. HUGO MORENO Senior Vice President, People and Culture HUGO MORENO Senior Vice President, People and Culture As the Senior Vice President, People and Culture, Hugo provides direction and support for engagement initiatives, service excellence, talent acquisition and retention, workplace culture and benefits. His passion for employee relations guides his interactions with his 11-member team as well as with Columbia Hospitality’s properties. Prior to joining Columbia Hospitality, Hugo was Director of HR at the MOD Pizza Support Center where he led the People Support Team for over 400 stores and 7000-plus employees. He also held HR positions with Two Roads Hospitality as the Area Director of People, Levy Restaurants at CenturyLink Field, and Sage Hospitality. Hugo is a University of Guadalajara graduate with a Bachelor of Arts in Psychology, as well as a Masters in HR Management from National University in San Diego. Hugo enjoys spending time with family and he loves to travel and learn about other cultures. Raised in Guadalajara, Mexico, Hugo is passionate about diversity and inclusion and is fluent in Spanish. He is a natural-born problem-solver and the best word to describe Hugo is: happy! Hyono Kim Senior Director, People Systems Hyono Kim Senior Director, People Systems As Senior Director of People Systems, Hyono plays a pivotal role in overseeing and managing Columbia Hospitality’s Human Resources Information Systems to streamline HR processes, enhance data accuracy, and support strategic decision-making. This includes planning, implementation, and maintenance of HRIS software and technology solutions, ensuring they align with the company’s goals and compliance requirements. Prior to joining Columbia, Hyono held consulting roles leading large HCM implementation teams, planning and execution of solution architectures as well as effectively managing timelines and cross-functional project teams. Hyono is a Western Washington University graduate with a bachelor’s degree in International Business. In his free time, Hyono enjoys exploring new places, playing any racket sports, and most importantly enjoys spending time with friends and family. James Oppenheimer Vice President, Business Development James Oppenheimer Vice President, Business Development James focuses on business development, onboarding incoming properties to Columbia Hospitality, preopening advising for properties in development, and operations oversight of various hotel properties. In addition to hotel operations, James oversees financial planning & analytics for hospitality assets in development at CH. This includes cash flow forecasting, preopening budget generation, owner return analysis, and operations programmatic design and analysis. James brings a blended perspective of hands-on property operations, finance, and strategy experience. He has worked in various leadership roles at the Heathman Hotel Kirkland, Salish Lodge & Spa, and The State Hotel. Before joining Columbia Hospitality, he worked at Northern Trust Bank in Chicago working in commercial lending and strategy. James is a University of Puget Sound graduate with a Bachelor of Science in Economics. He lives with his wife, Tess in Seattle and enjoys spending time with friends and family, snow skiing, water skiing, running, and cooking. James enjoys the innate ability of being personable and inquisitive. Janet  Christopher Chief Marketing Officer Janet  Christopher Chief Marketing Officer Janet has more than 20 years of experience across the hospitality, travel, and tourism industries working in various locations and managing offices around the globe. Prior to joining Columbia Janet worked as Senior Vice President at Miles Partnership, a global marketing agency with expertise in the travel and tourism industry. Janet also worked as Vice President of Marketing, managing financial operations and marketing strategy for the largest corporate housing company in the world. Prior to that, she was the Vice President of Tourism for Visit Seattle, where she was responsible for all overseas and international strategy, sales, marketing, communications and public relations for tourism promotion to Seattle. Janet started her hospitality career on the hotel side of the business, working for Four Seasons Hotels and Resorts in Greater Seattle and Maui, Hawaii. She has a passion for customer service, brand strategy, and servant leadership. When Janet isn’t working, she’s exploring or planning her next trip. Jeff Sprague Vice President, Accounting & Finance Jeff Sprague Vice President, Accounting & Finance As Vice President of Accounting & Finance, Jeff plays a critical role in overseeing the financial operations for half of our hotel portfolio. With a distinguished background in hotel financial management, his expertise spans across industry-leading brands such as Four Seasons, Wyndham, Westin, Pan Pacific and InterContinental Hotels & Resorts. Jeff is adept in hotel development, openings, systems integration, and navigating complex financial landscapes with precision and foresight. A graduate of Cornell University’s prestigious Hotel School, Jeff’s career journey has taken him across both coasts before returning to the Pacific Northwest, where he led the accounting team at the renowned Salish Lodge & Spa for several years. This leadership experience marked the beginning of his impactful tenure at Columbia Hospitality. While deeply committed to his professional responsibilities, Jeff is equally known for his approachable demeanor, sharp sense of humor, and ability to forge meaningful connections within the organization. An avid outdoor enthusiast, Jeff recently summited Mt. St. Helens and is now setting his sights on conquering Mt. Hood. In his leisure time, he enjoys golfing, gardening, and spending time with his wife and two children. Thoroughness defines Jeff in every aspect of his work, making him an indispensable leader in our organization. JENI ELAM Vice President, Consulting JENI ELAM Vice President, Consulting Jeni serves as the Vice President of Consulting at Columbia Hospitality, helping clients to realize and build their hospitality projects, optimize those hotels, and then manage most effectively to create exceptional guest experiences. Jeni began her hospitality career at Oxford Hotels and Resorts, working first at The Godfrey Hotel and then managing new openings and operational improvement throughout the country. She has worked in hospitality operations with boutique branded and independent hotels for the past five years at individual properties as well as at the portfolio level. Prior to joining the hospitality sector, Jeni served as the Chief Strategist at UK Power Reserve where she was responsible for technology, communications, strategic planning, and data analytics. Previously, she was Director of Partner Solutions team at Global Impact, where she worked with Fortune 500 companies and international non-profits in emerging markets. Jeni holds a global MBA from Hult, as well as a BA from the University of Puget Sound. She currently serves on the boards of the Woodland Park Zoo, Global Impact UK and BoardReady. Jeni has worked across five countries, three sectors and loves working in high-growth, entrepreneurial environments. She lives in Seattle with her husband, son, and daughter, and loves to get out hiking, horseback riding, and skiing when time permits. Jenne  Oxford Senior Vice President, Hotels and Resorts Jenne  Oxford Senior Vice President, Hotels and Resorts Jenne brings over 20 years of hospitality to her role with Columbia Hospitality. Prior to joining Columbia, she spent over 17 years with Kimpton Hotels and Restaurants, working as General Manager of the Alexis Hotel for 9 years and then as Regional Director of Operations, overseeing a portfolio of 4 hotels in Seattle. Jenne moved on to become Vice President of Operations at Domicile, a Madrona Ventures hospitality start-up combining premium apartments with luxury hotel services. During this time, Jenne also worked with several Seattle boutique hotel owners as an asset manager and operations consultant. Jenne is a graduate of University of Montana and has served on a number of tourism boards, including the Seattle Hotel Association, Washington Hospitality Association and Hospitality PAC. She also served as a Board Member for Visit Seattle, the Seattle Tourism Improvement Area and Metropolitan Improvement District Board. In her free time Jenne enjoys being anywhere near the water, from the warm Pacific Ocean in Hawaii to crisp icy rivers and lakes of Montana. She can be found on her paddle board or sitting with a good book and her feet in the water. Jennifer Grosclaude Regional Vice President Jennifer Grosclaude Regional Vice President With over 20 years of hospitality experience, Jennifer has worn many hats throughout her career. During her tenure at Hyatt Hotels & Resorts, she specialized in Sales & Events, advancing to the position of Director of Sales & Events, where she spent over a decade. Her time at Hyatt provided Jennifer with opportunities to travel and advance her career, from Seattle to Austin to Calgary, before returning to the Pacific Northwest to open a new hotel. She has been a part of renovations, expansions and new hotel projects throughout her career. Pursuing her goal of becoming a General Manager, Jennifer’s journey led her to Columbia Hospitality. Now, as Regional Vice President, Jennifer oversees a collection of hotels and resorts and works with the development team on new properties in the Oregon market. Jennifer is very involved in her local coastal community, currently serving on the Board of Directors for the Clatsop County Economic Development Council. When not working, you will find Jennifer outdoors, enjoying the beach near her home, exploring the newest wineries in the Willamette Valley, trying out new local restaurants, or discovering new travel destinations. John Oppenheimer Founder and Chairman John Oppenheimer Founder and Chairman John Oppenheimer is Founder and Chairman of Columbia Hospitality. Columbia Hospitality operates over 100 properties in 12 states including hotels and resorts, residential, golf, distinctive venues, and restaurants and bars. Under John’s leadership, Columbia Hospitality has received countless awards in 2024 including: Fastest Growing Companies and Washington Best Workplaces (Puget Sound Business Journal), Family Business Award Honoree (Puget Sound Business Journal), as well as Best Company Work-Life Balance and Best Company Happiness (Comparably). In addition to launching Columbia Hospitality in 1995 (to manage Bell Harbor International Conference Center for the Port of Seattle), John has also founded five successful, private hospitality-related businesses. John was a founding general partner of Seattle Hotel Group, the investment group that developed the Four Seasons Hotel and Residences Seattle. John currently sits on the following boards: Virginia Mason Franciscan Health Board, Smoke Tree Corporation, Four Seasons Seattle Homeowners Association, UW Center for Leadership Studies Advisory Board, Anthony’s Restaurants, Northland Properties, and Chelan Valley Farms. Examples of John’s past non-profit boards included Chair of the Woodland Park Zoo, Chair of YPO Gold, board member of 5th Ave Theater, among others. He served as a past member of the advisory board of Northern Trust. John was also recognized as a 2024 Director of the Year honoree and selected as a Power 100 honoree every year since 2019 by Puget Sound Business Journal. John and his wife, Deanna, are the 2024-2025 co-chairs of the Auction of Washington Wines, past Fritzky co-chairs in Leadership at the University of Washington and are honorees of the Seattle Hotel Association’s “Evening of Hope.” They have served as co-chairs of many civic events including: the Woodland Park Zoo Jungle Party, Virginia Mason Dreambuilder’s Ball, and the Puget Sound Business Hall of Fame. John is the author of the book, Keys to the Room: Unlocking the Doors to Opportunities and Possibilities. John is a University of Puget Sound graduate where he earned his bachelor’s degrees in Urban Affairs and Political Science. He and Deanna were honored for their continued service and philanthropy with the dedication of Oppenheimer Hall at their alma mater. He is a husband and proud father of two adult children. An interesting fact is that John first learned about great customer service as a young skycap at the Boise, Idaho airport, carrying luggage. The word that best describes John is grateful. JOLENE DISALVO Senior Vice President JOLENE DISALVO Senior Vice President As SVP, Jolene ensures the company is best structured and aligned to meet owner and property needs throughout the U.S., with specific oversight of revenue management and distribution, sales, and IT, as well as multi-property oversight of guest room, food and beverage, and spa operations. Jolene spent 11 years with Starwood Hotels & Resorts (W Hotels Worldwide, St. Regis Hotels and Resorts and The Luxury Collection). Jolene was instrumental in the launch of W Hotels, starting with opening the fourth W Hotel in Seattle as Director of Sales & Marketing, then leading the field marketing team for W Hotels, and finally in NYC as Vice President, Brand Marketing for W Hotels, St. Regis and The Luxury Collection. Jolene was honored as one of Lodging Magazine’s Outstanding Women in Lodging and has served as president of the Pacific Northwest Chapter of Professional Convention Management Association and awarded Supplier of the Year by the Washington Society of Association Executives. She currently sits on the Corporate Council for the 5th Avenue Theatre, the Washington Filmworks Board of Directors, and serves on the Editorial Committee for the Washington Hospitality Association. Jolene is a Washington State University graduate, with a Bachelor of Arts degree in Communications/Public Relations. Here is a little-known fact – Kanye West, sang the song “Jolene” to Jolene when she was his dinner partner at a New York Fashion Week event. And the word that best describes Jolene is: ham (not the kind one eats). KRISTEN B. WATTS Senior Director, Learning & Development KRISTEN B. WATTS Senior Director, Learning & Development As Director of Learning and Development for Columbia, Kristen designs and delivers training programs that bring out the best in the company’s team members. Kristen is an adult learning expert with experience in workplace curriculum development and implementation. Prior to joining Columbia, Kristen held learning and development positions with Imperative, PitchBook, and Point B. She has extensive experience in performance management, training, mentoring and leadership advancement. She is focused on aligning training opportunities with Columbia’s strategic business needs, including investing in our team members’ growth and assisting clients with customized training programs. Kristen is a Seattle University graduate with a bachelor’s degree in Criminology and a master’s degree in Creative Writing from Otis College of Art & Design. In her free time, Kristen enjoys painting, hiking, reading, and listening to true crime podcasts. She is a certified yoga instructor as well as a youth mentor at Year Up. Interesting fact about Kristen is that after college she worked as a private investigator… and yes, she has many stories from that chapter of her life. Kristen also has an uncanny ability: within 24 hours, she can convince any child to eat their broccoli – with a 100% success rate. The best word to describe Kristen is: scrappy. Lauren Madeja Director, Marketing Lauren Madeja Director, Marketing Within Columbia Hospitality, Lauren directly oversees marketing strategies in addition to running a department of more than 25 skilled marketing experts. Lauren came up through the ranks of Columbia, previously holding the title of Marketing Manager. She has a long and successful history in the marketing industry having worked for Tiger Oak Media as Director of Marketing and Events, where she oversaw magazine promotion of Seattle Business, Seattle Magazine, and five bridal event magazines. Lauren started her career as Special Events Coordinator and PR Assistant for Festivals Inc, assisting in the production and promotion of the Bite of Seattle and Taste of Tacoma. Lauren is a graduate of Washington State University with a B.A. in Communications and Advertising and lives in Seattle with her husband, son, and daughter. Linda Jones Regional Vice President Linda Jones Regional Vice President Linda Jones is deeply rooted in the Pacific Northwest, having grown up and built her life in the suburbs of Seattle. After graduating from Washington State University with a degree in Accounting, Linda returned to Seattle and embarked on a remarkable career that started in food manufacturing before transitioning into the world of hospitality. With over 27 years of experience in hotel and food and beverage management, Linda brings a diverse skill set to the table, contributing to business development, growth, and reorganization. Outside of her professional life, Linda resides north of Seattle with her husband and son, where she enjoys hosting gatherings for family and friends, creating memorable moments, and doting on her Airedale Terriers, Rowdy and Angus. Her favorite destinations include the breathtaking shores of Kauai, the rugged beauty of the Washington Coast, and the serene vineyards of Sonoma, California. Mark  Andrew Regional Vice President Mark  Andrew Regional Vice President Mark Andrew is the Regional Manager – Canada for Columbia Hospitality in which his duties include supporting the operational growth of amazing properties North of the border. He has worked at several top-tier Hotel & Resort properties in Canada and the US ranging from Hyatt Hotels & Resorts to Fairmont Hotels & Resorts to Semiahmoo Resort, Golf & Spa to Canyon Ranch Wellness Resorts. Prior to his current role, he was Senior Vice President, Tapestry, at Concert Properties where his background in hotel operations, marketing, sales, and transformational management were invaluable as Concert took over operations of its Seniors Housing company. He has a proven track record for enhancing property performance, team member engagement, and customer satisfaction. His leadership abilities have been recognized with a distinguished President’s Award by Meeting Professionals International. When not enjoying life with the world of hospitality,  you can find Mark either enjoying time in the great outdoors…or in a gym. MATT DURHAM Director, IT MATT DURHAM Director, IT As Director of IT, Matt drives the company-wide technology strategy and oversees the IT systems of hotels, restaurants, golf properties, residential communities, and distinctive venues. He also oversees the IT infrastructure of all new hotel developments within Columbia’s portfolio. Matt is a true IT and hospitality expert, including work with Coastal Hotels, where he applied best practices in technology to enhance guest and team member experiences. Prior to Coastal he worked as an IT consultant to various hospitality and property management companies. Matt is an Oregon State University graduate. He enjoys scuba diving and homebrewing in his free time. MATT HAGERMAN President, Hotels and Resorts MATT HAGERMAN President, Hotels and Resorts Matt oversees hotels and resorts, including all growth-related initiatives and ongoing operations. Matt’s background has been focused on opening and managing full service, independent, unique hotels and restaurants. A Seattle native, Matt is a University of Washington graduate with a bachelor’s degree in Business Administration from the Foster School of Business. Matt is a past board member of the Seattle Hotel Association and teaches the certificate of commercial real estate at the University of Washington. Matt is a husband, father of two, a Husky alum, an avid cyclist (including a ride from Prague to Budapest), golfer, outdoor enthusiast, recreational surfer, and enjoys travel of all kinds. The best way to describe Matt is: eternal optimist, family guy, and enthusiastic. Matthew Beehler Regional Vice President Matthew Beehler Regional Vice President With more than 20 years of experience in the hospitality industry, Matthew has held many leadership positions throughout his career. He spent over ten years in Las Vegas and the southern California coast with various roles at MGM Resorts International, Loews Hotels, and The Grand Del Mar.  Through decades of service, Matthew rose through the ranks to achieve his original career goal of becoming a General Manager. Matthew has since exceeded that goal and many others and now oversees multiple properties as Regional Vice President. Matthew wears many hats, but he truly thrives when he’s building great relationships with owners, nurturing leadership growth, and diving into exciting pre-opening projects for new construction ventures. Originally from Washington state, Matthew now lives in Bozeman, Montana which gives him a convenient excuse to hike, bike, and ski as many days as possible each year. Matthew is an active member of his community, having served as an advisory board member of the Gallatin Valley Land Trust, the Downtown Bozeman Partnership, and his current role as Board Chair of Visit Bozeman, the city’s convention and visitors bureau. After graduating from Highline College, majoring in Hospitality and Tourism Management, Matthew attended the University of Nevada Las Vegas. Go Rebs! The best word to describe Matthew is: Sincere. Megan Kitagawa Director, Marketing Megan Kitagawa Director, Marketing Megan serves as Director of Marketing, working alongside our in-house creative team to support branding, copywriting, design, web development, digital marketing, and photo and video production. Her background includes marketing services at a luxury Southern California resort, merchandising at a well-known fast food chain, and marketing project management at a fast-growing tech startup. Megan has worked on grand openings, new website launches, and establishing marketing processes and platforms. Her experience across different industries – from hospitality to tech – gives her a well-rounded perspective on reaching diverse audiences. She holds a business degree from Cal Poly San Luis Obispo with concentrations in marketing and information systems. When she’s not at work, you can find Megan exploring new restaurants, enjoying a good matcha latte, staying active with running and Pilates, or planning trips to her favorite destinations like Tokyo and Kauai. At home, she enjoys spending time with her husband and their two Mini Aussies, Rocky and Lily Belle. MEREDITH MARA Director, Sales MEREDITH MARA Director, Sales As Director of Sales, Meredith provides strategic sales leadership and development of company-wide sales initiatives and related programs to drive results in the group business and catering segments for Columbia’s various properties, while expanding and developing her sales team’s knowledge through a diverse use of practical applications and creative ideas. Meredith has held various leadership roles including VP of Sales at Coastal Hotels, supporting the properties within their portfolio with a special focus on strategy, business development and total profitability. Meredith is a native Washingtonian currently residing in Renton. A proud mother to her son, Meredith is an adrenaline junkie, enjoying everything from scuba diving to skydiving and a lot of fun stuff in between, including traveling, cooking and enjoying the great outdoors. The word that best describes Meredith is: effervescent. MICHAEL KOSMIN President, CH Residential MICHAEL KOSMIN President, CH Residential As President of CH Residential, Michael oversees a diverse, mixed-use residential property portfolio. He leads a field team of general managers, community association managers and operational leaders in Columbia Hospitality’s growing residential collection while implementing business development strategies. Michael is tasked to improve operational efficiencies, reinforce a culture of exceptional customer service and a collaborative work environment. Michael has held management, operations, sales and marketing positions with Cascade Sotheby’s International Realty, Marriott and Hyatt Vacation Ownership, and Lowe Enterprises. His project management experience includes residential properties across multiple states as well as residential projects internationally in Japan, China and Indonesia. Michael is a graduate of the University of Washington. He loves spending time with his two adult daughters who live in the Seattle area. Michael finds that traveling brings new experiences to life, and the fact that, “around every corner there can be a memory made” (including being chased by a 9 foot long/200 kg Komodo Dragon on a remote island in Indonesia). He enjoys skiing, golf, hiking and scuba diving, where he once jumped out of a helicopter from 40 feet into the waters off Hawaii to begin a dive on four separate wrecks with an ex-Navy seal. It will come as no surprise that the best word to describe Michael is: passionate! Mike Hill Regional Vice President Mike Hill Regional Vice President Mike has direct oversight and responsibility for the experience, operation, and results of a set of properties within the Columbia Hospitality portfolio. Additionally, he has responsibilities in the company’s Columbia Cares committee, Facilities Workgroup, and Sustainability Workgroup. Mike brings more than a decade of hotel experience to Columbia Hospitality, with a majority of his time in management roles at Kimpton Hotels in Seattle. Prior to his positions with Kimpton, Mike worked for a health and wellness organization overseeing guest and facility operations experience. Originally from Minneapolis, Mike now lives in Seattle which has opened the gates for adventure, and he enjoys spending any of his free time outdoors. Mike loves to cycle (gravel, trail, or Peloton – any will do), camp, hike, and snowboard. Mike is a husband, father of two, seeks memorable experiences, loves a good joke or prank, and always has music on his mind. Mike West Director, Openings & Transitions Mike West Director, Openings & Transitions Mike brings over 20 years of hospitality experience to his role as Director of Openings & Transitions. Before taking on this position, he served as Complex General Manager at both Hotel Interurban and Hotel Indigo, and as Area Manager for Columbia Hospitality. Throughout his career, Mike has been extensively involved in new openings, renovation and rebranding projects, and property transitions. Prior to joining Columbia Hospitality, Mike worked with a variety of hotels, ranging from luxury boutique resorts to large downtown convention hotels in Washington and California. He has also contributed to regional LTAC committees and served as President of the Snohomish County Tourism Promotion Area board. A native of the Pacific Northwest, Mike lives north of Seattle with his wife and two children. He holds a degree of Business Administration with a minor in Economics from St. Mary’s College of California. In his free time, Mike is an avid Seattle sports fan, enjoys golfing, and loves exploring the natural beauty of the PNW. Nancy Wolff Vice President, Technology Nancy Wolff Vice President, Technology As Vice President of Technology, Nancy oversees all areas of technology for Columbia Hospitality and its collections. She is a seasoned international business and technology strategist with 30+ years in the tech sector. She excels in crafting and executing strategies and leading large-scale technology projects across various industries, with a special focus on Hospitality. She has worked as a technology strategy leader with organizations such as Jumeirah, The Doyle Collection, Hard Rock, Hospitality Ventures, as well as technology-focused firms such as Techstars and Auxis. Her work has been dedicated to significantly enhancing customer experience, loyalty, revenue, operations, finance, and digital domains. Nancy is passionate about driving innovation and delivering exceptional results in the hospitality sector. Nancy holds a degree in Industrial & Systems Engineering from Georgia Tech, an MBA from Nova Southeastern University, and an AI/ML certificate from MIT. Having grown up in Florida, she is happiest on the water and spending time with family (and all dogs). Patti Vadset Vice President, People and Culture - Operations & Transitions Patti Vadset Vice President, People and Culture - Operations & Transitions As Vice President of People and Culture, Patti plays a pivotal role in our organization, overseeing the People Operations function. In her multifaceted role, Patti serves as the People and Culture Project Manager for all property openings and transitions, ensuring a seamless integration of our company’s values and culture into every aspect of our expanding organization. Additionally, she acts as a trusted People and Culture Business Partner for multiple properties, fostering a harmonious relationship between our workforce and the company’s core values. Patti is also a valuable source for HR guidance, providing expertise to our P&C Directors, Managers, Business Partners, and Coordinators while maintaining a strong focus on legal compliance and ethical practices. Patti’s journey with Columbia Hospitality began in 1998, a time when our company comprised of just four properties. Her significant role in shaping our company’s values many years ago fills her with pride, as these values remain steadfastly upheld to this day. Outside of her professional life, Patti has a passion for travel, gardening, and spending quality time with her family on their farm. She also enjoys antiquing adventures. Patti holds Bachelor of Arts degrees in International Business and Foreign Language and Literature, both earned from Washington State University (go Cougs!). As a native of Washington State, Patti currently resides in Poulsbo and is a devoted parent to two daughters. PETER FERRETTI Senior Director, Revenue Management PETER FERRETTI Senior Director, Revenue Management As Senior Director, Revenue Management, Peter works with the property, marketing, and group sales teams to ensure that each property has the right strategies in place to maximize profitably. Peter has a broad background in revenue strategy from a diverse set of properties and companies. In addition to leading pricing strategy, he has managed sales teams, rebranded a major Northwest spa, and has been the General Manager of a four-star hotel in the Bay Area. He brings a data driven approach to both revenue management and marketing. Prior to joining Columbia Hospitality, he led the revenue efforts for Coastal Hotels, Destination Hotels at Suncadia, Pan Pacific Hotel Seattle, Salish Lodge & Spa, Hotel Los Gatos, and The Cypress. Peter is both a Purdue University graduate with a B.S. in Hospitality Management and a University of Washington, Foster School of Business grad with an MBA in Marketing and Pricing. He enjoys cooking new and creative recipes, particularly fresh fish he has caught. He has summited four 14,000’+ mountains in the San Juan Mountains of Colorado and started playing the acoustic guitar during the first part of the pandemic. The word that best describes Peter is: compassionate. Phil LeJune Vice President, Accounting/Finance Phil LeJune Vice President, Accounting/Finance Phil, originally hailing from Louisiana but having moved to the San Francisco Bay Area at a young age, embarked on a journey that led to a thriving career in the hospitality industry and a loving, 34-year partnership with his wife, whom he met during their enrollment in the Hotel & Restaurant Management Program at Diablo Valley College in Pleasant Hill, CA. After graduating from the program, Phil honed his culinary skills at a bed and breakfast inn, marking the beginning of his adventure in the industry. His passion for hospitality evolved over the years as he took on various roles in the restaurant sector, transitioning from the kitchen to the front desk and eventually excelling in accounting at a Hilton property. Phil mastered diverse facets of hotel operations, from banquets to night audit, food and beverage control to director of finance, and the role of Assistant General Manager. Seeking new horizons, Phil relocated to Southern California while working for Windsor Hospitality, where he served as a regional controller for an impressive 11-year tenure. Subsequently, his journey led him to Seattle, where he briefly contributed his financial expertise at Tully’s Coffee Headquarters before returning to his true passion – hotel operations – at the Heathman Hotel Kirkland. Eventually, Phil found a home at Coastal Hotels as a Corporate Controller before becoming an integral part of Columbia Hospitality, where he has dedicated the last seven years to furthering the company’s success. Beyond his professional endeavors, Phil’s love for travel has taken him to Germany and Vancouver, Canada. Phil once indulged in the thrill of paintball, fostering teamwork and outdoor adventures. Nowadays, Phil dedicates his spring and summer months to youth baseball as a devoted board member and umpire for his local little league, considering it his personal stress-reliever. Off the field, Phil cherishes moments with his family, exploring new destinations, attending Seattle Mariners games, and cooking. He’s known for his generous spirit, often sharing extra food with neighbors, friends, and family simply because it brings him joy. ROY BREIMAN Vice President, Food and Beverage ROY BREIMAN Vice President, Food and Beverage As VP of Food and Beverage, Roy is responsible for integrating internal systems that achieve measurable fiscal success while focusing on quality recruitment and responsible environmental practices that create inspired and profitable food and beverage business units. Roy brings an enormous depth of food and beverage leadership throughout Europe and the U.S., including Michelin starred hotels and past culinary director for Coastal Hotels. PBS named Roy one of America’s Rising Star Chefs; John Mariani of Esquire Magazine named him a “Chef to Keep Your Eyes On,” and Bon Appétit magazine named him one of 13 “Top Hotel Chefs in America.” Roy’s most recent endeavors include competing on the Food Network Show “Beat Bobby Flay,” where he successfully brought back a win to the Seattle area. He also authored Wine Country Chefs Table, a regional cookbook centered on the world premier wine making region of Napa and Sonoma valleys. Roy is a member of the James Beard Foundation and presently sits on the Board of Food Lifeline, Washington State’s largest hunger relief agency. He resides in North Bend, WA with his wife Pam. Roy is a true outdoorsman, having summited both Mt. Rainer and Mt. Baker in the same year, juxtaposed to growing up surfing and loving it to this day! The word that best describes Roy is: committed. SHAWN CUCCIARDI Senior Vice President, CH Golf SHAWN CUCCIARDI Senior Vice President, CH Golf As Senior Vice President of CH Golf, Shawn oversees the overall performance and growth of the golf portfolio for Columbia Hospitality, focusing on business development including valuation and appraisal of golf course projects, feasibility consulting, market analysis and evaluation as well as the operation of golf, food & beverage, and event facilities. Shawn brings a great depth of experience in private, semi-private and public clubs, resort and municipal course sectors. He is active in the local community and serves as a current city council member for the City of Port Orchard, where he also serves on the City’s Finance and Land Use Committee. Shawn also served on the national advisory committee for The First Tee, and as president of the Kitsap Peninsula Visitor and Convention Bureau and the Bremerton Area Chamber of Commerce. Shawn is a Methodist University graduate, receiving his Bachelor of Arts degree in Business Administration with a concentration in Professional Golf Management. Shawn lives in Port Orchard with his wife and two children and loves to cook and entertain at his house. Shawn also enjoys fishing, playing acoustic guitar with friends and, of course, golfing. Shawn has the unique ability to connect with people by listening first and being compassionate. The best word to describe Shawn is: jack-of-all-trades. Simon Dolinky Vice President, Food & Beverage Simon Dolinky Vice President, Food & Beverage Simon Dolinky brings a wealth of experience and a passion for genuine hospitality to his role. Growing up in Wisconsin, he was a frequent visitor to the Dane County Farmers’ Market in Madison, recognized as the largest producers-only market in the United States. This early exposure shaped Simon’s appreciation for seasonal, high-quality ingredients and inspired his honest, authentic approach to restaurants, bars, and events. His hospitality journey has taken him through renowned restaurants recognized by the James Beard Foundation and the Michelin Guide, where he honed his skills in vibrant culinary scenes across Milwaukee, New Orleans, Madrid, Washington D.C., and Southern California. Simon has created dozens of new concepts and overseen every component, from budgets to food and drink menus to kitchen design. He has also led hotel openings across Canada, the U.S., Mexico, and the Caribbean. In his free time, Simon loves to travel, hike, explore new cuisines, scuba dive, surf, fish—really, anything near a beach—and he’s recently started spending more time on the golf course. YOGI HUTSEN Vice Chair YOGI HUTSEN Vice Chair As Vice Chair, Yogi focuses on Columbia’s growth in larger-scale and branded hotel and resort properties. Yogi’s background includes President and CEO of Coastal Hotels and COO at Noble House. There, he created a “culture of excellence”. Yogi also held senior management positions with Starwood Hotels & Resorts Worldwide and ITT Sheraton, including Vice President of Operations – Washington and Oregon and General Manager of the Seattle Sheraton and the Sheraton Tucson El Conquistador Resort. Yogi is a former Executive Committee member of the Seattle Chamber of Commerce, Visit Seattle board member, Chairman of the Downtown Seattle Association, Board of Governors for King County Boys and Girls Club, and past President of the 101 Club of the Washington Athletic Club. Yogi is a graduate of Indiana University with a degree in Urban and Regional Development. He is married to his wife of 39 years. They have three sons and four grandchildren. He loves to fish and golf, both taking him on global adventures. Yogi has a supernatural ability to relate to all people and the best word to describe Yogi is: knowledgeable. Let's Talk Get in touch and let us know how we can help. Contact Us Congratulations to Stephanie Inn For being recognized as Travel + Leisure’s #1 Best Resort in the West in their World’s Best Awards! Learn more about Stephanie Inn and our featured collection. Featured Collection 2200 Alaskan Way, Suite 200 Seattle, WA 98121 206.239.1800 info@columbiahospitality.com Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.columbiarestaurant.com/view-all-locations",
      "text": "View All Locations | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Locations Celebration, Orlando Area Columbia Cafe at the Tampa Bay History Center Historic District, St. Augustine Columbia Cafe at Tampa International Airport Sand Key, Clearwater St. Armands Key, Sarasota Ybor City, Tampa TO VIEW MENUS, PLACE AN ORDER FOR CURBSIDE PICKUP OR RESERVE A LARGE PARTY, PLEASE CONTACT YOUR NEAREST COLUMBIA RESTAURANT: Ybor City, Tampa – Columbia Restaurant Est. 1905 The Hernandez/Gonzmart family opened this landmark Columbia Restaurant in Tampa's historic Ybor City in 1905. Today, it’s Florida’s Oldest Restaurant℠ and the world's largest Spanish restaurant. ​ 2117 E. 7th Ave., Tampa, FL 33605 ​ ​ ​ ​ To Order Curbside Pickup: +1-813-248-4961 Events, Banquets And Catering: CarolineO@crg1905.com RESERVATIONS LUNCH MENU DINNER MENU Read More... Ybor City, Tampa St. Armands Circle, Sarasota – Columbia Restaurant Est. 1959 The Columbia Restaurant in St. Armands Circle opened in 1959 and is now the oldest restaurant in Sarasota. ​ 411 St. Armands Cir., Sarasota, FL 34236 ​ ​ ​ ​ To Order Curbside Pickup: +1-941-388-3987 Events, Banquets And Catering: colsara@crg1905.com RESERVATIONS LUNCH MENU DINNER MENU Read More... St. Armands Key, Sarasota St. Augustine – Columbia Restaurant Est. 1983 The third-oldest restaurant in the Columbia group, the St. Augustine location opened on Fourth of July weekend in 1983. ​ 98 St. George St., St. Augustine, FL 32084 ​ ​ ​ ​ To Order Curbside Pickup: +1-904-824-3341 Events, Banquets And Catering: cst.augustine@crg1905.com RESERVATIONS LUNCH MENU DINNER MENU Read More... Historic District, St. Augustine Sand Key, Clearwater – Columbia Restaurant Est. 1989 Close to Clearwater Beach, the Sand Key Columbia offers both indoor and outdoor waterfront dining. ​ 1241 Gulf Blvd., Clearwater, FL 33767 ​ ​ ​ To Order Curbside Pickup: +1-727-596-8400 Events, Banquets An d Catering : colsand@crg1905.com RESERVATIONS LUNCH MENU DINNER MENU Read More... Sand Key, Clearwater Celebration – Columbia Restaurant Est. 1997 Minutes away from Walt Disney World and a short distance from Orlando and Universal Orlando. ​ 649 Front St., Celebration, FL 34747 ​ ​ ​ ​ To Order Curbside Pickup: +1-407-566-1505 Events, Banquets And Catering: colcele@crg1905.com RESERVATIONS LUNCH MENU DINNER MENU Read More... Celebration, Orlando Area Tampa Riverwalk  – Columbia Cafe Est. 2009 Indoor and outdoor waterfront dining near Amalie Arena, the Tampa Riverwalk and Water Street. ​ 801 Water St. #1905, Tampa, FL 33602 RESERVATIONS To Order Curbside Pickup: +1-813-229-5511 Events, Banquets And Catering: columbiacafe@crg1905.com VIEW MENU Read More... Columbia Cafe at the Tampa Bay History Center Tampa International Airport  – Columbia Cafe Est. 2012 Opened in 2012, enjoy classic Columbia Restaurant recipes at this Tampa airport restaurant. ​ Concourse E, 4160 George J. Bean Pkwy., Tampa, FL 33607 +1-813-947-7264 Read More... Columbia Cafe at Tampa International Airport Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Nachricht name Surname Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.columbiarestaurant.com/about-us",
      "text": "About Us | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Our Story The Columbia Restaurant began as a dream. For Spanish-Cuban immigrant Casimiro Hernandez, Sr. , arriving in Tampa, FL, with his four young sons meant searching for opportunity and a better life. ​ On Dec. 17, 1903, he helped to open the Columbia Saloon, which became the Columbia Restaurant in 1905. ​ Over nearly 120 years, the original restaurant has expanded to an entire city block and is now the largest Spanish restaurant in the world. ​ Casimiro's descendants diligently care for the Columbia Restaurant and help preserve his American dream. As Florida’s oldest restaurant, the Columbia has seven locations in Florida and is still owned and operated by family members. Read More About The History At Columbia Ybor City Fourth and Fifth Generations: Casey Gonzmart, Sr. Casey Gonzmart is the great-grandson of Casimiro Hernandez, Sr., the founder of the  Columbia Restaurant. Richard Gonzmart The fourth-generation “caretaker” of the Columbia Restaurant Group and 1905 Family Of Restaurants. Andrea Gonzmart Williams As a fifth-generation member of the Hernandez/Gonzmart family, Andrea began working at the Columbia when she was 10 years old. Casey Gonzmart, Jr. Growing up within his family’s restaurant, Casey Jr., was introduced to the hospitality industry at an early age. His passion for hospitality has continued throughout his life. READ MORE At  1905Family.com In The News Click here to read recent press about the Columbia Restaurant. Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiasportswearvb.com/contactus.html",
      "text": "Contact Us | Columbia Sportswear Contact Us | Columbia Sportswear . Search X X Life & Health Accident Insurance Critical Illness Insurance Hospital Indemnity Insurance Family & Personal Well-Being Legal Insurance Pet Insurance Contact Us Life & Health Accident Insurance Critical Illness Insurance Hospital Indemnity Insurance Family & Personal Well-Being Legal Insurance Pet Insurance Contact Us How Can We Help? Contact us using any of the methods below. Support Options Corporate Mailing Address Address: 12421 Meredith Drive, Suite 300 Mail Stop MK1 Urbandale, IA 50323-4000 Give Us A Call Phone: 1-855-206-5148 Hours: Monday - Friday: 6am-3pm PT Send Us An Email Email Address: customer.service@mercer.com This email is for Voluntary Benefit Options only. It is not intended for HR or public inquiries. Mercer Health and Benefits Administration LLC AR Insurance License #100102691 CA Insurance License #0G39709 TX Insurance License #1850385 In CA d/b/a Mercer Health and Benefits Insurance Services LLC Mercer About Us Privacy Policy Terms of Use Cookie Notice © 2025 Mercer LLC. All rights reserved. /*Font Family for Cigna*/"
    },
    {
      "url": "https://www.columbiarestaurant.com/",
      "text": "Home | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Discover Columbia’s Upcoming Abadía Retuerta Wine Dinner Welcome To The Columbia Reservations Book a table for lunch or dinner at the Columbia Restaurant. Locations Explore our seven locations throughout the state of Florida. Food & Drink Browse our menu, view recipes and join our Vino Club. Shop Shop for gifts cards & Columbia classics in our online store. Click To Read Our Story We Look Forward To Your Visit Family Owned And Operated Since 1905 It all started with the dream of a young Spanish-Cuban immigrant. Today, his descendants keep the magic alive. Our Story “One Of America's Most Historic Restaurants” – USA Today Flamenco performance at Columbia Ybor City BOOK NOW For more than 120 years, the Columbia Restaurant has served Spanish-Cuban cuisine to the state of Florida, using family recipes and tradition. ​ Each Columbia Restaurant location reflects the unique community where the restaurant resides. Find A Location The Experience Menus Exceptional Wine One of the largest Spanish wine collections in the world. Join our Vino Club. Spanish-Cuban Cuisine We serve Spanish and Cuban food that reflects the five generations of family ownership. In The News The Columbia's been making news since 1905. Catch the latest headlines. Treat someone to a Columbia Restaurant gift card and make their next celebration special. Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.1columbiaplace.com/get-in-touch",
      "text": "1 Columbia Place | Contact Skip to main content Home Leasing Office Retail Leasing Contacts Amenities Overview Gallery Contact Press More Contact us today Reach out to us to get started with finding a place for your business at 1 Columbia Place. Reach Out Leave your message in the form and we'll be in touch. Managed By Regent PM Services 619.610.1800 columbiaplacepm@regentproperties.com Location 401 W A Street , Suite 350 San Diego , CA 92101 US Hours Mon day 9:00am â 10:00pm Tue sday 9:00am â 10:00pm Wed nesday 9:00am â 10:00pm Thu rsday 9:00am â 10:00pm Fri day 9:00am â 10:00pm Sat urday 9:00am â 6:00pm Sun day 9:00am â 12:00pm Name * Email address * Phone number * Message Please select at least one option. I allow this website to store my submission so they can respond to my inquiry. * Submit Sorry, we were not able to submit the form. Please review the errors and try again. Who We Are A Leader in Real Estate Development and Investment Founded in 1989, Regent Properties, LLC is an SEC-registered investment advisor and is a real estate investment management and development firm based in Los Angeles, California and Dallas, Texas. The company is a vertically integrated operator and fund manager with current investments concentrated in six Sun Belt markets. Regent Properties manages a variety of investment vehicles, including comingled funds and separate accounts, on behalf of a sophisticated institutional investor base. Regent's assets under management are approximately $2.5 billion as of 3/9/2022. Learn More Home Leasing Amenities Contact Press 401 W A Street , Suite 350 San Diego , CA 92101 US columbiaplacepm@regentproperties.com 619.610.1800"
    },
    {
      "url": "https://www.columbiarestaurant.com/join-our-team",
      "text": "Join Our Team | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Become A Part Of The Columbia Restaurant Story We are always looking for talented and dedicated people to join our company. If you are interested in restaurant opportunities as a server, busser, bartender, cook or many other positions, please apply in person at the Columbia Restaurant between 2-4 p.m. weekdays. Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/historic-district-st-augustine",
      "text": "Historic District, St. Augustine | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Historic District, St. Augustine In the heart of St. Augustine, the nation’s oldest city, which was founded in 1565. Visit The Columbia Restaurant in St. Augustine, FL. RESERVATIONS Hours Of Operation: 11 a.m. - 10 p.m. Daily To Order Convenient Curbside Pickup: CALL NOW For Events, Banquets And Catering: Contact us 98 St. George St., St. Augustine, FL 32084 Donation & Sponsorship Requests Lunch Menu dinner Menu Named \"One of Florida's Top Restaurants\" since 1967. Enjoy our award-winning Spanish/Cuban cuisine while eating lunch or dinner in one of our dining rooms lavishly decorated with hundreds of hand-painted tiles, art works and a Spanish-style fountain. Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/menusbylocation",
      "text": "Menus By Location | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Menus By Location Find My Columbia Restaurant Menu Location FIND MENU Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/hurricane-ian-update",
      "text": "Hurricane Ian Update | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Hurricane Ian Update Our thoughts are with all those who are impacted by Hurricane Ian. We are blessed that our team and our restaurants are safe from the storm. ​ The schedule for re-openings of our Columbia restaurants are cafes is: ​ COLUMBIA YBOR – 11 a.m. Friday, Sept. 30 ​ COLUMBIA CAFE AT TAMPA BAY HISTORY CENTER – 11 a.m. Friday, Sept. 30 ​ COLUMBIA SARASOTA – 4 p.m. Friday, Sept 30 ​ COLUMBIA SAND KEY – 4 p.m. Friday, Sept. 30 ​ COLUMBIA CELEBRATION – 4 p.m. Friday, Sept. 30 ​ COLUMBIA ST. AUGUSTINE – 4 p.m. Friday, Sept. 30 ​ Also, the Columbia Restaurant Cafe in Airside E at Tampa International Airport reopens at 8 a.m. Friday. ​ The fourth and fifth generations of the Gonzmart family continue to pray for the recovery of our respective communities across Florida. ​ ​ Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/in-the-news",
      "text": "In The News | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop In The News Southern Living:  The Story Behind Florida’s Most Famous Salad We scored the recipe straight from the source so you can try it at home. Read More Columbia Restaurant: A 120-Year Timeline For over a century, Columbia has served Spanish tapas and entrées with hot Cuban bread to customers in Ybor City and beyond. Read More Tampa defends its title as the true home of the Cuban sandwich \"CBS Saturday Morning\" co-host Dana Jacobson heads to Tampa, where locals discuss the origins of the Cuban sandwich. Read More The Most Legendary Cuban Sandwich Is From This Tampa Restaurant Columbia Restaurant is, \"more like a magical foodie castle, covered in Spanish tiles, where everyone is invited to the feast.\" Read More 12 legendary Florida restaurants that stand the test — and taste — of time There are few, if any, things more famous from Tampa than the Cuban sandwich and no better place to enjoy one than at Columbia. Read More Columbia Restaurant: Home to One of the Oldest Cuban Sandwiches in Florida The Cuban sandwich is more than just a sandwich. It’s a delicious mashup of flavors and cultures. It’s the official sandwich of Tampa. It’s also the story of the many Cuban immigrants that came to America. Read More Bon Appétit: Where To Eat In Tampa \"It boasts 15 dining rooms, 1,700 seats, and 52,000 square feet of space—sized for weddings, celebrations, or just wandering around after dinner with your date.\" Read More Welcome To Florida Podcast, Episode 113: Richard Gonzmart Richard Gonzmart, fourth generation owner of the Columbia Restaurant, explains how the two sides of his family - one from Cuba, one from Spain - came to America and opened the restaurant which has survived Prohibition, the Great Depression, World Wars and, most recently, COVID. Read More 7 Fantastic Restaurants to Try While In Tampa, Florida \"The Columbia Restaurant simply must be on your radar. \" Read More Cooking Channel's 'Emeril's Florida' features Columbia restaurant \"Celebrity chef Emeril Lagasse stops into the Columbia in Ybor City to watch fifth-generation owner Andrea Gonzmart make her signature sangria and paella Valenciana.\" Read More The Splendid Table, Celebrating 30 Years: Live from Tampa! Fifth generation caretaker Andrea Gonzmart Williams is a guest on the NPR food broadcast recorded live in Tampa. Read More Iconic Restaurants That Define The Gulf Coast A Sarasota staple with roots tracing back to 1905, Columbia is Florida’s oldest restaurant and a celebration of Spanish-Cuban culture. Read More Ybor’s Columbia Restaurant overhauls its historic tiles One of the restaurant’s most recognizable features is undergoing a careful restoration and to ensure the artistic legacy of Spanish history endures. Read More The most beautiful restaurant in every U.S. state Florida’s oldest restaurant, Columbia, is also its most beautiful, with gorgeous artwork on the walls, pretty fountains, sculptures, mosaic tiling, arched windows, and stained glass. Read More Florida's Oldest Operating Restaurant Can Serve 1,700 People At Once Columbia Restaurant, Florida's oldest operating restaurant, is clearly doing something right based on their age and size. ​ Read More Columbia Restaurant in Sarasota reopens after suffering severe hurricane damage At 65 years old, Columbia Restaurant on St. Armands Circle is the oldest eatery in Sarasota. While much of St. Armands Circle remains shuttered—the fate of so many shops and restaurants is uncertain—the Columbia re-opened after a furious five-week refurbishment. Read More St. Augustine Celebrates Hispanic Heritage Month \"Hispanic Heritage Month is here, and what better way to celebrate than visiting St. Augustine, the place where Hispanic influence began in the United States.\" Read More Best Restaurants In Sarasota And Bradenton For Real Cuban Sandwiches \"In honor of National Cuban Sandwich Day , which is Aug. 23, allow me to recommend my favorite local restaurants for real Cuban sandwiches. Let's start with the Columbia and its excellent Tampa-style Cubano..\" Read More The Largest Restaurant In Florida Has 15 Dining Rooms And An Unforgettable Menu \"Not only is Columbia Restaurant in Tampa, Florida the largest restaurant in the state, but it also holds the title for one of the oldest Spanish restaurants in the entire world! \" Read More The Story of the Tiles at the Columbia Restaurant in Tampa \"The tiles not only set a mood. They tell a story of the Columbia itself, Florida's oldest restaurant, founded in 1905.\" Read More What it Takes to Run a Restaurant That Lasts 5+ Generations Fifth generation caretaker Andrea Gonzmart Williams shares the story of Columbia as a guest on the Money Market podcast. Read More How the Columbia’s \"1905\" Salad became one of Tampa’s most iconic dishes The Latin restaurant, now celebrating its 120th year, shared secrets for replicating the “Cuban sandwich-ish” salad. Read More The Best Traditional Restaurant in Every State Columbia Restaurant is the state’s oldest eatery, and more than 100 years later the same family runs its seven locations. Read More What's the best restaurant in Florida near you? 12 top picks from local food writers From fine dining to casual waterfront spots, these are Florida’s 12 must-try restaurants of the year, including Columbia Restaurant. Read More Visit The Oldest Eatery In Florida To Dine At The World's Largest Spanish Restaurant In Tampa, you'll not only find the best airport in the country for travel and food, but it also has the distintion of being home to the Michelin-guide rated Columbia Restaurant. Read More Columbia Restaurant Voted Florida's Best Cuban Sandwich Southern Living magazine readers named Columbia's Original Cuban Sandwich as the No. 1 Cuban sandwich in Florida. Read More Tampa's Most Romantic Restaurants \"Open since 1905, this Ybor City staple serves up Cuban cuisine and boasts the title of Florida’s oldest restaurant, and it’s a great choice for a romantic restaurant, too...\" Read More Restaurants With The Absolute Best Soup In The U.S. \"The Spanish bean soup is still made using the original recipe from Casimiro Hernandez, Sr.\" Read More A Brief History of the Columbia Restaurant in Tampa, FL \"Columbia Restaurant began as a small cafe serving authentic, reliable food such as Cuban sandwiches and café con leche, Cuban coffee, to armies of cigar makers longing for a taste of home in Ybor City.\" Read More Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/faq",
      "text": "FAQ | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Frequently Asked Questions Does the Columbia Restaurant have a dress code? Yes. We welcome everyone, but politely ask that baseball caps be removed and that men wear sleeves indoors at the Columbia Restaurant. DO I need to make a reservation at the columbia restaurant? While reservations are not required to dine with us, we do recommend calling ahead or booking a table online to ensure seating. How do i book a group of 10 or more? The Columbia Restaurant offers seating for large parties and accommodations for group events. Please contact your local Columbia Restaurant directly to reserve a large party. Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    },
    {
      "url": "https://www.columbiarestaurant.com/accessibility-statement",
      "text": "Accessibility Statement | Columbia Restaurant top of page Columbia Restaurant Since 1905 – Florida's Oldest Restaurant℠ Gift Cards Home Reservations Lunch & Dinner Reservations Group Dining & Catering Curbside Pickup Flamenco Show - Ybor City Locations View All Locations Ybor City, Tampa St. Armands Circle, Sarasota Historic District, St. Augustine Sand Key, Clearwater Celebration, Near Orlando Columbia Cafe at the TBHC Columbia Cafe at Tampa Airport Food & Drink Menus Recipes Curbside Pickup Group Dining & Catering Wine – Columbia Vino Club Our Story About Us In The News Media Kit Sponsorship & Donations FAQ Join Our Team Shop Gift Cards Gift Shop Accessibility Statement for Columbia Restaurant Website This is an accessibility statement from Columbia Restaurant. ​ Measures to support accessibility Columbia Restaurant takes the following measures to ensure accessibility of Columbia Restaurant Website: Include accessibility throughout our internal policies. Provide continual accessibility training for our staff. Assign clear accessibility goals and responsibilities. Conformance status The Web Content Accessibility Guidelines (WCAG) defines requirements for designers and developers to improve accessibility for people with disabilities. It defines three levels of conformance: Level A, Level AA, and Level AAA. Columbia Restaurant Website is partially conformant with WCAG 2.1 level AA. Partially conformant means that some parts of the content do not fully conform to the accessibility standard. Additional accessibility considerations Although our goal is WCAG 2.1 Level AA conformance, we have also applied some Level AAA Success Criteria: Images of text are only used for decorative purposes. Re-authentication after a session expires does not cause loss of data. ​ Feedback We welcome your feedback on the accessibility of Columbia Restaurant Website. Please let us know if you encounter accessibility barriers on Columbia Restaurant Website: E-mail: comments@crg1905.com We try to respond to feedback within 2 business days. ​ Compatibility with browsers and assistive technology Columbia Restaurant Website is designed to be compatible with the following assistive technologies: The technology is supported through Wix. Columbia Restaurant Website is not compatible with: Browsers older than 3 major versions or mobile operating systems older than 5 years. Technical specifications Accessibility of Columbia Restaurant Website relies on the following technologies to work with the particular combination of web browser and any assistive technologies or plugins installed on your computer: HTML CSS These technologies are relied upon for conformance with the accessibility standards used. Assessment approach Columbia Restaurant assessed the accessibility of Columbia Restaurant Website by the following approaches: Self-evaluation Formal complaints We aim to respond to accessibility feedback within 2 business days, and to propose a solution within 10 business days should you be dissatisfied with our response to you. ​ Formal approval of this accessibility statement This Accessibility Statement is approved by: Columbia Restaurant Communication Department ​ Date This statement was created on 19 July 2022 ​ ​ Browse Gift Cards FAQ - Dress Code Feedback Hiring Restaurants By Location Accessibility Statement Donation Requests Follow Us Subscribe To Our Email Newsletter Email Subscribe © 2022 by Columbia Restaurant. Visit 1905Family.com To Learn About Our Sibling Restaurants. bottom of page"
    }
  ]
}