{
  "fuentes": [
    {
      "url": "https://business.eastpascochamber.org/list/member/commandough-s-pizzeria-518",
      "email": "ceo@eastpascochamber.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://papaspizzacompany.com/contact/",
      "email": "info@papaspizzacompany.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "linda@kfc-inc.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "sc@2x-100.jpg"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "admin@zephyrhillschamber.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "ahawk39@icloud.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "contact@that1painter.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "director@mainstreetzephyrhills.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "drew@hudginslawfirm.net"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "emmy@cpazhills.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@admorgan.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@crossenv.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@gfwczephyrhills.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@mainstreetzephyrhills.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@schaperconstruction.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@scharberlaw.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "info@your-turn-cafe.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "jevans@sacfcu.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "jodi@wilkesondesign.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "kerns@2x-100.jpg"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "linda@hometownroofingandconstruction.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "linda@kfc-inc.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "main@leereedins.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "mbaker@anattorneysgotyourback.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "monica.young@tmf.mortgage"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "mreutimann@bodineperry.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "news@lakerlutznews.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "ochurch@tampabay.rr.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "pestlady@aol.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "rachel@faithfulfriendscremation.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "restore@pascohabitat.org"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "rosie@rosiepaulsen.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "stitch@2x-100.jpg"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "sunstatetitle@sunstatetitlefl.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "tmahon@fnbpasco.com"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "email": "zhills.lions@outlook.com"
    },
    {
      "url": "https://pizzazznyc.com/about-us/",
      "email": "info@pizzazz.com"
    },
    {
      "url": "https://pizzazznyc.com/about-us/",
      "email": "info@pizzazznyc.com"
    }
  ],
  "mails": [
    "admin@zephyrhillschamber.org",
    "ahawk39@icloud.com",
    "ceo@eastpascochamber.org",
    "contact@that1painter.com",
    "director@mainstreetzephyrhills.org",
    "drew@hudginslawfirm.net",
    "emmy@cpazhills.com",
    "info@admorgan.com",
    "info@crossenv.com",
    "info@gfwczephyrhills.org",
    "info@mainstreetzephyrhills.org",
    "info@papaspizzacompany.com",
    "info@pizzazz.com",
    "info@pizzazznyc.com",
    "info@schaperconstruction.com",
    "info@scharberlaw.com",
    "info@your-turn-cafe.com",
    "jevans@sacfcu.org",
    "jodi@wilkesondesign.com",
    "kerns@2x-100.jpg",
    "linda@hometownroofingandconstruction.com",
    "linda@kfc-inc.com",
    "main@leereedins.com",
    "mbaker@anattorneysgotyourback.com",
    "monica.young@tmf.mortgage",
    "mreutimann@bodineperry.com",
    "news@lakerlutznews.com",
    "ochurch@tampabay.rr.com",
    "pestlady@aol.com",
    "rachel@faithfulfriendscremation.com",
    "restore@pascohabitat.org",
    "rosie@rosiepaulsen.com",
    "sales@finewineliquors.com",
    "sc@2x-100.jpg",
    "stitch@2x-100.jpg",
    "sunstatetitle@sunstatetitlefl.com",
    "tmahon@fnbpasco.com",
    "zhills.lions@outlook.com"
  ],
  "nombre_sitio": "commandoughs.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.eastpascochamber.org/list/member/commandough-s-pizzeria-518",
      "text": "Commandough's Pizzeria | Restaurants, Food & Beverage Skip to content Membership Directory Hot Deals Job Postings Member to Member Deals Member Login Membership Application Membership Benefits Ribbon Cuttings Events Calendar Access East Pasco Access to Opportunity Annual Celebration Annual Joe Kiefer Golf Tournament Annual Kumquat Festival® Annual Pigz in Z’Hill BBQ & Blues Festival Business Breakfast Zephyrhills Economic Summit Incredi-Bowl Tournament Member Mixer On the Menu Chamber About Us Board of Directors & Staff Contact Us Events & Programs East Pasco Chamber of Commerce History Information Requests Chamber News (Newsletter) Business Resources Interactive Map Government Major Area Projects Region Transportation Zephyrhills Economic Development Coalition Community Education Community Resources History in East Pasco Map Our Communities Sports & Recreation Foundation About East Pasco Chamber Foundation Citizen of the Month Foundation Board of Directors & Staff Scholarships Skills That Pay Bootcamp Ways to Invest Commandough's Pizzeria Categories Restaurants, Food & Beverage 5841 Gall Boulevard Zephyrhills FL 33541 (813) 603-7499 Visit Website About Us Great place to have pizza, wings, and many other menu items. Entertainment, Outside and inside seating Rep/Contact Info Chelsie Rowell × Close Chelsie Rowell Phone: (813) 603-7499 Send an Email 5841 Gall Boulevard Zephyrhills FL 33541 Michael Weaver × Close Michael Weaver Phone: (813) 293-7856 Send an Email Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Greater East Pasco Chamber of Commerce | Site by GrowthZone Get In Touch! 352-567-3769 14112 8 th Street, Dade City, FL 33525 813-782-1913 38550 5th Avenue, Zephyrhills, FL 33542 ceo@eastpascochamber.org Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! facebook YouTube The Greater East Pasco Chamber of Commerce is committed to ensuring that its website is accessible to people with disabilities. The Greater East Pasco Chamber of Commerce is in the process of updating all pages on our website. All pages will meet W3C WAI’s Web Content Accessibility Guidelines 2.1, Level AA conformance. For a copy of the Greater East Pasco Chamber of Commerce ADA Compliance Policy or to report any issues, please direct email to ceo@eastpascochamber.org . © 2025 Greater East Pasco Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://papaspizzacompany.com/contact/",
      "text": "Contact – Papa's Pizza Company Home Menu Our Menu Order Online Features About Us Our Services News Contact Events Mission Hill 617.648.7272 Order Online Mission Hill Close Home Menu Our Menu Order Online Features About Us Our Services News Contact Events 617.648.7272 Info@PapasPizzaCompany.com Order Online get in touch Contact Info Get in touch with any questions or to set up a catering service! We kindly ask that you provide us with at least one days notice for catering. Feel free to call us or fill out the contact form below. 682 Huntington Avenue Boston Ma 02115 Open 7 Days/Week from 10:30 am to 1:00 am 617-648-PAPA (7272) Find us on Facebook Follow Us on Twitter Follow Us on Instagram Stay in Touch I agree that my submitted data is being collected and stored. For further details on handling user data, see our Privacy Policy Send Message Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like this: Like Loading... Spoonless Ventures LLC © 2017 All Rights Reserved Terms of Use and Privacy Policy TO TOP %d"
    },
    {
      "url": "https://mainstreetzephyrhills.org/sponsors-members/",
      "text": "Members- Main Street Zephyrhills Skip to content Skip to content (813) 780-1414 director@mainstreetzephyrhills.org 38537 5th Avenue Zephyrhills, FL Donate (813) 780-1414 info@mainstreetzephyrhills.org 5325 9th Street, Zephyrhills, FL, 33542 Donate (813) 780-1414 info@mainstreetzephyrhills.org 5325 9th Street, Zephyrhills, FL, 33542 Home About About Us Our History Join Investor Plan Sponsorships Sponsors & Partners Join a Committee Volunteer Directory Business Directory Event Calendar Projects Murals Historic Home Theater Historic Preservation Donate Resources Community Bulletin Board Zephyrhills CRA Business Toolkit Contact Home About About Us Our History Join Investor Plan Sponsorships Sponsors & Partners Join a Committee Volunteer Directory Business Directory Event Calendar Projects Murals Historic Home Theater Historic Preservation Donate Resources Community Bulletin Board Zephyrhills CRA Business Toolkit Contact Donate Sponsors & Partners Sponsors Partners Individual and Family Sponsors Partners Individual and Family Sponsors Kerns Family Construction Address: 5031 Airport Road, Zephyrhills, FL 33542 Telephone: 813-996-0772 Email: Linda@kfc-inc.com Website: – http://www.kfc-inc.com Description: Restoring the Past. Building the Future. With over 50 years combined in the real estate and construction industries, our family run business is uniquely staffed to service our Clients like no other. Somebody will be calling the result ‘HOME’, and that is always the foremost priority in our minds. We ask ourselves at the end of each and every job, would we be EXCEEDINGLY SATISFIED if this was our residence or business? Because for Kerns Family Construction, our name is on it – and it IS personal! Our distinct service offerings include: Remodels and Historic Home Renovations Custom Homes & Renovations Commercial Construction & Renovations Commercial Interior Build outs Jim Browne Automotive Group Address: 10741 US-301, Dade City, FL 33525 Telephone: (352)437-6103 Email: Description: Located in Dade City, Florida, the staff at Jim Browne Dade City Chevrolet Buick GMC will help you find the new or pre-owned SUV, truck or car you want. At Jim Browne Dade City Chevrolet Buick GMC, we offer a searchable online inventory of new Chevrolet, Buick and GMC vehicles along with well-maintained pre-owned cars by today’s top manufacturers. Hometown Roofing & Construction Address: 5031 Airport Rd.  Zephyrhills, FL 33542 Telephone: 813-996-0772 Email: linda@hometownroofingandconstruction.com Website: https://hometownroofingandconstruction.com/ Description: As your hometown roofing company we offer residential and commercial roofing services. We are third generation roofers with deep roots in the greater Tampa Bay area. Hometown has you covered, Rooted In Quality And Tradition! Badcock Home Furniture Address: 5500 6TH St. Zephyrhills, FL 33542 Telephone: 813-782-4370 Email: Website: https://www.badcock.com/ Description: Home is where the heart is, so it makes sense to create a home filled with things you love the most. Partners All creator innovator leader A.D. Morgan Address: 716 N. Renellie Drive, Tampa, FL, 33609 Telephone: 813-832-3033 Email: info@admorgan.com Description: The A.D. Morgan Corporation   maintains an outstanding reputation in the construction industry as   Construction Managers and General Contractors. With offices in Tampa, Bradenton, Sebring and Cocoa the company currently employs almost 50 people   with annual revenues of approximately $80 Million. The company’s project   experience is diverse with projects that include educational facilities,   corrections facilities, offices, retail, food service, television and radio   stations and research and University projects through out the state of   Florida. Advent Health Address: 7050 Gall Blvd Zephyrhills, FL, 33541 Telephone: 813-779-6256 Email: emmy@cpazhills.com Description: Affordable Motorsports Address: 35914 State Rd. 54 Zephyrhills, FL, 33541 Telephone: 813-322-3732 Description: Since 2006, Affordable Motorsports has provided superior customer service and has an entire team that consists of professional sales members, service technicians and a knowledgeable parts and accessories staff to support you, our valued customer. B&N Lenz Enterprises Address: 39104 3rd Avenue, Zephyrhills, FL, 33542 Telephone: 813-782-9491 Email: nilslenz@gmail.com Description: Bodine Perry Address: 6815 Dairy Rd., Zephyrhills, FL, 33542 Telephone: 813-788-2155 Email: mreutimann@bodineperry.com Description: Bodine Perry, LLC, a growing certified public accounting firm with offices located in Canfield and Columbus, Ohio and Fort Myers, Naples, Orange Park, and Zephyrhills, Florida, is committed to providing the highest quality accounting, auditing, tax, and management advisory services to our clients. Our firm employs more than 100 team members with a wide range of experience and skills, serving businesses in a variety of industries. Contact: Marci Reutimann CPA Boltin Pest Control Address: 15534 US 301, Zephyrhills, FL, 33542 Telephone: 813-536-5952 Email: pestlady@aol.com Description: Commandough's Address: 5841 Gall Blvd, Zephyrhills, FL, 33542 Telephone: 813-603-7499 Email: commandoughs@gmail.com Description: Cross Environmental Services Address: P.O. Box 1299, Crystal Springs, FL, 33540 Telephone: 813-783-1688 Email: info@crossenv.com Description: Owner operated full service environmental and demolition contractor operating for over 30 years! Cross Environmental Services, Inc. was founded in 1988 by the President and CEO of the company, Mr. Clyde A. Biston and Mr. John Agan. Mr. Agan died in 1997. CES has grown into one of the largest owner-operated full service environmental, asbestos abatement and demolition firms in the State of Florida. Dr. Doc Thayer WZPH 96.7 FM Address: Telephone: Email: Description: Faithful Friends Pet Cremation Address: 5221 8th St, Zephyrhills, FL, 33542 Telephone: 813-788-3065 Email: rachel@faithfulfriendscremation.com Description: First National Bank of Pasco Address: 37215 SR 54, Zephyrhills, FL, 33542 Telephone: 813-779-1905 Email: tmahon@fnbpasco.com Description: Fraternal Order of Eagles # 3572 Address: 38421 5th Ave, Zephyrhills, FL 33542 Telephone: (813) 355-3313 Email: Description: The Fraternal Order of Eagles. The F.O.E. was founded in 1898 on a premise of proud, caring, People Helping People with a passion for community service GFWC Women's Club Address: 38545 Fifth Avenue in Zephyrhills, FL, 33542 Telephone: 813-404-5789 Email: info@gfwczephyrhills.org Description: Habitat for Humanity ReStore Address: 4700 Allen Rd, Zephyrhills, FL, 33541 Telephone: 813-395-6994 Email: restore@pascohabitat.org Description: Henson & Murtha Address: 5315 8th Street Zephyrhills, FL, 33542 Telephone: 813-782-0580 Email: emmy@cpazhills.com Description: Hudgins Law Firm Address: 38453 5th Avenue Zephyrhills, FL, 33542 Telephone: 813-788-5534 Email: drew@hudginslawfirm.net Description: Our firm has spent nearly 30 years fighting for people just like you. Here you’ll find an attitude that takes no case lightly… and an attorney-client relationship that just feels comfortable. Your next decision could be one of   the most important you’ll ever make. Call us. If we can help you, we will. Hyperbaric Centers of Florida Address: 5610 6th Street Zephyrhills, FL, 33542 Telephone: 813-788-3969 Email: sjanca@hyperbariccentersofflorida.com Description: Hyperbaric Oxygen Therapy HBOT   for Autism, Stroke, Lyme Disease, Cerebral Palsy, and more. Hyperbaric   Centers of Florida is a premier Hyperbaric Treatment Facility located in the   Tampa Bay area. Our state-of-the-art Hyperbaric Clinic provides therapy to outpatients   on a 7-day per week basis, closing only on major holidays. We serve all of   North America as well as Caribbean, Latin & Central American Markets. The Hyperbaric Clinic is equipped with Real 3ATA Mono place and Multi place Hyperbaric Chamber Systems that are ASME, PVHO, National Board, NFPA, and FDA   510(K) cleared and compliant systems. We are treating all approved indications and selected off-label   indications, as directed by a licensed physician with written orders. Lee Reed Insurance Address: 38511 5th Avenue Zephyrhills, FL 33542 Telephone: 813-782-5502 Email: main@leereedins.com Description: We are a local, family-owned and operated, full-service, independent insurance agency.  We have served the citizens and businesses of East Pasco since 1946. We are known for outstanding service and unquestionable ethics. Our agency has been built on honest, long-term relationships. Lion's Club Zephyrhills Address: 5827 Dean Dairy Rd, Zephyrhills, FL 33541 Telephone: (813) 788-1441 Email: zhills.lions@outlook.com Description: Founded in 1917, we are best known for fighting blindness, but we also volunteer for many different kinds of community projects – including caring for the environment, feeding the hungry and aiding seniors and the disabled Marcie L Baker P.A. Address: 5518 7th Street Zephyrhills, FL, 33542 Telephone: 813-929-1900 Email: mbaker@anattorneysgotyourback.com Description: Law office representing injured   workers and clients who have divorce, parenting and child support issues.   Work through your marriage dissolution and other family law issues with the   help of our friendly and professional lawyers. We also help mediate pre-court   divorce agreements. If you were injured at your workplace, see attorney   Marcie L. Baker for your no-recovery, no-fee legal representation. We’ll help   you get the benefits due to you through the law! Our law office is a member   of the Florida Association of Women Lawyers, Women Lawyers of Pasco, Florida   Bar Association, and supporter of Dade City Little League. Marine Corps League Address: P.O. Box 1134, Zephyrhills, FL. 33539 Telephone: 813-78/8-5676 Description: Marine Corps League Sgt. Maj. Michael S. Curtin Detachment #1124. Veterans Organization serving the community! Our Savior Lutheran Church Address: 5626 20th Street Zephyrhills, FL, 33542 Telephone: 813-782-1369 Email: ochurch@tampabay.rr.com Description: The Painted Pixie Address: 5210 7th St. Zephyrhills, FL, 33542 Telephone: 813-758-5538 Email: shepretty01@gmail.com Description: Located in historic downtown Zephyrhills, The Painted Pixie offers hair styling and color design in a relaxed, yet uplifting and empowering salon Paul Schaper Roofing Inc. Address: 8949 Gall Blvd, Zephyrhills, FL, 33541 Telephone: 813-782-0920 Email: info@schaperconstruction.com Description: For more than 35 years, Schaper Companies has provided construction services that our customers have used to help launch their projects, keep them under budget and on time. We know the ins and outs of construction like no one else and our knowledge can make the difference between a successful project and a costly one. Rotary Club of Zephyrhills Address: P.O. Box 1234, Zephyrhills, FL, 33542 Telephone: Email: rotaryclubofzephyrhills@gmail.com Description: That 1 Painter Address: 36739 SR 52, Ste 103 Dade City, FL 33525 Telephone: 813-533-5583 Email: contact@that1painter.com Facebook: https://www.facebook.com/That1PainterNorthTampa Description: Locally owned and operated painting company serving the North Tampa area. Our North Tampa Florida team of painters is ready to bring you all the high-quality services you’ve come to expect from That 1 Painter. This local team promises home service work that’s affordable, done right, and always delivered with workmanship and expertise you can absolutely trust. S & R Services Address: 5513 Ambassador Dr. Tampa, FL, 33615 Telephone: 813-909-6965 Email: rosie@rosiepaulsen.com Description: S&R Services is on a mission to make Medicare simple. Owner Rosie Paulsen, a Medicare agent, recognized community leader and business trailblazer, has brokered Medicare coverage for people all over Tampa Bay since 2004. S&R Services also offers free quarterly Medicare Simplified webinars for those turning 65 and those caring for someone needing benefits. S&R Services also helps agents interested in brokering Medicare. San Antonio Citizens Federal Credit Union Address: 7301 Gall Blvd, Zephyrhills, FL, 33542 Telephone: 352-588-2732 Email: jevans@sacfcu.org Description: Stitch Happens! Address: 5107 Lantana St. Zephyrhills, Fl, 33542 Telephone: 813-679-9355 Email: Stitchhapppenskat@gmail.com Description: Sunstate Title Agency Inc. Address: 5536 6th Street Zephyrhills, FL, 33542 Telephone: 813-782-9293 Email: sunstatetitle@sunstatetitlefl.com Description: The Laker Lutz News Address: PO Box 479 Lutz, FL, 33548 Telephone: 813-909-2800 Email: news@lakerlutznews.com Description: From local news and feature stories, to high school, college and youth sports, The Laker/Lutz News is your true hometown newspaper. The Laker and Lutz News publish four weekly newspapers serving Northwest Hillsborough County (Lutz and Odessa) and Central/East Pasco (Land O’ Lakes, Wesley Chapel Zephyrhills and Dade City). The Mortgage Firm Address: 5243 Gall Blvd. Suite 1 – 2, Zephyrhills, FL. 33542 Telephone: 863-937-8024 Email: monica.young@tmf.mortgage Description: The Mortgage Firm is a residential mortgage lender.  Specializing in FHA, Conventional, USDA and VA.  First Time Home Buyers with Down Payment Assistance. The Social Connection Address: Telephone: 813-314-7072 Email: thesocialconnectionllc@gmail.com Description: Whether your company needs assistance marketing your business on social media platforms, building a new website, or graphic/digital design, The Social Connection is here to help! We have a variety of business options to choose from. Our goal is to help startup companies, as well as small businesses, achieve their marketing goals. Get Connected! Tiny Houses of Zephyrhills Address: Telephone: 813-815-0019 Email: tinyzhills@gmail.com Description: Short Term + Vacation Rental Tiny Houses in Central West Florida! Tubby's BBQ Address: 5740 7th Street, Zephyrhills, FL, 33542 Telephone: 813-788-6500 Email: tubbysq@gmail.com Description: WDA Design Group Address: 16057 Tampa Palms Blvd. W. #160, Tampa, FL. 33647 Telephone: 813-988-2800 Email: jodi@wilkesondesign.com Description: WDA Design Group specializes in  commercial architecture and interior design.  They are celebrating 20 years of business in the Tampa Bay Area. Your Turn Board Game Cafe Address: 38430 5th Avenue, Zephyrhills, FL, 33542 Telephone: 813-715 – 2103 Email: info@your-turn-cafe.com Description: Your Turn is truly a labor of love for us, some of our fondest memories from childhood are anchored around playing board games with friends or family. In an increasingly digital world, Board games offer a unique to create physical and personal connections with the people and spaces around us. Your Turn is a space for people to come together and connect with others through structured play. We have gathered a vast selection of over 1,000 games spanning from old classics to new challenges. We want it to be a welcoming and comfortable space for people to meet together for date night, a family outing, a small group, or a large party. While you’re here, be sure to grab something to keep you gaming! Zephyrhills Chamber of Commerce Address: 38550 5th Avenue, Zephyrhills, FL, 33542 Telephone: 813-782-1913 Email: admin@zephyrhillschamber.org Description: The Zephyrhills News The Zephyrhills News Address: 38333 5Th Ave. Zephyrhills, FL 33542 Telephone: 813-782-1558 Email- thezephyrhillsnewsonline.com Description: This year marks the 111th anniversary with an ongoing commitment to cover all aspects of the local news and sports scenes while spreading the word about our loyal advertisers’ products and services. Publishes every Thursday. Website- https://thezephyrhillsnewsonline.com/ Zephyrhills Historical Association Zephyrhills Historical Association Telephone: 813-469-3624 Email- Facebook : https://www.facebook.com/groups/zhillshistory/ Description: ZHA Mission Statement The mission of the Zephyrhills Historical Association is to research, gather, and share local historical information with all generations, through our literature, programs, and scholarships, and to volunteer assistance to the Zephyrhills Depot Museum and WWII Barracks Museum. Nailed it with Amanda Hawk Nailed it with Amanda Hawk Telephone: 352-206-7176 Email- ahawk39@icloud.com Facebook- https://www.facebook.com/groups/naileditwithamandahawk Description: Amanda Hawk, Independent Color Street Stylist, offers the full line of Color Street products including 100% nail polish strips, nail care products, and cosmetics.  Amanda offers her products online or she brings the fun to you and your friends in your home. Scharber Law Group, P.A. Scharber Law Group, P.A. Telephone: 352-534-8080 Email- info@scharberlaw.com Facebook- https://www.facebook.com/scharberlawgroup/ Description: Full Service Law Firm Individual & Family Tony & Linda Kerns Anna M. Poe Paul & Amy Chappell Eileen Ann Westermann Cheryl Black Chuck Roppolo Anna Stutzriem Gail Hamilton Nita Eiland Randy Stovall Debbie Murray Travis Marshall Sponsors: Main Street Zephyrhills, Inc does not and shall not discriminate on the basis of race, color, religion (creed), gender, gender expression, age, national origin (ancestry), disability, marital status, sexual orientation, or military status, in any of its activities or operations. These activities include, but are not limited to, selection of Board Members, volunteers, members, participants and vendors, and provision of services. We are committed to providing an inclusive and welcoming environment for all of our staff, members, volunteers, subcontractors, vendors, and clients. Business Toolkit Business Tax Receipt Application Commercial Check Procedures Register Your Business Register with the IRS Register with the Department of State Business Tax Receipts Links Investor Plan Sponsors/Members Join a Committee Business Directory Donate Event Calendar Subscribe First Name Last Name Email Subscribe Facebook Instagram © All rights reserved – Main Street Zephyrhills | Created by The Social Connection Home About About Us Our History Join Investor Plan Sponsorships Sponsors & Partners Join a Committee Volunteer Directory Business Directory Event Calendar Projects Murals Historic Home Theater Historic Preservation Donate Resources Community Bulletin Board Zephyrhills CRA Business Toolkit Contact Facebook Instagram Main Street Zephyrhills Events Coming Soon! Main Street Zephyrhills Events Main Street Zephyrhills Events View/Register For Events By using this website, you agree to our use of cookies. We use cookies to provide you with a great experience and to help our website run effectively. Close"
    },
    {
      "url": "https://pizzazznyc.com/about-us/",
      "text": "About Us - pizzazznyc.com Home Menu About Us Catering Contact Order Now 38 Union Square East New York, New York 1003 +1 646 872 1187 info@pizzazz.com Home Menu About Us Catering Contact Order Now About Us Concept Who We Are? Pizzazz is our passion project—a place where we blend our love for great pizza and the hustle of NYC. This isn’t just pizza, it’s a piece of who we are. Pizzazz brings a fresh take on fast food with Neapolitan-inspired pizza, adding a New York twist. Every pizza is personal-sized, made from scratch, and fired up right when you order, combining traditional craftsmanship with bold flavors. Our philosophy is simple: great pizza, made with passion, for people who love pizza as much as we do.\nWe believe that the great pizza starts with great dough.\nIt's the foundation of everything we do, bringing that perfect balance of chew, crisp, and flavor. Using Italian 00 flour, sea salt, yeast, and water, we let time do the rest-allowing our dough to rise and develop its unique texture. It's not just a base, it's the heart of every Pizza we make. Testimonials What Our Guests say \"Absolutely delicious and will definitely be coming back. The pizza dough is perfect, and the ingredients are fresh. Staff is friendly and welcoming. I highly recommend.\" Noelani Rodriguez \"The pizza here is amazing, and the staff couldn’t be friendlier. The dough was just right—light, crispy, and absolutely perfect. The ingredients tasted so fresh and vibrant. I tried the spicy salami pizza, and it hit all the right notes, with a perfect balance of heat and sweetness. Great place for lunch or dinner!\" Pat Dorian \"We ordered pizzas from Pizzazz for a wine party, and they were absolutely fantastic! The crust was perfectly crispy, the toppings were fresh, and each bite was bursting with flavor. It paired beautifully with our selection of wines, making the night truly special. Highly recommend this place for anyone looking to elevate their pizza experience!\" Mikkel Solbakken \"I found this place by accident and I must say it’s the best pizza I’ve had a long time! It was so tasty. I had prosciutto di Parma pizza and it comes as a whole pizza not a slice! The staff were lovely, they opened recently and were all excited. Will definitely be coming back to try other options.\" Bonnie Bon Founded in 2024, Pizzazz is dedicated to all pizza lovers. We invite you to join us on a journey where Neapolitan-inspired pizzas meet creative twist. ADDRESS 38 Union Square East New York, New York 10003 +1 646 872 1187 info@pizzazznyc.com OPEN HOURS Monday – Friday 9AM – 9PM Saturday –Sunday 12pm – 9PM 2025 © Pizzazz. Instagram"
    }
  ]
}