{
  "fuentes": [
    {
      "url": "https://www.compasshotel.com/contact-us",
      "email": "development@margaritaville.com"
    },
    {
      "url": "https://daytonastateinmotion.com/news/compass-by-margaritaville-breaks-ground-in-flagler-beach/",
      "email": "inmotion@daytonastate.edu"
    },
    {
      "url": "https://www.chillinnthailand.com/co-working",
      "email": "coworking@chillinnthailand.com"
    },
    {
      "url": "https://www.chillinnthailand.com/co-working",
      "email": "samui@chillinnthailand.com"
    },
    {
      "url": "https://www.clickorlando.com/news/local/2023/12/09/flagler-beach-art-gallery-owner-to-open-cafe-bar-grill/",
      "email": "ptolley@wkmg.com"
    }
  ],
  "mails": [
    "coworking@chillinnthailand.com",
    "development@margaritaville.com",
    "inmotion@daytonastate.edu",
    "ptolley@wkmg.com",
    "samui@chillinnthailand.com"
  ],
  "nombre_sitio": "compasshotel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.compasshotel.com/contact-us",
      "text": "Contact Us | Compass by Margaritaville Skip to Content (Press Enter) Margaritaville Perks Own In Margaritaville Open search modal Discover Compass Locations Eat & Drink Offers Hotel Development Gallery Book Now Menu Advanced search modal Start Your Search Most Commonly Searched Terms Activities Sports Family Boating Guided Tours Advanced search modal Start Your Search Most Commonly Searched Terms Activities Sports Family Boating Guided Tours Margaritaville Perks Own In Margaritaville Discover Compass Locations Eat & Drink Offers Hotel Development Gallery This is a carousel with auto-rotating slides. Activate any of the buttons to disable rotation. Use Next and Previous buttons to navigate. Book Your Stay Reservations Destination Select Hotel West Coast Midwest Southeast Compass Hotel Naples All-Suite Naples, FL Compass Hotel Pigeon Forge Pigeon Forge, TN Compass Hotel Medford Medford, OR Compass Hotel Anna Maria Sound Bradenton, FL Compass Flagler Beach Flagler Beach, FL International Dates Previous month Next month Guests Decrease 0 1 Increase Special Codes Reservations Destination Select Hotel West Coast Midwest Southeast Compass Hotel Naples All-Suite Naples, FL Compass Hotel Pigeon Forge Pigeon Forge, TN Compass Hotel Medford Medford, OR Compass Hotel Anna Maria Sound Bradenton, FL Compass Flagler Beach Flagler Beach, FL International Dates: Previous month Next month Booking Check-in: Booking Check-out: Guests: 1 Guest 2 Guests 3 Guests 4 Guests 5 Guests Contact Us Get in Touch Have any questions or comments for us? We’d love to hear from you! Compass By Margaritaville Questions? Concerns? Compliments? We’re always happy to connect with our past, present, and potential guests. Find our contact information for the Margaritaville main office below. If you would like to reach a specific hotel, please contact them direct through their individual websites which are listed on this page. If you are interested in finding out more about opening dates for our coming soon locations, please check back frequently to this website for the most current information. Contact Us Compass Hotels by Margaritaville Main Office: 6900 Turkey Road, Suite 200 Orlando, FL 32819 Compass Hotels and Margaritaville Hotel & Resort Development inquiries: [email protected] Compass Hotels and Margaritaville Media inquiries: [email protected] Stay Connected Sign up for our newsletter, and you’ll be among the first to know our latest offers and updates. * Your Email: Compass by Margaritaville Facebook Twitter Instagram Margaritaville Hotels & Resorts Margaritaville Own in Margaritaville Compass Hotel Culture Accessibility Contact Us Careers Privacy Policy Notice at Collection Site Map Your Privacy Choices Development Inquiries [email protected] © Compass by Margaritaville Facebook Twitter Instagram YouTube LinkedIn TripAdvisor Pinterest Datepicker Search Question Email Pointer Close Button Guests Icon Guests Icon"
    },
    {
      "url": "https://daytonastateinmotion.com/news/compass-by-margaritaville-breaks-ground-in-flagler-beach/",
      "text": "Compass by Margaritaville Breaks Ground in Flagler Beach - Daytona State In Motion Skip to content Menu News Features Arts & Entertainment Sports Opinion About 5th Quarter Aeolus Magazine Menu Home » News » Compass by Margaritaville Breaks Ground in Flagler Beach Compass by Margaritaville Breaks Ground in Flagler Beach Posted on February 25, 2024 February 25, 2024 by Landen Looker A photo of the Flagler Beach Hotel, fronting Verteran’s Park in 1964. Photo credit: Flagler County Historical Society . Flagler Beach’s Compass by Margaritaville hotel has broken ground. Located in the center of Flagler Beach, Veteran’s Park, it has stirred the attention of many locals. Ormond Beach-based Elite Hospitality’s developer and manager, Manoj Bhoola, alongside Jeremy Bain from Welbro Building Corp., are leading the charge on the project set to reshape Flagler Beach. Addressing an eager crowd of over 80 locals at City Hall, they unveiled plans for what promises to be the most significant construction endeavor in the area. From 1925 to 1972, Flagler Beach proudly hosted the renowned Flagler Beach Hotel. Built by Dana Fellows Fuquay and George Moody, it quickly became a beloved destination for leisure. “Due to structural issues in the 70’s it (the hotel) was demolished”, says Caryn Miller, director of Flagler Beach’s CRA. This left a void in the community’s once booming hospitality. But now, with the construction of the Compass by Margaritaville, a new era of vitality could be on the horizon, certainly bringing change to the community. Construction progress on the Compass by Margaritaville as of February 20, 2024. Photo by Landen Looker. “The CRA (Community Redevelopment Area) functions based on its master plan, and the master plan called for looking for a hotel for that sight, and that’s exactly what happened” adds Caryn Miller. Miller attended that meeting at City Hall where the plans were unveiled. That said, there are still many mom-and-pop hotels and motels along the Flagler Beach coast with incredible charm. Those include the Si Como No Inn , the Topaz Motel , the Beachfront Motel and more. Contrasting those mom-and-pop accommodations, this ambitious venture will sprawl across 84,000 square feet over three stories, boasting 100 rooms, a large restaurant, a fitness center, and a pool deck complete with a tiki bar. Guests will also have access to a rooftop terrace and exclusive retail outlets. It is expected to begin operating in Spring of 2025. Managed by Elite Hospitality, the restaurant alone is poised to create around 60 job opportunities, while the hotel itself will offer nearly 25 coveted positions. As construction gears up, expect to see bustling activity primarily from Monday to Friday, with the possibility of Saturday shifts in case of weather-induced setbacks. Inevitably, progress comes with a few adjustments. South Central Avenue, spanning from SR 100 to South 2nd Street, will be temporarily closed to vehicular traffic, ensuring smooth operations for the project. Additionally, parking and sidewalk access along South Second Street will be suspended to accommodate construction needs. Concerns have emerged surrounding the parking arrangements and construction plans for the Compass by Margaritaville development. Residents argue that these initiatives could potentially disrupt the authentic local ambiance of the community. Given its relatively diminutive size, such large-scale construction projects are unprecedented for many residents. However, some may argue that these concerns must be balanced against the overarching objective of uplifting the Flagler Beach economy. Whispers of excitement and apprehension alike dance through the air, as locals and visitors engage in spirited conversation about the Compass by Margaritaville. For some, it represents a wave of progress, promising new opportunities and revitalization for the beloved coastal town. For others, it sparks concerns of overdevelopment and the erosion of Flagler Beach’s unique charm. 1 thought on “ Compass by Margaritaville Breaks Ground in Flagler Beach ” Judy McDonough says: March 11, 2024 at 6:37 pm When will it be finished? We want to make reservations Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Instagram Facebook X Search Recent Posts Daytona International Speedway: Coke Zero Sugar 400 Palm Coast community gathers for annual Songwriters Festival! Were you there? The Handmaids Tale Music and Art Color Port Orange’s City Center at Lakeside Jazz Festival Go Cold for a Cause Our Team About Us Team Members 2025-2026 Media Kit Contact Us Email: inmotion@daytonastate.edu Phone: (386) 506 - 3268 Instagram Facebook X Partners Aeolus Magazine Daytona State College FCSPA ©2025 Daytona State In Motion | Design: Newspaperly WordPress Theme"
    },
    {
      "url": "https://www.chillinnthailand.com/co-working",
      "text": "Co Working | Chill Inn top of page home Menus Chill Inn Tour Fisherman’s Market Tour Ocean Tour Night Tour at Chaweng Market Ocean & Elephant Tour Locations Chill Inn Hub - Koh Samui Lipa Noi - Koh Samui Choeng Mon - Koh Samui Chaweng - Koh Samui Ekkamai - Bangkok Co Working Contact More... Use tab to navigate through the menu items. ESCAPE THE CROWD, WORK IN STYLE Chill Inn CoWorking Space Chaweng Noi | Koh Samui Ditch the distractions and work in style Chill Inn CoWorking is your one-stop shop for productivity in paradise. Stuck between the party vibes of Chaweng and the laid-back charm of Lamai?  Chill Inn CoWorking offers the perfect middle ground.  This brand new co-working space Chill Inn puts you right in the heart of the action, but with a focus on productivity and peace of mind. Fuel Your Creativity At our café, we believe great work starts with great food. Whether you're here for a quick bite between meetings or to savor a slow, nourishing meal while brainstorming, our menu is designed to fuel your mind and body. Enjoy fresh, locally sourced ingredients that showcase the best of Koh Samui's flavors—crafted with care to keep you energized and inspired throughout the day. Learn More Experience the Chill Inn Difference Drawing on the success of our popular hostels around Koh Samui, Chill Inn CoWorking brings the same commitment to comfort and community.  This isn't just a co-working space – it's a chance to connect with other remote workers, share ideas, and create a network that extends beyond your screen. Co-working Desks Fast Internet Cafe & Bar Meeting Rooms Dedicated Desks Best Location Collaboration Area Shower Facilities Become a member We’ve built the best co-working space Koh Samui has ever seen. Sign up today or drop by to come and see the space. Learn More The Spaces The Ideal Location Ditch the long commutes - Chill Inn CoWorking sits conveniently between Koh Samui's two most popular beaches, allowing you to seamlessly blend work and play.  Need a post-work refresh? Lamai's stunning sunsets and relaxed atmosphere await. Craving a bit more energy? Chaweng's vibrant nightlife is just a stone's throw away. Fuel Your Focus No co-working space is complete without exceptional food and drinks.  Chill Inn CoWorking boasts a highly-rated cafe and bar serving up delicious pastries and barista-crafted coffees to keep you energized throughout your workday.  Unwind after a productive session with a refreshing drink, all without ever leaving the building. Your Workspace, Your Way Whether you thrive in a collaborative environment or prefer a quiet corner to focus, Chill Inn CoWorking caters to every work style -  Choose from a variety of seating options, from private desks, comfy beanbags to communal tables, to find your productivity zone.  Need to print a document or two?  They've got you covered with a reliable printer.  And of course, you can stay connected with blazing-fast wifi to ensure seamless online collaboration. Price Table 01. COLD DESK​ Full Price: ฿6000/month 6 months : 10% discount 02. HOT DESK​ Full Price: ฿3500/month Hot Weekly: ฿1700 Hot Daily: ฿400 6 months : 10% discount 03. BIG MEETING ROOM​ Full Price: ฿3000/day Hourly: ฿1000 ​ 04. SMALL MEETING ROOM​​ Full Price: ฿2500/day Hourly: ฿700 ​ ​ Contact us. Get in touch with us by sending your inquiry, or just walk in to our space and we would love to help you out. you can reach us through this contact form or on: coworking@chillinnthailand.com Enquiry: +66 64 941 2091 First name Last name Email Write a message Submit Thanks for submitting! Explore Co-Woking Space ADDRESS 438/118, Koh Samui, Surat Thani 84310, Thailand samui@chillinnthailand.com General Inquiries +66 81136 9624 Co-working Inquiries +66 64 941 2091 Follow Sign up to get the latest news on our product. Enter your email address Subscribe Thanks for subscribing! House Rules Check In 14:00 - 22:00 Check Out until 12:00 © 2023 by ChillInn. Powered and secured by Madman © 2024 by Chill Inn. Powered and secured by DFI bottom of page"
    },
    {
      "url": "https://www.clickorlando.com/news/local/2023/12/09/flagler-beach-art-gallery-owner-to-open-cafe-bar-grill/",
      "text": "Flagler Beach art gallery owner to open café, bar & grill Skip to main content Open Main Menu Navigation Open Search Cloudy icon 74 º Go to the WKMG homepage Join Insider Sign In Open the WKMG News 6 & ClickOrlando Help Desk Search News Watch Live Insider Investigators Local News Florida National World Politics Space News Entertainment Strange Florida Weather Weather News PinIt! Hurricane Weather Wise Forecasting Change Alerts Live Orlando Cam Live Beach Cam Live Port Cam Live Mount Dora Cam Live Palm Island Park Cam News 6+ Watch News 6+ Insider I-4 Food Tour Florida Foodie Solutionaries Black Men Sundays NEXTGEN TV The Hecht Effect Real Estate Getting Results. Results Desk Driving Change Protecting Our Community Getting Results In Our Schools Getting Results At Home Need Results? Traffic Ask Trooper Steve On Patrol Features Insider Events Calendar 6 Things To Do Theme Parks Pets Food Health Travel Tech Pros Who Know Branded Content Sports Orlando Magic Orlando Magic - Stats UCF Knights UCF Knights - Stats Florida Gators Florida Gators - Stats Orlando City SC Orlando Pride Miami Dolphins Dolphins - Stats Tampa Bay Buccaneers Buccaneers - Stats Jacksonville Jaguars Jaguars - Stats Player of the Week Olympics Contact Us Results Desk Insider Meet The Team Careers at WKMG Advertise with us Contests & Rules TV Listings Community Calendar Newsletters Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters News Weather News 6+ Getting Results. Traffic Features Sports Contact Us Newsletters WEATHER ALERT 2 warnings and 3 advisories in effect for 4 regions in the area Show Breaking News Bar Close Local News Patricia Tolley , Content Gatherer Published: December 9, 2023 at 10:00 AM Updated: December 9, 2023 at 10:13 AM Tags: Flagler Beach , Flagler County , Florida Foodie , Food RELATED STORIES The Knot House The Knot House set to open next month in Volusia County Read full article: The Knot House set to open next month in Volusia County D'Amico & Sons Italian Market & Bakery D’Amico & Sons Italian Market & Bakery celebrates opening at Oviedo Mall Read full article: D’Amico & Sons Italian Market & Bakery celebrates opening at Oviedo Mall Restaurants look for boost as Visit Orlando’s Magical Dining begins Magical Dining 2023 raked in $269K for Orange County charities, Visit Orlando says Read full article: Magical Dining 2023 raked in $269K for Orange County charities, Visit Orlando says LATEST NEWS No description available 1 hour ago Apopka commissioner accused of living outside city limits while running for office Read full article: Apopka commissioner accused of living outside city limits while running for office James Lake, 28, faces charges of fleeing and interfering 1 hour ago Man pepper-sprayed by Orlando police now faces charges Read full article: Man pepper-sprayed by Orlando police now faces charges Hawkins Building located at 319 S. Parramore Ave. has b en condemned 4 hours ago 8 residents displaced after historic Parramore building condemned Read full article: 8 residents displaced after historic Parramore building condemned Orlando city leaders break ground on repairs and upgrades to Orlando’s Albert Park 6 hours ago Officials break ground on upgrades to Orlando’s Albert Park; set to reopen end of year Read full article: Officials break ground on upgrades to Orlando’s Albert Park; set to reopen end of year Sign up for our events newsletter: Sign Up Local News Flagler Beach art gallery owner to open café, bar & grill 3-story venue to serve breakfast, lunch and dinner with a view Patricia Tolley , Content Gatherer Published: December 9, 2023 at 10:00 AM Updated: December 9, 2023 at 10:13 AM Tags: Flagler Beach , Flagler County , Florida Foodie , Food Chef MJ Smith (left) and a hashbrown bowl (right) (Copyright 2023 by WKMG ClickOrlando - All rights reserved.) FLAGLER BEACH, Fla. – Marge and Ted Barnhill are in their 70s and rather than relaxing beachside enjoying retirement, they are getting ready to open a restaurant. This new eatery is Barnhill’s Café, Bar & Grill, which opens mid-January and will be located at 202 S. Central Avenue in Flagler Beach, according to front-of-house manager Tara Palazzotto. Recommended Videos Marge and Ted Barnhill are husband and wife, with Marge owning the Gallery of Local Art next door to the new café. However, Marge always had a dream of operating a restaurant and Ted finally agreed to expand their investment in the city, Palazzotto said. [EXCLUSIVE: Become a News 6 Insider (it’s FREE) | PINIT! Share your photos ] Barnhill’s Café, Bar & Grill will be a three-story venue, serving breakfast, lunch and dinner with a view of the beach. It is working on hiring 20-30 employees at this time. MJ Smith is the executive chef creating the vast menu for the eatery. Right now, the test kitchen is underway, with Smith and his team working to nail down the exact dishes that will be served, according to the restaurant’s Facebook page . Meanwhile, one item Smith confirmed will be available at Barnhill’s is its breakfast crispy hash brown bowls, which he thinks will be a huge seller. These bowls will come in a variety of styles with different toppings such as eggs, cheese and bacon. Overall, to monitor when the restaurant posts its official grand opening date and hours of operations click here. Check out the Florida Foodie podcast. You can find every episode in the media player below: Copyright 2023 by WKMG ClickOrlando - All rights reserved. RELATED STORIES The Knot House set to open next month in Volusia County Read full article: The Knot House set to open next month in Volusia County D’Amico & Sons Italian Market & Bakery celebrates opening at Oviedo Mall Read full article: D’Amico & Sons Italian Market & Bakery celebrates opening at Oviedo Mall Magical Dining 2023 raked in $269K for Orange County charities, Visit Orlando says Read full article: Magical Dining 2023 raked in $269K for Orange County charities, Visit Orlando says Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us / Follow on Social Media Careers at WKMG Closed Captioning / Audio Description Public File Current EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications EEO Report Disability Assistance Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (407) 291-6000 At WKMG, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 ClickOrlando.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    }
  ]
}