{
  "fuentes": [
    {
      "url": "https://conchrepublicseafood.com/",
      "email": "conchfarm@outlook.com"
    },
    {
      "url": "https://conchrepublicseafood.com/connect",
      "email": "conchfarm@outlook.com"
    },
    {
      "url": "https://conchrepublicseafood.com/gallery",
      "email": "conchfarm@outlook.com"
    },
    {
      "url": "https://conchrepublicseafood.com/private-parties-reservations",
      "email": "conchfarm@outlook.com"
    },
    {
      "url": "https://conchrepublicseafood.com/full-menu",
      "email": "conchfarm@outlook.com"
    }
  ],
  "mails": [
    "conchfarm@outlook.com"
  ],
  "nombre_sitio": "conchrepublicseafood.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://conchrepublicseafood.com/",
      "text": "Conch Republic Seafood Company Home Private Parties & Reservations Food & Drinks Gallery History Connect Shop Back Full Menu Drink Menu Video Menu Home Private Parties & Reservations Food & Drinks Full Menu Drink Menu Video Menu Gallery History Connect Shop Scroll Welcome to the Conch Republic Seafood Company®! Enjoy fresh dock-to-dish dining in the building formerly known as the Singleton Fish House and Ice Plant. For many years, local shrimpers unloaded, processed, and shipped thousands of pounds of Key West Pink Shrimp from this location. Look around you and youʼll see the original concrete floor, grates, salvaged wood and the Singleton logo sign right above our stage. Keeping with this tradition, we are committed to serving you the freshest seafood Key West has to offer. Enjoy! HOURS & LOCATION 631 Greene Street Key West, FL 33040 305-294-4403 Open Daily at 11:30am Closing times vary, so please call! Private Parties Learn More Weddings, Rehearsal Dinners, Corporate Parties or other events. We have everything you are looking for! Happy Hour Daily View Drinks Daily Happy Hour from 4-7pm.  2-for-1 Domestic, Import and Craft Beer.  House Wines.  Premium Liquor Well Drinks. Freshest Catch View Menu From our boats to your table. For Fresher Fish you’ll have to catch it yourself! Our Store Shop Merch Click here to shop our store. We have hats, shirts and gift cards. “ Very good food, Beautiful views, Excellent staff... This is a not to be missed restaurant. ” — Jill McDermott Home Banner Home Intro Services Featured Quote Featured Gallery Key West’s Best Happy Hour! 2 for 1 All Beer - Domestic, Import & Craft 2 for 1 Premium Well Drinks 2 for 1 House Wine Every Day from 4-7pm Bar & Patio Only Hours of Operation Open Daily at 11:30am Closing times vary, so please call! Location Conch Republic Seafood Company 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com Conch Republic Seafood Company 631 Greene Street, Key West, FL, 33040, United States 305-294-4403 ConchFarm@outlook.com Hours Mon 11:30am - 9:30pm Tue 11:30am - 9:30pm Wed 11:30am - 9:30pm Thu 11:30am - 9:30pm Fri 11:30am - 9:30pm Sat 11:30am - 9:30pm Sun 11:30am - 9:30pm Home Menu Drinks Private Parties & Reservations Contact Us Privacy Policy Resource Links © 2025 Conch Republic Seafood. All Rights Reserved. | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://conchrepublicseafood.com/connect",
      "text": "Connect With Us — Conch Republic Seafood Company Home Private Parties & Reservations Food & Drinks Gallery History Connect Shop Back Full Menu Drink Menu Video Menu Home Private Parties & Reservations Food & Drinks Full Menu Drink Menu Video Menu Gallery History Connect Shop Connect with Us Contact Info 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com ﻿ Reservation Policy Unfortunately, we do not accept general reservations or call ahead seating. Please come in and see the hosts when you are ready and we’ll do our best to seat you as soon as possible. Key West’s Best Happy Hour! 2 for 1 All Beer - Domestic, Import & Craft 2 for 1 Premium Well Drinks 2 for 1 House Wine Every Day from 4-7pm Bar & Patio Only Hours of Operation Open Daily at 11:30am Closing times vary, so please call! Location Conch Republic Seafood Company 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com Conch Republic Seafood Company 631 Greene Street, Key West, FL, 33040, United States 305-294-4403 ConchFarm@outlook.com Hours Mon 11:30am - 9:30pm Tue 11:30am - 9:30pm Wed 11:30am - 9:30pm Thu 11:30am - 9:30pm Fri 11:30am - 9:30pm Sat 11:30am - 9:30pm Sun 11:30am - 9:30pm Home Menu Drinks Private Parties & Reservations Contact Us Privacy Policy Resource Links © 2025 Conch Republic Seafood. All Rights Reserved. | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://conchrepublicseafood.com/gallery",
      "text": "Gallery — Conch Republic Seafood Company Home Private Parties & Reservations Food & Drinks Gallery History Connect Shop Back Full Menu Drink Menu Video Menu Home Private Parties & Reservations Food & Drinks Full Menu Drink Menu Video Menu Gallery History Connect Shop Scroll Photo & Video Gallery Conch Farm Social Video | Dinner from Conch Republic Seafood Company on Vimeo . Gallery Banner Videos Photos Key West’s Best Happy Hour! 2 for 1 All Beer - Domestic, Import & Craft 2 for 1 Premium Well Drinks 2 for 1 House Wine Every Day from 4-7pm Bar & Patio Only Hours of Operation Open Daily at 11:30am Closing times vary, so please call! Location Conch Republic Seafood Company 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com Conch Republic Seafood Company 631 Greene Street, Key West, FL, 33040, United States 305-294-4403 ConchFarm@outlook.com Hours Mon 11:30am - 9:30pm Tue 11:30am - 9:30pm Wed 11:30am - 9:30pm Thu 11:30am - 9:30pm Fri 11:30am - 9:30pm Sat 11:30am - 9:30pm Sun 11:30am - 9:30pm Home Menu Drinks Private Parties & Reservations Contact Us Privacy Policy Resource Links © 2025 Conch Republic Seafood. All Rights Reserved. | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://conchrepublicseafood.com/private-parties-reservations",
      "text": "Private Parties and Reservations — Conch Republic Seafood Company Home Private Parties & Reservations Food & Drinks Gallery History Connect Shop Back Full Menu Drink Menu Video Menu Home Private Parties & Reservations Food & Drinks Full Menu Drink Menu Video Menu Gallery History Connect Shop Scroll Private Parties & Reservations PLEASE NOTE: WE DO NOT ACCEPT GENERAL RESERVATIONS OR CALL AHEAD SEATING SO PLEASE COME SEE THE HOSTESS WHEN YOU’RE READY TO BE SEATED. YOU MUST HAVE YOUR ENTIRE PARTY TO BE SEATED. HOST YOUR NEXT EVENT WITH US IN OUR PRIVATE BRICK COURTYARD OVERLOOKING THE YACHTS IN THE HISTORIC KEY WEST SEAPORT! TO CHECK AVAILABILITY FOR YOUR GROUP OF 20 OR MORE PLEASE FILL OUT THE FORM BELOW. Thank you for considering The Conch Republic Seafood Company® for your special event! Whether you are looking to hold an exciting rehearsal dinner on our casual outdoor patio, a lavish wedding with all the trimmings, or a fun corporate party, we have everything you are looking for. Our beautiful, open-air restaurant offers spectacular waterfront dining. Overlooking the Historic Seaport and the Key West Marina, the view and the atmosphere combine to bring you the finest restaurant in the Bight. The outside Brick Courtyard or Terrace Patio can seat groups from 30-200 people. If you prefer something a little more exclusive, our restaurant is available for completely private affairs with an all-inclusive menu and open bar package for up to 400 people. Our top team of chefs have put together several suggested menus and will prepare and offer an eclectic mix of Caribbean influenced menu items. Ranging from a spectacular raw bar with oysters, clams, mussels, stone crab, and Key West pink and Royal Red shrimp to locally caught fresh Mahi Mahi, Grouper and Tuna. For the meat lover we have Reserved Dry Aged Black Angus steaks, succulent pork medallions and mouthwatering chicken. We also offer new and exciting pasta dishes and our specials even include fresh lobster and surf and turf options. There is always something to please everyone. Boasting the largest bar between Miami and Cuba and hosting over 80 different brands of rum our bar includes all premium well and call drinks, wines and beers from around the world, frozen tropical drinks, house specialty drinks, ice cream drinks, and cordials. Four spectacular 160-gallon saltwater tanks with marine life indigenous to the Florida Keys divide the Bar and Restaurant areas. If there is something else you may want, let me know so that we can accommodate your needs. Please feel free to call (305) 294-4403 x 121 with any questions that you may have or email ConchFarm@outlook.com . We look forward to planning your next upcoming special event. Check out all event photos in our Facebook Album . Contact 305-294-4403 x 121 ConchFarm@outlook.com Private Party Information Form Please fill out form below and we will be in touch within 24 hours. Name * First Name Last Name Email * Phone * What Are We Celebrating? * Company / Couple's Names / Birthday Person Event Date * Alternate Event Date Budget (Overall or Per Person) * Estimated Number of Guests * Start Time * End Time * Any Additional Information? 5 + 6 = * Thank you! (Photos above provided by Lavryk Photography) Parties Banner Parties Info Parties Gallery Key West’s Best Happy Hour! 2 for 1 All Beer - Domestic, Import & Craft 2 for 1 Premium Well Drinks 2 for 1 House Wine Every Day from 4-7pm Bar & Patio Only Hours of Operation Open Daily at 11:30am Closing times vary, so please call! Location Conch Republic Seafood Company 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com Conch Republic Seafood Company 631 Greene Street, Key West, FL, 33040, United States 305-294-4403 ConchFarm@outlook.com Hours Mon 11:30am - 9:30pm Tue 11:30am - 9:30pm Wed 11:30am - 9:30pm Thu 11:30am - 9:30pm Fri 11:30am - 9:30pm Sat 11:30am - 9:30pm Sun 11:30am - 9:30pm Home Menu Drinks Private Parties & Reservations Contact Us Privacy Policy Resource Links © 2025 Conch Republic Seafood. All Rights Reserved. | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://conchrepublicseafood.com/full-menu",
      "text": "Full Menu — Conch Republic Seafood Company Home Private Parties & Reservations Food & Drinks Gallery History Connect Shop Back Full Menu Drink Menu Video Menu Home Private Parties & Reservations Food & Drinks Full Menu Drink Menu Video Menu Gallery History Connect Shop Full Menu FRESH RAW BAR HAVE YOU HEARD ABOUT KEY WESTʼS BEST KEPT SECRET?  THEYʼLL MELT IN YOUR MOUTH! Raw or Steamed Oysters* Steamed in our signature clam broth 1/2 dozen • dozen Raw or Steamed Clams* Steamed in our signature clam broth 1/2 dozen • dozen Key West Pink Peel & Eat Shrimp 1/2 pound • 1 pound SPECIALTY STARTERS Smoked Fish Dip Fresh seasonal smoked fish blended with our perfect combination of fresh herbs & spices. Served with assorted crackers. Kick it up a notch with jalapeños! Cracked Conch Transport your taste buds with this Caribbean delicacy of tenderized Queen Conch flash fried with our signature orange horseradish marmalade Coconut Shrimp Hand dipped shrimp tossed in flaky coconut and fried until perfectly crisp with our Caribbean Chili Aioli Fried Calamari A generous portion of tender calamari rings dusted with seasoned flour. Served with homemade white bbq sauce thatʼll keep you begging for more! Stuffed Mushrooms Martinique Fresh mushroom caps loaded with our signature crab stuffing and herbed Boursin cheese atop saffron cream sauce Key West Crab Cakes Delicious homemade crab cakes are drizzled with our roasted garlic aioli and a side of roasted bell pepper and herb garnish Chicken Tenders 3 large crispy boneless chicken breast tenders with your favorite sauce - honey mustard, buffalo, jerk, bbq, or JuJu slather Conch Fritters Enjoy the island breeze with our Bahamian style recipe featuring Queen Conch and homemade Key Lime mustard Callaloo Dip Hot cream cheese dip blended with fresh artichoke hearts and savory island callaloo greens with assorted crackers, celery and carrots Baked Oysters Callaloo gf Braised callaloo and parmesan cheese atop freshly shucked oysters baked and drizzled with roasted garlic aioli SOUPS & SALADS Make your salad even better! Chicken • Tuna* • Fresh Fish • Shrimp Your choice: blackened, jerk or seared Conch Chowder Winner of the Masterchef Classic! Peopleʼs Choice Award | A bowl of hearty Bahamian tomato based chowder loaded with freshly ground conch, herbs, spices and potatoes Lobster Bisque A bowl of smooth and creamy Caribbean Spiny Lobster bisque House Salad A bed of mixed greens topped with tomato, cucumber, red onion, shredded Monterey Jack and garlic croutons with balsamic vinaigrette on the side Caesar Salad Crispy hearts of romaine tossed in creamy dressing with shredded parmesan and garlic croutons Spinach Salad gf A bed of baby spinach tossed in homemade passion fruit vinaigrette with chopped bacon, tomato, cucumber, red onion, mango, strawberries and crumbled goat cheese Island Salad gf Mixed crispy greens with mango, tomato, cucumber, plantain chips and homemade citrus vinaigrette on the side SANDWICHES Make your sandwich even better by adding Swiss, American, Cheddar, Provolone, Grilled Onions, Mushrooms or Bacon Local Fresh Catch of the Day In season and expertly prepared your way – pan seared, blackened or fried with lettuce, sliced tomato, red onion and a side of crispy fries Conch Republic Burger* 10 ounces of our signature blend of chuck, short rib & brisket grilled to order with lettuce, sliced tomato, red onion, crunchy pickle and crispy fries on the side Conch Republic Smokehouse Burger* 10 ounces of our signature blend of chuck, short rib and brisket grilled to order with Applewood smoked bacon, bbq sauce, cheddar cheese, lettuce, sliced tomato, red onion, crunchy pickle and crispy fries on the side Island Chicken Sandwich Grilled chicken breast covered with Provolone, Applewood Smoked Bacon, Caribbean BBQ Glaze, lettuce, tomato, red onion, pickle and fries on the side CLASSICS FROM THE GRILL Steaks are 100% Black Angus Beef Add Blue Cheese Crumbles or House Demi Glace New York Strip* gf Topped with seasoned butter and served with smashed potatoes and chefʼs fresh vegetables Center Cut Filet Mignon* gf Center filet topped with seasoned butter and served with smashed potatoes and chefʼs fresh vegetables Mojo Pork Chops* gf Two 7 oz. pork chops marinated in our special mix of mojo Cuban seasonings with adobo demi glace and pineapple salsa. Served with smashed potatoes and chefʼs vegetables Ribs! Ribs! Ribs! St. Louis style pork ribs smothered in our homemade Jack Danielʼs BBQ Sauce with crispy fries & coleslaw Half rack • Full rack ENTREES Did you know we process all of our locally caught fresh fish by hand every day? For Fresher Seafood Youʼll Have to Catch It Yourself! Make your dish even better! Scallops* • Shrimp • Lobster Tail • Blue Cheese Crumbles Local Fresh Catch gf Delivered daily and available pan seared or blackened with our signature JuJu slather. Served with island rice and chefʼs fresh vegetables Local Snapper Fillet gf Locally caught blackened snapper with homemade garlic chimichurri and marinated cherry tomatoes. Served with smashed potatoes and chefʼs fresh vegetables Caribbean Spiced Mahi Mahi gf A fish so nice they named it twice! Our locally caught Mahi Mahi is Caribbean spice rubbed with plantain chutney, island rice and chefʼs fresh vegetables on the side Coriander Crusted Tuna* Seared to order with soy, honey and ginger glaze then topped with island slaw. Served with steamed baby bok choy and delicious smashed sweet potatoes Blackened Shrimp gf Local shrimp blackened with Key Lime Garlic Cream Sauce. Served with island rice and chefʼs fresh vegetables Lobster Tail gf Wild caught Caribbean Spiny Lobster steamed to perfection with island rice & chefʼs fresh vegetables. Need we say more? Fried Shrimp Platter Fresh shrimp fried to crispy perfection in our signature tempura batter with your choice of original, buffalo, jerk, bbq, or our famous JuJu slather with crispy fries and coleslaw St. Kitts Pasta Lightly blackened shrimp over crab-stuffed ravioli with spinach, sun-dried tomatoes, parmesan and finished with our zesty lemon and garlic cream sauce Blackened Scallops* Wake up your taste buds with blackened scallops atop our leek and saffron cream with risotto style Israeli couscous & steamed baby bok choy Bacon-Wrapped Stuffed Shrimp Winner of the Masterchef Classic! Peopleʼs Choice & Judgeʼs Choice Awards Jumbo shrimp stuffed with our signature lump crab mixture wrapped in Applewood Smoked Bacon and finished with Korean bbq glaze and pineapple salsa. Served with island rice and chefʼs fresh vegetables Island Spiced Chicken gf Slow roasted bone-in chicken breast drizzled with our homemade Jamaican jerk cream with island rice and chefʼs fresh vegetables Vegetarian Pasta Cheese stuffed tortelloni tossed with Portobello mushrooms, sun-dried tomatoes, spinach and Key Lime alfredo sauce DESSERTS Key Lime Pie Our homemade Key Lime Pie has the incredible taste of freshly squeezed Key Limes complete with graham cracker and cashew nut crust drizzled with Key Lime sauce, raspberry sauce and topped with whipped cream Hot Pineapple Upside-Down Rum Cake Golden pound cake baked with juicy pineapple and drizzled with creamy caramel sauce Strawberry Tempura Winner Peopleʼs Choice Award, Best Dessert! Fresh strawberries hand dipped in our signature tempura batter, flash fried, then dusted in cinnamon sugar and topped with whipped cream and gooey chocolate drizzle Seven Layer Chocolate Cake Calling all chocolate lovers! Youʼve met your match. 7 layers of delicious chocolate cake with fudge-like consistency and gooey chocolate frosting Ice Cream gf = Gluten Free Option *There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters and should eat oysters fully cooked.  IF UNSURE OF YOUR RISK, CONSULT A PHYSICIAN Key West’s Best Happy Hour! 2 for 1 All Beer - Domestic, Import & Craft 2 for 1 Premium Well Drinks 2 for 1 House Wine Every Day from 4-7pm Bar & Patio Only Hours of Operation Open Daily at 11:30am Closing times vary, so please call! Location Conch Republic Seafood Company 631 Greene Street Key West, FL 33040 305-294-4403 ConchFarm@outlook.com Conch Republic Seafood Company 631 Greene Street, Key West, FL, 33040, United States 305-294-4403 ConchFarm@outlook.com Hours Mon 11:30am - 9:30pm Tue 11:30am - 9:30pm Wed 11:30am - 9:30pm Thu 11:30am - 9:30pm Fri 11:30am - 9:30pm Sat 11:30am - 9:30pm Sun 11:30am - 9:30pm Home Menu Drinks Private Parties & Reservations Contact Us Privacy Policy Resource Links © 2025 Conch Republic Seafood. All Rights Reserved. | Design & Development by Wonderdog Studios"
    }
  ]
}