{
  "fuentes": [
    {
      "url": "https://www.goal.com/en-us/lists/usmnt-copa-america-american-soccer/blt883ec93a522c8851",
      "email": "apps@goal.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/copa-airlines/",
      "email": "close@2x.png"
    },
    {
      "url": "https://www.elliott.org/company-contacts/copa-airlines/",
      "email": "dgunn@copaair.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/copa-airlines/",
      "email": "dmizrachi@copaair.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/copa-airlines/",
      "email": "pheilbron@copaair.com"
    },
    {
      "url": "https://blackrestaurantweeks.com/?post_type=gd_brw_campaigns&p=30932",
      "email": "info@blackrestaurantweeks.com"
    },
    {
      "url": "https://blackrestaurantweeks.com/?post_type=gd_brw_campaigns&p=30932",
      "email": "partners@blackrestaurantweeks.com"
    },
    {
      "url": "https://copa-airlines.pissedconsumer.com/customer-service.html",
      "email": "privacy@copaair.com"
    },
    {
      "url": "https://copastc.com/",
      "email": "info@copastc.com"
    },
    {
      "url": "https://copastc.com/",
      "email": "sales.wc@copastc.com"
    }
  ],
  "mails": [
    "apps@goal.com",
    "close@2x.png",
    "dgunn@copaair.com",
    "dmizrachi@copaair.com",
    "info@blackrestaurantweeks.com",
    "info@copastc.com",
    "partners@blackrestaurantweeks.com",
    "pheilbron@copaair.com",
    "privacy@copaair.com",
    "sales.wc@copastc.com"
  ],
  "nombre_sitio": "copadtsp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.goal.com/en-us/lists/usmnt-copa-america-american-soccer/blt883ec93a522c8851",
      "text": "A New Era: Copa America kick-starts a revolution for U.S. soccer, a seismic shift that will change the game forever | Goal.com US SCORES LATEST News and Features News Transfers Opinion Analysis Power Rankings Player Ratings Winners & Losers GOAL USA Social The Rondo / YouTube Instagram TikTok X Facebook GOAL Global Social YouTube Instagram TikTok X Facebook Culture and Lifestyle GOAL Champions GOAL Editions Culture Kits Boots Buyers' Guides Gaming Quizzes COMPETITIONS Leagues & Cups MLS Premier League La Liga Serie A Bundesliga Ligue 1 Liga MX UEFA Champions League Championship USL Championship 2026 FIFA World Cup 2025 FIFA Club World Cup 2025 Gold Cup 2025 Leagues Cup Clubs Inter Miami Real Madrid Barcelona Manchester City Manchester United Liverpool Arsenal Chelsea AC Milan Juventus PSG Wrexham International USMNT Canada Mexico Argentina Brazil Colombia Chile England Spain France Italy Germany Women's Soccer Latest news USWNT NWSL USL Super League UWCL WSL Women's EURO 2025 Players Lionel Messi Cristiano Ronaldo Kylian Mbappe Jude Bellingham Lamine Yamal Christian Pulisic Weston McKennie Tyler Adams Giovanni Reyna Antonee Robinson Cavan Sullivan Trinity Rodman Sophia Wilson Mallory Swanson INDIVISA PLAY GOAL8 BETTING Betting Betting How We Produce Content Betting Odds Explained Betting on Soccer Sports Betting Glossary Readers Guide to Sportsbooks Best Sportsbook Promos bet365 Promo Code BetMGM Promo Code Fanatics Bonus Code Caesars Promo code DraftKings Promo Code Borgata Promo Code Sports Betting MLS Predictions Premier League Winner Odds Premier League Relegation Odds La Liga Winner Odds Transfer Odds World Cup Winner Odds Super Bowl Odds Sportsbook Sites & Apps Best Betting Sites Best Betting Apps NFL Betting Sites & Apps Soccer Betting Sites & Apps MUNDIAL STREAMING Schedule, Channels & more TV Schedule Where to Watch Streaming services DAZN Sling TV Fubo TV Apple TV+ Paramount+ DirecTV ESPN+ Hulu+ Peacock TV Best VPN Services Best Streaming Services GOALSTUDIO Getty/GOAL Ryan Tolmich A New Era: Copa America kick-starts a revolution for U.S. soccer, a seismic shift that will change the game forever The global game is about to burst onto the American stage, ushering in a New Era for U.S. soccer This summer is the start of something transformational. A tidal wave is coming, and not just one. For years, fans of American soccer have been waiting for the sport to truly arrive. Over the next few years, we'll all find out whether it ever truly can, and will. With the start of Copa America, U.S. soccer enters a New Era, and it's the most significant one yet. This dramatic multi-year stretch centers around the 2026 FIFA World Cup, which represents a seismic turning point. For a sport that is fighting to turn the \"Big Four\" in the American sporting landscape into the \"Big Five,\" World Cups can manifest the memorable moments that energize a generation. \"A World Cup on home soil is the biggest thing that we'll probably do in our career,\" U.S. men's national team star Christian Pulisic said. \"It's a special time for this sport in America.\" But, while the 2026 World Cup may be the pinnacle, it's not the only high-point. Starting this summer, there are multiple global events coming stateside, each building momentum that should propel the game forward for American audiences and the broader U.S. soccer culture. At the forefront of that growth? The U.S. men's and women's national teams, and starting this week on home soil, the USMNT specifically. Copa America and the World Cup will get fans in the door and get eyes on the product, but those eyes will need to be impressed by what they see. Beyond those two events, the US will also host major global tournaments such as the FIFA Club World Cup in 2025, and the Los Angeles Summer Olympics in 2028. Over the next few years, the U.S. isn't just under pressure to perform, but to lead -- certainly in a hosting capacity, but especially on the field. And if it's going to happen for the USMNT, it has to come from this generation of American stars. “It is a bigger role for all of us,” USMNT boss Gregg Berhalter told reporters. “We all share that responsibility. First off, representing the United States to the best of our ability, but then also letting people see who we are and letting people see who the players are, giving people access and really giving them something they can be proud of.” Ahead of the Copa America, GOAL breaks down the upcoming challenge for the USMNT and what it all means for American soccer."
    },
    {
      "url": "https://www.elliott.org/company-contacts/copa-airlines/",
      "text": "Copa Airlines Customer Service Contact Support Via Phone Email Exec Contacts - Elliott Report Skip to content Elliott Report Menu Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Elliott Report Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Copa Airlines Customer Service Contacts Copa Airlines, Panama’s flag carrier, is headquartered in Panama City and operates flights to North, Central, and South America, as well as the Caribbean. How to reach a person at Copa Airlines Main: +507-304-2672 Toll Free: (800) 359-2672 copaair.com Copa Airlines Responsiveness rating 3/5 The Elliott Responsiveness Rating scores companies based on how responsive they are to customers. Here's more information about our ratings. Want to know which companies have the best -- and worst -- customer service? Check out our Red List and Green List. In order to assist you, please address your inquiry, requests or complaints through our Online Contact Us forms What you need to know about Copa Airlines The company responds to most customer complaints in a satisfactory manner. How to resolve a problem with Copa Airlines This guide on how to solve a customer service problem will help you resolve most problems with the company. You can also refer to the executive contacts below or contact our advocacy team directly . Note: If you’re having customer service trouble, please use our proven methods for fixing any consumer problem before contacting a manager. We care about accuracy. If any of the following email addresses bounce back or the phone numbers are incorrect, please report it to us immediately through this form. Copa Airlines mailing address Avenida Principal y Avenida de la Rotonda, Costa del Este Complejo Business Park, Torre Norte Parque Lefevre, Panama City, Panama https://www.copaair.com/en/ Copa Airlines social media channels Facebook X Please check out our expert strategies for resolving a customer complaint before reaching out to an executive at Copa Airlines. Copa Airlines executive customer service contacts Primary Contact Diana Mizrachi-Kopel Senior Director of Customer Experience Avenida Principal y Avenida de la Rotonda, Costa del Este Complejo Business Park, Torre Norte Parque Lefevre, Panama City, Panama dmizrachi@copaair.com LinkedIn Secondary Contact Daniel Gunn Senior Vice-President of Operations Avenida Principal y Avenida de la Rotonda, Costa del Este Complejo Business Park, Torre Norte Parque Lefevre, Panama City, Panama dgunn@copaair.com Chief Executive Pedro Heilbron Chief Executive Officer Avenida Principal y Avenida de la Rotonda, Costa del Este Complejo Business Park, Torre Norte Parque Lefevre, Panama City, Panama pheilbron@copaair.com +507-304-2677 LinkedIn Frequently asked questions about Copa Airlines How to speak directly at Copa Airlines? To speak directly with a Copa Airlines representative, call (786) 840-2672 . Can you cancel a Copa Airlines reservation within 24 hours? Yes, Copa Airlines allows customers to cancel its flights within 24 hours without paying any charges, as long as they do so more than 7 days before departure. Where is Copa Airlines located? Copa Airlines is based in Panama City, with its main hub at Tocumen International Airport. What airline owns Copa? Copa Holdings, S.A., based in Panama City, owns both Copa Airlines and Wingo. Can I cancel an international ticket within 24 hours? Yes, for international tickets, Copa Airlines allows free cancellations within 24 hours of booking if the departure is at least 7 days away. Cancellation fees may apply after 24 hours. Is Copa Airlines still in business? Yes, Copa Airlines is still operating flights to various destinations in the Americas and the Caribbean. Can I cancel my Copa flight? Yes, you can cancel your Copa flight. Refer to Copa’s official website or contact customer service at (786) 840-2672 for specific details on cancellation policies and any associated fees. Can you pick your seats on Copa Airlines? Yes, passengers can select their seats on Copa Airlines during the booking process or later through the Manage My Booking feature on the website . Is Copa owned by United? No, Copa Airlines is not owned by United Airlines. However, Copa has a partnership with United Airlines through the Star Alliance network. How to get professional help with your Copa Airlines problem If you need help with Copa Airlines, you can contact our advocacy team or just click the \"Get Help\" button. For immediate assistance, you can also send us a message on our Facebook group . Note : We do not charge for our advocacy. Get Help DISCLAIMER: The names, numbers and email addresses on this page are provided for informational purposes and are believed to be reliable. However, they should in no way be construed as a guarantee of their accuracy by Elliott.org. Company executives change their email addresses and phone numbers frequently to avoid contact with customers. If an email address bounces or a phone number is wrong, please report it to us immediately through this form. 128543 This contact was published on November 18, 2015 and updated on August 6, 2025. What's Your Problem? The Elliott Report is supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. If you need help with any problem, please contact us through this form . We’re always here to help. Get Help Company Contacts We publish the names and emails of customer service managers. Check out our directory. Uber Lyft Paypal Amazon Airbnb See all contacts Subscribe to our free newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. You’ll also connect with other readers who want to make the world a better place. Name (Required) Email (Required) CAPTCHA Δ Most Popular Downgraded on my flight from Sydney to Tokyo. Why won’t Booking.com refund my money? This is the most dangerous room in a hotel Help! Someone stole 200,000 Chase points, and I can’t get them back Passengers are missing their summer flights. Here’s how to avoid being left behind Ultimate Guides The ultimate guide to finding your lost luggage Here’s your insider guide to spring break travel in 2025 Here’s your ultimate guide to holiday travel Eat this! The ultimate guide to travel food Advocacy They found toxic mold in their Vrbo rental — can they get $19,500 back? I paid for unlimited airport parking. Then the company changed its rules. StubHub charged me $747 in fees after Adele postponed her concert. But it promised not to! Tricked into a Palladium membership: My honeymoon nightmare More from Elliott Confidential CONSUMER ALERT: U.S. drops proposed airline compensation rule September 8, 2025 by Christopher Elliott The government would have required airlines to compensate you for flight delays. Here's what it means for your next trip. Are you becoming the passenger everyone hates? September 7, 2025 by Christopher Elliott By removing seatback screens, airlines unleashed a cacophony of leaky headphones and bright laptops. Here's how not to be part of the problem. Loire Valley Confidential: Our visit to a French Château September 6, 2025 by Christopher Elliott In this podcast: Our adventures at Château de Candes, a private chef experience in Paris, and yes, we've turned into a food podcast (recorded 9/5/25 in Paris) Airlines want to end consumer protections. Do they have a point? September 5, 2025 by Christopher Elliott U.S. carriers are trying to roll back decades of regulations that cover everything from refunds to fare transparency. Should the government allow it? AI Anxiety: Is the algorithm out to get you? August 31, 2025 by Christopher Elliott How travel companies use AI as a digital pickpocket — and how you can fight back What’s Your Problem? If you have a consumer problem, please contact our team at Elliott Advocacy through this form . We’re always here to help. Our help is free. Get Help Our Newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. Did we mention it's free? Sign Up What's This Site? The Elliott Report is a consumer news site supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. Join Us Follow Us © 2025 Elliott Report | Privacy Policy Home Features Advocacy Problem Solved On Travel The Travel Troubleshooter Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Close Search for: Don't Miss a Story! Our award-winning daily newsletters keep you posted on our random acts of consumer advocacy. Plus, we have insightful letters, insider tips, and more. Invalid email address Thanks for subscribing!"
    },
    {
      "url": "https://blackrestaurantweeks.com/?post_type=gd_brw_campaigns&p=30932",
      "text": "Copa features Bar & Lounge cuisine in St. Petersburg, Florida Skip to content info@blackrestaurantweeks.com Search About About Black Restaurant Week Feed the Soul Foundation Restaurant Weeks Atlanta Black Restaurant Week Greater Washington DC Black Restaurant Week Cleveland Black Restaurant Week Carolinas Black Restaurant Week Houston Black Restaurant Week Southwest Black Restaurant Week Pacific Northwest Black Restaurant Week Registration Directory Calendar News & TV Whats Cookin (Culinary News) Recipes Black Diamond Class Content Submission Cart Contact About About Black Restaurant Week Feed the Soul Foundation Restaurant Weeks Atlanta Black Restaurant Week Greater Washington DC Black Restaurant Week Cleveland Black Restaurant Week Carolinas Black Restaurant Week Houston Black Restaurant Week Southwest Black Restaurant Week Pacific Northwest Black Restaurant Week Registration Directory Calendar News & TV Whats Cookin (Culinary News) Recipes Black Diamond Class Content Submission Cart Contact Register Copa 1047 Central Ave , St. Petersburg , Florida Cuisine Type: Bar & Lounge | Dining Style: About Copa is a Wine & Tapas Bar located in the Downtown District of St. Petersburg, FL. We offer a wide selection of wines, beers, and signature wine based cocktails and pair them with a fusion of international dishes including fresh seafood, poultry, meat and vegetarian options. Hookah is also available in our outside seating area. Menu Offerings Dinner Happy Hour Vegan & Vegetarian Options Menu Specials Weekly Special Menu [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] STEAK & MADUROS - $24 6 ounces of Mojo marinated skirt steak grilled medium rare and served with sweet plantains and mango salsa [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] SEARED SCALLOPS - $22 Fresh pan-seared scallops served over a rich plantain bacon purée and sweet onion medley drizzled with a spiced chili oil [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] COPA TOSTONES - $15 Three crispy fried green plantains topped with our signature, Mojo Pulled Pork and a Spicy Haitian Pikliz. Substitute pork for Grilled Shrimp, Ahi Tuna, Beef Barbacoa or Jerk Tofu [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] JERK TOFU SPRING ROLLS - $10 A taste of Vegan Caribbean Cuisine. Jerk Tofu, cabbage, carrots, and onions rolled and served with a West Indian chili glaze [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] CROQUETTAS DE YUCA - $11 “Yuca, aka Casava, the potato of the Tropics” Mashed with peppers, jalapenos, and onions; paired with a cilantro lime sauce & lemon zest [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] KREYOL BOWL - $17+ Cuban ‘congris’ rice & black beans, sautéed red peppers, onions, avocado, & two golden tostones. Add a choice of protein [vc_separator type='full_width' position='center' color='' thickness='' up='15px' down=''] Beverages & Drinks Signature Craft Cocktails, Classic Cocktails, Champagne Cocktails, Wines, Beer and Mocktails Restaurant Features Beer and Wine , Patio/Outdoor Dining , Reservations , Street Parking , and Vegetarian Options Photo Gallery Contact Information 7276239199 Website Facebook Instagram Business Hours : 5:00 PM - 11:00 PM Mon Closed Tue Closed Wed 5:00 PM - 11:00 PM Thu 5:00 PM - 11:00 PM Fri 5:00 PM - 12:00 AM Sat 5:00 PM - 12:00 AM Sun 12:00 PM - 10:00 PM Payment Options Delivery Services No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Google Map Not Loaded Sorry, unable to load Google Maps API. Driving Walking Bicycling Public Transport Miles Kilometers 1 Reviews on “Copa” David Hines 5 years ago Relaxed and sophisticated at the same time.  Service is always on point, Owners are always present and engaging.  Food is imaginative and delicious.  Great selection of wine, and crafted drinks.  You won’t be disappointed! Reply ↓ Leave a Review Cancel reply Your email address will not be published. Required fields are marked * Review text Select a rating Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Verification * Celebrating the flavors of African American, African, and Caribbean cuisine. Discover Black-owned restaurants and culinary businesses in your community. Eat. Sip. Repeat. during a Black Restaurant Week campaign near you. FOLLOW US Facebook Instagram Youtube PARTNER WITH US Contact us at partners@blackrestaurantweeks.com for more information regarding partnerships. Join OUR NEWSLETTER Get updates on special events and receive your first drink on us! Email SUBSCRIBE We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Change Location Find awesome listings near you! Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://copa-airlines.pissedconsumer.com/customer-service.html",
      "text": "Copa Airlines Customer Service Phone Number (800) 359-2672, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google KukuFM YouTube TV Blinkit Write review For Business Login Airlines and Air Transport Copa Airlines 380 Customer Service Updated on 08/20/2025 Contact Copa Airlines Customer Service Reviews 0 Contacts Community Advertisements Copa Airlines Phone Numbers and Emails Toll-Free Number: (800) 359-2672 Aruba Call customer service Sales/ Reservations: (800) 389-0772 Bahamas (855) 654-0566 Guyana (800) 234-2672 Jamaica (305) 371-2672 Miami, United States (877) 389-3606 St. Maarten +54 800 800 2672 Argentina +55 800 886 2672 Brazil +1 647 493 5022 Canada +5 622 840 2641 Chile +571 800 011 2600 Colombia +5 064 000 0478 Costa Rica +537 204 1111 Cuba +507 800 2672 David, Chiriqui; Panama +5 932 342 2672 Ecuador +5 032 113 0369 El Salvador +5 022 307 6400 Guatemala +1 868 669 5189 Haiti +52 800 265 2672 Mexico +52 555 241 2000 Mexico City +5 052 267 0045 Nicaragua +507 217 2672 Panama +98 542 0074 Paraguay +511 700 9098 Peru +1 787 296 9824 Puerto Rico +1 809 200 2772 Punta Cana, Santiago de los Caballeros, Dominica Republic +1 809 472 2672 Santo Domingo, Dominica Republic +55 114 933 2399 Sao Paulo, Brazil +58 212 720 1450 Venezuela Copa Airlines Emails: Legal Privacy Inquiries, Privacy Inquiries Send Message Is this your business? phone numbers and emails Advertisements Copa Airlines Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Copa Airlines Customer Service is rated at 1.6 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 94% phone 6% email The best phone number to call Copa Airlines is 8003592672 . 66% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 71% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Wednesday , while the shortest are on Saturday . The average call time is 9 minutes . Be prepared for the call as Copa Airlines may ask you for the following information to identify you as a customer: first and last name, order id or tracking no or email . View full overview › Copa Airlines Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Copa Airlines Customer Service is rated at 1.6 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 94% phone 6% email The best phone number to call Copa Airlines is 8003592672 . 66% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 71% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Wednesday , while the shortest are on Saturday . The average call time is 9 minutes . Be prepared for the call as Copa Airlines may ask you for the following information to identify you as a customer: first and last name, order id or tracking no or email . People call Copa Airlines mainly because of request for information, return/ replace and product/ service . 15% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel very satisfied after talking to customer service representatives. The best email to contact Copa Airlines is privacy@copaair.com . 90% of customers use this email address to address their issues and concerns. Customers evaluated the effort they needed to make to contact customer service as easy . Close Contact Information Copa Airlines Website: www.copaair.com Copa Airlines Help Center: Visit contact page Corporate Office Address: Copa Airlines, Inc. Business Park, North Tower, Costa del Este Panama, Panama Panama Help in Social Networks: Facebook Pinterest Instagram Twitter Linkedin Youtube Other Info (opening hours): Other Location: Berna número 6, Planta Baja, Colonia Juárez 06600 México Mailing Address: Copa Airlines Box 0816-06819, Panama, Republic of Panama More contact details Copa Airlines Rating Based on 164 Reviews Rating details 2.0 more details Customer service Price Affordability Product or Service Quality Number of Destinations Rating Details Customer service Price Affordability Product or Service Quality Number of Destinations Level of Comfort Exchange, Refund and Cancellation Policy Additional Fees Discounts and Special Offers Website Value for money Billing Practices Quality of Food Close All 380 Copa Airlines reviews Rating stats Rating trend How Good is Copa Airlines's Customer Service? Christohper Obj Christohper Obj Feels Disappointed | Jan 21, 2024 Copa cancelled our return flight for 2-3 days later. We had to rebook a return flight with another airline for $1310. We had to be home for a medical procedure. We are entitled legally to $600. Each and reembursement of the $1310. Read full quote Mersedeh M Mersedeh M Feels Disappointed | Jan 19, 2024 I called every phone number I found online and I wasn’t able to talk to anybody Read full quote anthony s Ayp Feels Disappointed | Jan 12, 2024 Bad . No refuards to customers urgency! And follow up Read full quote Ger Bdj Ger Bdj Feels Disappointed | Oct 18, 2023 They didn't solve anything for me and the representative's attitude was horrible. Read full quote Olga R Ivw Olga R Ivw Feels Disappointed | Oct 06, 2023 Mi sobrina tuvo que esperar casi 3 hrs en el avión Para despejar el vuelo salía de la ciudad de México a panama 09/05/23 en el aeropuerto AIFA Mala administración cómo esperar tanto tiempo en el avión.. Read full quote Pilar O Dny Pilar O Dny Feels Disappointed | Oct 03, 2023 La Maneger name Mari del Día Sábado en la mañana se portó muy grocers y me exigió mi maleta de mano que se la entregara. Luego me cobro $185 . Cada puesta de equipaje que lleve me los cobro. No solo eso si no que me trato como una persona undesirable yluego se puso a reír con el resto de su tripulación mejor dicho empleados. Yo tome fotos de maletas de mano y objetos personales que otras gente llevaban; yo viajo constantemente porque tengo a mi familia en Ecuador. Yo me siento anudada y maltrata con esta clase de personas. No me dejo ni siquiera ver mi maletas si no que me las quito. Tengo pruebas Read full quote Summary of Copa Airlines Customer Service Calls 4.9K TOTAL CALLS 07:49 AVG CALL DURATION 15% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Copa Airlines? Request for Information Question: 21d ago “Ask about my trip” 1M ago “Information about wheather concers” 2M ago “Checking flight change” Return/ Replace Question: 5M ago “Change ticket date” 6M ago “Change tickets” 6M ago “Change ticket routes” Product/ Service Question: 3M ago “Book ticket” 4M ago “To buy a tiquets from Orlando to medejllin” 5M ago “Problem with a ticket that I bought yesterday” Activation/ Cancellation Question: 1Y ago “Cancel a flight” 1Y ago “Cancelación vuelo” 1Y ago “Flight cancellations” Refund Question: 1Y ago “Refund” 1Y ago Refund info on my ticket 2Y ago “Refund a purchase since dec 18” Payments and Charges Question: 8d ago “Pensionado discount” 4M ago “Missing Flight credit” 11M ago “Compre un billete vuelo por línea nesecito estar segura si tengo ese vuelo para mañana” Shipping and Delivery Question: 1Y ago “Paid for upgrade did not receive” 1Y ago “Quiero saber cuanta maleta puedo llevar” 1Y ago “Maleta no recivida” Account Question: 8M ago “Miles rewards” 1Y ago “Forgot an cell phone in the aircraft” 1Y ago “Verify baggage limit not seeing it on ticket” Staff Question: 1Y ago “Flight info and service needs” 1Y ago “Customer service” 1Y ago “Complain about service” Cards Question: 1Y ago “Credit card fraud” 2Y ago “Pay with 2 credit cards” 3Y ago “Review credit card (Flight today!!!) Please, call me in spanish.” Website/ Application Question: 2Y ago “Website” 2Y ago “Mt ticket is not appearing in the app anymore” 4Y ago “I need to logon to Copa website” Employment Question: 2Y ago “Employment” 3Y ago “Trying to send an email to get paid for final claim for lost baggage” Other Question: 1d ago “Book reservation” 28d ago “Booking is not found” 1M ago “Cambio de fecha de viaje” Compare Copa Airlines Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Avianca Customer Service 1.4 out of 5 American Airlines Customer Service 1.5 out of 5 Jetcost Customer Service 1.5 out of 5 Write a review Do you have something to say about Copa Airlines? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Copa Airlines Reviews Contacts Community Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Copa Airlines contact page? Contact Copa Airlines Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    },
    {
      "url": "https://copastc.com/",
      "text": "COPA Soccer Training Center - COPA STC Skip to content About Us Membership Membership TALENT ID TALENT ID Other Offerings Other Offerings CAMPS BOOK YOUR PARTY Log In 1-3 Years Old 4-5 Years Old 6-8 Years Old 9-11 Years Old 12-19 Years Old MEMBER SERVICES MEMBERSHIP SCHEDULING BOOK A TOUR Youth Soccer Leagues Events Adult Soccer Leagues & Tournaments Adult Open Play COPA Fit Rentals Athletic Performance Team Training Autonomous Training Mission Methodology Facility/Tech Watch Documentary MEDIA - News | Blogs | Videos Partnerships Sponsorships Team Media Kit Careers Contact COPA Score (Ages: 9 - Adult) COPA Skills Check (Ages: 6 - 8) 1-3 Years Old 4-5 Years Old 6-8 Years Old 9-11 Years Old 12-19 Years Old Member Services Membership Scheduling Book a Tour COPA Score COPA Skills Check Youth Leagues Events Adult Leagues & Tournaments Adult Open Play COPA Fit Field Rentals Athletic Performance Team Training Autonomous Training Transform Your Game Pioneering an objective data-driven player identification and development revolution Experience the Future WATCH NOW Book Your FREE COPA Score Instagram Facebook X-twitter Youtube Linkedin Tiktok Instagram Facebook X-twitter Youtube Linkedin Tiktok COPA SOCCER TRAINING CENTER Objective Data We strive to elevate the performance of every soccer player to see them reach their full potential. Accomplishing this starts with the development and systematic application of objective performance assessments in a technologically enhanced “Laboratory” training environment. Our goal is to be the global standard for both player identification and assessment-orientated player development. WHAT WE OFFER Asset 8 Objective Assessments Asset 8 Data-Driven Training Asset 8 Sports Performance Asset 8 Leagues and Tournaments Asset 8 Engaging Camps Asset 8 Parties and Events LEARN MORE Our Assessments Pioneering Player Identification We have assessed thousands of athletes, from recreational youth to elite professionals, utilizing our assessment protocols to establish critical skill benchmarks which are used to effectively identify an athlete’s development needs and objectively compare players. COPA SCORE  2.0 Ages 12+ Measuring essential passing, ball control, finishing, decision making, speed, strength, and agility skills. Learn More SKILLS CHECK Ages 6-8 A fun and engaging series of exercises to measure a young athlete’s capabilities. Learn More COPA MEMBERSHIPS Control Your Training Experience Train what you want, when you want, as much as you want. Membership includes unlimited sessions with flexible scheduling in one of the world’s most advanced training facilities. COPA STC’s certified coaches utilize a purposeful training methodology founded in the leading sports science techniques to create a truly immersive data-driven environment. 1–3 years old LEARN MORE 4-5 years old LEARN MORE 6–8 years old LEARN MORE 9–11 years old LEARN MORE 12–19 years old LEARN MORE ADULT LEARN MORE PRIVATE ACCESS TO THE CUBE AND SKILLS.LAB Autonomous Training Autonomous Training is built for the highly motivated individual who wants to train independently in the Skills Lab or Cube—without the time commitment of a full membership. No coaches, no classes—just you calling the shots in a world-class, tech-powered environment. Book sessions on your schedule, train the way you want, and take control of your development. Learn More OFFERINGS Play Your Way Youth Leagues & Tournaments Adult Leagues & Tournaments Camps Open Play Facility Rentals COPA FIT Join the exciting action! Guaranteed more touches, more shots, and more fun, all our games are played on our Turf and Futsal Arenas. Lace ‘em up for some competitive gameplay in the most advanced facility in the Bay Area! Join this safe and fun community with teammates or play as a free agent. From fun and engaging kids camps to elite clinics for top-performing athletes, we offer camps for all ages and skill levels. Enjoy an evening of quick games on your schedule without the long-term commitment of joining a league. Looking for an indoor field space to host an event? We’ve got you covered with Turf and Futsal Arena options. From free weights to strength selectors, cardio to powerlifting, we\nhave the latest equipment to help you excel no matter how you like to move. Learn More Learn More Learn More Learn More Learn More Learn More Youth Leagues & Tournaments Adult Leagues & Tournaments Camps Open Play Facility Rentals COPA FIT OFFERINGS Play Your Way Youth Leagues & Tournaments Join the exciting action! Guaranteed more touches, more shots, and more fun, all our games are played on our Turf and Futsal Arenas. Learn More Adult Leagues & Tournaments Lace ‘em up for some competitive gameplay in the most advanced facility in the Bay Area! Join this safe and fun community with teammates or play as a free agent. Learn More CAMPS From fun and engaging kids camps to elite clinics for top-performing athletes, we offer camps for all ages and skill levels. Learn More Open Play Enjoy an evening of quick games on your schedule without the long-term commitment of joining a league. Learn More Facility Rentals Looking for an indoor field space to host an event? We’ve got you covered with Turf and Futsal Arena options. Learn More COPA Fit From free weights to strength selectors, cardio to powerlifting, we have the latest equipment to help you excel no matter how you like to move. Learn More THE COPA CORNER Read our blog for the latest news and updates Introducing the COPA Score Dashboard: A New Era for Player Development and Talent ID August 19, 2025 Read More COPA Talent ID Day – COPA Score Top Performers Showed Up and Balled Out July 24, 2025 COPA Talent ID Day: A Standout Day for COPA Score Rising Stars July 24, 2025 Eternal Water Named Official Premium Water of COPA Soccer Training Center and Ultimate Fieldhouse at the Shadelands SportsMall July 6, 2025 PLEZi Hydration Named Official Sports Hydration Drink of the COPA Soccer Training Center and Ultimate Fieldhouse at the Shadelands SportsMall June 2, 2025 Visit the COPA Corner CONTACT US LET'S GET IN TOUCH INFO 2640 Shadelands Dr, Walnut Creek, CA 94598 (925) 357-8999 info@copastc.com HOURS Mon - Fri : 9:30am - 10:30pm Sat : 8:30am - 7:30pm Sun : 8:30am - 7:30pm Fill out the form below © 2025 COPA Innovation Laboratories Instagram Facebook X-twitter Youtube Linkedin Tiktok Advertising Terms of Use Privacy Policy"
    }
  ]
}