{
  "fuentes": [
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://moverandshakerco.com/pages/about",
      "email": "info@moverandshakerco.com"
    },
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/bar-review-the-copper-shaker-in-downtown-st-petersburg/2337414/",
      "email": "hfreund@tampabay.com"
    },
    {
      "url": "https://support.copperchef.com/contact-us/",
      "email": "empowercustomerservice@spectrumbrands.com"
    },
    {
      "url": "https://coppercare.com/contact-us",
      "email": "bill@coppercare.com"
    },
    {
      "url": "https://www.coppershakerstpete.com/",
      "email": "stpete@coppershaker.com"
    },
    {
      "url": "https://www.coppershakerstpete.com/lockers",
      "email": "info@coppershaker.com"
    },
    {
      "url": "https://capstonecopper.com/about-us/leadership/",
      "email": "info@capstonecopper.com"
    },
    {
      "url": "https://www.copper.com/contact",
      "email": "info@copper.com"
    },
    {
      "url": "https://www.copper.com/contact",
      "email": "partners@copper.com"
    },
    {
      "url": "https://www.copper.com/contact",
      "email": "sales@copper.com"
    },
    {
      "url": "https://www.copperrock.com/contact-us",
      "email": "bill@wdhobson.com"
    },
    {
      "url": "https://www.copperrock.com/contact-us",
      "email": "contact@copperrock.com"
    }
  ],
  "mails": [
    "bill@coppercare.com",
    "bill@wdhobson.com",
    "contact@copperrock.com",
    "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com",
    "empowercustomerservice@spectrumbrands.com",
    "f14faca962674f149161045845b21b35@sentry.zipify.com",
    "hfreund@tampabay.com",
    "info@capstonecopper.com",
    "info@copper.com",
    "info@coppershaker.com",
    "info@moverandshakerco.com",
    "partners@copper.com",
    "sales@copper.com",
    "stpete@coppershaker.com"
  ],
  "nombre_sitio": "coppershakerstpete.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://moverandshakerco.com/pages/about",
      "text": "About Us – Mover & Shaker Co New Arrivals Pins New Arrivals All Pins Agave Pins Botanic Pins Buttons Coffee & Matcha Pins Cocktail Critters Pins New Releases Classic Cocktail Pins Love & Victory Pins Pizza Pins The Vault Vintage Pins Apparel New Arrivals All Apparel Tees Hats & Beanies Socks Bandanas Button-Up Shirts Outerwear Barware New Arrivals Cocktail Kingdom New Arrivals Atomizer Barspoons Citrus Juicers Cocktail Kits Dasher Bottles & Dash Darts Jiggers Mixing Glasses Shaker Tins Spoons Stepped Jiggers Strainers Swizzles Tasting Journal Tongs Barspoons Cocktail Kits Dehydrated Garnishes Jiggers Juicers M&SCo Essentials Mixing Glasses Muddlers Peelers Pour Spouts Stepped Jiggers Strainers Swizzles Tins Tongs Accessories New Arrivals All Accessories Air Fresheners Bolo Ties Bundles Buttons Calendars Candles Classic 8 Ball Coffee Mugs Croc Charms Cufflinks Dehydrated Garnishes Dice Gift Cards Glassware Kits Keychains Magnets Mouse Pads Nalgenes Ornaments Patches Posters & Prints Puzzles Rugs Sharpie Holster Stickers Tote Bags Bitters Custom Custom Pins Custom Apparel Info About Us Wholesale FAQ Sale Mystery Items Sale Log in Search Facebook Instagram USE CODE 'FREESHIP75' FOR FREE STANDARD SHIPPING ON ANY DOMESTIC ORDER OF $75 OR MORE! Menu Cart New Arrivals Pins New Arrivals All Pins Agave Pins Botanic Pins Buttons Coffee & Matcha Pins Cocktail Critters Pins New Releases Classic Cocktail Pins Love & Victory Pins Pizza Pins The Vault Vintage Pins Apparel New Arrivals All Apparel Tees Hats & Beanies Socks Bandanas Button-Up Shirts Outerwear Barware New Arrivals Cocktail Kingdom New Arrivals Atomizer Barspoons Citrus Juicers Cocktail Kits Dasher Bottles & Dash Darts Jiggers Mixing Glasses Shaker Tins Spoons Stepped Jiggers Strainers Swizzles Tasting Journal Tongs Barspoons Cocktail Kits Dehydrated Garnishes Jiggers Juicers M&SCo Essentials Mixing Glasses Muddlers Peelers Pour Spouts Stepped Jiggers Strainers Swizzles Tins Tongs Accessories New Arrivals All Accessories Air Fresheners Bolo Ties Bundles Buttons Calendars Candles Classic 8 Ball Coffee Mugs Croc Charms Cufflinks Dehydrated Garnishes Dice Gift Cards Glassware Kits Keychains Magnets Mouse Pads Nalgenes Ornaments Patches Posters & Prints Puzzles Rugs Sharpie Holster Stickers Tote Bags Bitters Custom Custom Pins Custom Apparel Info About Us Wholesale FAQ Sale Mystery Items Sale Log in Cart ( 0 ) Search About Us Who We Are At the intersection of pop culture and cocktail culture, where the world’s greatest bartenders conspire–that’s where you’ll find Mover & Shaker , a Jacksonville, FL-based boutique creative agency (of sorts) with its proverbial finger ever on the pulse of what’s happening in the hospitality industry. Who is Mover & Shaker? Call us what you will, Mover & Shaker is the brainchild of accomplished industry veteran Nick Hogan. Founder, Nick Hogan ( @boldcitybourbon ) Born out of his shared passion for creating memorable experiences and a keen eye for great design, the Mover & Shaker brand has become a banner of sorts for the new generation of bartenders and hospitality professionals who fully embrace the service industry lifestyle and the colorful, diverse community that surrounds it. Nick is a seasoned bartender with a lengthy list of cocktail competition wins and industry accolades under his belts. Though you’re more likely to catch him slinging merch than shaking cocktails these days, his years of experience behind the bar has given them sharp insight into the cult and culture of hospitality. His unique and informed perspective is what makes Mover & Shaker such an authentic and relatable brand capable of reaching and resonating with their discerning niche. What we do There’s more to Mover & Shaker than just pins and shirts. We bring great ideas to life, then we bring them to the people, wherever they are. Some of those ideas are wholly our own. Collaboration with Death & Co For others, we collaborate with brands of all sizes who are interested in reaching hospitality professionals and the most hardcore cocktail enthusiasts with exciting merchandise collections, full-blown digital campaigns, engaging social media content , and much, much more. Interested in collaborating with us? Drop us a line and we’ll reach out to discuss the details. Learn More About Mover & Shaker Here Bartender at Large Podcast: Entrepreneurship w/ Mover & Shaker Bon Appétit Love Cocktails? Wear One of These Pins to Prove It Follow Us on Facebook & Instagram Newsletter Sign up for our newsletter to stay up to date on new releases and sales! Subscribe Policies & Information Search FAQs Privacy Policy Refund policy Terms of Service Social Media Facebook Instagram Contact info@moverandshakerco.com Mover & Shaker Co. © 2025, Mover & Shaker Co Powered by Shopify American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL Mastercard PayPal Shop Pay Visa Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main menu New Arrivals Pins Apparel Barware Accessories Bitters Custom Info Sale Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://www.tampabay.com/things-to-do/food/spirits/bar-review-the-copper-shaker-in-downtown-st-petersburg/2337414/",
      "text": "Bar review: The Copper Shaker in downtown St. Petersburg Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Bars & Breweries Bar review: The Copper Shaker in downtown St. Petersburg Copper Shaker’s Coochi Cutter begins with Brooklyn Gin. By Justin Grant, tbt* correspondent Published MORE FOR YOU In Dunedin, MockFusion creates bar atmosphere minus the alcohol • Bars & Breweries Temple Terrace bets big on boozy pickleball complex • Bars & Breweries Advertisement After 2 years, Clearwater brewery reopens under new management • Bars & Breweries Move to bigger location equals more business for St. Petersburg sports bar • Bars & Breweries Sip and learn at Savoir, St. Petersburg’s newest wine bar • Food This new restaurant is doing something Tampa Bay diners haven’t seen before • Food After a rocky start, Mango’s Southern Kitchen + Bar finds its footing • Food This Safety Harbor brewery is expanding. Here’s what to know. • Bars & Breweries Here’s the first retail spot coming to St. Petersburg’s tallest tower, 400 Central • Food A new Japanese cocktail lounge is coming to Tampa Heights • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://support.copperchef.com/contact-us/",
      "text": "Contact Us - Support Copper Chef Contact Us - Support Copper Chef Home Brands Copper Chef® Home Brands Copper Chef® Contact Us We Are Here To Help You! If you should have any questions about your order or a question about any of our great products, please feel free to email us. Emails will be answered during business hours from 9am - 8pm ET Monday - Friday. 9am-5 pm Saturday-Sunday. We appreciate your patience as we try to assist all customers. To check your order status, view your invoice or check payment information click here . If you would like to learn more about a product or review manuals and recipes, please click here and search brands, models or product for answers. If you need us to answer a question, send us an email using the address below. Include your contact information, product name or model # and your question. empowercustomerservice@spectrumbrands.com Customer Service Hours Monday – Friday: 9 a.m. – 8 p.m. EST Saturday and Sunday: 9 a.m. – 5 p.m. EST You can speak to an agent for the specific product line by dialing one of the numbers listed below. Product Phone Number Copper Chef 973-287-5176 Customer Service Return Policy Money Back Guarantee Contact Us Corporate Information Terms of Use Privacy Policy Web Accessibility Site Map Site Map © 2025 Empower Brands, LLC. All Rights Reserved."
    },
    {
      "url": "https://coppercare.com/contact-us",
      "text": "Contact Us - Copper Care Wood Preservatives, Inc. | Wood Preservation Technology Experts Search Button Button Home Support Safety Data Sheets SDS Tenino Tenino SDS Cu-Nap Cu-Nap SDS Cu-Bor Cu-Bor SDS SDS Super-Fume Super-Fume SDS Regulatory Labels Label Tenino Tenino Label Cu-Nap Cu-Nap Label Cu-Bor Cu-Bor Label Super-Fume Super-Fume Preservatives Copper Naphthenates Tenino Cu-Nap Cu-Bor Fumigants Cu-Lam Barriers Contact Us Linkedin Icon Contact Copper Care Wood Preservatives, Inc. Contact Us On Our Website To begin please select what this is about. This will help direct your message to the right experts, to serve you faster. Choose an issue Tenino Copper Naphthenate Cu-Nap Concentrate Cu-Bor Cu-Lam Barriers Super-Fume International Sales & Support I'm not sure Something else Fullname First Name Last Name Email Phone Phone Number Address Street Address Street Address 2 City State Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Colombia Comoros Congo Cook Islands Costa Rica Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya Kiribati Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northern Mariana Islands Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda S. Georgia and S. Sandwich Islands Saint Kitts and Nevis Saint Lucia Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Korea Soviet Union Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbard and Jan Mayen Islands Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay US Minor Outlying Islands US Virgin Islands Uzbekistan Vanuatu Venezuela Viet Nam Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia Zimbabwe Country Message Captcha Headquarters Address: 1556 33rd Avenue, Columbus, NE, 68601 Billing: P.O. Box707, Columbus, NE, 68602-0707 Phone: (402) 563-2663 Fax: (402) 564-9508 Email: bill@coppercare.com ♦ President Plant Address: 41676 261 Avenue, Humphrey, NE 68642 Phone: (402) 910-5762 Hours Monday - Friday 9:00am to 4:300pm central Saturday, Sunday & Holidays CLOSED Quick Links Copper Care Wood Preservatives, Inc. P.O. Box 707 Columbus, NE 68602-0707 (402) 563-2663 (402) 564-9508 Quick Links Safety Data Sheets Registration Labels Tenino Copper Naphthenate Contact Us © Copyright 2025 by Copper Care Wood Preservatives, Inc. Terms Of Use Privacy Statement"
    },
    {
      "url": "https://www.coppershakerstpete.com/",
      "text": "HOME | Copper St Pete top of page HOME ABOUT US MENUS LOCKERS EVENTS GALLERY MEDIA & PRESS JOIN THE TEAM CONTACT More Use tab to navigate through the menu items. ST. PETERSBURG About COCKTAIL HOUSE & KITCHEN Located in the heart of Downtown St. Petersburg, The Copper Shaker is a locally owned and operated craft cocktail bar and kitchen, offering delicious shareable appetizers and the very best of classic and contemporary craft cocktails in a relaxed and fun environment, with a staff that strives to make every guest feel like a local. Whether you're a bourbon trail veteran or a newcomer to the craft scene, our staff will be happy to accommodate you with their knowledge and passion. The kitchen offers a seasonally and multi-culturally influenced menu with top-quality ingredients and generous portions for sharing, as well as the occasional free sample of the latest creations. BEHIND THE BAR CRAFT COCKTAILS From classic to contemporary craft, our cocktails are carefully created to accommodate our guests’ desires. Whether you’re looking for a favorite classic cocktail or something a bit more innovative, we have you covered with an eclectic and extensive spirits roster, the freshest ingredients, and some of the most knowledgeable and creative bartenders the area has to offer. If you’re looking for something a little more distilled, you may want to browse our spirit selection of over 700 labels (including 200 whiskies) or pick something from our tequila & mezcal collection. We also offer a variety of domestic, local, craft, and imported beers in bottles, cans and on 14 taps. At Copper Shaker, we take pride in the fact that we have a little bit of something amazing to offer everyone. IN THE KITCHEN GOURMET EATS Hospitality isn’t just the smile at the door, it’s also that little something extra, and the kitchen at The Copper Shaker thrives on exactly that. From our cheese and charcuterie boards to our chateaubriand special, we utilize top quality ingredients like Niman Ranch cured meats and line-caught fresh ahi tuna. The always evolving menu reflects the eclectic offerings of the bar with dishes like the Big Ass Steak, Copper Chicken, and charcuterie boards. Those seeking gluten free or vegan options will be pleased to find many of our menu items already meet those criteria, and others need only minor adjustments. All our food is passionately created with the idea that breaking bread is one of the basic tenets of hospitality, so bring some friends and order a few plates, and we’ll make sure you get enough to share. Contact JOIN THE CLUB Sign up and receive alerts for all of our upcoming events and specials Information / Reservations / Bookings: 727.201.2441  |  stpete@coppershaker.com Name Code Phone Email Additional Info > Thanks for submitting! VISIT US 169 1st Avenue North St. Petersburg, FL 33701 ​ Open Daily  4:30pm to 3am WORK WITH US Come Join Our Team! ​ Contact Us At stpete@coppershaker.com © 2023 Copper Shaker  |  Designed by The Shaw Design Group bottom of page"
    },
    {
      "url": "https://www.coppershakerstpete.com/lockers",
      "text": "LOCKERS | Copper St Pete top of page HOME ABOUT US MENUS LOCKERS EVENTS GALLERY MEDIA & PRESS JOIN THE TEAM CONTACT More Use tab to navigate through the menu items. LOCKERS MEMBERS ONLY ACCESS TO COVETED STOCK What If You Were Able To Stash Your Favorite Bottle Of Whiskey... At Your Favorite Neighborhood Bar... To Drink With Your Favorite Friends... Whenever You Want? At Copper Shaker, We Bring That Dream To Life! The C.S. Locker program provides by-the-bottle access to our entire portfolio of over 700 spirits to those discerning members of our clientele. From Boss Hog to Blanton's, Buffalo Trace to Balvenie, and everything in between (including beer & wine), members can have their pick to stock their lockers. For a small monthly or annual fee, Members enjoy unique benefits like VIP Service, early-bird event tickets, and of course access to our private stock of highly sought after spirits. Members looking to stock their locker with even more exotic fair will be happy to know that our team will attempt to track down any requested product. Members have a choice of one of 30 secure lockers at Copper Shaker that only they have access to. All lockers receive an engraved plaque with a moniker of your choice and locker number. Upon visiting, Members have full access to our glassware, the appropriate ice, mixers, and other accoutrements for their entire party to enjoy. Become A Member: Interested In Your Own Locker? Want To Discuss Our Collection? Schedule An Appointment With Us © 2023 Copper Shaker  |  Designed by The Shaw Design Group bottom of page"
    },
    {
      "url": "https://capstonecopper.com/about-us/leadership/",
      "text": "Senior and Corporate Leaders - Capstone Copper Home English Español Search Investors Stock information News Events and presentations Reports and filings Analyst coverage Copper facts Subscribe FAQs Operations Pinto Valley Cozamin Mantos Blancos Mantoverde Santo Domingo Mantoverde-Santo Domingo district integration Exploration Mineral reserves and resources Responsibility Our approach Reporting Environment Community Water Tailings management People Health & safety Climate change Modern Slavery Report News News releases Stories Careers Why join Capstone? Current opportunities Careers FAQs About Us Leadership Board of Directors Governance Recognition Directory About us Leadership Senior Leadership Team Cashel Meagher President and Chief Executive Officer Cashel Meagher was appointed President & Chief Executive Officer and a member of the Board of Directors of Capstone Copper in May 2025.  Previously, he served as President & COO since joining Capstone in January 2022. Prior to Capstone he was Senior Vice President and COO of Hudbay Minerals, where he was responsible for international operations, business development, technical services, exploration and corporate social responsibility. He has deep knowledge of Latin American mining operations, having successfully led the construction and ramp up of Hudbay’s Constancia mine. His professional background includes several management positions with Vale Inco’s Canadian operations, where he gained experience in precious metals and base metals exploration, mineral reserve and resource estimation, engineering studies, and open pit and underground operations. Cashel holds a Joint Advanced Major in Geology and Chemistry from Saint Francis Xavier University and is a Professional Geoscientist registered with the Association of Professional Geoscientists of Ontario. James Whittaker Senior Vice President & Chief Operating Officer In May 2025, James Whittaker was appointed Senior Vice President & Chief Operating Officer at Capstone Copper. He previously served as Senior Vice President, Head of Chile, from his joining in August 2023. James is a Metallurgical Engineer with a distinguished 30-year career overseeing operations and project developments in both North and South America. His previous leadership positions include President of the Escondida Copper Mine at BHP Chile, Executive General Manager at the Haile Gold Mine (OceanaGold), and Executive General Manager at Barrick Gold. James holds an Executive MBA from Queen’s School of Business and a Bachelor of Engineering Degree in Extractive Metallurgy from Dalhousie University. Raman Randhawa Senior Vice President and Chief Financial Officer Raman Randhawa is a Canadian Chartered Professional Accountant (CPA, CA) with 20 years of financial and leadership experience in the mining industry. Prior to joining Capstone in 2018, Raman spent 13 years at Goldcorp Inc., a Canadian based global gold producer. At Goldcorp, Raman held a series of senior management roles, including Vice President, Business Planning, Vice President, Business Performance & Reporting and Vice President, Finance, Operations. His background includes roles in Controllership, Treasury and Supply Chain in addition to leading Goldcorp’s Canadian mines from a finance perspective. He has broad management and financial experience with exposure to capital markets and corporate development. He led the development of a Global Supply Chain department and management of multi-billion dollar capital budgets. Raman started his career at the international firm of Ernst & Young. Peter Amelunxen Senior Vice President, Technical Services Peter Amelunxen is a Professional Engineer with 25 years of combined operational and senior management experience, providing corporate oversight and strategic direction to technical functions across various sites, exploration and development projects. Peter joined Capstone in April 2022 as Vice President, Technical Services and was promoted to Senior Vice President, Technical Services in August 2023. Prior to Capstone, Peter was Vice President, Technical Services at Hudbay Minerals. He has deep knowledge of Latin American mining operations, having previously served as a founding partner of Aminpro Chile, President of Aminpro Peru and senior technical consultant to most of the major South American mining companies. Peter has a Bachelor of Science Degree in Mining Engineering from the University of Arizona and a Master of Engineering Degree from McGill University. Wendy A. King Senior Vice President, Risk, ESG, General Counsel and Corporate Secretary Wendy King is responsible for leading the company’s legal function and Capstone’s strategy for environmental, social and governance (“ESG”) and sustainability, as well as overseeing the enterprise-wide risk management and global insurance program. Wendy also serves as Corporate Secretary overseeing the corporate governance of Capstone. She has been practicing law for more than 25 years as in-house counsel and with a national firm as an international-tax specialist. She holds an LLB, a Masters in International Tax Law, a Masters of Business Administration, an ICD.D certification with the Institute of Corporate Directors and has completed the Advanced Management Program at Harvard University. Wendy joined Capstone following her role as Senior Vice President Government Relations, General Counsel, Chief Compliance Officer and Corporate Secretary at Central 1 Credit Union. Prior to this role, she served as Senior Legal Counsel with Weyerhaeuser Company. Chris Richter Senior Vice President, Corporate Development Chris Richter is Senior Vice President, Corporate Development, responsible for leading Corporate Development and Concentrate and Metal Sales. He previously served as Chief Integration Officer for Capstone and was Chief Development Officer at Mantos Copper, where he supported the merger with Capstone Mining. Chris brings over 20 years of experience in mining and renewable energy, including as President and CEO of AuRico Metals. He has led or contributed to more than $22 billion in M&A transactions at AuRico Gold and Barrick Gold. Chris holds a Master’s in Economics from the University of Toronto and a Bachelor’s in Economics and Political Science from the University of Waterloo. He is also a CFA Charterholder. Corporate Leadership Team Fernando Garcia L. Chief Financial Officer, Chile Hayden Halsted Vice President, Operational Excellence Lyndsay Potts Vice President, Strategic Planning & Evaluations Daniel Sampieri Vice President, Investor Relations Charmane Sing Vice President, Legal & Compliance Ian Stephenson Vice President, Treasurer David Taylor Vice President, Health, Safety & Environment Matthew Taylor Vice President, Technical Services Brock Wlad Vice President, Financial Reporting & Tax Ashley Woodhouse Vice President, Concentrate & Metal Sales Investors Stock information News Events and presentations Reports and filings Analyst coverage Copper facts Subscribe Tax information Operations Pinto Valley Cozamin Mantos Blancos Mantoverde Santo Domingo Mantoverde-Santo Domingo district integration Exploration Mineral reserves and resources Responsibility Our approach Reporting Environment Community Water Tailings management People Health & safety Climate change Modern Slavery Report Careers Why join Capstone? Working at Capstone Careers FAQs About us Leadership Board of Directors Governance Recognition Directory News News releases Stories © 2025 Capstone Copper Supplier Hub Contact us Privacy policy Connect with us on Facebook Connect with us on Twitter Connect with us on LinkedIn"
    },
    {
      "url": "https://www.copper.com/contact",
      "text": "Contact Us | Copper | Copper CRM close Product Organize contacts Keep all your relationships in one place Track deals Set up the pipelines that work for you Manage projects Build workflows that keep everything moving Elevate emails Build, personalize, scale and automate Automate tasks Create recurring tasks and notifications Get reports See how your business is doing with custom reports Integrate apps Connect to your favorite apps and tools Mobile app Stay connected wherever you go Google Workspace CRM Manage contacts, deals, and more, in one place Try Copper free Login Industries Agencies Power your lead gen and project delivery Consulting Grow client relationships and simplify work Media & Creators Manage sponsors, partners, and campaigns easily Corporate Development Nurture founder relationships and outreach Financial Services Manage finances and compliance with ease Construction Win bids and deliver your team’s best work Try Copper free Login Pricing Google Workspace CRM Resources Blog Discover tips and strategies to grow your business Webinars Tune in and learn from our experts Guides and eBooks Upgrade your CRM skills with expert advice CRM 101 What is CRM and why do you need it? Customer stories Get inspired and learn from Copper customers Help Center Find answers and tips for mastering Copper Developer API Build apps that connect with Copper Try Copper free Login Go to Copper close Product Industries Pricing Google Workspace CRM Resources Go to Copper Features Organize contacts Keep all your relationships in one place Track deals Set up the pipelines that work for you Manage projects Build workflows that keep everything moving Elevate emails Build, personalize, scale and automate Automate tasks Create recurring tasks and notifications Get reports See how your business is doing with custom reports Integrate apps Connect to your favorite apps and tools Mobile app Stay connected wherever you go Google Workspace CRM Manage contacts, deals, and more, in one place Integrations Integrate Copper with your favorite apps in one click ⚡ Chrome extension Manage contacts, deals, emails, and more in one place ✨ Mobile app Log calls and SMS automatically so accounts are always up to date. Copper for Agencies Power your lead gen and project delivery Consulting Grow client relationships and simplify work Media & Creators Manage sponsors, partners, and campaigns easily Corporate Development Nurture founder relationships and outreach Financial Services Manage finances and compliance with ease Construction Win bids and deliver your team’s best work \"With Copper, there was almost no setup time since it worked with Gmail. Plus, there were all these integrations that we could use right away. We were sold.\" \"It took us 3 months at HubSpot and it took us 3 days to get up and running in Copper. Copper is so much easier for a small team.\" “We use Copper for inbound and outbound, both to sell and to service. It touches all parts of our business, rather than just serving as a sales pipeline or our client rolodex.” Resources Blog Discover tips and strategies to grow your business Webinars Tune in and learn from our experts Guides and eBooks Upgrade your CRM skills with expert advice CRM 101 What is CRM and why do you need it? Customer stories Get inspired and learn from Copper customers Help Center Find answers and tips for mastering Copper Developer API Build apps that connect with Copper Contact Us Contact our Support and Sales team Need to get in touch with the team? We’re all ears. Contact Sales LET’S CHAT Who do you need to get in touch with? Support We have a support portal that has the answers to dozens of the most common questions about Copper! Check it out here. If you don't find what you need, please chat us through the Copper app. Sales Interested in learning more about Copper? Contact our product experts at sales@copper.com . Business Development Are you a reseller, affiliate, or association that would like to partner with Copper? Get connected with our Partner team at partners@copper.com. General Questions Have a general question for us? Contact us at info@copper.com. Goodbye Data Entry Hello Copper. Try it free! No credit card required. Start your 14-day free trial today. Try Free Request Demo Product Organize contacts Track leads & deals Manage projects Build pipelines Scale communications Get reports Mobile CRM Pricing Industries Agency CRM Consulting CRM Media CRM Finance CRM Construction CRM Technology CRM Small Businesses Copper x Google Google Workspace CRM Gmail CRM Google Sheets CRM Workspace Partner Chrome Store App Integrations LinkedIn JustCall PandaDoc Slack QuickBooks Docusign All integrations Resources Blog Webinars Guides & eBooks CRM 101 Case studies Help center Company About us Careers Get a demo Developer Contact us Become a partner Trust Center Copper CRM, Inc. © 2025 Privacy Terms"
    },
    {
      "url": "https://www.copperrock.com/contact-us",
      "text": "Contact Us - Get in Touch with Copper Rock Golf Course Real Estate Real Estate Listings Maps & Resources Golf View Estates North Slope Community Pebble Beach Properties Amenities & Nearby Attractions Vacation Rentals Our Golf Course Course Tour Scorecard Clubhouse Food & Beverages Events Our Story LPGAÂ Epson Tour Copper Rock Championship 2025 Magazine Contact Us Book Tee Times Stay & Play Packages Book Tee Time Get In Touch Contact Copper Rock - Golf Course In Southern Utah Have a question, comment, or just want to say hello? We'd love to hear from you! Whether you're interested in booking a tee time at our award-winning golf course or simply want to learn more about our luxurious homes on the fairways, our friendly team is here to help. Drop us a line via email, phone, or through our website, and we'll get back to you as soon as possible. contact@copperrock.com +1 (435) 215-4845 Copper Rock Golf Course 1567 W Copper Rock Parkway PO Box 160 Hurricane, UT 84737 Sales Information bill@wdhobson.com +1 (435) 619-7400 Berkshire Hathaway HomeServices Utah Properties 2 West St. George Blvd Ste. 31 St.Â George, UT 84770 Choose a topic General Inquiry Pro Shop / Clubhouse Contact an Agent Please select any option(s) that apply to your inquiry: Golf / GroupÂ Rates VacationÂ Rentals Housing Development Homes For Sale Events Other I accept the Terms Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Book Your Tee Times Today. Are you ready to experience the beauty and challenge of Southern Utah's premier golf course? Don't miss your chance to book a tee time at our course. With stunning vistas, challenging holes, and top-notch amenities, you'll be sure to have an unforgettable golfing experience. Stay & Play Packages Book tee time Contacts 1567 W Copper Rock Parkway PO Box 160 Hurricane, UT 84737 contact@copperrock.com +1 (435) 215-4845 Golf Course Book Your Stay Vacation Rentals For Sale Book tea time Covid-`19 Our Golf Course Course Tour Scorecard Clubhouse Food & Beverages Events Our Story Newsletter Enter your email to stay up to date with events, development progress, and golf course updates. Thank you! Weâll be in touch. Oops! Something went wrong while submitting the form. Â©2025 BHH Affiliates, LLC. An independently owned and operated franchisee of BHH Affiliates, LLC. Berkshire Hathaway HomeServices and the Berkshire Hathaway HomeServices symbol are registered service marks of Columbia Insurance Company, a Berkshire Hathaway affiliate. Equal Housing Opportunity. Information not verified or guaranteed. Privacy Policy Terms and Conditions Copyright Copper Rock Â© currentYear All Rights Reserved. To the top"
    }
  ]
}