{
  "fuentes": [
    {
      "url": "https://copperblueslive.com/events/copper-blues-desert-ridge-improv-is-now-hiring-all-positions-8/",
      "email": "info@desertridgeimprov.com"
    },
    {
      "url": "https://copperblueslive.com/locations/miami/",
      "email": "brunch@copperblueslive.com"
    },
    {
      "url": "https://copperblueslive.com/locations/miami/",
      "email": "mattd@copperblueslive.com"
    },
    {
      "url": "https://copperblueslive.com/events/copper-blues-is-now-hiring-all-positions-4/",
      "email": "20infophx@copperblueslive.com"
    },
    {
      "url": "https://copperblueslive.com/events/copper-blues-is-now-hiring-all-positions-4/",
      "email": "infophx@copperblueslive.com"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "email": "the-collection-riverpark-icon-connect@2x.png"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "email": "the-collection-riverpark-icon-giftcard@2x.png"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "email": "the-collection-riverpark-icon-parking@2x.png"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "email": "the-collection-riverpark-logo-c@2x.png"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "email": "the-collection-riverpark-wave-white-repeat@2x.png"
    },
    {
      "url": "https://www.copperblues.com/aboutus",
      "email": "info@copperblues.com"
    },
    {
      "url": "https://copperblueslive.com/events/copper-blues-desert-ridgeis-now-hiring-all-positions/",
      "email": "infodr@copperblueslive.com"
    }
  ],
  "mails": [
    "20infophx@copperblueslive.com",
    "brunch@copperblueslive.com",
    "info@copperblues.com",
    "info@desertridgeimprov.com",
    "infodr@copperblueslive.com",
    "infophx@copperblueslive.com",
    "mattd@copperblueslive.com",
    "the-collection-riverpark-icon-connect@2x.png",
    "the-collection-riverpark-icon-giftcard@2x.png",
    "the-collection-riverpark-icon-parking@2x.png",
    "the-collection-riverpark-logo-c@2x.png",
    "the-collection-riverpark-wave-white-repeat@2x.png"
  ],
  "nombre_sitio": "copperblueslive.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://copperblueslive.com/events/copper-blues-desert-ridge-improv-is-now-hiring-all-positions-8/",
      "text": "COPPER BLUES & DESERT RIDGE IMPROV IS NOW HIRING: ALL POSITIONS - Copper Blues Live Skip to main content Home Menus Kitchen Cocktails Live Music/Events Live Music/Events Private Events Info/FAQ Desert Ridge Marketplace (Change Location) Arizona Desert Ridge Marketplace Downtown Phoenix Florida Miami (Doral) California Oxnard Brea Copper Blues Preloader Logo COPPER BLUES & DESERT RIDGE IMPROV IS NOW HIRING: ALL POSITIONS COPPER BLUES & DESERT RIDGE IMPROV IS NOW HIRING: ALL POSITIONS [MEET US EVERY WEDNESDAY FROM 11AM – 1PM]! Applicants can apply in-person at the venue, so swing by & apply! Every Wednesday from 11am-1pm! Copper Blues & Desert Ridge Improv | 21001 N. Tatum Blvd Phoenix, AZ 85050 BRING YOUR RESUME & A SMILE! • NO APPOINTMENT NEEDED • WALK-INS WELCOME If you LOVE Live Comedy + Live Music, and thrive in a party environment be sure to swing by & apply. Ever hear the saying that laughter is the best medicine? Imagine working somewhere that you are surrounded by it. Desert Ridge Improv is home to the biggest names in comedy including: Gabriel Iglesias, David Spade, Pete Davidson, Nate Bargatze, Eric Andre, Tom Segura, Mike Epps, Whitney Cummings, Bill Burr, Ali Wong, Steve-O, Jeff Ross, Marc Maron, Shawn Wayans, Damon Wayans, Jr., Michelle Wolf, Jim Jefferies, Tiffany Haddish, Craig Robinson and many more regularly perform on our stage!!! Copper Blues Rock Pub & Kitchen features an ongoing rotation of free nightly entertainment to keep the party going including Dueling Pianos, Cover Bands, Tribute Acts, Lost in Country, and the best in Local Live Music! We are ALWAYS looking for our next ROCKSTAR! Can’t make it in person!? Email your resume to info@desertridgeimprov.com to schedule an interview. (Included in your email should be a paragraph describing your experience, availability, what position you are applying for, and what would make you a great asset to our team) Must have a BIG SMILE, be a team player, have a passion for customer service and a POSITIVE attitude is a must! May 22, 2024 | 11:00AM Copper Blues Desert Ridge Marketplace Reserved Seating Make A Reservation Let's Stay Connected Info Careers Contact Copper Blues - Desert Ridge Marketplace 21001 N. Tatum Blvd Phoenix AZ 85050 (602) 910-5161 Reservations Hours - HAPPY HOUR / 4PM - 7PM (WED - SUN) - *EXCLUDING GAME DAYS & SPECIAL EVENTS* - HOURS OF OPERATION - WEDNESDAY: 4PM - 10 PM THURSDAY: 4 PM - 11 PM FRIDAY - SATURDAY: 4 PM - 12 AM SUNDAY: 4 PM - 10 PM **KITCHEN IS OPEN UNTIL ONE HOUR BEFORE CLOSE** Copper Club The Copper Club is a membership only program that gives you early access to our upcoming events. You’ll also be invited to some special “Members Only” experiences built around live entertainment, food, and drinks Email Address Sign Up! ©2025 Copper Blues All Rights Reserved"
    },
    {
      "url": "https://copperblueslive.com/locations/miami/",
      "text": "Miami - Copper Blues Live Skip to main content Home Menus Kitchen Cocktails Live Music/Events Live Music/Events Private Events Info/FAQ Miami (Change Location) Arizona Desert Ridge Marketplace Downtown Phoenix Florida Miami (Doral) California Oxnard Brea Copper Blues Preloader Logo Copper Blues Miami Kitchen The Copper Blues Kitchen is a fusion of your favorite comfort foods and elevated pub fare perfectly designed to complement the excitement and vibrancy of our live entertainment! See Food Menu Cocktails Cocktails are the focus at Copper Blues combining flavors and presentation that match the energy of the room. Our craft cocktails aren't just drinks; they're a harmonious fusion of tradition and innovation perfectly complementing the rhythm of the live music that graces our stage seven nights a week. Get ready to raise your glass to an unforgettable night where music and mixology collide in perfect harmony! See Drink Menu Music Copper Blues features the best live music 7 nights a week with acoustic acts for happy hour and killer bands on the weekends! Come see the best cover bands without a cover charge and don’t miss other special events with DJs, tribute bands and more! Calendar View List View Featured View Live Music Live Event September Load More October Load More November Load More Reservations We fill up fast and recommend planning ahead so make sure to find a table below and we’ll save your seats! Make A Reservation You Had Me At Brunch Every weekend at Copper Blues enjoy live music, performances, and brunch specials. E-Mail for Brunch Reservations Book Your Special Event We throw killer parties so let us know what you're looking for and we'll go above and beyond to make you look like a Rock Star! Get in touch Social From live music to special events and DJs, you never know what we have planned so make sure to follow us on our socials so you’re always in the know on all things Copper! Open post by copperbluesmia with ID 18155632315377048 Open post by copperbluesmia with ID 18066727064269933 Open post by copperbluesmia with ID 18064761245198671 Open post by copperbluesmia with ID 18097516372717562 Open post by copperbluesmia with ID 18148813459394433 Open post by copperbluesmia with ID 18323827066225205 Open post by copperbluesmia with ID 18180591568329570 Open post by copperbluesmia with ID 18015775307766398 Open post by copperbluesmia with ID 17875443000377748 Open post by copperbluesmia with ID 17957057927823352 Open post by copperbluesmia with ID 18058316252354786 Open post by copperbluesmia with ID 18061769324193182 OUR [VERY PINK] SUNDAY LINE UP 💗🫧 SUNDAY AUGUST 31 🫧💗 🎀  PRETTY LITTLE PINK BRUNCH 12PM-5PM 🔊@djsammiiblendz 🥂 PINK & ROSE LATIN PARTY 5PM-MIDNIGHT 🎤 hosted by @rahhfrias 🔊@kcchopz x @djjuniorrm x @randysantosdancestudio 💗 free rosé for ladies in pink LABOR DAY WEEKEND DONE RIGHT ⚡️ only at @copperbluesmia _________ #brunch #thingstodo #copperblues #copperbluesmiami #miami #doral #cityplacedoral #bottomlessbrunch #labordayfun 51 10 Open post by copperbluesmia with ID 18066727064269933 OUR [VERY PINK] SUNDAY LINE UP 💗🫧 SUNDAY AUGUST 31 🫧💗 🎀  PRETTY LITTLE PINK BRUNCH 12PM-5PM 🔊@djsammiiblendz 🥂 PINK & ROSE LATIN PARTY 5PM-MIDNIGHT 🎤 hosted by @rahhfrias 🔊@kcchopz x @djjuniorrm x @randysantosdancestudio 💗 free rosé for ladies in pink LABOR DAY WEEKEND DONE RIGHT ⚡️ only at @copperbluesmia _________ #brunch #thingstodo #copperblues #copperbluesmiami #miami #doral #cityplacedoral #bottomlessbrunch #labordayfun ... SO MUCH GOING ON THIS WEEK ⚡️ 🎤 AUG 26 | KARAOKE COMPETITION with @havoc305band [win $100] 👾 AUG 27 | REDNECK RAVE with @isabella.esc & @djbedo 🕺🏽AUG 28 | SALSA GLOW with @miamisalsascene @mi.salsa 🎸 AUG 29 | LIVE BAND ft. @lauranthekameleons 👩🏽‍🏫 AUG 30 | END OF SUMMER BRUNCH with @djepps & @rv3entertainment [teachers get 20% OFF] 🎸 AUG 30 | LIVE BAND ft. @slikjmuzik 💗 AUG 31 | PRETTY LITTLE PINK BRUNCH with @djsammiiblendz & @rv3entertainment 🥂 AUG 31 | PINK & ROSÉ LATIN PARTY with @alturaparty @kcchopz @djjuniorrm MAKE THE MOVES 🪩⚡️ only at @copperbluesmia _______ #thingstodo #miamibeachparties #latinparty #linedancing #doralcity #livebandkaraoke #miamibrunch 37 3 Open post by copperbluesmia with ID 18097516372717562 SO MUCH GOING ON THIS WEEK ⚡️ 🎤 AUG 26 | KARAOKE COMPETITION with @havoc305band [win $100] 👾 AUG 27 | REDNECK RAVE with @isabella.esc & @djbedo 🕺🏽AUG 28 | SALSA GLOW with @miamisalsascene @mi.salsa 🎸 AUG 29 | LIVE BAND ft. @lauranthekameleons 👩🏽‍🏫 AUG 30 | END OF SUMMER BRUNCH with @djepps & @rv3entertainment [teachers get 20% OFF] 🎸 AUG 30 | LIVE BAND ft. @slikjmuzik 💗 AUG 31 | PRETTY LITTLE PINK BRUNCH with @djsammiiblendz & @rv3entertainment 🥂 AUG 31 | PINK & ROSÉ LATIN PARTY with @alturaparty @kcchopz @djjuniorrm MAKE THE MOVES 🪩⚡️ only at @copperbluesmia _______ #thingstodo #miamibeachparties #latinparty #linedancing #doralcity #livebandkaraoke #miamibrunch ... STARS, STRIPES & A WHOLE LOTTA COUNTRY 🇺🇸 WERE YOU IN THE ROOM?! 182 8 Open post by copperbluesmia with ID 18058316252354786 STARS, STRIPES & A WHOLE LOTTA COUNTRY 🇺🇸 WERE YOU IN THE ROOM?! ... 🚨 TOMORROW 🚨 Our FIRST EVER LIVE BAND KARAOKE COMPETITION FINALE starting at 8PM at @copperbluesmia 🎸 WATCH 8 FINALISTS BATTLE IT OUT ON STAGE with @havoc305band for a GRAND PRIZE of $500 CASH! 💰 WHO’S YOUR WINNER? comment below ⬇️ #karaokenights #karaokemiami #miamikaraoke #miamilivemusic #miamihappyhour #livebandkaraoke 31 0 Open post by copperbluesmia with ID 18180329785332408 🚨 TOMORROW 🚨 Our FIRST EVER LIVE BAND KARAOKE COMPETITION FINALE starting at 8PM at @copperbluesmia 🎸 WATCH 8 FINALISTS BATTLE IT OUT ON STAGE with @havoc305band for a GRAND PRIZE of $500 CASH! 💰 WHO’S YOUR WINNER? comment below ⬇️ #karaokenights #karaokemiami #miamikaraoke #miamilivemusic #miamihappyhour #livebandkaraoke ... ROCKSTAR KARAOKE COMPETITION WEEK ONE coming in HOT 🏎️💨 HUGE SHOUTOUT to our WEEK ONE WINNERS 🏅 @mariaphoeniix & @willybplaysmusic JOIN US NEXT TUESDAY 💵 2 WEEKLY WINNERS GET $100 CASH EACH ⏰ COMPETITION STARTS AT 8PM-10PM SAVE THE DATE 📅 JULY 1ST | GRAND FINALE 💰WINNER GETS $500 GRAND PRIZE THINK YOU GOT WHAT IT TAKES? ____________________________ #CopperBluesMiami #LiveBandKaraoke #RockstarCompetition #MiamiEvents #MiamiKaraoke #LiveKaraoke 79 9 Open post by copperbluesmia with ID 18409670530103978 ROCKSTAR KARAOKE COMPETITION WEEK ONE coming in HOT 🏎️💨 HUGE SHOUTOUT to our WEEK ONE WINNERS 🏅 @mariaphoeniix & @willybplaysmusic JOIN US NEXT TUESDAY 💵 2 WEEKLY WINNERS GET $100 CASH EACH ⏰ COMPETITION STARTS AT 8PM-10PM SAVE THE DATE 📅 JULY 1ST | GRAND FINALE 💰WINNER GETS $500 GRAND PRIZE THINK YOU GOT WHAT IT TAKES? ____________________________ #CopperBluesMiami #LiveBandKaraoke #RockstarCompetition #MiamiEvents #MiamiKaraoke #LiveKaraoke ... YOU BROUGHT THE VOCALS, WE BROUGHT THE BAND 🎸 Our first ever I’M WITH THE BAND: ROCK STAR KARAOKE took off and didn’t miss a note ⚡️ CHANNEL YOUR INNER ROCKSTAR WITH US every TUESDAY night ft. @havoc305band 🤘🏽 _____________________ #ImWithTheBand #RockStarKaraoke #CopperBluesMIA #Havoc305 #LiveBandKaraoke #LiveMusicMiami #MiamiNights #TacoTuesday 83 12 Open post by copperbluesmia with ID 18085211020644402 YOU BROUGHT THE VOCALS, WE BROUGHT THE BAND 🎸 Our first ever I’M WITH THE BAND: ROCK STAR KARAOKE took off and didn’t miss a note ⚡️ CHANNEL YOUR INNER ROCKSTAR WITH US every TUESDAY night ft. @havoc305band 🤘🏽 _____________________ #ImWithTheBand #RockStarKaraoke #CopperBluesMIA #Havoc305 #LiveBandKaraoke #LiveMusicMiami #MiamiNights #TacoTuesday ... NASHVILLE NIGHTS — in a snapshot 📸 recap coming soon. ____________________ #nashvillenights #copperbluesdoral #miaminightlife #livemusicmiami #countryinmiami #doralnights #girlsnightmiami #miamipartyvibes 225 11"
    },
    {
      "url": "https://copperblueslive.com/events/copper-blues-is-now-hiring-all-positions-4/",
      "text": "COPPER BLUES IS NOW HIRING: ALL POSITIONS - Copper Blues Live Skip to main content Home Menus Kitchen Cocktails Live Music/Events Live Music/Events Private Events Info/FAQ Downtown Phoenix (Change Location) Arizona Desert Ridge Marketplace Downtown Phoenix Florida Miami (Doral) California Oxnard Brea Copper Blues Preloader Logo COPPER BLUES IS NOW HIRING: ALL POSITIONS COPPER BLUES IS NOW HIRING: ALL POSITIONS [MEET US EVERY MONDAY _ THURSDAY FROM 3PM – 5PM]! Applicants can apply & interview in-person at the venue, so swing by & apply! BRING YOUR RESUME & A SMILE! • NO APPOINTMENT NEEDED • WALK-INS WELCOME Copper Blues Rock Pub & Kitchen features an ongoing rotation of free nightly entertainment to keep the party going including Dueling Pianos, Cover Bands, Tribute Acts, Live Band Karaoke, and the best in Local Live Music! We are ALWAYS looking for our next ROCKSTAR! Can’t make it in person!? Email your resume to infophx@copperblueslive.com to schedule an interview. (Included in your email should be a paragraph describing your experience, availability, what position you are applying for, and what would make you a great asset to our team) Must have a BIG SMILE, be a team player, have a passion for customer service and a POSITIVE attitude is a must! December 30, 2024 | 3:00PM Copper Blues Downtown Phoenix Reserved Seating Make A Reservation Let's Stay Connected Info Careers Contact Copper Blues - Downtown Phoenix 50 W Jefferson St. Phoenix, AZ 85003 infophx@copperblueslive.com (480) 719-5005 Reservations Hours Happy Hour: 3pm - 6PM - Monday - Friday *EXCLUDING GAME DAYS & SPECIAL EVENTS* Sunday - Thursday: 3pm - 12am Friday: 12pm - 2am Saturday: 3pm - 2am Copper Club The Copper Club is a membership only program that gives you early access to our upcoming events. You’ll also be invited to some special “Members Only” experiences built around live entertainment, food, and drinks Email Address Sign Up! ©2025 Copper Blues All Rights Reserved"
    },
    {
      "url": "https://thecollectionrp.com/portfolio/copper-blues-rock-pub-kitchen/",
      "text": "Copper Blues Rock Pub & Kitchen - The Collection Riverpark Skip to main content Hit enter to search or ESC to close Close Search search Menu Shopping Dining Entertainment Annex Food Hall Events Visit search (805) 457-5551 591 Collection Blvd, Oxnard, CA 93036 Pet Friendly Patio Happy Hour Copper Blues Rock Pub & Kitchen A unique concept that has successfully combined three elements. Beer, music, and food! Directory Map View Website Book an Event You May Also Enjoy Previous Project Next Project Join The Collection Insiders Become a part of The Collection Insiders and be the first to know about the latest news, events, and promotions. Parking Make your shopping visit easy with our convenient parking. Gift Cards The perfect gift for every occasion. Our Gift Card. Contact Us Brand Partnerships Offices Employment Leasing Code of Conduct Legal Share Tweet Share Pin 2751 Park View Court, Oxnard, CA 93036 Security: (805) 485-2562 | Management: (805) 278-9500 twitter facebook instagram © 2025 The Collection Riverpark. All Rights Reserved. Close Menu Shopping Dining Entertainment Annex Food Hall Events Visit"
    },
    {
      "url": "https://www.copperblues.com/aboutus",
      "text": "About Us — Copper Blues Bar & Grill 0 Skip to Content Copper Blues Bar & Grill Home Eat Drink About Us Gallery Reservations Corporate Functions NYE RSVP Feature Menu Open Menu Close Menu Copper Blues Bar & Grill Home Eat Drink About Us Gallery Reservations Corporate Functions NYE RSVP Feature Menu Open Menu Close Menu Home Eat Drink About Us Gallery Reservations Corporate Functions NYE RSVP Feature Menu About Us About Copper Blues Copper Blues Bar & Grill opened its doors on February 12, 2002 becoming the pioneer restaurant in the Blue Mountain Village. Dustin, Karii and Cindy have realized their dream of establishing their premier dining restaurant and with their collective experience in the hospitality industry, each has his or her own area of expertise to offer this ever thriving and changing business. Our Executive Chef, Terry Prince, has over 40 years of experience in the Culinary Arts. We are proud that he has been with Copper Blues for over a decade! Chef Prince hand-picks his culinary team and partnered with our service professionals create an unforgettable dining experience. Please join us for your next corporate function or social event . We specialize in providing parties of all sizes with an. unsurpassed culinary experience. To learn more about us or to book an event please visit our Corporate Functions Page . Share your positive dining experience on Trip Advisor – click here. Location 156 Jozo Weider Blvd., Unit #3 Blue Mountains, ON L9Y 0V2 Hours Monday — Friday 11am — 10pm Saturday — Sunday 11am — 10pm Follow us on Instagram for food and drink specials!! Please note a minimum $20 cost per guest may apply. An 18% Gratuity will be applied to food and beverage purchases for groups more than 5 guests.  Prices do not include sales tax, 1% village enhancement fee & 2% credit card transaction fee. Contact info@copperblues.com ( 705) 446-2643"
    },
    {
      "url": "https://copperblueslive.com/events/copper-blues-desert-ridgeis-now-hiring-all-positions/",
      "text": "COPPER BLUES DESERT RIDGE IS NOW HIRING: ALL POSITIONS - Copper Blues Live Skip to main content Home Menus Kitchen Cocktails Live Music/Events Live Music/Events Private Events Info/FAQ Desert Ridge Marketplace (Change Location) Arizona Desert Ridge Marketplace Downtown Phoenix Florida Miami (Doral) California Oxnard Brea Copper Blues Preloader Logo COPPER BLUES DESERT RIDGE IS NOW HIRING: ALL POSITIONS COPPER BLUES DESERT RIDGE IS NOW HIRING: ALL POSITIONS STOP BY AND INTERVIEW AT COPPER BLUES DESERT RIDGE! OPEN CASTING CALLS: WEDNESDAY MAY 7 – FRIDAY MAY 9 | 12PM – 3PM Applicants can apply in-person at the venue, so swing by & apply! Copper Blues Desert Ridge 21001 N. Tatum Blvd Phoenix, AZ 85050 BRING YOUR RESUME & A SMILE! • NO APPOINTMENT NEEDED • WALK-INS WELCOME Copper Blues Rock Pub & Kitchen features an ongoing rotation of free nightly entertainment to keep the party going including Dueling Pianos, Cover Bands, Tribute Acts, Lost in Country, and the best in Local Live Music! We are ALWAYS looking for our next ROCKSTAR! Can’t make it in person!? Email your resume to infodr@copperblueslive.com to schedule an interview. (Included in your email should be a paragraph describing your experience, availability, what position you are applying for, and what would make you a great asset to our team) Must have a BIG SMILE, be a team player, have a passion for customer service and a POSITIVE attitude is a must! May 07, 2025 | 12:00PM Copper Blues Desert Ridge Marketplace Reserved Seating Make A Reservation Let's Stay Connected Info Careers Contact Copper Blues - Desert Ridge Marketplace 21001 N. Tatum Blvd Phoenix AZ 85050 (602) 910-5161 Reservations Hours - HAPPY HOUR / 4PM - 7PM (WED - SUN) - *EXCLUDING GAME DAYS & SPECIAL EVENTS* - HOURS OF OPERATION - WEDNESDAY: 4PM - 10 PM THURSDAY: 4 PM - 11 PM FRIDAY - SATURDAY: 4 PM - 12 AM SUNDAY: 4 PM - 10 PM **KITCHEN IS OPEN UNTIL ONE HOUR BEFORE CLOSE** Copper Club The Copper Club is a membership only program that gives you early access to our upcoming events. You’ll also be invited to some special “Members Only” experiences built around live entertainment, food, and drinks Email Address Sign Up! ©2025 Copper Blues All Rights Reserved"
    }
  ]
}