{
  "fuentes": [
    {
      "url": "https://www.partyslate.com/venues/coral-ridge-yacht-club",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://hycboats.com/contact",
      "email": "anneryan@hycboats.com"
    }
  ],
  "mails": [
    "anneryan@hycboats.com",
    "contact@partyslate.com"
  ],
  "nombre_sitio": "coralridgeyachtclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.partyslate.com/venues/coral-ridge-yacht-club",
      "text": "Coral Ridge Yacht Club | Fort Lauderdale Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Coral Ridge Yacht Club Find Venues / Florida / Fort Lauderdale / Coral Ridge Yacht Club Unclaimed Coral Ridge Yacht Club 2800 Yacht Club Blvd, Fort Lauderdale, FL 33304, USA Max Seated 125 Max Standing 325 Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 1 About Coral Ridge Yacht Club The Club hosts a wide-variety of private events each year including weddings, birthdays, business gatherings, holiday parties, family gatherings, and more offering exquisite views of the Intracoastal Waterway, our Marina, and our charming courtyard.\n\nThe Club offers our guests 4 different event spaces, each showcasing a different ambiance, from casual outdoor dining venues to indoor Clubhouse rooms, illuminating elegance and charm. From beginning to end, our Catering and Special Events Director and Executive Chef will work with you to bring your vision of the perfect party to life, and ensure that your event is a great success.\n\nThe Commodores Lounge:\nThe Commodores Lounge, a more intimate dining venue, has a view of our beautiful courtyard and fountain area. The ambiance of the room is perfect for daytime and evening events, and can host approx. 60 people.\n\nPoint Bar & Grille:\nCasual gatherings at the Point Bar & Grille can include barbecues, lawn games, children's parties, and even daytime wedding ceremonies. The Point Bar's island design with native landscaping, on the Intracoastal Waterway, is the perfect outdoor setting for both day and evening events.\n\nIntracoastal Room & Verandah:\nThe luxury of the Intracoastal Room is unsurpassed for hosting a large scale event and holds approximately 200 guests. With an amazing view overlooking the Intracoastal Waterway, fabulous yachts, and Birch State Park, the Intracoastal Room exudes old Florida charm.\nThe attached covered Verandah is an exquisite location to host the party of your dreams and holds up to 125 guests.\n\nThe Patio:\nThe Patio, with its gorgeous, panoramic views of the Club's Olympic-size pool, Marina and the Intracoastal Waterway, is a perfect location for any intimate outdoor gathering and holds approx. 30 guests.The Patio is effortlessly romantic, whether soaking up the sun or enjoying the majestic Florida evening sunsets.\n\nLocated along Florida's famed Gold Coast on the Intracoastal Waterway, for over 70 years the Coral Ridge Yacht Club has beckoned to those who love the water, enjoy socializing and living life to the fullest. Established in 1947, the Coral Ridge Yacht Club mingles tradition and old-world elegance with fun, friendships and family.\n\nOffering exceptional cuisine and service in a family-friendly atmosphere, why not take time and explore all that CRYC has to offer. Event Spaces 5 125 max seated • 325 max standing 1 Intracoastal Room & Verandah 200 Seated 325 Standing Outdoor 4 Coral Ridge Yacht Club 125 Seated 325 Standing Boat 1 Commodores Lounge 40 Seated 60 Standing Meeting Space 1 Point Bar & Grille 30 Seated 50 Standing Restaurant 1 The Patio 20 Seated 30 Standing Outdoor Pricing Packages Coral Ridge Yacht Club hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms In-house caterer only Map 2800 Yacht Club Blvd, Fort Lauderdale, FL 33304, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://hycboats.com/contact",
      "text": "Contact Us | Get in Touch with Harbour Yacht Club and Marina 0 Skip to Content Inventory IN STOCK BOATS Bayliner Showroom Services WINTER STORAGE SUMMER SLIPS SERVICE AND REPAIRS ABOUT US Resources Blog FAQs CONTACT 📞 732-793-7975 Open Menu Close Menu Inventory IN STOCK BOATS Bayliner Showroom Services WINTER STORAGE SUMMER SLIPS SERVICE AND REPAIRS ABOUT US Resources Blog FAQs CONTACT 📞 732-793-7975 Open Menu Close Menu Folder: Inventory Back IN STOCK BOATS Bayliner Showroom Folder: Services Back WINTER STORAGE SUMMER SLIPS SERVICE AND REPAIRS ABOUT US Folder: Resources Back Blog FAQs CONTACT 📞 732-793-7975 Contact Us Today We're happy to answer any questions you may have about summer slips, winter storage or Bayliner boats. Come see the marina for yourself and check out our large inventory of new Bayliner boats for sale. Phone: 732.793.7975 Address: 501 Route 35 South, Mantoloking, NJ 08738 40.00.33N 74.03.67W For more information about our boat inventory or available summer slips, you can submit the form below. Name * First Name Last Name Email Address * Phone Number * (###) ### #### Best Time To Call You * Morning 9am - 11am Afternoon 12pm - 4pm Subject * Message * How can we help you? Thanks for your email! We'll get right back to you. ⚓️ Follow Us Home About Us Boat Sales Summer Slips Blog Contact 📞 Call Us 📍Visit US ✉️ Email Us Location: 501 NJ-35, Mantoloking, NJ 08738 Phone: ( 732) 793-7975"
    }
  ]
}