{
  "fuentes": [
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "email": "info@creeksidecigarco.com"
    },
    {
      "url": "https://www.corkinternationalairporthotel.com/contact-us/contact/",
      "email": "cih-logo_cmyk@2x.png"
    },
    {
      "url": "https://www.corkinternationalairporthotel.com/contact-us/contact/",
      "email": "cih-logo_white@2x.png"
    },
    {
      "url": "https://www.timesleader.com/news/631166/owner-of-cork-bar-restaurant-to-sell-business-after-nearly-a-decade-in-wilkes-barre",
      "email": "handoshando@www.timesleader.comreach"
    },
    {
      "url": "https://corkbarandcatering.com/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://karmacigar.com/contact-us/",
      "email": "219.756.0698info@karmacigar.com"
    },
    {
      "url": "https://karmacigar.com/contact-us/",
      "email": "dhiren@karmacigar.com"
    },
    {
      "url": "https://karmacigar.com/contact-us/",
      "email": "info@karmacigar.com"
    },
    {
      "url": "https://corkdining.com/contact/",
      "email": "info@corkdining.com"
    },
    {
      "url": "https://founderscigarco.com/",
      "email": "info@founderscigarco.com"
    },
    {
      "url": "https://discoverbradenton.com/business/corks-cigar-bar/",
      "email": "20admin@discoverbradenton.com"
    },
    {
      "url": "https://discoverbradenton.com/business/corks-cigar-bar/",
      "email": "admin@discoverbradenton.com"
    },
    {
      "url": "https://www.corketb.ie/",
      "email": "customercare@corketb.ie"
    },
    {
      "url": "https://www.corketb.ie/",
      "email": "eolas@corketb.ie"
    },
    {
      "url": "https://www.corketb.ie/",
      "email": "info@corketb.ie"
    },
    {
      "url": "https://corkwineandgrille.com/contact-us/",
      "email": "info@redwaterevents.com"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "begin-phone-img@2x-150x175.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "begin-phone-img@2x-257x300.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "begin-phone-img@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "develop-brand-img@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "efficiently-break-through-img@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "learn-more-phone-img@2x-150x175.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "learn-more-phone-img@2x-257x300.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "learn-more-phone-img@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "map-background-img@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "motorcycle-vector@2x.png"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "strategic-marketing-plan-homepage-desktop@2x.jpeg"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "email": "digital@corkboardconcepts.com"
    },
    {
      "url": "https://cianoart.com/contact-ciano-art/",
      "email": "info@cianoart.com"
    }
  ],
  "mails": [
    "20admin@discoverbradenton.com",
    "219.756.0698info@karmacigar.com",
    "admin@discoverbradenton.com",
    "begin-phone-img@2x-150x175.png",
    "begin-phone-img@2x-257x300.png",
    "begin-phone-img@2x.png",
    "cih-logo_cmyk@2x.png",
    "cih-logo_white@2x.png",
    "customercare@corketb.ie",
    "develop-brand-img@2x.png",
    "dhiren@karmacigar.com",
    "digital@corkboardconcepts.com",
    "efficiently-break-through-img@2x.png",
    "eolas@corketb.ie",
    "handoshando@www.timesleader.comreach",
    "info@cianoart.com",
    "info@corkdining.com",
    "info@corketb.ie",
    "info@creeksidecigarco.com",
    "info@founderscigarco.com",
    "info@karmacigar.com",
    "info@redwaterevents.com",
    "learn-more-phone-img@2x-150x175.png",
    "learn-more-phone-img@2x-257x300.png",
    "learn-more-phone-img@2x.png",
    "logo@2x.png",
    "map-background-img@2x.png",
    "motorcycle-vector@2x.png",
    "strategic-marketing-plan-homepage-desktop@2x.jpeg"
  ],
  "nombre_sitio": "corkscigarbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "text": "Get in Touch With Us – Creekside Cigar Co Skip to content Pause slideshow Play slideshow Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year . . . Site navigation Search Search Close Creekside Cigar Co Search Account 0 Cart . . . Site navigation Close Search Search Close Cigars New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Latest Release: Frontier Limited Edition HVC Edicion Especiales LE Merch Hats Accessories Watch Our Content Visit the Lounge Hours & Location Membership FAQ Join the Club Search Search Close Goes great with Quick shop Add to cart Crowned Heads Premium Sampler $55 00 $55.00 Quick shop Add to cart Foundation Wise Man Lancero Sampler $60 00 $60.00 Quick shop Sold Out Espresso Pairing Sampler from $65 00 from $65.00 Quick shop Sold Out Best with Bourbon Sampler $70 00 $70.00 Add order note Close Subtotal $0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Cigars Expand submenu Cigars New Arrivals Expand submenu New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Expand submenu Samplers View all Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Expand submenu Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Expand submenu Creekside Customs Latest Release: Frontier Limited Edition Expand submenu Limited Edition HVC Edicion Especiales LE Merch Expand submenu Merch View all Hats Accessories Watch Our Content Visit the Lounge Expand submenu Visit the Lounge Hours & Location Membership FAQ Join the Club Confirm your age Are you 21 years old or older? No Yes Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Hours Sunday: 12pm-9pm Monday: 11am-9pm Tuesday: 11am-9pm Wednesday: 11am-9pm Thursday: 11am-11pm Friday: 11am-11pm Saturday: 11am-11pm Contact 513-630-1044 1381 US-22 Maineville, OH 45039 info@creeksidecigarco.com Lounge Address 1381 US-22 Maineville, OH 45039 Creekside Cigar Co. Privacy Policy Creekside Cigar Co respects your privacy. If you sign up for any of our engagement and outreach programs, including those that use SMS text messaging, we ONLY use information you provide to transmit your mobile messages and, upon request, respond to you directly. This includes sharing information with our program partners, message content providers, phone companies, and vendors who assist us in the delivery of mobile messages. EXCEPT AS SET FORTH IN THIS SECTION, WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER FOR PROFIT ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH PROGRAMS TO ANY THIRD PARTY. We do reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information at point of sale, you agree to provide accurate, complete, and true information. Subscribe today to hear first about our sales Enter your email Subscribe Subscribe Shop Cigars Merch Visit the Lounge Watch our Content Join the Club Customer Care Manage Subscriptions Contact Us FAQ Return Policy Shipping Policy My account About About Us Visit the Lounge Get in touch Email us Follow us Facebook Instagram TikTok YouTube We accept American Express Apple Pay Diners Club Discover JCB Mastercard Visa © 2025\n              Creekside Cigar Co\nNamed Lounge of the Year by PCA Best of the Leaf Awards 2025, located in Cincinnati, Ohio Privacy Policy Terms of Service Get in Touch With Us"
    },
    {
      "url": "https://www.corkinternationalairporthotel.com/contact-us/contact/",
      "text": "Contact Us | Cork International Hotel Menu Stay Signature Rooms Deluxe Rooms Executive Rooms Suites Offers Autumn Breaks in Cork Stay Park & Fly Girls Getaway Stay & Dine Family Packages Eat The Atlantic Breakfast The New Yorker Sunday Lunch The Lobby Meet Small Meetings Conferencing Sports Teams Conference Menus Virtual Tours Celebrate Christmas Private Dining Seasonal Celebrations Communions, Christenings & Confirmations Banquets & Events Weddings What’s On Top Things to Do Events in Cork Golf in Cork Blog Plan your Stay Contact Us Location & Directions Hotel Parking and Shuttle Bus Fitness Room Cinema Room Hairdressers & Nail Salon Children’s Playroom ASD Awareness Top Things to Do in Cork FAQs Community and People Careers Sustainability Community Spirit Awards Charity Partner Inclusion & Accessibility Accessibility Statement Blog Gift Vouchers Sign Up Stay Eat Meet Celebrate Call Us Sign Up Vouchers Book Now × Hotel Parking and Shuttle Bus Location & Directions Fitness Room Cinema Room Children’s Playroom Hairdressers & Nail Salon ASD Awareness Contact Us FAQs Contact Us Cork International Hotel, Cork Airport Business Park, Cork, County Cork, Ireland. T12 H516 Tel: + 353 21 454 9800 Email: [email protected] Name (Required) First Last Email (Required) Enter Email Confirm Email Comments (Required) Please let us know what's on your mind. Have a question for us? Ask away. Consent (Required) I hereby consent to receive emails fromCork International Hotel.‎ (Required) CAPTCHA Sign up to receive our latest news! Sign up here to our Newsletter to receive special offers and news via email directly into your inbox. Contact Us FAQs Gallery Location Parking Careers Blog Newsletter Sitemap Privacy Policy Cookie Notice Cork International Hotel Cork Airport Business Park, Cork, County Cork, Ireland. T12 H516 Phone: +353214549800 Email: [email protected] Cork International Hotel Cork Airport Hotel The Metropole Hotel Cork Return To Top Copyright © 2025 Cork International Hotel"
    },
    {
      "url": "https://www.timesleader.com/news/631166/owner-of-cork-bar-restaurant-to-sell-business-after-nearly-a-decade-in-wilkes-barre",
      "text": "Owner of Cork Bar & Restaurant to sell business after nearly a decade in Wilkes-Barre | Times Leader Facebook RSS Twitter Youtube Home Support Local Journalism About Us Advertise Contact Us TL Digital Services Subscribe Now! New: Place Classified Ad Submit Classified Ad using Contact Form Get News Alerts Property Tax Assessment Database Special Sections Times Leader Purchase Locations Times Leader for iPhone/iPad Times Leader for Android News Access E-Edition Print Subscriber Setup Subscribe To E-Edition Multimedia Videos Times Leader on YouTube Interactives Submit News Tip Weather Local Business Crime Gas Prices Restaurant Inspections Finance Lottery State Nation/World Archive Air Traffic Traffic Online Community Online Forms TL on Facebook TL on Twitter Sports Submit Scores Submit Sports News TL Sports Betting Penguins Local Sports RailRiders Auto Racing All College Sports College Basketball College Football Golf All High School Sports High School Baseball High School Basketball High School Cross Country High School Field Hockey High School Football High School Golf High School Ice Hockey High School Lacrosse -HS Boys Lacrosse -HS Girls Lacrosse High School Soccer -HS Boys Soccer -HS Girls Soccer High School Softball High School Swimming High School Tennis High School Track and Field High School Volleyball -HS Boys Volleyball -HS Girls Volleyball High School Wrestling MLB NBA NHL NFL Outdoors Penn State Penn State Special Section Tennis Pro32 International Auto Racing AP Olympics Coverage Obituaries Opinion Submit Letter To The Editor Columns Editorials Our Opinion Letters Political Cartoons Business Features What’s Up NEPA! Add Your Event Podcasts #OntheStacks Podcast Next Stop Podcast Recipes – Times Leader Cookbook Entertainment TV Best Bets Movies TV News TV Sports Soaps TV Search Q & A TV Video TV Listings TV Talk Puzzles & Games Anniversaries Birthdays Births Community Engagements Listings Weddings Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Comics Horoscopes Businesses Shop Buy A Subscription Buy Single Editions Buy A Custom Front Page Jobs Search Free Access Monday eEdition Public Notices Search Notices Place Notices Search Times Leader Wilkes-Barre, PA News, Obituaries, classifieds, and Sports Times Leader Wilkes-Barre, PA News, Obituaries, classifieds, and Sports Subscribe Subscription Deals E-Edition Circulars Support Local Journalism Buy Single Editions Free Monday E-Edition Obituaries View Obituaries Place an Obituary Classifieds Place A Classified Ad Contact Us Advertiser Pay Public Notices Place Notices Search Notices Facebook Instagram Pinterest RSS Twitter Youtube Times Leader Wilkes-Barre, PA News, Obituaries, classifieds, and Sports Wednesday, September 10, 2025 View E-Edition Access My Account Access My Subscription Access Single Copy E-Edition Need to Sell? Click here to place a classified ad. Click here for Saturday Sports Edition locations Public Notices - Click to Learn More Watch #OnTheStacks podcast! New episode every Wednesday. News Videos Features Events Calendar Add Your Event Podcasts #OntheStacks Podcast Next Stop Podcast TheWeekender.com Sports TL Sports Betting Opinion Business Blotter Tax Database – Updated 7/2/24 Search Times Leader Wilkes-Barre, PA News, Obituaries, classifieds, and Sports Subscribe Subscription Deals E-Edition Circulars Support Local Journalism Buy Single Editions Free Monday E-Edition Obituaries View Obituaries Place an Obituary Classifieds Place A Classified Ad Contact Us Advertiser Pay Public Notices Place Notices Search Notices Home Business Owner of Cork Bar & Restaurant to sell business after nearly a... Business News Top Stories Owner of Cork Bar & Restaurant to sell business after nearly a decade in Wilkes-Barre By Times Leader - February 2, 2017 Facebook Twitter Pinterest Linkedin ReddIt Email Print 🔊 Listen to this Tired of ads? Subscribers enjoy a distraction-free reading experience. Click here to subscribe today or Login . WILKES-BARRE — Ruth Corcoran is like a jack of all trades. The owner of Cork Bar & Restaurant on Madison Street said, in addition to managing, she has worked in nearly every aspect of her business, including planning the menu; serving as a hostess, waitress and bartender; even helping prepare appetizers and other small plates in the kitchen. “She never dish washes,” chimed in bar manager Carolyn Saporito. “No, I don’t dish wash,” Corcoran said, laughing. Corcoran recently announced she will sell the restaurant and wine bar, which has been open since September 2007, to area businessman Rob Friedman. She said they hope to close the sale in mid-April. The 3,400-square-foot property is listed for $210,000 through Mericle Commercial Real Estate, according to the real estate agency’s website. Though Corcoran said she will miss the business and her customers, she believes it’s the right time to leave. Corcoran Communications, Corcoran’s public relations business, recently expanded to include Cor Strategic Group, which focuses on marketing for credit unions. She also plans to spend more time with family. “My mother’s very ill,” said Corcoran. “She has Parkinson’s (disease) and she lives in the Lehigh Valley. I think that that kind of was the deciding factor.” Corcoran said the restaurant got off to a rough start, opening just before the Great Recession that spanned from late 2007 through 2009. Even as a public relations professional with some experience in the food industry, Corcoran said she was unprepared for the difficulties she would encounter, like staff issues, keeping customers happy and keeping up with the ever-changing marketplace. “I didn’t think owning a restaurant was going to be as hard as it was,” she said. “It is, of all the businesses I’ve ever done … this is the hardest thing I’ve ever done.” She said making the experience at Cork unique helped bring more customers through the doors, and it allowed the business to grow by 20 percent in each of the last few years. Some events include annual Mardi Gras and Cinco de Mayo celebrations, drink specials on the patio and, Corcoran’s favorite, The Dog Days of Summer, a fundraising event for the Luzerne County SPCA in which a portion of proceeds are donated to the shelter. “What’s been very important to me is that I’ve been able to use this business to give back to the community,” she said. Corcoran also credits her “loyal customer base” for the restaurant’s success. “While a lot of other places closed, we were able to make it,” she said of those first few years. Friedman, owner of the Beaumont Inn in Dallas Township and Grico’s in Exeter, said he hopes to continue the success that Corcoran has built over the years. He plans to keep the staff and promote Saporito to manager of Cork. “Hopefully we can move it forward even more,” he said. Friedman said he enjoys being able to keep local establishments just that — local. “I live in this area, I love living in this area, and I appreciate the fact I’m able to expand and build businesses in this area,” he said. Friedman also owns Friedman Farms in Dallas Township, the River Street Jazz Cafe in Plains Township and Friedman Electric, which has 17 locations in Pennsylvania and New York. Ruth Corcoran poses for a portrait in the upstairs dining room of the Cork Bar & Resturant in Wilkes-Barre. Corcoran recently announced she is selling the restaurant to local business owner Rob Friedman. https://www.timesleader.com/wp-content/uploads/2017/02/web1_TTL020317Cork1.jpg Ruth Corcoran poses for a portrait in the upstairs dining room of the Cork Bar & Resturant in Wilkes-Barre. Corcoran recently announced she is selling the restaurant to local business owner Rob Friedman. Sean McKeag | Times Leader Restaurant owner to focus on family, other businesses By Sarah Hite Hando [email protected] Reach Sarah Hite Hando at 570-704-3945. Facebook Twitter Pinterest Linkedin ReddIt Email Print Previous article Man indicted in shooting death of ex-NFL player Joe McKnight Next article NEPA pizza shops, delis, beer distributors prep for Super Bowl Sunday Times Leader View Comments Weather Wilkes-Barre clear sky enter location 51 ° F 53.3 ° 47.9 ° 87\t\t\t\t\t\t% 0.6mph 0\t\t\t\t\t\t% Wed 72 ° Thu 77 ° Fri 79 ° Sat 81 ° Sun 66 ° E-Edition Most Commented Calendar Local Video Trending Recipes Poll Our Publications The Abington Journal The Dallas Post The Sunday Dispatch The Weekender Go Lackawanna Hazleton Times Interact E-Edition iPhone/iPad App Android App Facebook Twitter Instagram Pinterest YouTube General Information Advertise Privacy Policy Terms Of Service Subscribe Jobs Classifieds © Times Leader 2025"
    },
    {
      "url": "https://corkbarandcatering.com/",
      "text": "Corkbar & Catering Equipment Home About Contact Services Repairs & Maintenance Pro-Kitchen Consultancy Kitchen Design Manufacturing & Installation Kitchen Product Sales Product Support Our Markets Products Bakery Supermarket & Butcher Displays Food Holding & Transport Preparation Equipment Prime Cooking Refrigeration Stainless Steel  & Fabrication Ware & Utensil Washing Brands Projects & Case Studies Cashel Palace Park Hotel Kenmare Public Service Project Dunmore House Hotel Eli Lilly Kinsale Design, Deliver, Support Service-led professionals specialising in pro-kitchen design, stainless steel manufacturing, refrigeration, installation, & servicing Explore Pro-Kitchen Design Guiding you through all stages of the process from design to installation or to advise on specific products or renovation Pro-Kitchen Consultancy Food Equipment Specialists With over 400 products in our portfolio, our customers can choose from some of the best and most recognisable brands in the world. Brands Food Equipment Specialists Effectiveness. Efficiency. Professionalism. Quality. Food Equipment Sales At Cork Bar & Catering Equipment, we take pride in exclusively distributing top-tier catering equipment brands for four decades. Our journey has equipped us with unparalleled expertise, knowledge, and experience. Discover Pro Kitchen Consultancy & Design Comprehensive support for your project, from initial design to final fit. Our technicians collaborate with you, your architect, or your project manager to create the perfect kitchen for your business, whether it’s from a blank space or a redesign of an existing area. Explore Maintenance & Support We understand the significance of offering comprehensive service and maintenance packages to our customers. With decades of expertise, we are dedicated to providing ongoing support to maximise uptime and ensure peace of mind for years to come. Read More Cork Bar & Cater­ing Equip­ment has built a rep­u­ta­tion for qual­ity, excel­lence and reli­a­bil­ity in the Irish cater­ing indus­try since its foun­da­tion in 1981. We recog­nise that you want your busi­ness to be the best and as one of Munster’s lead­ing retail and whole­sale cater­ing equipment man­u­fac­tur­ers and sup­pli­ers, we are confident that our expe­ri­ence and range of ser­vices will help you to achieve your goals. From five star hotels to bou­tique cof­fee shops, bars and super­mar­ket kitchen areas, we can sup­ply a vari­ety of com­mer­cial bar and cater­ing equip­ment and refrig­er­a­tion tai­lored to your indi­vid­ual requirements. Our goal is to pro­vide excel­lent and inno­v­a­tive ser­vice to all our cus­tomers, large and small. An unwavering commitment to service “We’re constantly innovating, we’re constantly changing. Every decision we make and action we take is driven by our dedication to delivering exceptional service to our clients, ensuring their satisfaction and success” Gerard O’Sullivan, Founder & Director Cork Bar & Catering Equipment Proud Partners Of About Contact Us Services Pro-Kitchen Consultancy Kitchen Design Manufacturing & Installation Product Support Repairs & Maintenance Products Prime Cooking Food Holding & Transport Ware & Utensil Washing Refrigeration Preparation Equipment Supermarket & Butcher Displays Bakery Stainless Steel  & Fabrication Projects pro kitchen projects  & case studies Web Design by CopperReed.com Cookies Privacy"
    },
    {
      "url": "https://karmacigar.com/contact-us/",
      "text": "Contacts - Karma Shop Skip to content Skip to footer Home Shop Return Policy Age Verification Policy Promo Code Exclusions & Order Policies Pricing Policy Menu Food Menu CIGAR OF THE MONTH Cigar and Liquor Pairings Events About Us Meet the our Bartenders! Career Contacts Cigar etiquette at Karma Social Media Engagement Raffle Banquet Reservation Inquiry Cigar 101 & Bourbon Pairing Reservation Customer Opt-In or Signup KARMA VIP MEMBERSHIP Blog 0 items - $0.00 0 Search × Contacts Close Home Shop Return Policy Age Verification Policy Promo Code Exclusions & Order Policies Pricing Policy Menu Food Menu CIGAR OF THE MONTH Cigar and Liquor Pairings Events About Us Meet the our Bartenders! Career Contacts Cigar etiquette at Karma Social Media Engagement Raffle Banquet Reservation Inquiry Cigar 101 & Bourbon Pairing Reservation Customer Opt-In or Signup KARMA VIP MEMBERSHIP Blog Contact Details 850 W 81st Ave, Merrillville, IN 46410, USA +1 219.756.0698 info@karmacigar.com dhiren@karmacigar.com I agree that my data is collected and stored . Working hours Mon-Thu: 11:00AM – 10:00PM Fri-Sat: 11:00AM – 11:00PM Sunday: 11:00AM – 10:00PM Office 850 W 81st Ave, Merrillville, IN 46410, USA info@karmacigar.com dhiren@karmacigar.com +1 219.756.0698 Links Contacts Refunds & Returns Terms & Conditions Privacy Policy Get in Touch Copyright 2024 Karma Cigar Bar, LLC. All rights reserved. Karma Cigar Bar's website contains tobacco and alcohol related content, and you must be 21 years or older to view this content. Yes, I'm 21 No, I'm not 21"
    },
    {
      "url": "https://corkdining.com/contact/",
      "text": "Contact Us | Cork Bar & Restaurant | A Like Uncorked Cork Bar & Restaurant Wine & Dine Reservations Igloos Our Events Blog Gift Cards Contact MORE About Us Menus Blog Reservations Igloos Our Events Contact Us Gift Cards Home » Contact Us Contact Us We want to make sure you get a seat! Please do not send a reservation for outdoor dining through this form. Please call 570-270-3818 for more information. First Name* Last Name* Email Address* Phone Number* How Did You Hear About Us?* Questions or Comments* I do NOT want to stay up to date on new menu additions, specials, and more by text or email. Please leave this field empty. Δ Categories Catering (6) Clam Night (1) Cocktails (11) Fine Dining (43) Menus (1) Patio (1) Sinatra Sunday (1) Uncategorized (5) Wine Knowledge (23) Wine Pairing (14) Tags Select 4 Course Meal appetizers black tie margarita blackened jail island salmon calamari fun facts Carribean Clam Night clams Clams Bianco cork crab cakes creole differences between red and white wine dinner dinner entrée dinner in Wilkes-Barre dinner specials Dog dog-friendly dining dog-friendly patio eggplant entree entrées fall wines female chefs and entrepreneurs Fig and Prosciutto Flatbread flatbread flavor food Fra Diavolol Frank Sinatra French onion soup French wine fried calamari Fun facts about calamari Gift Cards Gumbo happy hour history of calamari history of flatbread Italian Italy Jerk Chicken Lamb Little Neck Clams Long Island Duck Breast meat wine pairings meat wine pairs menu most popular condiments mother's day nepa restaurant new menu item New Orleans popular wines pork loin red gulf snapper red wine Rhône Valley wine Rhône Valley wines seafood seafood fra diavolo shellfish Shrimp Scamp small plates starter starter and entree pairings Steamed Clams stir fry Sunday thanksgiving white wine why is it called entrée wilkes-barre bar wilkes-barre food wine wine dinner wine during happy hour wine from France wine pairing wine school wine tastings Women’s History month Archives Select August 2025  (1) July 2025  (1) June 2025  (1) May 2025  (2) April 2025  (2) July 2024  (1) May 2024  (1) May 2023  (1) October 2022  (4) September 2022  (1) August 2022  (3) July 2022  (2) June 2022  (2) May 2022  (2) April 2022  (1) March 2022  (3) February 2022  (2) January 2022  (3) December 2021  (1) November 2021  (1) October 2021  (2) September 2021  (1) August 2021  (1) July 2021  (1) June 2021  (1) December 2020  (1) November 2020  (2) October 2020  (2) September 2020  (1) August 2020  (2) July 2020  (1) June 2020  (3) May 2020  (2) April 2020  (2) March 2020  (6) February 2020  (4) January 2020  (4) December 2019  (5) November 2019  (2) September 2019  (2) August 2019  (3) July 2019  (2) March 2019  (3) Cork Bar & Restaurant 463 Madison St. Wilkes-Barre, PA 18705 5702703818 info@corkdining.com Cork Bar & Restaurant 463 Madison St. Wilkes-Barre, PA 18705 Site Map Wine & Dine About Us Blog Reservations Our Events Igloos Contact Gift Cards Jobs Dinner Hours Open Tuesday through Thursday 3pm to 9pm, Friday and Saturday 3pm to 10pm and Sunday 3pm to 8pm. Closed Monday. Open any time for private parties. For reservations, please call 570-270-3818. Social Media Stay connected with Cork Follow Us on Facebook Follow Us on Instagram Copyright © 2025 All Rights Reserved. A Friedman Hospitality Group.. Powered By Friedman Property Management Refined Culture Atmosphere Tradition Taste Tap To Email Tap To Call arrow-up"
    },
    {
      "url": "https://founderscigarco.com/",
      "text": "Founders | Founders Cigar Company | Veteran Owned Cigars + Accessories Skip to content Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting $ 0.00 0 Cart Premium Cigars from a Veteran Owned, Top-Rated Cigar Brand Discover Our Small-Batch Blends from a Veteran-Owned Premium Cigar Brand Crafted for Character: Premium Cigar Blends You Can Buy Online or at your Favorite Cigar Shop Our cigars are from the Dominican Republic, rolled with care, and ready for you to enjoy with your friends and family. Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Premium Cigars Paired with Cigar Education + Community At Founders Cigar Company, we’re here to equip both seasoned cigar enthusiasts and those new to the cigar world with premium cigars from a top cigar brand you can trust. Whether you’re looking to buy cigars online for a special occasion or to enjoy your everyday ritual, our collection delivers bold flavor, consistent craftsmanship, and a legacy of excellence. We’re also passionate about education— our blog is packed with helpful guides on how to cut a cigar , light a cigar , and navigate cigar culture and etiquette with confidence. From first light to final draw, Founders is your go-to veteran-owned cigar brand for quality, knowledge, and community. Gift a Custom Cigar Box At Founders Cigar Company, we’ve created the ultimate custom cigar box—a premium gift that’s as personal as it is unforgettable. Whether you’re shopping for corporate gifting, groomsmen gifts, bachelor parties, or Father’s Day, our cigar box is designed to leave a lasting impression. Each handcrafted box includes 16 premium cigars from a top cigar brand, along with a high-quality cutter and lighter—everything they need to enjoy a perfect smoke. What makes it truly special? You can customize the lid with your logo, name, date, or personal message, turning it into a keepsake that’s both stylish and meaningful. Whether you’re celebrating milestones or building client relationships, Founders’ custom cigar box delivers quality, character, and craftsmanship in every detail. Order yours today. Ask Your Local Cigar Shop for Founders Cigars​ We love when cigar enthusiasts shop local—there’s nothing like enjoying a premium cigar from your favorite hometown lounge or retailer. If your local cigar shop doesn’t carry Founders Cigars yet, ask them to! As a veteran-owned premium cigar brand, we’re proud to be featured in cigar shops across the country, and we’d be honored to be on the shelves of your favorite spot. Whether you’re looking to buy cigars locally or help introduce a top cigar brand to your community, your support helps us grow and share our passion for premium cigars with more enthusiasts like you. Find A Retailer Near You! We Believe In Supporting Veterans + Local Communities At Founders, We Support Our Veterans Cigars Donated 0 Cigars Donated 0 About Founders Cigar Company Founders began with a small group of friends who started meeting weekly for bonfires and cigars in the early days of the 2020 pandemic. At a time when the rest of the world was shut down, cigars served as a surprising catalyst for connection. Today, we’re here to provide you with premium cigars and the cigar education you’re looking for. Building stronger cigar communities Join Our Newsletter Facebook Instagram Youtube Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Shipping Return & Refund Policy Privacy Policy Warranty Policy Shipping Return & Refund Policy Privacy Policy Warranty Policy Copyright 2024 © Founders Cigar Company, LLC. Designed & Built by : Bearded Cigar Lover Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://discoverbradenton.com/business/corks-cigar-bar/",
      "text": "Discover Bradenton Directory: Cork's Cigar Bar Skip to content Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Instagram Facebook Envelope Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login send email Visit website Restaurants & Nightlife Family Owned Cork's Cigar Bar Cork’s is your hometown local pub where everyone knows your name.   Come enjoy our great Happy Hour 12 to 7 pm with $2 Select Drafts, $3 Wells, and $3.50 House Wines or step it up a try any of our Florida brews on tap.  We have a great selection of Whiskeys and Scotch to pair with one of our cigars.  We carry Rocky Patel, Joya, Oliva, Leaf by Oscar, Acid, Cohiba, Tabaks, Monte Cristo, and more. Cork’s is your bar!  We are a family-owned local bar located in Historic Downtown Bradenton of Old Main Street.  Cork and Susan Miller have owned Cork’s for 10 plus years and consider all that come in family.  We proudly support our Crew of Hernando Desoto and many other local organizations.  Cork’s is a relaxed-style pub where you can enjoy a great happy hour or order a top-shelf bourbon. Cheers and we hope you enjoy your time at Cork’s. Business Hours : 12:00 pm - 2:00 am Mon 12:00 pm - 2:00 am Tue 12:00 pm - 2:00 am Wed 12:00 pm - 2:00 am Thu 12:00 pm - 2:00 am Fri 12:00 pm - 2:00 am Sat 12:00 pm - 12:00 am Sun Closed Event associated with this business Espresso Night at Corks September 12, 2025, 7:00 pm - 1:00 am September 19, 2025, 7:00 pm - 1:00 am September 26, 2025, 7:00 pm - 1:00 am October 3, 2025, 7:00 pm - 1:00 am October 10, 2025, 7:00 pm - 1:00 am October 17, 2025, 7:00 pm - 1:00 am October 24, 2025, 7:00 pm - 1:00 am October 31, 2025, 7:00 pm - 1:00 am More Read more >> Tequila Tuesday at Corks September 16, 2025 September 23, 2025 September 30, 2025 October 7, 2025 October 14, 2025 October 21, 2025 October 28, 2025 More Read more >> Trivia Nights at Corks September 11, 2025, 10:00 am - 6:00 pm September 18, 2025, 10:00 am - 6:00 pm September 25, 2025, 10:00 am - 6:00 pm October 2, 2025, 10:00 am - 6:00 pm October 9, 2025, 10:00 am - 6:00 pm October 16, 2025, 10:00 am - 6:00 pm October 23, 2025, 10:00 am - 6:00 pm October 30, 2025, 10:00 am - 6:00 pm November 6, 2025, 10:00 am - 6:00 pm November 13, 2025, 10:00 am - 6:00 pm November 20, 2025, 10:00 am - 6:00 pm December 4, 2025, 10:00 am - 6:00 pm December 11, 2025, 10:00 am - 6:00 pm December 18, 2025, 10:00 am - 6:00 pm More Read more >> Whiskey Wednesday at Corks September 10, 2025, 12:00 pm - 10:00 pm September 17, 2025, 12:00 pm - 10:00 pm September 24, 2025, 12:00 pm - 10:00 pm October 1, 2025, 12:00 pm - 10:00 pm October 8, 2025, 12:00 pm - 10:00 pm October 15, 2025, 12:00 pm - 10:00 pm October 22, 2025, 12:00 pm - 10:00 pm October 29, 2025, 12:00 pm - 10:00 pm More Read more >> View all CONTACT (941) 744-2589 Address Old Main Street SOCIAL Facebook Instagram 2 Reviews on “Cork’s Cigar Bar” Excellent 5 2 reviews 5 4 3 2 1 Georgianna Super place to go. Feels like Cheers where everyone knows your name. ???? June 7, 2024,\n\t\t\t\t\t\t\t9:16 pm Reply Steve Fairbrother A real old fashioned family run joint where they know what you’re drinking on your second visit! Cold beer,delicious cocktails and fair prices! February 10, 2021,\n\t\t\t\t\t\t\t11:50 am Reply Leave a Review Cancel reply Your email address will not be published. Review text Select a rating Overall Name Email Website Save my name, email, and website in this browser for the next time I comment. Previous Next Images Courtesy of Pablo Ortega Photography Facebook Instagram Information 1201 6th Ave W #100, Bradenton, FL 34205 Admin@DiscoverBradenton.com Meet The Founder Disclaimer cancellation form © 2025 Discover Bradenton Terms and Conditions Privacy Policy Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.corketb.ie/",
      "text": "Home - Cork Education and Training Board Skip to content Facebook page opens in new window X page opens in new window Linkedin page opens in new window Instagram page opens in new window YouTube page opens in new window FIND A COURSE Open Mon-Fri: 8.30am - 4.30pm STAFF LINKS Search: SEARCH Cork Education and Training Board A Pathway for Every Learner t: (021) 4907100 e: info@corketb.ie Education Support for Ukraine Home Organisation Meet the Team Schools Further Education & Training (F.E.T.) Youth Services Cork ETB Arts Provision ABOUT About Cork ETB Organisation Vision, Mission & Values Board Members Procurement Corporate Governance Policies Access to Information Publications Customer Care Our Schools & Colleges Further Education and Training Campuses & Centres Associated Services RECRUITMENT Recruitment New Appointments Recruitment Policies News Publications Contact Us CORK COLLEGE OF FET Education Support for Ukraine Home Organisation Meet the Team Schools Further Education & Training (F.E.T.) Youth Services Cork ETB Arts Provision ABOUT About Cork ETB Organisation Vision, Mission & Values Board Members Procurement Corporate Governance Policies Access to Information Publications Customer Care Our Schools & Colleges Further Education and Training Campuses & Centres Associated Services RECRUITMENT Recruitment New Appointments Recruitment Policies News Publications Contact Us An overall budget of €250 million for Education and Training in Cork employer of over 3,800 staff Provider of primary, post primary, Youth Services and\nfurther education and training over 25,000 learners participating in further education & training READ MORE Cork ETB Showcase Community National Schools Community National Schools (CNSs) are state, co-educational, multi-denominational primary schools underpinned by five core values: Excellence in Education, Care, Equality, Community and Respect. CNSs are under the patronage of the local Education and Training Boards (ETBs). CNSs give equal opportunities to all children. In the communities they serve and strive to provide high quality education through respectful, positive, supportive and responsive learning environments. FIND OUT MORE Community Special Schools Cork Education and Training Board currently has four Community Special Schools: Carrigaline Community Special School Rochestown Community Special School East Cork Community Special School North Cork Community Special School FIND OUT MORE Creative Steps to Well-being Wellness means something different to everyone, so browse the following selections and click on one that best suits your needs. FIND OUT MORE A Pathway for Every Learner Cork Education and Training Board was established under the Education and Training Boards Act, 2013 and is responsible and accountable for the proper direction and control of its functions in the Cork City and Cork County Councils’ local authority areas. Cork ETB is the only statutory body in Cork with the responsibility to provide education and training across a broad range of services. FIND OUT MORE Recent News & Events May 19 2025 Cork College of FET Celebrates Staff Lifelong Learning May 19, 2025 Cork Education and Training Board (Cork ETB) has celebrated the graduation of staff members who… Read more Apr 9 2025 Cork ETB declares its adoption of the ALTITUDE Charter and joins the national Call to Action on Universal Design April 9, 2025 Cork Education and Training Board (Cork ETB) has today publicly declared its support for and… Read more Feb 9 2025 Cork College of FET- Bishopstown Campus partners with FOTA Hotel Group to develop hospitality leaders February 9, 2025 Cork College of FET- Bishopstown Campus recently celebrated the achievement graduates from its Leadership and… Read more Jan 22 2025 Cork ETB’s Davis College proudly organises DCMUN in Cork City Hall – one of the largest and most prestigious school events in the country January 22, 2025 Don’t be surprised next week when you see the streets of Cork inundated with executive… Read more Oct 25 2024 Cork College of FET Unveils Cutting-Edge Healthcare Suite to meet Cork’s Growing Skills Demand October 25, 2024 Cork College of FET – Morrison’s Island Campus welcomed Andrew Brownlee, CEO of SOLAS to… Read more Oct 25 2024 Government announces significant milestone for Cork ETB as green light given on next phase in multi-million-euro FET capital investment October 25, 2024 Minister for Further and Higher Education, Research, Innovation and Science Patrick O’Donovan TD announced the… Read more FIND OUT MORE The project is co-funded by the Government of Ireland and the European Union. Contact Us: 21 Lavitt’s Quay, Cork City, T12 HYT9. t: (021) 4907100 e: info@corketb.ie e: eolas@corketb.ie e: customercare@corketb.ie Open Mon-Fri: 8.30am – 4.30pm Registered Charity Number: 20083274 Latest from DeptofEd: An error has occurred, which probably means the feed is down. Try again later. Latest from DeptofFHed: An error has occurred, which probably means the feed is down. Try again later. © Cork Education and Training Board. All rights reserved.Website by Hopkins Communications | Cookie Policy | Privacy Policy | STAFF LINKS Go to Top Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Sitemap Sitemap English Gaeilge"
    },
    {
      "url": "https://corkwineandgrille.com/contact-us/",
      "text": "Contact Cork Wine & Grille Skip to content Gift Cards Our Safety Commitment Explore all RedWater Restaurants Menus Food Drinks Order Online Order Delivery Specials Private Dining Lockers Sticks Lounge RedWater Rewards About Login Happenings About Us Contact Us Hours & Contact Info Employment Menus Food Drinks Order Online Order Delivery Specials Private Dining Lockers Sticks Lounge RedWater Rewards About Login Happenings About Us Contact Us Hours & Contact Info Employment Order Online Come Visit Us! Address Cork Wine & Grille 1600 Galbraith Ave. SE Grand Rapids, MI 49546 Call Us Phone: ( 616) 949-0570 Hours Mon–Thur: 11 am–9 pm Fri–Sat: 11 am–10 pm Sun: 11 am–8 pm We Want to Hear from You! Choose from the following contact options. For information regarding parties or private events, select the \"Private Dining\" form below or visit our Private Dining page . - Select a Contact Form - Private Dining Information Requests Compliments or Concerns Donation Request Lost Gift Card Private Dining & Event Request Private Dining & Event Request Please note: This form is for private dining & event inquiries only. Please view the FAQ section of the Contact Us page for information about restaurant dining reservations. Name * Name First First Last Last Phone * Email * Party Size * Requested Reservation Date * Time * 12 1 2 3 4 5 6 7 8 9 10 11 : 00 15 30 45 AM PM Event Description & Other Needs * reCAPTCHA Submit If you are human, leave this field blank. Δ Contact Us Contact Us We would like to hear from you. Please send us a message by filling out the form below, and we will get back with you shortly. Name * First Last * Last Email * Subject * Message * reCAPTCHA Submit If you are human, leave this field blank. Δ Donation Request Donation Request Name of Charitable Organization * Federal Tax ID Number of Non-Profit 501(c)(3) Tax ID Number Organization's Website Event Name * Date of Event Contact Phone Number Contact Email * Date Donation is needed by Contact Address * Contact Address Contact Address Contact Address City City State/Province Alabama Alaska Arkansas Arizona California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming State/Province Zip/Postal Zip/Postal Requested Donation * Please note that not all requests can be honored. If a donation is given, it will be mailed to the address included in the donation request form. reCAPTCHA Submit If you are human, leave this field blank. Δ Lost Gift Card Lost Gift Card Name * Name First First Last Last Email * Phone Purchase Date If you do not remember the exact date of gift card purchase, a ballpark range is helpful. Confirmation Number Additional Details Please provide any additional information you believe may be helpful for us. reCAPTCHA Submit If you are human, leave this field blank. Δ Frequently Asked Questions Are reservations available? Seating at Cork is on a first-come, first-served basis only for parties of eight or fewer. If your party has eight or less people, check in at our host stand when you arrive at the restaurant, and we will be sure to get you seated and dining as soon as possible! If your party has nine or more people, please call us for reservation availability . Please note that we have limited reservations available for large parties. *Any size reservations are welcome for Valentine's Day, New Year's Eve, and our specialty holiday buffets. Do you have gift cards available? Yes, you can purchase e-gift cards and mailed gift cards online, or you can purchase gift cards in person at Cork or any other RedWater location. Our gift cards are available for use at all RedWater Restaurants, RedWater golf shops, RedWater public golf courses, and LiveGolf Studios indoor golf simulator facilities. View complete information and purchase a gift card online. How do I view the balance on my gift card? You can check your gift card balance online here . How do I book a private event? Cork has multiple private rooms available, as well as several options available to the public. You can get more information about hosting events with us on our Private Dining page or complete the Private Dining form above. Simply provide some information about your event, and a Cork or RedWater Events manager will get in touch with you about booking your gathering. Do you offer takeout? Yes, takeout is available at our restaurant. For your convenience, you can place your takeout order on our website. We also accept takeout orders over the phone. If you would like to pay for your takeout order with a gift card or a Golf Club member number, please call the restaurant to place your order, as these payment options are not currently available through online ordering. Takeout service may be unavailable when Cork is extremely busy so we can remain focused on the service of our dine-in guests. Does Cork offer vegetarian options? Yes, Cork offers several vegetarian dishes that are denoted on our menu. (Please note that items denoted as vegetarian may contain eggs and dairy.) Many of our other dishes can be modified to be vegetarian. Our chefs are always happy to prepare customized dishes for guests upon request, so talk with your server about additional options for your specific dietary needs. Does Cork offer gluten-free options? Yes, Cork offers several items made without gluten-containing ingredients, and denoted on our menus. However, our kitchen is not a gluten-free environment, so it is possible these menu items could come into contact with gluten during preparation. If you’re highly sensitive to gluten, please let your server know upon being seated. How does Cork accommodate specific allergy requirements? Our chefs are always happy to prepare customized dishes for guests upon request, so talk with your server about your specific dietary needs. If you’re allergic or highly sensitive to any ingredient, please let your server know upon being seated. What is the dress code at Cork? Come as you are! Cork does not have a required dress code. We pride ourselves on a relaxed, casual atmosphere. Do you allow dogs at Cork? Although we love furry friends, only service dogs are allowed in our restaurant and on our patio. What are your holiday hours? Our holiday hours vary depending on the holiday. Cork is closed on Christmas and New Year’s day to allow our team to spend time with family and friends. Please note that Cork may close early on holidays or days before holidays at the discretion of the management team. Please call to ensure we are open if you are planning to visit us close to closing time on those days. Do you offer catering? At RedWater Restaurants, our primary focus is on in-restaurant dining. However, we do offer some limited catering options that can be found on our RedWater Events website . Please contact our RedWater Events team for more information. Do you have loyalty rewards? Join RedWater Rewards for exclusive discounts and monthly deals at Cork, as well as RedWater's 8 other restaurants around West Michigan! For only $59 per year, enjoy VIP-only monthly deals. Visit the RedWater Rewards page of our website for more information or to sign up. What safety measures do you take in your restaurants? The health and safety of our guests and team members is always our top priority. In addition to our participation in the ServSafe Dining Commitment, we are in constant contact with our local health departments to ensure that we provide a safe environment for our guests and staff. Learn more about our commitment to safety. What if my question isn’t answered here? You can view more frequently asked questions and their answers on our RedWater Restaurants website or complete the Information Request form above to contact our team at Cork. Join Our Team Cork holds a special place in the heart of the RedWater family as its first restaurant. Join us in continuing the tradition of exceptional service and remarkable meals! Whether you’re looking for a part-time job or a career in the hospitality industry, there is no better team to join than RedWater. RedWater Benefits Positive, team-oriented workplace with great growth opportunities Flexible scheduling with both part-time and full-time positions Competitive compensation Employee Stock Ownership Plan for eligible employees Healthcare benefits for full-time employees Discounts at all RedWater restaurants RedWater Fitness discounts Discounted golf at select RedWater golf clubs Inquire for full details about RedWater's employee benefits. Apply Now Mon–Thur: 11 am–9 pm Fri–Sat: 11 am–10 pm Sun: 11 am–8 pm 1600 Galbraith Ave. SE, Grand Rapids, MI 49546 (616) 949-0570 Subscribe to Our Newsletter Be the first to know about events, specials, and so much more. You are going to love it! Subscribe Now Visit Our Restaurant Family Menus Food Drinks Order Online Order Delivery Specials Private Dining Lockers Sticks Lounge RedWater Rewards About Login Happenings About Us Contact Us Hours & Contact Info Employment 0 Item | $ 0.00 View Cart Purchase ALL 2025 tickets online now! Purchase Tickets Here!"
    },
    {
      "url": "https://corkboardconcepts.com/",
      "text": "Data Driven Marketing Agency // Boost Your Marketing Efforts X  Home  Services Creative Services Search Engine Visibility Social Media Engagement Programmatic Advertising Data and Analytics Media Placement  About Us  Our Team  Join Our Team  Articles  Contact Us Search for:  412-736-5441  digital@corkboardconcepts.com Follow Follow Follow Follow Partner with one of the fastest growing marketing agencies in America Get Started Every Great Busi _ Begins As A Concept Marketing Services Thoughtful Leadership Industry Results Get Advertising Support A Marketing Agency Enabled By Data At Corkboard Concepts, we are a data driven marketing agency – where strategic planning, creativity and data-centricity converge to support calculated business growth. We deliver high-performing, outcome-focused marketing campaigns. A Marketing Agency Enabled By Their Team At Corkboard Concepts, our team is comprised of motivated individuals that are professionals across strategy, advertising, creativity, data analytics and more. Our personalized approach and interaction is one of our strongest success factors. A Marketing Agency Enabled By You Our success is dictated by that of our partners. Simply put, we succeed when you succeed, whether that’s building a better brand, driving inquiries or building sales – we’re in it for your success.  Learn More  Our Team  Begin My Organization Needs To Attract More Customers STRATEGIC MARKETING PLAN See how a Corkboard Concepts Strategic marketing plan can support your business or organization’s growth. Learn More My Organization Needs To Develop Brand And Marketing Collateral CREATIVE SERVICES Put a face to your company through marketing material and make a lasting impression. Consistent messaging through branding build business value. Learn More My Organization Needs To Become More Relevant And Visible SEARCH ENGINE VISIBILITY Service, product and business discovery through search engines is one of the leading forms of business growth. Prominence on search engines has a direct correlation to business growth. Learn More My Organization Needs To Better Connect And Engage SOCIAL MEDIA ENGAGEMENT Social media platforms are some of the fastest growing media outlets for nearly all segments. Position your organization in front of an engaged audience in a way that attracts attention. Learn More My Organization Needs To Efficiently Break Through To A Niche Audience PROGRAMMATIC ADVERTISING Utilizing digital breadcrumbs, data tracks and online user behaviors to effectively reach your target market in a way that reduces ad waste, while increasing effectiveness. Learn More My Organization Needs To Better Understand Customers‘ Needs And Behaviors DATA AND ANALYTICS Data surrounds your business. Nearly every interaction with customers, whether online or offline, leaves a data trail. See how you can learn from the data at hand and employ it to better reach your business goals. Learn More My Organization Needs To Promote Awareness And Generate Demand Efficiently MEDIA PLACEMENT Media buying, unified. Connected media placement in one area helps support your business with more effective media placements and reporting. Learn More STRATEGIC MARKETING PLAN CREATIVE SERVICES SEARCH ENGINE VISIBILITY SOCIAL MEDIA ENGAGEMENT PROGRAMMATIC ADVERTISING DATA AND ANALYTICS MEDIA PLACEMENT < > Success Stories Industry: Non-Profit Challenge: Securing a website for various needs and a way to boost awareness and ticket reservations for the exhibit. Solution: A custom website and robust digital ad campaign to engage consumers. Results: The custom website streamlined inquiries, event listings, and ticket reservations, while the ad campaign increased awareness and ticket sales, and organic social media content made deep connections with the Pittsburgh audience. Read More Success Stories Industry: Automotive Challenge: Growing awareness and attendance coming out of COVID-19. Solution: Develop a social media and content strategy designed to increase engagement while educating consumers. Promoting the Auto Show through paid media and directing traffic back to the website for ticket purchases. Results: Increased the Auto Show’s fan base and brand recognition. Provided greater visibility for sponsors, partners, and participating manufacturers/vendors. Read More Success Stories Industry: Privately Owned Landscape Company Challenge: Revamp existing website to bring up to date and create informative content to position Eichenlaub as the premier source for information and service, along with boosting SEO. Solution: A new site was built on WP utilizing some existing assets, but a major push was put forth to photograph a number of key properties, projects, facility and staff as well as create ads and gather video assets and blogs. Results: A more upscale look that matches the quality of work the company does as well as insight into what it is like to work for Eichenlaub. Read More Success Stories Industry: Professional Sports Challenge Challenge: Establish the new team’s brand online in a way that positions itself and the new league professionally. Solution: Creating an aggressive social media and content strategy, while promoting the brand through paid media and connecting multiple channels back to the website. Results: A rapidly growing fan base with strong brand recognition. Read More Success Stories Industry: Religious Organization, Digital Agency Challenge: Quickly build and launch a website that could sustain high concurrent traffic and allow for church services to be help online, seamlessly. Solution: WordPress-built website launched on WP Engine’s Premium Platform, equipped with dedicated architecture and real-time traffic monitoring. Results: A rapidly-deployed digital experience that looks better, loads faster, and hasn’t dropped a single visitor request. Read More Success Stories Industry: Healthcare Challenge: Preventing fraud Solution: Enabling multiple steps for added bot/spam security. Results: Saved a health for advertiser over $1 Million, that was used to generate more efficient patient bookings. Read More Success Stories Industry: Automotive Challenge: Replace an automotive dealership’s current monthly digital marketing campaigns administered through a dealer preferred vendor (100% co-op reimbursed), and provide them with a more efficient and effective campaign through our agency (50% co-op reimbursed). Solution: Provide the dealership with a lift more than 50% with the same or less budget than they used with the dealer preferred vendor. Results: Dealership decreased monthly budget towards digital advertising after switching to Corkboard Concepts, saw increases well over 50%, and was able to use co-op dollars for other efforts, while seeing record breaking sales months. Read More Success Stories Industry: Pet Care Challenge: Understand the actions that generated value on their website, identify\u0003their current conversion rate, and increase conversion rate by establishing optimization strategies. Solution: Added a quick form to capture “New Client Signups” to give us the foundation for conversions looked at Google Ads keyword optimization, refined display ad targeting, and set up drip campaigns and event based triggers. Results: A 100% increase in conversion rate and established conversion\u0003rate optimization. Read More Join Our Newsletter Stay up to date with the latest news and updates by joining our newsletter! Join Now Results by Vertical Automotive 13.5% CONV. RATE ACROSS DEALERSHIPS HEALTHCARE 134k CONVERSIONS NATIONALLY POWERSPORTS 2000+ VISITS DRIVEN TO STORES FRANCHISES 17% CONVERSION RATE SUPPORTED OTHER -10% LOWER AVG. CPA ACROSS CAMPAIGNS Automotive 13.5% CONV. RATE ACROSS DEALERSHIPS POWERSPORTS 2000+ VISITS DRIVEN TO STORES OTHER -10% LOWER AVG. CPA ACROSS CAMPAIGNS HEALTHCARE 134k CONVERSIONS NATIONALLY FRANCHISES 17% CONVERSIONS RATE SUPPORTED Our Clients  Contact Us $ Get In Touch With Us Whether you choose to drop us a line, call us or reach out on social media, we‘ll make sure to get right back to you! Name Email (Required) Phone (Required) Message CAPTCHA Email This field is for validation purposes and should be left unchanged. Contact  3700 Butler Street, Pittsburgh, PA 15201  412-736-5441  digital@corkboardconcepts.com Follow Us On Social Media Follow Follow Follow Follow Chat With Tack Chat With Tack Articles Tailoring Your SEO Strategy for AI Optimization: A Practical Guide for Implementing an AEO Strategy Mastering the Instagram Algorithm: Tips for Organic Reach in 2025 What does PPC mean? 4 Ways SEO and Web Design Go Together A Guide To Successful A/B Testing With VWO The Ultimate Mobile SEO Checklist UI/UX Design Strategies that Work Measuring Success: Key Email Marketing Metrics to Track in Your Campaigns Designing for Engagement: Top Elements for Interactive Web Design What is Geotargeting? Maximize Your Holiday Advertising Strategy: 5 Tips for Successful Campaigns Corkboard Concepts Gets an Office Upgrade at the Energy Innovation Center What is a Landing Page? Avoiding Common Mistakes in Social Media Advertising A Guide to the Facebook Commerce Manager Unlocking the Full Potential of Google Ads Performance Max Campaigns SEO Trends To Watch In 2025 Corkboard Concepts Ranks No. 3748 on the 2024 Inc. 5000 7 Web Design and Development Don’ts to Avoid That Can Make or Break Your Website Capturing Your Brand: The Power of Photography in Marketing See All Articles https://www.encartnoticias.com https://lebornecoaching.com https://op77link.com OP77 OP77 https://op77.online https://www.dannsair.com https://ukfolk.com War138 War138 Dog69 https://dog69pro.com Gerakan99 https://culturalhistoryoftheinternet.com https://www.dfow.net Jawa Togel Sbobet88 Hack Slot https://emas.imgix.net/slot88.html https://macau.imgix.net/totomacau.html https://aplikasi.imgix.net/daftarjudi.html https://robo.imgix.net/robopragma.html https://datahk.imgix.net/datahk.html https://cheatengine.imgix.net/cheatslot.html https://peringkat.imgix.net/toto4d.html Dog69 War138 OP77 https://raja.imgix.net/dog69.html https://raja.imgix.net/war138.html https://raja.imgix.net/op77.html OP77 Server Thailand Slot terbaru Scatter Hitam demo slot pg soft jawa togel slot server thailand super gacor robot dewa hack robot biru hack lapak cheat iblis merah hack jackpot besar mahjong ways perihoki perihoki slot demo x1000 rtp slot gacor sabung ayam sv88 perihoki slot777 login CALL NOW GET A FREE STRATEGY CALL Links Home Services About Us Our Team Join Our Team Articles Privacy Policy Services Strategic Marketing Plan Creative Design Services Social Media Engagement Search Engine Visibility Programmatic Advertising Data & Analytics Services Media Placement Contact  1435 Bedford Ave Suite 132A Pittsburgh, PA 15219  412-736-5441  digital@corkboardconcepts.com Follow Follow Follow Follow Get Answers From Tack © Corkboard Concepts | Privacy Policy | XML Sitemap"
    },
    {
      "url": "https://cianoart.com/contact-ciano-art/",
      "text": "Contact Ciano Art – Reach Out for Enquiries or Commissions Home About Me Artist Statement Blog Collected Works Archive Originals Available Catalogue Contact Select Page Contact Ciano Art Have a question or want to connect about a specific piece? Use the form below to contact Ciano Art directly. Send a Message to Ciano Art Name Email Address Message Submit Why Contact Ciano Art? Whether you’re a collector interested in bold original abstract art or a gallery seeking fresh contemporary work, contacting Ciano Art connects you directly with the artist behind emotionally resonant and thought-provoking pieces. Ciano’s large-scale artworks are known for their raw energy, layered symbolism, and rebellious visual language — ideal for those who value originality and expression. Ciano has exhibited in Cork and beyond, and works with collectors and professionals across Ireland and internationally. Every enquiry is handled personally and with care, whether you’re asking about an available piece, need guidance choosing the right artwork for your space, or want to learn more about upcoming exhibitions. Follow the Creative Process To see what happens behind the scenes — including new work, studio updates, and works-in-progress — follow Ciano Art on Instagram. It’s a great way to stay connected and see new pieces as they emerge. Learn More About the Artist If you’d like to better understand the creative influences and journey behind Ciano Art, you can also read the artist statement here . It offers insight into the philosophy and evolution of the work. Final Note Whether your message is about acquiring artwork, featuring it in an exhibition, or simply connecting — don’t hesitate to reach out. Contact Ciano Art today and start the conversation. Prefer to reach out via social? Connect with me below. Follow Follow Follow Follow Ciano is an Irish visual artist based in Cork. EXPLORE Originals All Works Contact INFO About Me Artist Statement Blog Collected Works Archive CONNECT: For inquiries: info@cianoart.com Follow Follow Follow Follow © Ciano Art 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent WhatsApp me"
    }
  ]
}