{
  "fuentes": [
    {
      "url": "https://www.bloomberg.com/profile/company/0198470Z:US",
      "email": "inquiry1@bloomberg.net"
    },
    {
      "url": "https://www.globenewswire.com/news-release/2023/03/28/2635867/0/en/El-Septimo-Expands-its-Direct-Sales-Force-Team.html",
      "email": "ayounan@younancompany.com"
    },
    {
      "url": "https://www.coronacigar.com/Corona-Cigar-Stores-Are-Your-Passport-to-the-Ultimate-Cigar-Experience/3264/",
      "email": "bcdev@beapartof.com"
    }
  ],
  "mails": [
    "ayounan@younancompany.com",
    "bcdev@beapartof.com",
    "inquiry1@bloomberg.net"
  ],
  "nombre_sitio": "coronacigar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bloomberg.com/profile/company/0198470Z:US",
      "text": "Corona Cigar Co - Company Profile and News - Bloomberg Markets Skip To Content Skip to content Bloomberg the Company & Its Products The Company & its Products Bloomberg Terminal Demo Request Bloomberg Anywhere Remote Login Bloomberg Anywhere Login Bloomberg Customer Support Customer Support Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Products and Account Information Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Company About Careers Inclusion at Bloomberg Tech at Bloomberg Philanthropy Sustainability Bloomberg Beta Communications Press Announcements Press Contacts Follow Facebook Instagram LinkedIn YouTube Products Bloomberg Terminal Data Trading Risk Compliance Indices Industry Products Bloomberg Law Bloomberg Tax Bloomberg Government BloombergNEF Media Bloomberg Markets Bloomberg Technology Bloomberg Pursuits Bloomberg Politics Bloomberg Opinion Bloomberg Businessweek Bloomberg Live Conferences Bloomberg Radio Bloomberg Television News Bureaus Media Services Bloomberg Media Distribution Advertising Bloomberg Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world For Customers Bloomberg Anywhere Remote Login Software Updates Manage Contracts and Orders Support Americas +1 212 318 2000 EMEA +44 20 7330 7500 Asia Pacific +65 6212 1000 Quick Links Stocks Currencies Commodities Rates & Bonds Sectors Watchlist Recently Viewed Companies Corona Cigar Co Corona Cigar Company operates as a virtual cigar store.  The Company offers services in areas of cigar gift ideas, flavored cigars, humidors, clearance cigars, cigar samplers, cigar seconds, xikar accessories, and information regarding cigar rights of America."
    },
    {
      "url": "https://www.globenewswire.com/news-release/2023/03/28/2635867/0/en/El-Septimo-Expands-its-Direct-Sales-Force-Team.html",
      "text": "El Septimo Expands its Direct Sales Force Team Accessibility: Skip TopNav El Septimo Expands its Direct Sales Force Team Franklin Kleckner Leaves Rocky Patel to Join El Septimo Cigars March 28, 2023 10:00 ET | Source: El Septimo Geneva El Septimo Geneva Los Angeles, CA, March  28, 2023  (GLOBE NEWSWIRE) -- El Septimo has hired seasoned Sales Executive, Franklin Kleckner, to support its continuous sales growth and expansion throughout US retail centers. Franklin Kleckner will be joining El Septimo beginning on April 3, 2023 as Sales Manager of the Eastern Seaboard. His territories will include South Carolina, North Carolina, Virginia, D.C., West Virginia, Maryland, Delaware, Pennsylvania, New Jersey, and New York. Franklin has a Bachelor of Science degree in Business Marketing from George Mason University in Virginia and has spent the past 6 years working for Rocky Patel Cigars as a Head Trainer and Regional Sales Manager in Virginia and the Carolinas. Zaya Younan, CEO of El Septimo Cigars, says, “We continue to grow globally by taking market share from all leading cigar companies, and in preparation for this continuous growth, we need to expand our direct sales force team to better service our retailers” Franklin Kleckner adds, “I’m thrilled to be joining El Septimo, a company that is reinventing the industry and producing cigars that everyone is talking about. It is very difficult to smoke any other cigar once you’ve had an El Septimo. Not only are their cigars and accessories world-class, but their growth is something that I have never seen before. After experiencing the unique layers of complexity and refinement that El Septimo cigars have to offer, I knew I had to go on this journey with El Septimo and I’m excited to share this experience with enthusiasts across the Eastern Seaboard.” Younan finishes, “We welcome Franklin Kleckner to our team and are looking forward to his contributions towards this luxury brand of cigars and accessories. We will be announcing other hires, as we believe 2023 will be our biggest growth year yet.” El Septimo is continuing to look for industry veterans experienced in the areas of sales, customer service, marketing, and production management. About Younan Company Younan Company is a global private equity firm that specializes in acquisitions and management of various assets and companies in the luxury consumer space. The company’s strategy is to build a portfolio of luxury products and properties, and lifestyle companies and services. Today, Younan Company is recognized as a global luxury brand with more than $4.8 billion in assets under management through its Younan Properties and La Maison Younan . La Maison Younan owns and manages luxury hotels and resorts in France and Portugal, including Château de Beauvois , Hôtel Saint-Martin, Château Le Prieuré, Alexandra Palace, Domaine de Vaugouard, and Château de la Perrière, as well as Malibu Foz Hotel and Beach Resort located in Figueira da Foz, Portugal, four French golf courses including Golf des Forges , Golf du Petit Chêne , Golf d ’Avrillé, and Golf de Vaugouard, two vineyards in Saint-Émilion including Château La Croix Younan and Château Zaya , El Septimo Premium Cigars & 7 Global Distribution Tobacco Wholesale, and MPA Studio de Création Design Agency in Paris. Attachment Franklin Kleckner Leaves Rocky Patel to Join El Septimo Cigars Franklin Kleckner Leaves Rocky Patel to Join El Septimo Cigars El Septimo has hired seasoned Sales Executive, Franklin Kleckner, to support its continuous sales gr... Tags zayayounan elseptimocigars elseptimogeneva rockypatel younancompany Related Links El Septimo Website Younan Company Website Contact Data Alexandra Younan\nEl Septimo Geneva\n8187039600\nAYounan@younancompany.com Contact close Contact With a Reader Account, it's easy to send email directly to the contact for this release. Sign up today for your free Reader Account! Already have an account? Log in here. Recommended Reading August 14, 2025 10:00 ET | Source: El Septimo Geneva El Septimo Defies Global Tariff Pressure, Refuses to Raise Prices — Luxury Without Compromise Los Angeles, CA, Aug.  14, 2025  (GLOBE NEWSWIRE) -- In a bold move that sets a new standard for the luxury cigar industry, El Septimo, the world’s most luxurious cigar brand, has announced it will... Read More July 17, 2025 14:16 ET | Source: El Septimo Geneva Steve Harvey Joins Zaya Younan on The George Janko Show, Enjoying El Septimo’s Bordeaux France Cigar Los Angeles, CA, July  17, 2025  (GLOBE NEWSWIRE) -- El Septimo Cigars, a global luxury cigar brand known for its unparalleled craftsmanship and innovation, proudly announces the latest spotlight... Read More"
    },
    {
      "url": "https://www.coronacigar.com/Corona-Cigar-Stores-Are-Your-Passport-to-the-Ultimate-Cigar-Experience/3264/",
      "text": "Corona Cigar Stores Are Your Passport to the Ultimate Cigar Experience - Corona Cigar Co. FREE SHIPPING on orders $125+ Skip to main content Toggle menu Compare Search Keyword: Search About Us Call: 1-888-702-4427 Sign in or Register Cart Toggle menu Search Search Brands Cigars Categories Cigar Bundles Cigar Five Packs Cigar Gift Sets Cigar Packs Cigar Samplers Cigar Tins Cigars of the Month Clearance Cigars Corona Cigar Co. Flavored Cigars Limited Cigars Collector's Choice New Cigars Now Trending Pipe Tobacco Shop by Price $50 and Under $50 to $150 $150 to $250 $250 and Up Shop by Strength Mild Mild to Medium Medium Medium to Full Full Flavored Shop by Origin Bahamas Costa Rica Dominican Republic Honduras Mexico Nicaragua United States Shop by Wrapper Cameroon Connecticut Corojo Ecuadorian Habano Maduro Natural Nicaraguan Sumatra Sun Grown Cigar Fan Favorites Bar Menu Cigar Blog Cigar Deals Cigars of the Month Club Members Only Corona Cigar Catalog Corona Cigar Swag Corona Cigar Top Cigars of 2024 Corona Gift Card Email Sign Up Embers Only Monthly Sweepstakes Rewards Program Tasting Packages Top 25 Cigar Brands Gold Standard Humidors Humidor Type Large Humidors (100+ Capacity) Medium Humidors (50-100 Capacity) Small Humidors (1-50 Capacity) Travel Humidors Cigar Cases Humidor Brands Brizard & Co Davidoff Humidors Diamond Crown St. James Humidors El Septimo Quality Importers Trading Company Humidors by Price $50 and Under $50 to $150 $150 to $250 $250 to $500 $500 and Up Humidor Accessories Humidifiers Hygrometers Accessories Lighters Torch Lighters Double Torch Lighters Triple Torch Lighters Quad Torch Lighters Soft Flame Lighters Tabletop Lighters Cigar Lighters Arturo Fuente Lighters Corona Cigar Co. Lighters JetLine Lighters Prometheus Lighters ST Dupont Lighters Xikar Lighters Cutters Brizard & Co Trilogy Punch Cutters Guillotine Cutters Punch Cutters V-Cutters Cigar Cutters Xikar Cutters ST Dupont Cutters Les Fines Lames Cutters Zino Cutters Arturo Fuente Cutters Palio Cutters Corona Cigar Co. Cutters Colibri Cutters Ashtrays Cigar Ashtrays Diamond Crown Ashtrays Aaron Thomas Collection Ashtrays Arturo Fuente Ashtrays Corona Cigar Co. Ashtrays Davidoff Ashtrays El Septimo Ashtrays Padron Ashtrays Quality Importers Apparel Hats Shirts Other Accessories Campfire Mugs Candles Cigar Cases FSG Air Fresheners FSG Seasoning Sprays Stickers Cigar Deals Reviews Events Sign in or Register Search Keyword: Search Home Blog Corona Cigar Stores Are Your Passport to the Ultimate Cigar Experience Corona Cigar Stores Are Your Passport to the Ultimate Cigar Experience Posted by Corona Cigar Co. on Nov 2 2016 Corona Cigar Stores Are Your Passport to the Ultimate Cigar Experience Passing through the aroma of a fresh lit cigar elicits images of the lively Cuban cantina, late summer nights dancing on the hotel patio in Argentina, a glass of local port and hours of the most delicious conversation on a sidewalk cafe in Santiago. A cigar is more than an elegant way to smoke, it is the experience nonpareil. But how can you get the full bodied experience of the best cigar without a passport? At Corona Cigar , our cigar stores are your passport to experiencing cigars like never before. Selection The Corona Cigar Stores in Florida boast the largest selection in the country. With over 2 million cigars in stock there we are sure to have exactly what you are looking for. We carry cigars from over a dozen different countries in thousands of different brands. And for the aficionado who wants the real deal, we have a selection of vintage pre-embargo Cuban cigars. Atmosphere No phony sales pitches here, at this cigar lounge we want you to enjoy every minute. The minute you walk through the door you are whisked away to exotic locations with Latin music, Central American decor, authentic Nicaraguan furniture and that familiar, romantic aroma... Destination Camaraderie is essential to enjoying the finest cigars. A \"gentlemen's night\" is complete with vintage port and wine selections, great cigars and the best conversation. A cigar lounge is a social destination where you can relax and imbibe the joie de vivre. And don't forget the chance to rub shoulders with some of the most famous names in cigars - from Rocky Patel, Jonathan Drew, Marvin Samel, Steve Saka, Christian Eiroa, Nick Perdomo Jr., Don Pepin, Eric & Bobby Newman, and more. To get the latest news on upcoming events at our cigar lounges, and the best deals on your favorite cigars, contact us today! Facebook Twitter Close × OK Instagram Follow us @coronacigarco The Ultimate Cigar Experience. Cigar Superstores & Cigar Bars. Online Cigars & Accessories. Exclusive Grower of FSG Tobacco and FSG Beef. #CoronaCigar Stay ahead of the crowd Sign up for our emails and get $5 OFF your next order! You’ll also receive amazing cigar deals, exclusive offers, and much more! Footer Start Contact Us 1-888-70-CIGAR Locations Age Verification Monthly Sweepstakes Gift Cards Request a Catalog Reviews Cigar Rolling Events Customer Service Account Privacy Policy Return Policy Shipping Policy Price Match Guarantee Careers Rewards Program Coupon Exclusions Follow Us Please note that Corona Cigar Co. does not sell tobacco products to anyone under the age of 21. If you are under the age of 21, please do not enter our site. For more information on how we verify age click here . All prices are subject to change without notice. Copyright 2025 Corona Cigar Co. All Rights Reserved. Tap to Call Contact Us"
    }
  ]
}