{
  "fuentes": [
    {
      "url": "https://floridabrewstravelers.substack.com/p/crafting-community-and-flavor-the",
      "email": "info@coteeriverbrewing.com"
    },
    {
      "url": "https://coteeriverbrewing.com/captains-club",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://coteeriverbrewing.com/our-story",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "email": "facebook@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "email": "instagram@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "email": "linkedin@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "email": "twitter@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "email": "youtube@2x.png"
    },
    {
      "url": "https://coteeriverbrewing.com/faqs",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://coteeriverbrewing.com/faqs",
      "email": "info@coteeriverbrewing.com"
    },
    {
      "url": "https://coteeriverbrewing.com/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "facebook@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "info@ryeriverbrewingco.com"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "instagram@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "linkedin@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "twitter@2x.png"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "email": "youtube@2x.png"
    },
    {
      "url": "https://coteeriverbrewing.com/contact-us",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://coteeriverbrewing.com/contact-us",
      "email": "info@coteeriverbrewing.com"
    }
  ],
  "mails": [
    "eben@eyebytes.com",
    "facebook@2x.png",
    "info@coteeriverbrewing.com",
    "info@ryeriverbrewingco.com",
    "instagram@2x.png",
    "linkedin@2x.png",
    "twitter@2x.png",
    "youtube@2x.png"
  ],
  "nombre_sitio": "coteeriverbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://floridabrewstravelers.substack.com/p/crafting-community-and-flavor-the",
      "text": "Crafting Community and Flavor: The Story of Cotee River Brewing Company Subscribe Sign in Crafting Community and Flavor: The Story of Cotee River Brewing Company A Journey Through Fresh Brews, Historic Roots, and Vibrant Atmosphere in Downtown New Port Richey Alexander Snitker Feb 23, 2024 1 Share How did Cotee River Brewing Company start? In the heart of historic downtown New Port Richey, Bryan Hackman alongside his wife, Kelly, embarked on a journey to unveil the Cotee River Brewing Company in July 2018. Fueled by a passion for craft beer and a desire to contribute to the rejuvenation and tourism of his beloved hometown, Bryan ventured into the brewery business, inviting locals and visitors alike to experience the charm of downtown through the unique flavors of his freshly brewed beer. Marking a milestone as the inaugural brewery in New Port Richey, Cotee River Brewing Company prides itself on its artisanal approach to beer-making. Operating with a 3-barrel brewing system, the brewery is committed to producing small, carefully crafted batches, ensuring the utmost freshness and quality for their patrons. Thanks for reading Florida Brews Travelers! Subscribe for free to receive new posts and support my work. Subscribe Nestled in the same building, the brewery's taproom offers a rare glimpse behind the scenes, allowing guests to observe the brewing process firsthand while savoring a pint of their latest creation. The brewers at Cotee River are not just passionate about their craft; they're also eager to engage with visitors, sharing insights into their brewing techniques and welcoming curious minds to explore the art of beer-making. Situated amidst the historic backdrop of downtown New Port Richey, the taproom pays homage to the storied Pithlachascotee (or Cotee) River, with vintage photographs adorning the walls, inviting guests to take a visual journey through the river's rich past. The interior design strikes a balance between rustic elegance and industrial chic, featuring a harmonious blend of wood and metal that echoes the natural beauty of the river. Crafting Community and Flavor: The Story of Cotee River Brewing Company Cotee River Brewing Company is exactly the brewery downtown New Port Richey needed! Featuring fresh beer brewed on site, as well as beers from other Florida breweries, this establishment offers a great hometown vibe and a wide selection of craft beers. The brewery has 6-10 taps of its original and locally made brews at all times, including popular styles like IPA, Pale Ale, Red Ale, Blonde, Porter, Stout, and Wheat beers. The atmosphere at Cotee River Brewing is top-notch, with a happening vibe on the weekends and a welcoming, family-friendly environment. The service is exceptional, with friendly staff and owners who truly care about their customers. The owners are extremely hospitable and go out of their way to ensure a great experience for everyone. In addition to their fantastic beer selection, Cotee River Brewing also offers two house sangrias made with wine from the award-winning Aspirations Winery. While the brewery doesn't serve food, they provide menus from local restaurants and allow patrons to bring their own food. The prices are reasonable, with beers averaging around $7 each. The taproom transforms into a vibrant hub of music and camaraderie every Friday and Saturday evening, with local musicians performing on a small stage. This adds to the warm and inviting atmosphere that has made Cotee River Brewing a beloved gathering spot for beer enthusiasts and history buffs alike. Overall, Cotee River Brewing Company is a great bar with amazing bartenders, a fantastic beer selection, and a lively atmosphere. Whether you're a beer aficionado or just looking for a fun night out, this brewery is a must-visit in downtown New Port Richey. Highly recommended! What about the Beer? 23 Mile IPA: This IPA offers a nice balance of sweet tropical flavors and hop bitterness that doesn't linger. It's clean, crisp, and refreshing, making it a delightful choice for IPA enthusiasts. River's Bend Irish Red: A mellow Irish Red Ale with light color and floral notes from honey, providing a slight sweetness on the finish. The combination of toasted malt, caramel, and local honey creates a pleasant and balanced flavor profile. Cotee River Light Blonde: A light and crisp Blonde Ale that is perfect for those who enjoy lighter beer options. This Blonde Ale is easy-drinking and offers a refreshing experience for all beer enthusiasts. Blueberry Blonde: Fresh blueberry flavors complement the light and enjoyable Blonde Ale, creating a perfect summer beer. The blueberry addition adds a nice touch without overpowering the beer, making it a delightful choice for those looking for a fruity twist. Strawberry Blonde Ale: This Blonde Ale features a juicy strawberry flavor that harmonizes with the light ale, creating a versatile beer suitable for any time of the year. The prominent essence of strawberry adds a refreshing and flavorful element to this well-crafted brew. Where are they, When are they open and how can you contact them? Cotee River Brewing Company is located at 5760 Main Street, New Port Richey, Florida 34652 . You can contact them via phone at ( 727) 807-6806 or email them at info@coteeriverbrewing.com . For a comprehensive overview of their offerings and upcoming events CLICK HERE to visit their website. The brewery operates Tuesday through Thursday from 4:00 pm to 10:00 pm, Friday from 4:00 pm to 11:00 pm, Saturday from 12:00 pm to 11:00 pm and Sunday from 12:00 pm to 8:00 pm. Thanks for reading Florida Brews Travelers! Subscribe for free to receive new posts and support my work. Subscribe 1 Share Discussion about this post Comments Restacks Top Latest Discussions No posts Ready for more? Subscribe © 2025 Alexander Snitker Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts"
    },
    {
      "url": "https://coteeriverbrewing.com/captains-club",
      "text": "Captains Club Life is Better at the River.  Cotee River Brewing Company, New Port Richey's Original Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US More Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Ahoy Mates! Captains Club - $250 Annual Membership Our Captains Club is geared toward someone who believes in our brewery and our mission to produce high quality local beer.  They recognize the hard work it takes to produce this kind of craft and want to enjoy our brews on a regular  basis. Captains Club Members want to see the brewery continue to be successful for the benefit of our community and want to enjoy refreshing, local, and unique craft beer. Captains Club memberships are accepted annually, beginning on July 1st, based on membership availability.  The Captains Club is limited to 50 members annually. Captains Club memberships run from July - June and start renewals in June each year.  Memberships must be paid in full by June 30th to continue benefits.  Members who do not renew by June 30th will forfeit their membership and will have to wait until a space becomes available to rejoin. *Must be 21 to join Captains Club.  Photo ID required. Become a Member Member Benefits Captains Club Member Benefits\rBenefits include but are not limited to: Receive two free “Core Beer” on us each month .   \rThis means you can stop by two times   throughout the month and have your first beer on us, completely complimentary!\r (Member must show membership card and valid photo ID to receive free Core Beer). \r* Cotee River Brewing Company will host a minimum of five (5) “Core Beers” year-round.  These beers will be available for Captains Club members.  Any seasonal or special release beers, or guest taps will be served at normal prices. $1 off each house beer (exclusive only for Captains Club members, not extended to guests of Captains Club member). 10% off growler fills (select craft beers available for growler fills.  See brewery staff for available beers). 10% off all brewery exclusive merchandise . Captains Club members only gathering (minimum one event annually) Special behind the scenes, one on one tours and tastings. Perfect for when you have guests with you who want to know more about your favorite brewery.  \r(Must be arranged in advance by calling the brewery). Discounts on Cotee River Brewing Company Special Event tickets. Become a Member Captains Club Brochure Download PDF Copyright © 2025 Cotee River Brewing Company - All Rights Reserved. Powered by E-Gift Cards"
    },
    {
      "url": "https://coteeriverbrewing.com/our-story",
      "text": "Our Story Life is Better at the River.  Cotee River Brewing Company, New Port Richey's Original Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US More Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US About Us For the Love of Beer! Bryan Hackman is the owner of Cotee River Brewing Company in historic downtown New Port Richey.  An avid beer lover, Hackman decided to open his own brewery in his hometown in 2018. Hackman has enjoyed learning about beer over the past 15 years and when an opportunity presented itself to open the first brewery in his town, he jumped at the chance to make a lasting impression for visitors and residents alike. What began as a homebrewing passion quickly developed into a desire to create delicious and unique beverages for groups beyond is friends and family. He watched as his hometown started to transition into a vibrant destination and he knew it was time to let people know how “cool” the downtown was becoming by opening a brewery, to help draw guests from out of town. Hackman brewed the first commercially produced beer, Market Fresh Wheat (a collaboration beer using Market Fresh herbal tea from his wife, Kelly’s tea company, Driftwood Tea Company) in New Port Richey in August 2018, on a 1-barrel system. After several months it became evident that the beer scene in the area was growing and that he would need to produce more beer for his guests. In November 2019, he upgraded to a three-barrel system, which is still in use today. Hackman’s brewing facility is located in the same building as his taproom, so guests can enjoy the aromas of fresh brewing beer and can see the process of making beer when they visit. The taproom is comfortably designed, lending a nod to the history of the Pithlachascotee (aka Cotee) River, of which the brewery was inspired. Guests can enjoy seeing historic photos of the river as well as take in the rustic and chic design of wood and metal throughout. Since opening his brewery, Hackman has carved out a unique place in his town’s landscape, drawing guests throughout the Southeastern United States and beyond. Our Brewery Cotee River Brewing Company is the first brewery opened in the City of New Port Richey.  Currently using a 3-barrel brewing system, Cotee River enjoys creating smaller batches of beer to ensure the beer stays fresh for our guests to enjoy. Our brewing facility is located in the same place as our taproom, so it is possible to watch our brewers as they make beer, while you sit and enjoy a fresh pint. Our brewer welcomes questions and enjoys visiting with guests at the brewery.  If you are ever visiting while they are brewing, be sure to pop your head in and say hi and see what they are up to. Our Taproom At Cotee River Brewing Company, we take pride in crafting quality ales that reflect our passion for brewing. Each batch is meticulously brewed using the finest ingredients to ensure an unforgettable experience. Located in historic downtown New Port Richey, our comfortably designed location with a nod to the history of the Pithlachascotee (aka Cotee) River, is where guests can enjoy seeing old historic photos of the river on the walls. Moderately decorated in \"River\" design, the environment is rustic and chic with a mix of wood and metal. A small stage welcomes musicians on Saturday evenings, making The River the most comfortable and relaxing atmosphere in downtown. Copyright © 2025 Cotee River Brewing Company - All Rights Reserved. Powered by E-Gift Cards"
    },
    {
      "url": "https://ryeriverbrewingco.com/about/",
      "text": "Who We Are - Rye River Brewing Company We ship out webshop orders weekly, usually within 5–7 business days. Sláinte! Dismiss Skip to content Our Beers About Us Our Team Our Process Sustainability Shop Apparel Beer Drinkware Gifts Brewery Tours Events Contact Us Home Our Beers Brewery Tours Christmas Parties Events Shop Online Apparel Beer Drinkware Gifts About Us Our Team Our Process Sustainability Who We Are We are Rye River Brewing Company and we’ve been making great beer in Co. Kildare since 2013. Our approach to making beer is all about our values, our people and our process, and we think it’s a pretty good way of doing things. We love beer, so when we started out it was our plan to make great tasting beer that people loved. We’ve grown a lot since then, taking on more brewers and beer lovers, experimenting, tasting, talking, trying, failing, trying again, and succeeding. We make exclusive beers for some of Ireland’s biggest retailers including Lidl, Tesco and Dunnes, and while we’re big fans of kicking back and relaxing with a beer, we’ve no plans to stop growing. Our Team Our values ARE what guide us, but our people are what make us. We reckon if we get the culture right in our brewery, it sets the foundation for a place where our employees, our business and our beer BREWING will flourish. Learn More The Process Quality and consistency – It’s what we live and breathe. Making good beer and making sure every drop of it is just as good as the last. So whether we’re working on a new flavour, or brewing a beer we’ve been brewing since we started off, we take the same approach. Learn More The Rye River Way We’re big believers in teamwork. Beer has always been a social drink, so when we’re making it, it’s a collaborative process. We always make sure we’re respectful of each other, our local community, of the environment, and of our customers and suppliers. We want to be the best at what we do, but we’ll humbly admit when we’ve got it wrong. Quality Is a way of life Respect is central to our culture We believe in Teamwork We take full responsibility for what we do Our Awards WE LOVE A BIT OF RECOGNITION FOR OUR HARD WORK AND  WE’RE DELIGHTED TO HAVE BEEN RECOGNISED BY OUR PEERS IN  THE BREWING COMMUNITY. WE’VE WON OVER 180 AWARDS SO  FAR, AND WE’RE THE MOST AWARDED BREWERY AT THE WORLD  BEER AWARDS. SO, WHILE WE’VE HAD CAUSE TO CELEBRATE, WE  ALSO HAVE BIG PLANS FOR THE FUTURE. 142 x WORLD BEER AWARDS 17 x IRISH QUALITY FOOD AND DRINK AWARDS 57 x GREAT TASTE AWARDS 14 x IRISH FOOD AWARDS All Links All Beer About Us Our Brewery Our Blog Shop Contact us Privacy Policy Newsletter Get in Touch Copyright 2025 Rye River Brewing Company | All Rights Reserved | Terms & Conditions 0 0 Your Basket Your cart is empty Return to Shop Continue Shopping Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://coteeriverbrewing.com/faqs",
      "text": "FAQs Life is Better at the River.  Cotee River Brewing Company, New Port Richey's Original Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US More Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Frequently Asked Questions Do you serve food? Cotee River Brewing Company does not currently serve food.  We stick to what we know best, beer!  Guests are able to bring food in from outside establishments to enjoy. Do you allow food to be brought into the brewery? Cotee River Brewing Company does not have a restaurant at its facility and therefore allows guests to bring food in from an outside location.  We encourage you to visit any of the downtown dining establishments for food, and to bring food from their restaurants to our establishment. Do you have music? Cotee River Brewing Company is delighted to provide musical entertainment on Saturday evenings from 7 pm - 10 pm.  Occasionally, there is music on various days throughout the month.  Our music calendar can be found on our Facebook page, under events. Do you allow Service Animals? Cotee River Brewing Company understands the needs of our guests and does everything it can to accommodate their needs when visiting our establishment.  That being said, Cotee River Brewing Company has the following policy in regard to Service Animals. Florida's service animal law applies to animals that are trained to do work or perform tasks for someone with a physical, mental, psychiatric, sensory, or intellectual disability. The ADA defines a service animal as a dog that is individually trained to perform tasks or do work for the benefit of a person with a disability. Neither law covers pets or \"emotional support animals\", animals that provide a sense of safety, companionship, and comfort to those with psychiatric or emotional disabilities or conditions.  Under the ADA and Florida law, owners of public accommodations, including restaurants and retail establishments, are not required to allow emotional support animals or pets into their establishments, only service animals. It is the policy of Cotee River Brewing Company to follow the law according to the ADA and the state of Florida. Therefore, we recognize trained service dogs and welcome them into our establishment.  Currently, \"emotional support animals\" or other animals of any kind are not permitted in our establishment.  It is the policy of Cotee River Brewing Company to review any paperwork or documentation for any service animal before allowing admittance into the establishment. Privacy Policy / Notice This privacy notice discloses the privacy practices for (website address). This privacy notice applies solely to information collected by this website. It will notify you of the following: What personally identifiable information is collected from you through the website, how it is used and with whom it may be shared. What choices are available to you regarding the use of your data. The security procedures in place to protect the misuse of your information. How you can correct any inaccuracies in the information. Information Collection, Use, and Sharing: We are the sole owners of the information collected on this site. We only have access to/collect information that you voluntarily give us via email or other direct contact from you. We will not sell or rent this information to anyone. We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order. Unless you ask us not to, we may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy. Your Access to and Control Over Information: You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website: See what data we have about you, if any. Change/correct any data we have about you. Have us delete any data we have about you. Express any concern you have about our use of your data. Security: We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline. Wherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a lock icon in the address bar and looking for \"https\" at the beginning of the address of the Web page. While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers/servers in which we store personally identifiable information are kept in a secure environment. If you feel that we are not abiding by this privacy policy, you should contact us immediately via telephone at 727-807-6806 or via email at info@coteeriverbrewing.com Copyright © 2025 Cotee River Brewing Company - All Rights Reserved. Powered by E-Gift Cards"
    },
    {
      "url": "https://coteeriverbrewing.com/",
      "text": "Cotee River Brewing Company Life is Better at the River.  Cotee River Brewing Company, New Port Richey's Original Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US More Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Welcome to Cotee River Brewing Company Welcome to Historic Downtown New Port Richey's original brewery Since opening in July 2018, Cotee River Brewing Company is one of the most popular spots to visit in historic downtown New Port Richey.  The first brewery in the downtown New Port Richey (actually, the first in all of the City of New Port Richey), Cotee River Brewing Company combines rustic design with a focus on the Pithlachascotee River (Cotee River for short) and proudly displays old photos of life on the river over the past 100 years. Featuring fresh beer brewed on site, as well as beers from other Florida breweries, Cotee River Brewing Company’s first brew was its signature Market Fresh Wheat Beer, that combines a wheat beer with an herbal tea called Market Fresh, that is obtained from the local tea shop, The White Heron Tea & Gifts. Currently, Cotee River Brewing Company has 6-10 taps of its original and locally made brews at all times. Focusing on popular beer styles, taps are often filled with our IPA, Pale Ale, Red Ale, Blonde, Porter or Stout, and Wheat beers. Cotee River Brewing Company also proudly makes two house sangrias that are served on tap. These wine base for our signature sangrias, and all our wines are provided by the award award-winning Aspirations Winery, who handcrafts their wine in Clearwater, Florida. Gift Cards Share the gift of Great Beer E-Gift Cards Photo Gallery Our Partners Press / Media Copyright © 2025 Cotee River Brewing Company - All Rights Reserved. Powered by E-Gift Cards"
    },
    {
      "url": "https://ryeriverbrewingco.com/contact-us/",
      "text": "Contact Us - Rye River Brewing Company We ship out webshop orders weekly, usually within 5–7 business days. Sláinte! Dismiss Skip to content Our Beers About Us Our Team Our Process Sustainability Shop Apparel Beer Drinkware Gifts Brewery Tours Events Contact Us Home Our Beers Brewery Tours Christmas Parties Events Shop Online Apparel Beer Drinkware Gifts About Us Our Team Our Process Sustainability Contact Us We love talking all things craft beer so feel free to drop us a line with any questions, comments or requests. Notice: JavaScript is required for this content. WHERE WE ARE BASED RYE RIVER BREWING COMPANY DONAGHCUMPER DUBLIN ROAD CELBRIDGE W23 AX07 CO. KILDARE +353 1 6287255 info@ryeriverbrewingco.com Get good news about great beer Be the first to know when we've got a new beer on the way or something exciting happening around the brewery. Notice: JavaScript is required for this content. All Links All Beer About Us Our Brewery Our Blog Shop Contact us Privacy Policy Newsletter Get in Touch Copyright 2025 Rye River Brewing Company | All Rights Reserved | Terms & Conditions 0 0 Your Basket Your cart is empty Return to Shop Continue Shopping Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://coteeriverbrewing.com/contact-us",
      "text": "Contact US Life is Better at the River.  Cotee River Brewing Company, New Port Richey's Original Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US More Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Home All About Beer Our Brews Brewer's Blog Videos Shop Captains Club All About Us Our Story FAQs Contact US Contact Us Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. Cotee River Brewing Company 5760 Main Street, New Port Richey, Florida 34652, United States Phone: 727-807-6806 Email: info@coteeriverbrewing.com Hours Mon Closed Tue 04:00 pm – 10:00 pm Wed 04:00 pm – 10:00 pm Thu 04:00 pm – 10:00 pm Fri 12:00 pm – 11:00 pm Sat 12:00 pm – 11:00 pm Sun 12:00 pm – 06:00 pm Get directions Connect With Us Copyright © 2025 Cotee River Brewing Company - All Rights Reserved. Powered by E-Gift Cards"
    }
  ]
}