{
  "fuentes": [
    {
      "url": "http://voyagephoenix.com/interview/meet-kim-blevins-country-thunder-music-festivals-florence-az/",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://www.nature.org/en-us/about-us/where-we-work/united-states/florida/stories-in-florida/board-of-trustees/",
      "email": "name@company.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://www.countrythunder.com/fl-info",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/fl-info",
      "email": "lenore@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/fl-info",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/privacypolicy?lang=en",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/about-us",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/single-post/2018/10/04/Introducing-Country-Thunder-Florida",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://secure.qgiv.com/event/countrythunder",
      "email": "parker.smith@nemours.org"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "email": "cj@cnceventservices.com"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "email": "media@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "email": "sponsors@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "email": "vendors@countrythunder.com"
    },
    {
      "url": "https://2911.us/country-thunder-music-festival-rolls-into-kissimmee-florida-this-weekend/",
      "email": "missionctrl@2911.us"
    },
    {
      "url": "https://2911.us/country-thunder-music-festival-rolls-into-kissimmee-florida-this-weekend/",
      "email": "gerry@countrythunder.com"
    },
    {
      "url": "https://2911.us/country-thunder-music-festival-rolls-into-kissimmee-florida-this-weekend/",
      "email": "jason@2911.us"
    },
    {
      "url": "https://2911.us/country-thunder-music-festival-rolls-into-kissimmee-florida-this-weekend/",
      "email": "jpw@2911.us"
    },
    {
      "url": "https://www.fox35orlando.com/news/country-thunder-florida-2024-lineup-tickets",
      "email": "fox35news@fox.com"
    },
    {
      "url": "https://www.countrythunder.com/policies",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/privacypolicy",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.nba.com/thunder/executives",
      "email": "fans@okcthunder.com"
    },
    {
      "url": "https://www.countrythunder.com/florida",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/fl-lineup",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/termsofservice",
      "email": "info@countrythunder.com"
    },
    {
      "url": "https://thunderroadsflorida.com/contact-us/",
      "email": "thunderroads@charter.net"
    },
    {
      "url": "https://www.countrythunder.com/single-post/country-thunder-music-festivals-digital-specialist",
      "email": "admin@countrythunder.com"
    },
    {
      "url": "https://www.countrythunder.com/single-post/country-thunder-music-festivals-digital-specialist",
      "email": "info@countrythunder.com"
    }
  ],
  "mails": [
    "admin@countrythunder.com",
    "cj@cnceventservices.com",
    "dj_convoy@lazonamuerta.blog",
    "fans@okcthunder.com",
    "fox35news@fox.com",
    "gerry@countrythunder.com",
    "info@countrythunder.com",
    "jason@2911.us",
    "jpw@2911.us",
    "lenore@countrythunder.com",
    "media@countrythunder.com",
    "missionctrl@2911.us",
    "name@company.com",
    "parker.smith@nemours.org",
    "sponsors@countrythunder.com",
    "thunderroads@charter.net",
    "tstuder@astrosecuritymonitoring.com",
    "vendors@countrythunder.com"
  ],
  "nombre_sitio": "countrythunder.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://voyagephoenix.com/interview/meet-kim-blevins-country-thunder-music-festivals-florence-az/",
      "text": "Meet Kim Blevins of Country Thunder Music Festivals - VoyagePhoenix - Phoenix Connect To Top About VoyagePhoenix Submit a story idea Privacy & Terms of Service VoyagePhoenix FAQs Trending Phoenix’s Most Inspiring Stories Hidden Gems: Local Businesses & Creatives You Should Know Portraits of Phoenix What are the biggest lies your industry tells itself? What fear has held you back the most in your life? What makes you lose track of time—and find yourself again? What do the first 90 minutes of your day look like? What did suffering teach you that success never could? Highlighting Local Gems Is the public version of you the real you? Phoenix’s Most Inspiring Stories Phoenix’s Most Inspiring Stories Perspective & Advice for Those Facing Insurmountable Odds What’s the Most Important Lesson You’ve Learned Along Your Journey? Perspective & Advice for Those Facing Insurmountable Odds August 23, 2018 Meet Kim Blevins of Country Thunder Music Festivals Local Stories Share Tweet Pin Today we’d like to introduce you to Kim Blevins. So, before we jump into specific questions about the business, why don’t you give us some details about you and your story. Country Thunder Music Festivals have been a staple in Arizona for over 20 years. Located first at Queen Creek, then relocated to Canyon Moon Ranch in Florence. I got involved in Country Thunder when our CEO, Troy Vollhoffer took over the festival in 2009. I have been involved in festival management since 2005 in various capacities. Our team is quite small, which means everyone does a little of everything. I think having this type of experience is important because it allows you to understand how each slice of the festival affects the whole, and how making one decision can impact other areas. Great, so let’s dig a little deeper into the story – has it been an easy path overall and if not, what were the challenges you’ve had to overcome? Nothing about planning festivals is smooth. There are thousands of moving parts to organize, and if one part fails, it can easily affect many other parts of the event. Our team works on this festival 12 months out of the year. It begins with booking the acts. While an outsider may think this is an easy task, it is more difficult than it looks. We cannot just pick an act and book them – there are many factors to consider, such as touring schedules, general availability, etc. Once the lineup is finally complete, our focus shifts to operations – building a small city in the middle of a field with no amenities. Butch Martin, our site manager has been with Country Thunder since day one and there’s nothing about the site that he doesn’t know about, but even with an experienced site manager, setting up so many moving parts at once can be challenging. One would think setting up tents is pretty straightforward, and it is… until a tent peg goes into a water line. Marketing can also be difficult in a market as large as Phoenix where most acts come through at least once per year. We have been fortunate to build Country Thunder as a unique experience and many of our fans support the festival regardless of what acts we put on the stage. We also have to be good neighbors and ensure that we are making good decisions so we have minimal impact on the residents of the area. Country Thunder Music Festivals – what should we know? What do you guys do best? What sets you apart from the competition? Country Thunder Music Festivals produces four country music festivals each year across North America. Our goals are to bring the biggest and the best country music artists to the fans of each area, and to build a unique festival experience at each one, incorporating the local flavor of each destination. Our team is passionate about our fans, providing them with good value on the dollar, and the best opportunity to build incredible memories. We are also committed to being a part of the community. By building strong relationships with our neighbors, local companies like Hensley and KMLE, and partnerships with local government agencies like the Town of Florence, Pinal County, and the Pinal County Sheriff Department, we continue to make Country Thunder a positive experience for the entire area. Personally, I am most proud of how we treat people. This philosophy comes from the top down. Our CEO Troy has always believed in treating people well, and it has permeated our entire team. Whether it be the general admission fan, the VIPs, our partners, or the artists, we want everyone to have a good experience – we want everyone to have fun! My favorite part of the day is driving through the campground on a golf cart and offering people rides. I really enjoy the look on people’s faces when they ask me what I do for the festival and I tell them I’m the general manager. It’s priceless! What moment in your career do you look back most fondly on? Standing in the crowd on a Sunday night and watching 30,000 people having the time of their lives. I always have one moment, just walking through the crowd, thinking to myself, “we did this, we built this, we are the reason these people are having such a good time.” It is difficult to understand unless you see a festival go up from the beginning. We start with nothing and build this small city. Then the people come and it changes again. Then the artists come and the anticipation turns into reality. And then it’s over. There aren’t many people who can see the end result of all their hard work, but we can. It’s the most gratifying experience you can have. Pricing: General Admission weekend passes are available at $130 Contact Info: Website: www.countrythunder.com Phone: 866-388-0007 Email: info@countrythunder.com Instagram: @countrythunder Facebook: @countrythunder Twitter: @countrythunder Image Credit: Getty Images, Debbie Wong Getting in touch : VoyagePhoenix is built on recommendations from the community; it’s how we uncover hidden gems, so if you know someone who deserves recognition please let us know here . Related Items Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Popular Phoenix’s Most Inspiring Stories What fear has held you back the most in your life? What makes you lose track of time—and find yourself again? What do the first 90 minutes of your day look like? More in Phoenix’s Most Inspiring Stories The heart of our mission is to find the amazing souls that breathe life into our communities. In the recent weeks,... Local Stories September 10, 2025 What fear has held you back the most in your life? Fear is something we all carry, though it shows up differently for each of us. It can keep us safe, but... Local Stories September 4, 2025 What makes you lose track of time—and find yourself again? With so many high-achievers in our community it was super interesting to learn about the moments when they lose track of... Local Stories September 4, 2025 What do the first 90 minutes of your day look like? Coffee? Workouts? Hitting the snooze button 14 times? Everyone has their morning ritual and we LOVE hearing about them. Some of... Local Stories September 4, 2025 What did suffering teach you that success never could? With all the focus on success it’s easy to overlook the valuable lessons we can learn from the more difficult parts... Local Stories September 4, 2025 Are you doing what you were born to do—or what you were told to do? Culture, economic circumstances, family traditions, local customs and more can often influence us more than we realize. With the benefit of... Local Stories September 4, 2025 Highlighting Local Gems Over the past decade we have had the chance to learn about so many incredible folks from a wide range of... Local Stories September 4, 2025 What are the biggest lies your industry tells itself? Every industry has its myths—stories insiders repeat until they sound like truth. But behind the slogans and the spin are unspoken... Local Stories September 4, 2025 When did you stop hiding your pain and start using it as power? Almost everything is multisided – including the occurrences that give us pain. So, we asked some of the most enlightened folks... Local Stories September 4, 2025 Phoenix is an incredible city - but it's so large and so vast and so diverse that all of us are missing out on tons of great people, businesses, organizations, events and more. VoyagePhoenix wants to highlight the best of the Phoenix, Scottsdale & Tempe area - from freelance makeup artists that will dazzle you to the best Meetup groups in town. Latest Headlines Phoenix’s Most Inspiring Stories What fear has held you back the most in your life? What makes you lose track of time—and find yourself again? What do the first 90 minutes of your day look like? Tags Widget localguide food Featured Must Read Entertainment Fashion trending Movies quote About VoyagePhoenix Privacy & Terms of Service Suggest a Story Copyright © 2025 VoyagePhoenix"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://www.nature.org/en-us/about-us/where-we-work/united-states/florida/stories-in-florida/board-of-trustees/",
      "text": "Florida Board of Trustees | The Nature Conservancy Every gift today has twice the power for nature. Give Now. Close interstitialRedirectModalTitle interstitialRedirectModalMessage interstitialRedirectModalRedirectCTA interstitialRedirectModalDismissCTA × Skip to content Language: English English Español Donate What We Do What We Do Our Priorities Tackle Climate Change Protect Ocean, Land & Fresh Water Provide Food and Water Our Insights Perspectives Reports Data & Tools About Us About Us Who We Are Our People Our Science Our Accountability How We Work Our History Where We Work Africa Asia Pacific Canada Caribbean Europe India Latin America United States Get Involved Get Involved How To Help Volunteer Attend Events Take Action Calculate Your Carbon Footprint Explore the Places We Protect Educational Resources Membership & Giving Membership & Giving Donate Become a Member Renew Give Monthly Gift & Estate Planning Other Ways to Give English Go Back English Español Show search Renew Donate Search Florida Board of Trustees Florida Board of Trustees group photo at a TNC Philanthropy Dinner in Miami, Florida. © Coastal Click Photography Stories in Florida Florida Board of Trustees These committed leaders provide oversight and balance to our work in Florida. Last updated March 12, 2025 Share Meet the Florida Board of Trustees Our Florida Board of Trustees demonstrates outstanding personal commitment of service to The Nature Conservancy in Florida, providing oversight and balance to our work in the sunshine state. Our dedicated trustees fulfill several distinct and significant roles and responsibilities including guidance, strategic thinking and problem-solving for all aspects of our conservation efforts. They help to establish effective relationships with leaders in the spheres of philanthropy, public policy, science, education and other sectors to promote our mission and goals; and they represent TNC and our work in their communities, personal and professional networks and in the public eye. Pat Balthrop Florida Trustee © TNC Pat Balth rop Apalachicola, trustee since 2015 Patrick J. Balthrop, Sr. was born and raised in the Florida panhandle and is the founding principal of Apalachee Ventures, LLC. He has more than 35 years of experience building, growing and turning around businesses and commercial enterprises around the world, most recently as CEO of a publicly traded company. Pat is a demonstrated thought leader in the life sciences, medical device and genomics industries. He serves on the board of directors of several companies, including Agendia, Discovery Life Sciences, Pattern Bioscience, MaxCyte (NASDAQ: MXCT) and Burke Porter Group. Pat was CEO, president and a board director of Luminex Corporation (NASDAQ: LMNX) for more than 10 years. He served as president of Fisher Healthcare and previously enjoyed a 20-year career at Abbott in clinical diagnostic systems and vascular devices. Pat has an MBA from Kellogg School of Management of Northwestern University, and his undergraduate studies were at Princeton University and Spring Hill College. He earned a BS in biology from Spring Hill. Tracy Duda Chapman Oviedo, trustee since 2023 Tracy Duda Chapman joined A. Duda & Sons, Inc. in 1992 as Associate Counsel at the corporate headquarters in Oviedo, Florida. She was promoted to General Counsel in 2000. In 2005, she was appointed Corporate Vice President of Corporate Services, with oversight responsibility for Corporate Communications, Governmental Affairs, Risk Management, Food Safety and Technical Services. She was appointed Chief Executive Officer of The Viera Company, DUDA’s real estate development subsidiary and Senior Vice President of the corporation in 2007. In June 2016, she was appointed to her current position as Senior Vice President, Chief Legal & Administrative Officer. Before joining DUDA, Tracy practiced law in the real estate department of the Dean Mead law firm in Orlando from 1990 to 1992. Tracy is a member of The Florida Chamber Board of Directors and is a member of the Florida Land Council. Tracy is also a graduate of the Wedgworth Leadership Institute for Agriculture & Natural Resources through the Institute of Food and Agricultural Sciences program at the University of Florida. Tracy remains an active alumni member of the Wedgworth Leadership Institute and is a past President of its Alumni Association. Chris Dillavou Florida Trustee © TNC Chris Dillavou Tequesta, trustee since 2020 As Executive Vice President and COO at Greg Norman Company, Chris oversees the company’s consumer businesses, joint ventures, real estate, licensing and private equity investments in the U.S., Australia, Asia, Middle East, Latin America and the Caribbean. Chris is also a co-owner of Florida Living Realty, a boutique residential real estate company specializing in Palm Beach County and Martin County. A native Californian, Chris lived overseas and spent time in 33 other countries, which has informed his perspective as a global citizen. A seeker of adventure, Chris’ heart sings in the outdoors and in wild places as a lifelong mountaineer, fisherman, diver and distance runner. Chris holds a B.A. from Boston College and an M.B.A. from the University of Southern California. He lives in Tequesta, Florida with his wife and three children, and is committed to land stewardship and the conservation of wild places that will enable these same experiences for future generations. Ron Edwards Florida Trustee © TNC Ron Edwards Vero Beach, trustee since 2016 Ron has spent over 40 years in the Florida agri-business sector. A native of Jacksonville, Florida, Ron was a CPA with Ernst & Ernst, auditing agri-business companies. In 1975 he joined Tropicana as Chief Accountant and rose to Executive Vice President and Chief Operating Officer. In 1986 he joined ConAgra, Inc. as President of their Juice Division. In 1987 Edwards joined Evans Properties, Inc., a closely held family-owned agri-business and real estate company based in Vero Beach with cattle and citrus operations in eight Florida counties, as President and CEO. He has served on the steering committee for Florida Wildlife Conservation Commission’s Cooperative Conservation Blueprint Taskforce. Edwards is a member of the Florida Land Council, and also serves on the Board of Florida Family Growers Association. Ron also serves on the Boards of Viewpost, LLC, Terviva Bioenergy, Inc., Parabel, LLC, and is Chairman and Chief Executive Officer of AquaFiber Technologies Corporation. Jarred Fayson Florida Trustee © TNC Jarred Fayson Tierra Verde, trustee since 2022 Jarred is CEO of SF Fulfillment, a family-owned and operated third-party logistics business headquartered in Cedar Rapids, Iowa. Jarred played football at The University of Florida and the University of Illinois, where he graduated in 2010 with his B.A. He went on to play in the NFL from 2010 to 2015, achieving his lifelong dream. After his playing days, Jarred went on to handle the commercial rights for the world’s largest fishing platform, representing professional athletes and partnering with the Florida Fish and Wildlife Conservation Commission, National Geographic, Blue Star Planet and others. Jarred and his team filmed several migrations and brought awareness to coastal issues and estuaries. Today, Jarred can be found between his home in Tierra Verde, FL and Cedar Rapids, IA with his wife, Muffy Sadler-Fayson, and son, Cruz. Looking forward, Jarred is yearning to raise awareness and educate others on what can be done to preserve, improve and protect marine life and estuaries. Ryan Hixon Florida Trustee © TNC Ryan Hixon Neptune Beach,  trustee since 2023 Land ownership, conservation and stewardship have been seminal focuses of the Hixon family for generations and largely define the bedrock of Ryan’s life passions. A native Floridian who has lived, studied and worked internationally, Mr. Hixon’s deep connection to the wilderness through a lifetime love of the ocean and forest fuels his drive to help protect the world’s natural ecosystems. Since 2018, he has been a commercial broker, currently on JLL’s North Florida Multifamily team, actively marketing investment sales opportunities throughout the region. Ryan serves on the board of Hixon Properties, leading the San Antonio-based real estate business to outperform in responsible urban-infill development, and assisted in delivering the first mass-timber office building to the state of Texas. Mr. Hixon is also part of the management team running a sustainable 1,000-head cattle ranch in western-central Idaho and is actively restoring a family-owned 3,000-acre longleaf pine forest in North Florida to pre-Columbian condition. Dedicated to lifelong learning, he holds a B.A. from the University of Colorado and an MBA from the University of Toronto. He and his wife, Lauren, live in Neptune Beach and are most commonly found barefoot, outside in their garden or on the beach, with their two children and Jack Russell Terrier. Cheryl Holder Florida Trustee © TNC Cheryl Holder Miami, trustee since 2021 Dr. Cheryl L. Holder is a National Health Service Corp Scholar, Internist, HIV Specialist, once Medical Director of one of Miami’s largest community health centers and a participant in NIH and CDC health advisory and programmatic review panels. She has dedicated her career to improving health of underserved populations. Since 2009, Dr. Holder teaches about the social determinants of health, diversity, HIV prevention and the health impact of climate change at Herbert Wertheim College of Medicine at Florida International University. She also serves as Associate Dean of Diversity, Equity, Inclusivity and Community Initiatives. Her leadership roles extend to several medical and climate change-focused organizations. She is president of Florida State Medical Association, Founder and Co-Chair of Florida Clinicians for Climate Action and Co-chair of Miami Dade Heat Health Task Force. Most recently, her TED Talk “The link between climate change, health and poverty” garnered over 250,000 views. Garry Jones Garry Jones, Florida trustee © TNC Garry Jones Winter Park, Lifetime Trustee As President of Full Sail University, Garry Jones is one of the prime catalysts of the university’s forward motion, as he continually works to ensure that the university’s progress maintains the original mission and culture—or “heartbeat”—of the institution. Garry served as a consultant during the creation of Full Sail, and in 1980 joined the faculty as an educator. From 1980 to 1999, he served in a variety of leadership roles across the institution and was promoted to the role of President in 1999. During his tenure as President, Full Sail University has received a wide range of accolades and awards for its educational approach and the quality of its curriculum. Previously, Garry and his wife Isis appeared on Winter Park Magazine’s “Most Influential People List” which highlighted individuals who make a difference through their professions, volunteerism, philanthropy, talents and community engagement. Over the last seven consecutive years (2018-2024), Garry has been featured on Florida Trend magazine’s “Florida 500 List,” identifying the 500 most influential Floridians across the state. In 2022, the Orlando Business Journal named Garry to their annual “Power Players” list in the category of “Central Florida’s Industry Giants.” Most recently, Orlando Magazine selected Garry as one of the “50 Most Powerful People of 2024,” and the Orlando Business Journal selected Garry as a recipient of its annual C-Suite Awards in 2023, honoring winners for their outstanding performance in their areas of expertise, as well as for their contributions to their industries and commitment to local community. Currently, Garry serves on the Board of Trustees for The Nature Conservancy Florida (he previously held a chairmanship term of July 2019-June 2022); the Board of Directors for the Dr. Phillips Performing Arts Center; is a founding supporter of The Foundation for Foster Children. In addition, Garry serves on the Orlando Economic Partnership’s Governors Council; State of Florida Governor’s Council of 100 and holds a position on the Advisory Board for the Greater Orlando Sports Commission. He is a voting member of The Recording Academy (Grammys) as well as the Audio Engineering Society. Originally from Christiansburg, Virginia, Garry attended Bluefield College for his associate degree, Virginia Tech where he earned a Bachelor of Science in Psychology and in 2016 he was awarded a Doctorate in Humane Letters by Bluefield College. He currently resides in Winter Park, Florida, with his wife and best friend of over 40 years, Isis. Rena Langley Rena Langley, Florida trusee © TNC Rena Langley Orlando, trustee since 2021 Rena Langley is the Walt Disney World Senior Vice President, Communications and Public Affairs. She oversees public relations, government relations, external communications, internal communications, executive communications and corporate citizenship for the Walt Disney World Resort. Rena has a deep breadth of experience in communications with more than two decades at Disney. She previously led Public Affairs for Disney Cruise Line, Disney Vacation Club and Adventures by Disney. In the community, Rena serves on several boards, including the Florida Chamber of Commerce, Orlando Economic Partnership and the Central Florida Commission on Homelessness. In addition, she is part of the Advisory Council for the University of Florida’s Public Relations department. Rena is a former news reporter and spokeswoman for the American Automobile Association and her alma mater is the University of Florida. John Levinson Florida Trustee © TNC John Levinson Miami, trustee since 2022 Throughout his career, John has been identifying, analyzing and investing in leading applied-technology companies. He was a top-ranked technology analyst at Goldman Sachs, founder of a pioneering tech fund at Westway Capital and now a professional seed stage VC investor and advisor/ board member to young companies. To date, John has sourced and invested in over 60 early-stage applied technology companies in healthcare, FinTech, AgTech, AI and other sectors. Additionally, John has served on The Nature Conservancy in Connecticut Board for 10 years, from 2008-2018. During that time, he assumed many global and local leadership positions, including Board chair and vice chair, Campaign co-chair, Brazil Task Force co-chair and early advisor to companies in TNC’s TechStars Sustainability Accelerator. John holds a Chemistry degree from Lafayette College and an MBA from Carnegie-Mellon University’s Tepper School of Business. He also has served on various corporate and non-profit boards. Phoebe McMillan Florida Trustee © TNC Phoebe McMillan Cape Coral,  trustee since 2024 Phoebe McMillan has worked as a financial and strategic advisor to the restaurant industry for over 25 years. Phoebe started her career in investment banking at William Blair & Company and subsequently led the restaurant practice at Piper Jaffray. In 2003, she founded Restaurant Strategy, a consulting firm providing advisory services to restaurant and retail growth companies. Currently, Phoebe serves as the Trustee of NexTerra Wine Company, the 25th largest winery in the U.S., producing over 1.4 million cases annually.  Phoebe’s interest in TNC was sparked by a family member’s multi-year board participation at TNC Minnesota, and her passion for TNC Florida’s initiatives stems from her annual family trips to Gasparilla Island over the last five decades, beginning in the 1970’s and her residency in Cape Coral since 2020. She also currently serves on The Woman’s Board of Rush University Medical Center located in Chicago, IL. Phoebe graduated cum laude with a degree in history from Princeton University and earned her M.B.A. from the Kellogg Graduate School of Management. Gilbert Miller Florida Trustee © TNC Gilbert Miller Sanford, trustee since 2018 Gilbert serves as the Board Chair of the Bradley-Turner Foundation, a 6th-generation family foundation. He has also been involved with the work of the Beloco Foundation for over twenty years, formally joining as a trustee in 2000. The grandson of the founder of Beloco, Gilbert, has prioritized defining the foundation’s mission and strengthening its overall governance. He is a trustee of Epworth-by-the-Sea, Andrew College, the National Center for Family Philanthropy and the Georgia Grantmakers Alliance. He is also a past board chair of Philanthropy Southeast. When not in the boardroom, Gilbert manages Kimi Farms—a 2 nd generation family Christmas tree business, Imik Properties—a small commercial real-estate development partnership and he is working on a series of young adult books based on his childhood in southwest Georgia A graduate of the University of Georgia, Gilbert continues to be involved at his alma mater, serving on the Dean’s Council of the Franklin College of Arts and Sciences. He and his wife, Jamee, have two sons, William and Benjamin, and a daughter, Juliette. Dr. Sejal Patel Florida Trustee © TNC Dr. Sejal Patel Winter Park, trustee since 2022 With more than 20 years of experience in medicine, Sejal Dharia Patel, MD, is dual board-certified in reproductive endocrinology and obstetrics and gynecology. Raised in Clearwater, Florida, Dr. Patel received her undergraduate and medical degrees from the University of Miami where she also completed her residency. She then held a fellowship at the University of Alabama at Birmingham and a faculty position at the Ohio State University prior to returning to Central Florida. When not creating families, she is spending time with her husband Vipul (a urologic oncologist) and her children. Her interest in nature conservation started early. Being raised in Clearwater, she understood the importance of a balanced ecosystem. This was reinforced by their involvement with the Save Our Seas Foundation and the creation of marine protected areas. Dr. Patel is inspired to continue this passion for conservation on our planet through education, research and awareness. Bruce Rauner Florida Trustee © TNC Bruce Rauner Key Largo, trustee since 2020 A Chicago native, Bruce served as the 42nd Governor of the State of Illinois from 2015 to 2019. Governor Rauner’s achievements included equal funding for charter schools, a historic tuition scholarship tax credit program and criminal justice reforms. Prior to his public service, Bruce was Chairman of private equity and venture capital firm GTCR. Bruce has served on the boards of numerous civic and philanthropic organizations, including New Schools for Chicago and World Business Chicago. Bruce serves on the boards numerous environmental organizations and works with TNC in Montana and Montana Land Reliance. Bruce received the Murie-Broome Award from The Wilderness Society for outstanding work in wilderness preservation. Bruce is an avid fly fisher, bird hunter, backpacker, skier, golfer and motorcycle and horseback rider. Bruce received his B.A. from Dartmouth College and his M.B.A. from Harvard University. Bruce and his wife Diana have six children and three grandchildren. Anne Savage Florida Trustee © TNC Anne Savage Orlando, trustee since 2019 A world traveler, Anne has spent her professional career establishing conservation programs for endangered species. She developed Proyecto Tití, a conservation program designed to conserve Colombia’s most endangered primate, the cotton-top tamarin, making conservation of the cotton-top tamarin a priority in Colombia. Anne is the former Conservation Director for Walt Disney Parks and Resorts, supporting Disney’s strong conservation legacy. She has worked with Walt Disney Imagineering to incorporate conservation into many of the theme park attractions and experiences at Disney’s Animal Kingdom and other Disney Parks and Resorts. Anne received her B.A. and Ph.D. from the University of Wisconsin- Madison. She has held numerous leadership positions within the Association of Zoos and Aquariums and other scientific organizations. She received the Lowell Thomas Award from the Explorers Club and currently serves on the board of Fundación Proyecto Tití and Foundations of Success. Robert Spottswood Florida Trustee © TNC Robert A. Spottswood, Jr. Key West, trustee since 2021 Robert is part of the 7th generation of the Spottswood Family to call Key West home. After attending the University of Florida, he went on to study law at Nova University, where he worked with several environmental groups, including the Everglades Law Clinic, to advocate for responsible development and preservation of vital native habitats for endangered and threatened species. Robert has continued to be an advocate for sustainable and environmentally conscious development through his law practice, which is focused on real estate development and the hospitality industry. In 2019, Robert and his wife Stephanie permanently relocated to Key West, where they now reside with their children Florence, Eleanor and Robert III. He serves as President of Spottswood Companies, Inc., President of Spottswood Management, Inc., Co-President of Keystar, Inc., and is a Partner at Spottswood, Spottswood, Spottswood & Sterling, PLLC. Robert is also Board Member of the Fish & Wildlife Foundation of Florida. JoAnn Tredennick Florida Trustee © TNC JoAnn Tredennick Jacksonville, Lifetime Trustee JoAnn currently owns J Properties, LLC, a restoration and management company of historic properties in the Jacksonville area. In 2008, she retired as President of the Jacksonville-based National Financial Brokerage, Inc. JoAnn served as Chair for the Florida Board of Trustees from 2016 to 2019. She is a former Board Chair of Resco Products, Inc. and is married to Jack Meeks, a CPA and President of Jack Meeks & Associates. JoAnn holds a B.S. in Forestry from the University of New Hampshire and an MBA from the University of North Florida. Noah Valenstein Florida Trustee © TNC Noah Valenstein Tallahassee, trustee since 2021 Noah is a founding partner at Brightwater Strategies Group, PLLC, where he provides strategic guidance to private and non-profit sectors. Noah served as both the Secretary for the Florida Department of Environmental Protection (DEP) and the state’s Chief Resilience Officer, and worked to champion and advocate for water quality improvements, Everglades and springs restoration, coastal resiliency and land conservation in Florida. Noah led the creation of the Office of Resilience and Coastal Protection at DEP, the agency’s resilience grant program, and helped secure record funding for climate change and resilience initiatives in Florida. He also served in leadership positions on the United States Coral Reef Task Force, the United States Everglades Task Force and the Environmental Council of the States. Noah graduated from FSU’s College of Law and received his Bachelor’s degree from UF’s School of Natural Resources and Environment, where he graduated with honors. Related Articles Steering Policy into a New Decade A series of international agreements in 2020 could set the stage for more sustainable economies by 2030. VIEW MORE ITEMS Site Footer Explore Our Mission Our Accountability Newsroom Magazine Find Events Volunteer Connect Contact Us Careers FAQ Ethics Helpline Give Donate Now Membership Gift & Estate Planning Sign Up for E-News Email: Please do not use this field. If you enter anything\n                        into this text box your request will not be processed.\n                        Thank you. Sign Up Please provide valid email address You’ve already signed up with this email address. To review your email preferences, please visit nature.org/emailpreferences We may have detected a typo. Please enter a valid email address (formatted as name@company.com). Did you mean to type ? We are sorry, but there was a problem processing the reCAPTCHA response. Please contact us at webmaster@tnc.org or try again later. Email: Sign Up Sign Up Sign Up Sign Up Sign Up Get text updates from The Nature Conservancy: Sign Up Please provide valid mobile number See Mobile Terms & Conditions Get text updates from The Nature Conservancy: Social Global Sites Australia Brazil Canada China India Mexico Hong Kong (China): English 中文 Indonesia: English Bahasa Mongolia: English Монгол хэл The Nature Conservancy is a nonprofit, tax-exempt charitable organization (tax identification number 53-0242652) under Section 501(c)(3) of the U.S. Internal Revenue Code. Donations are tax-deductible as allowed by law. Global sites represent either regional branches of The Nature Conservancy or local affiliates of The Nature Conservancy that are separate entities. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Cookie Preference Center © 2025 The Nature Conservancy Terms of Use | Privacy Policy | Charitable Solicitation Disclosures | Mobile Terms & Conditions | Notice of Nondiscrimination | Limited English Proficiency (LEP) Procedure | Back To Top"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.countrythunder.com/fl-info",
      "text": "Country Thunder Florida | Tampa, FL  | Event Information top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. TICKETS lineup maps info FESTIVAL INFORMATION HOURS 2026 HOURS WILL COME CLOSER TO THE FESTIVAL. TICKETS ALL SALES ARE FINAL. SHOW IS RAIN OR SHINE. VIEW TICKET TERMS HERE . ​ RFID WRISTBANDS WILL BE MAILED TO YOUR PROVIDED ADDRESS. YOU MUST ACTIVATE YOUR WRISTBAND BEFORE HEADING TO THE FESTIVAL. WE ARE UNABLE TO VERIFY THE VALIDITY OF A THIRD PARTY SALE. GUARANTEED TICKETS CAN ONLY BE PURCHASED FROM COUNTRY THUNDER OR OUR OFFICIAL TICKETING PARTNER, DENIM & DIAMONDS. WRISTBANDS ARE VOID IF TAMPERED WITH. PLEASE NOTE, ONCE A WRISTBAND IS TIGHTENED, IT CANNOT BE LOOSENED. TREAT YOUR WRISTBAND LIKE THE MONEY YOU SPENT ON YOUR ADMISSION. IF YOUR WRISTBAND BECOMES TOO TIGHT, WE CAN REPLACE IT AT OUR DISCRETION FOR A $20 FEE AT THE INFORMATION BOOTH OR WILL CALL. WRISTBANDS ARE NON-TRANSFERRABLE AND CANNOT BE SHARED. EACH PERSON REQUIRES THEIR OWN WRISTBAND. CHILDREN 10 AND UNDER ARE FREE OF CHARGE ONLY IN GENERAL ADMISSION AREAS WHEN ACCOMPANIED BY A VALID GA TICKET HOLDER. *FREE ADMISSION FOR KIDS DOES NOT INCLUDE ANY PREMIUM TICKET AREAS. THEY WILL NEED THEIR OWN TICKET TO ACCESS ANY UPGRADED AREA. ​ UPGRADES - WE OFFER TICKET UPGRADES, SUBJECT TO AVAILABILITY. IF YOU DECIDE TO UPGRADE WHILE AT THE FESTIVAL, PLEASE VISIT THE INFORMATION BOOTH, CAMPGROUND INFORMATION BOOTH, OR WILL CALL. THE COST TO UPGRADE IS THE DIFFERENCE BETWEEN WHAT YOU PAID FOR THE TICKET AND THE NEW TICKET PRICE. RULES & POLICIES REVIEW ALL FESTIVAL RULES HERE , INCLUDING FESTIVAL BAG POLICY, TICKET POLICY, AND PARKING LOT POLICIES. GETTING HERE THE FESTIVAL TAKES PLACE JUST OUTSIDE RAYMOND JAMES STADIUM, LOCATED AT 4201 N DALE MABRY HWY, TAMPA FL, 36607. CONTACT US WE'D LOVE TO HEAR FROM YOU! ALL CUSTOMER SERVICE INQUIRIES CAN BE DIRECTED TO INFO@COUNTRYTHUNDER.COM OR YOU CAN CALL US AT 1-866-388-0007. OUR TEAM IS AVAILABLE WEEKDAYS FROM 9AM-5PM CST. DURING THE FESTIVAL, YOU CAN SEND OUR CUSTOMER SERVICE TEAM AT 689-202-2950. CLICK HERE FOR ALL OTHER CONTACT INFORMATION. ALLOWED ITEMS THE FOLLOWING ITEMS ARE ALLOWED IN THE FESTIVAL BOWL / CONCERT AREA. ALL ITEMS AND PATRONS ARE SUBJECT TO INSPECTION BY OUR SECURITY TEAM UPON ENTRY. CLICK HERE TO REVIEW OUR BAG POLICY. HATS SUNGLASSES SUNBLOCK (HIGHLY RECOMMENDED!) LIGHTERS (SMOKING ONLY ALLOWED IN DESIGNATED AREAS) BEACH TOWEL / BLANKET ONE UNOPENED BOTTLE OF WATER (ONE BOTTLE PER PERSON) FANNY PACKS (NOT REQUIRED TO BE CLEAR) DIGITAL CAMERAS (NON-PROFESSIONAL DIGITAL CAMERAS ARE ALLOWED; DSLR CAMERAS AND THOSE WITH A REMOVABLE LENS ARE NOT ALLOWED INTO THE FESTIVAL) DISPOSABLE CAMERA / FILM CAMERAS (NON-PROFESSIONAL) SOFT LAWN CHAIRS (PLEASE REMOVE FROM THE BAG SO BOTH ITEMS CAN BE SEARCHED) STROLLERS / SOFT WAGONS CELL PHONES PRESCRIPTION MEDICATION IS ALLOWED IN THE ORIGINAL PRESCRIPTION BOTTLE. ANY GUEST ATTEMPTING TO BRING IN PRESCRIPTION MEDICATION MUST HAVE PHOTO ID THAT MATCHES THE NAME PRINTED ON THE PRESCRIPTION. THE PILLS IN THE BOTTLE MUST ALSO MATCH THE MEDICATION/DESCRIPTION PRINTED ON THE PRESCRIPTION OVER-THE-COUNTER MEDICATIONS ARE ALLOWED, PROVIDED THEY ARE NEW AND IN THE ORIGINAL FACTORY-SEALED CONTAINER. REQUIRED MEDICAL EQUIPMENT (WHEELCHAIRS, OXYGEN BOTTLES, ETC). WE ENCOURAGE ANYBODY WITH ADDITIONAL MEDICAL EQUIPMENT TO VISIT OUR MEDICAL TENT FOR ASSISTANCE PROHIBITED ITEMS THE FOLLOWING ITEMS ARE NOT ALLOWED IN THE FESTIVAL BOWL / CONCERT AREA. ALL ITEMS AND PATRONS ARE SUBJECT TO INSPECTION BY OUR SECURITY TEAM UPON ENTRY. CLICK HERE TO REVIEW OUR BAG POLICY. GLASS CONTAINERS UMBRELLAS CHAIRS WITH CANOPIES OUTSIDE FOOD & BEVERAGES DRONES, UNMANNED AIRCRAFT DEVICES, REMOTE CONTROLLED VEHICLES ALCOHOLIC BEVERAGES & ILLEGAL SUBSTANCES ANIMALS - WITH THE EXCEPTION OF SERVICE ANIMALS FOR GUESTS WITH DISABILITIES BAGS - CLICK HERE FOR OUR BAG POLICY BOTTLES, CANS, THERMOSES & OTHER BEVERAGE CONTAINERS PROFESSIONAL CAMERAS, DSLR CAMERAS, OR THOSE WITH A REMOVABLE LENS FIREWORKS LAPTOP COMPUTERS RADIOS LASER POINTER DEVICES NOISEMAKERS PROMOTIONAL / ADVERTISING / SALES MATERIALS NOT APPROVED BY COUNTRY THUNDER. ANYONE FOUND TO BE IN VIOLATION OF THIS POLICY WILL BE REMOVE FROM THE FESTIVAL GROUNDS SEAT CUSHIONS LARGER THAN 15 INCHES X 15 INCHES OR THAT CONTAIN ARMRESTS, ZIPPERS, POCKETS, FLAPS, OR METAL BACKS. SELFIE STICKS OR POLES VIDEO CAMERAS MONOPODS AND TRIPODS WEAPONS (KNIVES, BOX CUTTERS, FIREARMS, ETC)​ ONSITE SERVICES WILL CALL - WILL CALL IS A BOX OFFICE LOCATED AT THE FRONT GATE. AS YOU ARRIVE AT THE FESTIVAL GROUNDS, YOU'LL SEE SIGNS DIRECTING YOU TO WILL CALL. INFORMATION BOOTH - OUR STAFF IS AVAILABLE FOR ANY QUESTIONS OR CONCERNS AT THE INFORMATION BOOTH, LOCATED INSIDE THE CONCERT BOWL. LOST & FOUND - WE WILL FACILITATE ALL LOST & FOUND AT THE INFORMATION BOOTH. IF AN ITEM IS FOUND, WE ASK THAT ALL PATRONS RETURN IT TO THE INFO BOOTH IN EXCHANGE FOR SOME GOOD KARMA. THE CUSTOMER SERVICE TEAM WILL KEEP TRACK OF ALL REPORTED MISSING ITEMS TO HELP RETURN THEM TO THEIR OWNER. MEDICAL SERVICES / FIRST AID - MEDICAL SERVICES IS LOCATED NEAR THE EAST ENTRANCE. IF YOU HAVE A MEDICAL NEED, PLEASE VISIT OUR FIRST AID TENT. MERCHANDISE - IN ADDITION TO COUNTRY THUNDER FESTIVAL MERCH, ARTISTS WILL HAVE THEIR OWN MERCH AVAILABLE FOR SALE. FOOD & BEVERAGES OUTSIDE FOOD AND BEVERAGES ARE NOT ALLOWED INSIDE THE CONCERT BOWL, WITH THE EXCEPTION OF ONE FACTORY-SEALED PLASTIC BOTTLE OF WATER. TO PURCHASE OR CONSUME ALCOHOL, ALL FANS ARE REQUIRED TO WEAR AN AGE VERIFICATION WRISTBAND. VISIT ONE OF OUR ALCOHOL ID BOOTHS LOCATED AT EACH FESTIVAL BOWL ENTRANCE AND SHOW YOUR ID TO RECEIVE THE WRISTBAND. THE AGE VERIFICATION WRISTBAND IS GOOD FOR THE FULL EVENT. EVEN IF A FAN IS OVER 30, THEY MAY BE ASKED FOR PHOTO ID. AN AGE VERIFICATION WRISTBAND IS RECOMMENDED TO ANYONE WHO REGULARLY GETS CARDED. *PLEASE KEEP YOUR PHOTO ID ON YOUR PERSON, AS A BARTENDER OR MEMBER OF LAW ENFORCEMENT CAN ASK TO VERIFY YOUR AGE AT ANY TIME. CLICK HERE FOR THE LIST OF ONSITE FOOD VENDORS. ACCESSIBILITY WE AIM TO PROVIDE A SAFE, COMFORTABLE, AND ENJOYABLE EXPERIENCE FOR ALL FANS. PLEASE REVIEW ALL OF OUR ACCESSIBILITY OPTIONS BELOW. IF YOU NEED ANY ADDITIONAL INFORMATION OR NEED TO MAKE A SPECIAL REQUEST REGARDING AN ACCOMMODATION, YOU CAN CONTACT LENORE@COUNTRYTHUNDER.COM . ACCESSIBLE VIEWING AREA - WE OFFER AN ADA ACCESSIBLE VIEWING AREA, LOCATED IN THE GENERAL ADMISSION SECTION BEHIND GOLD SEATING. THE AREA OFFERS LIMITED SEATING, SO WE ASK THAT DISABLED FANS BRING ONLY ONE GUEST. THIS AREA IS ACCESSIBLE TO ANYONE WITH ADMISSION WHO INDICATES THEY NEED ACCESSIBLE SEATING. PLEASE NOTE THAT AS THE CROWD THICKENS, IT MAY BE DIFFICULT TO ACCESS THIS AREA, SO WE SUGGEST YOU ARRIVE EARLY. ACCESSIBLE PARKING - ACCESSIBLE PARKING IS PROVIDED TO THOSE FANS WITH A HANDICAP PLATE OR PLACARD. THEY WILL BE CHARGED FOR PARKING BY THE TAMPA SPORTS AUTHORITY, AND WILL BE DIRECTED TO ADA PARKING IN LOT C. RAYMND JAMES STADIUM WILL BE INDEPENDENTLY OPERATING ACCESSIBLE GOLF CART RIDES FROM THE ADA PARKING AREA IN LOT C. ALLERGIES & DIETARY RESTRICTIONS - IF YOU HAVE A TRUE ALLERGY OR DIETARY RESTRICTION, PLEASE INFORM SECURITY WHEN YOU ENTER THE FESTIVAL. YOUR FOOD AND CLEAR BAG ARE SUBJECT TO SEARCH, BUT REASONABLE AMOUNTS OF FOOD WILL BE ALLOWED INSIDE THE FESTIVAL. ​ IF YOU HAVE A DOCTOR'S NOTE OR OTHER DOCUMENTATION, IT CAN BE HELPFUL TO HAVE IT AVAILABLE UPON OUR SECURITY STAFF'S REQUEST. MEET & GREETS WE LOVE TO GIVE YOU SPECIAL EXPERIENCES AT THE FESTIVAL, INCLUDING THE OPPORTUNITY TO MEET YOUR FAVORITE ARTISTS! WE DO NOT SELL MEET & GREETS, BUT WILL HAVE CHANCES TO WIN. KEEP AN EYE ON COUNTRY THUNDER'S SOCIAL MEDIA AND NEWSLETTERS OR VISIT OUR PARTNER BOOTHS AT THE FESTIVAL. THEME DAYS INFORMATION ON 2026 THEME DAYS WILL BE ANNOUNCED CLOSER TO THE FESTIVAL. About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/privacypolicy?lang=en",
      "text": "Country Thunder Music Festivals - Privacy Policy top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. SELECT THE TOPIC BELOW ABOUT US TERMS OF SERVICE PRIVACY POLICY WEBSITE MOBILE APP ​ WEBSITE PRIVACY POLICY ​ Effective Date: March 29, 2017 ​ COUNTRY THUNDER - PRIVACY POLICY ​ Country Thunder Holdings LLC. (\"we\", \"us\", \"our\") are committed to protecting and respecting your privacy. ​ This Privacy Policy (together with our Terms of Use and any other documents referred to in this Privacy Policy) describes how we collect, receive, use, transfer or otherwise process information (which may include personal information) we collect from you, or that you provide to us, through website (“Service”). Please read this Privacy Policy carefully to understand how we will treat your information. BY USING THE SERVICE, YOU ARE ACCEPTING AND CONSENTING TO THE PRACTICES DESCRIBED IN THIS PRIVACY POLICY (AS UPDATED OR AMENDED FROM TIME TO TIME). IF, FOR ANY REASON, YOU DO NOT AGREE TO THE TERMS OF THIS PRIVACY POLICY, PLEASE STOP USING THE SERVICE AND/OR THIS SITE IMMEDIATELY. WHO WE ARE ​ This Service is operated by Country Thunder Holdings LLC. As used in this Privacy Policy, the terms \"Country Thunder Companies\", \"we\", \"us\" and \"our\" refer to Country Thunder Holdings LLC and all entities it controls, is controlled by or is under common control with, including subsidiaries, joint ventures or other entities in whom Country Thunder LLC has a substantial ownership interest. If you would like a list of relevant entities, please send an email to info@countrythunder.com . ​ INFORMATION WE MAY COLLECT FROM YOU ​ When you use the Service, you may provide us with, and we may collect from you, information that relates to you, including your personal information. You may provide us with your information in a number of ways, including: completing forms on the Service (such as \"Contact Us\" forms) corresponding with us by e-mail, phone or otherwise; subscribing to email updates, newsletters or other subscriptions and features made available on the Service from time to time reporting  problem or requesting support for the Service; make a purchase from us using the Service; creating an account and/or signing in to our Service, including signing in using your social media account(s); communicating with us through third party social media websites or applications; and participating in our contests, promotions, sweepstakes or surveys on the Service. The information you give us may include your name, address, e-mail address, phone number, date of birth, photos, videos, payment information and social media account details (such as Facebook and Twitter). INFORMATION WE COLLECT ABOUT YOU ​ With regard to your use of the Service, we may automatically collect the following information: technical information, including IP address, login information, browser type and version, time zone setting, browser plug-in types and versions, operating system, platform, device type, hardware model, MAC address, unique device identifiers and mobile network information; information about your visit, including the full URL clickstream to, through and from our Service (including date and time); information about your network, such as information about devices, nodes, configurations, connection speeds, and network and application performance; pages you viewed or searched for; page response times, download errors, length of visits to certain pages, page interaction information (such as scrolling, clicks, and mouse-overs), and methods used to browse away from the page. ​ Events Information If you attend Country Thunder events where we or any of the other Country Thunder Companies, are capturing audio and video recordings, we may also collect sounds clips and images of you. INFORMATION WE COLLECT FROM OTHER SOURCES ​ We may receive information about you (including your personal information) if you use any of the other websites or applications operated by the Country Thunder Companies or the other services the Country Thunder Companies provide. In this case we will inform you when we collect that information that it may be shared internally and combined with information collected on the Service. We may also receive and display information and content which you make publically available on your social media account. If you log in to or access the Service using a third party social media platform, we will have access to certain information from that platform, such as your email address, friends list and profile information. We also work closely with third parties (including, for example, business partners, sub-contractors in technical services, advertising networks, analytics providers and search information providers) and may receive information about you from them. ​ HOW WE USE YOUR INFORMATION ​ We may use information we have about you in the following ways: Information you give to us. We will use this information to: help us respond to your queries; carry out our obligations arising from any contracts entered into between you and us and to provide you with the information, products and services that you request from us; send you our newsletter, email updates and other subscriptions which we make available from time to time and which you subscribe to receiving; provide you with information about other goods and services we offer that are similar to those that you have already purchased or enquired about; provide you, or permit selected third parties to provide you, with information about content, goods or services we feel may interest you; notify you about changes to our Service and other services; ensure that content from our Service is presented in the most effective manner for you and for your computer; facilitate contests, promotions, sweepstakes or surveys on the Service; monitor and analyse trends, usage and activities in connection with the Service; as necessary if we believe there has been a breach of the Terms of Use or the rights of any third party; and comply with legal and regulatory requirements. Information we collect about you. We will use this information: to administer the Service and for internal operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes; to improve the Service to ensure that content is presented in the most effective manner for you and for your computer; to allow you to participate in interactive features of the Service, when you choose to do so; as part of our efforts to keep the Service safe and secure; to measure or understand the effectiveness of advertising we serve to you and others, and to deliver relevant advertising to you; to monitor and analyse trends, usage and activities in connection with the Service; and to make suggestions and recommendations to you and other users of our Service about goods or services that may interest you or them. Information we receive from other sources. We may combine information we receive from other sources with information you give to us and information we collect about you. We may use this combined information for the purposes set out above. ​ DISCLOSURE OF YOUR INFORMATION ​ We may share your personal information with any of the Country Thunder Companies (including WME IMG LLC) and with selected third parties including: business partners, suppliers and sub-contractors for the performance of any contract we enter into with them or you in order to provide you with a product or service; business partners, suppliers and sub-contractors to provide you with information about promotions and offers; aggregated, anonymised or other data to advertisers, advertising networks and social networks that require the data to select and serve relevant adverts to you and others. We may also use aggregate information to help advertisers reach the kind of audience they want to target. We may make use of the personal information we have collected from you to enable us to comply with our advertisers' wishes by displaying their advertisement to that target audience; and analytics and search engine providers that assist us in the improvement and optimisation of the Service. ​ We may disclose your personal information to third parties: in the event that we sell or buy any business or assets, in which case we may disclose your personal information to the prospective seller or buyer of such business or assets; if the Country Thunder Companies that control this Service or substantially all of its assets are acquired by a third party, in which case personal information held by it about its customers will be one of the transferred assets; if we are under a duty to disclose or share your personal information in order to comply with any legal obligation, or in the event of an emergency, or in order to enforce or apply our Terms of Use  and other agreements, or to protect the rights, property, or safety of the Country Thunder Companies, our customers, clients or others; and to any other third party with your prior consent to do so. ​ SOCIAL SHARING FEATURES ​ The Service may offer social sharing features and other integrated tools such as the Facebook \"like\" button, which lets you share actions you take on the Service with other media and vice versa. Your use of such features enable the sharing of information with your friends or the public, depending on the settings you establish with the entity that provides the social sharing feature. For more information about the purpose and scope of data collection and processing in connection with social sharing features, please visit the privacy policies of the entities that provide these features. ​ NOTIFICATIONS ​ When using the Service you may choose to accept notifications from us. You can opt in to receive mobile push notifications from us. If you subsequently decide you no longer wish to receive these notifications, you can use your mobile device’s settings functionality to turn them off. ​ STORAGE AND TRANSFER OF INFORMATION ​ Your information may be stored on servers in the United States and is subject to the laws of the United States, where the data protection and other laws may differ from those of other countries. Your information may be disclosed in response to inquiries or requests from government authorities or to respond to judicial process in the countries in which we operate. By accessing or using the Service or otherwise providing information to us, you consent to the processing, transfer and storage of information in and to the United States and other countries, where you may not have the same rights and protections as you do under local law. ​ We will take all steps reasonably necessary to ensure that your personal information is treated securely and in accordance with this Privacy Policy. We have put in place commercially reasonable technical and organisational procedures to safeguard the information and personal information we collect on the Service. ​ Unfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal information, we cannot guarantee the security of your information transmitted to the Service; any transmission is at your own risk. Once we have received your personal information, we will use strict procedures and security features to try to prevent unauthorised access. ​ CHILDREN ​ By using this Service, you agree to respond truthfully and accurately about your age if asked. We do not knowingly collect information from children who are 13 years old or younger. If you are 13 years old or younger, you may not submit any personal information to us. ​ YOUR CALIFORNIA PRIVACY RIGHTS ​ California Civil Code Section 1798.83 permits users of the Service that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request pursuant to California Civil Code Section 1798.83, please send an e­mail to info@countrythunder.com . ​ YOUR CHOICES ​ You may have the opportunity to receive certain communications from us related to the Service. If you provide us with your email address in order to receive communications, you can opt out at any time by using the unsubscribe links at the bottom of our emails. ​ SECURITY ​ We have implemented commercially reasonable technical and organisational procedures measures designed to secure your personal information from accidental loss and unauthorised access, use, alteration or disclosure. However, the internet is an open system and we cannot and do not guarantee or warrant the security of any information that you transmit on or through the Service or that we otherwise maintain. LINKS TO THIRD PARTY WEBSITES ​ Our Service, newsletters, email updates and other communications may, from time to time, contain links to and from the websites of others, including our partner networks, retail partners, advertisers and affiliates. If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies. ​ CHANGES TO OUR PRIVACY POLICY ​ Any changes we may make to our Privacy Policy will be posted on this page. Please check back frequently to see any updates or changes to our Privacy Policy. If you do not agree or consent to these updates or changes, do not continue to use the Service. ​ CONTACT Questions, comments and requests regarding this Privacy Policy should be emailed to info@countrythunder.com . About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/about-us",
      "text": "Country Thunder Music Festivals - About us top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. SELECT THE TOPIC BELOW ABOUT US TERMS OF SERVICE PRIVACY POLICY ​ ABOUT COUNTRY THUNDER ​ EMAIL: info@countrythunder.com PHONE: 1.866.388.0007 ​ Country Thunder is a music festival brand that hosts several concerts in North America each year. They have operated festivals in Wisconsin and Arizona since 1996, and shows in Saskatchewan since 2005 and in Alberta since 2016. In 2019, Country Thunder Florida joined the family! Past acts include: Garth Brooks, Kenny Rogers, John Denver, Dolly Parton, Willie Nelson, Tim McGraw, Clint Black, Alan Jackson, Brad Paisley, Reba McEntire, George Strait, Taylor Swift and Kenny Chesney plus many many more! CT ARIZONA EVENT LOCATION: 20585 E. Price Station Rd., Florence, AZ 85132 CT WISCONSIN EVENT LOCATION: 2305 Lance Drive, Twin Lakes, WI 53181 CT ALBERTA EVENT LOCATION: 223 Castleridge Blvd NE, Calgary, AB T3J 3J8 CT SASKATCHEWAN EVENT LOCATION: 50.702220, -104.808011, Craven, SK S0G 0W0 ​ COUNTRY THUNDER MAILING ADDRESSES: ​ US MAILING ADDRESS: 730 Gallatin Pike N., Nashville, TN 37115 CANADA MAILING ADDRESS: 1602E McDonald Street Regina, SK S4N 6R5 About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/single-post/2018/10/04/Introducing-Country-Thunder-Florida",
      "text": "Introducing Country Thunder Florida top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. Introducing Country Thunder Florida Country Thunder Oct 4, 2018 3 min read We’re comin’ down south! Previously Runaway Country, Country Thunder Florida will be held in Osceola Heritage Park is Kissimmee, FL on March 22nd to the 24th, 2019. Luke Bryan, Toby Keith, Luke Combs and more are scheduled to perform! “We’ve been wanting to bring Country Thunder to this part of the world for some time, and we’re thrilled for this opportunity,” says Country Thunder Music Festivals CEO Troy Vollhoffer. “The timing was right, and we’re putting together a talent line-up and overall festival experience which fans of the Country Thunder brand have come to expect. “Florida is one of the best country music markets in North America and we’re going to put on a show that will have these fans coming back year in and year out.” With its own rich entertainment history, the natural beauty of Osceola Heritage Park will serve as the perfect backdrop for an event and fan experience of this magnitude. “We are thrilled that Country Thunder Florida will be happening at our facility,” says General Manager, Robb Larson. “Their history of success is impressive, and having them come in to pick up where Runaway Country left off is a dream come true. “Our 190-acre entertainment complex combined with the Country Thunder brand and their expertise will take this annual event to new heights.” Taking full advantage of the entire complex for a massive main stage production and concert bowl, secondary stage, food, beverage and retail vendors, camping, parking and amenities, the fabulous Silver Spurs Arena will also showcase an added attraction which is sure to put the entire weekend over the top. In addition to three days of the biggest and best acts that country music has to offer, the RAM National Circuit Finals Rodeo will also be taking place during the festival. “The pairing of Country Thunder Florida and the RAM National Circuit Finals Rodeo maximizes the value for fans and promises a new level of entertainment for everyone,” says Osceola Commission Chairman, Fred Hawkins. “This is yet another step in making Osceola County a destination for a great country music and rodeo experience. “We are excited to be working with an organization who is going to build on some past traditions and elevate these two signature events at Osceola Heritage Park.” Country Thunder Music Festivals is also honored to partner with Nemours  Children’s Hospital, and the opportunity to give back in the communities of Central Florida “The earned proceeds of this partnership with Country Thunder will make an impact on children and families when they need it most,” says Nemours Children’s Hospital President Dana Nicholson Bledsoe. “Fans can mingle and enjoy fantastic performances, while at the same time help children and families who are going through some of the most challenging times of their lives.” Conventional wisdom suggests that, if you build it they will come, and the first wave of artist announcements has certainly makes the desired statement. Luke Bryan needs no introduction in these parts, and Country Thunder Florida fans will be in for a treat when he headlines on Sunday night. The bona fide superstar has been at the top of his game for the better part of the past decade: Six smash albums, two dozen hit singles, an endless string of sold-out concert tours and every industry award imaginable . . . any questions? No stranger to superstardom himself, the resurgence of Toby Keith has been a welcome one since the Oklahoman bridged the gap from classic country in the early ‘90s, to his 2015 smash, 35MPH Town. With over 20 No. 1 singles to Keith’s credit, it will be impossible to play them all in Kissimmee . . . but we’re sure he’ll try! Luke Combs, meanwhile, has been the fastest rising country star of the past several years. His 2017 debut album yielded an astounding three consecutive No. 1 hits, including Hurricane, When It Rains It Pours and One Number Away. And that’s just the beginning . . . many more artist announcements coming soon! Tickets and camping are on sale now! Three-day general admission passes include access to a standing room area, which allows fans to get up close and person with their favorite artists. For an upgraded experience, fans can chose between Reserved Seating or the Platinum Experience. Campers are sure to find a home that suites their needs, whether they're pitching a tent or bringing an RV! For an upgraded experience, fans can chose between Glamping and Premier. We are so excited to for the inaugural year of Country Thunder Florida! Give us a call at 866.388.0007 or visit us online at www.countrythunder.com/fl. Tags: country thunder florida Kissimmee Rodeo Runaway Country Country Thunder Florida Featured Posts Getting to Country Thunder Bristol 2023 Who's Craving Craven? Recent Posts Getting to Country Thunder Bristol 2023 Country Thunder Arizona's NEWEST Experience A look at the Country Thunder Arizona schedule! Let's Get Wild in Wisconsin! The Songs of Country Thunder Who's Craving Craven? Are Y'all Ready For Country Thunder Arizona 2023? Camping Instructions for Country Thunder Bristol Parking Instructions for Country Thunder Bristol Who's Ready For Country Thunder Florida? Archive October 2023 (1) 1 post February 2023 (3) 3 posts January 2023 (2) 2 posts November 2022 (1) 1 post September 2022 (2) 2 posts May 2022 (5) 5 posts February 2022 (1) 1 post December 2021 (1) 1 post October 2021 (4) 4 posts September 2021 (1) 1 post August 2021 (5) 5 posts July 2021 (4) 4 posts June 2021 (7) 7 posts May 2021 (6) 6 posts April 2021 (1) 1 post March 2021 (1) 1 post October 2020 (1) 1 post August 2020 (2) 2 posts July 2020 (2) 2 posts June 2020 (1) 1 post May 2020 (2) 2 posts March 2020 (2) 2 posts November 2019 (2) 2 posts October 2019 (3) 3 posts February 2019 (1) 1 post November 2018 (3) 3 posts October 2018 (2) 2 posts September 2018 (1) 1 post August 2018 (2) 2 posts July 2018 (3) 3 posts November 2017 (1) 1 post October 2017 (3) 3 posts August 2017 (1) 1 post July 2017 (2) 2 posts Search By Tags Advice (1) 1 post Alberta (3) 3 posts App (1) 1 post Blog (1) 1 post Brett Eldredge (1) 1 post CTNation (6) 6 posts Calgary (2) 2 posts Dierks Bentley (3) 3 posts Kissimmee (5) 5 posts Rodeo (1) 1 post Runaway Country (1) 1 post Tickets (1) 1 post Tim McGraw (3) 3 posts Tips (1) 1 post Transportation (1) 1 post Visit Calgary (1) 1 post arizona (5) 5 posts arizona music festival (1) 1 post camp cooking (1) 1 post camping (4) 4 posts camping music festival (11) 11 posts chris stapleton (3) 3 posts cody johnson (2) 2 posts country clones (1) 1 post country music (19) 19 posts country music festival (26) 26 posts country thunder (33) 33 posts craven (1) 1 post dallas smith (1) 1 post florence (1) 1 post florida (5) 5 posts florida country music (1) 1 post florida festival (1) 1 post forest city (1) 1 post iowa (4) 4 posts iowa country music (1) 1 post jake owen (2) 2 posts jon pardi (2) 2 posts luke bryan (3) 3 posts luke combs (1) 1 post music (1) 1 post music festival (14) 14 posts playlist (1) 1 post prairie winds park (1) 1 post saskatchewan (3) 3 posts spotify (1) 1 post toby keith (1) 1 post twin lakes (3) 3 posts winnebago camping (1) 1 post wisconsin (4) 4 posts Follow Us About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://secure.qgiv.com/event/countrythunder",
      "text": "Country Thunder Music Festival, Orlando - Country Thunder Music Festival Skip to content Log In or Sign Up Home Donate Purchase Tickets Festival Information Nemours Information Go to My Donor Account Search  Menu Search  Sign In or Sign Up Welcome back ! It looks like you previously participated in a different event , but you're not registered for this fundraiser yet. Sign Up Now or continue to My Donor Account Email Address Password I need help with my password Email Address Sign In or sign in using Sign Up Now  Home Donate Purchase Tickets Festival Information Nemours Information Nemours Children's Health System is the proud charity partner of the Country Thunder Music Festival and will host our third annual Nemours Garden Party, presented by Waste Connections, held during each day of the festival.  Don't miss an amazing lineup of today's hottest country music stars! Tickets to the Nemours Garden Party include: Full weekend general admission Weekend-long access to our VIP tent and lounge, including great views of the stage, upgraded and private restrooms, private bar, daily food and snacks, shaded seating, phone charging stations, and more! Tickets are $299 per person, plus taxes and fees.  $75 from every ticket sold to the Nemours Garden Party will go directly to support the children at Nemours! All proceeds from the Nemours Garden Party will benefit orthopedics for children at Nemours Children's Hospital in Orlando. PLEASE NOTE: Clicking the \"Purchase Tickets\" button will take you directly to the Country Thunder website to finalize your purchase. Please select the \"Weekend Nemours Garden Party Admission\" option. What is the Country Thunder Music Festival? Country Thunder Florida is a three-day music festival featuring today's hottest country music artists. This year's festival is on September 10 -12, 2021 at the beautiful Osceola Heritage Park in Kissimmee, FL. All festival details, including artist lineup, tickets, camping information, maps, and more are available on the Country Thunder Florida website. Contact us If you have questions or would like additional information, please contact: Parker Smith Associate Director, Philanthropy (407) 576-2646 parker.smith@nemours.org Privacy Policy × Who's fundraising? Hi ! You're managing 0 fundraising profiles. Choose a participant to switch to their fundraising dashboard. Nevermind"
    },
    {
      "url": "https://www.countrythunder.com/connect",
      "text": "Country Thunder Music Festivals - Connect top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. Questions? We can be reached at 1.866.388.0007 , Monday through Friday, 9am to 5pm Central Time. You may also email us at info@countrythunder.com . FOOD & RETAIL VENDORS We are no longer accepting vendor applications for our 2025 US Festivals. Apply to be a retail vendor at one of our Canadian Festivals | Apply to be a food vendor at one of our Canadian Festivals ​ Questions? Please contact vendors@countrythunder.com . ​ SPONSORS & Partners Interested in becoming a sponsor or partner? Please contact sponsors@countrythunder.com . MEDIA Interested in covering one of our events? Please fill out our application here for our US shows. If you're interested in covering one of our Canadian festivals, please fill out our application here. Questions? Please contact media@countrythunder.com . CANADIAN STREET TEAM Spread the word, get rewarded! We’re looking for passionate fans to come work with us on our street team in exchange for some really cool perks! Interested? Applications are open for Country Thunder Saskatchewan + Country Thunder Alberta. Saskatchewan Application | Alberta Application STAFF Interested in working with the Country Thunder team? Select an application below. US Application Canadian Application ​ Interested in working as a bartender at one of our US festivals? Please email cj@cnceventservices.com using the subject line \"Bartending\" and indicate which festival location you are interested in. *PLEASE NOTE - we are unable to forward any requests to bartend at our Canadian festivals* non-profit DONATION REQUESTS ***Please allow 4 to 6 weeks for a response after submission.*** Our 2025 Request Form is now available here . ​ ARTISTS Interested in performing at a Country Thunder Music Festival? Please fill out our application and we'll contact you, based on availability. Vendor Applications About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://2911.us/country-thunder-music-festival-rolls-into-kissimmee-florida-this-weekend/",
      "text": "COUNTRY THUNDER MUSIC FESTIVAL ROLLS INTO KISSIMMEE, FLORIDA THIS WEEKEND | 2911 Enterprises, Inc. +1-833-537-2911 MissionCTRL@2911.us Instagram Linkedin Twitter Facebook Instagram Linkedin Twitter Facebook ABOUT NEWS CLIENTS CONTACT Select Page COUNTRY THUNDER MUSIC FESTIVAL ROLLS INTO KISSIMMEE, FLORIDA THIS WEEKEND Mar 19, 2019 Superstars Luke Bryan, Toby Keith, Luke Combs And Many More Invade Osceola Heritage Park This Weekend! KISSIMMEE, Fla. – Final details, stage lineups, and fan information is out now for this weekend’s Country Thunder Florida 2019 ! The inaugural Florida event rolls into fabulous Osceola Heritage Park in Kissimmee, Fla. March 22-24. The timing could not be better – 10 ACM nominations for CT Florida artists, and the sensational Luke Combs enjoying his fifth straight No.1 hit, the forecast could not be more perfect and the lush, green surroundings of the massive festival site in Kissimmee make this the perfect weekend for Country Thunder Music Festivals’ Florida debut! The massive stage is well into its three-day construction, the gigantic Electric Thunder tent is up, the endless array of food, beverage and retail vendors are arriving in droves and the atmosphere among Florida’s country music faithful has already reached a fevered pitch. Toby Keith , Luke Bryan , and Luke Combs will headline the festival, with Chris Lane , Granger Smith , Lanco , Tracy Lawrence , High Valley , Mitchell Tenpenny , Maddie and Tae , Jimmie Allen , Runaway June , Restless Heart , Waterloo Revival , Jameson Rodgers , Noah Schnacky , Scooter Brown and more will shake the massive main stage all weekend long! Over at Electric Thunder . . . more live music, line-dancing, games, DJs and more. In addition to three days of the biggest and best acts that country music has to offer, the RAM National Circuit Finals Rodeo will also take place during the festival just a few steps away at the Silver Spurs Arena. “CT Nation has come to expect the biggest and best when it comes to our headline artists,” says Country Thunder Music Festivals CEO & Executive Producer Troy Vollhoffer. “We’re incredibly proud to have Luke Bryan, Toby Keith and Luke Combs in Florida, but we also know that it’s a balance of headliners, combined with red-hot up-and-comers and heritage acts who have stood the test of time which creates the total festival experience.” TICKETS ARE GOING FAST! Three-day GA passes (including a new standing room area which allows fans to get up close and personal with their favorite CT stars), reserved seating, Platinum Experience, camping, glamping and all the extras are available by visiting countrythunder.com . Order by phone at 1-866-388-0007. Facebook, Twitter and Instagram all @countrythunder. Fans can the get latest and greatest festival information in the palm of their hand, on their favorite Android or iOS device. Click here to download the brand-new Country Thunder app today! The Country Thunder Music Festivals organization has a 15-year history which boasts four other major multi-day events in North America, including the reigning ACM Festival Of The Year in Arizona. The organization also hosts events in Wisconsin, Alberta and Saskatchewan. # # # ~ ADDITIONAL INFORMATION ~ PARKING: What kind of parking passes do you offer? We’ve got ’em all! If you’re parking on your campsite, please see information regarding extra vehicle passes under our “Services” page, or by clicking here . SHUTTLES: There will be a complimentary shuttle courtesy of iTouchOrlando. Shuttles will depart from Pointe Orlando (9101 International Drive Orlando, FL.) When you arrive, park at Pointe Orlando and head to the iTouchOrlando Welcome Center – Suite 1152. ​ CAMPGROUND CHECK-IN: Campground check-in will be Thursday, March 20 through Sunday, March 24 from 9:00 (AM) to 9:00 (PM). CONCERT AREA: The concert area opens at 1:00 (PM) on Friday and Saturday and at 1:30 (PM) on Sunday. To view the entire festival lineup, please click here . Suggested tweet: .@CountryThunder Florida #festival kicks off this weekend, March 22-24. For tickets, visit countrythunder.com #CountryThunderFL For National press, contact: Jeremy Westby, jpw@2911.us ,\n833-537-2911 x800 Jason Ashcraft, jason@2911.us ,\n833-537-2911 x801 For media\ncredentials & festival info, contact: Gerry Krochak, gerry@countrythunder.com ,\n403-629-8902 GET MEDIA ALERTS * indicates required Email Address * First Name Last Name Company Mobile Phone If you would like to receive text alerts, enter your phone # Office Phone Zip/Postal Code Marketing Permissions 2911 Media will use the information you provide on this form to be in touch with you and to provide updates and marketing. Please let us know all the ways you would like to hear from us: Email Direct Mail Customized online advertising You can change your mind at any time by clicking the unsubscribe link in the footer of any email you receive from us, or by contacting us at news@2911.us. We will treat your information with respect. For more information about our privacy practices please visit our website. By clicking below, you agree that we may process your information in accordance with these terms. We use Mailchimp as our marketing platform. By clicking below to subscribe, you acknowledge that your information will be transferred to Mailchimp for processing. Learn more about Mailchimp's privacy practices here. All Content © 2025 2911 Enterprises, Inc.  Website Design By The Corps"
    },
    {
      "url": "https://www.fox35orlando.com/news/country-thunder-florida-2024-lineup-tickets",
      "text": "Country Thunder Florida 2024: Lineup announced, including Jon Pardi, Bailey Zimmerman & more | FOX 35 Orlando Live News Weather Good Day We Love Florida Contests More Watch Live Expand / Collapse search ☰ Search site News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests River Flood Warning is in effect, Lake County, Volusia County 3 Rip Current Statement until FRI 5:00 AM EDT, Coastal Flagler County Rip Current Statement until SAT 4:00 AM EDT, Coastal Volusia County Country Thunder Florida 2024: Lineup announced, including Jon Pardi, Bailey Zimmerman & more By Dani Medina Published April 5, 2024 11:48am EDT Kissimmee FOX 35 Orlando Share Copy Link Email Facebook Twitter LinkedIn Reddit Charly Reynolds speaks ahead of Country Thunder Local county artist Charly Reynolds speaks ahead of the Country Thunder music festival in Kissimmee, Florida. KISSIMMEE, Fla. - Country Thunder is back, Florida! The country music festival held in Kissimmee every year announced its star-studded lineup this week for the October event. Here's a look: CONCERTS COMING TO FLORIDA : Taylor Swift, Morgan Wallen, Bad Bunny & more Friday, October 18 Bailey Zimmerman (headliner) Nate Smith Priscilla Block Restless Road Emily Ann Roberts Calder Allen FRISCO, TEXAS - MAY 11: Bailey Zimmerman performs onstage during the 58th Academy Of Country Music Awards at The Ford Center at The Star on May 11, 2023 in Frisco, Texas. (Photo by Theo Wargo/Getty Images) Saturday, October 19 Jon Pardi (headliner) Russell Dickerson ERNEST Dallas Smith Clayton Mullen Annie Bosko INDIO, CALIFORNIA - APRIL 28: Jon Pardi performs onstage during Day 1 of the 2023 Stagecoach Festival on April 28, 2023 in Indio, California. (Photo by Monica Schipper/Getty Images for Stagecoach) Sunday, October 20 Luke Combs Mitchell Tenpenny Niko Moon Alana Springsteen AUSTIN, TEXAS - APRIL 25: Luke Combs performs onstage during the 2024 Mack, Jack & McConaughey Gala at ACL Live on April 25, 2024 in Austin, Texas. (Photo by Amy E. Price/Getty Images) Country Thunder Florida tickets Tickets for Country Thunder Florida are on sale now. Here's a look at pricing: Weekend general admission: $300 + fees Gold Circle standing room: $350 + fees Platinum experience: $625 + fees Reserved seating: $350 + fees Click here for more details. Kissimmee Osceola County Central Florida News Florida Entertainment Instastories Latest News Teen killed, 5 men hurt in shooting at Tampa apartment complex Live Now WATCH: 9/11 remembrance ceremony, annual reading of names Live Now Remembering 9/11: Reading of the names, Tribute in Light and NYC street closures September 11, 2001 timeline of attacks and events Dallas beheading: Victim identified, suspect charged with capital murder Trending Driver killed, passenger injured after crash goes undiscovered for hours in Lake County Volusia County mom charged after children found in roach-infested, unsafe home: Deputies Substitute teacher banned from Orange County schools after making threats to students, district says National Hurricane Center: Tropical wave in Atlantic eyed for potential development Florida appeals court strikes down state’s open-carry gun ban Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . FOX LOCAL Stream FOX 35 Orlando for free with FOX LOCAL Watch local news, weather, and live events on Roku, Fire TV, and more — just search “FOX LOCAL” News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://www.countrythunder.com/policies",
      "text": "Country Thunder Music Festivals | Policies top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. POLICIES COUNTRY THUNDER BAG POLICY With a goal of providing a superior music festival environment, and outstanding customer service to our fans, we also have a responsibility in providing the same standards for the levels of safety and security to everyone who enters through the gates of all Country Thunder events. With six festivals in North America, the well-being of our patrons has been, and always will be our top priority. With that in mind, and in an effort to enhance security measures at all Country Thunder Music Festivals, we adopted a new clear bag policy in the concert area starting in the 2018 Festival season. Similarly to football stadiums and many arenas across North America, up to 14” x 14” clear plastic bags, standard one-gallon freezer bags and small clutches and purses will be permitted, while items such as backpacks, large purses, and coolers will be prohibited. For further information on this new customer safety policy please email info@countrythunder.com or call 1-866-388-0007. COUNTRY THUNDER CODE OF CONDUCT As we look forward to yet another fantastic festival season, we would like to remind the world’s greatest country music fans to be safe and have fun. ​ Country Thunder Music Festivals is committed to providing a comfortable and relaxing entertainment experience in which you can always expect to be treated in a consistent, professional and courteous manner by all venue, security and operations personnel. The safety of our fans will always be our number one priority! ​ Country Thunder staff and performers have the same rights, and fans are responsible for their own behavior.  With that in mind, please remember to include this basic common-sense approach to your own Country Thunder Music Festivals code of fan conduct: ​ You are entitled to enjoy the Country Thunder experience free from disruptive or inconsiderate behaviors or unruly actions. Fans may not interfere with the event and/or performers in any manner. Any fan caught throwing anything at a performer or at the stage will be ejected from the festival with no refund. Please refrain from using abusive language or obscene gestures. Fighting, throwing objects or other behavior deemed detrimental to the experience of other guests will result in you going home early. For those of you who choose to consume alcohol, please do so in a safe and responsible manner. Intervention with an intoxicated or impaired fan will be handled in a prompt and efficient manner. Please comply with requests from festival staff regarding venue operational and emergency procedures. Fans may not engage in unauthorized commercial activity while on venue property. In helping to maintain these high standards, Country Thunder fans are encouraged to report inappropriate behavior to festival staff. Remember: SEE SOMETHING, SAY SOMETHING . Violation of the Fan Code of Conduct may result in eviction from the venue without a ticket refund. ​ Once again, and most importantly, be safe and have fun! COUNTRY THUNDER LIKENESS POLICY This event may be broadcast, recorded and publicized, and you may be filmed and/or photographed as part of the audience. By your attendance, you are granting your permission to be recorded for commercial purposes and agree to the following: being filmed, videotaped or photographed by any means; full use of your name, likeness, voice and words without compensation; specifically waiving all rights of privacy and/or publicity during the videotaping or filming and release Country Thunder, LLC, its parent, affiliate and subsidiary companies, and all of their respective agents, officers, directors, owners, parents, partners, affiliates, employees and consultants from liability for loss, damage or compensation for the use of your name, likeness, voice and words; and compliance with all rules and regulations of the event. TICKET TERMS & CONDITIONS For our international fans, please note that all ticket purchases must be placed over the phone to ensure accurate processing and delivery. Our customer service team is ready to assist you at 1-866-388-0007.​ Please read the following Terms and Conditions carefully. These rules apply to all purchases made online, over the phone, or in person for all Country Thunder Music Festivals. ​ Country Thunder is a rain or shine event. No refunds are provided for weather. ​ You are purchasing a ticket for Country Thunder, not for a specific artist. Artists and schedule subject to change without notice. Artist cancellation is not grounds for refund. The ticket is a revocable license for the time/date listed on the ticket. ​ “Management” means Country Thunder staff. Management reserves the right, without the refund of any portion of the ticket purchase price, to refuse admission or to eject any person who fails to comply with the rules of the venue, local, state/provincial or federal law or whose conduct is deemed illegal, disorderly, or offensive by Management. Persons entering the facility are subject to search for contraband. Ticket user bears all risks of personal injury incidental to the event, whether occurring before, during or after the event. Ticket user bears all risks, including cancellation of the event and of inclement weather. ​ Country Thunder is unable to oversee, guarantee, or verify any third party sales or transactions. We are not responsible for any transactions made to a contact outside of our organization or advertised business partners. We do not authorize or encourage purchases made through any unaffiliated third party. For your safety and peace of mind, we recommend ensuring that you are making legitimate purchases through Country Thunder or our advertised business partners. Making a legitimate purchase as our customer allows us to oversee, verify, and protect your purchase. The ticket may not be used for advertising promotion (including contests and sweepstakes), or other trade purposes without the express written consent of Management. ​ We kindly ask you to handle your festival wristband with care. In the event of loss or theft, wristbands will not be replaced, and you will have to purchase new wristband for the price of admission. No exceptions. Once securely fastened, wristbands cannot be loosened. If you accidentally tighten your wristband too much, we offer removal and replacement services for a fee of $20 at our Will Call booths. You must wear your wristband all weekend. ​ One wristband per person. Wristbands are non-transferrable. ​ You must wear your wristband for the entire duration of the festival. ​ No refunds. No exceptions. COUNTRY THUNDER CAMPGROUND RULES Greetings COUNTRY THUNDER Campers! Before heading out, and for the safety and enjoyment of everyone at this year’s festival, please take a moment to review our guidelines: ​ If you are dropping off a camper/RV for another fan, and you do not have full-event admission, you will need to purchase a Camper Drop Off pass. The person dropping off the camper/RV MUST have the name and campsite number from the registered site owner. Your campsite includes one vehicle pass, which will allow one vehicle to enter the campgrounds. A vehicle is anything with a motor, including an RV! If you are hauling a trailer, the trailer will not require a vehicle pass. If it has a steering wheel, it is considered a vehicle. Campsites vary in size. Your camping unit must not exceed the size you have purchased. Should your camping unit be oversize, you MUST purchase two (2) sites side by side. Under no circumstances can items in your campsite impede on another campsite. This includes camper/RV pop-out slides. The fee charged for camping is for the campsite for the entire weekend. ​ We do not limit the number of fans per campsite, as long as y'all fit - but you are responsible for all guests on your site. Respect your camping neighbors . ​ ​ Each campsite must be registered to one adult, 18 years of age or older.  This individual accepts full responsibility for the campsite. Any CT campground rules broken may mean eviction with NO REFUND, absolutely NO EXCEPTIONS. Country Thunder reserves the right to move any site/camper at its discretion, at any time prior to or during the festival. Best efforts will be made to relocate you to a site near the original location, however, new placement will be at Country Thunder’s sole discretion. Camping stickers must be placed on the motor vehicle belonging to the camping unit. Any vehicles / camping units without a camping sticker are subject for removal. Lost or stolen camping / vehicle stickers can be replaced for a fee. Limit 1 replacement per person. All vehicles will be subject to search upon entering the site. All campground occupants must wear a full-event wristband. ​ ​ Country Thunder considers motorcycles vehicles. Should you choose to bring a motorcycle to Country Thunder, it must have the appropriate tag (primary camping vehicle sticker, or Extra Vehicle Pass). All motorcycles found without the appropriate credential will be impounded. There is no designated motorcycle parking area in any of our campgrounds or parking lots. ​ Unlicensed vehicles, campers, trailers, motorcycles are not permitted on the Country Thunder Festival sites. Country Thunder may remove these at the owner’s expense.   All unlicensed vehicles will be removed after the festival, with tow bills sent to the registered owner of the campsite via mail. ​ No: ATVs, Golf Carts, Mopeds, Bicycles, Skateboards, Scooters, Hoverboards or any other similar devices, with the exception of those permitted for handicap transportation, are allowed. Unauthorized vehicles may be impounded and Country Thunder accepts no responsibility for such vehicles, or for any damage to unauthorized vehicles. A paid golf cart taxi system is available to get you around the campground area. Any unauthorized golf cart taxis will be removed and passed along to the local authorities. ​ Please keep the campground roads and driving lanes clear for emergency vehicle access at all times. Any vehicles found to be blocking the fire lane will be towed at owner’s expense. It is a non-negotiable if festival organizers or emergency crews require you to immediately move a vehicle or RV. Any stunting, unsafe operation or violation with a motor vehicle is prohibited, and anyone engaging in this behavior will be reported and/or turned over to the local police. Cruising or riding in the back of pickup trucks is prohibited in all camping areas. Country Thunder reserves the right to dismantle and/or remove any structure, pool, dance floor, or any other item that it determines to be a safety concern for CT patrons or staff. Upholstered household furniture is not allowed in the campgrounds. If you bring any of this furniture to  the festival site, you will be fined a minimum of $300 by campground staff. Arrangements can be made to return the payment by removing the furniture. ​ Generators will be allowed to operate between 7:00 am and Midnight. If your generator makes excessive noise and fumes it will be shut off. People with health-related issues that require generators to run all night must run “whisper mode” to not disturb other campers. Any non-compliance will result in eviction without refund. If festival organizers or emergency crew request that you turn off your generators, this request is non-negotiable. ​ ​ The Country Thunder site is beautiful - please help us to keep it that way. Please ensure that you bring trash bags with you to the festival, pick up your trash and keep your campsite clean. Please place bags in large dumpsters that are found at the end of each camping row. Owners of trash filled sites will be subject to a fine starting at a minimum of $300 and may have renewal rights suspended. Additional trash bags are available from campground staff or at the campground office. No one is permitted to enter the Country Thunder campgrounds before the official gate opening time. This includes, but is not limited to: scouting out campground layouts, grass mowing or site preparation, and setting up campsites. Any unauthorized entry prior to gate opening is considered trespassing and will result in removal from the premises, forfeiture of camping privileges, and potential legal action. Any site preparation (grass cutting, berm levelling) for remuneration is strictly prohibited. ​ Anyone found tampering, vandalizing, stealing, or destroying any property of Country Thunder or property of any other festival goers will be turned over to the authorities for prosecution. Country Thunder is not responsible for any materials misplaced, lost, damaged or stolen items or property. It is recommended that you do not bring valuable items. For your convenience showers, portable toilets, and non-potable water stations are available throughout the campground. If you cause damage to these properties or any other properties onsite you will face eviction and turned over to the authorities for prosecution. We love our pets, but Country Thunder strongly recommends that you leave your pets at home. The crowds can cause distress for many animals. If you do bring a pet to Country Thunder, you are responsible for your pet. Pets must be LEASHED and kept at your campsite at all times. You are responsible for cleaning up after your pet. Please keep your pet safe and secured on your campsite. Aggressive pets are not allowed, and will be removed from the campground at the discretion of festival organizers. No pets will be allowed into the festival bowl at any time (expect approved service dogs). Everyone entering the campgrounds must have a full-event wristband on. Single day ticket holders DO NOT have access to the campgrounds. If you are of legal drinking age and plan to drink alcoholic beverages, please carry your age identification (i.e. driver's license) with you at all times (even after being wrist banded), as you may be stopped and asked for identification. NO EXCEPTIONS. Under Age Drinking is NOT permitted in the campgrounds or on the event grounds. Anyone found participating in, or contributing to underage drinking may be evicted from the grounds immediately without refund. Consumption of alcoholic beverages, by those of legal drinking age, is allowed in your own camping area only. Alcohol consumption is prohibited on any roadways. Please drink responsibly. Open flame fires are prohibited at all Country Thunder Music Festivals. Other strictly prohibited Items: Glass bottles or containers Tiki torches Fireworks Cylinders or tanks of compressed air, or helium Paper (Chinese) lanterns Drones Knives, or weapons of any kind Firearms, or any types of explosives or ammunition Vulgar or offensive paraphernalia Illicit / illegal drugs Unauthorized vending or soliciting on site is strictly prohibited. This includes, but is not limited to: food, beverage, IVs, merchandise, and entertainment. Unauthorized selling of items will result in seizure of merchandise, eviction and possible prosecution. Unauthorized wrapped or sponsored vehicles may be turned away at the front gate, at the sole discretion of Country Thunder. No paid live music performances or campsite parties. ​ No publicly advertised or commercialized parties or gatherings in the campground. Country Thunder reserves the right to refuse admission or eject any person who is violating local, state/provincial, or federal laws, facility rules, or whose conduct is deemed illegal, disorderly, or offensive by management, without refund. ​ All patrons m ust be respectful of fellow festival-goers and campers. Any actions or behaviours that are detrimental to someone's festival experience may be removed from the festival site, without refund. Country Thunder reserves the right to modify or add any rules at any time. COUNTRY THUNDER PARKING LOT RULES Tailgating is not allowed in any parking lots (Reserved, Day, ADA, Glamping,Staff and Overnight) No RVs, Sleeping Units or Tents allowed in any lot at Country Thunder. Only accredited vehicles designated to be in the parking lots will be allowed to enter. Shall a vehicle without the proper accreditation to enter will be towed at the owner's expense. No person, structure, activity or vehicle should impede upon traffic flow in any parking lot. Any patrons who disagrees with an order from Country Thunder Staff, Security or Police will be subject to arrest by police and/or removal from the Country Thunder property. No Blocking or saving parking spaces. No unauthorized vehicles operated within the Country Thunder parking lots or walkways; including, but not limited to: Golf Carts, Side by Sides Go-karts, mini-bikes, scooters, etc. No unauthorized use of Country Thunder property No commercial activity of any kind (including, but not limited to advertising, promotion, solicitation, etc. without advance, written approval by Country Thunder) No sales or distribution of products, food or beverages.  Anyone selling alcohol or food will be subject to arrest by police and/or removal from the Country Thunder property. It is prohibited for a person under 21 years of age to possess or consume alcohol. Anyone furnishing alcohol to minors may be subject to arrest by police and/or removal from the Country Thunder property. Patrons should dispose of all trash and leave the designated area free of any debris. No open flame or charcoal and Gas grills are permitted. No cooking of any kind allowed in the parking lots All state and local laws, along with Country Thunder policies, are in effect in all parking lots at Country Thunder. Lawn games / drinking games are prohibited. Any amplified sound within the parking lots will be instructed to turn off. Any patrons who disagrees with an order from Country Thunder Staff, Security or Police will be subject to arrest by police and/or removal from the Country Thunder property. About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com",
      "text": "Country Thunder Music Festivals - Home top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. Button Button Button Button Button About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/privacypolicy",
      "text": "Country Thunder Music Festivals - Privacy Policy top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. SELECT THE TOPIC BELOW ABOUT US TERMS OF SERVICE PRIVACY POLICY WEBSITE MOBILE APP ​ WEBSITE PRIVACY POLICY ​ Effective Date: March 29, 2017 ​ COUNTRY THUNDER - PRIVACY POLICY ​ Country Thunder Holdings LLC. (\"we\", \"us\", \"our\") are committed to protecting and respecting your privacy. ​ This Privacy Policy (together with our Terms of Use and any other documents referred to in this Privacy Policy) describes how we collect, receive, use, transfer or otherwise process information (which may include personal information) we collect from you, or that you provide to us, through website (“Service”). Please read this Privacy Policy carefully to understand how we will treat your information. BY USING THE SERVICE, YOU ARE ACCEPTING AND CONSENTING TO THE PRACTICES DESCRIBED IN THIS PRIVACY POLICY (AS UPDATED OR AMENDED FROM TIME TO TIME). IF, FOR ANY REASON, YOU DO NOT AGREE TO THE TERMS OF THIS PRIVACY POLICY, PLEASE STOP USING THE SERVICE AND/OR THIS SITE IMMEDIATELY. WHO WE ARE ​ This Service is operated by Country Thunder Holdings LLC. As used in this Privacy Policy, the terms \"Country Thunder Companies\", \"we\", \"us\" and \"our\" refer to Country Thunder Holdings LLC and all entities it controls, is controlled by or is under common control with, including subsidiaries, joint ventures or other entities in whom Country Thunder LLC has a substantial ownership interest. If you would like a list of relevant entities, please send an email to info@countrythunder.com . ​ INFORMATION WE MAY COLLECT FROM YOU ​ When you use the Service, you may provide us with, and we may collect from you, information that relates to you, including your personal information. You may provide us with your information in a number of ways, including: completing forms on the Service (such as \"Contact Us\" forms) corresponding with us by e-mail, phone or otherwise; subscribing to email updates, newsletters or other subscriptions and features made available on the Service from time to time reporting  problem or requesting support for the Service; make a purchase from us using the Service; creating an account and/or signing in to our Service, including signing in using your social media account(s); communicating with us through third party social media websites or applications; and participating in our contests, promotions, sweepstakes or surveys on the Service. The information you give us may include your name, address, e-mail address, phone number, date of birth, photos, videos, payment information and social media account details (such as Facebook and Twitter). INFORMATION WE COLLECT ABOUT YOU ​ With regard to your use of the Service, we may automatically collect the following information: technical information, including IP address, login information, browser type and version, time zone setting, browser plug-in types and versions, operating system, platform, device type, hardware model, MAC address, unique device identifiers and mobile network information; information about your visit, including the full URL clickstream to, through and from our Service (including date and time); information about your network, such as information about devices, nodes, configurations, connection speeds, and network and application performance; pages you viewed or searched for; page response times, download errors, length of visits to certain pages, page interaction information (such as scrolling, clicks, and mouse-overs), and methods used to browse away from the page. ​ Events Information If you attend Country Thunder events where we or any of the other Country Thunder Companies, are capturing audio and video recordings, we may also collect sounds clips and images of you. INFORMATION WE COLLECT FROM OTHER SOURCES ​ We may receive information about you (including your personal information) if you use any of the other websites or applications operated by the Country Thunder Companies or the other services the Country Thunder Companies provide. In this case we will inform you when we collect that information that it may be shared internally and combined with information collected on the Service. We may also receive and display information and content which you make publically available on your social media account. If you log in to or access the Service using a third party social media platform, we will have access to certain information from that platform, such as your email address, friends list and profile information. We also work closely with third parties (including, for example, business partners, sub-contractors in technical services, advertising networks, analytics providers and search information providers) and may receive information about you from them. ​ HOW WE USE YOUR INFORMATION ​ We may use information we have about you in the following ways: Information you give to us. We will use this information to: help us respond to your queries; carry out our obligations arising from any contracts entered into between you and us and to provide you with the information, products and services that you request from us; send you our newsletter, email updates and other subscriptions which we make available from time to time and which you subscribe to receiving; provide you with information about other goods and services we offer that are similar to those that you have already purchased or enquired about; provide you, or permit selected third parties to provide you, with information about content, goods or services we feel may interest you; notify you about changes to our Service and other services; ensure that content from our Service is presented in the most effective manner for you and for your computer; facilitate contests, promotions, sweepstakes or surveys on the Service; monitor and analyse trends, usage and activities in connection with the Service; as necessary if we believe there has been a breach of the Terms of Use or the rights of any third party; and comply with legal and regulatory requirements. Information we collect about you. We will use this information: to administer the Service and for internal operations, including troubleshooting, data analysis, testing, research, statistical and survey purposes; to improve the Service to ensure that content is presented in the most effective manner for you and for your computer; to allow you to participate in interactive features of the Service, when you choose to do so; as part of our efforts to keep the Service safe and secure; to measure or understand the effectiveness of advertising we serve to you and others, and to deliver relevant advertising to you; to monitor and analyse trends, usage and activities in connection with the Service; and to make suggestions and recommendations to you and other users of our Service about goods or services that may interest you or them. Information we receive from other sources. We may combine information we receive from other sources with information you give to us and information we collect about you. We may use this combined information for the purposes set out above. ​ DISCLOSURE OF YOUR INFORMATION ​ We may share your personal information with any of the Country Thunder Companies (including WME IMG LLC) and with selected third parties including: business partners, suppliers and sub-contractors for the performance of any contract we enter into with them or you in order to provide you with a product or service; business partners, suppliers and sub-contractors to provide you with information about promotions and offers; aggregated, anonymised or other data to advertisers, advertising networks and social networks that require the data to select and serve relevant adverts to you and others. We may also use aggregate information to help advertisers reach the kind of audience they want to target. We may make use of the personal information we have collected from you to enable us to comply with our advertisers' wishes by displaying their advertisement to that target audience; and analytics and search engine providers that assist us in the improvement and optimisation of the Service. ​ We may disclose your personal information to third parties: in the event that we sell or buy any business or assets, in which case we may disclose your personal information to the prospective seller or buyer of such business or assets; if the Country Thunder Companies that control this Service or substantially all of its assets are acquired by a third party, in which case personal information held by it about its customers will be one of the transferred assets; if we are under a duty to disclose or share your personal information in order to comply with any legal obligation, or in the event of an emergency, or in order to enforce or apply our Terms of Use  and other agreements, or to protect the rights, property, or safety of the Country Thunder Companies, our customers, clients or others; and to any other third party with your prior consent to do so. ​ SOCIAL SHARING FEATURES ​ The Service may offer social sharing features and other integrated tools such as the Facebook \"like\" button, which lets you share actions you take on the Service with other media and vice versa. Your use of such features enable the sharing of information with your friends or the public, depending on the settings you establish with the entity that provides the social sharing feature. For more information about the purpose and scope of data collection and processing in connection with social sharing features, please visit the privacy policies of the entities that provide these features. ​ NOTIFICATIONS ​ When using the Service you may choose to accept notifications from us. You can opt in to receive mobile push notifications from us. If you subsequently decide you no longer wish to receive these notifications, you can use your mobile device’s settings functionality to turn them off. ​ STORAGE AND TRANSFER OF INFORMATION ​ Your information may be stored on servers in the United States and is subject to the laws of the United States, where the data protection and other laws may differ from those of other countries. Your information may be disclosed in response to inquiries or requests from government authorities or to respond to judicial process in the countries in which we operate. By accessing or using the Service or otherwise providing information to us, you consent to the processing, transfer and storage of information in and to the United States and other countries, where you may not have the same rights and protections as you do under local law. ​ We will take all steps reasonably necessary to ensure that your personal information is treated securely and in accordance with this Privacy Policy. We have put in place commercially reasonable technical and organisational procedures to safeguard the information and personal information we collect on the Service. ​ Unfortunately, the transmission of information via the internet is not completely secure. Although we will do our best to protect your personal information, we cannot guarantee the security of your information transmitted to the Service; any transmission is at your own risk. Once we have received your personal information, we will use strict procedures and security features to try to prevent unauthorised access. ​ CHILDREN ​ By using this Service, you agree to respond truthfully and accurately about your age if asked. We do not knowingly collect information from children who are 13 years old or younger. If you are 13 years old or younger, you may not submit any personal information to us. ​ YOUR CALIFORNIA PRIVACY RIGHTS ​ California Civil Code Section 1798.83 permits users of the Service that are California residents to request certain information regarding our disclosure of personal information to third parties for their direct marketing purposes. To make such a request pursuant to California Civil Code Section 1798.83, please send an e­mail to info@countrythunder.com . ​ YOUR CHOICES ​ You may have the opportunity to receive certain communications from us related to the Service. If you provide us with your email address in order to receive communications, you can opt out at any time by using the unsubscribe links at the bottom of our emails. ​ SECURITY ​ We have implemented commercially reasonable technical and organisational procedures measures designed to secure your personal information from accidental loss and unauthorised access, use, alteration or disclosure. However, the internet is an open system and we cannot and do not guarantee or warrant the security of any information that you transmit on or through the Service or that we otherwise maintain. LINKS TO THIRD PARTY WEBSITES ​ Our Service, newsletters, email updates and other communications may, from time to time, contain links to and from the websites of others, including our partner networks, retail partners, advertisers and affiliates. If you follow a link to any of these websites, please note that these websites have their own privacy policies and that we do not accept any responsibility or liability for these policies. ​ CHANGES TO OUR PRIVACY POLICY ​ Any changes we may make to our Privacy Policy will be posted on this page. Please check back frequently to see any updates or changes to our Privacy Policy. If you do not agree or consent to these updates or changes, do not continue to use the Service. ​ CONTACT Questions, comments and requests regarding this Privacy Policy should be emailed to info@countrythunder.com . About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.nba.com/thunder/executives",
      "text": "Thunder Executive Staff | Oklahoma City Thunder"
    },
    {
      "url": "https://www.countrythunder.com/florida",
      "text": "Country Thunder Florida | Tampa, FL  | countrythunder.com/fl top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. TICKETS lineup maps info COUNTRY THUNDER FLORIDA SEE YOU AGAIN IN 2026! join our newsletter for the latest event news and promotions SPECIAL THANKS TO OUR PARTNERS About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/fl-lineup",
      "text": "Country Thunder Florida | Tampa, FL  | Lineup top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. TICKETS lineup maps info FLORIDA LINEUP 2026 LINEUP COMING SOON ARTISTS & SCHEDULE SUBJECT TO CHANGE WITHOUT NOTICE. PAST LINEUPS About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://www.countrythunder.com/termsofservice",
      "text": "Country Thunder Music Festivals - Terms of Service top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. SELECT THE TOPIC BELOW ABOUT US TERMS OF SERVICE WEBSITE MOBILE APP REWARDS PRIVACY POLICY ​ WEBSITE TERMS OF USE ​ Effective Date: March 29, 2017 ​ COUNTRY THUNDER - TERMS OF USE ACCESS TO AND USE OF OUR SERVICE IS PROVIDED BY COUNTRY THUNDER HOLDINGS LLC SUBJECT TO THE FOLLOWING TERMS AND CONDITIONS. 1.      Acceptance The Country Thunder Website (the “Service”) operated by us, Country Thunder Holdings LLC 2711 Centerville Road, Suite 400, Wilmington, Delaware 19808 (\"Country Thunder\", \"we\", \"us\", \"our\"). By using the Service, you agree, without limitation or qualification, to be bound by these terms and conditions of use (the “Terms of Use”) and the Country Thunder Privacy Policy (the “Privacy Policy”) incorporated herein by reference. ​ Where permitted by local law, Country Thunder reserves the right to modify or revise the Terms of Use, in its sole discretion, at any time. By using the Service, you agree to be bound by any and all subsequent modifications or revisions and to comply with any applicable laws and regulations. Country Thunder recommends that users review the most up-to-date version of the Terms of Use periodically. We do not guarantee that the Service, or the Contents (as described in more detail below), will always be available or be uninterrupted. We may suspend, withdraw, discontinue or change all or any part of the Service without notice. We will not be liable to you if for any reason the Service is unavailable at any time or for any period. You are responsible for making all arrangements necessary for you to have access to the Service. You are also responsible for ensuring that all persons who access the Service through your internet connection or using your device are aware of these Terms of Use and other applicable terms and conditions, and that they comply with them. ​ The materials provided on the Service are protected by applicable law, including, but not limited to, United States copyright laws and international treaties. ​ 2.      Personal Information The personal information you submit to Country Thunder and that Country Thunder collects from you is governed by the Country Thunder Privacy Policy . To the extent there is an inconsistency between these Terms of Use and the Privacy Policy, the Privacy Policy shall govern. You are responsible for providing information that is accurate, current and complete. ​ If you provide information that is not accurate, current or complete, or if Country Thunder has reason to believe that information you provided is not accurate, current or complete, Country Thunder has the right to prohibit you from any and all future use of the Service. 3.      Use Restrictions The Service and the content on the Service, such as text, graphics, source code, images, videos, photographs, illustrations, trademarks, trade names, service marks, logos, information obtained from Country Thunder licensors, and other materials (the “Contents”) is protected by intellectual property rights under both United States and foreign laws. Ownership of the Contents - in other words, ownership of all intellectual property rights in such Contents - remains with Country Thunder or our licensors and/or partners. All rights not expressly granted herein are reserved to Country Thunder and its licensors. If you violate any of these Terms of Use, your permission to use the Contents automatically terminates and you must immediately destroy any copies you have made of any portion of the Contents. ​ Any use of the Contents not expressly permitted by these Terms of Use is a breach of these Terms of Use and may violate copyright, trademark and other laws. ​ Except as otherwise stated herein, you may not, without Country Thunder’s written permission, “mirror” any Contents contained in the Service or any other server and you agree not to reproduce, duplicate, copy, sell, resell, distribute, post, transmit or exploit for any commercial purpose, any portion of the Service or the Contents other than as expressly authorized by Country Thunder in writing. You may not use the Service for any purpose that is unlawful or prohibited by these Terms of Use, including to defame, harass, stalk, threaten, abuse or otherwise violate the rights of a third party as defined by applicable law. ​ Whilst you are in compliance with these terms, we grant you a non-exclusive, non-transferable, personal, revocable limited license to access and/or use the Service (but not any related object and source code) for your own personal private use, in each case provided that such use is in accordance with these Terms of Use. You agree not to use the Service for anything else. These Terms of Use also apply to any update or patches which we may release or make available for the Service and any such update or patch shall be deemed part of the Service for the purposes of these Terms of Use. ​ You agree that you will not remove or modify any acknowledgements, credits or legal notices contained on the Service or in the Contents. Where applicable, you shall include the following copyright notice: “Copyright © 2017, Country Thunder Holdings LLC. All rights reserved”. ​ Any special rules for the use of other items provided on the Service may be included elsewhere within the Service and are incorporated into these Terms of Use by reference. The use of the Contents on any other site or in a networked computer environment for any purpose is prohibited. You may not use the Service in any manner that could damage, disable, overburden or impair the Service, or interfere with any other party’s use and enjoyment of the Service. You may not attempt to gain unauthorized access to the Service through hacking, password mining or any other means. You may not reverse engineer any aspect of the Service or do anything which might discover source code or bypass or circumvent measures employed to prevent or limit access to any part of the Service. You may not attempt to circumvent any content-filtering techniques we employ or attempt to access any area of the Service that you are not authorized to access. You may not develop any third-party applications that interact with the Service without our prior written consent, including any scripts designed to scrape or extract data from the Service. ​ Country Thunder reserves the right, in its sole discretion, to terminate your access to the Service, or any portion thereof, at any time, if there is a justifiable reason, without prior notice or any notice. If, for any reason, you create any derivatives, modifications or improvements to the Contents and/or Service (\"Derivatives\"), all right, title and interest (including existing and future intellectual property rights) in such Derivatives (\"Derivative Rights\") vest in Country Thunder immediately upon creation. You hereby assign to Country Thunder with full title guarantee all right, title and interest in all such Derivative Rights. You represent and warrant that use by Country Thunder or its licensees of the Derivative Rights will not infringe the intellectual property rights or other rights of any third party. You must do all things and sign all documents necessary or desirable to give effect to this paragraph. 4.      Feedback Any questions, comments, suggestions, ideas, original or creative materials or other information you submit about Country Thunder or our Service or events (collectively, “Feedback”) is non-confidential and will become the sole property of Country Thunder.  We will own exclusive rights, including, without limitation, all intellectual property rights, in and to Feedback and will be entitled to the unrestricted use and dissemination of Feedback for any purpose, commercial or otherwise, without acknowledgment or compensation to you. ​ 5.         Third Party Links The Service may contain hyperlinks to other websites and webpages (including websites and webpages on which you may make purchases) (“Third-Party Pages”), as well as to text, graphics, videos, images, music, sounds, applications and information belonging to or originating from other third-parties (collectively, “Third-Party Applications”).  Country Thunder does not investigate, monitor, control or review any Third-Party Pages or Third-Party Applications to ensure their accuracy, completeness, or appropriateness. ​ Country Thunder is not responsible for the Third-Party Pages or any Third-Party Applications accessed through the Service. The inclusion of any hyperlinks to any Third-Party Pages or Third-Party Applications on the Service does not indicate Country Thunder’s approval or endorsement thereof. If you choose to leave the Service to access any Third-Party Pages or Third-Party Applications, you do so at your own risk. You take full responsibility for using, purchasing or refraining from purchasing and goods or services contained on such Third-Party Pages or Third-Party Applications. If you do purchase goods or services from such Third Party Pages or Third-Party Applications please read their contractual terms carefully before making such purchase.  Remember, your contract for those goods or services will be with that third party and not with Country Thunder. ​ When you use Third Party Pages or Third-Party Applications, any personal information you provide will be dealt with under such third party's privacy policy. ​ 6.      No Reliance on Information The material and Contents on the Service are provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on the Service. ​ Although Country Thunder make reasonable efforts to update the information on the Service, Country Thunder make no representations, warranties or guarantees, whether express or implied, that the information and/or Contents on the Service is accurate, complete or up-to-date. ​ 7.      Liability of Country Thunder and Its Licensors and Partners The use of the Service and/or the Contents is at your own risk. The Contents of the Service could include technical inaccuracies or typographical errors. ​ Country Thunder may update the Service and/or may change the Contents at any time. However, please note that any of the Content on the Service may be out of date at any given time, and Country Thunder is under no obligation to update it. Country Thunder does not guarantee that the Service, or any of the Contents on it, will be free from errors or omissions. ​ Subject to applicable law, Country Thunder will not be liable to you for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with use or inability to use, the Service or use of or reliance on any Contents displayed on the Service. ​ Country Thunder will not be liable for any loss or damage caused by a virus, distributed denial-of-service attack, or other technologically harmful material that may infect your computer equipment, computer programs, data or other proprietary material due to your use of the Service or to your downloading of any Contents on it, or on any website linked to it. ​ Except as otherwise expressly permitted herein, you agree not to use the Service for any commercial or business purposes, and subject to applicable law Country Thunder have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity arising out of or related to your use, or the performance of the Service. ​ To the extent permitted by applicable law, Country Thunder exclude all conditions, warranties, representation or other terms which may apply to the Service or any Contents on them, whether express or implied. ​ Nothing in these Terms of Use excludes or limits Country Thunder's liability for death or personal injury arising from negligence, or fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by applicable law. ​ 8.      Indemnity You will be responsible for and will be liable to us and indemnify us against any loss or damage suffered by Country Thunder as a result of: (a) your use of the Service and/or Contents other than as permitted under these Terms of Use; and/or (b) your breach of these Terms of Use. ​ You agree to indemnify us in full against any third party liabilities, claims, costs, loss or damage incurred as a result of any breach by you of these Terms of Use. ​ 9.      General Country Thunder makes no claims that the Contents and/or Service are appropriate or may be downloaded and/or used outside of the United States of America. Access to and use of the Service and/or Contents may not be legal by certain persons or in certain countries. ​ If you access, use and/or download the Service and/or Contents from outside the United States, you do so at your own risk and are responsible for compliance with the laws of your jurisdiction. ​ The following provisions survive the expiration or termination of these Terms of Use for any reason whatsoever: Liability of Country Thunder and its Licensors and Partners, No Reliance on Information, Use Restrictions, Submission of Ideas, Indemnity, , Viruses, Trade Marks, Applicable Laws, Waiver and Severability and Complete Agreement. ​ 10.    Applicable Laws Subject to the provisions of applicable law, these Terms of Use are governed in accordance with the laws of California, United States of America, without regard to its conflict of law provisions. You and Country Thunder hereby expressly consent and submit to the exclusive jurisdiction of the state and federal courts of the County of Los Angeles, California, United States of America for the adjudication or disposition of any claim, action or dispute arising out of these Terms of Use, the Privacy Policy or in connection with any matters related to the Service. 11.    Waiver and Severability If any provision of these Terms of Use is found to be invalid by any court having competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of these Terms of Use, which shall remain in full force and effect. No waiver of any of these Terms of Use shall be deemed a further or continuing waiver of such term or condition or any other term or condition. ​ 12.    Notice and Take Down Procedures If you believe the Contents (or any part thereof) accessible on or from the App infringes your intellectual property rights, you may request removal of those materials (or access thereto) from the Service by contacting Country Thunder (address identified below) and providing the following information: identification of the work that you believe to be infringed. Please describe the work, and where possible include a copy or the location (e.g., URL) of an authorized version of the work; identification of the Content that you believe to be infringing your intellectual property rights and its location. Please describe the Content, and provide us with its URL or any other pertinent information that will allow us to locate the Content; your name, address, telephone number, and (if available) email address. a statement that you have a good faith belief that the complained-of use of the work is not authorized by the intellectual property rights owner, its agent, or the law; a statement that the information you have supplied is accurate, and indicating that “under penalty of perjury,” you are the intellectual property rights owner or authorized representative of the intellectual property rights owner; a signature or the electronic equivalent from the intellectual property rights owner or authorized representative of the intellectual property rights owner. ​ Our address for intellectual property rights issues relating to the Service is as follows: Country Thunder 730 Gallatin Pike N Madison, TN 37115 ​ In an effort to protect the rights of intellectual property rights owners, Country Thunder maintains a policy for the termination, in appropriate circumstances, of users of the Service who are repeat infringers. 13.    Copyright and Trade Marks Unauthorized use of any Country Thunder, trademarks, service mark or logo is prohibited, and may be a violation of federal and state trademark law. 14.    Viruses We do not guarantee the Service will be secure or free from bugs or viruses. You are responsible for configuring your information technology, computer programs and platform in order to access and use the Service. You should use your own virus protection software. You must not misuse the Service by knowingly introducing viruses, trojans, worms, logic bombs or other material which is malicious or technologically harmful. You must not attempt to gain unauthorised access to the Service, the server on which the Service is stored or any server, computer or database connected to the Service. You must not attack the Service via a denial-of-service attack or a distributed denial-of service attack. By breaching this provision, you may be committing a criminal offence under applicable law. Country Thunder will report any such breach to the relevant law enforcement authorities and will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use the Service will cease immediately. ​ 16.    Complete Agreement Except as expressly provided in a particular notice or disclaimer posted by or on behalf of Country Thunder on the Service, these Terms of Use, including the Country Thunder Privacy Policy, constitute the entire agreement between you and Country Thunder with respect to the use of the Service and Contents. ​ 17.    Contact Us To contact us, please email info@countrythunder.com . About us | Privacy Policy | Terms Of Service bottom of page"
    },
    {
      "url": "https://thunderroadsflorida.com/contact-us/",
      "text": "Contact | Thunder Roads Florida Home About How To Plan & Organize A Poker Run Poker Run Thunder Highlights Riding the Smokies-Put Some Miles on That Bike OBs Americana Bike Show 2025 VEMA Memorial Day Ride Seats &Saddles Sept 2025 Pont Tales Sept 2025 Biking Business Copperhead Lodge & The Flying Trout Godfather Custom Cycles Antique Bike Show Thunder Beach Spring Rally 2025 Bad Ass Car Club of Flagler County Show 3rd Annual OCC Bike Builder Invitational Biking Business RP Specialties Pony Tales August 2025 TnT August 2025 Dennis Kirk’s Garage Build Show 2025 Bike Rack at Thunder Beach 2025 Benefit Run for Amie Seitz Johns Boot Hill Saloon’s Let’s Ride for Julie The Suggestion Box Got a Suggestion or Feature Request? Use the suggestion box to submit suggestions Vote on suggestions submitted by other members. Monthly Archives Monthly Archives Select Month September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 December 2022 November 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 Thunder Roads Florida Staff THUNDER ROADS MAGAZINE FLORIDA Thunder Roads Magazine Florida Flagler Beach, Florida 32136 FLORIDA STATE EDITOR Beth “LuLu” Connors 850-206-6991 ADVERTISING SALES Beth Connors 850-206-6991 NATIONAL FOUNDERS Toni McCoy Shearon & Brian Shearon 1528 Matlock Drive / Chapmansboro, TN 37035 Thunder Publishing, LLC Offices: 615-792-0040 e-mail:thunderroads@charter.net www.thunderroadsmagazine.com At Thunder Roads Magazine we welcome your feedback. Use the form below to contact us. Your Name (required) Your Email (required) Subject (required) Your Message (required) To use CAPTCHA, you need Really Simple CAPTCHA plugin installed. Enter the letters & numbers above in the form below then click Send Created & Maintained With Easy Stream Publisher | © Copyright ArticulateFx.com 2010 About | Privacy Policy | Terms Of Use | Disclaimer | Site Map | Contact Us"
    },
    {
      "url": "https://www.countrythunder.com/single-post/country-thunder-music-festivals-digital-specialist",
      "text": "Country Thunder Music Festivals Digital Specialist top of page HOME ARIZONA BUY NOW TICKETS & CAMPING LINEUP MAPS INFO FLORIDA BUY NOW! TICKETS LINEUP MAPS INFO SASKATCHEWAN BUY NOW TICKETS & CAMPING LINEUP MAPS INFO WISCONSIN BUY NOW TICKETS & CAMPING LINEUP INFO MAPS ALBERTA BUY NOW TICKETS LINEUP MAPS INFO CONTACT US POLICIES SUBSCRIBE EMAIL 1.866.388.0007 PODCAST More Use tab to navigate through the menu items. Country Thunder Music Festivals Digital Specialist Country Thunder Oct 20, 2020 2 min read Updated: Dec 15, 2021 Work Status: Full-time Location: Nashville, TN We're hiring! Country Thunder Music Festivals is looking for an experienced and creative Digital Specialist. The successful candidate will work with the Country Thunder team to grow, engage, and entertain our digital community through our digital and social media platforms to compliment our marketing strategies. Here’s what we’ll ask of you: Responsibilities: Maintain festival website, e-newsletter community, and blog presence of the Country Thunder and Big Valley Jamboree brands Work with Marketing Manager to execute marketing / sales strategies on digital properties. Execute the full social presence according to our marketing and branding strategy for all festivals; engaging audiences through various social media platforms. Building and maintaining a festival TikTok strategy Planning and creating compelling and original multi-media social content, including festival updates, special features, photo and video based features, and interactive features.. Provide all members of the marketing team appropriate analytics on social content and strategy, including market competitive analysis, with actionable strategic observations provided with all reports. What We Need From You: College or university degree (or equivalent experience), preferably in Music Business, Digital Media, or Communications. Must have 2 years minimum experience in developing online or social content, preferably in related industries Enthusiasm and passion for country music, live entertainment, and relevant pop culture is an asset. Strong working knowledge of Adobe Creative Suite, video editing, and graphic design is considered an asset. Strong organization skills with the ability to handle multiple projects and prioritize, as necessary. Must be able to self-direct in a busy work environment with abnormal hours. Must be able to travel within the USA and Canada. Must live in or be willing to relocate to Nashville, TN How to Apply Along with your resume and cover letter, please email appropriate links and examples from your portfolio of success! We want to see what you can bring to the table for our festivals! Deadline for applications is January 15th, 2022 E-mail:  admin@countrythunder.com *No phone calls please.  Only those selected for an interview will be contacted. Featured Posts Getting to Country Thunder Bristol 2023 Who's Craving Craven? Recent Posts Getting to Country Thunder Bristol 2023 Country Thunder Arizona's NEWEST Experience A look at the Country Thunder Arizona schedule! Let's Get Wild in Wisconsin! The Songs of Country Thunder Who's Craving Craven? Are Y'all Ready For Country Thunder Arizona 2023? Camping Instructions for Country Thunder Bristol Parking Instructions for Country Thunder Bristol Who's Ready For Country Thunder Florida? Archive October 2023 (1) 1 post February 2023 (3) 3 posts January 2023 (2) 2 posts November 2022 (1) 1 post September 2022 (2) 2 posts May 2022 (5) 5 posts February 2022 (1) 1 post December 2021 (1) 1 post October 2021 (4) 4 posts September 2021 (1) 1 post August 2021 (5) 5 posts July 2021 (4) 4 posts June 2021 (7) 7 posts May 2021 (6) 6 posts April 2021 (1) 1 post March 2021 (1) 1 post October 2020 (1) 1 post August 2020 (2) 2 posts July 2020 (2) 2 posts June 2020 (1) 1 post May 2020 (2) 2 posts March 2020 (2) 2 posts November 2019 (2) 2 posts October 2019 (3) 3 posts February 2019 (1) 1 post November 2018 (3) 3 posts October 2018 (2) 2 posts September 2018 (1) 1 post August 2018 (2) 2 posts July 2018 (3) 3 posts November 2017 (1) 1 post October 2017 (3) 3 posts August 2017 (1) 1 post July 2017 (2) 2 posts Search By Tags Advice (1) 1 post Alberta (3) 3 posts App (1) 1 post Blog (1) 1 post Brett Eldredge (1) 1 post CTNation (6) 6 posts Calgary (2) 2 posts Dierks Bentley (3) 3 posts Kissimmee (5) 5 posts Rodeo (1) 1 post Runaway Country (1) 1 post Tickets (1) 1 post Tim McGraw (3) 3 posts Tips (1) 1 post Transportation (1) 1 post Visit Calgary (1) 1 post arizona (5) 5 posts arizona music festival (1) 1 post camp cooking (1) 1 post camping (4) 4 posts camping music festival (11) 11 posts chris stapleton (3) 3 posts cody johnson (2) 2 posts country clones (1) 1 post country music (19) 19 posts country music festival (26) 26 posts country thunder (33) 33 posts craven (1) 1 post dallas smith (1) 1 post florence (1) 1 post florida (5) 5 posts florida country music (1) 1 post florida festival (1) 1 post forest city (1) 1 post iowa (4) 4 posts iowa country music (1) 1 post jake owen (2) 2 posts jon pardi (2) 2 posts luke bryan (3) 3 posts luke combs (1) 1 post music (1) 1 post music festival (14) 14 posts playlist (1) 1 post prairie winds park (1) 1 post saskatchewan (3) 3 posts spotify (1) 1 post toby keith (1) 1 post twin lakes (3) 3 posts winnebago camping (1) 1 post wisconsin (4) 4 posts Follow Us About us | Privacy Policy | Terms Of Service bottom of page"
    }
  ]
}