{
  "fuentes": [
    {
      "url": "https://pembrokeshire-properties.co.uk/contact-us/",
      "email": "info@pembrokeshire-properties.co.uk"
    },
    {
      "url": "https://countryproperty.co.uk/contact-us/",
      "email": "enquiries@countryproperty.co.uk"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/49397-country-aire-estates-mobile-home-park-38130-mc-donald-street-dade-city-fl-33525",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/49397-country-aire-estates-mobile-home-park-38130-mc-donald-street-dade-city-fl-33525",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/49397-country-aire-estates-mobile-home-park-38130-mc-donald-street-dade-city-fl-33525",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/49397-country-aire-estates-mobile-home-park-38130-mc-donald-street-dade-city-fl-33525",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://vymaps.com/US/Country-Aire-Estates-Winery-282873475384757/",
      "email": "jepes@liputra.com"
    },
    {
      "url": "https://www.countryestates.co.uk/contact-us/",
      "email": "sales@countryestates.co.uk"
    },
    {
      "url": "https://www.country-estates.com/contact",
      "email": "antrim@country-estates.com"
    },
    {
      "url": "https://www.country-estates.com/contact",
      "email": "ballyclare@country-estates.com"
    },
    {
      "url": "https://www.country-estates.com/contact",
      "email": "glengormley@country-estates.com"
    },
    {
      "url": "https://www.country-estates.com/contact",
      "email": "rentals@country-estates.com"
    },
    {
      "url": "https://www.countryair.com/",
      "email": "phils@countryair.com"
    }
  ],
  "mails": [
    "antrim@country-estates.com",
    "ballyclare@country-estates.com",
    "enquiries@countryproperty.co.uk",
    "glengormley@country-estates.com",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@pembrokeshire-properties.co.uk",
    "jepes@liputra.com",
    "phils@countryair.com",
    "rentals@country-estates.com",
    "sales@countryestates.co.uk"
  ],
  "nombre_sitio": "countryaireestate.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pembrokeshire-properties.co.uk/contact-us/",
      "text": "Contact The Country Living Group today! Residential property specialist info@pembrokeshire-properties.co.uk 01437 620610 Saved Properties My Account Login Toggle navigation Pembrokeshire Properties - Free Valuation Home Sell Property Search Available Properties All Properties Register Tools About Us Blog Contact Contact Pembrokeshire Properties today Every client we deal with is unique, with their own requirements and needs. Our job is matching the best buyer to the perfect property, please get in touch so we can help that happen for you. Fill in the contact form below or get in touch with us directly using any of the contact information below. Please sign up for our Property Alerts for information on new properties and additional services available to you from Pembrokeshire Properties. Register for Property Alerts Property Search Pembrokeshire Properties, Unit 29, Withybush Trading Estate, Haverfordwest, Pembrokeshire, SA62 4BS info@pembrokeshire-properties.co.uk 01437 620610 07908 544969 Contact Us Pembrokeshire Properties, Unit 29, Withybush Trading Estate, Haverfordwest, Pembrokeshire, SA62 4BS info@pembrokeshire-properties.co.uk 01437 620610 07908 544969 Quick Links Properties About Us Blog Contact Cookies Policy Privacy Policy Recent Posts Quick Home Improvements to Impress Potential Buyers Garden Improvements That Increase Property Value Going Rural: Preparing for Your Countryside Move © Copyright Country Living Group Limited. All rights reserved. Registration no. 10489640. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Estate Agents Website Design by QuantaTec"
    },
    {
      "url": "https://countryproperty.co.uk/contact-us/",
      "text": "Contact Us - Country Property Skip to content Call Us Request a Valuation Property Search Contact Us Home » Contact Us Contact Us Please contact our friendly team by phone or email, or visit our office. Alternatively complete the form on this page and we will get in touch with you. Get in Touch 01454 321339 [email protected] First Name: (Required) Last Name: (Required) Phone Number: (Required) Email Address: (Required) Message Your Explicit Consent I agree to your privacy policy . From time to time we will send you information about properties that we feel may be of interest to you and/or provide you with information about our valuation services. If you would like to receive information from us, please indicate this by selecting the appropriate box. Our Privacy Policy describes how we use your data, who we might share it with and what rights you have. Comments This field is for validation purposes and should be left unchanged. get in touch 01454 321339 [email protected] Follow us Facebook Linkedin © 2025 Country Property Terms of Use Privacy Policy & Notice Complaints Procedure Cookies Policy Built by The Property Jungle Property Search BUY RENT Minimum Price Minimum Price £50,000 £100,000 £150,000 £200,000 £250,000 £300,000 £350,000 £400,000 £450,000 £500,000 £550,000 £600,000 £650,000 £700,000 £750,000 £800,000 £850,000 £900,000 £950,000 £1,000,000 £2,000,000 £3,000,000 £4,000,000 £5,000,000 £6,000,000 £7,000,000 £8,000,000 £9,000,000 £10,000,000 Maximum Price Maximum Price £50,000 £100,000 £150,000 £200,000 £250,000 £300,000 £350,000 £400,000 £450,000 £500,000 £550,000 £600,000 £650,000 £700,000 £750,000 £800,000 £850,000 £900,000 £950,000 £1,000,000 £2,000,000 £3,000,000 £4,000,000 £5,000,000 £6,000,000 £7,000,000 £8,000,000 £9,000,000 £10,000,000 Minimum Bedrooms Minimum Bedrooms 1 Bedroom/Studio 2 Bedrooms 3 Bedrooms 4 Bedrooms 5+ Bedrooms Property Type Property Type Bungalow Flat/Apartment House Maisonette Show STC Map Search Draw Search Minimum Price Minimum Price £350 PCM £350 PCM £450 PCM £500 PCM £550 PCM £600 PCM £650 PCM £700 PCM £800 PCM £1000 PCM £1500 PCM £2000 PCM £3000 PCM £4000 PCM £5000 PCM £6000 PCM £7000 PCM £8000 PCM £9000 PCM £10,000 PCM Maximum Price Maximum Price £350 PCM £350 PCM £450 PCM £500 PCM £550 PCM £600 PCM £650 PCM £700 PCM £800 PCM £1000 PCM £1500 PCM £2000 PCM £3000 PCM £4000 PCM £5000 PCM £6000 PCM £7000 PCM £8000 PCM £9000 PCM £10,000 PCM Minimum Bedrooms Minimum Bedrooms 1 Bedroom/Studio 2 Bedrooms 3 Bedrooms 4 Bedrooms 5+ Bedrooms Property Type Property Type Bungalow Flat/Apartment House Maisonette Show Let Agreed Map Search Draw Search welcome About Us Sales Lettings Auctions New Home Meet the Team Guild Market News Testimonials Register Contact Us About Us Sales Lettings Auctions New Home Meet the Team Guild Market News Testimonials Register Contact Us"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/49397-country-aire-estates-mobile-home-park-38130-mc-donald-street-dade-city-fl-33525",
      "text": "Country Aire Estates Mobile Home Park | 38130 Mc Donald Street, Dade City, FL 33525 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Country Aire Estates Mobile Home Park 38130 Mc Donald Street location_on Map It Dade City, FL 33525 | ID: 49397 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info 55 + PET FRIENDLY PHOTOS VIDEO STREET VIEW 28.3354706 -82.1851818 954874 38130 Mc Donald Street, Dade City, FL 33525 Details Name Country Aire Estates Mobile Home Park Type of community Age-restricted community ? Lot rent range $290 - $290 Office Phone (352) 567-3630 Total # of lots 120 Pet policy check Pet friendly check Pet restrictions apply 2 Max; 25# max - Pet restrictions Year built 1996 Average monthly HOA/Lot Rent fees $290 Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Community operator website https://spacerentguide.com/country-aire-estates-fl.html Climate Zone Rating HOT-HUMID MORE Schedule a Visit Check out Country Aire Esta... Call Us (352) 567-3630 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $290 - $290 per month and includes: check Trash pickup check Water Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Country Aire Estates Mobile Home Park is an age-restricted (55+) manufactured home community located in 38130 Mc Donald Street, Dade City, FL 33525. Country Aire Estates Mobile Home Park is a land-lease community was built in 1996. and has a total of 120 home sites. Home site lot rent ranges from $380 - $700 per month and includes the following: Trash pickup Water The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Country Aire Estates Mobile Home Park is an affordable housing choice for active, friendly, age-qualified living. This well-maintained retirement community has easy access to local recreation, shopping and entertainment. Equal Housing Opportunity Amenities check BBQ area check Billiards check Bingo check Clubhouse check Recreation facilities check Shuffleboard courts check Swimming pool check Laundry facilities check Activities check Library check Fishing check Game room check Whirlpool/Spa/Hot Tub check Sidewalks check Kitchen check Picnic area check Arts and crafts room check Dog run check Gas Fire Pit MORE Local Climate HOT-HUMID Country Aire Estates Mobile Home Park is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Country Aire Estates Mobile Home Park at 38130 Mc Donald Street, Dade City, FL 33525 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Blue Jay Dade City, FL Homes Ranging From $79K - $150K Grove Ridge Dade City, FL Community Type group_add Age Restricted The Highlands at ... Dade City, FL Community Type group_add Age Restricted About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://vymaps.com/US/Country-Aire-Estates-Winery-282873475384757/",
      "text": "Country Aire Estates Winery, Bar at Pittsburg Home Countries Articles About Add Listing Delete Edit Bar Country Aire Estates Winery 22 Country Aire Avenue, McAlester, OK 74501 United States Oklahoma About Country Aire Estates Winery is a bar, located at 22 Country Aire Avenue, McAlester, OK 74501. Visit their website Facebook.com for more detailed information. Tags : #Nightlife Location : 22 Country Aire Avenue, McAlester, OK 74501 Contacts : Facebook.com Added by Jopie , at 01 January 2020 Add missing information Add email Add phone Add business description Add opening hours Add photos Add Social Media Add Products and Services Reviews No reviews yet. Be the first to add a review. Rate & Write Reviews Review Star : Submit your review Mailing List Sign Up Enter your email to get updates and special deals from Country Aire Estates Winery Bar in Oklahoma Beaver Creek Construction Bar - Oklahoma Cooper Tint & Electronics Bar - Oklahoma Cowboy Barriers Bar - Oklahoma Copper Restaurant & Bar Bar - Oklahoma Crimson Steel Supply LLC Bar - Oklahoma Cahaya Abadi Express Bar - Oklahoma Cimarron Sports Bar - Oklahoma Chianti Wine Bar Bar - Oklahoma Crabtown Restaurant - Oklahoma Lounge 405 Night Club - Oklahoma All Locations Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Other Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas United States Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming All Categories Accounting Airport Amusement Park Apartment Aquarium Art Gallery Atm Bakery Bank Bar Beauty Salon Bicycle Store Book Store Bowling Alley Bus Station Cafe Campground Car Dealer Car Rental Car Repair Car Wash Casino Cemetery Chiropractic Service Church City Hall Clothing Store Community Company Consultant Contractor Convenience Store Courthouse Dentist Department Store Dermatologist Digital Marketing Dispensary Doctor Drugstore Education Electrician Electronics Store Embassy Finance Fire Station Florist Food Freight Forwarding Service Funeral Home Furniture Store Gas Station Groceries Gym Hair Care Hardware Store Health Hindu Temple Home Goods Store Home Service Hospital IT Services Insurance Agency Jewelry Store Laundry Lawyer Library Light Rail Station Liquor Store Local Business Local Government Office Locksmith Lodging Massage Therapist Meal Delivery Meal Takeaway Mosque Movie Rental Movie Theater Moving Company Museum Nail Salon Night Club Nonprofit Painter Park Parking Pet Store Pharmacy Physiotherapist Plumber Point Of Interest Police Post Office Premise Primary School Real Estate Agency Recreation Restaurant Roofing Contractor Rv Park School Secondary School Shoe Store Shopping Mall Skin Care Software Service Spa Sports Stadium Storage Store Subway Station Supermarket Synagogue Taxi Stand Tourist Attraction Train Station Transit Station Travel Agency Uncategorized University Veterans Service Organization Veterinary Care Zoo Search About | Privacy Policy © 2025 VYMaps.com - All rights reserved"
    },
    {
      "url": "https://www.countryestates.co.uk/contact-us/",
      "text": "Country Estates » Contact Us » Flexible offices and workspace. Address Country Estates Ltd , Kingfisher House, 17 Albury Close, Reading RG30 1BD Contact T: 0118 950 8366 E: sales@countryestates.co.uk F: 0118 959 5857 Opening Hours Monday - Friday 9am - 5pm 0118 950 8366 Office Space Managed Offices Design & Build News How to contact Country Estates Our details: Address Country Estates Ltd Kingfisher House 17 Albury Close Reading RG30 1BD Contact T: 0118 950 8366 E: sales@countryestates.co.uk F: 0118 959 5857 Opening Hours Monday - Friday 9am - 5pm Directions Google Maps Registered in England and Wales number: 00976581. Registered office as above. Get in touch. * Nature of enquiry General enquiry Job enquiry Sales enquiry Albury Close, Reading Brambles Business Centre, Waterlooville Calleva Business Centre, Aldermaston Calleva Park, Aldermaston Cavalier Court, Chippenham Cromwell Business Centre, Chippenham Cromwell Park, Chippenham Horseshoe Park, Pangbourne Hussar Court, Waterlooville Kingfisher Court Business Centre, Newbury Kingfisher Court, Newbury Kingsclere Park, Kingsclere Lancaster Court, High Wycombe Lansdowne Business Centre, Chippenham Lansdowne Court, Chippenham Mansfield Park, Alton Osprey Court, Bristol The Studio, Nr Wargrave * Required Your details will only be used by Country Estates Group. We will not sell, share or distribute your contact details with any third party, unless required to by law. For full details, see our Privacy Policy . Δ Locations About Country Estates Careers Privacy Policy Terms of Use Contact Us Sign up For news, offers and latest releases from Country Estates See how we use your information here . Δ Country Estates Ltd , Kingfisher House, 17 Albury Close, Reading RG30 1BD"
    },
    {
      "url": "https://www.country-estates.com/contact",
      "text": "Contact Estate Agent In Antrim, Ballyclare And Glengormley Cookie Policy This site uses cookies to store information on your computer. More Agree Close Home For Sale To Rent New Homes Land Sales Commercial Sales Commercial Rentals Sell your Home Valuations Mortgages About Us Local Area Guides Request an EPC Property Newsletter Testimonials Contact Request a Valuation Login / Register Close Antrim 028 9446 6777 Email address protected by JavaScript. Activate JavaScript to see the email. 12 Church Street, Antrim, BT41 4BA Ballyclare 028 9334 0726 Email address protected by JavaScript. Activate JavaScript to see the email. 51 Main Street, Ballyclare, BT39 9AA Glengormley 028 9083 0803 Email address protected by JavaScript. Activate JavaScript to see the email. 9a Ballyclare Road, Glengormley, BT36 5EU Rental Services 028 9551 3333 Email address protected by JavaScript. Activate JavaScript to see the email. Close Type Type Sales Lettings Commercial Sales Commercial Lettings Land and Sites Overseas Auctions New Homes Price Range From Up to to Min Price Min Price Any £25k £50k £75k £100k £125k £150k £175k £200k £250k £300k £350k £400k £500k £600k £700k £800k £900k £1.0m £1.25m £1.5m £1.75m £2.0m Max Price Max Price Any £25k £50k £75k £100k £125k £150k £175k £200k £250k £300k £350k £400k £500k £600k £700k £800k £900k £1.0m £1.25m £1.5m £1.75m £2.0m Bedrooms Beds Min Beds Max to Beds Min Beds Min Beds Any 1 2 3 4 5 6 Max Beds Max Beds Any 1 2 3 4 5 6 Radius None ¼ mile ½ mile ¾ mile 1 mile 2 miles 3 miles 4 miles 5 miles 10 miles 15 miles 20 miles 25 miles 30 miles Options Agreed Gone Exclude Price Not Provided Exclude Student Lettings New Homes Only Land Types Building Site Commercial Land Industrial Land Agricultural Land Furnishing Unfurnished Furnished Partially furnished Optional Property Type Apartments Houses Bungalows Detached houses Semi-detached houses Terraced houses Room Lets Offices Retail Properties Pubs / Restaurants Hotels / Guesthouses / B&Bs Industrial Properties Parking Investment Farmhouse Bungalows Detached Farmhouses Semi-detached Farmhouses Residential Land Agricultural Land Commercial Land Industrial Land Others Serviced / Coworking Offices Houses and Land Independent Living Property Attributes property.attribute.hasSmoking property.attribute.hasPets property.attribute.requiresReference Allows pets Allows smoking property.attribute.broadband Off street parking Garage Long Term Let Holiday Let Summer Only Let Divisible into lots Divisible into lots property.attribute.shareCurrentStatusWorking New build Divisible into lots Professional Allows smoking Off street parking All male Off street parking property.attribute.shareDesiredStatusWorking property.attribute.shareDesiredStatusNotWorking All female Disabled access Disabled access property.attribute.shareCurrentStatusNotWorking Corporate Allows pets Garden Disabled access Farm buildings Farm buildings Mixed gender property.attribute.shareDesiredStatusStudent Student Needs modernisation Garage property.attribute.shareCurrentStatusStudent Serviced Off street parking property.attribute.shareCurrentStatusPostGrad property.attribute.shareDesiredStatusPostGrad Family DHSS Garden Garage Rural or semi-rural Off street parking Disabled access Rural or semi-rural Over an acre of land Disabled access Investment potential New build Studio Chain free Over an acre of land Sold off Market Sold off Market Sold off Market Sold off Market Needs modernisation property.attribute.coOwnership Draw Search Selected: Advanced Search Advanced Search Menu Valuations Branches Search Let's talk… If you are interested in any of the services we have to offer, you can fill in your details using the enquiry form, and a member of our team will get back to you as soon as they can. Thank you for your enquiry Your message has been emailed to us, we will get back to you as soon as possible. Please check you have entered all details correctly: --- Select a Branch --- Antrim Ballyclare Glengormley Rental Services Enquiry Type General enquiry Property Valuations EPC Services Mortgage Services Selling your home Rental Services Feedback Antrim 028 9446 6777 Email address protected by JavaScript. Activate JavaScript to see the email. 12 Church Street, Antrim, BT41 4BA Ballyclare 028 9334 0726 Email address protected by JavaScript. Activate JavaScript to see the email. 51 Main Street, Ballyclare, BT39 9AA Glengormley 028 9083 0803 Email address protected by JavaScript. Activate JavaScript to see the email. 9a Ballyclare Road, Glengormley, BT36 5EU Rental Services 028 9551 3333 Email address protected by JavaScript. Activate JavaScript to see the email. Request a Valuation Find your local branch Login / Register Facebook Instagram Tiktok Privacy Policy Cookie Policy © Copyright 2025 Country Estates Designed & Powered by PropertyPal.com"
    },
    {
      "url": "https://www.countryair.com/",
      "text": "Country Air Properties | Philip Smoley | Lakeport, CA | 707-263-2620 Loading Countryair.com Real Estate Websites by iHouseweb | Accessibility | Admin Menu"
    }
  ]
}