{
  "fuentes": [
    {
      "url": "https://covecaygolf.com/join/",
      "email": "deanna.brockway@covecaygolf.com"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/cove-cay-golf-club",
      "email": "lake-jovita-golf-country-club-north-course-5-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/cove-cay-golf-club",
      "email": "lake-jovita-golf-country-club-north-course-5-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/cove-cay-golf-club",
      "email": "lake-jovita-golf-country-club-south-course-4-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/cove-cay-golf-club",
      "email": "lake-jovita-golf-country-club-south-course-4-s@2x.jpg"
    },
    {
      "url": "https://covecaygolf.com/ladies-golf-leagues/",
      "email": "divotdivas@covecaygolf.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://covecaygolf.com/parties-functions/",
      "email": "deanna.brockway@covecaygolf.com"
    },
    {
      "url": "https://www.timbercoveresort.com/contact-us",
      "email": "reservations@timbercoveresort.com"
    },
    {
      "url": "https://covecaycondos.com/",
      "email": "quikclose@msn.com"
    },
    {
      "url": "https://covecaycondos.com/",
      "email": "bobmcdugald@futurehomerealty.com"
    },
    {
      "url": "https://covecaycondos.com/",
      "email": "quikclose@msn.com"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8ee8b5f0-86ac-11e4-8c28-020000005b00/cove-cay-golf-club",
      "email": "billarmstrong@covecaygolf.com"
    },
    {
      "url": "https://covecaygolf.com/corporate-golf-events/",
      "email": "pat@covecaygolf.com"
    },
    {
      "url": "https://covecaygolf.com/contact-us/",
      "email": "deanna.brockway@covecaygolf.com"
    },
    {
      "url": "https://covecaygolf.com/contact-us/",
      "email": "bill@covecaygolf.com"
    },
    {
      "url": "https://covecaygolf.com/contact-us/",
      "email": "deanna.brockway@covecaygolf.com"
    },
    {
      "url": "https://covecaygolf.com/contact-us/",
      "email": "pat@covecaygolf.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/2291-cove-cay-golf-club/search",
      "email": "nbc-golf-white@2x.png"
    }
  ],
  "mails": [
    "bill@covecaygolf.com",
    "billarmstrong@covecaygolf.com",
    "bobmcdugald@futurehomerealty.com",
    "deanna.brockway@covecaygolf.com",
    "divotdivas@covecaygolf.com",
    "info@belfairsgolfclub.co.uk",
    "lake-jovita-golf-country-club-north-course-5-m@2x.jpg",
    "lake-jovita-golf-country-club-north-course-5-s@2x.jpg",
    "lake-jovita-golf-country-club-south-course-4-m@2x.jpg",
    "lake-jovita-golf-country-club-south-course-4-s@2x.jpg",
    "nbc-golf-white@2x.png",
    "pat@covecaygolf.com",
    "quikclose@msn.com",
    "reservations@timbercoveresort.com"
  ],
  "nombre_sitio": "covecaygolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://covecaygolf.com/join/",
      "text": "Join - Cove Cay Golf Home Golf Course About Us Aerial Tour On-Course Photos The Golf Shop Practice Facilities Scorecard Play Course Policies Rates Women’s Golf Ladies Golf Leagues Mens Leagues 9-Hole Evening Leagues Golf Academy Pat and Bill Shriver Chris Ardolina Saturday Golf Clinics Adult Golf Schools Junior Golf Programs LPGA*USGA Girls Golf PGA Junior League Team Summer Camps Download Camp Information Camp Registration Bayview Grill About the Grill Monthly Specials Events Events Calendar Legends of the LPGA Tour Charity Golf Tournaments Parties & Functions Corporate Golf Events Weddings Destination Weddings Memberships Join Contact Us Select Page Join Join Our Memberships at Cove Cay Golf Club are packed with benefits in addition to being flexible and affordable for all. Our Golf Memberships are available for both Annual and Seasonal golfers and offer you additional personalization when choosing either a Family or Individual Plan. A 4 Month Minimum Membership Is Required To Join. If you have any questions regarding membership opportunities, please contact Office Manager Deanna Brockway ( deanna.brockway@covecaygolf.com ). MEMBERSHIP APPLICATION SOCIAL APPLICATION Our Golf Membership Provides Special “Member’s Only” events and Nights Full service clubhouse Opportunity for Participation in all Social Events GHIN handicap system available Exclusive Members Only Walking Fee Advanced Tee Times 10% discount in Golf Shop and Clubhouse Bag Storage Rental available PGA professionals on site Free Clubhouse Locker PGA Golf Lessons Available Course open 7 days a week Full service Golf Shop Men’s and Ladies’ Golf Tournaments Unlimited greens fees Men’s and Ladies’ Golf Associations Practice facilities and unlimited free range balls Membership charge accounts (NO MONTHLY MINIMUMS) Full service clubhouse 18 hole, championship length, par 70/71 course 4 tee box levels No Initiation Fee! A Social Membership is offered for those non-golfers who want to enjoy all the benefits of our varied and frequent social activities. The cost is $100 per month for a Single Social Membership and $150 per month for a Family Social Membership . Social members receive: A 10% Clubhouse discount Monthly charge account Special Members Only Nights and events Follow Follow Follow Cove Cay Golf Club 2612 Cove Cay Dr, Clearwater, FL 33760, USA 727-535-1406 CLEARWATER WEATHER © Copyright Cove Cay Golf Club Website by Lightspeed ×"
    },
    {
      "url": "https://golfscape.com/tampa-golf-courses/cove-cay-golf-club",
      "text": "Cove Cay Golf Club ⛳️ Book Golf Online • golfscape™ Explore Destinations Help Log In Sign Up Language Currency How can we help? How can I book a tee time? 1 Navigate to your preferred golf course. Select your date of play, tee time, rentals, and number of players – and then click Book. You will receive an instant email confirmation and your tee time will be guaranteed at the course. Can I modify or cancel a booking? 1 Absolutely! If you are within the cancellation policy of your tee time, navigate to the Manage Booking page to modify or cancel your booking. What is your cancellation policy? 1 You can typically cancel your booking for a full refund within 48 hours of your tee time, but this may vary slightly by course. Cancellation policies are defined by each golf course and are clearly marked during the entire booking process as well as in your email confirmation. Why should I book with golfscape? 1 We are the only service who’s technology operates at all our partner courses – that means tee times and rates on golfscape are sourced directly. So when you make a booking, your reservation is confirmed instantly at the golf course. How can I get more help? 1 You may communicate with us anytime using the button below or email us at [email protected] – we’re happy to help! Contact us Get Started Create Account or sign up with Log In Forgot Password? Log In or log in with Profile My Bookings Log Out Tampa Golf Courses Cove Cay Golf Club Cove Cay Golf Club Tampa Golf Courses Next Previous Show all photos Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Cove Cay’s golf course is located along Tampa Bay in Pinellas County Florida. From the spectacular fairways, luscious greens and challenging target golf, Cove Cay Golf Club is a memorable destination golf experience. Known for amazing views of Old Tampa Bay and an abundance of wildlife make Cove Cay a golf course that you won’t want to miss! An read more Course Details 18 Holes Par 71 6079 yards Unique Course Type Unique Grass Type Designed by David Wallace Club Facilities 62.check Caddy / Golf Carts 62.check Lessons 62.check Dining 62.check Club / Shoe Rental 62.check Locker Room 62.check Golf Shop Weather Today's condition: - Temperature: / • Sunrise: / • Sunset: / ℃ ℉ back to Cove Cay Golf Club Map Location 2612 Cove Cay Drive Clearwater, Florida United States View map We are getting you the best tee time rates at this course Book a Tee Time Select Date of Play Tee Times & Players Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Book a Tee Time More Golf Courses in Tampa View all Tampa Golf Courses 8.5 472 reviews Lake Jovita Golf & Country Club (North Course) 8.5 472 reviews Lake Jovita Golf & Country Club (South Course) Manage Booking Blog: Futuri Visio Golf Course Operators Terms of Use Affiliate Partnerships Privacy Policy Contact Us © 2025 golfscape . All Rights Reserved. |"
    },
    {
      "url": "https://covecaygolf.com/ladies-golf-leagues/",
      "text": "Ladies Golf Leagues - Cove Cay Golf Home Golf Course About Us Aerial Tour On-Course Photos The Golf Shop Practice Facilities Scorecard Play Course Policies Rates Women’s Golf Ladies Golf Leagues Mens Leagues 9-Hole Evening Leagues Golf Academy Pat and Bill Shriver Chris Ardolina Saturday Golf Clinics Adult Golf Schools Junior Golf Programs LPGA*USGA Girls Golf PGA Junior League Team Summer Camps Download Camp Information Camp Registration Bayview Grill About the Grill Monthly Specials Events Events Calendar Legends of the LPGA Tour Charity Golf Tournaments Parties & Functions Corporate Golf Events Weddings Destination Weddings Memberships Join Contact Us Select Page Ladies Golf Leagues Ladies & Couples Golf Leagues Cove Cay Golf Club has ladies golf leagues that welcome all skill levels to enjoy league play, year-round! We welcome beginner golfers, intermediate and advanced golfers to learn the game or improve their skills in a fun, no pressure group setting. Our Divot Divas golf league plays 4 times each week all year. Our Tuesday ladies golf league is seasonal and run by our lovely snow birds! We also have a Couples Sunday Golf League that runs November through April. Cove Cay Women’s Golf Association This league plays on Tuesdays at 8:30am. November – April. League President Trudy Collins welcomes new members to join the fun. Please arrive at 8:00am as it is a Shotgun Start. Golfers need to be at their starting holes at 8:30am ready to play. This league require a USGA handicap. Please contact Trudy Collins if you would like to join. You do not have to play every week to be a part of this group. Call or Text Trudy at 905-999-4698 or email trudycollins12@gmail.com . Welcome to Cove Cay Divot Divas Golf Leagues! The Divot Divas are a fun league that welcomes all skill levels and runs year-round. There is no membership fee and no golf Handicap is needed, but we do require ALL golfers to pick up their ball at 3 over par, or Scramble in order to maintain pace of play. If you can’t see the group in front of you, you are too slow! The best day for New golfers is Sundays at 3 pm or Thursdays at 5:30pm for 9-holes. We urge new golfers to Scramble to keep pace of play and have fun while learning the game of golf and improving skills. Divot Diva League days are as follows, Tuesdays 9 or 18-holes * Shotgun start at 9am League Manager Brenda Dupra Thursday Evening 9-holes (April-October) * Shotgun start at 5:30 pm League Manager Lori Fisher Fridays 9 or 18-Holes * Tee times start at 9 am. League Manager Linda Simmons Sundays * 18-hole Tee Times start 1 pm * 9-hole Tee times start at 3 pm League Manager Kathy Arnold To join Divot Divas , email Kathy Arnold DivotDivas@CoveCayGolf.com with your Name, email & mobile phone number to be added to Golf Genius. We use the Golf Genius system to manage the Divot Diva Leagues email invites, Sign ups, create pairings & send out the Tee Sheets. You will receive 4 email invites each week. (One for each league.) If you don’t see the invites, check your Promotions or Spam folders. Invites will have details of the round & the sign up deadline. RSVP by Selecting “Playing” if you want to golf. Delete the invites if you are not going to golf that day. All rounds are for 18 holes. Exceptions are those with a 9 after your name, Thursdays evenings are always 9 holes, or you can notify the manager with your name & “9 holes”. Always Arrive 30 minutes before your Tee Time & be ready to start on time. To be added After the Deadline you can TEXT that day’s League manager who may add you only if there is an open spot or a cancellation. WE WELCOME YOU to join in on the FUN! Please join us after golf for drinks, dinner & socializing in the clubhouse! Cove Cay Couples Golf League This is a Members Only league that plays every Sunday from November-April with tee times beginning at 11:30am. Members will find League Captain info in their Member Newsletter. Follow Follow Follow Cove Cay Golf Club 2612 Cove Cay Dr, Clearwater, FL 33760, USA 727-535-1406 CLEARWATER WEATHER © Copyright Cove Cay Golf Club Website by Lightspeed ×"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://covecaygolf.com/parties-functions/",
      "text": "Parties & Functions - Cove Cay Golf Home Golf Course About Us Aerial Tour On-Course Photos The Golf Shop Practice Facilities Scorecard Play Course Policies Rates Women’s Golf Ladies Golf Leagues Mens Leagues 9-Hole Evening Leagues Golf Academy Pat and Bill Shriver Chris Ardolina Saturday Golf Clinics Adult Golf Schools Junior Golf Programs LPGA*USGA Girls Golf PGA Junior League Team Summer Camps Download Camp Information Camp Registration Bayview Grill About the Grill Monthly Specials Events Events Calendar Legends of the LPGA Tour Charity Golf Tournaments Parties & Functions Corporate Golf Events Weddings Destination Weddings Memberships Join Contact Us Select Page Parties & Functions Parties & Functions Cove Cay Golf Club offers event venue space for private parties, business meetings, and more. Over the years we’ve held hundreds of weddings, anniversaries, birthday parties, Quinceañeras, charitable organization meetings, business meetings, live performances etc.  Our clubhouse is spacious and our Bayview Grill provides customized menus for any themed event, for lunch or dinner. If dressing rooms are required, we have men and women’s locker rooms complete with showers and dressing areas. If interested in more details, a tour, or quote for an event email Deanna Brockway at deanna.brockway@covecaygolf.com . Live Performances Cove Cay Golf Club has the space for live bands, small orchestras, theatrical acts, and solo artists. On Sundays during peak season we have live music in the Garden Room as well as the Bayview Grill, and host Suncoast Jazz Society acts in the Garden Room on Sundays throughout the year. Quinceañera Cove Cay Golf Club provides private event venue space for parties large and small and for any occasion. Our talented event team works with clients to customize the event of their dreams. In this case, the client was a 15 year-old-who loves pink. Holiday Parties Cove Cay Golf Club provides private event venue space for parties large and small and for any occasion. The Special Olympics Florida The Special Olympics Florida has called Cove Cay Golf Club its home for area tournaments for many years. It is our honor to host these fabulous athletes and to watch them compete in the sport the love. Team Pinellas County not only practices at Cove Cay Golf Club but also gets coached by CCGC owners Pat and Bill Shriver, PGA Weddings Located on the western shore of Tampa Bay, Cove Cay Golf Club offers an incredible backdrop for your dream boutique wedding at an affordable price. Whether you plan your ceremony in the early afternoon or at sunset, views of Old Tampa Bay in an open-air setting make for the ultimate vow exchange and beautiful wedding photos. Not to mention, a golf course is the perfect location for pre-wedding fun! For a memorable experience and stress-free planning, book a Wedding at Cove Cay Golf Club. Pre-wedding round of golf Golf Events We host corporate golf outings , charitable golf tournaments and customized golf events for groups of all sizes. Group lessons and clinics, team building through golf, golf tournaments and more. Red White & Blue Scramble 2021 Sip & Swing Social Business Team Building Event Private Group Clinic Women’s Day Golf 2021 Short Game Clinic Group Meetings 100+ Women Who Care Pinellas County 100+ Women Who Care- Pinellas County has been raising money for local charities and organizations for the past 8 years, and meets quarterly at Cove Cay. We are honored to play a small part in the good they do! 100+ Women Who Care The ladies do a combination of live & virtual meetings quarterly at Cove Cay Golf Club. They meet in the Bayview Grill to dine and mingle then meet in the Garden Room to hear about the charities and vote for the one that gets the money that quarter. Keep St. Pete Lit Keep St. Pete Lit is one of the many local charities this great organization helps with each and every meeting. Keep St. Pete Lit celebrates and promotes greater St. Petersburg’s literary community – past, present and future – through arts, education and events with a literary twist. All Children’s Hospital Pat Shriver’s son Drew personally understands the power of the teamwork in a Children’s hospital and NICU, hosting and organizing this yearly golf fundraising tournament has had a special meaning to Pat and her family All Children’s Team Johns Hopkins All Children’s Hospital is ranked #1 in Florida and we are fortunate to have them located right here in the Tampa Bay Area. Indoor & Patio Seating Because we have a club house with full service restaurant and bar, The Bayview Grill, any event can include a customized lunch or dinner menu with indoor and outdoor seating. Follow Follow Follow Cove Cay Golf Club 2612 Cove Cay Dr, Clearwater, FL 33760, USA 727-535-1406 CLEARWATER WEATHER © Copyright Cove Cay Golf Club Website by Lightspeed ×"
    },
    {
      "url": "https://www.timbercoveresort.com/contact-us",
      "text": "Contact Us | Timber Cove Resort on the Sonoma Coast Skip to content Offers About Location History Dining Menus Hours Rooms Events Weddings Meetings Retreats Events Calendar Request for Proposal Wellness Activities Events Calendar Gallery Offers About Location History Dining Menus Hours Rooms Events Weddings Meetings Retreats Events Calendar Request for Proposal Wellness Activities Events Calendar Gallery book now email sign up Home / Contact Us Contact Us The staff at Timber Cove would be pleased to assist you with questions and reservations for activities, group meetings, golf and dining. We also want to help you make your requests a reality. Please provide us your information so we may serve you best. Your privacy is very important to us and we will never sell, rent or give your personal information to any third party. Complete the form or call using any of the number provided. 21780 HIGHWAY 1 JENNER, CALIFORNIA, 95450 1.707.847.3231 reservations@timbercoveresort.com First Name Last Name Email Phone Number Best Way to Contact You? Phone Email How did you hear about us? Comments Submit Offers About Dining Rooms Events Offers About Dining Rooms Events Wellness Activities Press Contact Us Cookie & Privacy Policy FAQ Wellness Activities Press Contact Us Cookie & Privacy Policy FAQ 21780 Highway 1 Jenner California, 95450 1.707.847.3231 reservations@timbercoveresort.com Facebook Instagram Hours Please see hotel for holiday hours Breakfast: 8AM-11AM Lunch: 12PM-3PM Great Room: 3PM-9PM Dinner: 5PM-8:30PM Bar: 8AM-9:30PM Book Now Request For Proposal Saludation Salutation DR. MR. MRS. MS First Name Last Name Company Title Email Phone # Fax # Street Address City State STATE* Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District Of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Or Province ZIP Code Country COUNTRY* United States Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Côte d'Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Tell Us About The Event You Are Planning Organization Event Name Number of Guests Number of Guest Rooms Event Type Event Type Meeting Retreat Wedding Special Event Start Date End Date Event History Event History 1st Time Annually Monthly Quarterly Other Preferred Contact Preferred Contact Email Phone Additional Comments Would you like a Welcome / Rehearsal Event? Would you like a Sunday Brunch Event? How did you hear about us?* Submit Email Club Sign UP First Name Last Name ZIP Email Sign Up Now"
    },
    {
      "url": "https://covecaycondos.com/",
      "text": "Home - Cove Cay Condos Skip to content Cove Cay Condominiums and Golf Course Community Kathy McDowell, P.A.  Cove Cay Specialist Cell: 727-804-3648 Quikclose@msn.com Home Meet Kathy Cove Cay Village 1 Village 2 Village 3 Village 4 Condos for Sale Search MLS Solds Map Golf Club Marina Buying and Selling Contact Home Meet Kathy Cove Cay Village 1 Village 2 Village 3 Village 4 Condos for Sale Search MLS Solds Map Golf Club Marina Buying and Selling Contact Search for Cove Cay  Condos COVE CAY CONDOMINIUMS Search for Cove Cay  Condos Cove Cay Condominiums is a gated, golf course community located along Tampa Bay in Pinellas County, Florida. Cove Cay condos offer various views – golf course, Tampa Bay, well-kept grounds, or overlooking the Cove Cay marina. The community is divided into four villages. Each village in Cove Cay has its own pool, clubhouse and condominium association with a board of directors. The condominium associations from all four villages, in turn, belong to a master condominium association. The master association manages the common areas, the entrances, security and more. The lushly landscaped grounds of this condominium community make the drive through its winding roads a delight. Palms, flowering bushes, ponds, fountains, rolling greens and fairways grace this community of Cove Cay. In easy reach in both Pinellas and Hillsborough counties is a host of recreational and leisure activities, including other golf courses, parks, beaches, concert/theater facilities such as Ruth Eckerd Hall and The St. Petersburg Times Forum, horse and dog racing, major league baseball (spring training) and the Tampa Bay Bucs. Please explore the Cove Cay Condos web site to learn more about this beautiful Tampa Bay condominium community. Then contact Kathy McDowell regarding any available condominiums or to view the community. Quick Search Quick Search Featured Listings Kathy McDowell, P.A. Cove Cay Specialist Cell: 727-804-3648 quikclose@msn.com Meet Kathy Selling Cove Cay condominiums has been Kathy McDowell’s specialty for 3 decades. Her parents and two aunts bought condos in Cove Cay in the 1970’s and 80’s and lived there for over 30 years. So Kathy became very familiar with the complex and decided to make it her focus in Real Estate. In the 1990’s she started mailing a newsletter to the residents and has not missed a month of sending that publication, The Cove Cay Connection , in over 30 years. Everyone looks forward to the friendly, full-color newsletter with updates on sales and listings and info on the club and marina. Such dedication is a key to Kathy’s success in Cove Cay. She believes in the unique paradise lifestyle that Cove Cay offers and is well acquainted with all the details of the condos and the complex. Constantly keeping up on all information regarding Cove Cay has helped Kathy to approximately 600 transactions, buyer and/or seller side, in the complex in the past 20 years that can be tracked in MLS. Of course, Kathy was selling in Cove Cay for 12 years before that, so the number of sales in her career in this complex is significant. No other agent can come close to this record of experience. Kathy markets Cove Cay in many other ways as well. One of her trademarks is her red SUV. She has had 8 red SUV’s since 1995, as many people in Cove Cay see her car driving through the complex and know that she is working to serve her clients. In addition, you can find Kathy’s photo, phone number and website name “CoveCaycondos.com” on one or more bench billboards on US 19. She supports The Cove Cay Golf Club and networks there as a social member and attendee at many events. If you are looking for a Realtor to sell your condo or help you find the perfect Cove Cay home, Kathy McDowell has the knowledge, expertise and track record to make her your first choice. In today’s volatile real estate market, you need the agent that has the skills and training, along with the professionalism and integrity needed, to get the job done. So, Always call Kathy , The Cove Cay Specialist! Cove Cay is a beautiful condomininium and golf course community.  It truly is a....Paradise Found! Kathy McDowell, P.A. Cove Cay Specialist Cell: 727-804-3648 quikclose@msn.com Future Home Realty 13029 W. Linebaugh Ave Ste 101 Tampa, FL 33626 Copyright © 2025. All Rights Reserved. Site Admin :: IDX Admin :: Website Statistics :: Terms of Service"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8ee8b5f0-86ac-11e4-8c28-020000005b00/cove-cay-golf-club",
      "text": "Cove Cay Golf Club - Scorecards, Reviews | 18Birdies Best Golf App 190k Ratings star star star star star 4.9 Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Follow Us Navigations Cove Cay Golf Club Length 6079 yds Rating 70.4 Slope 130 4.0 star star star star-o star star-o 505 Reviews 257 Followers Address: 2612 Cove Cay Dr Phone: 1 (727) 535-1406 Email: BillArmstrong@covecaygolf.com Website: http://www.covecaygolf.com/ Available Services Driving Range(Mat) Putting Green Practice Bunker Motor Cart Pull Cart Golf Club Rental Club Fitting Pro Shop Golf Lessons Restaurant Receptions Changing Room Locker Room Lodging Share to: Scorecard Cove Cay Golf Club Blue 6079 yds (130/70.4) for Men Blue 6079 yds for Women White 5659 yds (123/67.8) for Men White 5659 yds for Women Red 5283 yds (115/66.4) for Men Red 5283 yds (130/71.4) for Women Whitewater 4216 yds for Men Whitewater 4216 yds for Women Hole Par Handicap Blue 1 4 15 349 2 4 7 408 3 5 11 524 4 4 1 389 5 3 13 198 6 4 5 379 7 3 17 123 8 4 3 369 9 5 9 535 OUT 36 3274 TOT Hole Par Handicap Blue 10 4 2 441 11 4 10 334 12 3 12 134 13 5 4 522 14 3 16 143 15 4 8 364 16 3 18 138 17 5 6 524 18 3 14 205 IN 34 2805 TOT 70 6079 View Scorecards for Courses Worldwide Course Reviews 4.0 out of 5 star star star star-o star star-o 505 Reviews Value 3.8 star Course Condition 3.6 star Course Difficulty Medium Green Speed Medium Pace of Play Fast Bryce Connolly star star star star-o star-o Sep 2, 2025 Back nine was nice with almost every hole having views of the bay. Tee boxes were among some of the worst I’ve played on though, with them almost all being mostly sand. There were some grass patches in the tee boxes but not enough to take the sand out of play. Greens were fast but also were full of weeds. Course shouldn’t cost more than $35 due to the conditions, but I enjoyed my round. Nobody in front of me, nor behind me, and the views were nice. Emery Hancock star star star star star-o Aug 30, 2025 TRAV3 F star star star star star Aug 19, 2025 Tough tight course, not a lot of room for error on the long shots. Greens were a bit slow early morning but sped up later in the day/round. Always a beautiful course to play a round! Skyler Bernbeck star star star star star-o Aug 5, 2025 Dylan Lorenzo star star star star star-o Jul 26, 2025 View More Course Reviews Download 18Birdies to View Course Insights Including Hole-by-Hole Stats & More · Golf GPS · Stats · Scorecards · Courses Worldwide google-play Followers(257) Leaderboards Cove Cay Golf Club - Best Gross (All times) 1 G. Hosticka -8 (62) T2 W. Haynes -6 (64) T2 R. Sweet -6 (64) 4 H. Thompson -5 (65) T5 A. Bousdoukos -4 (66) View Complete Leaderboard Company About Us Our Mission Featured In Shop Features Digital Caddy School AI Swing Analyzer Community Tournaments Golf Courses Resources Contact Us Become an Ambassador FAQs Premium Membership Follow Us © 18Birdies, LLC.All Rights Reserved. Legal Information Terms of Service Privacy Policy"
    },
    {
      "url": "https://covecaygolf.com/corporate-golf-events/",
      "text": "Corporate Golf Events - Cove Cay Golf Home Golf Course About Us Aerial Tour On-Course Photos The Golf Shop Practice Facilities Scorecard Play Course Policies Rates Women’s Golf Ladies Golf Leagues Mens Leagues 9-Hole Evening Leagues Golf Academy Pat and Bill Shriver Chris Ardolina Saturday Golf Clinics Adult Golf Schools Junior Golf Programs LPGA*USGA Girls Golf PGA Junior League Team Summer Camps Download Camp Information Camp Registration Bayview Grill About the Grill Monthly Specials Events Events Calendar Legends of the LPGA Tour Charity Golf Tournaments Parties & Functions Corporate Golf Events Weddings Destination Weddings Memberships Join Contact Us Select Page Corporate Golf Events Corporate Golf Events Let Cove Cay Golf Club customize a corporate golf outing or group clinic for your team members or clients! Golf provides a fun way to team build or network, and a customized golf outing or clinic can be a creative way to say “thank you” to clients or staff.  The Cove Cay Golf Club can customize events of any size and can provide a fun, non-threatening environment for golf newbies and advanced players alike. Our group golf lessons and clinics are a great way for participants to either learn the game of golf, or simply hone their golf skills. We can customize anything from a 2-hour short game clinic for 12 people that includes breakfast or lunch, to a half-day of short game and driver instruction for 50 followed by a dinner. We can also arrange an inter-office golf tournament followed by a lunch or dinner. Our pros deliver an excellent experience, no matter the event, and our restaurant staff will prepare and serve a wonderful meal when requested. We  promise a great time for all! In addition, all corporate events are customized to each specific client’s wants and needs.  If you’re interesting, contact Pat Shriver for more information. Naturalslim We recently hosted a corporate outing for 100 associates and family members from Naturalslim. All Hands Were On Deck Pat Shriver meeting with her first group. Chris and Blake Chance Lau Blake Mackey Bradley Byers Billy McClanan Greg, Billy and Marc Chips and Pitches Billy demonstrating his golf swing. Bradley teaching club position. Reading the green lesson. We love Junior golfers at Cove Cay! On-Course Instruction Marc Castelli Fun on the range. The correct grip is crucial. Pat demonstrating swing technique. Doug (left), Billy, Bradley, and Marc We love beginner golfers! Chris on the putting green. Chris Ardolina Matthew demonstrating proper grip. Follow Follow Follow Cove Cay Golf Club 2612 Cove Cay Dr, Clearwater, FL 33760, USA 727-535-1406 CLEARWATER WEATHER © Copyright Cove Cay Golf Club Website by Lightspeed ×"
    },
    {
      "url": "https://covecaygolf.com/contact-us/",
      "text": "Contact Us - Cove Cay Golf Home Golf Course About Us Aerial Tour On-Course Photos The Golf Shop Practice Facilities Scorecard Play Course Policies Rates Women’s Golf Ladies Golf Leagues Mens Leagues 9-Hole Evening Leagues Golf Academy Pat and Bill Shriver Chris Ardolina Saturday Golf Clinics Adult Golf Schools Junior Golf Programs LPGA*USGA Girls Golf PGA Junior League Team Summer Camps Download Camp Information Camp Registration Bayview Grill About the Grill Monthly Specials Events Events Calendar Legends of the LPGA Tour Charity Golf Tournaments Parties & Functions Corporate Golf Events Weddings Destination Weddings Memberships Join Contact Us Select Page Contact Us  Call Us Golf Shop: 727-535-1406 Main: 727-536-1949  Email Us Golf, Restaurant, and Event Questions Deanna.Brockway@covecaygolf.com  Find Us 2612 Cove Cay Drive, Clearwater, FL 33760 Bill Shriver PGA Class A Professional, Owner/Director of Golf bill@covecaygolf.com Pat Shriver PGA Class A Teaching Pro, Owner/General Manager pat@covecaygolf.com Deanna Brockaway Office Manager deanna.brockway@covecaygolf.com Follow Follow Follow Cove Cay Golf Club 2612 Cove Cay Dr, Clearwater, FL 33760, USA 727-535-1406 CLEARWATER WEATHER © Copyright Cove Cay Golf Club Website by Lightspeed ×"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/2291-cove-cay-golf-club/search",
      "text": "Cove Cay Golf Club Tee Times - Clearwater FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters Cove Cay Golf Club 2612 Cove Cay Drive , Clearwater , Florida , 33760 Holes 18 Par 70 Length 6002 yards Slope 118 Rating 66.8 Located along the shores of Tampa Bay, Cove Cay Golf Club is home to a beautiful, coastal-style golf course offering abundant opportunities to spot wildlife. The 18-hole championship golf course is USGA rated and offers 6,079 yards of golf from the longest tee. The par-5 17th hole is the signature hole that runs parallel to Tampa Bay. Lessons and a full practice facility are available. Book today. Read More... Directions Course Details Review Policies Metal spikes allowed: No Credit cards accepted: VISA, MasterCard Welcomed Rentals/Services Carts: Yes - included in green fees Clubs: Yes Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    }
  ]
}