{
  "fuentes": [
    {
      "url": "https://jacksonville.beyondthenest.com/content/cowart-ranch-and-farms",
      "email": "info@cowartranchandfarms.com"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2023/09/26/aging-billionaire-cowboys-are-now-selling-their-iconic-american-ranches/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2023/09/26/aging-billionaire-cowboys-are-now-selling-their-iconic-american-ranches/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://ranchowl.com/contact-us/",
      "email": "info@ranchowl.com"
    },
    {
      "url": "https://cornerstoneranches.com/contact-us/",
      "email": "danessa@cornerstoneranches.com"
    },
    {
      "url": "https://cornerstoneranches.com/contact-us/",
      "email": "graham@cornerstoneranches.com"
    },
    {
      "url": "https://cornerstoneranches.com/contact-us/",
      "email": "info@cornerstoneranches.com"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/maze-dayz-fall-festival-cowart-ranch-and-farms",
      "email": "mindy@kidsoutandabout.com"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/cowart-ranch-and-farms",
      "email": "info@cowartranchandfarms.com"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jillian@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "julie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalief@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "allyson@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "breanne@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "caroline@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "cassidee@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "charreese@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "delite@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "genevieve@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "info@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jesse@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "john@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kellie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kiffen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kristen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "lily@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "madeleine@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "molly@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "paula@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "rob@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "sean.kontos@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "stephanie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "susan@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "taylor@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "thea@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "turon@farmfreshri.org"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "email": "fostercarereferrals@buckeyeranch.org"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "email": "fostercarereferralscincinnati@buckeyeranch.org"
    },
    {
      "url": "https://circleffarms.com/contact-us/",
      "email": "woodyf@woodyfolsom.com"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2020/09/15/billionaire-cowboys-are-buying-and-selling-the-largest-ranches-in-america/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2020/09/15/billionaire-cowboys-are-buying-and-selling-the-largest-ranches-in-america/",
      "email": "feedback@forbes.com"
    }
  ],
  "mails": [
    "allyson@farmfreshri.org",
    "breanne@farmfreshri.org",
    "caroline@farmfreshri.org",
    "cassidee@farmfreshri.org",
    "charreese@farmfreshri.org",
    "corrections@forbes.com",
    "danessa@cornerstoneranches.com",
    "delite@farmfreshri.org",
    "feedback@forbes.com",
    "fostercarereferrals@buckeyeranch.org",
    "fostercarereferralscincinnati@buckeyeranch.org",
    "genevieve@farmfreshri.org",
    "graham@cornerstoneranches.com",
    "info@cornerstoneranches.com",
    "info@cowartranchandfarms.com",
    "info@farmfreshri.org",
    "info@ranchowl.com",
    "jesse@farmfreshri.org",
    "jillian@farmfreshri.org",
    "john@farmfreshri.org",
    "julie@farmfreshri.org",
    "kellie@farmfreshri.org",
    "kiffen@farmfreshri.org",
    "kristen@farmfreshri.org",
    "lily@farmfreshri.org",
    "madeleine@farmfreshri.org",
    "mindy@kidsoutandabout.com",
    "molly@farmfreshri.org",
    "natalie@farmfreshri.org",
    "natalief@farmfreshri.org",
    "paula@farmfreshri.org",
    "rob@farmfreshri.org",
    "sean.kontos@farmfreshri.org",
    "stephanie@farmfreshri.org",
    "susan@farmfreshri.org",
    "taylor@farmfreshri.org",
    "thea@farmfreshri.org",
    "turon@farmfreshri.org",
    "woodyf@woodyfolsom.com"
  ],
  "nombre_sitio": "cowartranchandfarms.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://jacksonville.beyondthenest.com/content/cowart-ranch-and-farms",
      "text": "Cowart Ranch and Farms | What’s happening in Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to arts, culture, & recreation! Menu Home Do Today's events Events this weekend Events next weekend Free events Free events this weekend Free events next weekend Take a Class Take a Hike See Theater Concerts Festivals Exhibits Museums Farms & agri-tourism Vineyards / Wineries / Breweries Learn Hands-On Classes Visual Arts Classes Performing Arts Classes Sports & Fitness classes Classes that make you think Dine Restaurants Vineyards / Wineries / Breweries Dairy / Creamery Shop Food & Beverages Clothing & Shoes Home & Garden Gifts, Jewelry, & Accessories Travel Local Travel & Day Trips 8 Tips for Picking a Cruise Multigenerational travel reviews Family Top 20 Places to Take Kids in Jacksonville Check out our sister site KidsOutAndAbout.com Resources & Reviews 101 Day Trips from Jacksonville Lifestyle articles Sign Up! Advertise in our e-newsletter Search form Search Secondary menu 101 Family Day Trips Around Jacksonville Farmers Markets Festivals in the Jacksonville area Cowart Ranch and Farms Address: 8185 W Highway 100 Bunnell , FL , 32110 Phone: (386) 437-0750 29° 28' 49.458\" N , 81° 23' 27.1536\" W See map: Google Maps http://cowartranchandfarms.com/ info@cowartranchandfarms.com Contact name: Information Business/organization type: Farm Pumpkins What our organization offers: COVID-19 reopened / has upcoming reopening date Fall Farm Activities Pumpkins Corn maze / mazes Halloween events Items to purchase Recreation / Games Subjects / Categories: Hands-on Nature/Outdoors Seasons / holidays: Winter December Holidays Christmas Fall Halloween-Fun Halloween-Scary Our family continues to grow blueberries and we’ve recently branched into new adventures involving pumpkins, sunflowers, and fall family activities. We’ve introduced Agri-tourism into our farming community by hosting Flagler Counties “Maze Dayz,” and we’re doing it again!! The festival is scheduled on weekends in October and weekdays for scheduled school groups. It’s held at The Blueberry Strand, located at 8185 W. Highway 100 in Bunnell. Check our more information about this by clicking on the tab labeled Maze and Fall Festival. We’d love to see you out here this year supporting one of your local farmers. Remember NO FARMS, NO FOOD! - Web Service Pinterest Share on Facebook Tweet Widget Organization: Cowart Ranch and Farms Location: 8185 W Highway 100 Bunnell , FL , 32110 United States See map: Google Maps Phone: (386) 437-0750 The Annual Maze Dayz Cowart Ranch and Farms Dates: 10/04/2025 10/05/2025 10/11/2025 Show more dates Hide these dates 10/12/2025 10/18/2025 10/19/2025 10/25/2025 10/26/2025 11/01/2025 11/02/2025 Time: *SATURDAY: 10am-7pm    *SUNDAY: 10am-7pm Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us Home Do Today's events Events this weekend Events next weekend Free events Free events this weekend Free events next weekend Take a Class Take a Hike See Theater Concerts Festivals Exhibits Museums Farms & agri-tourism Vineyards / Wineries / Breweries Learn Hands-On Classes Visual Arts Classes Performing Arts Classes Sports & Fitness classes Classes that make you think Dine Restaurants Vineyards / Wineries / Breweries Dairy / Creamery Shop Food & Beverages Clothing & Shoes Home & Garden Gifts, Jewelry, & Accessories Travel Local Travel & Day Trips 8 Tips for Picking a Cruise Multigenerational travel reviews Family Top 20 Places to Take Kids in Jacksonville Check out our sister site KidsOutAndAbout.com Resources & Reviews 101 Day Trips from Jacksonville Lifestyle articles Sign Up! Advertise in our e-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2023/09/26/aging-billionaire-cowboys-are-now-selling-their-iconic-american-ranches/",
      "text": "Aging Billionaire Cowboys Are Selling Their Iconic American Ranches. Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Lifestyle Travel Aging Billionaire Cowboys Are Now Selling Their Iconic American Ranches By Jim Dobson , Senior Contributor. Forbes contributors publish independent expert analyses and insights. Jim Dobson is a full-time luxury travel writer based in Italy. Follow Author Sep 26, 2023, 06:21am EDT Nov 26, 2023, 12:09pm EST Share Save Comment Cowboys selling ranchland in America getty Driving through the dusty plains of Texas, the horizon is endless with views of rolling farmlands, miles of cornstalks, and cattle farms. While there is vast farmland as far as the eye can see, you will be surprised to learn that much of it is owned by only a few families. Many traditionally have kept their land through generations of heirs, but times are changing. More farmland is now hitting the market as a large percentage of America’s farmland is owned by people aged 75 or older, and experts say millions of acres will change hands, with investors being the main recipients. Due to increasing numbers of extended families now separated in remote locations, families are not gathering at these iconic ranches like they used to. Bently Ranch listed by Todd Renfrew at California Outdoor Properties Drone Cowboys / California Outdoor Properties Bill McDavid from Hall and Hall , one of the leading brokers for farmland and ranches, says, \"When I first entered the business several decades ago, most major ranches for sale were owned by folks who had inherited the property through a generational chain often stretching back to homestead days... they were mostly land rich - cash poor. Their kids had grown up working on the ranch but went off and built a life somewhere else with little interest in returning to the ranch. Or too many siblings created a challenge in fairly bequeathing the ranch. In either case, the owners reached an age where the workload became too much, and it was time to pass the torch.\" High net-worth buyers became attracted to the ranch lifestyle, which fueled strong value appreciation. McDavid adds, \"We have reached a point where most of the major ranches for sale are owned by those ultra-high net worth people who have aged out of owning the ranch and are looking to simplify their estates. The multi-generational ranch is becoming a thing of the past.\" MORE FROM FORBES ADVISOR Best Travel Insurance Companies By Amy Danise Editor Best Covid Travel Insurance Plans By Amy Danise Editor Rana Creek Ranch in California, owned by Mike Markkula, the angel investor who funded the formation of Apple Computer recently sold. Hall and Hall Hall and Hall recently closed on the sale of Rana Creek Ranch in the Carmel Valley, California. At about 14,000 acres, it was the largest ranch in the valley, which sold for $35 million. The seller was Mike Markkula (81), the angel investor who funded the formation of Apple Computer. He bought the ranch in the ‘80s and finally reached an age where he used it less, so it was time to move on. The Wildlands Conservancy acquired the property, providing public access to the ranch. James King of King Land & Water , the leading conservation and ranch broker in Texas, is handling the listing for the highest-priced property, Brewster Ranch, and he agrees with the increase of aging cowboys selling off their land. “Many older wealthy large ranch owners in Texas are marketing their properties these days as they have life investment cycles and at some point, when owners age, they move on to other family priorities.” Vermejo, a Ted Turner Reserve in New Mexico, was recently named the Travel + Leisure 2023 World’s Best Resort Hotel in the West. Ted Turner Reserves According to industry stalwart The Land Report , America's 10 largest private landowners are: Emmerson Family (Red Emmerson, 94, is founder of Sierra Pacific Industries, the largest private lumber production firm in the U.S.) John Malone , (John Malone, 82, is committed to conserving land for the communities that use it) Ted Turner (Ted Turner, 84, runs his ranches as a working business supported by hunting, fishing, and tourism) Reed Family (Simpson Logging Company) Stan Kroenke (Kroenke, 76, owns numerous sports teams, including the Los Angeles Rams. His Waggoner Ranch is the largest in Texas. He is married to Walmart WMT heiress Ann Walton) Irving Family (The largest landholder in Maine, they have planted more than one billion trees in the U.S. and Canada) Peter Buck (Buck, who died in 2021 at the age of 90, was the founder of the Subway sandwich chain and owned mostly timberland in Maine) Brad Kelley (Kelley, 67, is the founder of Commonwealth Brands Tobacco). Singleton Family (Owners of over million acres in New Mexico and California with one of the largest cattle operations in the world) King Ranch Heirs (Ranches in Texas and California for hunting, farming, and oil) Other notable landowners include Amazon's AMZN Jeff Bezos , with 420,000 acres for his space operation in West Texas, and McDonald's MCD French fry producer heirs the J.R. Simplot Family , with 443,000 acres in Idaho. Elon Musk is planning on building a utopian city in Texas, on thousands of acres of farmland he recently acquired outside of Austin. According to Eric O'Keefe at The Land Report , last year, Yellowstone creator Taylor Sheridan took over the Four Sixes Ranch in Texas, one of the top five Angus cattle ranches in the country with 142,372 acres. He paid a whopping $192,202,200 for the historic site. The Land Report and many of the private ranch brokers have revealed the top listings of American ranches/farmland currently on the market including; Brewster Ranch listed by King Land and Water (James King broker) King Land and Water Brewster Ranches : $299 million-430,305 acre s (Texas) Owned by billionaire cigarette icon Brad Kelley , the ranches are located north of Big Bend National Park and include acres of mountains, springs, creeks, low desert and access to the Rio Grande. It is filled with wildlife, including the protected bighorn sheep. Almost half the size of Rhode Island, the ranch includes multiple buildings and houses, including a five-bedroom, four-bath Spanish Hacienda built around a central courtyard. There is also an airstrip and hangar, submersible water wells, solar wells and windmills that supply water for livestock and wildlife. The Brewster Ranch is the largest ranch to be listed since the 520,000-acre W.T. Waggoner Ranch sold in 2016 for an estimated $725 million. Dove Mountain Ranch King Land & Water Dove Mountain Ranch $225+ million-324,345 acres (Texas) Dove Mountain Ranch is a working cattle and hunting ranch located in Big Bend Country of West Texas. This massive ownership is an assemblage of over 20 historic ranches that have been combined into the largest fee owned ranch complex for sale in Texas as well as the United States. Dove Mountain, and Cupola Mountain contain a huntable population of Desert Big Horn Sheep. Quayule Creek runs north and south and become a huge gorge or canyon on the ranch. This creek runs into Maravillas Canyon just off the ranch on Black Gap Wildlife Management Area which is a solid breeding ground for additional dispersing Big Horn Sheep. Turkey Track Ranch Wyman Meinzer / Icon Global Turkey Track Ranch : $200 million-80,000 acres (Texas) From the legacy of the Coble/Whittenburg empire, this ranch, with 80,000 fenced acres and 26 miles of Canadian River frontage, is known for its natural resources and is the site of the Battles of Adobe Walls of 1864 and 1874. Jay O’Brien and Dale Smith are the respected cattlemen who own and operate the Adobe Walls Cattle Co. They have run their cattle on the Turkey Track for several years, managing and caring for the ranch and stewarding this side of the operation. Rancho Agua Grande Hood Real Estate Rancho Aqua Grande : $150 million-17,000 acres (Texas) Rancho Agua Grande is a stunning live-water ranch in southwest Texas, boasting an incredible diversity of terrain across its 17,132 acres. This ranch is divided by seven miles of the year-round Live Oak Creek. Live Oak Creek is fed by more than 30 springs and supports abundant wildlife. It features local game and non-native wildlife species, including kangaroos, camels, zebras, gemsbok, and water buffalo. Along with its commercial hunting venue, the ranch features eight antique cabins plus an expansive 6,000-square-foot lodge for private events. Bently Ranch in Nevada Drone Cowboys / California Outdoor Properties Bently Ranch $100 million-12,369 acres (Nevada) Located 25 minutes from Lake Tahoe, the owners started accumulating land in Nevada in 1997 and instituted a cattle program in 2012. Over the last several years, they have focused on sustainable farming, aiming to grow various crops used in the distilling industry. The grains and botanicals grown on the ranch produce fine spirits. Water on the property includes 3,746-acre-ft Mud Lake and 1,784-acre-ft East Valley Reservoir. Currently being grown on the property are grains of wheat, rye, barley, hops, & oats, and premium alfalfa. Improvements include ten homes, four bunkhouses, seven shops, five horse barns, 12 hay barns, 12 storage barns, a feedlot, and a compost facility. Dawson Elk Valley Ranch in New Mexico (listed by Jeff Hubbard at MIRR Ranch Group) Mirr Ranch Group Dawson Elk Ranch : $96 million-50k acres (New Mexico) Half the size of the city of Santa Fe, adjoining Ted Turner’s Vermejo Park Ranch, there are over 10,000 elk that roam along the remnants of historic mining operations. High-elevation buttes, mesas, and ridges form a complex of winding canyons over most of the ranch. The Vermejo River runs the 11-mile North-South length of the property. There is an occupied manager’s house and a separate complex of buildings, including a vacant home that houses the occasional hunter or visitor and several operating ranching support buildings. Bull Springs Skyline Forest in Oregon Mason & Morse Ranch Company Bull Springs Skyline Forest : $95 million-32,995 acres (Oregon) Located minutes west of Bend, Oregon, Bull Springs is an active tree farm and recreational property that borders the Deschutes National Forest. The property has the opportunity for sustainable timber management and recreation with residential and mixed-use development. The property includes three major creeks: Three Creek, Bull Creek, and Bull Springs Creek. The deep live water canyons are the habitat for mule deer and various bird species, and the Cascade Mountain foothills are the habitat for elk, bears, mountain lions, and bobcats. Hunting remains popular year-round, and abundant habitat for mule deer provides the opportunity for trophy class bucks. Y6 Ranch in Texas King Land & Water Y6 R anch , $80.7+ million-113,650 acres (Texas) A combination of seven ranches established in 1894 was owned by legendary Evans Means and is where Pancho Villa stayed in the early 1900’s. The Butterfield Trail crossed over the northern part of the ranch for miles, with the Y-6 Hills being a landmark for early travelers between San Antonio and El Paso. This ranch has all-around hunting, combining the mountain habitats with the grassland and desert habitats. The ranch is prolific with Mule Deer and herds of pronghorn, aoudad, mountain lion, and elk. The 3,630-acre Mt. Solitude Ranch in Texas Icon Global Mt. Solitude Ranch : $79.9 million-3,630 acres (Texas) The 100-year Texas legacy ranch, first settled in the 1800s, has been held by the Thomson Family for over five generations and is located nine miles northwest of San Antonio and filled with lakes, creeks and a lakeside house. Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://ranchowl.com/contact-us/",
      "text": "Contact Us - RanchOwl.com Skip to content RanchOwl.com Your Guide to Smarter Ranching. Menu Menu Home About Us Blog Contact Us Contact Us We’d Love to Hear From You Whether you’ve got a question about ranching, a tip to share, or just want to say howdy, Ranch Owl is here to listen. We’re always looking to connect with fellow land stewards, ranchers, and anyone passionate about living wisely and working the land. Have a suggestion for a topic you’d like us to cover? Want to collaborate or contribute to RanchOwl.com? Or just curious about something you’ve read on the site? Let’s Talk Ranch Life Fill out the contact form below, and we’ll get back to you as soon as possible. No bots. No nonsense. Just real people who care about ranching smart. Reach Out Today ✅ Got a ranching question? ✅ Want to partner or advertise with us? ✅ Interested in contributing your tips? 👉 Use the form below to drop us a line—we’ll reply faster than a gate slam in a windstorm. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Message or Email Name * First Last Email * Comment or Message Submit Prefer email? You can reach us directly at info@ranchowl.com Smart Ranching Starts Here... Search Recent Posts What is a Fruit Orchard: Meaning and Examples with Types of Orchards, Planning Guide, Management Practices, and Successful Commercial Growing Operations Home About Us Blog About the Author Contact Us Privacy Policy Terms and Conditions © 2025 RanchOwl.com • Built with GeneratePress English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Norsk Türkçe Bahasa Indonesia Português (Brasil) 日本語 한국어 简体中文 العربية Русский हिन्दी Українська Srpski Accessibility  Adjustments Powered by OneTap Back Bigger Text Cursor Letter Spacing Readable Font Align Text Line Height Colors Grayscale Brightness Invert Colors Orientation Highlight Links Stop Animations Hide Images Reading Mask Reading Line Highlight Al Reset Settings Version 2.3.2"
    },
    {
      "url": "https://cornerstoneranches.com/contact-us/",
      "text": "Get in Touch with Cornerstone Ranches About Us Media And Awards Our History News & Blog Ethos Sustainability Independent Farming Craft is Freedom Crops Apples Hops Explore Yakima Valley The Farm Contact Us Home » contact us CONTACT US Let us help you become even greater at what you do. Fill out the following form and we get back to you in the next 24 hours. Cornerstone Ranches, LLC 2131 Fort Road | PO Box 392 Toppenish, WA 98948 509.865.2958 Let’s Connect Name E-Mail Phone (Optional) Message Δ Graham Gamache -owner Graham@cornerstoneranches.com Danessa Gamache -sales + operation Danessa@cornerstoneranches.com Award Winning Produce from Yakima Valley Cornerstone Ranches grows award-winning hops and other produce for buyers, brokers, and consumers, which sets them apart from the crowd. Privacy Policy Terms & Conditions menu About Us Crops Ethos Explore Let’s Chat info@cornerstoneranches.com (509) 865-2958 2131 Fort Rd, Toppenish, WA 98948 Fly With Us Cornerstone Ranches offers a small runway for airborne guests. Let us know if you’d like to fly in and we’ll have a cold one waiting for you. Learn More Follow Us cornerstoneranches 5th generation family farm growing a variety of hops and apples. 🍻 #CRAFTISFREEDOM These smudge pots are hard at work, creating a war Farming isn’t just about the crops — it’s ab From smart water management to harnessing renewabl Some call it Yakima Valley. We call it Hoplandia. Our trucks wear winter well. 🚚❄️ Maintenance mode: ON. Winter is our chance to ensu info@cornerstoneranches.com (509) 865-2958 2131 Fort Rd, Toppenish, WA 98948 ©2023 Cornerstone Ranches, LLC. • 2131 Fort Road • PO Box 392 • Toppenish, WA 98948 • 509.865.2958 Photography by Cameron Karsten and Jake Parrish Website by Catalyst Marketing Agency Get in Touch Cornerstone hops maintains a presence with all major brokers and many regional distributors. When you go to market, our team will help promote your products and add them to our site. info@cornerstoneranches.com (509) 865-2958 2131 Fort Rd, Toppenish, WA 98948 Δ"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/maze-dayz-fall-festival-cowart-ranch-and-farms",
      "text": "Maze Dayz Fall Festival - Cowart Ranch and Farms | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Maze Dayz Fall Festival - Cowart Ranch and Farms *The event has already taken place on this date: Sun, 11/03/2024 Our annual Maze Dayz opens October 4th through November 3rd. We have many farm-inspired activities that you’re sure to love! Get lost in our 5 acre walk through maze, pick the perfect carver or edible pumpkin at our Pumpkin Patch, try to spot the cattle herd on the Tractor driven Hayrides, get up close and friendly with our farm animals, and SO much more! Click here for more information about this activity Please help us keep this calendar up to date! If this activity is sold out, canceled, or otherwise needs alteration, email mindy@kidsoutandabout.com so we can update it immediately. If you have a question about the activity itself, please contact the organization administrator listed below. Admission: $15.00 per person, 2 and under free. Seniors, Military & 1st responder: $12 (Must show ID, cannot combine discounts) —CASH ONLY— Groups 10 or more- $1.00 off /person, 20 or more – $3.00 off /person. For the discount group’s money must be given to one person that would give it to us in one lump sum upon arrival. Please contact us and let us know when you plan on coming. **Not usable with any other promotions or discounts. A SPECIAL THANKS TO OUR LONG TIME PRESENTING SPONSOR FLAGLER CHRYSLER DODGE JEEP RAM PALM COAST SPORTS MEDICINE CASH IT IN A AND S HARDWARE ONE STOP FEED JOHNS AUTO PARTS FLAGLER SITE WORKS BUNNELL FEED AND SUPPLY Cowart Ranch and Farms *Times, dates, and prices of any activity posted to our calendars are subject to change. Please be sure to click through directly to the organization’s website to verify. Organization: Cowart Ranch and Farms Location: 8185 W Highway 100 Bunnell , FL , 32110 United States See map: Google Maps Phone: (386) 437-0750 Contact name: . Email address: Ccfamilyfarms@gmail.com Click for more information The event has already taken place on this date: 11/03/2024 Time: *FRIDAY: 5-10pm     *SATURDAY: 10am-9pm    *SUNDAY: 11am-7pm Price: $15, 2 and under are free. Everything included unless noted Ages All Ages Adults & kids together Tags: Event Animals Craft sale / bazaar Festival/fair Games Outdoors Event Fall Nature Outdoors Nature/Outdoors Web Service Pinterest Share on Facebook Tweet Widget Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/cowart-ranch-and-farms",
      "text": "Cowart Ranch and Farms | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Cowart Ranch and Farms Address: 8185 W Highway 100 Bunnell , FL , 32110 Phone: (386) 437-0750 29° 28' 49.458\" N , 81° 23' 27.1536\" W See map: Google Maps http://cowartranchandfarms.com/ info@cowartranchandfarms.com Contact name: Information Business/organization type: Farm Pumpkins What our organization offers: COVID-19 reopened / has upcoming reopening date Fall Farm Activities Pumpkins Corn maze / mazes Halloween events Items to purchase Recreation / Games Subjects / Categories: Hands-on Nature/Outdoors Seasons / holidays: Winter December Holidays Christmas Fall Halloween-Fun Halloween-Scary Our family continues to grow blueberries and we’ve recently branched into new adventures involving pumpkins, sunflowers, and fall family activities. We’ve introduced Agri-tourism into our farming community by hosting Flagler Counties “Maze Dayz,” and we’re doing it again!! The festival is scheduled on weekends in October and weekdays for scheduled school groups. It’s held at The Blueberry Strand, located at 8185 W. Highway 100 in Bunnell. Check our more information about this by clicking on the tab labeled Maze and Fall Festival. We’d love to see you out here this year supporting one of your local farmers. Remember NO FARMS, NO FOOD! Click For More Information - Web Service Pinterest Share on Facebook Tweet Widget Organization: Cowart Ranch and Farms Location: 8185 W Highway 100 Bunnell , FL , 32110 United States See map: Google Maps Phone: (386) 437-0750 The Annual Maze Dayz Cowart Ranch and Farms Dates: 10/04/2025 10/05/2025 10/11/2025 Show more dates Hide these dates 10/12/2025 10/18/2025 10/19/2025 10/25/2025 10/26/2025 11/01/2025 11/02/2025 Time: *SATURDAY: 10am-7pm    *SUNDAY: 10am-7pm Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "text": "Staff & Board Farm Fresh Rhode Island A hub for local food since 2004 VISIT US Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT Mission History Staff & Board Job Opportunities SUPPORT Donate Asparagus Fest Local Food Fest Volunteer NEWS STAFF & BOARD All Staff Board Members Brayden Puddington Board of Directors Vice President - Commercial Banker, J.P. Morgan Chase & Co. ☓ Brayden Puddington Quote Coming Soon! Genevieve Primeau Market Mobile Sales Coordinator ☓ Genevieve Primeau Genevieve’s interest in food systems began while working in the local culinary scene in Providence. It was a formative experience to see first-hand all the moving parts in restaurant operation, while being surrounded by food-oriented people! Then there was a great moment of reckoning during the lockdown of 2020, when she was left to reflect on both the interconnectedness and the vulnerabilities of those systems. Nowadays, she is drawn to the agricultural tech space and particularly moved by the issue of food waste. She is pleased to have found marvelous company working on the Market Mobile team. As for her free time, she’s still searching for a “creative” hobby — suggestions are welcome! John Gray Community Events Director & Co-Locator Liaison ☓ John Gray Whether in Iowa where he was born and raised, New York city where he cut his teeth in the hospitality industry or now in Providence where he’s laid roots, connecting with people through food has always been at the center of the table in John’s life. Over the past two decades, John developed a deep appreciation for serving the highest quality ingredients with the highest quality service while working for some amazing restaurant groups including the Momofuku group in NYC and The Eddy here in PVD. His last foray in the service industry provided the opportunity to achieve a lifelong passion as an owner/operator of Saint Monday on the west side. Most recently, John worked in the Development office of College Unbound, located right up the street on Federal Hill. He hopes to utilize all those varied skills (maybe add a little song and dance from his theater days) in building community and connections through Farm Fresh RI. Sheila Brush Board of Directors, Secretary Retired, Former Director of Programs, Grow Smart RI ☓ Sheila Brush “Farm Fresh Rhode Island does two things that I care deeply about — supporting and strengthening our local farms and working to ensure that all Rhode Islanders, regardless of income, can enjoy the benefits of healthy local food. I have long admired the way Farm Fresh uses resources creatively, effectively, and efficiently to achieve its mission. As Farm Fresh launches new and exciting initiatives, I welcome the opportunity to help advance its work.” Aoife Lee Bird Events and Administrative Associate ☓ Aoife Lee Bird Aoife Bird loves the woods, the plants, and all things food. Born and raised in New England, wild foraging in the woods and waters alongside her mom, she spent the last many years communing with the plants and wilds of the Pacific Northwest. Over the years she has been a caterer, a bookseller, a baker, an archivist, a (very) small-scale farmer, and a healer. Aoife earned her culinary degree from the New England Culinary Institute a million years ago and has since gone on to earn a degree in archaeology from the University of Oregon focusing on people’s use of plants, foods, and ritual. She continued on to gain a Master’s degree in East Asian Medicine from the Oregon College of Oriental Medicine as well as another in Nutrition from the National University of Natural Medicine. In addition, she has graduate certificates in Ecopsychology and in Sustainable Food Systems. She has extensive training in Western herbalism from the Arctos School of Botanical Medicine in Portland, OR, and loves to make medicine. She earned her Permaculture Design Certificate from the Permaculture Women’s Guild and is a member of the American Herbalist Guild, The American Anthropology Association, the American Nutrition Association, and the International Association of Culinary Professionals. Aoife recently returned to her home state of Rhode Island and brought with her a teenager daughter, a Newfoundland named Jeff, a Chihuahua named Sunny, a black kitty named Bitsie, and a baby kitten named Kiki. She loves to walk in the woods, talk to the plants, and explore all the grocery stores everywhere. Jillian Caruso Harvest Kitchen Education Manager ☓ Jillian Caruso Jillian was born and raised in Warwick, RI; recently, she moved to Canterbury, CT. She attended and recently graduated the Culinary Institute of America in Hyde Park, NY with a BPS in Applied Food Studies. She has worked her entire life in kitchen and this is a refreshing new beginning for her. Jillian is passionate about her garden, reading, and her two nieces. Jillian is excited to start her career in nonprofits at Farm Fresh RI. Branden Lewis Board of Directors Chef & Professor, Johnson & Wales University ☓ Branden Lewis Kristine Merz Board of Directors Founder and CEO, Orange Square ☓ Kristine Merz “As board chair, I get to live my values that locally grown food is not only nutritious and delicious, but creates important economic opportunities, provides health benefits and community engagement, and reduces environmental impact. I am grateful for the opportunity to support leadership and staff in any way so that together we can achieve the mission and vision of this very important organization.” Hurricayne Cabral Market Mobile Program Director ☓ Hurricayne Cabral Hurricayne has lived in the Providence area his whole life, graduating from Shea High School in Pawtucket. He started working at Farm Fresh RI in 2018, and since then has grown a strong appreciation for local farmers — in particular, for all the hard work they do every day. Cayne loves working at Farm Fresh and getting products from those local farmers and producers out into the community in many different ways — from delivery to some of the top restaurants in Rhode Island to bringing fresh food right to someone’s front door. When he’s not working hard at Farm Fresh, Cayne enjoys spending quality time with family and friends. He also loves to travel, having visited several different countries and states… and counting! Molly Ellis Assistant Director of Business & Administration ☓ Molly Ellis Molly is a lifelong Rhode Islander. She started out as a volunteer for Farm Fresh RI at the Wintertime Farmers Market in Pawtucket in 2008, and continued through various work study programs and AmeriCorps VISTA terms before becoming a full-time staff member in 2013. Since then, she has managed at least six different farmers markets, become an expert in tent repair, and helped to administer our federal FINI grant that provides funding for the Bonus Bucks program. In her free time, Molly enjoys folk music and dance as well as gardening. Jane Sabatini Board of Directors, Co-Chair Retired Certified Public Accountant ☓ Jane Sabatini “The mission of Farm Fresh RI is powerful to me — bringing local food to all communities and making fresh, local, healthy food affordable. I’m also impressed with its emphasis on nutrition education for all age groups from children to seniors; I believe this outreach is vital if we are to address the growing obesity and related health issues in our society. I hope to be able to help in advancing these objectives.” Jesse Rye Executive Director ☓ Jesse Rye Jesse Rye is the Executive Director of Farm Fresh Rhode Island. He has been with Farm Fresh RI since 2012, and in that time has helped to scale and support the work of Farm Fresh both in Rhode Island and New England. In the last few years, Jesse helped the organization to navigate the major changes necessitated by the COVID-19 pandemic while moving the organization to a newly constructed food hub facility adjacent to downtown Providence. Jesse has experience on the community level as nonprofit manager; statewide as program director and communications specialist; and nationally as a researcher and advocate. Jesse as a part of Farm Fresh is determined to grow a local food system that values the environment, health, and quality of life of farmers and eaters. In addition to his work at Farm Fresh, Jesse has volunteered his time as a board member for Farm to Institution New England, Food Solutions New England, the Rhode Island Food Policy Council, and Red Tomato. Madeleine Pugsley Data Management Community Education AmeriCorps Direct Service Member ☓ Madeleine Pugsley Madeleine grew up in Los Angeles, cooking, singing, and staging elaborate home theatricals with their little sister. They moved to New Mexico to study philosophy and the history of science at St. John’s College, graduating in 2022. An avid bibliophile, they have worked as a private tutor, a college housing coordinator, and four years as a library assistant. In 2023, Madeleine was caught by the siren song of small-scale sustainable agriculture, moving to Maine to be a farm apprentice with MOFGA. They are thrilled to combine their passion for cooking, community, and mother earth’s gifts at Farm Fresh Rhode Island. Natasha Brotherns Market Mobile Inventory Manager ☓ Natasha Brotherns Natasha was born and raised in Providence, RI. She explains, “Growing up my family always kept a small farm and that’s where we ate most of our vegetables and fruit from as well. My interest in food and how it’s grown and distributed comes from my deep roots. My great grandmother being 100% Filipino, fresh produce has always been a part of our dinner table — grown and picked right in our backyard. Having spent most of my working years in the food industry, it’s opened my eyes to such varieties of food and also different cultures. I’d love to continue getting educated on our food system and how we can make it better, safer, and healthier!” Taylor Jacobs Assistant Director of Grants & Data ☓ Taylor Jacobs Taylor grew up surrounded by family gardens — her grandparents even housed some chickens in their backyard. Always hearing her mother pine for the first tomatoes of the season, it wasn’t until a trip to Italy a few years ago that Taylor truly got it. On that trip, she spent five months volunteering on farms in Italy, Greece, and Japan. While trying her hand at making goat cheese, caring for emus, and milking cows, she lived the connection between farmers, animals, the land, and the food that we eat. After returning stateside, she began her Farm Fresh RI journey, first serving as an AmeriCorps VISTA member, and now acting as our Nutrition Education Associate. In her spare time, she loves illustrating, playing with her pet rats, and learning about cheesemaking. Jason Evans, Ph.D. Board of Directors Dean, Johnson & Wales University ☓ Jason Evans, Ph.D. Natalie Varrallo Managing Director ☓ Natalie Varrallo Natalie is a food scientist, advocate, and educator focused on improving sustainability and food security, primarily within marginalized communities. She has a Bachelor of Science in Botany and Sustainable Agriculture, a Sustainable MBA, a Master of Science in Food Justice, and a Master of Science in Sustainable Food Systems. Natalie has spent her career working in many different facets of the food system. Her approach to work seeks to combine social justice and education while simultaneously increasing nutrition and food security within communities. Food is a foundational human right, and Natalie believes food can be used as a bridge to emphasize a compassionate and continual progression toward a more sustainable world. Thea Upham Nutrition Incentive Projects Director ☓ Thea Upham Thea moved to Providence in 2004 to attend Johnson & Wales University and graduated with a degree in Food Service Entrepreneurship. She has spent the past 10 years working with food in different capacities — as a chef, farmers market vendor, and farm hand — and has always been mindful of linking her work to the larger local food system. She firmly believes that the decisions we make about what we eat and where it comes from can have great impacts on the health and welfare of our local community. Thea ties these ideals into her work at Farm Fresh RI every day. Paula Gill Director of Business & Administration ☓ Paula Gill Paula is a local urban gardener with a love for growing and eating fresh, organic produce. A trip to Italy sparked a desire to change the way she feeds herself, after being deeply impacted by Italians’ passionate relationship to food and the Slow Food movement there. Since that impactful trip, she has dreamt of farming in Tuscany. By joining the Davis Park Community Gardens, as well as becoming a beekeeper, she has been able to make this dream a reality right here in Providence. Paula brings with her a first-hand knowledge of running a small business, in addition to her knack for numbers. She is excited about all that Farm Fresh RI is accomplishing and being an active member of the sustainable food movement in Rhode Island. Rodolfo Lucero Market Mobile Driver ☓ Rodolfo Lucero Rob Andreozzi Board of Directors Owner, Pizza Marvin ☓ Rob Andreozzi As a restaurant owner, Farm Fresh makes it possible to connect with local farmers in a meaningful way. Utilizing Market Mobile allows me to focus on growing my restaurant and building my team while still being able to support the best local farms at the same time. While Market Mobile is the program I interact with most frequently, I look forward to contributing my energy and passion into supporting and advocating for the success of each of the initiatives that Farm Fresh has to offer the community. Lily Harding Lead Community Educator ☓ Lily Harding Lily grew up in California, but she got attached to Providence while getting her Biology degree from Brown University. She believes that food is central to community, just and sustainable food systems are essential, and education should be accessible, relevant, and fun. Lily has loved working with kids at summer camps, and is so excited to engage youth in understanding food systems as part of the Community Education team at Farm Fresh RI! Outside of work, you’ll find Lily running, cooking, and doing crossword puzzles. Mathew Lamoore Market Mobile Fleet and Facilities Manager ☓ Mathew Lamoore Rigoberto Ogubando Market Mobile Driver's Assistant ☓ Rigoberto Ogubando Andrea Aguilar Farmers Market Associate ☓ Andrea Aguilar Andrea grew up in New York and came to Providence to study culinary arts at Johnson & Wales University. After graduation, she took a gap year and went to work with her mom at her bakery, decorating cakes and then went to work at a bank. Now, Andrea wants to go back to school to pursue a Bachelor’s degree in children’s nutrition. In her free time, she likes to cook and bake for her family, tend to her garden, and have picnics in the park. Kelley McShane Board of Directors Managing Partner, The Granny Squibb Company ☓ Kelley McShane “It is an honor to work with people who are passionate about the Rhode Island food and beverage industry, supporting local business and farmers, and making sure that healthy food is accessible to all Rhode Islanders. Their work is more important now than ever. I am thrilled to be a part of Farm Fresh Rhode Island’s Board of Directors.” Breanne Penkala Hope's Harvest Operations Manager ☓ Breanne Penkala Breanne is a RI native with a passion for fresh, local, and affordable food. After working on organic farms for the last 7 years in Upstate New York, Breanne is happy to finally return to the Ocean State. Breanne is excited to join the Hope’s Harvest team, building connections with local farmers and other food related organizations, while recovering produce from local farms and improving food security. In her free time, Breanne enjoys gardening, trying out all of the local ice cream shops, spending time by the ocean, and hiking with her dog. John Auger Board of Directors, Co-Chair Managing Director IT projects, Blue Cross & Blue Shield of Rhode Island ☓ John Auger “I believe access to fresh and local food is key to addressing many of the health, economic, and environmental issues we face in our communities and our nation. Farm Fresh RI has been on the leading edge of tackling these challenges for years. The organization’s focus on availability of local and affordable foods, its nutrition education programs, and efforts to improve the impact of food production on our environment are critical steps to achieving a healthy farm to fork community. I’m appreciative of the opportunity to be part of the Farm Fresh RI team, and I look forward to participating in advancing the values and mission they represent.” Cassidee Jones Community Education Manager ☓ Cassidee Jones Native to Alabama, Cassidee grew up spending time outside with family, from fishing to gardening to demolishing a watermelon daily (or so it seemed). Everything about life in rural AL was centered around agriculture and poverty, resulting in a food desert. Cassidee decided that there had to be more, so she went in search of an answer at Auburn University, receiving a degree in history as well as political science focusing on African history and food politics, with a minor in sustainability. Her studies combined with five years in the service industry led her to pursue a Masters in Food Security and International Development from the University of Sussex in England. She began working with international organizations to support access to products to treat malnutrition, but involvement in her community garden and a desire to tackle root causes of food injustice led her to Farm Fresh RI. Now she pursues her passion by day and her million hobbies by night, including pottery, tufting, home renovation, cycling, swimming, and more. Charreese Braxton Harvest Kitchen Production Manager ☓ Charreese Braxton Charreese was born and raised in Philadelphia, PA. She moved to Providence to attend Johnson & Wales University in 2016. She graduated with a B.S. in Food Service Management with a focus in Food Sustainability in 2020. Since moving to Providence she has worked in various restaurants, getting her feet wet in the industry, which got her involved in working with local products from farms in the New England area. Kiffen Ratkevich Market Mobile Sales Manager ☓ Kiffen Ratkevich A native of Newport, RI, Kiffen has long been passionate about food and his community. After cooking professionally for 10 years, he moved on to program and project management. Kiffen is excited to join Farm Fresh RI and be an active member of the sustainable and equitable food movement in Rhode Island. He enjoys cooking for his friends and family and spending time with his wife at the beach. Kristen (KD) Dayton Harvest Kitchen Program Support ☓ Kristen (KD) Dayton Kristen (KD) Dayton is an enthusiastic communicator, a lifelong learner, and an advocate for connecting people through food. A recent graduate of the Sustainable Food Systems program at Johnson & Wales University, she enjoys facilitating information exchange and instructing people of all ages and backgrounds in how to appreciate food. In addition to her degree from Johnson & Wales, KD also holds a Master’s degree in International Relations from the University of Kent and dual Bachelor’s degrees in Political Science and Philosophy. She worked for several years in strategic communications for the international development sector of the federal government, and this experience grew her passion for travel and learning about other cultures. KD is delighted to work with Farm Fresh RI, shifting her career towards supporting the future of our global and local food systems. Cheryl Zecchin Farmers Market Associate ☓ Cheryl Zecchin Rob Glover Farmers Market Technology Specialist ☓ Rob Glover Rob’s introduction to agriculture came about through working on small farms in the WWOOF program, where they discovered their love for the field. Their eventual goal is to run their own farm to help provide wholesome food for their community and help foster a love of farming in others. They have worked throughout many different levels of the production chain in local food enterprises, building skills to help them realize this dream. Rob is excited to bring those skills to Farm Fresh RI, where they strive to support local farmers and help strengthen a sustainable, resilient, and equitable food system in Rhode Island. Allison Fleet Board of Directors Partner, Partridge, Snow & Hahn LLP ☓ Allison Fleet Angel Mendez Board of Directors Executive Director, Red Tomato ☓ Angel Mendez Turon Williams Market Mobile Operations Manager ☓ Turon Williams Turon moved to Providence at a very early age. He has attended the community college of RI. Turon also has been dealing in produce since 2005, when he was a manager for multiple wholesale companies. He firmly believes that building a successful team starts with great leadership and communication. In Turon’s spare time, he officiates basketball games for the kids across the east coast. Turon is very excited to join the Farm Fresh RI team, and believes that he can teach and learn from his coworkers, as well as associates. Kellie Beretta Assistant Director of Development ☓ Kellie Beretta As the daughter of a chef, food has been a major part of Kellie’s life since birth. Originally from New York, she studied Baking & Pastry Arts/ Food Service Management at Johnson & Wales University (North Miami), and spent several years managing bakeries. After leaving kitchens and graduating with a Masters in Public Administration from Suffolk University, she knew she wanted to work with food in a different way, which led her to pursue a career at food focused non-profits. Previously she was Senior Development Manager at Project Bread, a Massachusetts based anti-hunger organization and Director of Individual Giving at Chef Ann Foundation, focusing on scratch cooking in schools. A lover of all things local and devoted farmers market shopper, Kellie is thrilled to be at Farm Fresh RI! When not training for a marathon, quahogging, or on a boat, Kellie can be found relaxing at home in Jamestown with her husband and rescue puppy, Princess Leia. Stephanie Pike Farm and Sea to School Director ☓ Stephanie Pike Stephanie was born and raised in Rhode Island and loves to be surrounded by good food and good people. She is a Registered Dietitian who received her training from URI and Keene State College, and has always focused her efforts on community nutrition and food insecurity. Stephanie’s career and personal paths have led her to work, volunteer, and educate in many community-based settings with a variety of groups. She believes in the power of food to create lasting change and strives to support communities in meaningful food and food systems exploration and learning. Onyx Sanchez Market Mobile Packhouse Associate ☓ Onyx Sanchez Danielle Demers Harvest Kitchen Markets & Cafe Coordinator ☓ Danielle Demers Danielle, Dani for short, was born and raised in Attleboro, MA, and now is a native of Warwick, RI. Before joining the Farm Fresh RI team, she worked for Sodexo food services for six years as a rounds chef and caterer. Danielle loves cooking with a passion. She also loves the outdoors, her houseplants. and her three dogs!  Danielle looks forward to helping out the community and working with the Farm Fresh family at Harvest Kitchen. Sean Kontos Harvest Kitchen Program Director ☓ Sean Kontos Sean is a native of Dover, NH, who has been working in the food service industry for 13 years. After graduating from Johnson & Wales University with a degree in culinary arts in 2011, he went on to cook around Nantucket and the seacoast of New Hampshire, focusing on local and sustainable cooking particularly tied to whole animal butchery. After backpacking through Europe, he and his now wife, moved to Providence where he worked at Local 121, eventually becoming head chef. Most recently, he helped open Farm & Coast Market in South Dartmouth, MA, as a butcher and chef. Sean started out as a volunteer with our RI Farm to School program until moving on to work with Harvest Kitchen. Allyson Jennings Assistant Director of  Hunger Relief ☓ Allyson Jennings Ally is a Rhode Island native with a passion for environmental sustainability and community engagement. After graduating from Johnson & Wales University in 2018 with degrees in Business Administration and Event Management, she served a year with the AmeriCorps National Civilian Community Corps (NCCC). Following her NCCC term, Ally joined Farm Fresh as the Farm to Food Pantry AmeriCorps VISTA. Now serving as the Assistant Director of Hunger Relief, Ally is excited to continue working with growers/producers, hunger relief agencies, and state agencies to help support the local food system. In her spare time, Ally enjoys hiking, camping, dancing, and baking. Julie Rondot Farmers Market Program Manager ☓ Julie Rondot Originally from France, Julie Rondot moved to Rhode Island and joined Farm Fresh RI motivated by her desire to make healthy, local food accessible to everyone. With a degree in Communication and Human Resources, she previously worked as a communications manager and events coordinator in France. Eager to make a real impact and passionate about nature, she pivoted her career to the environmental sector where she campaigns for equitable access to local food. Outside of her professional pursuits, she finds pleasure in hiking, camping, and exploring nature. She hopes to help others rediscover and reconnect to nature’s natural beauty and bounty! Delite Primus Director of Advancement ☓ Delite Primus Delite grew up in Steamboat Rock, Iowa, on her family’s corn, soybean, and dairy farm, learning early on the importance of food origin, food security, and the hard work and dedication needed to grow a passion from seed. After receiving her bachelor’s degree in Business Administration from Wartburg College (Waverly, IA) she began her career in Development with United Way of Central Iowa where she gained a strong foundation in donor relations and fundraising. After stops at Habitat for Humanity in Minnesota and Heifer International in California, she landed in Moab, Utah, at a food-based nonprofit called the Youth Garden Project (YGP). As Associate Director and later Executive Director of YGP, Delite led the organization and staff team, while having a specific focus on fundraising efforts — increasing individual donors, corporate partnerships, and grant awards during her tenure. Her 10 years at the organization nurtured her interest in being connected to community food systems and increasing healthy food access. Most recently, Delite served as a Proposal Development Specialist with Utah State University, working directly with faculty as well as state and federal agencies to secure funding for Agriculture and Natural Resource programs. Delite and her partner relocated to Rhode Island in 2019 to be closer to family. She was thrilled to find an organization like Farm Fresh RI that is the perfect merger of her personal passions and professional experience. Away from work, Delite enjoys working in her own garden, riding her bike, hiking a trail, traveling, and any day that involves more hours outside than less. And of course, she enjoys relaxing at one of South County’s amazing beaches. Virginia Branch Board of Directors Principal Owner, Branch Architects ☓ Virginia Branch Susan Clausen Director of Facilities ☓ Susan Clausen After graduating from the University of Illinois and spending a year giving back to the community as a CETA worker for a grassroots recycling program (before everybody recycled!), Susan worked as a studio assistant for several glass artists. For well over a decade, she continued working in the jewelry industry, living in North Carolina, Pennsylvania, Maine, and Rhode Island. In 1985, she was a founding member of the unjuried, uncensored arts organization in Providence called AS220, and spent countless hours volunteering and eventually being employed by AS220 as Property Manager — a role she held for 16 years. Her commitment to building community and working in the nonprofit sector then led her to Farm Fresh RI, where she hit the ground running to help complete and launch our brand-new facility Providence (during a pandemic!). All throughout her career, Susan has maintained an art studio where she continues to produce mixed media artworks and dabbles in music. She sees cooking as another creative practice, and has found great pleasure cooking healthy foods from local farms. Caroline Grand Associate Director of Marketing ☓ Caroline Grand A native of New Orleans, Louisiana, Caroline was raised with a love for both the culinary arts and local ecosystems. She grew up duck hunting, fishing, beekeeping, raising chickens, and tending to her family garden, where she developed a deep appreciation for both cultivated crops and wild flora. After graduating with a Master of Arts in English Literature from Northeastern University, Caroline honed her skills in both writing and pedagogy to develop marketing initiatives for an alternative educational retreat in New York City. As an adoptive New Englander, she is thrilled to marry her professional skills and personal passions at Farm Fresh Rhode Island for the betterment of the community she lives in and loves. In her free time, Caroline enjoys reading, cooking, knitting, plant foraging, and printmaking. Caitlyn Goeden Farmers Market Associate ☓ Caitlyn Goeden Originally from Massachusetts, Caitlyn moved to Rhode Island in 2015 to attend Roger Williams University where she graduated with a degree in Criminal Justice. She loved Rhode Island so much, she decided to make it her home! While she works full time in field of victim services, Caitlyn wanted to become more involved and engaged in the greater-Providence community. She thought no better way to do that than to join the Farm Fresh Farmer’s Market Team! In her free time, Caitlyn enjoys cooking dinner, trying out new recipes, eating ice cream, and spending time in the sunshine. She is frequently making meals out of the random findings from the pantry and having themed picnics in the park with friends. Natalie Faragon Food Access Operations Manager ☓ Natalie Faragon Natalie (she/her/hers) is from Long Island, New York. From a young age, she helped tend her family’s vegetable garden and learned to cook with whole, fresh produce. Her passion for food and service inspired her to move to Providence in 2015 to attend Johnson & Wales University, where she earned a degree in Restaurant, Food, and Beverage Management. Natalie is a part time yoga instructor at two local studios and enjoys connecting with her students by teaching mindfulness and movement practices. She lives in Providence with her partner, and in her free time, she enjoys hiking, reading, eating ramen, and playing video games. Diego Juarez Building Security & Maintenance Events Associate ☓ Diego Juarez Nancy Reiter Board of Directors Retired, Former Senior Technical Director and Lean/Six Sigma Black Belt, AT&T ☓ Nancy Reiter I came to Farm Fresh RI as a volunteer gleaner with Hope’s Harvest.  The concept of eliminating food waste at the source and making fresh, local produce available to all Rhode Island residents became my passion.  Understanding the larger picture, I am proud to devote my time, hands, knowledge, and skills to Farm Fresh to further the vision of a robust local food chain accessible to all. Farm Fresh Rhode Island is an Equal Opportunity Provider CONTACT 401–312–4250 10 Sims Ave, unit 103 Providence, RI 02909 LOCAL FOOD RESOURCES RI Farmers Markets Guide Double Your SNAP/EBT Order Local Food Volunteer with Us Ag Exchange Public Forum GET WEEKLY NEWS © 2025 · Farm Fresh Rhode Island · Credits · Design & Development by // DESIGN AGENCY // VISIT US ▼ Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS ▼ Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT ▼ Mission History Staff & Board Job Opportunities SUPPORT ▼ Donate Asparagus Fest Local Food Fest Volunteer NEWS"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "text": "Contact Us | Reach The Buckeye Ranch | Buckeye Ranch Blog In the News Careers Newsletter Sign Up Donate Now Our Services Residential Treatment Services Psychiatric Residential Treatment Facility (PRTF) Qualified Residential Treatment Program (QRTP) Community-Based Mental Health Intensive Family Support Program (IFSP) Intensive Home-Based Therapy (IHBT) Multi-Systemic Therapy (MST) Functional Family Therapy (FFT) Outpatient (OP) program Integrated Co-Occuring Treatment (ICT) Education-Based Mental Health School-Based Mental Health Services The Bonner Academy Somali Outreach and Mental Health Program Early Childhood Mental Health Child Welfare Services Permanent Family Solutions Network (PFSN) Foster Care Foster Parent Benefits We Raise Hope Foster Parent Conference Support Services Foster Parent Training Foster Care Parent Education Resources FAQ’s Transitional Age Youth My Place Bridges Post-Emancipation Services Integrated Care Services Same-Day Access Care Coordination OhioRISE Community Medication Management Get Involved Donate Now In-Kind Donations Volunteer A Positive Note Home Runs for Hometown Kids Hope for the Holidays Become a Foster Parent Foster Parent Training Foster Care Parent Education Resources Foster Parent Benefits Support Services FAQ’s We Raise Hope Foster Parent Conference About Us Our Work Trauma-Informed Care Treatment Approaches DEI Declaration Principles of Quality Care Impact Reports Our Locations Whitehall, OH – Headquarters Grove City, OH – Residential Treatment Campus Columbus, OH – The Bonner Academy Columbus, OH – My Place Cincinnati, OH – The Buckeye Ranch Foster Care Newark, OH – The Buckeye Ranch Foster Care Blog Our History Our Leadership Resources Caregiver Peer Support Groups Our Board General FAQs Join Our Team Careers Internships Contact Request Services Foster Care Referrals My Place Referral Records Requests Youth and Family Rights Newsletter Sign Up Blog In the News Careers Newsletter Sign Up Donate Now address 4653 East Main Street Whitehall, Ohio 43213 call us (614) 875-2371 national suicide prevention lifeline Call 988 address 4653 East Main Street Whitehall, Ohio 43213 call us (614) 875-2371 national suicide prevention lifeline Call 988 Request Services Contact Us Contact Our Team with Questions Today! Contact Us general service inquiries Please contact our Admissions and Engagement Department for more specific information about how our programs and services can support you and your family. Inquiry for services can be made by clicking the button below or by calling 614-875-2371 Monday-Friday 8:30 a.m.-4:30 p.m. Should you need to contact us via fax, that number is 614-384-7703. Access Services Same-Day Access If families need walk-in Same-Day Access support, that is available in-person at our Michael and Paige Crane Center for Children and Families Headquarters (4653 E. Main Street location Whitehall, OH) Mondays/Tuesdays/Thursdays from 9 a.m. to 3 p.m. or Wednesdays from 9 a.m. to 6 p.m. If our East Main location is not an option for you, please call us at 614-384-7798. Learn More foster care inquiries Are you interested in becoming a foster parent? Fill out our interest form below or give us a call at (800) 296-5113. Become a Foster Parent Today Are you a referring agency for foster care? Line Arrow 22 Please email/call our offices Monday through Friday from 9 a.m. to 5 p.m. to speak to a staff member regarding referrals: Central Ohio Offices: fostercarereferrals@buckeyeranch.org Cincinnati Office: fostercarereferralscincinnati@buckeyeranch.org Should you be seeking a foster home for a child after regular business hours, please call our after-hours office lines: Central Ohio Placements: (614) 312-9773 Cincinnati Placements: (513) 508-0935 our locations and program offerings Michael and Paige Crane Center for Children and Families Headquarters 4653 East Main Street Whitehall, OH 43213 (614) 875-2371 View on map Offerings: Same-Day Access, Care Management Entity (CME), Permanent Family Solutions Network (PFSN), Foster Care, Transitional Aged Youth, Bridges, Community-Based Mental Health programs (MST, FFT, IFSP, IHBT, ICT, and Outpatient), Teletherapy options, Community Medication Management, and Training Learn More Grove City Residential Campus 5665 Hoover Road Grove City, OH 43123 (614) 875-2371, press 2 View on map Offerings: Residential programs, including QRTP and PRTF, Outpatient program therapy services, and Training Learn More The Bonner Academy (Day Treatment) 2865 West Broad Street Columbus, OH 43204 (614) 875-2371, press 5 View on map Offerings: Education-Based Mental Health programs, Early Childhood Mental Health, Somali Outreach and Mental Health, The Bonner Academy, and Outpatient program therapy services Learn More My Place 1625 East Mound Street Columbus, OH 43205 614-875-2371, press 6 View on map Offerings: Transitional Age Youth Independent Living Campus Learn More The Buckeye Ranch Newark Office 195 Union Street, Suite B-3 Newark, OH 43055 (614) 875-2371, press 4 View on map Offerings: Foster Care and Outpatient program therapy services Learn More The Buckeye Ranch Cincinnati Office 4623 Wesley Avenue, Suite G Cincinnati, OH 45212 (513) 772-5800 View on map Offerings: Foster Care Learn More 4653 East Main Street Whitehall, Ohio 43213 (614) 875-2371 services Education-Based Mental Health Community-Based Mental Health Child Welfare Residential Treatment Integrated Care Request Services Become A Foster Parent about us FAQ’s Careers In the News Blog Our Locations quick links Donate Now A Positive Note Volunteer Impact Reports Privacy Policy Client Rights follow us Stay in touch Sign up for our newsletter mailing list: Sign Up National Suicide Prevention Lifeline Call or text 988 Providing 24/7 crisis support across the US. © Buckeye Ranch 2025. All rights reserved. Top"
    },
    {
      "url": "https://circleffarms.com/contact-us/",
      "text": "Contact Us - Circle F Farms Home Our Story Circle F Sales Cattle Herd Registered Brahman Registered Brangus Registered Angus Registered Charolais Registered Red Angus F1 Program Commercial Herd Contact Us contact us we would love to hear from you About You Your Name (Required) First Last Your Address Street Address Address Line 2 City ZIP Code How Can We Reach You? We would love to chat with you. How can we get in touch? Preferred Method of Contact Email Phone Your Email Address (Required) Email Address Confirm Email Address Your Phone (Required) Best Time to Call You (Required) Select A Time 12:00 am 12:30 am 1:00 am 1:30 am 2:00 am 2:30 am 3:00 am 3:30 am 4:00 am 4:30 am 5:00 am 5:30 am 6:00 am 6:30 am 7:00 am 7:30 am 8:00 am 8:30 am 9:00 am 9:30 am 10:00 am 10:30 am 11:00 am 11:30 am 12:00 pm 12:30 pm 1:00 pm 1:30 pm 2:00 pm 2:30 pm 3:00 pm 3:30 pm 4:00 pm 4:30 pm 5:00 pm 5:30 pm 6:00 pm 6:30 pm 7:00 pm 7:30 pm 8:00 pm 8:30 pm 9:00 pm 9:30 pm 10:00 pm 10:30 pm 11:00 pm 11:30 pm What's on your mind? Please let us know what's on your mind. Have a question for us? Ask away. Your Comments/Questions (Required) Company This field is for validation purposes and should be left unchanged. Location 70 Prentiss Road Baxley, GA 31513 Contact Us Do you have questions about Circle F, feel free to give us a call! Woody Folsom, Owner 912-253-8166 woodyf@woodyfolsom.com Keaton Walker, Marketing & PR Director 229-921-6944 kgwalker16@gmail.com Chris Shivers, Genetics Specialist and Consultant 713-202-1747 infinitycattleservices@gmail.com Location Circle F Sale Arena and Farm 70 Prentiss Rd Baxley, GA 31513 Contact Woody Folsom, Owner 912-253-8166 woodyf@woodyfolsom.com Keaton Walker, Marketing & PR Director 229-921-6944 Kgwalker16@gmail.com Chris Shivers, Genetics Specialist and Consultant 713-202-1747 infinitycattleservices@gmail.com Quick Links Home Our Story Circle F Sales Cattle Herd Registered Brahman Registered Brangus Registered Angus Registered Charolais Registered Red Angus F1 Program Commercial Herd Contact Us ©2024 Circle F Farms. All Rights Reserved. Website Design By Ranch House Designs, Inc. Home Our Story Circle F Sales Cattle Herd Back Registered Brahman Registered Brangus Registered Angus Registered Charolais Registered Red Angus F1 Program Commercial Herd Contact Us"
    },
    {
      "url": "https://www.forbes.com/sites/jimdobson/2020/09/15/billionaire-cowboys-are-buying-and-selling-the-largest-ranches-in-america/",
      "text": "Billionaire Cowboys Are Buying And Selling The Largest Ranches In America Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Editors' Pick Lifestyle Travel Billionaire Cowboys Are Buying And Selling The Largest Ranches In America By Jim Dobson , Senior Contributor. Forbes contributors publish independent expert analyses and insights. Jim Dobson is a full-time luxury travel writer based in Italy. Follow Author Sep 15, 2020, 10:40am EDT Jun 29, 2021, 08:32am EDT Share Save This article is more than 4 years old. Aspen Valley Ranch owned by billionaire Charif Souki Blake Marvin / HKS, Inc. / Coldwell Banker Driving across America, the landscape starts to look like an oil painting, with hypnotic views of rolling countryside, countless rows of cornstalks, and cattle farms dotting the horizon. Boundless miles of empty land stretches out as far as the eye can see, but only a few families own most of it. Relatives hold onto their property through generations, which is why the top 100 landowners control a great majority of the country’s ranches. Ranch real estate specialist Sam Middleton with Chas S. Middleton and Son says; “Typically, the large and historic ranches only become available after a death in the family. Most of these ranches have been owned and operated for several generations but with the expansion of the family ownership members, the new generation often does not have the sentimental attachment and pride of ownership of earlier generations. At that point, it often becomes easier for the family members to elect to sell the property and divide the proceeds rather than to continue on with management of the large asset.” Nearly half of all Midwestern farmland is owned by people who don't farm themselves. Many of these families make their fortunes in the lumber and forest industry, with millions of acres in timberland throughout the Pacific Northwest. Others own expansive cattle and farms throughout the Great Plains and the West. Some ranches include land leased from the state or government for cattle grazing, while others offer oil and gas revenue. Billionaire Michael Bloomberg's Westlands Ranch in Colorado Hall and Hall Deemed as the ultimate social distancing retreat, billionaire style mega-ranches are dominating the luxury real estate market, with opportunistic investors looking to liquidate their assets. According to Eric O’Keefe with The Land Report , “Land as an investment-grade asset has enjoyed a banner 2020. It’s one of the few bright spots during this otherwise horrible year. Clearly, the value of a remote or a removed getaway has become a much-coveted quality. Productive cattle ranches and top-tier recreational properties have continued trading at the levels they were listed at. When it comes to the value of their portfolios, landowners definitely sleep better.” MORE FROM FORBES ADVISOR Best Travel Insurance Companies By Amy Danise Editor Best Covid Travel Insurance Plans By Amy Danise Editor Rancho Latigo in Santa Ynez, California is currently up for auction and is more than five times the size of New York’s Central Park. Hall and Hall Investors who’ve been buying farmland for several years are making profits now with new investors eyeing these plots as a safe, sustainable retreat, especially during the pandemic. “Our showings and deal numbers are off the charts right now,” says Bill McDavid, Director and Partner of Hall and Hall , specializing in selling some of the most spectacular farm and ranch properties in America. “We have been on an upward trend for the last decade. Pre-Covid buyers were always looking for social distance... we just didn't call it that. So, in that respect, not much has changed in terms of what motivates people to consider buying these landscapes. The world is stiflingly crowded and for those that have the means to put some real space around them, why wouldn't they?” The pandemic offers a silver lining for these landowners and buyers. “Escrow periods are noticeably shortened,” he says, “and I think this reflects the buyers' desires to immediately begin using the property. That underscores the heightened levels of urban stress associated with the pandemic. Historically, most buyers wanted to paint their own canvas of land with their dream of what a home and barn should be. For that reason, I always said my job would be easier if I had nothing but bare land to sell. But these days, people really want to plug and play, and they want to do it now!” Monster Lake Ranch owned by billionaire rapper Kanye West Hayden Outdoors Experts say that even more farmland will make its way onto the market in the next few years, because a majority of America’s farmland is owned by people aged 75 or older. Property forecasters say millions of acres will change hands, and investors are the primary benefactors. Middleton says; “Historically, land ownership has been an attractive investment because of long-term appreciation, tax advantages, along with the romance and enjoyment offered by owning land. Many large ranches are purchased not only for cattle ranching, but for recreational uses, such as hunting, fishing and enjoyment of the great outdoors.” Dawson Elk Valley Ranch owned by tobacco billionaire Brad Kelley Hall and Hall The most prominent landowners in the United States together own almost 13 million acres across the country. The ten largest landowners in America are 1. cable and media honcho John Malone (2.2 million acres), 2. lumber titans Emmerson Family , 3. CNN founder Ted Turner , 4. logging industry Reed Family, 5. sports mogul Stan Kroenke , 6. lumber industry Irving Family , 7. Subway Sandwich founder Peter Buck , 8. tobacco guru Brad Kelley , 9. Teledyne’s Henry Singleton Family, 10. King Ranch Heirs. The most high profile recent acquisition was by NY billionaire Michael Bloomberg who paid $44.79 million for a 4,600-acre Colorado ranch owned by billionaire Henry Kravis and Home Depot billionaire founder Arthur Blank who paid $20 million for Paradise Valley Ranch in Montana. It has also been reported that Netflix billionaire founder Reed Hastings is building a 2,100 acre, $20 million Lone Rock Ranch compound in Colorado. Billionaire rapper Kanye West dropped over $25 million on two Wyoming properties; Hayden Outdoors were the brokers behind both the Monster Lake Ranch (now called West Lake Ranch) and Bighorn Mountain Ranch sale. West is hoping to expand his foothold with a third reported Wyoming property, the Double Doc Horse Ranch. Greg Norman's Seven Lakes Ranch in Colorado Hall and Hall The luxury real estate market is booming, partly because of our economy. “Currently, with interest rates at all-time lows, owning ranch property is a very attractive investment” Middleton says, “Qualified buyers are now able to purchase and finance ranches with interest rates in the 3% range, which many view as ‘free money’. Now, because of the COVID pandemic, ‘city folks’ are looking to buy ranches as an escape from large population areas so they can breathe the clean country air.” Other spectacular ranches currently for sale include; billionaire Charles Koch ’s Matador Ranch in Texas, which will soon hit the market for $124 million, Boone Pickens Mesa Vista Ranch in Texas for $220 million, Tobacco billionaire Brad Kelley ’s Elk Valley Ranch in New Mexico for $96 million, Hamms Brewing William Lang ’s IX Ranch in Montana for $58 million, and Vintner Raymond Duncan ’s family Diamond Tail Ranch in Colorado for $45 million. Celebrity properties are also featured, including the late Patrick Swayze ’s New Mexico ranch for $13 million, Terry Bradshaw’ s Quarter Horses Ranch in Oklahoma, Mel Gibson ’s former Beartooth Ranch in Montana for $30 million, Bing Crosby ’s former Lawson Ranch in Nevada for $7.2 million, and golfer Greg Norman ’s Seven Lakes Ranch in Colorado for $40 million. Brewster Ranch King Land & Water O’Keefe has compiled this list of iconic ranches currently on the market. Brewster Ranches • $319M • Texas “This massive assemblage of 420,000 acres in the Far West Texas cowboy country is a portion of the million-plus acres owned by tobacco billionaire Brad Kelley , who also owns Calumet Farm and whose Thoroughbred Oxbow won the 2013 Preakness Stakes. Brewster Ranches consists of five major cattle ranches that are available singly or as one mega ranch. Helicopters not included.” Gateway Canyons Ranch in Colorado owned by John Hendricks Sothebys International Realty Gateway Canyons • $279M • Colorado + Utah “Discovery Channel founder John Hendricks created a 6,900-acre oasis on the Colorado-Utah line. Better yet, West Creek Ranch is listed with his adjacent 72-room full-service resort, Gateway Canyons Resort & Spa.” Mesa Vista Ranch Hall and Hall Mesa Vista Ranch • $220M • Texas “T. Boone Pickens’s 100-square-mile Texas Panhandle ranch has been deemed ‘arguably the finest quail hunting spot in the known universe.’ Thanks to its own 6,000-foot, FAA-approved airstrip, and a 25,000-square-foot hangar, the Oracle of Oil regularly commuted from the Mesa Vista to his Dallas office.” Historic barn at Aspen Valley Ranch Carrie Wells Aspen Valley Ranch • $220M • Colorado “Natural gas billionaire Charif Souki has focused his considerable talents on a breathtaking new project: 813 acres just 12 miles from downtown Aspen. With seven homes, its own clubhouse, and a gym, why would anyone need to go into town?” Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    }
  ]
}