{
  "fuentes": [
    {
      "url": "https://crabs.com/pages/private-dining-events",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://hollywoodgazette.com/in-memoriam-billy-hershey-the-man-behind-the-stone-crabs/",
      "email": "info@hollywoodgazette.com"
    },
    {
      "url": "https://crabs.com/pages/dinner-menu",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://humboldtcrabs.com/about-the-crabs/",
      "email": "rec@cityofarcata.org"
    },
    {
      "url": "https://humboldtcrabs.com/about-the-crabs/",
      "email": "accounting@humboldtcrabs.com"
    },
    {
      "url": "https://humboldtcrabs.com/about-the-crabs/",
      "email": "president@humboldtcrabs.com"
    },
    {
      "url": "https://humboldtcrabs.com/about-the-crabs/",
      "email": "rec@cityofarcata.org"
    },
    {
      "url": "https://www.allworld.com/billys-stone-crabs-hollywood-florida/",
      "email": "info@allworld.com"
    },
    {
      "url": "https://www.allworld.com/billys-stone-crabs-hollywood-florida/",
      "email": "media@allworld.com"
    },
    {
      "url": "https://www.allworld.com/billys-stone-crabs-hollywood-florida/",
      "email": "tim@allworld.com"
    },
    {
      "url": "https://www.allworld.com/billys-stone-crabs-hollywood-florida/",
      "email": "close@2x.png"
    },
    {
      "url": "https://crabs.com/pages/lunch-menu",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/pages/seafood-market-miami-fl",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/collections/fresh-seafood",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/pages/about-us",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/collections",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/pages/reviews",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/pages/restaurant",
      "email": "billyskeylimepie_x270@2x.jpg"
    },
    {
      "url": "https://crabs.com/pages/restaurant",
      "email": "billyslobstertail_x270@2x.jpg"
    },
    {
      "url": "https://crabs.com/pages/restaurant",
      "email": "info@stagheaddesigns.com"
    },
    {
      "url": "https://crabs.com/pages/restaurant",
      "email": "mustard-sauce_x270@2x.jpg"
    }
  ],
  "mails": [
    "accounting@humboldtcrabs.com",
    "billyskeylimepie_x270@2x.jpg",
    "billyslobstertail_x270@2x.jpg",
    "close@2x.png",
    "info@allworld.com",
    "info@hollywoodgazette.com",
    "info@stagheaddesigns.com",
    "media@allworld.com",
    "mustard-sauce_x270@2x.jpg",
    "president@humboldtcrabs.com",
    "rec@cityofarcata.org",
    "tim@allworld.com"
  ],
  "nombre_sitio": "crabs.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://crabs.com/pages/private-dining-events",
      "text": "Private Dining & Events at Waterfront Restaurant in South Florida | Billy's Stone Crab Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Private Dining & Events at Waterfront Restaurant in South Florida Looking for the ultimate day or night out with friends or family to savor the sweet-meat claws that Southern Florida offers? Well, you are just in for a treat. Since opening its doors in 1995, Billy's Stone Crab has updated its exterior and spruced up its main dining room. In recent years, we've launched BSC Fisheries in the Lower Keys near Marathon, FL, and Summerland Key, FL, where we have a dedicated fleet of 40 vessels bringing in daily catches of stone crab, Florida lobster, and fresh fish for our delectable dishes. Billy's Stone Crab is also one of the restaurants with private rooms in Miami. Stay with us to sample our unique private dining and event experience. Every Choice is Yours Billy's can handle both large and small gatherings for every occasion, thanks to our versatile floor layouts and a range of rooms (rehearsal dinners, corporate events, milestone celebrations, board meetings). Everything, from the food to the décor, may be customized to meet the demands of your visitors. Our fully equipped and spacious Private Dining Area, which includes a Chef's table, private bar, and floor-to-ceiling windows, is ideal for a chilled-out private event. While at lunch or entertaining business associates, business guests are invited to have a nutritious seafood meal in an attractive air-conditioned dining area with a beautiful view of the Intracoastal Waterway. Your Team is Waiting We have a dedicated private dining crew separate from our dining room service. Your guests will receive the utmost care and attention without any distractions. We understand that time and punctuality are of the essence, so our staff is on standby to promptly respond to your needs. Ensuring you have no lag time with your important meeting or celebration. Planned to Perfection Our Special Events Coordinator will handle logistics, aid you in making decisions, and prepare every precise detail for your event. From the moment you make the initial planning call until the instant your last guest leaves, Billy's Stone will ensure you can relax and enjoy your Private dining in Miami. The Miami Ft. Lauderdale Area's Best Seafood Restaurant Our private dining and event experience gives you access to: Outdoor Waterfront Dining Customers who enter the surreal dining area at Billy's Stone Crab Restaurant are in for a thrill. At sunset, the landscape is majestic, with scarlet, pink, orange, and purple hues blending into picturesque vistas that rival Key West. Waterfowl flutter towards mangrove islands as diners gaze at boats cruising around the waterway. The ambiance is upscale dining with a touch of old Florida and a memorable dining experience. Enjoy one of Broward County's most extraordinary beachfront restaurant views as you get ravenous over your favorite Fresh Stone Crabs and other Florida-native Seafood dishes that delight even the most fastidious gourmet palette. Rock your shorts and halter tops and take in the drifty noon breeze as you watch the tarpons swarm in for their lunch under the dock. Exclusive Florida Seafood While Fresh stone crabs are our signature dish, we offer several seafood options. We only serve domestic fish and shellfish harvested in local waters. The quality of our fish is unquestionably superior, as we believe our guests are entitled to only the finest and freshest seafood available. We've developed partnerships with local fishers over the years, ensuring that we acquire the finest of the catch. Billy's sells only wild shrimp caught in the Florida Keys. You'll never desire farmed shrimp again after tasting a wild Florida Keys shrimp with its distinct flavor and quality. There's nothing quite like the seafood we serve here in South Florida. We don't leave the kids out. Our menu includes a range of customized meals for children. Other dining options include: Grilled, blackened, and dried fish Fried oyster sandwiches Cracked conch Chicken breast USDA steaks A variety of pasta New-England Style Clam Chowder Private Dining & Events in Hollywood, FL The seaside is calling. So are the delicious stone crabs and the singing sea waves. Dine with us today and splurge in the excesses of seaside dining. Whether you are a corporation or have an upcoming social event on your calendar, Billy's Stone Crab is waiting for you to take a deep dive into South Florida's ultimate private dining experience. Book a reservation with us today. Image Source: comeirrez / Shutterstock Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://hollywoodgazette.com/in-memoriam-billy-hershey-the-man-behind-the-stone-crabs/",
      "text": "In Memoriam: Billy Hershey-- The Man Behind the Stone Crabs 2025 Skip to content Instagram TikTok Twitter Youtube Advertise Contact Instagram TikTok Twitter Youtube Advertise Contact Search Instagram TikTok Twitter Youtube Advertise Contact Instagram TikTok Twitter Youtube Advertise Contact Search Hollywood Beach , In Memoriam , Local Business , People In Memoriam: Billy Hershey– The Man Behind the Stone Crabs When you enter the beautiful restaurant on the intercoastal just north of the Hollywood Blvd bridge, it’s hard to believe he’s gone — Billy’s presence is still palpable, even beyond the photos of him posted around the space.  Because, they say, when Billy Hershey founded his business, Billy’s Stone Crab Restaurant, which opened in this location in 1995, and even before that, what Billy said, is what Billy got. So when Billy died in November of last year, he left a large space in his restaurant, his family, and in Hollywood, where Billy’s Stone Crab, and Billy, had been a kind of larger-than-life presence for several decades. Billy started with nothing and left a legacy in Hollywood and, indeed, after 45 years in business, Billy’s Stone Crab is known far and wide all across the globe. Elena Hershey upstairs at Billy’s Stone Crab “He preferred to let me be the ambassador for the restaurant,” noted his wife of 20 years, Elena, who has been running the business at his side for almost as long as she’s been married to him.  “Though he was always wholeheartedly supportive of everything I did, from supporting our community and the local organizations to the philanthropy.  But if I could say one thing about Billy, it’s that he was laser-focused, and when he had an idea, there was no stopping him. Billy was an idea man. He would say: ‘Honey, I got an idea!’  The he would always say ‘When you start something, you take it to the finish’.” According to those who knew him, this unique man was unflinching, direct, visionary, driven, loyal, generous, igniting, supportive, funny, courageous and passionate about everything he did. “I’m going to miss his friendship, his loyalty and his generosity.” “He was a very loyal friend,” said Don Scully, who has known Billy since they attended high school together in Miami.  “He didn’t like school, but he was always good with numbers, really driven, and determined to be successful. He used money wisely, and had done better than most of us, but was very down-to-earth.  And he was very generous. He liked to have fun and celebrate; he took us to San Salvador fishing on his boat several times. He was very outgoing and he talked to anybody. Billy Hershey Billy Hershey Billy Hershey Billy Hershey Billy Hershey The men of Billy’s Stone Crab: Billy, Brian, Bobby and Alex Hershey Bobby, Elena and Alex Hershey at a Taste of Hollywood, April 2018 L-R: Brian Hershey, Billy, Tommy Atonopoulos and Don Scully in the Bahamas Billly with his good friend Tommy Atonopoulos Billy and Elena Hershey Billy’s Stone Crab began in 1975 as a retail and wholesale seafood business, with a truck going back and forth between the Florida Keys and the West Coast of Florida, gathering fish, lobster, shrimp, crabs, and wholesaling to restaurants, retailers, and grocery stores throughout South Florida. Once the wholesale business was established, Billy’s Seafood Restaurant and Market opened in 1977 in Miami Springs, where it flourished successfully for seven years.  When the lease came due in Miami Springs, he moved it to North Bay Village and opened Billy’s On the Bay where he stayed for another seven years, until he purchased the current waterfront location at 400 North Ocean Drive ere in Hollywood. He sold the Billy’s On the Bay moved to the restaurant and market to this beautiful spot on the Intracoastal Waterway in the heart Of Hollywood Beach.  The business continued to grow, with the addition of the online shipping business ( www.crabs.com ) as well as  expansion of the wholesale business, Billy’s Fisheries (BSC Fisheries), in the Keys, which  consists of Billy’s own commercial boat and over 35 other commercial boats who fish for BSC. Billy and Elena Hershey Billy’s son Brian, the middle child of five from his previous marriage, currently runs the entire operation along with Elena, focusing on the successful growth of the Hollywood location and the Fishery.  Billy’s younger sons, Bobby, 17, and Alex, 14, are planning on joining the family business as soon as they complete their educations.   Billy’s two adult daughters Jessica and Lauren are both successful business owners in other fields. Many people say they have felt a special love and admiration for Billy. Michael Meadows, head waiter and manager at Billy’s Stone Crab, started at the restaurant as a junior server over 14 years ago. “He was an imposing presence, everything here was him, and you had to conform to his vision,” said Meadows. “Billy’s was his baby and his priority.  It was his name on the door, and his money and his integrity on the line, and he took that responsibility very seriously, for his business, his family and for all his employees.” Billy gave everyone a chance, explained Meadows, “but you had to earn his trust and respect.”  From dishwashers to top management, the restaurant has an unusual amount of long-time and loyal employees, particularly unique in a beach town like Hollywood. “He gave people opportunities, and that gave us the confidence to do it,” he continued.  “He taught me to strive, to always reach, reach further, and it boiled over into my personal life.  Procrastination is gone for me now. Because of Mr. Hershey, I am a more responsible person.” Billy had a lot of “Billy-isms”. “You’ve gotta fish or cut bait.” “I put this on the 99 yard line, you just have to push it through.” “We’re gonna hit it on all cylinders.” “You have to cover everything from A to Z.” And when he was ready to get serious, “Son, let me tell you something.” “He was strategic, passionate, courageous, never afraid to take risks,” said Elena. “He was my Honey. Our little boys Bobby and Alex, to the end, called him Honey.  He always had ideas, and if the idea was born, it had to be done yesterday, he would go at it full throttle.  He was very adventurous, always projected years down the line. His mother, Mama Ada, used to say he was ‘long-visioned’ and called him Billy Boy.” A passionate fisherman and golfer, he inspired the same love of sports and the sea in his children, Bobby and Alex, who he always hoped would follow him into his business along with his older son Brian. Daring and caring, open and sharing, Billy wanted to see people succeed, and loved the opportunity to help.  He knew when to be fun and when to be serious, was very intentional, very intense, and knew exactly how he wanted things done. When he left this realm on November 4, 2019  he left a legacy and a dream that the business he built would continue to grow into the future. Said his son Brian, “No one who ever met him once went away untouched.” “What can I say about someone that I’ve known for a long time?,”  asked his old friend Tommy Atonopoulos. “That he was loyal, trustworthy, ambitious, always growing?  A great father, a great husband, and a very good friend?  All I can say is God Bless You, Captain Billy.  You left us too soon.” “We all love you.” Billy’s Stone Crab is located at 400 N.Ocean Drive in Hollywood. For more information call 954-923-2300 or visit www.crabs.com Author: Amanda Jones Amanda Jones specializes in content marketing. She holds a Master's degree in Marketing Management from the University of Florida and a Content Manager Professional Certificate from the University of Miami. Stay Connected Like Us On Facebook Follow Us On Twitter Newsletter Join our mailing list to receive the latest news directly in your email inbox. Email Sign Up Hollywood Gazette is Hollywood, Florida’s best independent blog since 2001. Facebook – Twitter – Linkedin – Pinterest Contact info@hollywoodgazette.com 954-962-8180 3389 SHERIDAN STREET #623 HOLLYWOOD, FLORIDA 33021 Useful Links About Us Terms & Conditions Privacy Policy Advertise Contact NewsLetter Join our mailing list to receive the latest news directly in your email inbox. Email Sign Up Copyright © 2023. All Rights Reserved. Privacy & Policy Terms & Conditions Sitemap"
    },
    {
      "url": "https://crabs.com/pages/dinner-menu",
      "text": "Seafood Dinner Menu | Billy's Stone Crab Waterfront Restaurant Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Seafood Dinner Menu – Billy's Stone Crab Download Dinner Menu BILLY'S RAW BAR FLORIDA STONE CRAB CLAWS - MP JUMBO LUMP CRABMEAT COCKTAIL - MP SEAFOOD TOWER (FULL/HALF) FLORIDA STONE CRAB, KING CRAB, JUMBO SHRIMP, OYSTERS, FLORIDA LOBSTER TAILS, AND JUMBO LUMP CRABMEAT - MP OYSTER ON THE HALF SHELL - 22/40 JUMBO SHRIMP COCKTAIL - 22 COLD SEAFOOD COMBINATION FLORIDA STONE CRAB, JUMBO SHRIMP, OYSTERS AND 1/2 FLORIDA LOBSTER TAIL - 40 STARTERS SMOKED FISH DIP SMOKED WAHOO, CRUDIT É , CRISPY TORTILLA CHIPS 17 CONCH FRITTERS SERVED WITH ORANGE MARMALADE 18 CALAMARI HOUSEMADE MARINARA 18 CRAB STUFFED MUSHROOMS JUMBO LUMP CRABMEAT, WHITE MUSHROOMS 18 P.E.I. MUSSELS CHOICE OF HOUSEMADE BEURRE BLANC OR MARINARA 20 JUMBO LUMP CRAB CAKE SERVED WITH DIJON MUSTARD SAUCE 22/40 OYSTERS ROCKEFELLER CREAMED SPINACH, PARMESAN 24 NEW ENGLAND CLAM CHOWDER 10/13 KEY WEST CONCH CHOWDER 10/13 LOBSTER BISQUE 12/15 SALADS DINNER SALAD SPRING MIX, CHERRY TOMATO, ONION, CUCUMBER 10 CAESAR SALAD ROMAINE, PARMESAN, CROUTONS 12 WEDGE SALAD ROMAINE, CHERRY TOMATO, ONION, BLEU CHEESE CRUMBLES, BACON, BALSAMIC REDUCTION 14 GREEK SALAD TOMATO, CUCUMBER, KALAMATA OLIVES, ONION, FETA 17 FLORIDA STONE CRAB ENTREE / ALL YOU CAN EAT - MP KING CRAB ENTREE / ALL YOU CAN EAT - MP • Subject to availability • No sharing • No to-go bags • Sharing of 'All You Can Eat Crabs' will be equal to Market Price SPECIALTY ENTREES HONEY GINGER SALMON HONEY, GINGER, SAUTEÉD GARLIC KALE 36 ISLAMORADA* CHERRY TOMATO, KALE, CARROT GINGER PUREE 42 BOUILLABAISE SAFFRON, MAHI, JUMBO SHRIMP, LOBSTER, OYSTERS, SCALLOPS 45 BRETONE* MUSHROOM, SHALLOT, CAPERS, JUMBO LUMP CRABMEAT, JUMBO SHRIMP, BEURRE BLANC 47 KEYWEST* JUMBO SHRIMP, JUMBO LUMP CRABMEAT, AVOCADO, BEURRE BLANC 47 *PREPARED WITH MAHI-MAHI / GROUPER OR SNAPPER +3 PRIME SEAFOOD KEY WEST JUMBO SHRIMP FRIED, BROILED OR BLACKENED* 35 SEAFOOD COMBINATION FRIED JUMBO SHRIMP, SCALLOPS, MAHI AND OYSTERS 40 BROILED FLORIDA LOBSTER TAIL OSCAR STYLE+ 18 MP SEA SCALLOPS PAN SEARED, ROMESCO MP *BLACKENED +2 PASTA CHICKEN PICCATA SCALLOPINI, CAPERS, BEURRE BLANC, LINGUINE 32 CHICKEN ALFREDO MUSHROOMS, FETTUCCINE 32 SHRIMP SCAMPI JUMBO SHRIMP, CHERRY TOMATO, LINGUINE 40 SEAFOOD ALFREDO OR MARINARA LOBSTER, MAHI, SCALLOPS, JUMBO SHRIMP, FETTUCCINE 45 PREMIUM STEAKS & CHOPS NEW YORK STRIP CENTER - CUT 18 OZ 60 FILET MIGNON CENTER - CUT 12 OZ 65 RIBEYE BONE - IN 24 OZ 70 RACK OF LAMB 20 OZ 70 ROMESCO, CHIMMICHURI STEAK ACCOMPANIMENTS CRUSTED BLEU CHEESE +6 MAÎTRE D’ BUTTER +6 OSCAR STYLE  +18 SHAREABLE SIDES MUSHROOMS AND ONIONS 11 FRENCH FRIES 11 SWEET POTATO FRIES 11 COLE SLAW 11 HUNGARIAN SLAW 12 GARLIC CREAMED SPINACH 12 GRILLED TOMATOES 13 HASHBROWNS 13 LYONNAISE POTATOES 14 BRUSSEL SPROUTS 14 ASPARAGUS HOLLANDAISE 14 LOBSTER MAC 30 There's nothing more decadent than fresh Florida seafood, and when visitors and locals in Hollywood and Miami, Florida, want the best, they head to Billy's Stone Crab. As one of the top waterfront restaurants in Hollywood, FL , Billy's Stone Crab has been serving up the best stone crab, lobster, and other seafood items for years. From succulent stone crab to types of seafood pasta, we have something to suit every taste. Pull up a chair and dive into our dinner menu to discover a few of our fan-favorite entrees. Dinner Time Delights The first thing you'll notice when you step inside Billy's Stone Crab is the elegant decor in the spacious dining room. Our seafood restaurant features floor-to-ceiling windows and stunning views of the waterfront. While the decor and ambiance are of an upscale restaurant, our food is sourced locally from Florida fishermen who harvest their catch fresh every day. Our dinner menu features everything from specialty entrees like honey ginger salmon to fabulous steaks and pasta dishes. Our seafood is the star of the show, with crab harvested at the peak of stone crab season and wild shrimp caught in the Florida Keys. We have shareable sides such as grilled tomatoes, lobster mac, sweet potato fries, and garlic creamed spinach. Stone Crab: A Must-Try Delight Stone crab is the cream of the crop of Florida shellfish and one of the most in-demand types of seafood. What does stone crab taste like? Stone crab has a very mild flavor and a delicate texture that requires it to be eaten very quickly after it's harvested. It is slightly sweet and devoid of any strong \"fishy\" flavor. Stone crab is a must-try, especially if you're new to Florida or visiting the area for the first time. At Billy's Stone Crab, we sustainably harvest stone crab from trained fishermen and serve it to our guests with the utmost care and precision. Dip the meat into our accompanying mustard sauce and discover why this delicacy is one of our top picks. Pasta Perfection Nothing soothes the soul and nourishes your spirit after a long day on the water like pasta. We have specialties like chicken piccata and chicken alfredo and seafood pasta such as shrimp scampi. At Billy's Stone Crab restaurant, you can customize your perfect seafood pasta dish. Select either alfredo or marinara sauce on your fettuccini noodles and then tuck into a dish full of the finest seafood, including scallops, lobster, mahi, and jumbo shrimp. Steak Lovers We proudly feature premium steaks and chops at Billy's Stone Crab. Our NY strip steak is 18 ounces, while our filet mignon is 12 ounces of extra-tender, flavorful beef. For the heartiest appetites, we have a 24-ounce bone-in ribeye cooked to your exacting specifications. You can also opt for a rack of lamb, grilled to perfection and served with romesco and chimichurri to bring out the natural flavors of the meat. Sides and Add-Ons: Make it a Feast No dinner is complete without sides, and at Billy's Stone Crab, we have side options and add-ons to suit everyone's palate. Our sides are all big enough to share, with options such as brussels sprouts, hashbrowns, grilled tomatoes, sweet potato fries, cole slaw, asparagus hollandaise, and lobster mac and cheese. Order up three or four different sides and try a little bit of everything! We don't play favorites, but we do have a soft spot for our grilled tomatoes, the ideal accompaniment for meat, chicken, or seafood. Your Perfect Dinner Awaits Whether you're in Florida for a few days or a lifetime, Billy's Stone Crab is the perfect choice for a fantastic dining experience you won't soon forget. Discover our dinner menu today and contact us to learn more about our delicious meal options. Shipping Stone Crabs and Homemade Key Lime Pie for Next Day Delivery 954-923-2300 * 1-888-663-1259 * www.crabs.com Consumer Information: There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood or have immune disorders, you are at a greater risk of serious illness from raw oysters, and should eat oysters fully cooked. IF UNSURE OF YOUR RISK, CONSULT A PHYSICIAN. REV. 10/21 Looking for a Different Menu? Order Online! Wine List | Lunch Menu Ship Fresh Florida Stone Crab Find us In Hollywood, FL Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://humboldtcrabs.com/about-the-crabs/",
      "text": "About the Crabs | Humboldt Crabs Team 2025 Roster Coaching Staff Scores & Stats Prospective Players News Schedule Game Schedule Special Events Schedule Tickets Fan Info Crabs Camp Arcata Ball Park Picnic/BBQ Area Information Right Field Beer Garden Crab Grass Band First Pitch, Anthem, Bat Boy/Girl Crabs Videos Connect Watch on YouTube Radio Facebook Twitter Videos Code of Conduct About About the Crabs Employment Application Support the Humboldt Crabs Sponsors Hall of Fame & Alumni Sponsor/Support Shop Select Page About the Crabs Founded in 1945, the Humboldt Crabs are the oldest, continuously-operated, collegiate, independent, wood-bat, summer baseball team in the country. 2023 will mark the 79th consecutive year of operations for Crabs baseball. The team is currently based out of Arcata, California. Mailing address: PO Box 4422, Arcata, CA 95518 The Crabs’ roster is made up of NCAA eligible collegiate players mostly from the West Coast. • To go to the 2023 schedule page, CLICK HERE . To SPONSOR the Crabs, CLICK HERE . For a printable schedule, CLICK HERE. (Note: The Crabs are NOT a semi-pro team or affiliated with any farm, minor league or major league teams at this time. Nor are the Crabs affiliated with any baseball leagues. The Crabs are currently an independent team.) The Crabs mission is four-fold: To promote family entertainment by providing high-quality summer collegiate baseball games to the public at a reasonable price; To provide talented collegiate-level baseball players with a positive summer baseball experience; To support youth sports programs (with an emphasis on baseball or softball) in the Humboldt County area with contributions of funding and/or equipment as funds permit in addition to annual baseball skills camps and clinics operated by Humboldt Crabs players and coaches; To preserve and build the tradition of Humboldt Crabs Baseball. SPONSORSHIPS & SUPPORT: Humboldt Crabs Baseball, Inc is a 501(c)(4) community-owned organization . A volunteer board of directors rely on the support of community partners & sponsors to keep the Humboldt Crabs Baseball operation functioning. The Crabs can customize any sponsorship to a company’s needs. CLICK HERE to learn more about partnering and sponsoring . If you just wish to donate, click on DONATE to the Crabs. No donation is too small. A box of baseballs is around $130.00. Board of Directors As a non-profit organization, the Crabs rely on a dedicated group of non-paid volunteers for the day-to-day operations. The volunteer Board of Directors range in size from 12 to 15 individuals. Each board member is responsible for handling many behind-the-scenes tasks that allow the Humboldt Crabs Baseball team to continue operating. If you’d like to volunteer or work for the Crabs, please contact our Board of Directors President to inquire (see email address below). The Humboldt Crabs Board of Directors was first established in 1995 when the team was on the verge of collapse. A group of community members who loved Crabs baseball rallied to save the team and created a non-profit organization to handle the daily operations. In the past 20+ years, the Board of Directors, with the help of many loyal and dedicated community sponsors have grown the fan base to the point where the Crabs have set attendance records, pulling in more than 34,000 fans in the months of June-Aug. The team gives back to local businesses in the summer months when the bulk of the students from CalPoly Humboldt have left town, infusing millions of dollars into the local economy from the visiting teams, visitors, fans, players and their families who spend time in Humboldt County just to come and watch the Crabs play. The current Crabs Board President is David Sharp. Sharp is a former Crabs player and baseball coach. He can be reached at president@humboldtcrabs.com Crabs Gear or Shop page If you have questions regarding Crabs gear or the online SHOP page, call our voice mail at (707) 840-5665 and leave a detailed message or email: accounting@humboldtcrabs.com Group Outings / Picnics Click Here to learn more or email CrabsSpecialEvents@gmail.com or call our voice mail at (707) 840-5665 and leave a detailed message. Ballpark Vendors Send us an email to request a current Ballpark Vendor Application form. Employment with the Crabs The Crabs will look to hire a ballpark staff of 20-30 individuals sometime in April. Click here to apply online. The Arcata Ball Park The Crabs rent the ballpark on F and 9th streets from the City of Arcata from the start of June until the first weekend of August every summer. Please email Arcata Recreational Division for questions regarding the facility or contact the staff at (707) 825-2202 or Rec@CityofArcata.org for more information. Donations & Fundraisers Please submit a written letter about your fundraiser and/or your non-profit organization with a return address and contact information to the Humboldt Crabs, P.O. Box 4422, Arcata, CA 95518, Attn: Donations. Submit donation request letter 3 to 4 weeks in advance of your event or fundraiser. The Crabs primary focus is to support youth sports programs with an emphasis on baseball or softball . * All Humboldt Crabs Baseball clothing is ©copyrighted and trademarked™. Humboldt Crabs Services and all other products offered via Humboldt Crabs Baseball Inc., are the sole the property of Humboldt Crabs Baseball, a non-profit and community organization. Humboldt Crabs Services and all other products offered are for non-commercial use, and you may not distribute, modify, translate, rebroadcast, transmit, perform or create derivative works from them. Anyone found distributing and selling Humboldt Crabs products without prior consent will be subject to legal action. Good Friends. Good Times. Great Baseball. Since 1945. Team Team Stats Alumni Recruiting Schedule Games Special Events Buy Tickets Fans Ballpark Picnics & Groups Code of Conduct Connect YouTube Facebook Twitter Instagram Humboldt Crabs Baseball, Inc. | P.O. Box 4422 | Arcata, CA 95518 | (707) 840-5665 | Contact Us Facebook Twitter Instagram Youtube ©2023 Humboldt Crabs"
    },
    {
      "url": "https://www.allworld.com/billys-stone-crabs-hollywood-florida/",
      "text": "Billy's Stone Crabs Review Skip to content Menu Home About Us About Us Work With Us Join Our Travel Forum Getting Around Air Travel Rental Cars Travel Tips Hostel Reviews Hotel Reviews Moving Abroad Places to Avoid Restaurant Reviews Solo Travel Trip Reports Best of All World Random World Facts Excursions Adventure Travel Bar Reviews Beaches Costa Rica Travel Guides Cruise Travel Dive Bars Events Grand Cayman Travel Travel Gear Reviews Home » Billys Stone Crabs in Hollywood, Florida Billys Stone Crabs in Hollywood, Florida July 24, 2025 July 18, 2025 by Tim Schmidt When most people think of stone crabs in South Florida, the immediate location that comes to mind is Joe’s Stone Crab in South Beach.  Nobody mentioned Billy’s Stone Crab in Hollywood to me back in 2001, when I was a transplant from Minnesota finding his bearings in South Florida. Years later, I started a family and moved north to Broward County, I started exploring Hollywood’s murderer’s row of dining, as I call it, and made my way into Billy’s Stone Crabs.  If you haven’t visited this strip of restaurants on the intracoastal, head on over there, it’s worthy of it’s own post, which I’ll be writing soon. While Miami folks swear by Joe’s Stone Crabs, they can have it. Been there, done that. Us Fort Lauderdale area folks are totally cool avoiding the horrendous drive to South Beach and dealing with all that comes with it, and enjoying our stone crabs in Hollywood. You can find the sweet-meat claws that are fresh from mid-October to Mid-May at Billy’s in Hollywood both at the restaurant, and even fresh to take home if that’s what you desire.  These are among the best crabs in the world , so don’t sleep on this incredible restaurant as it will give you a great perspective on some popular Florida cuisine . All you can eat stone crabs (end of season only.) Opened in 1995, Billy’s offers many options when it comes to dining. I prefer the upstairs area in the air conditioning, normally arrive early to enjoy their luxurious bar prior to being seated in the floor to ceiling glass room that has gorgeous views of the intracoastal. Billy’s has their own fishery, called BSC Fisheries, thats located in the Lower Keys.  Their fleet brings in stone crabs daily as well as Florida Lobster and other fresh fish.  All of this goes directly to Billy’s Stone Crabs and their restaurant and seafood market, where you can order in the USA for overnight delivery. Naturally, like many South Floridians, we like to compare Billy’s to Joe’s Stone Crab, and for those wondering, here’s my takeaway after over 20 years of dining at both establishments. Both restaurants offer white glove service from their staff, who are decked out in tuxedos and armed with not only a meat cart but also a seafood cart.  After seeing the offerings, you’ll want your food to show up ASAP – they are that appealing.  They also overlap on many dishes, from starters, to entrees, to the fresh key lime pies Florida is known for. To be clear, this isn’t a comparison article, because as a no frills, “let me sit when my reservation time arrives” type of guy, Billy’s is the hands down winner, and I’ll elaborate on that in a Joe’s Stone Crab review. While Billy’s Stone Crabs can and will get crowded, it’s never a horror scene like it an be at Joe’s, even during peak hours.   They are very punctual with reservations and there are plenty of dining options at Billy’s, including the upstairs lounge with a view, the upstairs cocktail bar, or the downstairs venue, which features both indoor and dockside dining on over 200 feet of dockage.  The dockside is nice if it isn’t too hot, and they even have covered tables for some shade when it does get unbearable. As mentioned, there is a small market downstairs when you enter the venue where you can purchase stone crabs to take home, or even get them cracked to eat at a high top table or directly at the small bar which is more casual and usually plays sports. Again, I recommend the second floor for formal dining. It’s quaint when you look at it, but it seats 150 people for both lunch and dinner.  During Summer months you can enjoy stone crabs that have been flash frozen, and of course, during season they are freshly caught and served same day. Dining room at 5:30. When we left at 7 there wasn’t an empty seat. Here are a few pictures of the upstairs bar area: A view from a barstool upstairs. Looking out at the intercoastal from the bar area. Side angle of the bar. Table of Contents Toggle Who Owns Billy’s Stone Crabs? Billy’s Stone Crab Dress Code Parking at Billy’s Stone Crabs Billy’s Stone Crab Reservations Frequently Asked Questions: Who Owns Billy’s Stone Crabs? There’s been an urban legend that Billy’s is connected to Joe’s Stone Crab, and thanks to an excellent piece by the Sun-Sentinel , they’ve laid out the facts. William “Billy” Hershey is the founder of Billy’s Stone Crabs, and not ironically, he was once employed by Joe’s and married a member of the family who owned the venue, the Weiss family.  Billy’s son, Brian, is the general manager of Billy’s Stone Crab and he shared that after the marriage ended, Billy founded his own seafood market in Miami Springs way back in the 1970’s.  Later, he started Billy’s on the Bay in North Bay Village. Eventually, that restaurant was sold and Billy was mentally retired.  However, a bank reached out to him one day about a restaurant that went under on the Intracoastal waterway that is now Billy’s.  He purchased the land and building in 1994, and after a year of building it out, Billy’s was born. Billy’s Stone Crab Dress Code According o Elena, Billy’s wife, the dress code is to feel comfortable. While the venue is upscale, shorts and flip flops are totally acceptable. One thing I appreciate more than anything is seeing the gigantic display of steak and seafood, which every server will bring by and share with you the daily prices for each.  If you are lucky enough to be in South Florida in the final weeks of Stone Crab Season , (late April – early May) you can take advantage of all you can eat stone crab.  Prices vary by season, but in May of 2023 I paid $80 for all you can eat medium stone crabs and killed four trays of about a dozen each.  That’s a bucket list meal if I’ve ever had one. While the steaks look incredible, make no mistake, seafood is what you should order here.  You’ll find yellowtail, grouper, snapper, salmon, mahi mahi and much more on the menu.  You can have it prepared a variety of ways, including grilled, blackened, or key west style. I’ve never seen a meat and seafood cart that didn’t impress me. You’ll find typical shareable sides including brussel sprouts, french fries, potatoes lyonaise, and more.  Salads are abundant, and even burgers for the kids or burger person in your group. Parking at Billy’s Stone Crabs Billy’s offers value parking for just $5.  You will have to make a sharp right if you are coming from the north, or wait for the light and take a left if you arrive from the south.  The lot does fill up during prime hours so there are metered spots in parking lots across the street to the east. This is in my list of the best seafood restaurants in Fort Lauderdale and it’s something you have to experience to truly appreciate.  The iconic setting is good for any setting, whether it be a casual meal, a date, or a celebration. Feel free to check out our recommendations on the best Fort Lauderdale area seafood establishments .  Our top 8 picks includes Billy’s. Billy’s Stone Crab Reservations Billy’s Stone Crab 400 N. Ocean Drive, Hollywood 954-923-2300 , or Crabs.com Cuisine: Seafood, steak, and shellfish. Cost: $$$$ Hours: Noon-10 p.m. daily (closed Thanksgiving Day) Reservations: Varies.  We always call ahead and get on the list. Credit cards: All major Bar: Full liquor bar, beer, extensive wine and craft cocktail list. Noise level: Conversational Wheelchair access: Elevator to second floor Parking: Valet ($5 or $10 for closer lot), or metered street nearby Frequently Asked Questions: What is the Billy’s Stone Crab all You Can Eat Price? Prices do vary by season, but last time the prices were $79 for medium, $90 for select, $109 for large, and $129 for jumbo. 4.8/5 - (14 votes) View Our Global Travel Guides of First Hand Experiences About Tim Schmidt Tim Schmidt is a 20+ year Entrepreneur and Digital Marketer.  A Fort Lauderdale-based \"Digital Nomad,\" he enjoys traveling as much as possible with family and friends.  AllWorld is his escape to document all of his adventures, including being a hardcore \"foodie.\"  He has property in Costa Rica and visits several times each year and is happy to offer his expert advice for planning your trip. Make sure to download the AllWorld Travel Hacks FREE ebook . Related Content Make sure to check out our related content! Rocco’s Tacos & Tequila Bar (Las Olas Location) Bodega Fort Lauderdale: Tacos and Tequila Rise Bagels – Best Bagel in Minneapolis? Coconuts Fort Lauderdale: A Diner’s Guide – AllWorld.com Categories Restaurant Reviews El Camino Less Traveled: Discovering Spain’s Medieval Heart What are the Best Beach Bars in Grand Cayman? Leave a Comment Cancel reply Comment Name Email Website Save my name, email, and website in this browser for the next time I comment. We’re Tim & Michelle, a couple based in Fort Lauderdale, FL. To describe us in one sentence “we are foodies who love to travel!” All World documents our travels while offering reviews of establishments, tours, and venues we’ve encountered in our journeys. Please enjoy our information and reach out if you ever want some additional color on any of our content! Make sure to download the AllWorld Travel Hacks FREE ebook . ABOUT About All World Directory Disclaimer Privacy Policy About Us All World Travel Blog educates fellow travelers based on first hand knowledge and trip reports. “An informed traveler is an expert traveler.” Join Our Newsletter All World Travel 135 Weston Road Weston, FL 33326 954-271-2540 Partnerships: Tim@AllWorld.com Media: Media@AllWorld.com General Inquiries: Info@AllWorld.com About Us Work With Us FAQ Contact Us Search for: Follow us instagram youtube tiktok facebook pinterest Make sure to download the AllWorld Travel Hacks FREE ebook . Shop Our Travel Store! Submit Your Business to Our Directory All World Travel Forum – Ask Questions, Get Advice, Share Tips © 2025 AllWorld.com - All rights reserved. Search for: Get Our Monthly Travel Recaps Sign up to get our monthly recap of travel hacks, trip reports, and ways to make the most out of your next vacation. Invalid email address We promise not to spam you. You can unsubscribe at any time. Thanks for subscribing!"
    },
    {
      "url": "https://crabs.com/pages/lunch-menu",
      "text": "Lunch Menu & Specials – Billy's Stone Crab Restaurant in Hollywood FL Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Seafood Lunch Specials Menu Download Lunch Menu BILLY'S RAW BAR FLORIDA STONE CRAB CLAWS - MP JUMBO LUMP CRABMEAT COCKTAIL - MP SEAFOOD TOWER (FULL/HALF) FLORIDA STONE CRAB, KING CRAB, JUMBO SHRIMP, OYSTERS, FLORIDA LOBSTER TAILS, AND JUMBO LUMP CRABMEAT - MP OYSTER ON THE HALF SHELL - 22/40 JUMBO SHRIMP COCKTAIL - 22 COLD SEAFOOD COMBINATION FLORIDA STONE CRAB, JUMBO SHRIMP, OYSTERS AND 1/2 FLORIDA LOBSTER TAIL - 40 STARTERS SMOKED FISH DIP SMOKED WAHOO, CRUDITÉ, CRISPY TORTILLA CHIPS 17 CONCH FRITTERS SERVED WITH ORANGE MARMALADE 18 CALAMARI HOUSEMADE MARINARA 18 CRAB STUFFED MUSHROOMS JUMBO LUMP CRABMEAT, WHITE MUSHROOMS 18 P.E.I. MUSSELS CHOICE OF HOUSEMADE BEURRE BLANC OR MARINARA 20 JUMBO LUMP CRAB CAKE SERVED WITH DIJON MUSTARD SAUCE 22/40 OYSTERS ROCKEFELLER CREAMED SPINACH, PARMESAN 24 NEW ENGLAND CLAM CHOWDER 10/13 KEY WEST CONCH CHOWDER 10/13 LOBSTER BISQUE 12/15 SALADS DINNER SALAD SPRING MIX, CHERRY TOMATO, ONION, CUCUMBER 10 CAESAR SALAD ROMAINE, PARMESAN, CROUTONS 12 WEDGE SALAD ROMAINE, CHERRY TOMATO, ONION, BLEU CHEESE CRUMBLES, BACON, BALSAMIC REDUCTION 14 GREEK SALAD TOMATO, CUCUMBER, KALAMATA OLIVES, ONION, FETA 17 SANDWICHES GRILLED, BLACKENED + 2, OR FRIED CHICKEN BREAST 16 SHORTRIB BLEND CHEESEBURGER 18 BILLY’S FISH OF THE DAY 21 SNAPPER OR GROUPER 24 ALL SERVED WITH FRIES AND SLAW TACOS SERVED WITH MANGO SALSA, AND CILANTRO LIME CREMA CHICKEN 16 MAHI 18 GROUPER 22 SNAPPER 22 ALL SERVED WITH FRIES AND SLAW FLORIDA STONE CRAB ENTREE / ALL YOU CAN EAT - MP KING CRAB ENTREE / ALL YOU CAN EAT - MP • Subject to availability • No sharing • No to-go bags • Sharing of 'All You Can Eat Crabs' will be equal to Market Price SPECIALTY ENTREES HONEY GINGER SALMON HONEY, GINGER, SAUTEÉD GARLIC KALE 36 ISLAMORADA* CHERRY TOMATO, KALE, CARROT GINGER PUREE 42 BOUILLABAISE SAFFRON, MAHI, JUMBO SHRIMP, LOBSTER, OYSTERS, SCALLOPS 45 BRETONE* MUSHROOM, SHALLOT, CAPERS, JUMBO LUMP CRABMEAT, JUMBO SHRIMP, BEURRE BLANC 47 KEYWEST* JUMBO SHRIMP, JUMBO LUMP CRABMEAT, AVOCADO, BEURRE BLANC 47 *PREPARED WITH MAHI-MAHI / GROUPER OR SNAPPER +3 PRIME SEAFOOD KEY WEST JUMBO SHRIMP FRIED, BROILED OR BLACKENED* 35 SEAFOOD COMBINATION FRIED JUMBO SHRIMP, SCALLOPS, MAHI AND OYSTERS 40 BROILED FLORIDA LOBSTER TAIL OSCAR STYLE+ 18 MP SEA SCALLOPS PAN SEARED, ROMESCO MP * BLACKENED +2 PASTA CHICKEN PICCATA SCALLOPINI, CAPERS, BEURRE BLANC, LINGUINE 32 CHICKEN ALFREDO MUSHROOMS, FETTUCCINE 32 SHRIMP SCAMPI JUMBO SHRIMP, CHERRY TOMATO, LINGUINE 40 SEAFOOD ALFREDO OR MARINARA LOBSTER, MAHI, SCALLOPS, JUMBO SHRIMP, FETTUCCINE 45 PREMIUM STEAKS & CHOPS NEW YORK STRIP CENTER-CUT 18 OZ 60 FILET MIGNON CENTER-CUT 12 OZ 65 RIBEYE BONE-IN 24 OZ 70 RACK OF LAMB 20 OZ 70 ROMESCO, CHIMMICHURI STEAK ACCOMPANIMENTS CRUSTED BLEU CHEESE +6 MAÎTRE D’ BUTTER +6 OSCAR STYLE +18 SHAREABLE SIDES MUSHROOMS AND ONIONS 11 FRENCH FRIES 11 SWEET POTATO FRIES 11 COLE SLAW 11 HUNGARIAN SLAW 12 GARLIC CREAMED SPINACH 12 GRILLED TOMATOES 13 HASHBROWNS 13 LYONNAISE POTATOES 14 BRUSSEL SPROUTS 14 ASPARAGUS HOLLANDAISE 14 LOBSTER MAC 30 After a busy morning of exploring, there's nothing better than sitting down to a delicious, filling lunch. When you want only the best, head to Billy's Stone Crab, an upscale lunch restaurant in Hollywood, Florida . We have something for every taste, from handcrafted salads to sandwiches that are sure to satisfy. Lunch Menu Highlights: What to Try Seafood lovers will find plenty to love at Billy's Stone Crab. We specialize in fresh seafood and use only the best, with domestic fish and shellfish caught in local waters. We've developed relationships with local fishermen so we can confidently serve you the best. You'll taste the difference in lunchtime dishes like our savory smoked fish dip starter. Of course, there's plenty for those who prefer chicken or meat. We're known for our chicken alfredo pasta, made with mushrooms and fettuccine noodles, and our rack of lamb, which is ideal for heartier appetites. Order up some fresh clam chowder or indulge in some conch fritters to share with the table. You can't go wrong with whatever you select. Fresh and Flavorful Salads If you're looking for what salad goes with fish, order our dinner salad, which is a perfect pick for any time of the day. Made with spring mix, cherry tomato, onion, and cucumber, this light and refreshing salad is excellent when paired with any of our fish lunch entrees. A wedge salad is also a delightful option. This classic salad has bacon and balsamic reduction, as well as onion, cherry tomatoes, and bleu cheese crumbles. Sandwiches What goes with seafood salad? Sandwiches, of course! Sandwiches are perfect for refueling after a morning of fun in the sun. Handheld and hearty, our sandwiches are sure to satisfy even the heartiest appetites. Tuck into our chicken breast sandwich, which can be prepared grilled, blackened, or fried, depending on your preferences, and topped with lettuce and tomato. Our short rib blend cheeseburger is made with premium quality beef and enhanced with melty cheddar cheese. We grill the burger to perfection before serving it to you, hot and ready, accompanied with fries and slaw. Of course, Billy's Stone Crab is probably best known for our fish sandwiches. You can choose from snapper, grouper, or Billy's fish of the day served with fries and slaw on the side. No matter what you choose, you'll come away with a deep appreciation of our authentic Floridian cuisine and top-of-the-line service. Lunch at Billy's Stone Crab Whether you opt for a salad or sandwich entree or another one of our lunch specialties, you'll discover a premium restaurant experience in Hollywood, Florida, at Billy's Stone Crab. There's nothing quite so delicious as fresh Florida seafood. Discover the best at Billy's Stone Crab, a top seafood restaurant in Hollywood that features all your lunchtime favorites. Contact us to learn more about our menu or to ask questions about our seasonal offerings. Shipping Stone Crabs and Homemade Key Lime Pie for Next Day Delivery 954-923-2300 * 1-888-663-1259 * www.crabs.com Consumer Information: There is a risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood or have immune disorders, you are at a greater risk of serious illness from raw oysters, and should eat oysters fully cooked. IF UNSURE OF YOUR RISK, CONSULT A PHYSICIAN. REV. 9/21 Looking for a Different Menu? Shop Online! Wine List | Dinner Menu Ship Fresh Florida Stone Crab Do you have any more questions? If you need to learn more about Billy's Stone Crab , please Contact Us . Come Visit us in Hollywood, FL! Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/",
      "text": "Billy's Stone Crab | Waterfront Seafood Restaurant & Market in Florida Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Nationwide Shipping Delivered overnight and ready to eat via FedEx Free Pickup Available From our fresh market located in our restaurant in Hollywood, FL. Restaurant Now Open We are open for dine-in and takeout. Call us at 954.923.2300 for large parties. Nationwide Shipping Delivered overnight and ready to eat via FedEx Free Pickup Available From our fresh market located in our restaurant in Hollywood, FL. Restaurant Now Open We are open for dine-in and takeout. Call us at 954.923.2300 for large parties. Billy’s Stone Crab Waterfront Seafood Restaurant & Market in Hollywood Beach, FL Billy’s Stone Crab Restaurant is known far and wide nationally and internationally as one of THE best seafood restaurant & market in the Ft. Lauderdale area. And for a good reason. Billy’s two story fine dining seafood restaurant, is accessible both by elevator and stairs and has floor to ceiling captivating views of the Intracoastal Water Way in the main elegant dining room. off the boat delivered to your door Florida Stone Crab (1.5 lb Per Person) *Mustard Sauce & Bibs Included from $35.00 Wild Caught Jumbo Shrimp - Order By the Pound from $21.99 Florida Lobster Tails – Overnight Delivery from $20.00 King Crab Legs - Overnight Delivery from $75.00 Premium Canned Jumbo Lump Crab Meat -  1 lb $45.00 Fresh U10 Scallops - Order By the Pound $40.00 View all As seen in The Best Seafood Restaurant Billy’s Stone Crab Restaurant is known far and wide nationally and internationally as one of THE best seafood restaurant & market in the Ft. Lauderdale and Hollywood area. And for a good reason. Billy’s two story fine dining seafood restaurant, is accessible both by elevator and stairs and has floor to ceiling captivating views of the Intracoastal Water Way in the main elegant dining room. The sunset is magnificent. And at night, when the draw bridge of Hollywood Boulevard is illuminated and the lights change colors, the view is quite spectacular, making the restaurant a preferred city spot. If you come sit on the dock or dine upstairs, you can watch this beautiful panoramic nature over the Hollywood Beach Marina. According to owner Billy Hershey, “It’s very romantic. Our Story Waterfront Seafood Restaurant & Market Billy’s Stone Crab 954.923.2300 400 North Ocean Drive Hollywood, FL 33019 Get Directions Billy’s Stone Crab Waterfront Seafood Restaurant & Market 954.923.2300 400 North Ocean Drive Hollywood, FL 33019 Get Directions People Love Us! Pureza Serrano The atmosphere is unbelieveable, our server Richard was awesome and made wonderful dining choices for first timers!!. The general manager Franco also very polite ans sociable. Definitely a unoque dining experience!! Highly recommend.. so the seafood lookes amazing , however if your a land loveŕ the ribeye did not disappoint.... if you try it you will never forget any of it. Such a memorable time. THANKS EVERYONE!!! Karen Martin This was our first time there on 5/30/24 for my husband's birthday dinner. Mike, the manager, was awesome! Our server, Cruz, was phenomenal!! We both had Filet Mignon and Lobster Tail!! So delicious! The service was top notch!! And the Key Lime Pie they gave my husband and singing Happy Birthday was amazing!! We will definitely go back next time we are in Hollywood! We were both so impressed with the view and the overall dining experience!! Thank you 😊 Nicole Meyer-Johnson Billy's Stone Crab exceeded all expectations! The food was absolutely amazing, bursting with flavor and freshness. The staff were attentive, informative, and incredibly personable, making the dining experience even more enjoyable. And let's not forget the breathtaking views of the water, adding a touch of serenity to the whole meal. Highly recommend for anyone looking for a memorable dining experience! Proud Members Of Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/pages/seafood-market-miami-fl",
      "text": "Fresh Seafood Market in Hollywood FL | Billy's Stone Crab Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Seafood Market in Hollywood, FL – Fresh Stone Crab Stone crabs are a delicacy that are famously harvested here in South Florida. Billy’s Stone Crab’s exclusive fishery catches an assortment of seafood right here in the Florida Keys, and it's served the same day it's harvested. At Billy’s Stone Crab, you can order high-quality, fresh stone crab and Florida-harvested seafood from our stone crab market, or have it delivered fresh, right to your doorstep. Just choose your delivery date and you’ll be able to cook the freshest seafood whenever you’d like. We operate two fish houses in Marathon and Summerland Key, within the Florida Keys. with Over 40 boats supply our local fish houses with stone crab, lobster, and fish daily. so every item has been out of the sea for less than 24 hours. This allows us to be the producer and end user, so meaning we handle the products from catch to packaging before our customers receive them Seafood dinners such as crab cakes, lobster tails, and crabmeat salad may bring to mind watching the slow roll of the ocean waves as you dine on the Florida coast at sunset. You may have tried to find similar seafood in your home area or state, but you've yet to find it. Wouldn't you like to bring that taste — and those memories — home with you? Now you can. Our Seafood Market in Hollywood, FL Whether you're in the mood for lobster tail, king crab, or scallops, we've got you covered! Below are several of our popular crab products and other offerings from our seafood and fish market: Stone crabs by the pound :  We offer stone crab by the pound. You can choose your claw size, quantity, as well as your delivery date from our dropdown menus. King crabs : You can find them here if you're in the mood for giant crab legs! Specify whether you want them delivered in a half cluster or full cluster, and choose your delivery date. Wild jumbo shrimp :  Purchase raw or cocktail shrimp through our online market Florida lobster tails :  If you're having a dinner party, choose a 10-pound box of lobster tails for yourself and your guests. You can also order a single lobster tail to complete your order as well. Jumbo lump crab meat by the one pound can : Crab salad, crab cakes, and other seafood dishes would only be complete with this hearty staple. Order as much as you wish by the one-pound can Raw scallops by the pound :  Choose raw scallop portions to bring the taste of Florida gourmet seafood into your home. Order by the pound, and remember to choose your delivery date at least one day in advance. We also carry other seafood and meats in the market that we only generally sell online if requested: grouper filet, snapper filet, mahi filet, oysters, clams, and steaks. A Preferred Seafood Supplier for Fine Dining Restaurants. We understand the importance of providing your customers with the freshest and highest quality seafood. Choosing Billy's Stone Crab Market as your source for premium, locally caught seafood will not only elevate your fine dining restaurant's menu but will also allow you to offer dishes made from sustainably caught and environmentally responsible seafood. Our commitment to quality and extensive knowledge and experience in the seafood industry ensure you'll receive the finest products available. Our Hollywood, FL, seafood market provides the ultimate in convenience and quality, so you can focus on your business while relying on us to supply premium seafood. Let us be your trusted partner in delivering exceptional dining experiences to your guests Our Seafood Market: FAQs What are stone crabs? If you're new to being a seafood connoisseur, you may wonder what stone crabs are and what sets them apart from the other edible crustaceans of the sea. Stone crabs are smaller than their “king” counterparts, contain a good amount of protein per serving, and feature a higher level of minerals like protein and selenium. They're harvested sustainably in a way that doesn't harm the environment or the species. Unlike other types of crab meat, stone crabs contain a lower level of fat and are higher in iodine. They are best-served cold (especially with our signature mustard sauce!). Check out our products below, and let us know if you have any more questions about stone crabs or the other seafood that we offer. How do stone crabs get to the market? BSC Fisheries, our exclusive fishery, harvests the finest stone crabs by placing traps in the local waters of the Florida Keys. BSC Fisheries carefully removes one or both claws from each harvested stone crab and then returns the animal to its habitat. Stone crabs are uniquely able to regrow their limbs, so once returned to the ocean, new claws will regenerate fully within a year. These large, strong claws are tender and delicious when served cold, with a side of Billy's Signature Mustard Sauce. They're harvested when a stone crab's claw reaches 2 7/8\" from the tip of its immovable finger to its first joint. The crab is gently returned home to continue to thrive, making it a renewable way to enjoy seafood without harming the species. What is the shelf life of your seafood items? The shelf life of our seafood items varies depending on the product. When properly stored in the refrigerator, stone crab claws, king crab, and lobster tails can last up to 3 days, while wild jumbo shrimp, lump crab meat, and scallops can last up to 2 days. However, we recommend serving these items as soon as possible to savor their optimal freshness and flavor. Do you provide special pricing for restaurants? We offer competitive pricing for our restaurant clients and are happy to collaborate with you to determine how we can best meet your needs. Please contact us directly to discuss your requirements and receive a customized quote. Can I place a standing order for my restaurant? Absolutely! Whenever possible, we are happy to accommodate standing orders to ensure a consistent supply of fresh, premium seafood for your restaurant. Please contact our team to discuss the details and set up your standing order. How can I place an order for my restaurant? You can place an order by calling us at 954-923-2300 or by using our website's online contact form. Our team will be happy to assist you with any questions or special requests you may have. Try our Revered Seafood Restaurant in Hollywood, FL Located less than 25 miles from Miami, Billy's Stone Crab is one of the premier waterfront restaurants in Hollywood, FL, offering guests the region's freshest seafood dishes in a welcoming, casual-chic atmosphere. Our doors open at noon for lunch and 5 p.m. for dinner, and we serve a delicious variety of dishes highlighting local flavors and regional seafood. In addition to our food menus, we also operate a full bar - so you can enjoy a craft-made cocktail or cold beverage with your meal. Visit our Market Are you craving your favorite seafood yet? Let us know if you have any questions about our featured seafood, shipping, or delivery times. If you can't visit the market, we also ship nationwide! Give us a call at 954-923-2300 to place an order, or use our website online contact form to get in touch. Remember, if you need your order by the next day, make sure that you place it by 4 pm EST. We know you'll come back time and time again to Billy's Stone Crab to enjoy our high-quality seafood and fast delivery. We look forward to serving you! \" Absolutely amazing every time. Classy atmosphere and the best seafood you can get.\" - Robert L. Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/collections/fresh-seafood",
      "text": "Fresh Seafood and Crab Delivery – Billy's Stone Crab Online Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Order Seafood & Crab Online – Billy’s Stone Crab Filter All products alaskan alaskan king crab crab clusters crab meat crabs crustacea fresh crab fresh crabs fresh lobster fresh seafood jumbo lump jumbo shrimp king crab lobster lobster tails lump crab meat maine lobster mustard sauce scallops shrimp stone crab stone crabs tails tag \" Sort Featured Price, low to high Price, high to low Alphabetically, A-Z Alphabetically, Z-A Date, old to new Date, new to old Best Selling Important Cut-off time for all orders is 4 PM EST, Monday thru Friday. If you would like to receive your order next day, please make sure to place your order by 4 PM EST. Florida Stone Crab (1.5 lb Per Person) *Mustard Sauce & Bibs Included from $35.00 Wild Caught Jumbo Shrimp - Order By the Pound from $21.99 Florida Lobster Tails – Overnight Delivery from $20.00 King Crab Legs - Overnight Delivery from $75.00 Premium Canned Jumbo Lump Crab Meat -  1 lb $45.00 Fresh U10 Scallops - Order By the Pound $40.00 If you have a craving for seafood, but you live far away from a quality seafood restaurant, you will be thrilled to know that Billy’s Stone Crab can come to you! Buy fresh seafood when you place an order of our high-quality stone crab, shrimp, or lump crab meat for delivery. THE BEST FRESH SEAFOOD ONLINE IS AT BILLY'S STONE CRAB If you’ve visited us in Hollywood Beach, FL, you know that our stone crabs, wild-caught shrimp, and numerous other seafood delicacies are truly special. Stone crabs , for example, may not be a widely known species outside of our Florida area, but they are a unique treat for those who have never tried them. These crustaceans have a lower fat content than other species of crab you may have sampled before, and we prefer to serve them cold with Billy’s Signature Mustard Sauce (which is included as a complimentary gift when you place an order for stone crabs!). The following types of seafood are available for delivery: Stone crabs by the pound King Crab Wild jumbo shrimp Florida lobster tails Jumbo lump crab meat by the one pound can Raw scallops by the pound When you’re thinking about how you want to replicate your Billy’s restaurant experience at home — or if you’re considering trying our seafood for the first time — you may need to consider what type of seafood your family enjoys, how many people will be dining with you , whether you have enough storage space for a large order. Because of our quick shipping times and the ability to deliver your seafood order the day after you place the order, you can order as frequently as you desire without worrying that we will run out of your favorites. GET IN TOUCH OR PLACE YOUR ORDER TODAY Though you may not be able to visit Billy’s in person, our high-quality seafood will help you create the grandeur of our elegant dining experience in your own home. Remember to order in advance and give yourself enough time to receive and prepare your seafood if you are planning for an event. If you have any questions, give us a call at 954-923-2300 or get in touch with us through our convenient contact form . If you already know what type of seafood you’d like to order, simply click on the picture of the seafood you’d like to order and fill out the form to select your claw size, your quantity, and enter your shipping details today. We look forward to receiving your first order and welcoming you to the Billy’s Stone Crab family! Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/pages/about-us",
      "text": "About Billy's Stone Crab | Waterfront Seafood Restaurant in Hollywood, FL Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale About Billy's Stone Crab Market & Waterfront Seafood Restaurant Known internationally and locally as one of the best seafood restaurants in South Florida, Billy's Stone Crab has the freshest, top-quality stone crab and seafood in the business. Our Story Started in 1975 as a retail and wholesale seafood company by Billy Hershey , the highly popular Billy's Seafood Restaurant and Market opened in Miami Springs in 1977. After seven years, we moved our eatery to North Bay Village and renamed it Billy's On the Bay. We opened our current waterfront location at 400 North Ocean Drive in the heart of Hollywood Beach in 1995. In addition to our fresh seafood market and restaurant in Hollywood, FL, our business has grown over the years to incorporate a fishery, an extensive selection of wines, a casual dining area, outdoor cabanas, an online shipping company, and an expansion of our wholesale business. Our Seafood Our fishery (BSC Fisheries) catches stone crabs, Florida lobster, yellowtail snapper, and other seafood daily, then delivers it fresh to our restaurant. You will enjoy delicious specialty dishes that come straight from the Florida Keys to your plate in 24 hours. We fish in local waters because we believe our customers deserve the most superior seafood possible.We operate two fish houses in Marathon and Summerland Key, both located in the Florida Keys. Over 40 boats supply our fish houses with delicious stone crab, lobster and fresh fish daily. We ensure this by catching it ourselves, then hand-picking the best for you. Dine in our restaurant, eat inside our market, or purchase fresh products to take with you. Our Values Family-owned and operated, Billy's Stone Crab is an iconic business in the Fort Lauderdale area. We are a part of the community and pride ourselves on providing the best experience for our guests. Our team is attentive to every detail, so you enjoy the freshest selections in our elegant dining location, excellent service, breathtaking views, killer martinis, and much more. You are family here, and we strive to give you only the best. Our Services Our multi-level fine dining establishment features stunning views of the Intracoastal Waterway from the seating areas. We offer indoor and outdoor dining options with full bar service. Catch a majestic Florida sunset during your lunch or dinner of fresh seafood, King crab legs , and fresh-baked key lime pie for dessert. Or grab something to take home or enjoy right away in our market. We can also ship stone crabs , shrimp, and seafood overnight so that you can savor our fresh catches anywhere in the world. If you are out on the water, dock your boat at Billy's and enjoy a fantastic meal. Our staff can also pack meals for your fishing trips and other boating adventures. We offer valet service for those coming by car, so you won't have to worry about finding a parking spot. Our Testimonials The Miami and Hollywood community love Billy's for good reason! Read these real customer testimonials and check out our feature on South Florida PBS . \"Hands down this is the best restaurant in all of Hollywood Walk South Florida...\" -Philise Anderson \"I don't even want to review it because I don't want anyone to come and take my seats.\" -Dennis Lopez \"The stone crabs are out of this world!\" -Martha Keneth Come Visit Us in Hollywood, FL Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/collections",
      "text": "Buy Fresh Seafood Online Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Buy Fresh Seafood Online Desserts 1 item 9\" Key Lime Pie Delivery $25.00 Merchandise and Seafood Gift Cards 1 item Wooden Mallet $5.00 Order Seafood & Crab Online – Billy’s Stone Crab 6 items Florida Stone Crab (1.5 lb Per Person) *Mustard Sauce & Bibs Included from $35.00 Wild Caught Jumbo Shrimp - Order By the Pound from $21.99 Florida Lobster Tails – Overnight Delivery from $20.00 King Crab Legs - Overnight Delivery from $75.00 Premium Canned Jumbo Lump Crab Meat -  1 lb $45.00 Fresh U10 Scallops - Order By the Pound $40.00 If you’ve never tasted fresh seafood that has been handled correctly and hand-picked to provide only the highest quality, you are missing out. The seafood at Billy’s Stone Crab is available to ship nationwide so you can experience what the residents and visitors of the South Florida area have been able to enjoy in person. When you decide to buy fresh seafood online, you can enjoy the best that Billy’s Stone Crab has to offer without having to leave your home. \n  Test Fresh Seafood Billy’s Stone Crab fresh seafood is available for pick-up at the restaurant in Hollywood Beach, FL, or to ship nationwide through overnight delivery. We also have two fish houses: Marathon, FL, and another in Summerland Key, FL. Both are conveniently located in the Florida Keys. Over 40 boats supply our fish houses with stone crab, lobster and fish daily. How we operate is unique as we handle the product from start to finish before our customers receive it. From the boat directly to your door, your choice of seafood arrives ready for you to enjoy immediately. The unique process for selecting and shipping means you receive only the freshest and most high-quality seafood with a difference you can taste. Desserts What better way to top off a delicious seafood meal than with a decadent dessert? Billy’s Stone Crab’s signature key lime pie tart but sweet flavor pairs perfectly with the seafood to provide a crowd-pleasing end to a meal. The unique recipe uses key limes sourced from Florida trees for the freshest and most flavorful experience. Your key lime pie arrives frozen to enjoy now or later and is a treat that the entire family will enjoy. Merchandise and Gift Cards Fans of Billy’s Stone Crab Restaurant can enjoy a reminder of the experience through the merchandise collection . Even if you have never been to the physical location and just enjoy the fresh seafood, you can buy from Billy’s Stone Crab online, and you can purchase a keepsake to show your love for the brand. If you know someone who wants to buy fresh seafood online or loves to visit the in-person establishment, gift cards in various denominations are available. Ordering Seafood for Sale Online: FAQs When I order seafood online from Billy's Stone Crab, how is my order packed? Your seafood order is packed with utmost care and attention to ensure that the quality and freshness of the products are preserved during transit. Our primary goal is to deliver the finest seafood directly to your doorstep, maintaining the highest standards in packaging and shipping. Here's a breakdown of the steps we take to ensure your seafood order arrives in perfect condition: Preparation: Before packing, each seafood item is thoroughly cleaned, trimmed, and inspected for quality. Our experienced team takes great care in handling the seafood to ensure that it remains in optimal condition. Temperature Control: To maintain freshness, we use temperature-controlled packaging materials. We pack your seafood order with frozen gel packs or dry ice, depending on the specific products and shipping destination. This helps maintain the appropriate temperature throughout the shipping process, preserving the quality and taste of your seafood. Protective Packaging: We use high-quality, insulated containers to pack your seafood order. These containers are designed to keep the seafood chilled and protected from any external factors that could compromise its quality. Each item is carefully placed inside the container, minimizing any potential damage during transportation. Sealing: Once packed, the insulated container is securely sealed to prevent any leakage or contamination. We take extra precautions to ensure that the container remains airtight and that the cold temperature is maintained throughout the journey. Fast Shipping: We understand the importance of delivering your seafood order as quickly as possible to maintain its freshness. That's why we use reliable and efficient shipping carriers to expedite the delivery process. We strive to get your seafood order to your doorstep as soon as possible, ensuring that it arrives fresh and ready to enjoy. Where do you deliver to? Our fresh seafood is available for delivery nationwide. Why should I buy seafood online from Billy's Stone Crab? Buying seafood online from Billy's Stone Crab offers a multitude of benefits that make it an excellent choice for seafood lovers: Exceptional Quality: At Billy's Stone Crab, we pride ourselves on offering the highest quality seafood available. We source our products from the best fishermen and suppliers, ensuring that our seafood meets the most stringent quality and sustainability standards. Freshness Guaranteed: We understand that freshness is paramount when it comes to seafood. That's why we take extra care in handling, processing, and shipping our products to ensure that they arrive at your doorstep in optimal condition. Our state-of-the-art packing and temperature-controlled shipping methods guarantee that your seafood order will arrive fresh and ready to enjoy. Convenience: Buying seafood online from Billy's Stone Crab allows you to shop from the comfort of your own home, without the need to visit a local fish market or supermarket. Browse our extensive selection of premium seafood products at your leisure, and place your order with just a few clicks. We'll handle the rest, delivering your fresh seafood order right to your doorstep. >Wide Selection: Our online store offers an impressive variety of seafood options, from succulent stone crab claws to tender fish fillets and beyond. By shopping with Billy's Stone Crab, you'll gain access to a diverse range of seafood products that may not be readily available at your local grocery store, allowing you to create unique and delicious meals at home. Supporting Local Businesses: By choosing to buy your seafood online from Billy's Stone Crab, you are supporting a local, family-owned business. We are passionate about providing our customers with exceptional seafood and personalized service, and your patronage helps us continue to thrive and share our love for seafood with the community. Ordering from Billy's Stone Crab online seafood marketplace is a convenient and reliable way to enjoy fresh, high-quality seafood in the comfort of your own home. With our commitment to quality, freshness, and customer satisfaction, we are confident that you'll be delighted with your order. Buy Fresh Seafood from Billy’s Stone Crab There’s nothing like the taste of fresh seafood that has been carefully selected for maximum flavor and quality. That’s why buying seafood from Billy’s Stone Crab market is so popular with Miami,Hollywood, and Ft. Lauderdale locals and guests and throughout the Florida Keys. You can enjoy the same experience no matter where you are located in the nation by ordering seafood directly from the online store and having it delivered overnight to your doorstep. To learn more about the process or ask any questions about the available options, browse the online selection or contact Billy’s Stone Crab today. Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/pages/reviews",
      "text": "Reviews | Waterfront Seafood Restaurant | Billy's Stone Crab Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Billy's Stone Crab Reviews & Testimonials At Billy's Stone Crab , we are passionate about satisfying our customers' need for seafood and exceeding their expectations. Every day, our expert team selects only the freshest and highest quality seafood for our two fish houses in Marathon and Summerland Key, which keeps our customers coming back for more. Don't take our word for it; learn more about the positive reviews and testimonials we receive every day. Billy's Stone Crab: Seafood Market Our seafood market serves Hollywood, Florida, and Southern Miami residents with a wide variety of their favorite crab products and other seafood. We also do nationwide delivery, making it easy to enjoy our seafood even if you don't live in a seaside town. You only have to place an online order, and our team will deliver it right to your door. Below are some types of seafood you will find in our seafood market. Stone crabs Wild jumbo shrimp King crab Scallops Jumbo lump crab meat Florida lobster tail and many more! Billy's Stone Crab: Restaurant Billy's Stone Crab Restaurant offers customers a dining experience like no other. Our setting and impeccable service will have you coming back for more. Our floor-to-ceiling windows allow you to watch the beautiful sunsets while enjoying a delicious meal. What's more, we sell fish and shellfish caught in our local waters, which guarantees fresh, seasonal seafood that will excite your taste buds. Some selections in our menu at the restaurant include: Wild shrimps Fried, grilled, or blackened sea fish Free-range chicken Fried oyster sandwiches Chicken breasts & fried clam sandwich New England-style clam chowder Burgers We also offer a variety of appetizers and salads to enhance your meal. Moreover, our wine list features many selections worldwide, perfect for pairing with your Stone Crab. Whether you are looking for a restaurant to hang out with friends or enjoy a romantic night out with your significant other, at Billy's Stone Crab Restaurant, we have the best reviews for that. Why Choose Billy's Stone Crab At Billy's Stone Crab, we take pride in our products and customer service. We have received the best stone crab delivery reviews in the recent past for the following reasons: Convenience You can browse some of the best seafood varieties at our seafood market in the comfort of your house and receive them at your door in less than 24 hours. Wide Selection We have a wide selection of seafood to choose from, making it easier for you to find the right sea fish or shellfish without searching through multiple stores. Moreover, with our online shopping platform, we help you enjoy other varieties of seafood that may not be available at your local store. Expert Service Our team of sellers has over forty years of experience handling seafood, so they know how to deliver high-quality and fresh seafood. Additionally, you get to cut out the middleman with the online purchase, ensuring that what you receive has been appropriately handled and has no contaminants. Billy's Stone Crab for the Freshest Seafood in Southern Florida! While there are many seafood markets and restaurants in Southern Florida , most of them may not have the ability to provide the freshest seafood. At Billy's Stone Crab, we understand that freshness is the primary criterion most customers use when buying seafood, which is why we strive to deliver the best. We are your source for all wild-caught seafood: from stone crab to grouper filet. To be part of this experience, check out our first-class selection of seafood or visit Billy's Stone Crab Seafood Restaurant in Miami, Florida, at noon for lunch or at 5 P.M. for dinner. You can also contact us for more details. Image Source: symbiot / Shutterstock Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    },
    {
      "url": "https://crabs.com/pages/restaurant",
      "text": "Billy's Stone Crab Waterfront Restaurant | Best Seafood in Hollywood, FL Please ensure Javascript is enabled for purposes of website accessibility Your Cart Your basket is empty Add a note for the seller… Please check this box to agree to our terms and conditions $0.00 Subtotal $0.00 Continue Checkout Continue Shopping For restaurant reservations please call (954) 923-2300 Online Only: Save 20% on Stone Crabs Order Now Order Online About Us Menu Buy Stone Crabs Restaurant Reservations Events Wholesale Log in Create Account Currency Currency USD $ Order Online Seafood Stone Crabs by the Pound Jumbo Shrimp - By the Pound Alaskan King Crab Florida Lobster Tails Raw Scallops Jumbo Lump Crab Meat Desserts Digital Gift Card About Us Market Florida Stone Crabs Blog FAQ's Virtual Tour Menu Lunch Dinner Wine List Buy Stone Crabs Restaurant Reservations Events Wholesale Restaurant Miami & Hollywood's Best Waterfront Seafood Restaurant Customers who enter Billy’s Stone Crab Waterfront Restaurant’s nice and elegant dining room, are in for a special treat when near Hollywood, FL. During sunset the view is breathtaking with crimson, orange, pink, and purple colors blending into picturesque views that rival Key West. Diners can watch boats cruise along the waterway or waterfowl flying towards mangrove islands. The atmosphere is upscale dining that blends old Florida together with a memorable dining experience. Enjoy the best waterfront restaurant view in all of Broward County. Enjoy your favorite Stone Crabs and other Florida Seafood dishes. The fine dining restaurant’s ambiance is that of Hollywood glamour with an authentic Floridian cuisine to satisfy the most discriminating culinary palate. Shorts and halter-tops are fashionable for the lunch crowd. If perusing the boats passing by isn’t enough entertainment, customers can watch tarpon that swarm under the dock when the staff feeds them at noon.  Fish feeding has become a fun tourist attraction at Miami & Ft. Lauderdale’s Best Seafood Restaurant. Enjoy Your Favorite Stone Crabs and Other Florida Seafood Dishes Stone Crabs are just one of the seafood treats available at Billy’s. “We sell only domestic fish and shellfish, caught in local waters, “said owner Billy Hershey. “It costs more to buy domestically, but the seafood quality is definitely superior, and we believe our customers deserve only the best seafood possible. Over the years, we’ve built relationships with local fishermen so we’re assured of getting the best of the catch.” Only wild shrimp caught in the Florida Keys are sold at Billy’s. “We don’t handle any of the farm-raised shrimp from other countries,” Billy said “Once you taste a wild Florida Keys shrimp you’ll never want the farmed variety again.” There’s a definite difference in flavor and quality. The fresh oysters at Billy’s have come from Apalachicola, and the clams from the Indian River. “There’s nothing quite as delicious as the seafood we have right here in Florida” Billy said. The Best Waterfront Seafood Restaurant Near Miami Ft. Lauderdale Areas Other selections from the menu include fish that is grilled, blackened or fried; fried oyster poor-boy sandwiches; or cracked conch, chicken breast and fried clam sandwiches, USDA steaks, free range chicken and an assortment of pastas. There’s also New England-style clam chowder, conch chowder, burgers, fries, onion rings and Cole Slaw. Billy’s offers full bar service, so customers can order a cocktail or glass of wine to accompany their lunches . We offer a variety of desserts such as Key lime pie, ice cream and more. Billy’s Stone Crab Waterfront Seafood Restaurant with its floor-to-ceiling windows, opens at noon for lunch and 5 p.m. for dinner . It has received excellent reviews from the international magazine Travel Host, as well as the Miami Herald. Call 954-923-2300 for more information. 9\" Key Lime Pie Delivery $25.00 Add to Cart Extra Mustard Sauce $7.00 Add to Cart Florida Lobster Tails – Overnight Delivery $385.00 Add to Cart Florida Stone Crab (1.5 lb Per Person) *Mustard Sauce & Bibs Included $35.00 Add to Cart Indoor Fine Dining The crabs are the crown-jewel here at Billy’s Stone Crab Restaurant, in Hollywood FL! With almost 40 years experience in the South Florida crab market, Mr. Hershey delivers a FANTASTIC crab-dining experience. Medium, Select, Large, or, JUMBO claw sizes begin their preparation on the boat than upon arrival at the fish house, and by the time they get to the table-the meticulous attention to detail comes on a plate in beautifully colored claws filled with firm, richly-flavored crabmeat that can be described as “delectable” and is well complimented with Billy’s signature mustard sauce. Most diners while impressed with the extensive menu do stick with the world famous Billy’s Stone Crab, Hollywood’s stone crabs, rated best in Florida by the New York Times, and choose from the variety of sides, large enough to be shared by two. Landlubbers’ tastes are well accommodated as well and the little ones have a carefully considered children’s menu to choose from. Business guests are welcomed to enjoy a healthy seafood lunch in an elegant air conditioned dining room with a great view of the Intracoastal Water Way while at lunch or visiting with and entertaining business associates.  Billy says : “We know time is of the essence and make sure all our guests get their orders fast, so they can get back to work and attend the next business meetings”. Outdoor Waterfront Dining Billy’s Stone Crab Restaurant & Market in Hollywood, Florida, is nestled between A1A and the Intracoastal Waterway. Glider-rocker-tables gently sway with the warm, balmy breezes where patrons sit a few feet from the water and watch boats of all sizes drift by and huge tarpon feed as the sun sets into the palm trees across the way. “We know not everyone is on vacation,” said owner Billy Hershey. “We often have business people stop in for lunch, and they have a limited amount of time. We make sure all our guests get their orders fast, so they can get back to work or play, as the case may be.” And play they do…Billy’s is one of the few fine dining restaurants with dockage on the Hollywood’s Intracoastal Waterway and is considered one of the best South Florida Waterfront Dining spots, attracting boaters from Hollywood, Ft. Lauderdale, Miami, Miami Beach and all over Broward and Dade County. Customers can get to Billy’s Stone Crab Waterfront Restaurant by car or by boat. Billy’s fabulous restaurant with dockage is considered one of the best Miami Waterfront Dining Spots. Billy says his dock can handle a 100-foot yacht, and his professional staff will happily pack lunches for fishing trips or arrange stone crabs, king crab legs and seafood platters to dazzle your exquisite guests while enjoying the ride on your favorite vessel! Billy’s Stone Crab Waterfront Seafood Restaurant & Market 400 North Ocean Drive Hollywood, FL 33019 954 923 2300 billyscrabs@gmail.com Everyday 12:00 noon to 10:00pm Quick Links Buy Online Menu About Us Accessibility Policies Privacy Policies Contact Take Away Join our Mailing List Thanks for Joining! American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025 Billy's Stone Crab | Powered by Shopify"
    }
  ]
}