{
  "fuentes": [
    {
      "url": "https://visitoceanside.org/contact/",
      "email": "groups@visitoceanside.org"
    },
    {
      "url": "https://visitoceanside.org/contact/",
      "email": "visitorinfo@visitoceanside.org"
    },
    {
      "url": "https://thecrabbyquilter.com/pages/about-us",
      "email": "info@thecrabbyquilter.com"
    },
    {
      "url": "https://stpetecatalyst.com/st-pete-restaurant-company-raises-4-2-million-for-crabbys-expansion/",
      "email": "margie@stpetecatalyst.com"
    },
    {
      "url": "https://stpetecatalyst.com/st-pete-restaurant-company-raises-4-2-million-for-crabbys-expansion/",
      "email": "park@stpetecatalyst.com"
    },
    {
      "url": "https://allmusicmagazine.com/venues/crabbys-oceanside/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://allmusicmagazine.com/venues/crabbys-oceanside/",
      "email": "oceanside@bshgrp.com"
    }
  ],
  "mails": [
    "all-music-logo-white@2x.png",
    "groups@visitoceanside.org",
    "info@thecrabbyquilter.com",
    "margie@stpetecatalyst.com",
    "oceanside@bshgrp.com",
    "park@stpetecatalyst.com",
    "visitorinfo@visitoceanside.org"
  ],
  "nombre_sitio": "crabbysoceanside.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://visitoceanside.org/contact/",
      "text": "Contact Us - Get in Touch | Visit Oceanside Skip to content Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Submit RFP Planning Guide Media Resources Blog Contact Store Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Submit RFP Planning Guide Media Resources Blog Contact Store Things to Do Outdoor Food & Drink Arts & Culture Nearby Attractions Retail Places to Stay Hotels Vacation Rentals Camping & RVs Events Plan Your Trip Welcome Center Transportation Itineraries Maps and Guides Neighborhoods Deals Visitor Guide O’side Sips Activity Marketplace Love O’side 67° Search Search Search Search CONTACT US We live to share the O’side love. Get in touch with questions about your upcoming trip to O’side. Fill out the form below and someone from the expert teams of the Visit Oceanside Conference and Visitors Bureau or the California Welcome Center in Oceanside will happily get right back to you. Or just drop by and say, “Yo!” What’s on your mind? First Name (Required) Last Name (Required) Email (Required) Phone (Required) Message (Required) CAPTCHA California Welcome Center – Oceanside : Toll Free: 800-350-7873 Phone: 760-721-1101 Fax: 760-421-0106 Email: visitorinfo@visitoceanside.org Hours of Operation: Mon-Sat, 9am – 5pm Address: 928 N. Coast Highway Oceanside, CA 92054 Business Development: Phone: 858-201-6186 groups@visitoceanside.org Let's Connect What's New in O'side? Check out Our 2025 Visitor Guide To find out. Send Me a Free Guide Sharing some O'side love with our Visitor guide. Get Your Free Guide Follow us on Social Media Use the hashtag #VisitOceanside Follow Us [adrotate banner=\"4\"] [adrotate banner=\"7\"] [adrotate banner=\"10\"] [adrotate banner=\"11\"] Subscribe to our newsletter! Email (Required) About Us Contact Us Travel Trade About Us Contact Us Travel Trade Contact Us Blog Sitemap Privacy Policy Contact Us Blog Sitemap Privacy Policy Blog Media Visitor Guide Blog Media Visitor Guide About Us Travel Trade Media Industry Resources Visitor Guide About Us Travel Trade Media Industry Resources Visitor Guide Industry Resources Privacy Policy Sitemap Accessibility Statement Industry Resources Privacy Policy Sitemap Accessibility Statement © Visit Oceanside 2023. All rights reserved. 928 North Coast Hwy, Oceanside, CA 92054 800-350-7873 Get Inside O'side Email (Required) scattered clouds 67°F Current Weather Wed 67°F 19°C Thu 67°F 19°C Fri 66°F 19°C Sat 67°F 19°C Sun 67°F 19°C source: openweathermap.org Facebook LinkedIn Twitter Pinterest Email Search Things to Do Outdoor Food & Drink Arts & Culture Nearby Attractions Retail Places to Stay Hotels Vacation Rentals Camping & RVs Events Plan Your Trip Welcome Center Transportation Itineraries Maps and Guides Neighborhoods Deals Visitor Guide O’side Sips Activity Marketplace Love O’side Meetings & Groups Weddings Meetings & Retreats Reunions Sports Commission Incentives & Promos Planner Resources Resources Blog Media Store 67° 67° 67°"
    },
    {
      "url": "https://thecrabbyquilter.com/pages/about-us",
      "text": "About Us\n– The Crabby Quilter Skip to content Submit Close search Just added to your cart Qty: View cart ( ) Continue shopping The Crabby Quilter Submit Search Log in Cart 0 items Home About Us Classes Handi-Quilter BERNINA Shop Repairs Contact Us Home About Us Classes Handi-Quilter BERNINA Shop Repairs Contact Us About Us Our story continues… Wow!  It's hard to believe we are getting ready to celebrate our 8th year here at The Crabby Quilter. Cathy continues to commute from Virginia and can be seen Tuesday through Friday and an occasional Saturday.  Her quilting expertise can be seen throughout the shop with its dynamic looks, new longarm classes and unmatched services.  If you haven't heard, Cathy is certified Laura Heine Collage instructor. Cathy has taught several collage workshops and presented trunk shows at local guilds. If your group or guild is interested, give her a call for more details. We are super excited; Marti has returned to Annapolis! Her soft spot for all things Navy and nautical continues as noted by the aquatic themes in and around the shop. As for me, \"The Crabby Quilter”, I have taken a position at The Naval Academy. I continue to help with the business of the shop and provide technical support on Bernina and HandiQuilter machines. When you drop by, you may notice some new faces on our staff as we continue to meet and assist local and visiting guests. The Crabby Quilter’s story will continue so please come in and share with us your stories and projects! Quick links Search A Small Business We are a small family owned quilt shop specializing in quality fabrics, notions, kits, patterns and machines to create your unique textile art work. We are experienced quilters offering exceptional customer service. Newsletter Subscribe Contact us: 4 Annapolis Street Annapolis, MD 24402 Phone: 410-263-3897 Email: info@thecrabbyquilter.com Website: The Crabby Quilter Facebook © 2025, The Crabby Quilter Powered by Shopify Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://stpetecatalyst.com/st-pete-restaurant-company-raises-4-2-million-for-crabbys-expansion/",
      "text": "St. Pete restaurant company raises $4.2 million for Crabby’s expansion • St Pete Catalyst ST Pete's Business Daily (and a whole lot more) sign up for a free lifetime subscription And take your seat at the table Name Email Subscribe News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Connect with us Type a text St Pete Catalyst News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Know St. Pete restaurant company raises $4.2 million for Crabby’s expansion Published 6 years ago on August 8, 2019 By Margie Manning Crabby's Dockside in Clearwater Beach Beachside Hospitality Group is in expansion mode. The St. Petersburg-based restaurant company has five properties under construction or in the planning phases, including its first restaurants on the east coast of Florida, said Julia Cassino, Beachside’s director of marketing. Two projects will bring The Salty Crab Bar & Grill and Sweet Willy’s Ice Cream Shoppe to Clearwater Beach. A Crabby’s Oceanside is planned for Daytona Beach, and investors recently provided $4.2 million in funding for a Crabby’s Dockside restaurant and a Sweet Willy’s Ice Cream Shoppe in Fort Pierce. The planned projects will nearly double the size of Beachside Hospitality, which currently has a half-dozen restaurant properties in Clearwater Beach, St. Cloud in central Florida, Fort Myers Beach in southwest Florida, and at Tropicana Field in St. Petersburg. Beachside was formed in 2014 with the consolidation of two management companies. The management team is made up of Greg Powers, who is CEO; Lisa Smithson, chief financial officer; Eddie Wright, chief operating officer; and Gary Hardie, vice president. While many of Beachside’s properties have “Crabby’s” in their name, the company is separate from Crabby Bill’s Family Brands, with eight restaurants in the Tampa-St. Pete area. Winking Starfish LLC, a limited liability company managed by Beachside Hospitality, raised $2.3 million in equity from 13 investors, according to an Aug. 1 filing with the U.S. Securities and Exchange Commission. The full $4.2 million sought in the equity offering has subsequently been raised from business associates, friends and family, Cassino said. The money will finance the demolition and construction of the new building that will become Crabby’s Dockside in Fort Pierce. It will be located at the site of the former Original Tiki Bar, a fixture on the Fort Pierce waterfront. The City Commission last year awarded Crabby’s Dockside a 20-year lease with two five-year renewals to operate the restaurant at the Fort Pierce Marina, TCPalm reported . The 7,000-square-foot restaurant will have 280 seats, including some seating outdoors, and is expected to open next spring. It will be similar to the flagship Crabby’s Dockside in Clearwater Beach and other Beachside Hospitality properties, but with an atmosphere unique to the geographic area, Cassino said. “While Crabby’s Dockside Clearwater Beach and Crabby’s Dockside Fort Pierce will have very close similarities when it comes to the menu, we will also be adding in local fresh catch fish to the menu for Crabby’s Dockside Fort Pierce, as the fishing on the west coast is vastly different than on the east coast of Florida, and we want to be sure to showcase this,” Cassino said. Crabby’s Oceanside also has taken over what once was Cocina 214 along South Atlantic Avenue in Daytona Beach, and is looking to open there by Sept. 1, Cassino said. The company typically funds its projects with financial backing from family, friends and business associates, but the Fort Pierce project was slightly different. “Because this location’s cost was much larger than what we normally see, it was decided to seek out other investors, aside from the norm,” Cassino said. Beachside had a similar filing for Salty’s Island Bar & Grille in Clearwater Beach a few years ago, she  said. Share Tweet Share Related Topics: Beachside Hospitality Group capital raise Featured investors restaurant Click to comment Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Please fill out all the form entries below. We do not publish anonymous comments. Comments are held for moderation per our posting guidelines - please read them.  We appreciate your taking the time to share your perspective on how to improve our community. First Name * Last Name * Email * Your email will not be published Subscribe to the Catalyst daily edition, the Daily Spark By posting a comment, I have read, understand and agree to the Posting Guidelines . Subscribe to the Daily Spark Get the latest right to your phone Subscription Form Name Email Subscribe Subscribe to the Daily Spark Get the latest right to your phone Subscription Form Name Email Subscribe You may like New coffee shop/restaurant coming to Central Avenue Will St. Pete pull the plug on Duke? Naked Farmer moves to Tampa, upgrades St. Pete flagship The St. Pete Catalyst The Catalyst honors its name by aggregating & curating the sparks that propel the St Pete engine.  It is a modern news platform, powered by community sourced content and augmented with directed coverage.  Bring your news, your perspective and your spark to the St Pete Catalyst and take your seat at the table. Email us: s park@stpetecatalyst.com Quick Links Contribute Content Events Sparkive The Wire St Pete X Promote Your Business Connect With Us Subscribe for Free Subscription Form Name Email Subscribe Privacy Policy | Copyright © 2020 St Pete Catalyst Share with friend Enter the details of the person you want to share this article with. Your Name * Your Email * Friend Email * Share"
    },
    {
      "url": "https://allmusicmagazine.com/venues/crabbys-oceanside/",
      "text": "Crabby's Oceanside - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Crabby’s Oceanside Daytona Beach Acoustic , Classic Rock (386) 400-5560 oceanside@bshgrp.com View Website 451 S. Atlantic Ave Daytona Beach Florida 32118 Smoking About The Venue The newest restaurant on World Famous Daytona Beach. Bringing fresh local seafood to the east coast. Learn about all our Florida Family of Restaurants at www.bshgrp.com Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    }
  ]
}