{
  "fuentes": [
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "entertainment@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "entertainment@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "gm@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "mikepav@rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "music@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "news@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "pd@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "pd@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "production@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "production@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "promotions@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "promotions@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "sports@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "training@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "training@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "video@radio.rutgers.edu"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "video@wrsu.org"
    },
    {
      "url": "https://wrsu.org/contact-us/",
      "email": "wrsu-rutgers-radio-logo@2x.webp"
    },
    {
      "url": "https://crazyunclemikes.com/events/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/venue/crazy-uncle-mikes/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/beats/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/private-events/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/private-events/",
      "email": "mike@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/events/today/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://crazyunclemikes.com/about/",
      "email": "info@crazyunclemikes.com"
    },
    {
      "url": "https://trustunclemike.com/contact-us/",
      "email": "info@trustunclemike.com"
    },
    {
      "url": "https://unclemikesnatural.com/pages/contact",
      "email": "mike@unclemikesnatural.com"
    },
    {
      "url": "https://www.theswordandboardtoronto.com/products/kill-team-blood-and-zeal",
      "email": "https___trade.games-workshop.com_assets_2025_03_60010199073_ktbloodzealcoreset12_800x800_crop_center@2x.jpg"
    }
  ],
  "mails": [
    "entertainment@radio.rutgers.edu",
    "entertainment@wrsu.org",
    "gm@wrsu.org",
    "https___trade.games-workshop.com_assets_2025_03_60010199073_ktbloodzealcoreset12_800x800_crop_center@2x.jpg",
    "info@crazyunclemikes.com",
    "info@trustunclemike.com",
    "mike@crazyunclemikes.com",
    "mike@unclemikesnatural.com",
    "mikepav@rutgers.edu",
    "music@wrsu.org",
    "news@wrsu.org",
    "pd@radio.rutgers.edu",
    "pd@wrsu.org",
    "production@radio.rutgers.edu",
    "production@wrsu.org",
    "promotions@radio.rutgers.edu",
    "promotions@wrsu.org",
    "sports@wrsu.org",
    "training@radio.rutgers.edu",
    "training@wrsu.org",
    "video@radio.rutgers.edu",
    "video@wrsu.org",
    "wrsu-rutgers-radio-logo@2x.webp"
  ],
  "nombre_sitio": "crazyunclemikes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://wrsu.org/contact-us/",
      "text": "Contact Us - Rutgers Radio Skip to content Facebook Instagram X YouTube TikTok Listen Live: Title: Title | Artist: Artist Music Music #5927 (no title) Sports Sports News Broadcast Schedule Meet Our Team News Schedule About Donate Contact Us Join WRSU Toggle Menu Music Music #5927 (no title) Sports Sports News Broadcast Schedule Meet Our Team News Schedule About Donate Contact Us Join WRSU Facebook Instagram X YouTube TikTok Listen Live Title: Title Artist: Artist Contact Us Here’s how to reach us at WRSU … To reach the WRSU offices, phone 732-932-7800 . To reach the DJ in the studio , call 732-932-8800. To send us snail mail, our address is 126 College Avenue, New Brunswick, NJ 08901 Broadcast Administrator Please do not send music to the Broadcast Administrator.  All submissions from artists, labels and promoters should be sent exclusively to the Music Director. Mike Pavlichko Email: mikepav@rutgers.edu Phone: 732-932-7800 Office Hours: Monday-Friday, 9-5pm 2025-2026 WRSU Management General Manager Johannes Stoeber gm@wrsu.org Program Director Will Carmenaty pd@wrsu.org Training and Recruitment Olivia Alvarez training@wrsu.org Music Director Jake Falkenstein music@wrsu.org Sports Director Phil Jaccoma sports@wrsu.org News Director Rahill Chatterjee news@wrsu.org Entertainment News Director Alexis Bonilla entertainment@wrsu.org Production Director Tony Palumbo production@wrsu.org Promotions Director Chloe Berwick promotions@wrsu.org Visual Media Director Dylan Elizabeth Wolski video@wrsu.org Get in touch Submit the form below and a member of our team will be in touch shortly. Name Email Phone Tell us a little about you Verify Comments This field is for validation purposes and should be left unchanged. container container--medium container--wide Footer 126 College Avenue New Brunswick, NJ 08901 732-932-7800 Facebook Instagram X YouTube TikTok © WRSU Rutgers Radio. All Rights Reserved. Privacy Policy | FCC Public File | EEO Report"
    },
    {
      "url": "https://crazyunclemikes.com/events/",
      "text": "Events from February 16, 2024 – March 6, 2024 – Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart 12 events found. Events Search and Views Navigation Search Enter Keyword. Search for Events by Keyword. Find Events Hide filters Event Views Navigation List List Month Day Filters Changing any of the form inputs will cause the list of events to refresh with the filtered results. Done Clear Day : Open filter Close filter Remove filters Day Close filter Monday Tuesday Wednesday Thursday Friday Saturday Sunday Day : Remove filters Today Now Now - 9/19/2025 September 19 Select date. September 2025 Wed 10 September 10 @ 8:00 pm Annika Chambers & Paul Deslauries Featuring Jp Soars Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Annika Chambers & Paul Deslauries: Both on stage and in private life, these two internationally acclaimed artists share incredible chemistry! Their first introduction (lasting only a few seconds) in the crowded lobby of the historic Orpheum Theatre during the 2018 International Blues Challenge in Memphis, Tennessee left a lasting impression on both of them. It […] Thu 11 September 11 @ 7:00 pm The Samantha Russell Duo Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Samantha Russell Duo is Sam and accomplished acoustic guitarist Eleni “Leni” Skiba.With a rock, pop and country setlist that includes new and now artists like Post Malone and The Lumineers… to favorites including Amy Winehouse and Stevie Nicks… to classics such as Bill Withers and Etta James… plus much more… there’s sure to be […] Fri 12 September 12 @ 5:00 pm Happy Hour: Balatovis Come listen to Balatovis serenade you for Happy Hour! Happy Hour: 5-7:30pm $6 Food & Drink Specials and Free Parking! Fri 12 September 12 @ 8:30 pm U2-2U Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States U2-2U is the premiere U2 Tribute with decades of live performance and touring experience. Out of a deep respect and appreciation for the musical artistry of U2, U2-2U has painstakingly recreated the sound and feel of a live U2 show. An authentic performance that transports audiences back in time to the '80s, '90s and 2000s […] Sat 13 September 13 @ 5:00 pm Happy Hour: Michael Theise Happy Hour: 5-7:30pm $6 Food & Drink Specials and Free Parking! Sat 13 September 13 @ 8:30 pm Rubixx : A Tribute to the 80s Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Rubixx is South Florida's latest tribute to the New Wave, Top 40, and Pop hits from the 80s. They will keep you on your feet dancing all night! GET YOUR TICKETS NOW! September 13th:Rubixx Can't make it, don't worry all of Crazy Uncle Mike's shows are streamed straight to your living room on our Youtube […] Sun 14 September 14 @ 12:00 pm 90’s Bingo & Brunch Brunch starts at 12pm Bingo starts 1pm Ladies get a free bottle of champagne with purchase of an entrée! Call now to reserve your table! 561- 931-2889 Sun 14 September 14 @ 7:00 pm The Copy Catz Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Copy-Catz Band, Co-founded by Donna Ace and Jay Groove. A South Florida based Rock/Pop cover band, playing hits from the 70’s to Today. Our influences and bands that we copy are one and the same, with a variety of famous artists, including Alanis Morissette, Blondie, The B-52’s, No Doubt, to Lit, Cheap Trick, The […] Mon 15 September 15 @ 7:00 pm Country Night – Boot Scootin Boogie Country Night – Boot Scootin Boogie Saddle up for Crazy Uncle Mike's Boot Scootin' Boogie Country Night! Ladies, enjoy a complimentary hosted bar from 6-8pm! Plus, we've got $4 craft pints and a delicious $12 Bacon Cheeseburger special all night long! Free line dance lessons at 7pm with the Southern Soul Dancers, and then stick around for DJ Gio Black spinning […] Tue 16 September 16 @ 8:00 pm Taco Tuesday! Taco Tuesday! Get Ready for Crazy Uncle Mike's Taco Tuesday & Latin Night! $4 Tacos & $6 Margaritas All Day! DJ Gio Black kicks the night off at 8pm with the best Latin Tunes! Free latin Dance lessons with Emmanuel start at 8:30pm! Come dance the night away! Thu 18 September 18 @ 7:00 pm Life In Technicolor Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Introducing \"Life In Technicolor\" - South Florida's Premier Coldplay Tribute Band Featuring World-Class Musicians South Florida's vibrant music scene is about to get a dose of rock and pop royalty with the arrival of \"Life In Technicolor,\" an exciting new Coldplay tribute band comprised of world-class players who are set to take the region by […] Fri 19 September 19 @ 5:00 pm Happy Hour: Jerry Leeman Happy Hour Music from 5-7:30pm! $6 Food & Drink Specials and Free Parking! Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://crazyunclemikes.com/venue/crazy-uncle-mikes/",
      "text": "Crazy Uncle Mike's - Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart 12 events found. Crazy Uncle Mike’s Events Venues Crazy Uncle Mike’s Address 6450 North Federal Highway Boca Raton , FL 33487 United States Get Directions Phone 15619312889 Events at this venue Today Now Now - 9/28/2025 September 28 Select date. September 2025 Wed 10 September 10 @ 8:00 pm - 11:30 pm Annika Chambers & Paul Deslauries Featuring Jp Soars Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Annika Chambers & Paul Deslauries: Both on stage and in private life, these two internationally acclaimed artists share incredible chemistry! Their first introduction (lasting only a few seconds) in the crowded lobby of the historic Orpheum Theatre during the 2018 International Blues Challenge in Memphis, Tennessee left a lasting impression on both of them. It […] Thu 11 September 11 @ 7:00 pm - 11:30 pm The Samantha Russell Duo Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Samantha Russell Duo is Sam and accomplished acoustic guitarist Eleni “Leni” Skiba.With a rock, pop and country setlist that includes new and now artists like Post Malone and The Lumineers… to favorites including Amy Winehouse and Stevie Nicks… to classics such as Bill Withers and Etta James… plus much more… there’s sure to be […] Fri 12 September 12 @ 8:30 pm - 11:00 pm U2-2U Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States U2-2U is the premiere U2 Tribute with decades of live performance and touring experience. Out of a deep respect and appreciation for the musical artistry of U2, U2-2U has painstakingly recreated the sound and feel of a live U2 show. An authentic performance that transports audiences back in time to the '80s, '90s and 2000s […] Sat 13 September 13 @ 8:30 pm - 11:30 pm Rubixx : A Tribute to the 80s Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Rubixx is South Florida's latest tribute to the New Wave, Top 40, and Pop hits from the 80s. They will keep you on your feet dancing all night! GET YOUR TICKETS NOW! September 13th:Rubixx Can't make it, don't worry all of Crazy Uncle Mike's shows are streamed straight to your living room on our Youtube […] Sun 14 September 14 @ 7:00 pm - 10:30 pm The Copy Catz Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Copy-Catz Band, Co-founded by Donna Ace and Jay Groove. A South Florida based Rock/Pop cover band, playing hits from the 70’s to Today. Our influences and bands that we copy are one and the same, with a variety of famous artists, including Alanis Morissette, Blondie, The B-52’s, No Doubt, to Lit, Cheap Trick, The […] Thu 18 September 18 @ 7:00 pm - 11:30 pm Life In Technicolor Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Introducing \"Life In Technicolor\" - South Florida's Premier Coldplay Tribute Band Featuring World-Class Musicians South Florida's vibrant music scene is about to get a dose of rock and pop royalty with the arrival of \"Life In Technicolor,\" an exciting new Coldplay tribute band comprised of world-class players who are set to take the region by […] Sat 20 September 20 @ 8:30 pm - 11:30 pm Havoc 305 Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States HAVOC 305 are “The Premiere” South Florida Top 40 cover band and have been playing all your favorite hits spanning for the 60’s, 70’, 80’s, 90’s and Today! For over 15+ years the guys which consist of band members Jose Almonte (Vocals), Jwani Brito (Drums/ Vocals), Rik De Cubas (Lead Guitar / Vocals) and Arthur […] Sun 21 September 21 @ 7:00 pm - 10:30 pm Crazy Fingers Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States South Florida's Premier Grateful Dead Tribute Band - Crazy Fingers returns to Crazy Uncle Mike's! Crazy Fingers performed their first offical show at a private party at Ultimate Farms in Delray Beach FL on Halloween, 10/31/90. A splendid time was had by all. The original lineup was Bubba Newton on bass,Pete Lavezzoli on drums, Mike […] Thu 25 September 25 @ 8:30 pm - 11:30 pm Electric Ladyland Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Experience an amazing night with Electric Ladyland. You'll be captivated by the dynamic sounds of Jimi Hendrix, paired with an exhilarating pre-show tribute by Super Jam, honoring iconic bands like Led Zeppelin, Aerosmith, Journey, Queen, The Who, and so many more. This event is designed to delight every music lover. GET YOUR TICKETS NOW! September […] Fri 26 September 26 @ 8:30 pm - 11:30 pm Sugaray Rayford Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Sugaray Rayford is a man with a message and a larger than life personality and voice to deliver it. Working with producer, songwriter Eric Corne for the past 3 albums, the soul-blues powerhouse has crafted an incendiary sound and narrative, combining classic soul melodies and funky R & B grooves with raw blues power. The […] Sat 27 September 27 @ 8:00 pm - 11:30 pm Unlimited Devotion: Celebrating The Music Of The Grateful Dead Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Since their inception Unlimited Devotion has developed a devoted fan following and a reputation as one of the America's most popular Grateful Dead inspired musical acts. Improvisation at its finest. Unlimited Devotion (aka UD) was conceived in Miami in April 2012 as a vehicle for exploring the Grateful Dead’s songbook. The band quickly developed a […] Sun 28 September 28 @ 7:00 pm - 11:30 pm Studio 54 Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States 70's, 80's & 90's today's music. ORIGINAL Studio 54 band S. Florida's most sought after group. Check out our food and drink menus! GET YOUR TICKETS NOW! September 28th: Studio 54  Can't make it, don't worry all of Crazy Uncle Mike's shows are streamed straight to your living room on our Youtube & Facebook!  https://www.eventbrite.com/e/studio-54-tickets-1665521673159?aff=oddtdtcreator […] Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://crazyunclemikes.com/beats/",
      "text": "Beats - Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart Beats We've Got Some Great Things Coming Up Check out our calendar to see our upcoming live music shows, events, and more 12 events found. Events Search and Views Navigation Search Enter Keyword. Search for Events by Keyword. Find Events Hide filters Event Views Navigation List List Month Day Filters Changing any of the form inputs will cause the list of events to refresh with the filtered results. Done Clear Day : Open filter Close filter Remove filters Day Close filter Monday Tuesday Wednesday Thursday Friday Saturday Sunday Day : Remove filters Today Now Now - 9/18/2025 September 18 Select date. September 2025 Tue 9 September 9 @ 8:00 pm Taco Tuesday! Taco Tuesday! Get Ready for Crazy Uncle Mike's Taco Tuesday & Latin Night! $4 Tacos & $6 Margaritas All Day! DJ Gio Black kicks the night off at 8pm with the best […] Wed 10 September 10 @ 8:00 pm Annika Chambers & Paul Deslauries Featuring Jp Soars Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Annika Chambers & Paul Deslauries: Both on stage and in private life, these two internationally acclaimed artists share incredible chemistry! Their first introduction (lasting only a few seconds) in the […] Thu 11 September 11 @ 7:00 pm The Samantha Russell Duo Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Samantha Russell Duo is Sam and accomplished acoustic guitarist Eleni “Leni” Skiba.With a rock, pop and country setlist that includes new and now artists like Post Malone and The […] Fri 12 September 12 @ 5:00 pm Happy Hour: Balatovis Come listen to Balatovis serenade you for Happy Hour! Happy Hour: 5-7:30pm $6 Food & Drink Specials and Free Parking! Fri 12 September 12 @ 8:30 pm U2-2U Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States U2-2U is the premiere U2 Tribute with decades of live performance and touring experience. Out of a deep respect and appreciation for the musical artistry of U2, U2-2U has painstakingly […] Sat 13 September 13 @ 5:00 pm Happy Hour: Michael Theise Happy Hour: 5-7:30pm $6 Food & Drink Specials and Free Parking! Sat 13 September 13 @ 8:30 pm Rubixx : A Tribute to the 80s Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Rubixx is South Florida's latest tribute to the New Wave, Top 40, and Pop hits from the 80s. They will keep you on your feet dancing all night! GET YOUR […] Sun 14 September 14 @ 12:00 pm 90’s Bingo & Brunch Brunch starts at 12pm Bingo starts 1pm Ladies get a free bottle of champagne with purchase of an entrée! Call now to reserve your table! 561- 931-2889 Sun 14 September 14 @ 7:00 pm The Copy Catz Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States The Copy-Catz Band, Co-founded by Donna Ace and Jay Groove. A South Florida based Rock/Pop cover band, playing hits from the 70’s to Today. Our influences and bands that we […] Mon 15 September 15 @ 7:00 pm Country Night – Boot Scootin Boogie Country Night – Boot Scootin Boogie Saddle up for Crazy Uncle Mike's Boot Scootin' Boogie Country Night! Ladies, enjoy a complimentary hosted bar from 6-8pm! Plus, we've got $4 craft pints and a delicious $12 Bacon […] Tue 16 September 16 @ 8:00 pm Taco Tuesday! Taco Tuesday! Get Ready for Crazy Uncle Mike's Taco Tuesday & Latin Night! $4 Tacos & $6 Margaritas All Day! DJ Gio Black kicks the night off at 8pm with the best […] Thu 18 September 18 @ 7:00 pm Life In Technicolor Crazy Uncle Mike's 6450 North Federal Highway, Boca Raton, FL, United States Introducing \"Life In Technicolor\" - South Florida's Premier Coldplay Tribute Band Featuring World-Class Musicians South Florida's vibrant music scene is about to get a dose of rock and pop royalty […] Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Local Artist Spotlight We love local bands, and we hope you do too. Check out our current spotlight artists to keep the good vibes going Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://crazyunclemikes.com/private-events/",
      "text": "Private Events - Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart Private Events Book the Best Private Event You'll Ever Throw With our oversized stage, large seating capacity, and our selection of brews, bites, and beats you won’t find anywhere else, Crazy Uncle Mike’s is the perfect place to host your next event. We offer not only a venue, but an experience like no other. If you need to host a private event in Boca Raton that blows everyone away, Crazy Uncle Mike’s is the place to do it. Whatever the occasion, book a section of our space or the entire establishment. We cater to every event from birthdays to baby showers and business luncheons to weddings. Even wakes and divorces! Contact us today for a quote on the coolest event you’ll ever plan. Book Now Seated capacity for 200+ guests 3 separate, interchangeable lounge spaces with couches Patio & Beer Garden can be utilized for private and semi-private functions 12'X30' stage and state-of-the-art audio video system available Microphone and PA system for presentations Plenty of complimentary on-site parking 17 50\" HD TVs and a 10' projector screen for video or branding DMX intelligent stage lighting Table tennis, darts, giant Jenga, and other interactive games Customizable food and beverage packages for your event of any size Brewery Tours This Could Be You Get In Touch Fill out the form to let us know a little bit more about your event so we can accommodate you. (561) 931-2889 mike@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Name Email Phone What Kind of Event are You Planning Details Send Stay In Touch Enter your email address to subscribe and stay updated on our upcoming events, live shows, and more. Email Send Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://crazyunclemikes.com/events/today/",
      "text": "Events for September 10, 2025 – Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart 1 event found. Events Search and Views Navigation Search Enter Keyword. Search for Events by Keyword. Find Events Hide filters Event Views Navigation Day List Month Day Filters Changing any of the form inputs will cause the list of events to refresh with the filtered results. Done Clear Day : Open filter Close filter Remove filters Day Close filter Monday Tuesday Wednesday Thursday Friday Saturday Sunday Day : Remove filters Today 9/10/2025 September 10, 2025 Select date. 8:00 pm September 10 @ 8:00 pm Annika Chambers & Paul Deslauries Featuring Jp Soars Crazy Uncle Mike's 6450 North Federal Highway, \t\t\t\t\tBoca Raton Annika Chambers & Paul Deslauries: Both on stage and in private life, these two internationally acclaimed artists share incredible chemistry! Their first introduction (lasting only a few seconds) in the […] Previous Day Next Day Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://crazyunclemikes.com/about/",
      "text": "About - Crazy Uncle Mikes Skip to content Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online Home About Brews Bites Beats Private Events Gallery Our Shop Order Online $ 0.00 0 Cart About Us Who We Are Crazy Uncle Mike’s is a craft brewery, live music venue, and scratch kitchen in North Boca Raton, and the home of what we like to call “fun dining.” With over 14 styles of beer brewed in-house, a globally influenced menu, and an eclectic lineup of live music, Crazy Uncle Mike’s delivers an experience unlike any other in South Florida. Whether you are looking to plan a night out with friends, host an event of any size, or just have a bite and brew afterwork, we are the perfect place to enjoy a truly local experience. The atmosphere is inviting, the beer is cold, and the food is delicious. Pop in and enjoy! Eat No Evil Our menu is designed by our executive chef to take you on a flavor journey inspired by dishes from all around the world. Drink No Evil Our house-made beers and wide selection of bourbons and other liquors that we sell have something that will pair perfectly with any meal Sing No Evil At Crazy Uncle Mike's, we believe that the beats should always be something you can rock out to. Check out our calendar for upcoming shows. Contact Us Host A Private Event With Us From birthday parties to bridal showers and business outings to weddings, we’re happy to have you. Our oversized stage and seating capacity of 200 people make our venue the perfect spot for all kinds of events and occasions, and our unbeatably delicious food and smooth craft beers will leave your whole group impressed. Contact Us Meet The Team Get to know a little bit about the faces and talent behind what makes Crazy Uncle Mike’s a one-of-a-kind establishment. Founder Mike Goodwin Mike Goodwin Founder Crazy Uncle Mike’s is a brewery, restaurant, and music venue located in East Boca Raton, Florida. We opened our doors Summer 2018 to the joy of the public after our founder, Mike Goodwin, decided he wanted a relaxed place for people to spend their leisure time all while conveniently having amazing food, drinks, and great entertainment. The energetic vibe at our brewery always guarantees a great time for everyone. Executive Chef Tara Abrams Tara Abrams Executive Chef Tara Abrams uses a variety of fresh and seasonal ingredients to create signature dishes. Tara has trained throughout Florida in some favorite kitchens such as multiple JEY Hospitality Group restaurants, 32 East, and OTC Brickell. Some of her classic, customer-favorite dishes include Purple Potato Skins, Pork Belly Tacos, and Veggie Taco-Elotes. Chef Tara is able to express herself through means of food to the joy of the public. GM Eric Hass Eric Hass GM Originally from New Hampshire and after finishing High School, Eric had two tours over seas with the Marine Corps, he then completed a few years of college in the Boston area, before moving to Florida to attend FAU.  In the summer of 2018 Eric was hired as part of the original Crazy Uncle Mike’s staff. Hired as a bar tender, Eric quickly developed his management skills and stepped into the role of GM in February 2019. As our GM he has curated one of the finest selections of bourbon in south Florida, creating lasting relationships with some of the biggest names in the whiskey industry. Sound & Lighting Engineer Daniel Larghi Daniel Larghi Sound & Lighting Engineer Daniel started playing the horn and trombone when he was 10 years old. It was this love of sound that lead him to get his commercial music technology bachelors from FAU.  Daniel joined Crazy Uncle Mike’s team in the beginning of July 2021 as our assistant sound and lighting engineer, then in March 2022 became our lead sound and lighting engineer. He has done work for large festivals all the way to theatre work, giving a reason to why all of Crazy Uncle Mike’s shows sound great! Brewmaster Eric Lewis Eric Lewis Brewmaster Eric Lewis has been brewing beer more years than he hasn’t. From starting in his shed with his father to opening a brewery of his own in Ohio, he has had a passion for creating new and innovative styles. Moving from North Water Brewing Company to an award-winning commercial brewery, O’Connor Brewing Company, he has excelled at all levels of brewing well received beer. Our mission is for everyone who enters our establishment to leave with a smile. Hours Mon-Thurs 3pm-12am Fri-Sat 12pm-2am Sun 12pm-12am (561) 931-2889 info@crazyunclemikes.com 6450 N FEDERAL HIGHWAY BOCA RATON, FLORIDA 33487 Quick Links About Us Brews Bites Beats Private Events Shop Contact Follow Us Facebook Instagram Youtube Powered by Paradox Media . Copyright © 2024 Crazy Uncle Mike’s. All Right Reserved. Join our Mailing list! Get all latest news, exclusive deals and updates. Email subscribe Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://trustunclemike.com/contact-us/",
      "text": "Contact NJ HVAC Specialists | Uncle Mike's Home Service info@trustunclemike.com 716 Newman Springs Rd suite 130, Lincroft, NJ 07738, United States 848.900.MIKE Facebook Twitter Instagram Linkedin Home About Services Heating Furnace Repair Boilers Radiators Heat Pumps Cooling AC Servicing & Repairs AC Installation Central Air Ductless Mini-Split HVAC HVAC Repairs HVAC Installation HVAC Maintenance HVAC Replacement Indoor Air Quality Duct Cleaning Blog Contact Menu Get A Quote 848.900.MIKE Facebook Twitter Instagram Linkedin Home About Services Heating Furnace Repair Boilers Radiators Heat Pumps Cooling AC Servicing & Repairs AC Installation Central Air Ductless Mini-Split HVAC HVAC Repairs HVAC Installation HVAC Maintenance HVAC Replacement Indoor Air Quality Duct Cleaning Blog Contact Menu Free Quotes Got a Question? Welcome to Uncle Mike's Home Service, your trusted HVAC experts in Lincroft, NJ! Our dedicated team is committed to keeping your home comfortable and cozy. Whether you need heating or cooling services, we've got you covered with top-notch solutions tailored to your needs. Have a question or need assistance? We're just a click away! Fill out the form below, and our friendly team will get back to you promptly. At Uncle Mike's, we take pride in providing exceptional service, so you can relax in a perfectly climate-controlled home. Get in touch today, and let us be your go-to HVAC partner! Head Office Find Us 716 Newman Springs Rd suite 130, Lincroft, NJ 07738, United States Email info@trustunclemike.com Contact (848) 900-6453 (848) 275-3826 Working hours Mon-Fri: 8 AM - 5 PM Sat-Sun: 8 AM - 2 PM Uncle Mike’s Home Service is the go-to AC repair and Installation service\nprovider in Lincroft, NJ! About us About us Services Contact us services Heating Cooling Air quality Contact Us 716 Newman Springs Rd suite 130, Lincroft, NJ 07738, United States Email: info@trustunclemike.com Phone: (848) 900-6453 @ 2024 Designed & Developed by FunnelPros FB IN LN TW Privacy Policy Terms & Condition"
    },
    {
      "url": "https://unclemikesnatural.com/pages/contact",
      "text": "Contact - Uncle Mike's Sign up to our Email List and get 20% off your first order Sign up Products About Contact Where to Buy Reviews Blog Search Login 0 Cart menu Products About Contact Where to Buy Reviews Blog Login Search 0 Cart Products Deodorant Bar Soap Foaming Hand Soap Men's Products Salves, Rubs & Balms Commercial Hand Soap SALE - Gifts & Packs Goods & Apparel View All Products Contact Get in touch today Email: mike@unclemikesnatural.com Phone: 1(306)381-SOAP (7627) Facebook: https://www.facebook.com/UncleMikesAllNaturalProducts Find a store near you. Saskatoon Order Pick Up Location: 1730 Quebec Ave. Unit #5 Saskatoon SK Canada S7K 1V9 Name * Email * Message * Submit Saskatoon Order Pick Up Location 1730 Quebec Ave. Unit #5 Saskatoon SK Canada S7K 1V9 Hours of operation: Tues-Fri: 10:00am - 4:00pm Sat: Closed Sun: Closed 100% All Natural Ingredients Vegan Friendly Free shipping on orders over $85 Made in Saskatchewan CONTACT +1(306)-381-SOAP (7627) mike@unclemikesnatural.com Products Deodorant Bar Soap Foaming Hand Soap Men's Products Salves, Rubs & Balms Commercial Hand Soap SALE - Gifts & Packs Goods & Apparel View All Products Info Home About Reviews Fundraising Product Guarantee Shipping Information Payment Info Commitment to Sustainability Ingredients Press Contact Blog Subscribe Sign up to to our email list and get the latest on sales, new releases and more Email * Sign Up © 2025 Uncle Mike's . American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL Mastercard PayPal Shop Pay Visa Search What are you looking for?"
    },
    {
      "url": "https://www.theswordandboardtoronto.com/products/kill-team-blood-and-zeal",
      "text": "Kill Team - Blood and Zeal\n– The Sword & Board Kill Team  - Blood and Zeal 0 Home About About Us Sell & Trade Shop All Products New & Hot Miniatures Age of Sigmar Battlefield In a Box Bolt Action Infinity GW Specialist/Boxed Games Spellcrow Warhammer 40k RPG Painted Minis and Dungeon Dressings Unpainted RPG Minis and Dungeon Dressings Wizkids Miniatures Singles Board Games Cooperative Party Classic Light Games Heavy Games Two Player Games Family Games Competitive Games Staff Picks Collectible Card Games Pokemon Magic The Gathering Card Accessories Lorcana Role Playing Games Dungeons and Dragons Pathfinder Other RPGs RPG Accessories RPG Painted Minis and Dungeon Dressings Unpainted RPG Minis and Dungeon Dressings Wizkids Miniatures Singles Dice RPG Dice Minis Dice Dice Bags and Accessories Paint Brushes and Airbrushes Paint Sets Hobby Tools Basing and Diorama Weathering Products Acrylic Paints Spray Can Primers Entry fee and Events Events Events Media Contact Us FAQ Sign In Forgot your password? Sign In Create account Register CAD CAD CAD 0 Home Kill Team  - Blood and Zeal Games Workshop Kill Team  - Blood and Zeal $160.00 Kill Team  - Blood and Zeal $160.00 Default Title Quantity: - + Sold out Sold out Add to Wishlist Added to Wishlist Ask us any Question Details Brand: Games Workshop Type: miniatures Availability: Out stock Description This expansion includes two multipart plastic kill teams, an imposing piece of shrine scenery, rules, datacards, and accessories for your games of Kill Team. It continues the ongoing narrative on Volkus, and introduces fresh ways to play, more operatives, and strategies – it's an ideal way to add even more variety to your games. This boxed set contains: – 56-page softcover Blood and Zeal Dossier : Background, artwork, and rules for the two kill teams in the box, plus an overview of the ongoing conflict on the planet Volkus. – Sanctifiers Kill Team: A complete kill team of 11 multipart plastic miniatures, consisting of 1x Confessor, 1x Cherub, 1x Death Cult Assassin, 1x Salvationist, 1x Miraculist, 2x Missionaries, 1x Drill Abbot, 1x Persecutor (which can alternatively be built as a Preacher), 1x Conflagrator (which can alternatively be built as a Preacher), and 1x Reliquant (which can alternatively be built as a Preacher). – Goremongers Kill Team: A complete kill team of 8 multipart plastic miniatures, consisting of 1x Blood Herald, 2x Aspirants, as well as 1x Bloodtaker, 1x Impaler, 1x Skullclaimer, 1x Stalker, and 1x Inciter (all of which except the Blood Herald can alternatively be built as Aspirants). – Killzone Upgrade: Shrine Statue: A terrain feature designed to be used with the rules in the book. – Sanctifiers Datacards: 37 datacards covering operative and faction rules, abilities, ploys, and equipment. – Goremongers Datacards: 40 datacards covering operative and faction rules, abilities, ploys, and equipment. – Blood and Zeal Card Pack: 32 cards are included in the book for use with the Blood and Zeal Mission Pack. – Token Sheets: One double-sided cardboard token sheet, containing 38x Goremongers tokens, and 39x Sanctifiers tokens. This set comprises 218 plastic components, 9x Citadel 32mm Round Bases, and 10x Citadel 25mm Round Bases. These miniatures require assembly and are supplied unpainted The miniatures and other elements of this product will be available separately at a later date. The Blood and Zeal Dossier book and Mission Pack Cards are exclusive to this boxed set. You will need a copy of the Kill Team: Core Book and Killzone: Volkus, both available separately, to make full use of the contents of this box. Ask us any Question Name Email Subject Faq Share on Facebook Twitter You May Also Like Add To Bag Astra Militarum Baneblade $230.00 Choose Options Necromunda Dark Uprising $350.00 Choose Options Warcry: Catacombs $250.00 Add To Bag Necrons - Monolith $230.00 Choose Options Operation:  Wildfire $169.95 Choose Options Battleforce T'au Empire Starpulse Cadre $250.00 1193 Bloor St W, Toronto, ON M6H 1N4 647-350-PLAY (7529) theswordandboardtoronto@gmail.com Scroll to Top CUSTOMER SERVICES Frequently Asked Questions Terms of Service Shipping Refunds Your Privacy CUSTOMER SERVICES Frequently Asked Questions Terms of Service Shipping Refunds Your Privacy Hours of Operation Monday-Friday: 11 - 10 Saturday-Sunday: 11 - 7 Hours of Operation Monday-Friday: 11 - 10 Saturday-Sunday: 11 - 7 Newsletter Subscribe to get update about new products and sales Subscribe Newsletter Subscribe to get update about new products and sales Subscribe © 2025 FoundU Marketing This website uses cookies to ensure you get the best experience on our website. Learn more GOT IT! Home Store Account Contact More theswordandboardtoronto@gmail.com Call: 647-350-7529 All Products New/Hot Miniatures WizKids Miniature Singles Role Playing Games WizKids Miniature Singles Collectible Card Games Magic the Gathering Pokemon Card Accessory Lorcana Board Games Dice Entry Fee and Events 0 Home About About Us Sell & Trade Shop All Products New & Hot Miniatures Age of Sigmar Battlefield In a Box Bolt Action Infinity GW Specialist/Boxed Games Spellcrow Warhammer 40k RPG Painted Minis and Dungeon Dressings Unpainted RPG Minis and Dungeon Dressings Wizkids Miniatures Singles Board Games Cooperative Party Classic Light Games Heavy Games Two Player Games Family Games Competitive Games Staff Picks Collectible Card Games Pokemon Magic The Gathering Card Accessories Lorcana Role Playing Games Dungeons and Dragons Pathfinder Other RPGs RPG Accessories RPG Painted Minis and Dungeon Dressings Unpainted RPG Minis and Dungeon Dressings Wizkids Miniatures Singles Dice RPG Dice Minis Dice Dice Bags and Accessories Paint Brushes and Airbrushes Paint Sets Hobby Tools Basing and Diorama Weathering Products Acrylic Paints Spray Can Primers Entry fee and Events Events Events Media Contact Us FAQ CAD CAD CAD My Account 0 Sign In Sign in below using your The Sword & Board information. Forgot your password? Sign In NOT MEMBER? BECOME A MEMBER TODAY Create account My Account 0 Register Create a new account. Once you‘ve set it up, you can take advantage of many benefits of membership. Create My Account 0 Reset your password We will send you an email to reset your password. Submit Cancel OK NEWSLETTER Subscribe and get notified at first on the latest\nupdate and offers! SEND Don’t show again Shopping bag 0 View Cart Checkout"
    }
  ]
}