{
  "fuentes": [
    {
      "url": "https://www.crescentfarms.com/",
      "email": "golf@crescentfarms.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "gmercier@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jdecker@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jkeller@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "jzimbelman@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "kwelton@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mbrown@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mjohnson@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mmota@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "mschawartz@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "nvanhook@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "rhall@hillcrestcountryclub.com"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "email": "sfreese@hillcrestcountryclub.com"
    },
    {
      "url": "https://www.crescentfarms.com/contact-us/",
      "email": "cnathanson@crescentfarms.com"
    },
    {
      "url": "https://www.crescentfarms.com/contact-us/",
      "email": "golf@crescentfarms.com"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "email": "codir.of.golf@crescentoaksgolf.com"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "email": "cofb.dir@crescentoaksgolf.com"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "email": "cogm@crescentoaksgolf.com"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "email": "coom@crescentoaksgolf.com"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "email": "sales@crescentoaksgolf.com"
    },
    {
      "url": "https://theoaksgolf.co.uk/contact-us/",
      "email": "info@theoaksgolf.co.uk"
    },
    {
      "url": "https://crescentoaksgolf.com/the-course/",
      "email": "codir.of.golf@crescentoaksgolf.com"
    }
  ],
  "mails": [
    "cnathanson@crescentfarms.com",
    "codir.of.golf@crescentoaksgolf.com",
    "cofb.dir@crescentoaksgolf.com",
    "cogm@crescentoaksgolf.com",
    "coom@crescentoaksgolf.com",
    "dpylinski@sevenoaksgolf.com",
    "gmercier@hillcrestcountryclub.com",
    "golf@crescentfarms.com",
    "info@belfairsgolfclub.co.uk",
    "info@theoaksgolf.co.uk",
    "jdecker@hillcrestcountryclub.com",
    "jkeller@hillcrestcountryclub.com",
    "jzimbelman@hillcrestcountryclub.com",
    "kwelton@hillcrestcountryclub.com",
    "mbrown@hillcrestcountryclub.com",
    "mjohnson@hillcrestcountryclub.com",
    "mmota@hillcrestcountryclub.com",
    "mschawartz@hillcrestcountryclub.com",
    "nvanhook@hillcrestcountryclub.com",
    "rhall@hillcrestcountryclub.com",
    "sales@crescentoaksgolf.com",
    "sfreese@hillcrestcountryclub.com"
  ],
  "nombre_sitio": "crescentoaksgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.crescentfarms.com/",
      "text": "Home - Crescent Farms Golf Club Skip to primary navigation Skip to main content Skip to footer Crescent Farms Golf Club Eureka, MO Home Course Annual Pass Scorecards Golf Lessons 9 Hole Executive Course Photos FAQ’s Tee Times Events Host a Tournament Weddings & Banquets Photo Gallery Contact Contact Crescent Farms Golf Club Send a Gift Map & Directions Donation Requests Home Book A Tee Time Send A Gift Host a Tournament Crescent Farms Golf Club Golf Lessons We offer lessons to beginners AND long-time players! Join Email Club Enjoy special offers, discounts, and more! Annual Pass Take your love of the game to the next level! Weddings + Banquets Our event staff will provide you with the day of your dreams! IT’S YOUR SHOT! GRAB YOUR CLUBS Online Tee Times & GET OVER TO CRESCENT FARMS In the quiet countryside near St. Louis, you’ll find a club where great golf is front and center. Crescent Farms Golf Club is a unique 27-hole public golf club where players draw serious satisfaction from the playing adventures we offer on well-manicured fairways and greens. It’s not surprising that these golfers feel this way. After all, in our thickly wooded setting of rolling terrain, ponds and creeks, our players can escape from the stress of everyday world into a wonderful fairway journey. You will find lots of genuine golf here with holes that will leave you hungry to return for another try. You may have known us in the past as The Players Club at St. Louis. But now we have a new name and a new outlook. This St. Louis golf course is becoming better than ever! We are just a short 20 minute drive from the iconic St. Louis Arch. Contact Crescent Farms Golf Course For more information about Crescent Farms, please call (636) 938-6200, email golf@crescentfarms.com , or use the form provide here. SPECIAL EVENTS: Are you planning a company outing or golf event? Are you planning a wedding, anniversary party, or special event? Contact us to host your special day at Crescent Farms. Please enable JavaScript in your browser to complete this form. Name * Email Address * Phone Comment or Message * Website Submit DRESS CODE IS ENFORCED: JEANS/T-SHIRTS ARE NOT ALLOWED Footer Visit Us 745 Lewis Road, Eureka, MO 63025 Follow Us Contact Us (636) 938-6200 golf@crescentfarms.com Copyright © 2025 Crescent Farms Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://hillcrestcountryclub.com/our-staff",
      "text": "Our Staff - Hillcrest Country Club Member Login Golf Aquatics Tennis Clubhouse Membership Weddings Our Staff Menu Golf Aquatics Tennis Clubhouse Membership Weddings Our Staff Member Login Meet Our Staff Clubhouse Manager Joey Decker | 531-500-5460 jdecker@hillcrestcountryclub.com Golf Operations Mike Brown | 531-500-2781 mbrown@hillcrestcountryclub.com Golf Operations Sonya Freese | 402-489-7164 sfreese@hillcrestcountryclub.com Office Manager/Membership Director Jessica Zimbelman | 531-500-5730 jzimbelman@hillcrestcountryclub.com Aquatics Director Jeanette Keller | 402-489-1846 jkeller@hillcrestcountryclub.com Racquet & Fitness Director Maria Mota mmota@hillcrestcountryclub.com Member Relations Director Nicole Van Hook | 402-489-7113 nvanhook@hillcrestcountryclub.com Executive Chef Marcus Johnson | 402-489-7111 mjohnson@hillcrestcountryclub.com Assistant Golf Professional Kelley Welton | 402-489-8181 kwelton@hillcrestcountryclub.com Superintendent Robert Hall | 531-230-1009 rhall@hillcrestcountryclub.com Assistant Superintendent Kal Knorr Events Director Gabby Mercier | 531-500-3134 gmercier@hillcrestcountryclub.com 9401 O Street Lincoln, NE 68520 main: (402) 489-7111 • fax: (402) 489-7123 © Copyrighted by Hillcrest Country Club Powered by Northstar Technologies Inc"
    },
    {
      "url": "https://www.crescentfarms.com/contact-us/",
      "text": "Contact Crescent Farms Golf Club - Crescent Farms Golf Club Skip to primary navigation Skip to main content Skip to footer Crescent Farms Golf Club Eureka, MO Home Course Annual Pass Scorecards Golf Lessons 9 Hole Executive Course Photos FAQ’s Tee Times Events Host a Tournament Weddings & Banquets Photo Gallery Contact Contact Crescent Farms Golf Club Send a Gift Map & Directions Donation Requests Contact Crescent Farms Golf Club Crescent Farms Golf Club 745 Lewis Road, Eureka, MO 63025 Phone: (636) 938-6200 Email: golf@crescentfarms.com Head Golf Professional: Corey Nathanson, cnathanson@crescentfarms.com Contact Form Please enable JavaScript in your browser to complete this form. Name * Email Address * Phone Comment or Message * Name Submit Footer Visit Us 745 Lewis Road, Eureka, MO 63025 Follow Us Contact Us (636) 938-6200 golf@crescentfarms.com Copyright © 2025 Crescent Farms Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 53° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://crescentoaksgolf.com/demo-home-page/about-us/",
      "text": "Contact - Crescent Oaks Golf Club Home The Course Leagues Membership Weddings and Events The Grille The Store Contact Menu Home The Course Leagues Membership Weddings and Events The Grille The Store Contact BOOK NOW About Crescent Oaks Crescent Oaks Golf Club is a Semi-Private golf club located in Tarpon Springs. the 18 Hole championship course, designed by renowned architect Steve Smyers, is a local favorite. Built in 1991, the Crescent Oaks measures in at 6,914 yards from the championship tees and provides a fair but challenging test for the best. The par 72 packs a punch at a 138/74 slope and course rating, while the picturesque Brooker Creek Preserve provides for a beautiful yet penal setting. The range of tee boxes are smartly positioned to allow golfers of every level to have success, from new player to seasoned vet, and offers semi private open to the public. The 17,000 square-foot Mediterranean style clubhouse provides an elegant and comfortable place to gather with members, friends, and family. Amenities include a dining room overlooking the first tee, a member/guest grill, a fully stocked pro shop, locker rooms and exercise facility. In addition, Crescent Oaks offers a first class tennis club perfect for a friendly or competitive match, offering your choice of red clay or hard courts. Crescent Oaks is a family-owned, Semi-Private Club located in Tarpon Springs, Florida. EMPLOYMENT APPLICATION DOWNLOAD APPLICATION Once you have completed your application please email it to our GM, Brady Deroo, at cogm@crescentoaksgolf.com Connect with Our Team General Manager cogm@crescentoaksgolf.com Director of Golf codir.of.golf@ crescentoaksgolf.com Event Sales sales@crescentoaksgolf.com Food & Bev Manager cofb.dir@crescentoaksgolf.com Office Manager coom@crescentoaksgolf.com Home The Course Leagues Membership Weddings and Events The Grille The Store Contact Menu Home The Course Leagues Membership Weddings and Events The Grille The Store Contact (727) 937-4653 Follow us on Social Facebook-f Instagram Pinterest COPYWRITE 2024 CRESCENT OAKS GOLF CLUB"
    },
    {
      "url": "https://theoaksgolf.co.uk/contact-us/",
      "text": "Contact Us - Oaks Golf Club Skip to content Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Menu Close Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE TIME MEMBERS PRIORITY TEE TIME Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us VISITORS TEE OFF TIME BOOKINGS MEMBERS LOGIN MEMBERS PRIORITY TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS VISITORS TEE OFF TIME BOOKINGS MEMBERS PRIORITY TEE OFF TIME BOOKINGS Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us Home Courses The 18-Hole Horley Course The 9-Hole Acorn Course Driving Range 24-Bay Trackman Technology Membership Visitors Green Fees Societies Members Safegolf Shop Pro Shop Gift Vouchers Club Fitting Club Repairs Golf Repairs Purchase golf vouchers Golf Lessons Our Golf Professionals Golf Coaching Gift Vouchers Events Function Suite Celebrations Funeral Receptions Weddings Conferences Cafe/Bar Contact Us GET IN TOUCH We are looking forward to hearing from you. You can contact us via the phone numbers listed below or through the contact form provided. Enquiry Type General Enquiry Events Society Δ How to find us… The Oaks Woodmansterne Road, carshalton,Surrey SM5 4AN CLICK AND SCROLL THE LIVE MAP BELOW SUBSCRIBE NOW Subscribe now to receive exclusive offers, forthcoming events and news via email Δ USEFUL LINKS Member's Login General Enquiries Membership Enquiries Visitors Golf Lessons Pro Shop Areas We Cover Blogs Opening Hours Shop hours- 7am-9pm Mon-Sun (stop serving 8:30pm) Driving Range Driving range hours- 9am-9pm Mon-Sun (stop serving 8:30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday COURSES 18-Hole Horley Course 9-Hole Acorn Course EVENTS Function Suite Weddings Funeral Receptions Celebrations Opening Hours Shop Monday  to Thursday - 8:00am to 9:00pm Saturday and Sunday - 8:00am to 7:00pm Driving Range Monday  to Friday  - 9am to 9pm (Last balls 8.30pm) Saturday & Sunday 9am to 7pm (Last balls 6.30pm) Cafe & Bar Monday to  Sunday - 8:00am to 9:00pm Friday and Saturday CONTACT US 020 8643 8363: General 020 8722 0238: Events 020 8722 0236: Cafe/ Bar info@theoaksgolf.co.uk Map-marker-alt CLOSE CLOSE CLOSE"
    },
    {
      "url": "https://crescentoaksgolf.com/the-course/",
      "text": "The Course - Crescent Oaks Golf Club Home The Course Leagues Membership Weddings and Events The Grille The Store Contact Menu Home The Course Leagues Membership Weddings and Events The Grille The Store Contact BOOK NOW THE COURSE TAKE A STROLL THROUGH OUR WOODS Few clubs in the Bay area match the beauty, challenge, and conditions here at Crescent Oaks. The course comes in at just under 6,800 yards from the back tees and is characterized by tall cypress lined tee-shots, hollow filled fairways, and firm greens. It begins with a uniquely challenging 1st tee, but soon opens up after you begin your trek through the preserve. As the course unfolds you’ll quickly realize that no two tee shots are alike, and often require the player to pick from decidedly different strategies. This allows players to attack the course consistently, while never being forced to play a game they don’t have. Players always have a safe route on each hole, and a more aggressive, but more rewarding, option also lies in wait to be discovered. PRACTICE FACILITY A fully revamped driving range, putting green, and pitching green welcomes you to come perfect your golf game Previous Next THE COURSE Previous Next THE SCORECARD Depending on which tee you play from, The Oaks can play radically different. It ranges from a fun but forgivable test at the whites, to a championship challenge from the back tees, simply by adjusting the angles and yardage. As a consequence, the strategy for each hole becomes more involved, and the stakes for failure raised. Learn About Membership Opportunities Name Email Phone Message Send Message 68368 (727) 937-4653 Address 3300 Crescent Oaks Blvd, Tarpon Springs, FL 34688 Email codir.of.golf@crescentoaksgolf.com Home The Course Leagues Membership Weddings and Events The Grille The Store Contact Menu Home The Course Leagues Membership Weddings and Events The Grille The Store Contact (727) 937-4653 Follow us on Social Facebook-f Instagram COPYWRITE 2024 CRESCENT OAKS GOLF CLUB"
    }
  ]
}