{
  "fuentes": [
    {
      "url": "https://www.crocencounters.com/animdonate.html",
      "email": "rescues@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/volunteer.html",
      "email": "volunteers@crocencounters.com"
    },
    {
      "url": "https://www.thecrocodile.com/contact",
      "email": "info@thecrocodile.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "camps@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "events@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "info@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "jpaner@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "karina@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "rescues@crocencounters.com"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "email": "volunteers@crocencounters.com"
    },
    {
      "url": "https://www.teamcroco.com/",
      "email": "vlad@teamcroco.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.crocencounters.com/croccamp.html",
      "email": "camps@crocencounters.com"
    },
    {
      "url": "https://www.fox13news.com/news/temple-terraces-coca-cola-gator-moved-to-a-new-home",
      "email": "fox13tampanews@foxtv.com"
    },
    {
      "url": "https://www.crocencounters.com/tcpp_events.html",
      "email": "events@crocencounters.com"
    },
    {
      "url": "https://crocs.pissedconsumer.com/customer-service.html",
      "email": "customerservice@crocs.com"
    }
  ],
  "mails": [
    "camps@crocencounters.com",
    "customerservice@crocs.com",
    "events@crocencounters.com",
    "fox13tampanews@foxtv.com",
    "info@crocencounters.com",
    "info@thecrocodile.com",
    "jpaner@crocencounters.com",
    "karina@crocencounters.com",
    "rescues@crocencounters.com",
    "sales@finewineliquors.com",
    "vlad@teamcroco.com",
    "volunteers@crocencounters.com"
  ],
  "nombre_sitio": "crocencounters.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.crocencounters.com/animdonate.html",
      "text": "Croc Encounters | Animal Donations Contact Map VISIT Guided Tours Tours for Groups Birthday Parties at Croc Encounters Private Parties Guidelines & Suggestions Printable Map Directions ABOUT History Mission & Goals Photo Gallery Sponsors & Affiliates Contact ANIMALS Reptiles Crocodilians American Alligator American Crocodile Broad-snouted Caiman Cuban Crocodile Cuvier's Dwarf Caiman Morelet's Crocodile Nile Crocodile Schneider's Dwarf Caiman Snakes Ball Python Boa Constrictor Coastal Carpet Python Corn Snake Dumeril's Boa Gopher Snake Jungle Carpet Python Lizards Asian Water Monitor Bearded Dragon Black & White Tegu Black Spiny-tailed Iguana European Glass Lizard Green Iguana Ornate Monitor Red Tegu Rhino Iguana Savannah Monitor Uromastyx Turtles & Tortoises African Side-neck Turtle Alligator Snapping Turtle Common Snapping Turtle Diamondback Terrapin Florida Box Turtle Florida Softshell Malaysian Box Turtle Painted Turtle Red Belly Red-eared Slider Red-footed Tortoise River Cooter Spotted Turtle Striped Mud Turtle Sulcata Tortoise Yellow Belly Yellow-footed Tortoise Amphibians Cuban Tree Frog Marine Toad Pac-man Frog Pixie Frog Animal Donations Nuisance Wildlife Removal EDUCATION Programs Amazing Reptiles Rainforest Reptiles Native Florida Wetlands Wonders Amazing Australia Region Specific Crocodilian Biology Venomous Snakes Croc Camp EVENTS Birthday Parties Alligator Wrestling Show Traveling Exhibits Corporate Events Picnics Promotions Public Speaking CONTRIBUTE Volunteer Volunteer Information Online Registration Form Volunteer Forms Donate Monetary Donations Material Donations Exhibit Sponsorship Adopt an Animal Croc Rescue - Introduction At Croc Encounters our policy is to accept any and all unwanted crocodilians from all over the country. Crocodilians are animals such as alligators and caiman, crocodiles, and gharials. These animals are our focus. We also take in other types of reptiles such as snakes, lizards, turtles and tortoises. We cannot, however guarantee that we will be able to accept these. No matter where the animal is located, there are a variety of easy and safe shipping options available. Once animals are placed with us, they become permanent residents of the sanctuary. They will not be sold or adopted out. They are cared for by our group of dedicated staff and volunteers. Rescued animals, depending on their temperament and size, may be used in educational programs at schools, camps and for other interested groups. Fill out this Animal Donate form if you wish to place an animal with the Sanctuary. Croc Encounters does not have permission to remove wild alligators without a permit from the state.  All wild alligator removal must go through the state first. Alligators that are truly a nuisance should be reported to the state nuisance alligator hotline (866-FWC-GATOR). Alligators play an important role in Floridaâs ecosystem. These are our top level predators. Having them here keeps the populations of other animals in check. If we do not feed wild alligators, they will not seek people out. They avoid humans and do not see us as a food source, unless they are fed. An alligator in a pond in your neighborhood is not a nuisance. However, an alligator that approaches people is. There is a difference. Because Croc Encounters is licensed by Florida Fish and Wildlife to keep and exhibit crocodilians, we are allowed to accept nuisance alligators from the trappers in the state. *Unfortunately most trappers will catch and destroy the animal, and sell its meat and skin. Nuisance alligators are not relocated! *The trapper does not get paid by the county or FWC, they rely on the product from the animal. So, please think twice before you contact the state. Being residents of Florida we must learn to live side by side with alligators and all the other wildlife native to our state. With Floridaâs growing population, there are less and less natural areas for these animals to live. We are encroaching on their habitat and there will inevitably be conflicts. These conflicts can be reduced if we treat these animals with the respect that they deserve. Respect means not attempting to handle or feed wild animals, but rather observing them from a safe distance and allowing them to go on their way. At Croc Encounters, we face questions from the public regarding their pets and alligators. Alligators typically prey on animals such as small mammals (raccoons, opossum, rodents, etc.), birds (ducks, herons, egrets, etc.), turtles, and fish. An animal the size of a small- medium sized dog or cat is appropriately sized for an alligator to consider a food source. It is not the alligators fault! The alligator is wild, dogs and cats are not. Please keep your animals indoors, in fenced yards or on a leash. Croc Encounters is a known shipper with Delta Airlines. We are able to ship alligators, and other reptiles using Delta Cargo. The animal must be placed in a shipping appropriate container, and dropped off at an airport that accepts Delta packages. Once you have contacted us, we would give you a variety of options of times and dates of flights and together we would choose a direct flight. One of our representatives would pick up the animal at the Tampa International Airport. You can find out if there is an airport near you that Delta flies into. We have had great success transporting animals through and we have never had an animal die in transport or suffer any health problems. It is a simple and, as long as your animal is packaged properly, a low stress way to move an animal. Croc Encounters will make the shipping arrangements, please contact us by e-mail at rescues@crocencounters.com Direct Pickup: Having our representatives directly pick-up your animal and transport it back to the sanctuary is an option. There may be costs associated with this, but depending on your location and ability to handle the animal, this may be the best choice. Drop-Off: If you are able to transport the animal directly to our facilities, we can arrange drop-off. You must contact us in order to schedule a time and date before coming to the sanctuary with your animal. Animals from outside of Florida may require special permits for transport into the state. We are not able to accept animals obtained from an illegal source. Other Shipping Options: There are a variety of other options available for animal shipment.  \nPlease contact us for further details e-mail at rescues@crocencounters.com The general rule of thumb when shipping a reptile is to restrict the amount of space that the animal has to move around. Alligators and Crocodiles For large animals (>4 feet long) make your crate out of wood. For smaller crocodilians, you may use a plastic box or tote. This box would need additional security in addition to whatever it comes with. We suggest drilling holes through the top to the lip of your tote and securing locks. Air holes should be minimal for either the wood or plastic box. Too many air holes could lower the temperature to dangerous levels inside your box! When shipping from cool climate locations in winter, include a hand warmer heating device. When shipping during the summer or when temperatures are greater than 75 degrees, include a cold pack. Do not place the heat or cold pack right next to the animal. Place them instead in a separate area of your shipping box. We do not suggest keeping the animalâs jaws taped or roped in transport. These things could easily become loose and work down towards the animalâs nostrils, causing suffocation. We also do not suggest taping or covering the animalâs eyes for the same reason. Legs may or may not be bound. Cushioning should also be provided for the animals to ease any bumps during transport. We suggest towels or crumpled newspaper. If transporting more than one animal per box, separate each animal inside of the transport box (i.e. place each animal in its own small box and place all the small boxes in the large transport box). Turtles and Tortoises These guys must be transported in boxes that are not much larger than the animal itself, and they should further be constrained with hay. We do not suggest newspaper or towels, in case the turtle tries to eat these materials. Plastic boxes or totes are suggested with small air holes. We do not suggest cardboard. Snakes and Lizards The best way to transport these animals, depending on their size is sacks or pillow cases. The sacked animals can be placed in a cardboard or plastic box with some filler (shredded newspaper or hay) Very large snakes and lizards are best transported in secured plastic boxes or totes. Make small holes in your box. DO Make small holes in your transport box Make your box only slightly larger than the animal Cushion the inside of your box with material (hay, shredded newspaper, etc.) Include a heating or cooling device depending on the time of year Contact us first to make travel arrangements Say âI am transporting this back to the home officeâ to the person at the Delta counter Allow at least 1 hour to handle things at the airport when dropping your animal off Clearly label your box âLIVE ANIMALSâ Include any permits/documentation For Alligators Include Two Copies of this Form DONâT Make holes in your box large (max size = diameter of pencil) Put food in with your animal Feed your animal for at least 2 weeks prior to shipment Bind or restrain the animal in the shipment box Include water in with the animal (even if it is an alligator) Croc Encounters is located at 8703 Bowles Rd., Tampa, FL 33637. Here we have primarily outdoor enclosures for a variety of reptiles. Rescued animals consist of turtles, tortoises, snakes, lizards, alligators and crocodiles. Animals of the same species are kept together whenever possible. When new animals come in to our sanctuary, we observe a quarantine period. During this time, they are kept separate from other sanctuary animals. Health assessments are completed when a new animal comes in, after its quarantine period and every 6 months thereafter. Croc Encounters currently houses many animals and that number grows all the time. We are constantly building new habitats to accommodate the animals. Please help with a monetary donation, sponsorship of an exhibit or by adopting an animal. Croc Encounters is a working agritourism facility focused on education and conservation efforts for crocodilians and other reptiles. Home | About Us | Contact Us | Donate | Volunteer © 2023 Croc Encounters   |  All rights reserved  |  Created by Jennifer Reed Book Now"
    },
    {
      "url": "https://www.crocencounters.com/volunteer.html",
      "text": "Croc Encounters | Volunteer Contact Map VISIT Guided Tours Tours for Groups Birthday Parties at Croc Encounters Private Parties Guidelines & Suggestions Printable Map Directions ABOUT History Mission & Goals Photo Gallery Sponsors & Affiliates Contact ANIMALS Reptiles Crocodilians American Alligator American Crocodile Broad-snouted Caiman Cuban Crocodile Cuvier's Dwarf Caiman Morelet's Crocodile Nile Crocodile Schneider's Dwarf Caiman Snakes Ball Python Boa Constrictor Coastal Carpet Python Corn Snake Dumeril's Boa Gopher Snake Jungle Carpet Python Lizards Asian Water Monitor Bearded Dragon Black & White Tegu Black Spiny-tailed Iguana European Glass Lizard Green Iguana Ornate Monitor Red Tegu Rhino Iguana Savannah Monitor Uromastyx Turtles & Tortoises African Side-neck Turtle Alligator Snapping Turtle Common Snapping Turtle Diamondback Terrapin Florida Box Turtle Florida Softshell Malaysian Box Turtle Painted Turtle Red Belly Red-eared Slider Red-footed Tortoise River Cooter Spotted Turtle Striped Mud Turtle Sulcata Tortoise Yellow Belly Yellow-footed Tortoise Amphibians Cuban Tree Frog Marine Toad Pac-man Frog Pixie Frog Animal Donations Nuisance Wildlife Removal EDUCATION Programs Amazing Reptiles Rainforest Reptiles Native Florida Wetlands Wonders Amazing Australia Region Specific Crocodilian Biology Venomous Snakes Croc Camp EVENTS Birthday Parties Alligator Wrestling Show Traveling Exhibits Corporate Events Picnics Promotions Public Speaking CONTRIBUTE Volunteer Volunteer Information Online Registration Form Volunteer Forms Donate Monetary Donations Material Donations Exhibit Sponsorship Adopt an Animal You can donate your time and help us with sanctuary work. Croc Encounters relies on volunteers for everything that we do. Volunteers help with care of animals, habitat construction, grounds-keeping and education programs/fundraising. What we seek in our volunteers is dependability, willingness to work hard and a desire to learn.  Volunteers must be at least 13 years of age to volunteer and able to work with minimal supervision.  Those under the age of 13 may work with a parent or guardian present.  We ask that you please be available to volunteer at least one day a week for a minimum of four hours. Please contact our volunteer services department at volunteers@crocencounters.com for more information and to start volunteering. Want to help out Croc Encounters? Register online to get started as a volunteer. Animal Care: Croc Encounters houses numerous animals, half of which are American Alligators. These animals need daily care including cleaning of habitats, preparation of food, enrichments, and training. Volunteers who have a minimum of 50 hours of volunteer time are invited to assist with animal care. Habitat Construction: With the constant influx of new animals, Croc Encounters is always under construction. Fence installation, concrete work, digging of ponds & painting, are a few of the tasks involved. Groundskeeping/Horticulture: In addition to the animals at Croc Encounters, the plants also need care. Grass must be trimmed, mulch pathways weeded, new plants watered and pruned, and fence lines cleared. This is an important part of keeping our park clean and attractive. Education Programs: Volunteers have the opportunity to observe and eventually take a lead teaching role in educational programming on and off-site. All programs include live animal encounters and are done for groups of all ages. They also have the opportunity to help with fundraising and other events. Print Volunteer Forms Please print and fill out these forms and hold onto them. Click here for the Volunteer Registration form , the Release from Liability form and the Media Release form. Croc Encounters is a working agritourism facility focused on education and conservation efforts for crocodilians and other reptiles. Home | About Us | Contact Us | Donate | Volunteer © 2023 Croc Encounters   |  All rights reserved  |  Created by Jennifer Reed Book Now"
    },
    {
      "url": "https://www.thecrocodile.com/contact",
      "text": "Contact — The Crocodile 0 Skip to Content The Crocodile Madame Lou's Here-After Hotel Crocodile Oodalalee - Concerts at pier 62 Show Schedule Oodalalee FAQ Merch EVENT CALENDAR Open Menu Close Menu The Crocodile Madame Lou's Here-After Hotel Crocodile Oodalalee - Concerts at pier 62 Show Schedule Oodalalee FAQ Merch EVENT CALENDAR Open Menu Close Menu The Crocodile Madame Lou's Here-After Hotel Crocodile Folder: Oodalalee - Concerts at pier 62 Back Show Schedule Oodalalee FAQ Merch EVENT CALENDAR Contact us. Use this form to contact The Crocodile. Here are a few tips for getting your email to the right department. Are you reaching out to play at The Croc? Make sure you put “Booking Request” in the subject  field. Lost item? Please put “Lost Item” in the subject field. Have some other question? Put a short description in the subject line. Wanna send us a funny joke? Put “marketing request” in the subject field. We’re the funny ones. info@thecrocodile.com 2505 1st Ave Seattle, Washington 98121 Name * First Name Last Name Email * Subject * Message * Thank you! Proudly celebrating 30 years of live music in Seattle. info@thecrocodile.com 2505 1st Ave Seattle, Washington 98121 © 2022 The Crocodile. All rights reserved. Home History Merch Private Events Venue Experiences Zine Contact FAQ Careers Land Acknowledgement Antiracism Statement Accessibility Code of Conduct Terms & Conditions Privacy Policy"
    },
    {
      "url": "https://www.crocencounters.com/contact.html",
      "text": "Croc Encounters | Contact Us Contact Map VISIT Guided Tours Tours for Groups Birthday Parties at Croc Encounters Private Parties Guidelines & Suggestions Printable Map Directions ABOUT History Mission & Goals Photo Gallery Sponsors & Affiliates Contact ANIMALS Reptiles Crocodilians American Alligator American Crocodile Broad-snouted Caiman Cuban Crocodile Cuvier's Dwarf Caiman Morelet's Crocodile Nile Crocodile Schneider's Dwarf Caiman Snakes Ball Python Boa Constrictor Coastal Carpet Python Corn Snake Dumeril's Boa Gopher Snake Jungle Carpet Python Lizards Asian Water Monitor Bearded Dragon Black & White Tegu Black Spiny-tailed Iguana European Glass Lizard Green Iguana Ornate Monitor Red Tegu Rhino Iguana Savannah Monitor Uromastyx Turtles & Tortoises African Side-neck Turtle Alligator Snapping Turtle Common Snapping Turtle Diamondback Terrapin Florida Box Turtle Florida Softshell Malaysian Box Turtle Painted Turtle Red Belly Red-eared Slider Red-footed Tortoise River Cooter Spotted Turtle Striped Mud Turtle Sulcata Tortoise Yellow Belly Yellow-footed Tortoise Amphibians Cuban Tree Frog Marine Toad Pac-man Frog Pixie Frog Animal Donations Nuisance Wildlife Removal EDUCATION Programs Amazing Reptiles Rainforest Reptiles Native Florida Wetlands Wonders Amazing Australia Region Specific Crocodilian Biology Venomous Snakes Croc Camp EVENTS Birthday Parties Alligator Wrestling Show Traveling Exhibits Corporate Events Picnics Promotions Public Speaking CONTRIBUTE Volunteer Volunteer Information Online Registration Form Volunteer Forms Donate Monetary Donations Material Donations Exhibit Sponsorship Adopt an Animal If you have any questions please feel free to contact us: Physical Address Croc Encounters Reptile Park and Wildlife Center entrance is located at: 8703 Bowles Rd. Tampa, FL 33637 This is the front address and does not receive mail. Click here for directions Telephone For all inquiries call 813-217-4400. Representatives are available seven days a week from 8 a.m. to 8 p.m. EST. Mailing Address All mail correspondence should be sent to: PO BOX 292862 Temple Terrace FL, 33687 General Information For general information about Croc Encounters email us at info@crocencounters.com or call 813-217-4400. Volunteer Opportunities If you are interested in volunteering at Croc Encounters click here for information, email volunteers@crocencounters.com or call 813-217-4400. Animal Placement Interested in placing an animal at Croc Encounters? Click here for information, email us at rescues@crocencounters.com or call 813-217-4400. Croc Camp Want your child to spend a week learning and helping out at Croc Encounters? Click here , email camps@crocencounters.com or call 813-217-4400 for information. Special Events Want to have your event at Croc Encounters or have us come to your party? Click here for general information about events, email us at events@crocencounters.com or call 813-217-4400. Croc Encounters is a working agritourism facility focused on education and conservation efforts for crocodilians and other reptiles. Home | About Us | Contact Us | Donate | Volunteer © 2023 Croc Encounters   |  All rights reserved  |  Created by Jennifer Reed Book Now"
    },
    {
      "url": "https://www.teamcroco.com/",
      "text": "Team CROCO | Conversion Rate Optimization Agency skip to Main Content For Agencies For Businesses Team Contact Client Login Open Mobile Menu Unlock the Power of Conversion Rate Optimization Optimize your path to success. Our Conversion Rate Optimization Agency is your gateway to higher ROI, increased conversion rates, and happier customers. Our CRO experts use data-driven strategies, A/B testing, and user-centric design to unlock the true potential of your digital presence. We try to make the world a better place and we believe that experimentation is the core of improvement. Free Quote About Us At Team CROCO we’re passionate about one thing: helping businesses succeed in the digital world. Our mission is simple: turn website visitors into loyal customers. We achieve this by leveraging data-driven strategies, A/B testing and user behavior analytics to enhance user experiences and boost conversion rates. We don’t just talk about results, we deliver them. Partner with us and experience the difference. Need a quote? Leave your information and we will \ncontact you shortly * * Message * Phone This field is for validation purposes and should be left unchanged. This iframe contains the logic required to handle Ajax powered Gravity Forms. Why Choose Us? Our data-centric approach ensures outcomes grounded in insights and drives incremental revenue. We specialize in turning visitors into loyal customers, maximizing your conversion rate. We craft strategies perfectly aligned with your goals for exceptional return of investment. Access full CRO solutions, including A/B testing and user behavior analytics, without breaking the bank. Our Services CONVERSION RATE OPTIMIZATION (CRO) At Team Croco, we delve into your analytics to uncover growth opportunities. Our approach includes meticulous data analysis, crafting customized roadmaps, and implementing high-quality development strategies. A/B TESTING Choose a budget-friendly plan that suits your requirements. Our team customizes A/B testing programs designed specifically for your business. CONVERSION RATE OPTIMIZATION AUDIT Want to know why you have so much traffic but not the conversions to match? Our team will conduct a thorough analysis of your platform’s data, providing you with a comprehensive report which you can use to boost revenue. LANDING PAGE OPTIMIZATION Your website is a powerful tool for converting visitors into qualified leads. We specialize in helping you convert more leads with highly effective and optimized landing pages. Searching for a CRO ally? Look no further! Get Free Quote Everything You Need With over 1500 tests run, we have tailored our plans to your needs. 2 Test/mo Single start-up fee $950 Full-service Guaranteed ROI* $1075 / test ($2150 / mo) Book Now 4 Test/mo FREE Audit included Full-service Guaranteed ROI* $1050 / test ($4200 / mo) Book Now Tailored We can fully tailor our team to your needs. Do you want 8 or more tests/mo done? Do you only need one expertise (like front-end development)? Just contact us! Book Now *If a positive ROI is not met within 6 months, we’ll continue testing free of charge until the ROI is positive (It is yet to be the case) What our clients have to say Working with Team Croco has speed up our test development and let's us focus on what we're good at: data, hypotheses and design. It's great to work closely with Team Croco as they're flexible in setting development priorities across our experiments and think along with valuable suggestions as they have a strong understanding of what we're trying to achieve with each test. Jorrin Quest, Sr. UX & Conversion Expert | Online Dialogue I'm always talking to my colleagues about what a great resource you guys are, so I might as well tell you you make my job so much easier. Prompt, clear and quick responses, reliable deliveries and just easy. It really makes such a big difference? Ida Kjelldahl Conversion Specialist | Outfox Team Croco has done a fantastic job building tests for us and have given us the flexibility to grow. We can rely on them to build reliable and robust tests on even the most complex pages. Their tests are always pixel-perfect with well structured and easy to understand code. I always know that Team Croco will build great tests and the team is a pleasure to work with. Dave Gowans Conversion Specialist | Browser to Buyer How an A/B test program can pay for itself within the first month This A/B testing thing was a breeze once we fixed a couple of Shopify-related issues with Google optimize. I was worried that the mockups of the site weren't going to look good, that they wouldn't load right, that there wouldn't be any sort of meaningful change.... One of the first tests we did came out great! It results in a 4.97% conversion lift which means $$$$ and the program paid for itself within the first month. Definitely glad I gave this a go. Allen Walton Founder | Spyguy.com No problems at all, it was super easy to install into the tool, the test performed great and was a big win for the client. Improved their email signup rate 70% and had 100% statistical significance. Was about as good a result as we could have expected. Overall I had a great experience working with you and your team and am excited to do it again soon. Mark Hoad Afterwire Does your company need an ally in its CRO efforts? Get Free Quote Defining a unique commercial strategy focused\non guaranteeing quality in all its processes and\nexceeding the expectations of our clients in the\nservices provided. Menu For Agencies For Businesses Team Contact Client Login Contact information vlad@teamcroco.com EU customers can call us at (+40)741130835 for US please dial 1-302-4871326 Social Media Copyright Team Croco 2022 | All Rights Reserved Privacy Notice Privacy & Cookies Policy This website uses cookies to improve your experience. By using this site, you agree to our use of cookies. Accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT Back To Top"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.crocencounters.com/croccamp.html",
      "text": "Croc Encounters | Croc Camp Contact Map VISIT Guided Tours Tours for Groups Birthday Parties at Croc Encounters Private Parties Guidelines & Suggestions Printable Map Directions ABOUT History Mission & Goals Photo Gallery Sponsors & Affiliates Contact ANIMALS Reptiles Crocodilians American Alligator American Crocodile Broad-snouted Caiman Cuban Crocodile Cuvier's Dwarf Caiman Morelet's Crocodile Nile Crocodile Schneider's Dwarf Caiman Snakes Ball Python Boa Constrictor Coastal Carpet Python Corn Snake Dumeril's Boa Gopher Snake Jungle Carpet Python Lizards Asian Water Monitor Bearded Dragon Black & White Tegu Black Spiny-tailed Iguana European Glass Lizard Green Iguana Ornate Monitor Red Tegu Rhino Iguana Savannah Monitor Uromastyx Turtles & Tortoises African Side-neck Turtle Alligator Snapping Turtle Common Snapping Turtle Diamondback Terrapin Florida Box Turtle Florida Softshell Malaysian Box Turtle Painted Turtle Red Belly Red-eared Slider Red-footed Tortoise River Cooter Spotted Turtle Striped Mud Turtle Sulcata Tortoise Yellow Belly Yellow-footed Tortoise Amphibians Cuban Tree Frog Marine Toad Pac-man Frog Pixie Frog Animal Donations Nuisance Wildlife Removal EDUCATION Programs Amazing Reptiles Rainforest Reptiles Native Florida Wetlands Wonders Amazing Australia Region Specific Crocodilian Biology Venomous Snakes Croc Camp EVENTS Birthday Parties Alligator Wrestling Show Traveling Exhibits Corporate Events Picnics Promotions Public Speaking CONTRIBUTE Volunteer Volunteer Information Online Registration Form Volunteer Forms Donate Monetary Donations Material Donations Exhibit Sponsorship Adopt an Animal Camp Dates: July 28âAug 1 Join us for a WILD WEEK! Are you looking for a unique and memorable experience for your child this summer? Select weeks during the summer, we are now offering a week long day camp at the sanctuary. Campers will actually get to take part in the day to day care of the animals as well as participate in fun and educational activities. We offer up-close, hands on activities and lessons that are sure to enthrall your child and keep them coming back year after year. Croc Camp Activities Include: Games Arts & Crafts Special Activities Animal Feedings Keeper Talks Animal Shows Fun & Educational Videos Outdoor Water Activities Hands-on Animal Encounters Guided Tours through the Sanctuary Behind the Scenes Experiences Grade levels: K-8. Cost: $295.00. Get Ready for a Wild Time! Please email camps@crocencounters.com or call 813-217-4400 to register. Animal Handling/Zookeeper Camp July 28âAugust 1 10amâ4pm *Additional weeks will be added as the camp fills up Croc Encounters is a working agritourism facility focused on education and conservation efforts for crocodilians and other reptiles. Home | About Us | Contact Us | Donate | Volunteer © 2023 Croc Encounters   |  All rights reserved  |  Created by Jennifer Reed Book Now"
    },
    {
      "url": "https://www.fox13news.com/news/temple-terraces-coca-cola-gator-moved-to-a-new-home",
      "text": "Temple Terrace’s ‘Coca-Cola’ gator moved to a new home | FOX 13 Tampa Bay News Weather Sports Good Day We Live Here Contests More Watch Live Expand / Collapse search ☰ Search site News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us Temple Terrace’s ‘Coca-Cola’ gator moved to a new home By Evyn Moon Published March 22, 2024 10:12pm EDT Hillsborough County FOX 13 News Share Copy Link Email Facebook Twitter LinkedIn Reddit ‘Coca-Cola’ gator moved to Tampa rescue Evyn Moon reports. TAMPA, Fla. - The alligator that had a Temple Terrace community fearing for its safety after a gaping hole appeared in a fence surrounding the pond where it lived has been relocated. ‘Coca-Cola’ now lives at ‘Croc Encounters’ rescue in Tampa. His life was likely saved by his former neighbors. \"We had several phone calls from people in the neighborhood asking what can we do. We told them that we’d be willing to take him, but it all has to go through the legal channels…They wanted him not to be killed… so I guess things worked out for him,\" said John Paner, with Croc Encounters. His new owners say his new life may start with a new diet and possibly a new name - ‘Diet Coke’. 'Coca-Cola' has a new home at Croc Encounters in Tampa. \"He’s very overweight. He’s got to slim down. It's unhealthy. I think he was getting food from the community… maybe hams… a few too many. The alligators get used to people, it makes the alligator very dangerous.\" Croc Encounters in Tampa rescues dozens of alligators, and provides tours where guests can see, and even feed the gators too. As for Coca-Cola, he’s lying back in his new swamp digs. SIGN UP: Click here to sign up for the FOX 13 daily newsletter WATCH FOX 13 NEWS Hillsborough County Alligators Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . Trending Millions could lose SNAP benefits as stricter rules take effect PETA offers reward after dog abandoned 'like trash' on side of Hillsborough County road Suni Bell murder: Trial of 5 suspects in 4-year-old girl's shooting death begins Gibbs High School has the tallest wide receiver recruit in the country Potential Rays owner considering HCC as stadium site Latest headlines Charlie Kirk shooting: Law enforcement asking for tips; search underway for gunman Cross Bay Ferry making a comeback after PSTA grant Colorado school shooting: Evergreen student shoots two others before himself, officials say Charlie Kirk shooting: What we know about the suspected gunman Armed suspect who shot at deputies found dead after barricading inside Manatee County home News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 13 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://www.crocencounters.com/tcpp_events.html",
      "text": "Croc Encounters | Traveling Exhibits, Corporate Events, Picnics, & Promotions Contact Map VISIT Guided Tours Tours for Groups Birthday Parties at Croc Encounters Private Parties Guidelines & Suggestions Printable Map Directions ABOUT History Mission & Goals Photo Gallery Sponsors & Affiliates Contact ANIMALS Reptiles Crocodilians American Alligator American Crocodile Broad-snouted Caiman Cuban Crocodile Cuvier's Dwarf Caiman Morelet's Crocodile Nile Crocodile Schneider's Dwarf Caiman Snakes Ball Python Boa Constrictor Coastal Carpet Python Corn Snake Dumeril's Boa Gopher Snake Jungle Carpet Python Lizards Asian Water Monitor Bearded Dragon Black & White Tegu Black Spiny-tailed Iguana European Glass Lizard Green Iguana Ornate Monitor Red Tegu Rhino Iguana Savannah Monitor Uromastyx Turtles & Tortoises African Side-neck Turtle Alligator Snapping Turtle Common Snapping Turtle Diamondback Terrapin Florida Box Turtle Florida Softshell Malaysian Box Turtle Painted Turtle Red Belly Red-eared Slider Red-footed Tortoise River Cooter Spotted Turtle Striped Mud Turtle Sulcata Tortoise Yellow Belly Yellow-footed Tortoise Amphibians Cuban Tree Frog Marine Toad Pac-man Frog Pixie Frog Animal Donations Nuisance Wildlife Removal EDUCATION Programs Amazing Reptiles Rainforest Reptiles Native Florida Wetlands Wonders Amazing Australia Region Specific Crocodilian Biology Venomous Snakes Croc Camp EVENTS Birthday Parties Alligator Wrestling Show Traveling Exhibits Corporate Events Picnics Promotions Public Speaking CONTRIBUTE Volunteer Volunteer Information Online Registration Form Volunteer Forms Donate Monetary Donations Material Donations Exhibit Sponsorship Adopt an Animal If you are looking for a unique twist to add to your event, Croc Encounters could be just the thing. Animals add a point of interest for children and adults alike. We are available to bring reptiles to indoor and outdoor events including: Corporate Events, Company Picnics, Family Reunions, Promotional Events, Grand Openings, Festivals and even Weddings! Pricing for events is dependent on the number of animals requested, whether we do a program in addition and on the number of hours we are there. Please call 813-217-4400 or email events@crocencounters.com for pricing. Croc Encounters offers temporary traveling exhibits to most locations in the United States. Our traveling exhibits have been featured at private parties, reptile shows, schools and colleges, museums, zoos and corporate events. Exhibits can be tailored to fit specific regions, budgets or time slots. Options: Alligator Handling/Wrestling Show â 7â8 foot Alligator is safely housed behind a large display cage. Basic handling shows occur repeatedly throughout the event. Photo Booth â photo opportunities holding various animals in front of a decorated backdrop Table Top Displays â several small to medium sized enclosures feature various smaller animals like lizards, snakes and amphibians. Large Alligator Display â Large portable cage allows for public display. Photo opportunities are available with taped alligators. Zoo Exhibits â animals are included that follow a general theme along with informative signage. An example is a crocodilian display featuring several species of crocodilians. And Much More! At your next corporate event, why not create a memorable experience for your attendees while also showing your companyâs care for wildlife and conservation?\n\nRare and exotic animals are always attention grabbers for adults and children alike. Our presence at your event can be as big or small as you decide.\n\nWe can simply provide the table and/or tent, animals and ourselves for answers to questions, or we can do a complete presentation as well. Call or email us to schedule your event. Add something different to your next family reunion, graduation, and neighborhood or just anytime picnic. With Croc Encounters, you can create a fun, exciting yet also educational experience for all.\n  \n  You can determine our involvement in your event. We can either display with the animals or do an animal presentation as well. Call or email us to schedule your event. Rare and exotic reptiles are attention grabbers! If you have an event and you want to attract more people, having an animal there may just spark their interest.\n\nCroc Encounters is available for events such as grand openings, festivals, sales and even weddings! For hotel owners, having Croc Encounters in your lobby is certain to give your guests something to remember. Croc Encounters is a working agritourism facility focused on education and conservation efforts for crocodilians and other reptiles. Home | About Us | Contact Us | Donate | Volunteer © 2023 Croc Encounters   |  All rights reserved  |  Created by Jennifer Reed Book Now"
    },
    {
      "url": "https://crocs.pissedconsumer.com/customer-service.html",
      "text": "Crocs Customer Service Phone Number (866) 306-3179, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Footwear and Clothing Crocs 138 Customer Service Updated on 08/11/2025 Contact Crocs Customer Service Reviews 0 Contacts Community Advertisements Crocs Phone Numbers and Emails Toll-Free Number: (866) 306-3179 Call customer service Crocs Email: customerservice@crocs.com Is this your business? Advertisements Crocs Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Crocs Customer Service is rated at 1.4 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 74% phone 26% email The best phone number to call Crocs is 8663063179 . 38% of customers managed to speak with a real person. The average hold time is from 3 to 5 minutes . The longest wait times are on Monday , while the shortest are on Sunday . The average call time is 6 minutes . Be prepared for the call as Crocs may ask you for the following information to identify you as a customer: order id or tracking no, first and last name or email . View full overview › Crocs Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Crocs Customer Service is rated at 1.4 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 74% phone 26% email The best phone number to call Crocs is 8663063179 . 38% of customers managed to speak with a real person. The average hold time is from 3 to 5 minutes . The longest wait times are on Monday , while the shortest are on Sunday . The average call time is 6 minutes . Be prepared for the call as Crocs may ask you for the following information to identify you as a customer: order id or tracking no, first and last name or email . People call Crocs mainly because of return/ replace, product/ service, shipping and delivery . 12% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel very satisfied after talking to customer service representatives. The best email to contact Crocs is customerservice@crocs.com . Customers evaluated the effort they needed to make to contact customer service as neither easy nor difficult . Close How to Contact Crocs? Most Popular Number: (866) 306-3179 Total calls: 659 Issues resolved: 31 Last call: Sep 6, 2025 Rebecca A. Garland PissedConsumer Reporter What Is The Crocs Customer Service Phone Number? If you require assistance or have inquiries related to Crocs products, orders, and other matters, contact Crocs customer service through a phone call. The Crocs number explicitly for customer service issues is 1-866-306-3179. This contact method of getting Crocs customer support serves as your means of addressing any questions, concerns, or problems regarding Crocs' products and services. Crocs takes pride in its dedication to customer satisfaction, so expect a helpful and professional response when contacting the customer service team. Whether your needs involve obtaining product information, resolving issues, or offering feedback, the Crocs customer support team is available to assist, aiming to ensure a positive and satisfying experience with their brand. How Can I Contact Crocs Customer Support Via Live Chat? Unfortunately, the company does not currently provide a live chat feature for Crocs customer service. While the Crocs live chat is unavailable, contact the support team by using their provided phone number, 1-866-306-3179. The mentioned Crocs support phone number can be used to communicate your inquiries, concerns, or compliments that you might have with Crocs. Additionally, customers also have the option to send written correspondence to the Crocs corporate office at 13601 Via Varra, Broomfield, CO 80020, USA. Although Crocs customer service chat is not an available option at the time, Crocs is committed to ensuring that customers have accessible support through other convenient Crocs customer support channels to assist with their needs. How To Contact Crocs Support Via Email Address? Contacting Crocs support via email customerservice@crocs.com is a user-friendly and efficient method to connect with their customer service team. Whether you have questions about specific Crocs products, need assistance with an order, or want to provide feedback, the Crocs email serves as a direct line of communication. The Crocs customer service email is known for its responsiveness and helpfulness, so expect timely and informative responses to your inquiries. Plus, the Crocs email is a convenient option, allowing customers to get assistance from Crocs experts without needing a phone call or chat, making it ideal for those who prefer written communication or have busy schedules. What Are Crocs Customer Care Business Hours? Crocs customer care operates with varying Crocs customer service hours during the week. The Crocs customer service team commences at 9 AM ET on Mondays and provides round-the-clock assistance from Tuesday through Thursday, ensuring uninterrupted customer assistance. Similarly, on Fridays, the Crocs customer support stops working at 5 PM ET. However, note that the Crocs support team is unavailable on Saturdays and Sundays, allowing their team to rest and rejuvenate for the following week. These Crocs customer service hours offer customers ample opportunities to reach out for assistance, ask questions, or address concerns during weekdays, guaranteeing that their needs are attended to promptly and effectively. Contact Information Crocs Website: www.crocs.com Crocs Help Center: Visit contact page Corporate Office Address: Crocs Retail, LLC. 13601 Via Varra Broomfield, Colorado 80020 United States Help in Social Networks: Facebook Pinterest Instagram Twitter Linkedin Youtube Other Info (opening hours): Working Hours: Mon - Thurs 24 Hours Fri Closes at 5 PM ET Sat - Sun CLOSED More contact details Crocs Rating Based on 63 Reviews Rating details 1.8 more details Customer service Delivery Service Advertised vs Delivered Discounts and Special Offers Rating Details Customer service Delivery Service Advertised vs Delivered Discounts and Special Offers Exchange, Refund and Cancellation Policy Product or Service Quality Website Value for money Warranty Diversity of Products or Services Price Affordability Location Close All 138 Crocs reviews Rating stats Rating trend How Good is Crocs's Customer Service? Vicki Kdr Vicki Kdr Feels Satisfied | May 03, 2024 The phone number was not easy to find and the wait time was rather long. The guy was a little snotty but he fixed the issue. Read full quote Bryn Jzv Bryn Jzv Feels Disappointed | Jan 17, 2024 Disgusting Read full quote Priscilla S Fxe Priscilla S Fxe Feels Disappointed | Dec 05, 2023 The obers service sucked and I wa role that crocs bought them put soon wanted to see if I caping beg some help to get my moneu Read full quote Maxime Boa Maxime Boa Feels Disappointed | Sep 30, 2023 Annoying Read full quote Natalyah Lsx Natalyah Lsx Feels Disappointed | May 06, 2023 Awful Read full quote Shireen Olk Shireen Olk Feels Satisfied | May 04, 2023 Very pleased Read full quote Summary of Crocs Customer Service Calls 682 TOTAL CALLS 06:20 AVG CALL DURATION 12% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Crocs? Shipping and Delivery Question: 1M ago “Have not received refund and it’s been four weeks” 9M ago “Shoe says delivered but it was not” 9M ago “Didn’t receive package” Return/ Replace Question: 1Y ago “Need order number for return” 1Y ago “Issue with returning the order” 1Y ago “I need to exchange the size” Product/ Service Question: 1M ago “Problem with an order” 1Y ago “Broken geometric flip” 1Y ago “2nd pair of fav sandals broke want replacement” Request for Information Question: 2M ago “Can I just exchange my items for a smaller size?” 4M ago “Order status not received” 8M ago “To check on my order” Refund Question: 4d ago “Refund not received yet” 1Y ago “No refund initiated” 1Y ago “Not get refund” Activation/ Cancellation Question: 1M ago “Cancelar orden creada por error” 1Y ago “I bought some hey dudes and the offer got cancelled by them not me and they say they gave me a refund but myNaval will tell you it isn’t there but I can get anybody to help me” 1Y ago “Cancel on my order” Payments and Charges Question: 1Y ago “Discount” 1Y ago “Order won't give me my discount” 1Y ago “Charged my card for $32 for some sandals and Crocs canceled the order and did not put the money back” Account Question: 8M ago “Trying to use 25% off code” 2Y ago “I didn't know where to put my 15% off code and I already placed my order” 2Y ago “Funds Did not reach my account” Cards Question: 3Y ago “Crocs is saying that my Visa card is not supported” 3Y ago “Fraudulent activity on my card” Staff Question: 3Y ago “Crocs literide service” 5Y ago “Horrible services” Website/ Application Question: 2Y ago “Website not adding the 5 gibbits for free” Employment Question: 5Y ago “Payroll” Other Question: 2M ago “Ise un pedido no enviaron número de horden eso quiero saber” 8M ago “Resend one order number” 8M ago “Order statis” Compare Crocs Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Upstep Customer Service Rack Room Shoes Customer Service 1.4 out of 5 Hey Dude Shoes Customer Service Write a review Do you have something to say about Crocs? What happened? What can we help you with? Submit review Don't show this popup Call Company Ask a Question Crocs Reviews Contacts Community Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Crocs contact page? Contact Crocs Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    }
  ]
}