{
  "fuentes": [
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "angieh@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "benk@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "benl@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "bradyv@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "cassidyb@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "darreng@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "debbieg@ligthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "dvollmer@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "elijahs@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "hollyr@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "jeffg@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "jeremys@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "jimb@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "joelb@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "johnp@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "jont@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "julieh@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "keithe@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "keithg@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "kentw@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "lorens@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "lukeu@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "masonw@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "mattg@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "mattk@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "micaelam@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "normw@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "ptharp@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "quinnr@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "ruthm@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "shelbis@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "trevorv@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "email": "zacs@lighthousegmc.com"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "carlos@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "catherine@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "contact@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "danielle@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "david@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "diana@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "josiah@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "kate@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "molly@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "nate@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "sierra@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "email": "steph@lighthouseholyoke.org"
    },
    {
      "url": "https://www.lighthousetrailsresearch.com/contactus.htm",
      "email": "comments@lighthousetrails.com"
    },
    {
      "url": "https://www.lighthousetrailsresearch.com/contactus.htm",
      "email": "david@lighthousetrails.com"
    },
    {
      "url": "https://www.lighthousetrailsresearch.com/contactus.htm",
      "email": "deb@lighthousetrails.com"
    },
    {
      "url": "https://www.lighthousetrailsresearch.com/contactus.htm",
      "email": "editors@lighthousetrails.com"
    }
  ],
  "mails": [
    "angieh@lighthousegmc.com",
    "benk@lighthousegmc.com",
    "benl@lighthousegmc.com",
    "bradyv@lighthousegmc.com",
    "carlos@lighthouseholyoke.org",
    "cassidyb@lighthousegmc.com",
    "catherine@lighthouseholyoke.org",
    "comments@lighthousetrails.com",
    "contact@lighthouseholyoke.org",
    "danielle@lighthouseholyoke.org",
    "darreng@lighthousegmc.com",
    "david@lighthouseholyoke.org",
    "david@lighthousetrails.com",
    "deb@lighthousetrails.com",
    "debbieg@ligthousegmc.com",
    "diana@lighthouseholyoke.org",
    "dvollmer@lighthousegmc.com",
    "editors@lighthousetrails.com",
    "elijahs@lighthousegmc.com",
    "flags@2x.png",
    "hollyr@lighthousegmc.com",
    "jeffg@lighthousegmc.com",
    "jeremys@lighthousegmc.com",
    "jimb@lighthousegmc.com",
    "joelb@lighthousegmc.com",
    "johnp@lighthousegmc.com",
    "jont@lighthousegmc.com",
    "josiah@lighthouseholyoke.org",
    "julieh@lighthousegmc.com",
    "kate@lighthouseholyoke.org",
    "keithe@lighthousegmc.com",
    "keithg@lighthousegmc.com",
    "kentw@lighthousegmc.com",
    "lorens@lighthousegmc.com",
    "lukeu@lighthousegmc.com",
    "masonw@lighthousegmc.com",
    "mattg@lighthousegmc.com",
    "mattk@lighthousegmc.com",
    "micaelam@lighthousegmc.com",
    "molly@lighthouseholyoke.org",
    "nate@lighthouseholyoke.org",
    "normw@lighthousegmc.com",
    "ptharp@lighthousegmc.com",
    "quinnr@lighthousegmc.com",
    "ruthm@lighthousegmc.com",
    "shelbis@lighthousegmc.com",
    "sierra@lighthouseholyoke.org",
    "steph@lighthouseholyoke.org",
    "trevorv@lighthousegmc.com",
    "zacs@lighthousegmc.com"
  ],
  "nombre_sitio": "crookedriverlighthouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lighthousegmc.com/staff.aspx",
      "text": "Lighthouse Buick GMC Staff | Morton Buick, GMC dealer in Morton IL Lighthouse Buick GMC Sales 877-209-6257 Service 877-881-7861 Parts 309-266-1919 100 W Jackson St Morton, IL 61550 Service Map Contact Saved Saved Lighthouse Buick GMC Saved Call 877-209-6257 Directions New New Vehicles Shop New Buick Shop New GMC Courtesy Loaners Model Research Trade Your Vehicle Super Cruise Request Financing GM Rewards Auto Loan Savings Program Order a Vehicle Pre-Owned Pre-owned Vehicles Used Cars Used Trucks Used SUVs Used Vans Vehicles Under 15k Trade Your Vehicle Request Financing EV Research EV Research Shop all EV Sierra EV Specials New Specials Used Specials Service Loaner Specials Service & Parts Specials Special Offers Services Schedule Service Service Department Fleet Service Car Detailing Service & Parts Specials Tire Basics Order Parts Online GMC Accessories Buick Accessories Maintenance Schedule Everest Lifts Everest Lifted Trucks Everest Truck Inventory Customize Your Truck Everest Performance Our Process Everest Gallery Collision Collision Center Precise Collision Care Paintless Dent Repair Hail Damage About Us Lighthouse Values Meet Our Team Top 100 Dealer Join Our Team Our Reviews Our Blog Home New New Vehicles Shop New Buick Shop New GMC Courtesy Loaners Model Research Trade Your Vehicle Super Cruise Request Financing GM Rewards Auto Loan Savings Program Order a Vehicle Pre-Owned Pre-owned Vehicles Used Cars Used Trucks Used SUVs Used Vans Vehicles Under 15k Trade Your Vehicle Request Financing EV Research EV Research Shop all EV Sierra EV Specials New Specials Used Specials Service Loaner Specials Service & Parts Specials Special Offers Services Schedule Service Service Department Fleet Service Car Detailing Service & Parts Specials Tire Basics Order Parts Online GMC Accessories Buick Accessories Maintenance Schedule Everest Lifts Everest Lifted Trucks Everest Truck Inventory Customize Your Truck Everest Performance Our Process Everest Gallery Collision Collision Center Precise Collision Care Paintless Dent Repair Hail Damage About Us Lighthouse Values Meet Our Team Top 100 Dealer Join Our Team Our Reviews Our Blog Get Your $7,500 Tax Credit on EVs Before Time Runs Out! Days Hours Minutes Seconds Meet Our Team Meet Our Team Department Ownership Sales Department Customer Experience Service Department Fleet Service Department Collision Department Parts Department Finance Department Accounting/Administration Ownership Jeff Grimm President Jeff Grimm joined the Lighthouse team in 1996. He got his start in the car business working the parts department at Bob Grimm Chevrolet. He then spent the next several years selling cars before managing the Bob Grimm Chevrolet Truck Center. In 1991, he became president and dealer operator. Five years later Jeff made the transition to Lighthouse Buick GMC. He lives in the country between Goodfield and Congerville with the love of his life Ruth. Together they have four children, three daughters in-law, one son in-law and seventeen grandchildren. In addition to being dealer/operator at Lighthouse Buick GMC Jeff was called into the ministry in 1996 and served his church for 29 years. As his ministry took on a heavier leadership position, much time was taken away from the day-to-day operations of the dealership. This led him to rely on the commendable skills of the management team in keeping the dealership operating at its full potential. He has recently retired from pulpit ministry but continues to look for ways to love and serve others in ways that will glorify God and help further His kingdom. In his free time Jeff enjoys spending time with Ruth. Some activities they enjoy are riding bikes, snowmobiling, skiing, boating, car cruises, and being with his family. Jeff and Ruth also have a cabin in the Northwoods of Wisconsin where they love to spend time in awe of Gods beautiful creation. envelope jeffg@lighthousegmc.com Bart Rinkenberger General Manager Bart Rinkenberger joined the Lighthouse team in 1997. Before working at Lighthouse, Bart attended ICC and the University of Illinois, where he graduated with a degree in Finance and Accounting. He started his business career by owning a lawn mowing business with his brother. Bart lives in Morton with his wife, Janell (an Indiana farm girl). They have five children: Carson (US Marine) (Wife – Shelby), Quinn, Kade, Cole and Jada. In his free time, Bart enjoys hanging out with his family, running, and reading. Bart has served as President of We Care (a transportation service provider), President of Morton Rotary Club, President of Morton Midwest Food Bank, & Secretary of the Morton School Board. He is a member of Summit Point Church, Peoria. Although Bart enjoys sports, he has learned that Jesus Christ is the person that deserves his full attention. The Fighting Illini and Chicago Cubs get 2nd place. His very favorite thing in the world is Sunday morning worship at church, a small taste of Heaven on Earth. A unique fact about Bart - He has run 18 marathons, including Boston. envelope bart@lighthousegmc.com Keith Grimm Fixed Operations Director Keith Grimm joined the Lighthouse team in 2007. Prior to this, he worked at Rocke Brothers Masonry, for 2 years, as a laborer. Hard work, good fun! Keith lives in Congerville with his wife and three daughters, Perri, Violet, Vivian, and Valor (born Nov 2017, Nov 2019, May 2022). In his free time, Keith enjoys spending time with his family, traveling, teaching Sunday School, playing basketball, tennis, running, mountain biking, backyard football, baseball, softball, pickleball, golfing, snowmobiling, cross country skiing, hockey, water skiing, boating, grilling and chilling. envelope keithg@lighthousegmc.com Matt Grimm Sales Manager / Finance Manager Matt Grimm joined the Lighthouse team in 2009. Before joining Lighthouse, Matt was a laborer at Rocke Bros. Masonry. He and his wife Hannah, have a daughter Adelaide, and 2 sons, Palmer and Haldon. In his free time, Matt enjoys grilling with family and friends, water and snow skiing, softball, and pretty much anything else outdoors. One of his favorite pastimes is getting involved with church activities, specifically a quartet group called “Glorify Hymn.” Along with that, the guitar is Matt’s instrument of choice when singing gospel songs with friends and family. When Matt is not at work, you will find him spending time with his best friend in the whole world, Hannah. When the weather is nice, they love biking, hiking, and camping. A fun fact about Matt is that he went water skiing in Wisconsin when there was still ice on part of the lake. He says it was worth braving the cold water to get the calm water. envelope mattg@lighthousegmc.com phone (309) 696-6441 Name Title Sales Department Kent Wiegand General Sales Manager Kent Wiegand joined the Lighthouse team in April 2015. He was raised on a farm where his Dad and Mom taught him to work and to take responsibility in life. After school, he spent 12 years in logistics. Ten of those years was at Nussbaum Transportation where he learned a lot about customer service and leadership. Kent and his wife Lanae live in Goodfield with their son Reilly and their daughter Sarina. Before moving to Goodfield, he served on the Congerville Fire Department as a fire fighter and EMT for 9 years, becoming assistant chief and training officer. He has served as a minister in his church since 2017. In his free time, Kent enjoys being with his family specifically doing outdoor activities such as hiking, biking, running, grilling out and taking trips together. Kent and his family enjoy baseball and their favorite MLB team is the St. Louis Cardinals. A fun fact about Kent is that he doesn’t have a middle name. envelope kentw@lighthousegmc.com phone (309) 445-0400 Norm Wiegand Sales Manager Norm Wiegand became part of the Lighthouse team in 2008. Prior to this, he was top salesman at another dealership and a sales master for 8 consecutive years. He also won the State FFA Placement in Ag award as a senior in High School, and ran a small swine breeding stock farm. Norm lives in Goodfield, IL with his wife Stephanie, who he has been married to for over 20 years. He has 4 children - Micaela (& Tommy), Karissa (& Alan), Cassidy (& Kallon), and Brock. Norm is blessed with 4 grandchildren. In his free time, Norm enjoys being a dad and grandpa, jogging, and taking care of his home. Alongside his hobbies, he enjoys watching the Dallas Cowboys and the St. Louis Cardinals. envelope normw@lighthousegmc.com phone (309) 444-0454 Matt Grimm Sales Manager / Finance Manager Matt Grimm joined the Lighthouse team in 2009. Before joining Lighthouse, Matt was a laborer at Rocke Bros. Masonry. He and his wife Hannah, have a daughter Adelaide, and 2 sons, Palmer and Haldon. In his free time, Matt enjoys grilling with family and friends, water and snow skiing, softball, and pretty much anything else outdoors. One of his favorite pastimes is getting involved with church activities, specifically with the high school students in the youth program. Along with that, the guitar is Matt’s instrument of choice when singing gospel songs with friends and family. When Matt is not at work, you will find him spending time with his best friend in the whole world, Hannah. When the weather is nice, they love biking, hiking, and camping. A fun fact about Matt is that he went water skiing in Wisconsin when there was still ice on part of the lake. He says it was worth braving the cold water to get the calm water. envelope mattg@lighthousegmc.com phone (309) 696-6441 Keith Edelman Sales Manager Keith Edelman joined the Lighthouse team in 1999. Before joining Lighthouse, Keith worked as a service technician, sales manager, and was an owner/partner of Rieger Motors in Forrest, IL, from 1979-1999. He lives in rural Congerville with his wife Nadine and they have six children: Ashley (Bob) Schieler, Arlen (Marissa), Kyla (Colin) Knapp, Kristen (Kurt) Cottrell, Tara (Jesse) Leman, and Tamra (Tate) Wyss. They also have fourteen wonderful grandchildren! In his free time, Keith enjoys spending time with family and friends, fishing, hunting, swimming, and walks with his wife. Keith has been a Sunday school/ youth group leader for 20 years. He has also served on the Eureka school board for 8 years. A fun fact about Keith: He has eight brothers and one sister. All his brothers’ initials are K.J.E. envelope keithe@lighthousegmc.com phone (309) 370-6300 Name Title Trevor Vaughan Sales Manager Trevor Vaughan joined the Lighthouse team in May of 2014. Before joining Lighthouse, Trevor had served customers for over 8 years at Running Central and several other retail establishments. He also helped lead a running training program where runners worked to achieve success at distances ranging from 5K up to the marathon. Trevor lives in Morton with his wife, Abby, and 4 children, Kinsley, Kamden, Kendall, and Khloe. Trevor enjoys running, basketball, dirt car racing, and spending time being a husband and dad. He is also actively involved in serving at Summit Point Church and helps lead an Impact Group. A fun fact about Trevor is that he solved the riddle of “How many licks does it take to get to the center of a Tootsie Pop?” But you’ll have to ask him for the answer. envelope trevorv@lighthousegmc.com phone (309) 370-1548 Quinn Rinkenberger Sales Manager Quinn joined the Lighthouse team in November of 2018. Before joining Lighthouse, Quinn delivered newspapers for the Morton Courier for 2 years. He lives in Morton with his wife, Casey. When he has free time, he enjoys spending time with Casey, working outside, and being with family and friends. Outside of work, he attends Summit Point Church, where he loves to help the Production Team. He is a Chicago Cubs fan, Baylor Bears fan, and Fighting Illini fan! envelope quinnr@lighthousegmc.com phone (309) 966-6688 Dan Vollmer Sales & Leasing Consultant Dan Vollmer joined the Lighthouse team in 2019. Dan lives in Congerville with his family- his wife Laura, twin girls Addison and Natalie, and his son Matthew. When he’s not at work he enjoys traveling with his family, riding four wheelers, shooting clays and playing or watching sports. Go Cardinals! He loves playing outside with his children, especially giving his kids rides on the lawnmower. Outside of Lighthouse, he helps the production team at Summit Point Church. envelope dvollmer@lighthousegmc.com phone (309) 712-6346 Joel Brown Sales & Leasing Consultant Joel started at Lighthouse in June 2019. He resides in Mackinaw, IL with his wife Sarah and their 2 dogs Kevin & Minni, along with their 2 cats, Tina & Pete. When he’s not working, you can find Joel hunting, fishing, or pulling antique tractors. He loves doing these things and spending his time with his family and friends. Joel is a St. Louis Cardinals Fan and has been a Seattle Seahawks fan since 1993. envelope joelb@lighthousegmc.com phone (309) 241-1273 Name Title Brady Vannaken Sales & Leasing Consultant Brady joined the Lighthouse team in 2018. He’s from Delavan. In his free time, he enjoys coaching basketball and spending time with his friends and family. Brady volunteers some of his time on the Delavan Fire Department. He’s a big sports guy - Celtics, Cardinals, and Steelers fan. A unique fact about Brady is that he saved a stray cat that he found hiding in one of our cars here on the lot! envelope bradyv@lighthousegmc.com phone (309) 613-3138 John Pirelli Sales & Leasing Consultant ohn joined the Lighthouse team in 2022. Before coming to Lighthouse, his greatest accomplishment was finishing his Masters in Business Administration! He lives in Groveland and is getting married soon to his fiance, Alli. John also has a handsome little golden retriever, Enzo! In his free time, he enjoys playing music and playing sports! He has been a member of The First Baptist Church of Morton his entire life and has been serving on the worship team every Sunday for over a decade! His favorite sports teams are the Chicago White Sox, Chicago Blackhawks and of course - DA BEARS! \"The Bears will win Super Bowl 59 & Super Bowl 60! You heard it here first!\" envelope johnp@lighthousegmc.com phone (309) 642-0590 Philip Tharp Sales & Leasing Consultant Philip joined the Lighthouse team in 2023. Before coming to Lighthouse, Philip lived near Chattanooga, TN for 10 years before moving back to Central IL in 2017. He spent 6+ years working in the construction industry, where most of those years he worked for Pivotal Basement Solutions with his father repairing home foundations in Central Illinois. Philip got married in June of 2024 to his beautiful wife Marisa! In his free time, he enjoys golfing when the weather permits. Otherwise, he enjoys cooking and spending time with Marisa! Philip loves leading worship at church as well! He attends Summit Point Church where he has lead Jr. High kids for 5+ years. Philip is a born and raised Pittsburgh Steelers Football fan and you can find him on a fall Sunday rooting for them! He also has a passion for music and has written and produced a couple of his own songs! Philip is excited about Jesus and sharing the hope that he brings! envelope ptharp@lighthousegmc.com phone (309) 256-5577 Holly Merdian Sales & Leasing Consultant Holly joined the Lighthouse Team in 2023 and brings a fresh energy to everything she does. With a background in the automotive industry since 2021, Holly’s passion for creating genuine connections shines through in her work. She's driven by the belief that great customer service isn’t just a transaction, it’s about creating \"Customers For Life.\" When she’s not helping clients, you might find Holly on walks with her husband and their lovable Goldendoodle, Hunny, as well as exploring new destinations—especially Germany! She’s excited to meet you and continue building lasting relationships and making a positive impact at Lighthouse! envelope hollyr@lighthousegmc.com phone 3096134421 Text Me 3096134421 Name Title Ben Leech Sales & Leasing Consultant Ben joined the Lighthouse team in 2024. Prior to working at Lighthouse, he owned a Fish and Chips restaurant in England. Ben lives in north Peoria with his wife, Alexa, soon to be born daughter, Willow, and Mini Bernedoodle, Rinsey. In his free time, he likes to golf, do anything outdoors, and play board games and try new coffee shops with his wife. Ben attends Northwoods Church. His favorite sports team is the Liverpool Football Club, but he loves watching and playing all other sports as well! An interesting fact about Ben is that he is from Cornwall, England, studied abroad in Sydney, Australia, and is now a permanent resident of the USA! envelope benl@lighthousegmc.com Jeremy Short Sales & Leasing Consultant Jeremy Short joined the Lighthouse team in 2025. Right out of college, he was a young adult/youth pastor for 13 years. After that, he worked at Precision Planting for 16 years and then came to Lighthouse! He grew up in Ohio but moved to Morton and lives there with his amazing wife, Michelle. They have 3 children – Charis & Nick, Elli & Jacob, and Sox. He is the proud grandpa of his first grandson, Jude! In his free time, he loves volunteering as an usher at Summit Point Church, spending time with his family, being outdoors hunting & fishing, or campfires with his wife. He’s on the Morton Chamber Board of Directors and a member of the Morton Rotary! Growing up in Ohio, Jeremy is a die-hard Ohio State Football fan. Go buckeyes! He’s also a Detroit Tigers fan. A fun fact – Jeremy was the voice of the Morton Potter Soccer team for many years as his kids grew up! envelope jeremys@lighthousegmc.com phone 3096487811 John Haeffele Sales Support John joined the Lighthouse team in 2018. John has had quite the story and has had the opportunity to share his story on radio and at prisons, prison ministry workshops, and churches all throughout Illinois! He was also the keynote speaker for the Christian Library International’s Advance the Lighthouse Dinners in Atlanta, GA, Raleigh, and Charlotte, NC. John lives in East Peoria with his wife, Julie, and they have 2 adult sons - Nick and Jon, who is married to Megan. Some things you might not know about John is that he is the author of the book “Therefore I Have Hope”, founder of The Prodigal One ministry, and also writes a weekly blog, “Beyond the Pigs”. Sabrina Zeller Sales Assistant Sabrina joined the Lighthouse team in 2019. She worked at CVS as a Pharmacy Tech before coming to Lighthouse. Her and her husband Cole live right here in Morton where they like to watch movies together! Sabrina likes to read and study her bible when she’s not watching movies with Cole or working. She likes the San Francisco 49ers mostly because that’s Cole’s team and she thinks the red and gold look cool :) A true fan! Name Title Savannah Wiegand Sales Assistant Kamden Aberle Sales Assistant Kamden joined the Lighthouse team in 2022. Before he came to Lighthouse, he worked at Legacy and used equipment. Kamden lives in Morton and enjoys hanging out with friends and being a part of the track team in his free time! A unique fact about Kamden is that he is actually from Kansas! Zach Martin Vehicle Display & Photography Manager Name Title Customer Experience Elijah Surratt Marketing Director Elijah joined the Lighthouse team in 2021. Previously, he has worked as a Website Administrator, and as a Product and Research Analyst for a global learning organization. In his free time, he enjoys reading God's word and volunteering in church events. Elijah worships at Summit Point Church and serves as a member of the production team! envelope elijahs@lighthousegmc.com phone (309) 819-8322 Micaela McGuire Marketing Manager Micaela joined the Lighthouse team in 2016. While she was working at Lighthouse, she attended Olivet Nazarene University and graduated with a Marketing Management degree. Micaela lives in Goodfield with her cute little family. In her free time, Micaela enjoys working in the garden, spending time with family, and going for a run or working out. She attends Summit Point Church in East Peoria. Micaela loves watching track meets and her favorite team is obviously team USA, but her favorite runner is Sydney McLaughlin. A fun fact about Micaela is that she ran the 100M High Hurdles and the 400M Low Hurdle for Olivet Nazarene University! envelope micaelam@lighthousegmc.com Luke Urban Marketing Assistant envelope lukeu@lighthousegmc.com Ruth Moser Customer Experience Manager Ruth joined the Lighthouse team in 2020. Ruth has an interesting history full of delicious foods.. She was a Pastry Chef before coming to Lighthouse and even worked in Saas- Fee Switzerland for a ski season! She lives in Eureka now with her husband, Sam, and her 2 boys, Ethan & Wyatt. In her free time, she enjoys cooking, reading, and gardening. Her favorite sport is watching Figure Skating! Something most people don’t know about Ruth is that she comes from a family where she has 7 brothers and 2 sisters! envelope ruthm@lighthousegmc.com Name Title Angie Hartman Customer Experience Manager Angie joined the Lighthouse team in 2020. Her career highlight before Lighthouse was making friends with the UPS drivers at the warehouse! She lives in Carlock with her two roommates. Angie has 5 siblings, 4 in-laws, 5 nieces, and 4 nephews, along with 3 honorary siblings and 1 honorary nephew! In her free time, Angie enjoys being outside in any and every kind of weather! She likes to play sports rather than watch them, and enjoys a relaxing golf match on a Sunday afternoon. An interesting fact about Angie is that during a golf match, she once convinced a girl that she was Scottish and that day they played 9 holes! envelope angieh@lighthousegmc.com Cassidy Bosworth Customer Experience Manager Cassidy joined the Lighthouse team in 2023. Prior to working at Lighthouse, she worked at Faire Coffee, Mika’s Bistro, and Zimmerman Enterprises. Cassidy lives in Eureka with her husband Kallon, her cat Mist, and her dog Ranger. In her free time she enjoys baking and spending time with her family. envelope cassidyb@lighthousegmc.com Julie Haeffele Customer Experience Manager envelope julieh@lighthousegmc.com Name Title Service Department Keith Grimm Fixed Operations Director Keith Grimm joined the Lighthouse team in 2007. Prior to this, he worked at Rocke Brothers Masonry, for 2 years, as a laborer. Hard work, good fun! Keith lives in Congerville with his wife and three daughters, Perri, Violet, Vivian, and Valor (born Nov 2017, Nov 2019, May 2022). In his free time, Keith enjoys spending time with his family, traveling, teaching Sunday School, playing basketball, tennis, running, mountain biking, backyard football, baseball, softball, pickleball, golfing, snowmobiling, cross country skiing, hockey, water skiing, boating, grilling and chilling. envelope keithg@lighthousegmc.com Loren Schock Service Director Loren Schock joined the Lighthouse team in 2012. Before joining Lighthouse, he farmed with his dad and poured concrete at Lonewolf Concrete for 3 years. He lives in the Mackinaw River Valley with his wife Darcy and three daughters, Kina, Renly, and Nyah. Darcy is a homemaker as well as a book designer and author and she takes care of their 3 wonderful and super cute daughters. In his free time, Loren will be growing fruit trees, planting flowers, fishing, or hiking. Loren’s favorite team is the St Louis Cardinals, “simply because they are not the Cubs and they like to WIN!!” envelope lorens@lighthousegmc.com phone (309) 202-2519 Matt Kimmey Assistant Service Manager Matt joined the Lighthouse team in 2014. Previously, Matt worked at Grossinger Motors in Bloomington. He was born and raised in the Morton area. When he isn’t working, he enjoys going to car shows and detailing his car. He also loves playing board games and cooking with his wife. An fun fact about Matt is that he became an ASE Certified Service Consultant in 2021! Jaxon Rieke Assistant Service Manager Jaxon joined the Lighthouse team in 2022. Before coming to Lighthouse he was a collegiate athlete at Illinois College, worked in landscaping at Legacy Lawn + Landscapes, and helped coach track at Eureka High School. He lives in Eureka and enjoys golfing, working out, gaming, and being at their family’s property. Jaxon enjoys watching golf and the olympics - Team Callaway and Team USA especially! A fun fact about Jaxon is that he is Deuteranopia Colorblind. Name Title Michael Walker Service Advisor Mike Walker joined the Lighthouse team in 2006. Prior to this, he worked in retail management at Ethan Allen. Mike is a lifelong resident of Morton, IL with his wife Michelle. Michelle is a cook at Rogys daycare. They have two daughters, Brittany and Shannon who are both ISU graduates and are married to the best son-in-laws! Mike has been blessed with 2 grandbabies- Isla and Rowen! He also has a dog and a cat. In Mike’s free time, he enjoys working in his yard and on his classic car. He also enjoys reading books. In Mike’s community, he is a Habitat for Humanity volunteer. Lighthouse Larry Service Advisor This Automotive Service Excellence (ASE) Certified Service Advisor enjoys listening to and then working with you in solving your automotive service needs almost as much as your non-auto needs too! Your vehicle is one of your largest life expenditures, so let’s efficiently and effectively work it into the fabric of your life. As we do that please share what else is on your mind. Richard Dunn Service Advisor Richard joined the Lighthouse team in 2022. Before coming to Lighthouse, he had created quite a resume in the trucking industry! Since 1997 he has been a janitor, Mechanic, Leadman, Foreman, Service Writer, and Fleet Maintenance Manager. Richard’s first job was milking cows on a farm. He lives in Eureka with his wife, Teresa! He has a daughter, Olivia, and 2 dachshunds. In Richard’s free time, he enjoys hunting, fishing, and raising his daughter! A funny fact about Richard is that the first time he took his wife fishing, he accidentally threw the pole into the water… and it was his daughter’s Barbie pole! Hopefully the fishing has improved since then! Dylan Knobloch Service Advisor Dylan joined the Lighthouse team in 2022. He lives in Marquette Heights with his wife, Marissa, their dog, Ivy, and their cat, Henry. Dylan enjoys golfing when he’s not here working and serving you! Name Title Cooper Keech Service Advisor Cooper joined the Lighthouse team in 2022. He lives in Morton. Cooper enjoys watching sports in his free time and his favorite team is the Chicago Bulls! Cole Schaefer Service Advisor Cole joined the Lighthouse team in 2020. He currently lives in Morton with his mom, dad, brother, and pup! Cole enjoys playing baseball and spending time with friends and family when he’s not at work or school. He is a big fan of the Yankees baseball team because when he was 3 years old, he got a Derek Jeter jersey. That made an impression on him to be a Yankees fan! Cole also roots for the Iowa Hawkeyes. Elijah Snyder Service Advisor Greg Hillman Warranty Manager Greg joined the Lighthouse team on Nov 24, 2014 after having worked for Cat Logistics for 10 years prior! Greg lives in Tremont with his wife (Dawn), their 2 boys (Maverick and Dawson), and their 2 dogs (Courage and Cocoa). In his free time, Greg enjoys doing woodworking and carpentry and attending Tremont Baptist Church. Name Title Jim McGuire Facilities Director Kalli McDonald Loaner Manager / Service Greeter Manager Kalli joined the Lighthouse team in 2023. Prior to working at Lighthouse, she had many jobs including landscape designer, irrigation service, driving a semi, underground cable installation, substitute teacher, graphic design, and photography! Kalli lives in Goodfield with her husband, Chris, and has three kids, Conner, Holly, and John. In her free time, Kalli enjoys reading, gardening, boating with family, and watching her kids play the sports they love. For the last 15 years, she has volunteered for the Eureka Football team doing graphics and photographing their games. Kalli loves sports and cheers for any team her kids play for, but she especially loves college football and volleyball, and watching wrestling of all levels. A unique fact about Kalli is that she has her CDL! Andrew Pilcher Service Greeter Andy joined the Lighthouse team in 2020. He has a diverse background in Automotive, Cellular Communication, and Medical Device industries, developing an extensive resume before finding a place at Lighthouse! He dedicated 23 years to selling spinal implants, spending countless hours in the O.R. helping nursing staff and surgeons restore and/or improve the quality of life for these patients. Being an avid automobile enthusiast paired with his automotive technology education, he was driven to Lighthouse! He’s originally from Peoria but resides with his family in Morton now. His wife, Stacie, is the kitchen manager at Morton HIgh School, his 3 daughters, 2 son-in-laws, and 2 grandsons, along with 2 dogs, make up the Pilcher family! Jessie, his oldest daughter lives in West Peoria with their family that is soon to be 5! Sara and Jake recently moved to St. Louis and the youngest daughter, Lily is studying Business at MTSU in TN. Andy enjoys spending time with the family and meeting up with Stacie’s family once a week. Andy and his wife attend Summit Point Church and he is a member of the Production team, running the soundboard on Wednesday nights for the Wednesday night teams. Andy is a big sports fan, especially in following, IMSA, Indy car, and Formula 1. Something most people don’t know about Andy is that he has always liked station wagons over SUV’s or sedans. He hopes to snag a nice Buick TourX Wagon if Lighthouse has one traded in at some point! Greg Vander Vennet Service Greeter Gregory Vander Vennet joined the Lighthouse team in 2014. Previously, Greg worked as a service manager for Kmart, Western Auto, Suds Mercedes-Benz, assistant manager for Finish Line Ford, and is considered a semi-pro actor! He lives in Peoria and has three children Matthew, Megan, and Stephen. Matthew is the director of Annual Giving at Central Methodist University, Megan is a teacher at Kindercare Rockford, and Stephen is a part of the United States Air Force. In his free time, Greg enjoys working on and driving classic cars, playing music, singing, playing in the church band, camping, hiking, and reading. Greg is involved with the BSA-Scoutmaster, Peoria Players Theatre, Cornstock Theatre, St. Thomas Church Band and St. Marks Church Band. Greg roots for the St. Louis Cardinals and has been a Green Bay Packer fan since the 60's. Something unique about Greg, he starred as \"Tom Brady\" in The Showdown, a major independent film in 2009. He also acted in a local Christian film and did voiceover work for Out of the Heart. To add to his list of acting experience, Greg also performs comedy routines at work and performs in the Lighthouse Triplet with Dirk Musselman and Brandon Lynxwiler. Name Title Brent Pflederer Service Greeter Dave Key Service Greeter Dave joined the Lighthouse team in 2022. Before coming to Lighthouse, Dave has done a lot - Graduated from Eastern Illinois University in 1984, worked at DP Consultants in Tremont for 5 years, and worked at State Farm Insurance for 30 years! We’re glad he’s decided to come work with us now. He lives in Morton, IL with his wife of 34 years and their dog named Lucy. Dave has 2 older children. He enjoys watching all sports in his free time and he and his wife recently joined Grace Presbytarian Church in Peoria where they spend their off-time as well! Dave loves all Chicago sports teams, the ILLINI, and Duke Basketball. Jeff Johnson Service Greeter Mary Ann Day Service Greeter Mary Ann joined the Lighthouse team in 2023. She lives in Delavan with her daughter Beth. In her free time, Mary Ann enjoys going to watch her daughter rodeo! Name Title Izzy Weir Service Greeter Izzy joined the Lighthouse team in 2023. Before coming to Lighthouse, she played 5 sports– golf, volleyball, basketball, softball, and track! Izzy lives in Mackinaw. In her free time, she likes to swim at Heritage Lake and play sand volleyball. Izzy’s favorite sports teams are the St. Louis Cardinals and the Pittsburgh Steelers. Kelly Schulze Service Greeter Kelly began working at Lighthouse in 2008. Before this he was a meat cutter for 36 years, owner/operator of Kelly Photography for 24 years, and a Lighthouse Service Advisor for 13 years. Kelly lives in East Peoria with his wife, Hope. He also has seven children Derek, Jana, Samantha, Ryan, twins Mark and Garrett, and Eli. Kelly also has eight grandchildren! In his free time Kelly enjoys bike riding and reading his Bible. Robert Boston Service Greeter Robert joined the Lighthouse team in 2023. Prior to working at Lighthouse, he owned Gauger Motors in Tremont for 45 years. Robert lives in Tremont with his wife, Sandy, and has 2 sons, Russell (Holly), Jameson (Hannah), and a daughter, Rachel (Jason). In his free time, Robert likes to ride his motorcycle and bicycle, and hike. Robert has been involved with the Tremont Fire Department for 35 years, the Tremont District Library for 10 years, and Summit Point Church for 7 years. His favorite sports teams are the Packers, Bears, and the Cardinals. A Unique fact about Robert is that he builds model and RC cars! Kay Curley Service Greeter Kay joined the Lighthouse team in 2024. Prior to working at Lighthouse, she was an RN at Carle Health and worked at Methodist and Proctor hospitals for 39 years. Kay lives in Goodfield with her husband, Tim, and has 2 kids Jay (Caitlyn) and Jenna (Jake), and 5 grandkids, Bo, Brice, Audrey, Wyatt, and Clara. She also has a chocolate lab and 2 beagles! In her free time, Kay enjoys gardening, decorating, flower arranging, and spending time with her grandkids. She attends Eureka Bible Church. Kay also loves boating and watching her grandkids’ sporting events. An interesting fact about Kay is that before she and her husband started a family, they enjoyed riding their Harley and Honda motorcycles! Name Title Jason McClain Service Greeter Holly McDonald Service Greeter Brady Bowker Service Greeter Dylan Emlen Service Greeter Name Title Julie Killpatrick Service Greeter Carl Niemeier Service Greeter Jerry Lorentzen Service Greeter Isaac Schaefer Service Greeter Name Title Culley Vanlaechken ASE Master Certified Shop Foreman Logan Dietrich Shop Foreman Logan joined the Lighthouse team in 2018. He lives in rural Carlock with his wife Kierstyn and his 2 daughters, Brenley and Kimber. He enjoys his time with family and hunting waterfowl. He also builds diesel trucks on his off-time. Tyler Schick GM World Class Technician Tyler joined the Lighthouse team in 2006. He’s an interesting guy, but you’d have to actually talk to him about it because he really doesn’t like to share these type of things with just anyone! All I can tell you is that he lives in a home, his family is loved, he enjoys sleeping in his free time, and doesn’t have time for hobbies! You’ll have to come meet him to find out the details :) Travis Stuber ASE Master Certified Service Technician Travis joined the Lighthouse team in 1998. We are blessed to have Travis as a part of the Lighthouse family. He has been a service technician for us and has gotten the training to now be an ASE Master Certified Service Technician. Name Title Shawn Pumphrey ASE Master Certified Service Technician Shawn joined the Lighthouse team in October of 2017. He worked for GM dealers all the way from Illinois to Arkansas and finally landed his forever home at Lighthouse! He drives 65 miles each way to and from work and he would drive 100 each way because “working at a place like this is worth the drive”. Dana Blunier ASE Master Certified Everest Technician Dana Blunier joined the Lighthouse team in 2013. Prior to this, he poured concrete and worked in shipping at FedEx. Dana lives in Eureka, IL, with his brother Andy. He has two dogs, Dixie and Harly. He also considers his 1987 Trans Am as part of the family. In his free time, during the summer, he mostly goes boating every weekend. His favorite sports include Motocross and Supercross, however, he occasionally watches auto racing, rallycross, and NHRA drag racing. A unique fact about Dana: He bought his first car, a 1991 Firebird, when he was 14 years old. Collin Sydney ASE Master Certified Service Technician Collin Sydney joined the Lighthouse team in 2011. Before joining Lighthouse, he was a paper carrier. Collin has a German Shepherd dog named Mia. In his free time, Collin enjoys riding motorcycles and playing guitar. Collin is also a volunteer fireman for the Delavan Fire Dept. Collin doesn’t have a favorite sports team, but he enjoys any sort of racing sports. A fun fact about Collin: He is the third generation in his family to own his own house. Steve Eitenmiller Service Technician Name Title Greg Getz Service Technician Greg joined the Lighthouse team in December of 2018. The highlight of his career before starting at Lighthouse is that he had never lost a 10mm socket! He lives in a farmhouse with his wife Kelli and his Beagle named Roy. He is an avid fan of the Wichita Wingnuts. Something unique about Greg is that he is the founding member and only member of the Spin Lake Yacht Club. Memberships are open! Justin Brokaw Service Technician Justin joined the Lighthouse team in November of 2018. Before coming to Lighthouse, Justin worked at Arby’s for 11 ½ years- serving as a manager for 9 ½ of those years. He grew up in Morton but now lives in Marquette Heights. Justin will root for any MLB team that is not playing against the Cardinals (even the Cubs!!) but his favorite sports team is the Cardinals. Tim Gossman Service Technician Tim joined the Lighthouse team in 2023. We’re so glad to have him because he has been an ASE Master Technician since 1987! He brings a lot of experience and expertise to the Lighthouse service lane. Tim lives in Tremont with his wife Michelle and their dogs Murphy and Banner. Their son Nick is in the Navy. In his free time, Tim enjoy snowmobiling and boating in northern Wisconsin! Bryan Collett Service Technician an joined the Lighthouse team in 2023. Prior to joining Lighthouse, Bryan enjoyed serving the Morton Community from his own shop, Collett’s Automotive, for 31 years! He’s excited about this new venue at Lighthouse and the opportunity to continue to serve his existing customers and make new ones. Bryan lives on a windy hill outside of town here with his wife Debi. They’re been married for 31 years and counting and raised 2 adult sons and have 2 large fur babies. In his free time, Bryan enjoys fishing and camping. He has had the honor of leading a remarkable team of Search & Rescue volunteers affiliated with the Tazewell County Emergency Management Agency in his spare time as well! Bryan isn’t all interested in sports, but he does love throwing balls for his dog. That definitely counts as a sport! Name Title Austin Lasley Service Technician Seth Turner Service Technician Andrew Zeithammer Service Technician Jon Henderson Service Technician Jon joined the Lighthouse team in 2023. He lives in Washington and has 2 daughters, Hailey and Sarah. When Jon has free time, he enjoys spending time with his family! His favorite sports teams are the Pittsburgh Steelers, St. Louis Cardinals, and the Fighting Illini. Name Title Justin Carter Service Technician Peyton Fritzler Service Technician Grace Persich Service Technician Jacob Trew Service Technician Name Title Josh Seidl Service Technician Josh Robinson Service Technician Gaige Mclin Service Technician Thomas Traynor Service Technician Name Title Luke Minchew Technician Apprentice Cody Hughes Technician Apprentice Trenton Kinder Technician Apprentice Asa Nighswonger Technician Apprentice Name Title Owen Beccue Technician Apprentice Josiah Riggenbach Technician Apprentice Gabe Abaca Technician Apprentice Jason Vettore Detail Manager Jason Vettore started his Lighthouse career in 2001. Prior to this, Jason was a Detail manager at Pioneer Park Mitsubishi. Jason is currently living in Pekin, IL with his beautiful wife, Jordyn, and his three children- Bradley, his oldest son, and Madeyn and Hayden, his two beautiful little girls. Jason and his family also have a dog named Chole and a cat named Bella. In his free time, Jason loves being outside, and hanging out with his wife and kids. Alongside spending time with his family, Jason loves sports, most of all football. His favorite team is the Bears. An interesting fact about Jason, he has been in the car business for over 17 years and has cleaned thousands upon thousands of cars, and he is pretty sure he could clean them in his sleep! Name Title Enrique Zamora Detail Technician Enrique Zamora joined the Lighthouse team in December 2014. Before joining Lighthouse, he worked for Nestle. Enrique and his wife Mireya live in Peoria, IL. They have two children, Jorge and Enrique Jr. In his free time, Enrique enjoys landscaping. His favorite sport is soccer, specifically the Mexican league. Dustin Brake Detail Technician Cole Rinkenberger Detail Technician Cole joined the Lighthouse team in 2022. He lives in Groveland, IL with his family. In his free time, he enjoys playing sports and hanging out with his friends. Tyler Lundquist Detail Technician Name Title Kevin Saunders Detail Technician Kevin joined the Lighthouse team in 2021. Before coming to Lighthouse he worked at the Forge Steakhouse! Kevin enjoys playing basketball and played for Morton’s team. He enjoys watching the Chicago sports teams - Bears and Bulls. Kevin lives in Morton and has 6 siblings - he gets to work with 2 of his brothers here at Lighthouse! Something that you might not know about Kevin is that he shares a birthday with his oldest sister! David Lindberg Detail Technician David joined the Lighthouse team in October 2022. Before coming here, he worked for Kroger as a store manager for 45 years. He retired in November 2021! David lives in Morton with his wife Janet, their daughter Danielle, and their 2 cats CJ and Shadow. In his free time, you can find him fishing, detailing cars, and going to car shows / cruise ins. He volunteers as a Board of Directors for KEMBA Credit Union. His favorite sports team is Alabama Football - Roll Tide! Josiah Tharp Detail Technician Brayden Skinner Detail Technician Brayden joined the Lighthouse team in 2023. Prior to working at Lighthouse, he did flooring for many people. Brayden lives in Washington and has three dogs–all pitbulls– and one little brother. In his free time, Brayden enjoys playing basketball or working out. His favorite teams are the Green Bay Packers and the New York Yankees. A unique fact about Brayden is that he once broke his finger from a basketball! Name Title Gage Stoller Detail Technician Caleb Saunders Detail Technician Gideon Snyder Detail Technician Name Title Fleet Service Department Matt Kimmey Assistant Service Manager Matt joined the Lighthouse team in 2014. Previously, Matt worked at Grossinger Motors in Bloomington. He was born and raised in the Morton area. When he isn’t working, he enjoys going to car shows and detailing his car. He also loves playing board games and cooking with his wife. An fun fact about Matt is that he became an ASE Certified Service Consultant in 2021! envelope mattk@lighthousegmc.com phone 3098198339 Zac Schuster Fleet Service Advisor Zac joined the Lighthouse team in November of 2016. He is a graduate of the GM ASEP program and was a mechanic for us until he moved into Parts. In March of 2022, he moved to the new Body Shop where he's managing things currently! He lives in Washington with his wife, Chloe, and their 2 kids- Alaina and Emery. In his free time he loves spending his time with his family! envelope zacs@lighthousegmc.com phone 3098198339 Andrew Zeithammer Service Technician Shawn Pumphrey ASE Master Certified Service Technician Shawn joined the Lighthouse team in October of 2017. He worked for GM dealers all the way from Illinois to Arkansas and finally landed his forever home at Lighthouse! He drives 65 miles each way to and from work and he would drive 100 each way because “working at a place like this is worth the drive”. Name Title Luke Minchew Technician Apprentice Owen Beccue Technician Apprentice Name Title Collision Department Caleb Oswald Body Shop Manager Caleb Oswald began at Lighthouse in early 2018. Before that, he graduated Lincoln Tech, in Indianapolis IN with his certificate in Collision Repair and was a painter for 5 years. Caleb, his wife Jenna, and their two kids, Rozalynn, and Brooks live in Morton and enjoy going on walks, and being in the outdoors in their free time. He also enjoys riding his motorcycle. Caleb and his family attend Grace Church here in Morton. Eric McCloud Production Manager Eric joined the Lighthouse team in 2023. Prior to working at Lighthouse, he spent his entire working career within the collision industry and a small time working in manufacturing. Eric lives in Hanna City on a small homestead with his wife Stephanie, and his children Shyan, Layla, and Lincoln. In his free time, Eric enjoys mountain biking and attending his children’s sports events. He likes to support the Peoria Area Mountain Bike Association (P.A.M.B.A.). Eric also enjoys any motorsports, softball, and baseball. Riley Herman Estimator Chris Nighswonger Customer Experience Manager Chris joined the Lighthouse team in 2024. Prior to working at Lighthouse, he worked 16 years at OSF Pointcore where he was an equipment coordinator, helping meet patient’s special needs. Chris lives in rural Spring Bay with his wife, Casey, and has two boys, Asa and Logan. In his free time, he enjoys watching his sons’ sporting events, spending time outside gardening and hunting, and fellowshipping with neighbors during campfires. Chris is involved with the First United Methodist Church A/V team in Peoria. His favorite sports teams are the Bradley Braves, Chicago Cubs, and any Hendrick Racing team member! Name Title Eric Johnston Body Shop Technician Eric Johnston joined the Lighthouse team in 2013. Prior to this, he was a machinist for thirteen years. Eric lives in Morton and has a son, Dillon, who plays sports and is an honor role student at Metamora High School. In his free time Eric enjoys spending time with friends and family. Eric attends Harvest Bible Chapel and attends a men's impact group as well. A funny fact about Eric, he loves singing at work but thinks he has a terrible voice. \"My coworkers love it...I think,\" he adds! Garrett Sander Body Shop Technician arrett joined the Lighthouse team in 2022. He worked at Farm and Fleet for 2.5 years before joining our Lighthouse team. Garrett lives in Morton, IL and is the oldest sibling, with a younger sister, Annie, and a younger Brother, Levi. They also have a dog named Molly and a gecko named Trump! Garrett enjoys hunting, fishing, and hanging with friends during his time off. He also volunteers for clean up and tear down of the Morton Pumpkin Festival every year! Garrett is a fan of the Chicago Bears, Cubs, and Blackhawks! Something you might not know about Garrett is that he has 2 blown-out knees! Will Zeller Body Shop Technician/Estimator/Painter Will joined the Lighthouse team in 2022. He has been in the autobody business for 40 + years! He lives in East Peoria with his wife, Dannelle. He has 3 children - Dane, Cole, and Cody - all who have worked or are currently working here at Lighthouse! In his free time, Will is playing around in his garage with some little projects. He also spends time at church activities, being with his kids and grandkids, and all of the grandkids’ sports! Will is still a die hard Chicago Bears fan!! Caleb Wright Body Shop Technician Caleb joined the Lighthouse team in 2021. Before he came to Lighthouse, he was a member of the Firestone Complete Auto Care team as a service writer and 91B U.S. Army. We appreciate his service! He lives in Pekin with his wife and their 3 Pitbulls - Bear, Sophie, and Charlie. In his free time he sums it up like this - Shooting pool, shooting guns, lifting weights. He’s a part of the Army Reserves. A funny fact about Caleb is that he drives a prius?! Name Title Trevor Sauder Body Shop Technician Trevor joined the Lighthouse team in 2022. Before coming to Lighthouse, he was a laborer for Masonry. He lives in Tremont with his family and Trevor enjoys hunting, fishing, and being outdoors! Andy Kucginski Body Shop Technician Andy joined the Lighthouse team in 2022. Before he came to Lighthouse, he was a Paint & Autobody Technician. We’re glad to have his expertise here! He lives in Peoria, IL and has a daughter, son-in-law, a grandson, and a granddaughter! In his free time, he enjoys a lot of things like golf, home improvement, biking, dirt bike riding, playing guitar, singing, and reading God’s word. He serves at his church, Northwoods, in their Alpha Ministry, prayer team, and worship team! For sports, he likes to follow Dustin Johnson (he rocks!) in golf and all drag racing. Andy is especially interested in drag racing because he loves the technical aspect with the crazy speeds! Something you might not know about Andy is that he is a bit goofy! Feto Arsllani Body Shop Technician Feto joined the Lighthouse team in 2024. Prior to working at Lighthouse, he earned numerous certifications and schooling experiences for body shop painting! Feto lives in Peoria with his wife, Ari. In his free time, he enjoys minigolf, riding motorcycles and ATV’s, and bowling. Feto enjoys watching soccer and an interesting fact about him is that he is Albanian and started driving cars at 7 years old! Djevdet Tairov Body Shop Technician Name Title Mykhailo Khava Body Shop Technician Jackson Whitney Body Shop Technician Karson Stratton Body Shop Technician Tristan Hendy Body Shop Technician Name Title Parts Department Brett Koch Parts Manager Brett joined the Lighthouse team in 2010. He started here as a Service Tech and now works in our Parts Department and is also a part of our Everest Lifted Trucks team! David Baldovin Assistant Parts Manager David came to Lighthouse in 2018 to start as a Technician Apprentice. He is from Groveland, Illinois, USA. His favorite pastime is working and he works almost all day. When he’s not working, you will probably find him working on his Jeep in the shop. Joe Wiegand Parts Manager Emeritus Joe Wiegand joined the Lighthouse team in February 1996. Prior to this, he worked at the DMI factory in Goodfield for eight years and then worked at Bob Grimm Chevrolet in the parts department for eleven years. Joe lives in Congerville with his wife Myra, and his two kids, Steffani and Joshua. In Joe’s free time, he enjoys hunting, camping, bike rides, working around the farm, and church related activities. Kevin Bright Parts Consultant Name Title Graham Dillon Parts Consultant Norman Mellies Parts Consultant David Younglove Parts Consultant Brock Wiegand Fleet Parts Consultant Brock joined the Lighthouse team in November 2022. He worked at Earlybird Feed and Fertilizer in Goodfield before coming here and was promoted there to head of LTL’s! He lives in Goodfield and has a 9 year old Golden Retriever named Rex. In Brock’s free time, he enjoys riding ATV’s, playing Xbox, cooking meat on the smoker, and watching / learning more about cars and trucks. His favorite sports team is the Dallas Cowboys because they are America’s team! Something you might not know about Brock is that he claims to be able to grow a better beard than his dad! Name Title Jacob Kocher Collision Parts Consultant Gene Tuttle Parts Delivery Charlie Stout Parts Delivery Charlie joined the Lighthouse team in March of 2014. Before coming to Lighthouse, he worked for RA Cullinan and retired there in 2013. He has a home in Tremont. Charlie has 3 boys who are all married and 3 grandkids. He enjoys his time every year when he goes down to Costa Rica for 3 weeks on a mission trip. Charlie’s fun fact is that he claims George Strait was his lab partner in Ag Mech Class! Kip Poorbaugh Parts Delivery Kip Poorbaugh joined the Lighthouse team in the fall of 2016. He came from the ag business field but joined the Lighthouse team in his retirement. He lives in Tremont with his wife and have 2 children and 2 grandchildren. Kip enjoys outdoor activities and golfing in his free time. Name Title Larry Mason Parts Delivery Larry joined the Lighthouse team in 2014. Before he came to Lighthouse, he retires from ABF Freight System in May of 2008. Larry lives in Washington and has been married to his wife Sherry for 55 years! They have 2 adult children, Kim and Chad, 3 grandchildren, and 2 great grandchildren. Larry enjoys camping and watching his grandsons play sports in his free time. His favorite sports teams are the St. Louis Cardinals and Chicago Bears! Mike Haney Parts Delivery Doug Emlen Parts Delivery Ken Snider Parts Delivery Name Title Steve Hancock Parts Delivery Name Title Finance Department Jon Tharp Finance Manager Jon Tharp joined the Lighthouse team in 2015. Before joining Lighthouse, Jon worked in youth ministry beginning in 2002. He was a youth pastor, high school teacher, and volunteer for inner-city school programs until 2014. He is thankful for the years that he spent working with young people. Jon is the seventh of twelve children. He and his siblings have given their parents over 50 grandchildren. Jon and his wife Allison live in Washington, IL. They have six children: Josiah, Lillian, Sophia, Anthony, Ethan, and Parker. In his free time, he enjoys do-it-yourself projects around the house, weekly scheduled events with his children, and going on dates with his wife. Jon is a lifelong Pittsburgh Steelers fan…It’s a Tharp family tradition. A fun fact about Jon: He traveled as a professional gospel singer. envelope jont@lighthousegmc.com phone (404) 709-1315 Mason Williams Finance Manager envelope masonw@lighthousegmc.com Darren Gross Finance Manager envelope darreng@lighthousegmc.com Name Title Accounting/Administration Jim Binegar CFO Jim Binegar started at Lighthouse in 1996. Prior to this, Jim spent six years in the Air National Guard as an Aircraft Maintenance Specialist, and also owned and operated an auto detailing business for a year. Jim lives in East Peoria with his wife Dena and together they have two sons, Zach and Alex, and two dogs. In Jim’s free time he enjoys watching baseball, especially his favorite team the St. Louis Cardinals, running, singing, and listening to music. Jim has served on the worship team at his church for 15+ years and has also served as a part of leadership at his church for 7+ years. An interesting fact about Jim, he cannot sleep without a fan envelope jimb@lighthousegmc.com phone (309) 696-6159 Ben Kaiser Controller Ben Kaiser joined the Lighthouse team in 2007. Ben attended ICC and ISU, where he graduated with an Accounting degree and passed his CPA. Prior to working at Lighthouse he worked at Clifton Gunderson in Peoria, IL as an auditor. He lives in Morton and has four daughters: Selah, Keliah, Adara, and Aaria. Ben loves spending time in the ocean and at the beach. Ben has 5 brothers and sisters of which all agree that he is the favorite. envelope benk@lighthousegmc.com Shelbi Shidler Accounting Professional / HR Shelbi joined the Lighthouse team in May 2016. She graduated from Saint Joseph’s College with a Bachelor’s in Business Administration. In her free time, Shelbi enjoys spending time with family and watching Purdue Basketball. envelope shelbis@lighthousegmc.com Jennifer Schaefer Accounts Receivable Professional / HR Name Title Ken Burgard Human Resources Director Laura Peden License and Title Professional Laura joined the Lighthouse team in 2023. Prior to working at Lighthouse, she worked at Carroll Auto & Tire from 1990-2016, and her husband’s company, Pure Outdoor Alliance. Laura lives in Astoria with her husband, Doug. They have seven children, Tyler (Liz), Kyle (Kayla), Clay (Claire), Colton, Shelby (Jason), Trevor, and Brinkley, and three grandchildren, Scarlette, Hudson, and Julian. In her free time, Laura loves gardening, fishing, and anything with her family! Something interesting about Laura is that she enjoys mowing, looking at God’s artwork, and the peace it brings her! Andrew Knussman Accounts Payable Professional Debbie Glueck Administrative Office Professional Debbie joined the Lighthouse team in 2008 after working 14 years at Rocke's Meating Haus. She has been married to her husband- Willie- for 37 years and they have on daughter- Rachel- who is also married and lives in Morton. Her favorite vacation destination is Hawaii which she's had the pleasure of visiting 4 times! envelope debbieg@ligthousegmc.com Name Title Alyssa Tharp Administrative Office Professional Cali Mereness Administrative Office Professional Name Title Copyright © 2025 by DealerOn | Sitemap | Privacy | Lighthouse Buick GMC | 100 W Jackson St, Morton, IL 61550 | Sales: 877-209-6257"
    },
    {
      "url": "https://www.lighthouseholyoke.org/staff-and-board/",
      "text": "Staff and Board - LightHouse Holyoke Menu Discover Our Students Give close Search for: Search Button Menu Discover Our Students Give close LightHouse Mission and Vision Our Students Learning at LightHouse Self Directed Learning Celebrating Difference AI and Education Social Justice Values Admissions Admission & Tuition Apply Public Partnerships College Acceptance Understanding School Disengagement Academics Our Approach Competency-Based Education Current Classes De la Luz Technical Arts Institute Culinary Program Maker Program Theater Program Campus Info Staff & Board Calendar Events News Equity Protocols & Commitments Donate Give Wishlist Connect Contact Us Employment Press After LightHouse College and Beyond Alumni Fellowship Staff and Board Core Staff Leadership Team Dr. Kate Benson (she/her) Curriculum Director Kate has been a special educator for more than twenty years working in a range of special education placements as a classroom teacher and as a program administrator. She earned her doctorate in Educational Leadership at Bay Path University where she is a special education practicum supervisor. Kate is also a disability and institutional historian, educating teachers on how to teach disability history in the classroom. In her spare time, she is a writer of historical fiction and nonfiction, as well as an avid reader, photographer, and stitcher. Email Molly Brown-Hill (she/her) Advisor Molly is passionate about building intentional community and collective understanding, as well as uplifting and supporting others. Molly received her bachelors in Anthropology from UMass Amherst, where she mostly focused on Anthropology as it relates to social justice and identity. Molly likes to spend time gardening, playing soccer, getting into juicy conversations with friends, and cooking. She finds happiness in slow mornings and any Octavia Butler book. Email Danielle Duseau (she/her) Advisor Danielle is an educator with seven years of secondary and postsecondary teaching experience. She holds a BA in English from Princeton University, MS in Education from Johns Hopkins University, and MA in English from the University of Rhode Island. She is passionate about building community and honoring our simultaneous interconnectedness and uniqueness. Danielle’s scholarly/creative work centers the anticolonial environmental humanities. Email Isaac Littlejohn Eddy (he/him) Theater Arts Program Director and Developer Isaac performed as a Blue Man in Blue Man Group for twelve years. He developed a new multi-disciplinary performing arts program at Vermont State University Johnson where he taught for nine years as an associate professor. Isaac has directed multiple plays and musicals including an original musical entitled Listen Up that was created by Vermont teenagers and toured the state in 2021. Isaac has had cartoons published in the New Yorker, The New York Times, and Time Magazine. He has taught improv and theatre making at the Governor's Institute of Vermont for fifteen years. His greatest source of artistic inspiration is creating new performance works with young artists and watching them learn how to frame their experiences for the stage. Isaac lives in Leverett with his wife, three kids, and many animals including sheep. Email Catherine Gobron (she/her) Co-Founder and Head of School Catherine co-founded LightHouse with Josiah S. Litant and they led the organization together for three years. In 2018 Josiah relocated and Catherine stepped up to the role of Executive Director. Catherine has been a driver in the leading edge of education for more than two decades. Before LightHouse she spent 12 years at North Star: Self-Directed Learning for Teens as Program Director and was a founding board member for Liberated Learners, the umbrella program connecting centers using the North Star model. Catherine holds two bachelors degrees from the University of California, Santa Barbara and a Masters in Education, Creative Arts in Learning, from Lesley University. She also holds a Montessori Certification from New England Montessori Teacher Education Center. Email Dwayne Johnson (he/him) Facilities Manager Dwayne was born and raised in Springfield, MA and has worked in this building for over five years. Positive energy and a very hard worker. Always helping others and always have a smile on my face! Email David Lane (he/him) Operations Director David is an educator with over 30 years experience working with adolescents and adults in schools of all kinds. He has worked in for-profit, non-profit, parochial, private, and public schools in Los Angeles, New York City, Manchester, NH, central Massachusetts, and northern New Jersey, where he is from. He has served as a classroom teacher, department chair, assessment coordinator, grants administrator, director, non-profit founder, and school principal. His journey through the profession was always punctuated by a desire to discover ways to support student agency. This journey led him to discover self-directed learning, which changed his life. Being a staff member at LightHouse is a dream come true for him. He is also a poet, a lover of the arts, a husband and a father. Email Nate Maynard (he/him) Advisor Nate received his BS in Environmental Science with a minor in Chemistry from Hawaii Pacific University and completed a Graduate Teacher Certification program for secondary science at The University of New England. He has well over ten years of teaching experience in a variety of settings, including serving as a teacher and advisor at a small private school in Southern Maine. He has a love of the outdoors and serves as a volunteer member on his town’s Conservation Commission. Nate is thrilled to join the LightHouse community of learners and to share his passion for science and the natural world. Email Carlos Peña (he/him) Cultural Director Carlos is a founding staff member and a key contributor to the success of the program. Carlos has a degree from UMass Amherst, and is an artist, screenprinter, and poet. He lives in Holyoke and is very involved in the community. Email Diana Santiago (she/her) Office Manager Diana grew up in Holyoke and attended Holyoke Public Schools, graduating from Holyoke High before working on her college degree. She began working in health services in 2010 and became a certified HHA in 2011. She loves working with the elderly and now also with adolescents! She is a bilingual speaker and mother to two wonderful children. Diana manages the administrative side of LightHouse, bringing positive professionalism, deep empathy, and and attitude of active learning to our front desk every day. Email Thurman Bear (he/him) Chef My name is Thurman Bear but everyone calls me Blue. I'm originally from Detroit, Michigan, but have lived in Holyoke for the last 3 years. My journey into food preparation started at an early age, helping my mom in the kitchen at home. As I became more curious, cooking shows and the Home Economics offering at my high school helped nurture my passion. My first job was in a pizza place where I prepared a multitude of dishes beyond just the pizza. My curiosity didn't stop there, as I was also interested in where our food comes from. Before moving to Western Mass, worked on a tribal vegetable farm in northern Michigan where I cared for crops from seed all the way through harvest to market. We also ran a small market in town and a hot food counter where we served delicious meals made with our ancestral crops such as: flint corn, different varieties of winter squash, and different varieties of beans. These experiences have led to a deep appreciation of quality, nutrient dense food that also tastes great. Email Steph Zello (she/her) Advisor Steph joined the LightHouse in early 2021. She graduated from Northern Vermont University with a B.A. in Theatre and Drama. Since graduating, Steph has continued to work and teach in theaters locally and in the Metro West area. Some of her theatrical interests include costume design, playwriting, acting, and directing. Steph is passionate about personalized education and is excited to be a part of the LightHouse community. Email Board of Directors Dr. Latoya Bosworth (she/her) Dr. Latoya Bosworth, also known as Dr. Boz, is by nature an artist, by nurture an empath and advocate, and by trade an educator. Dr. Boz began her first job in human services at 19, and since then she has worked with youth and families in several capacities, from crisis intervention to family stabilization.  She has collaborated with and consulted for the Department of Children and Family Services, the Department of Youth Services, after-school programs, Job Corps, summer camps, and community centers. In 2006, she established her own arts and mentoring program, with a special education teacher certification, Dr.Boz taught in alternative high schools for 15 years. She consulted as Behavior Specialist for an inner city public school, is an adjunct professor in Education & Human Services, and is faculty for the Institute for Equity Centered Coaching . She has B.A. in Sociology, an M.S. in Nonprofit and Philanthropy, and a Ph.D. in Social and Community Service. Her research involves young women. Dr. Boz continuously spreads her message of H.E.R.S - health, empowerment, resilience, and self-worth in workshops, as a keynote speaker, and as a life coach, in print, and on stage. Jill Brevik (she/her) Jill has been working in the nonprofit field for more than a decade, with a focus on development, project management, and partnership-building using a collaborative, community-centric approach. Currently, she leads development efforts at Mass Humanities, whose mission is to create opportunities for the people of Massachusetts to transform their lives and build a more equitable commonwealth through the humanities. She holds an MS in Nonprofit Management from Northeastern University and BA in English Language & Literature from the University of Vermont. Jill also serves on the board of directors for Dress for Success Western MA as well as the grantmaking committee for UMass Amherst's Fine Arts Center. She lives in Amherst and enjoys writing and exploring new places. Brooke Karunanande (she/her) Brooke returned to the Valley after ten years of living and working in New York City. During her time at Fordham Graduate School, and the years after obtaining her MSW and becoming a Licensed Clinical Social Worker, Brooke has worked with a variety of programs and organizations that give support to families in need. After working at a shelter for mothers with small children, Brooke had her first experience working directly with adolescents when she became a discharge planner for minors in the Riker’s Island jail system. She then went to work with SCO Family of Services, as a behavioral therapist with an Alternative To Incarceration program for court-involved youth and their families. Working closely with the Department of Probation and Children’s Services, the Juvenile Justice Initiative focused on Multi-Systemic Therapy to address not just the personal but the systemic causes of crime. Brookes approach to treatment included Cognitive Behavioral Therapy, Acceptance and Commitment Therapy and fierce advocacy for clients’ rights. Being that opportunity and access are huge factors in an individual’s (and larger communities) ability to lay a solid foundation for their own future and success, Brooke was honored to have the opportunity to work with LightHouse on supporting youth in building the skills and confidence necessary to take on life whole-heartedly. Currently, Brooke spends her time being a stay at home parent, volunteering at the Amherst Survival Center, and teaching crystal singing bowl workshops as a certified sound practitioner. Joseph Katz (he/him) Joseph Katz is a Licensed Independent Clinical Social Worker and School Adjustment Counselor at Great Falls Middle School and Turners Falls High School. He has experience working in private and public schools from elementary through post-secondary. Joseph also has supported families through the special education process and practiced trauma informed care through clinical training at the Leeds VA. In addition to his psychodynamic training, he is trained in Cognitive Processing Therapy, Acceptance and Commitment Therapy, and Integrated Care. Joseph grew up in the Pioneer Valley and attended the University of Massachusetts as an undergraduate prior to returning to the area to pursue his MSW through the Smith College School for Social Work and moving to Turners Falls. He is an avid reader, diligent baker, and willing participant in any team sport. Josiah S. Litant (he/him) Co-Founder Josiah co-founded LightHouse with Catherine Gobron and co-directed the organization for the first three years, building it from an idea into a thriving reality. In 2018 Josiah and his family relocated to Minnesota, where he was Vice President of Student Affairs and Vice President of Strategic Initiatives at Minnesota State College Southeast, a technical and community college. Since 2023 Josiah has served as the inaugural Executive Director of the Minnesota P-20 Education Partnership, a statewide initiative to strengthen educational outcomes for learners of all ages across Minnesota. Josiah remains deeply connected to LightHouse as a consultant, senior advisor, and enthusiastic supporter. Josiah has been in the field of education for twenty years, as a teacher, mentor, and administrator at all age levels. Prior to co-founding LightHouse Holyoke, Josiah spent a decade working with college-age students at Hampshire College. He has a particular passion for progressive education, with a focus on issues of student identity, inclusion, and advocacy. Josiah has previously served on a number of nonprofit boards and has proudly consulted as a social justice facilitator with the National Conference for Community and Justice of Connecticut and Western Massachusetts. Josiah has a Master of Arts degree in higher education administration from Goddard College, and a Bachelor of Arts degree in elementary education from Hampshire College. Email Sita Magnuson (she/her) Sita has 20+ years of experience helping organizations, communities, and networks imagine, learn, and collaborate. She co-founded dpict, a facilitation firm specializing in process design, visualization, sensemaking, and collaborative environments. Her career has involved extensive international work in multi-stakeholder initiatives at the intersection of global systems. When her first child was born, she felt called to direct her attention to local experimentation in service of intergenerational learning, community weaving, and civic engagement. She co-founded Easthampton Co.Lab, a community-based co-working and learning space, and Fort Future, a space for creative, intergenerational learning. She is a member of the Connecticut River Valley Bioregional Collaborative and The Value Web, a global community focused on transforming decision-making. She is on the core team of the Ford Foundation’s Ford Global Fellows program and the Learning Innovations Lab at the Harvard Graduate School of Education (part of Project Zero). She is actively involved in several regional planning initiatives and loves imagining and experimenting with new models for citizen-driven decision-making. She is also a board member of the Co-Intelligence Institute, where she works with others to promote innovations in collective wisdom, co-creativity, and collaborative governance. Sita is thrilled to support LightHouse and doubly delighted to have her oldest child join the school in fall 2023! Anthony Scibelli (he/him) Chair Anthony Scibelli is the Vice President, Operations and Chief Administrative Officer for Cooley Dickinson Health Care (a subsidiary of Massachusetts General Hospital) in Northampton, Massachusetts. Anthony is responsible for all aspects of the support services operations departments (nutrition, housekeeping, facilities, safety/security) as well as human resources, performance improvement, volunteer services, medical imaging, rehab services, lab, oncology services, pharmacy, urgent care, and home care & hospice. Anthony has been with Cooley Dickinson since December 2014 and is a native of Springfield MA. Prior to joining Cooley Dickinson, Anthony lived in Upstate NY and held the position of Senior Vice President, Human Resources, Support Services and Post Acute with the Mohawk Valley Health System in Utica, New York. Prior to his healthcare career, Anthony worked in various human resources roles in the supermarket industry (Big Y, ShopRite and The Penn Traffic Company). Anthony earned a bachelors degree in education from Worcester State College, Worcester MA and is a graduate of Lesley University in Cambridge MA with a Masters Degree in Training & Development. In 2012, he obtained a MBA from the University At Albany in Albany NY. Anthony lives in South Hadley, and serves on the board at the Northampton Survival Center, as well as the Franklin/Hampshire County Regional Employment Board. Mike Stone (he/him) Secretary Mike Stone is a partner at Cofab Design, a product design and manufacturing consultancy. He is a mechanical engineer and designer with a penchant for multidisciplinary projects, products, prototypes, and hands-on hammer swinging. He is a co-founder of Brick Coworkshop, a community-oriented collaborative industrial work space, and a member of the leadership team at AF, a national traveling pop-up marketplace. He sits on the Springfield Advisory Board for FORGE and has a secret history as a musician. Celebrating life outside the lines. find out more 92 Race Street, Holyoke, MA 01040 contact@lighthouseholyoke.org 413-420-8299 Map Menu Visit our Facebook Visit our Instagram Visit our Twitter Visit our YouTube channel Get monthly news Leave this field empty if you're human: Login to Alma Copyright © 2025 LightHouse Holyoke. All rights reserved. search close map-marker chevron-down bars ellipsis-v linkedin facebook pinterest youtube rss twitter instagram facebook-blank rss-blank linkedin-blank pinterest youtube twitter instagram"
    },
    {
      "url": "https://www.lighthousetrailsresearch.com/contactus.htm",
      "text": "Contact Us Home Contact us Our Authors Resources NEWS & ARTICLES Online Store NEWS & ARTICLES Online Store Donate YouTube Research Journals Home NEWS/ARTICLES Contact Us E-mail, Call, Write Donate to LT About Us Our History Our Beliefs LT Author Websites Why We Are Not Non-Profit Copyright & Use of Material Our views on Israel & the Jews Our Resource Store Resources Topical Index NEWS & ARTICLES Free e-Newsletter Newsletter Archive RESEARCH JOURNAL LT AUTHORS FAQ Bible Verse Tea Store New Releases Booklets Our Own Shepherd's Organic Bible Verse Tea DVDS & CDS Digital Products Emerging Church Contemplative Prayer & Spiritual Formation Remember the Holocaust Sensitive Issues Biographies Contacting Us Toll \n                                          Free Order Line (USA & Canada) 866-/876-3910 Office calls and International \n                                          Calls 541-391-7699 WRITING: Lighthouse Trails Publishing P.O. Box 307 Roseburg, OR 97470 EMAILING General Inquiries: editors@lighthousetrails.com COMMENTS AND SUGGESTIONS: comments@lighthousetrails.com Chief Editor/Acquisitions Editor David Dombrowski: david@lighthousetrails.com Managing Editor Deborah Dombrowski: deb@lighthousetrails.com Write \n                                          to us or our authors Attn: Author or Editor Lighthouse Trails Publishing P.O. Box 307 Roseburg, OR 97470 DONATING TO LIGHTHOUSE TRAILS: We are not a non-profit 501 (c) (3) organization. While we accept donations and are grateful \n                                        for them, they are not tax deductible. We encourage you to consider ordering books we publish - this is a great way to support us and at the same time get the \n                                        warning out to more people and help defend the precious faith. \n                                        We believe you will find each of our books to be well-written, \n                              properly documented, and essential for the times in which we live. If you would like to donate to Lighthouse Trails, you may send a donation by clcking the link below or by mailing it to: Lighthouse Trails Research Project, P.O. Box 307, Roseburg, OR 97470 . Or you may call 541-399-7699 or 866/876-3910. Thank you for your support. CLICK HERE TO DONATE Related Links News Articles/Links Topical Index Search Engine Our Beliefs Newsletter Archives Shepherd's Garden LT Author Websites Related Information Publisher Blog Online Store Search for Products Bible Verse Tea Related Products \"Neither is there salvation in any other: for there is none other name [Jesus Christ] under heaven given among men, whereby we must be saved.\" Acts 4: 12 Home Contact \n  Us About \n    Us Links Topical \n      Index Bookshop Donate Privacy Policy Copyright 2002-2025 Lighthouse Trails Publishing, Inc."
    }
  ]
}