{
  "fuentes": [
    {
      "url": "https://www.cubalibregroup.net/en/contact",
      "email": "info@cubalibregroup.net"
    },
    {
      "url": "https://www.tickeri.com/venues/941e0f94-5fff-4738-85a3-536a08b4ed5a",
      "email": "info@tickeri.com"
    },
    {
      "url": "https://www.tickeri.com/events/j5rg8qjvdmo9/hunks-male-revue-the-show",
      "email": "info@tickeri.com"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "bg_onlydots@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "country_in@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "country_us@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "ht_100_logoblack@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "ht_100_logoblack@2x.webp"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "magnifyingglass@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "menu-facebook@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "menu-linkedin@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "menu-twitter@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "menu-whatsapp@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "premium-lavel-new@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "profile@2x.png"
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "email": "story_trending@2x.png"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "eabrams@cfr.org"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "sylviairiondo@aol.com"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "arcoss@fiu.edu"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "carlos.eire@yale.edu"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "cruz@fau.edu"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "ezbazan@aol.com"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "john.suarez@cubacenter.org"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "jsanguinetty@devtechsys.com"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "jsuchlicki@cubanstudiesinstitute.com"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "oreich@ottoreich.com"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "rmariapaya@cubadecide.org"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "email": "snigdom@sbcglobal.net"
    },
    {
      "url": "https://cubalibrelounge.com/",
      "email": "cuba@havanajax.com"
    },
    {
      "url": "https://www.tickeri.com/events/5n7hyb3bt8ym/alex-manga-en-vivo-en-jacksonville",
      "email": "info@tickeri.com"
    }
  ],
  "mails": [
    "arcoss@fiu.edu",
    "bg_onlydots@2x.png",
    "carlos.eire@yale.edu",
    "country_in@2x.png",
    "country_us@2x.png",
    "cruz@fau.edu",
    "cuba@havanajax.com",
    "eabrams@cfr.org",
    "ezbazan@aol.com",
    "ht_100_logoblack@2x.png",
    "ht_100_logoblack@2x.webp",
    "info@cubalibregroup.net",
    "info@tickeri.com",
    "john.suarez@cubacenter.org",
    "jsanguinetty@devtechsys.com",
    "jsuchlicki@cubanstudiesinstitute.com",
    "magnifyingglass@2x.png",
    "menu-facebook@2x.png",
    "menu-linkedin@2x.png",
    "menu-twitter@2x.png",
    "menu-whatsapp@2x.png",
    "oreich@ottoreich.com",
    "premium-lavel-new@2x.png",
    "profile@2x.png",
    "rmariapaya@cubadecide.org",
    "snigdom@sbcglobal.net",
    "story_trending@2x.png",
    "sylviairiondo@aol.com"
  ],
  "nombre_sitio": "cubalibrelounge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cubalibregroup.net/en/contact",
      "text": "Contact | CubaLibreGroup top of page Welcome About Us Testimony Contact ICE Book Online More Use tab to navigate through the menu items. SPECIALIZING IN HELPING IMMIGRANTS SINCE 2017 Contact Cuba Libre Group 3430 E. Flamingo Road-Suite 318 Las Vegas, NV 89121 Office:  702-463-2294 Direct:  210-461-9955 Fax:        877-255-2592 info@cubalibregroup.net ​ Name Email Name and Immigration Number Your Full Phone Message Success! Message received. Send CITA Pagos bottom of page"
    },
    {
      "url": "https://www.tickeri.com/venues/941e0f94-5fff-4738-85a3-536a08b4ed5a",
      "text": "Cuba Libre Ultra Lounge Open main menu Search for events Log In Register Help ES Venue Cuba Libre Ultra Lounge 2578 Atlantic Boulevard, Jacksonville, 32207, United States, Florida Upcoming events Event organizer About us Help Contact us Terms Privacy policy El Shop Browse by city Miami Orlando Tampa Atlanta Charlotte DMV (DC, MD, VA) Philadelphia Tri-State (NY, NJ, CT) Chicago Dallas Houston Las Vegas Los Angeles San Francisco Phoenix Salt Lake City Columbus Gulf Port Indianapolis St. Louis Browse by country United States 🇺🇸 Puerto Rico (Coming Soon) 🇵🇷 Canada (Coming Soon) 🇨🇦 Mexico (Coming Soon) 🇲🇽 Peru (Coming Soon) 🇵🇪 Colombia (Coming Soon) 🇨🇴 Chile (Coming Soon) 🇨🇱 Popular Events 🏆 Made with mucho by your Tickeri familia © 2011- 2025 Tickeri, Inc. All Rights Reserved."
    },
    {
      "url": "https://www.tickeri.com/events/j5rg8qjvdmo9/hunks-male-revue-the-show",
      "text": "Hunks Male Revue The Show  Tickets | Boletos - Cuba Libre at Havana Jax, Jacksonville | 2024-08-16 - Tickeri.com Open main menu Search for events Log In Register Help ES Aug 16 Jacksonville , Florida Cuba Libre at Havana Jax Hunks Male Revue The Show Jacksonville , Florida · August 16, 2024 Online tickets not available Share with friends : Details Date : Friday, August 16, 2024 Doors : 8:00 PM * Show : Contact event organizer * Age : 21+ Seating : Yes, seating available with VIP purchase * Subject to change Venue Cuba Libre at Havana Jax 2578 Atlantic Boulevard Jacksonville , Florida 32207 Event description The HUNKS have been thrilling women worldwide for years with our cast of some of the Sexiest Men Alive. They not only have chiseled bodies and irresistible charm, but they also sing and dance to thumping beat with dazzling litgh show to create and action-packed, fun-filled night of excitement rhat leaves your patrons wanting more. Every single time! With HUNKS the show, you're guaranteed to have one of the best nights of your life full of attractive and talented man with drinks and more! Got questions about the event? Phone 904-6767729 Message the event organizer Event organizer About us Help Contact us Terms Privacy policy El Shop Browse by city Miami Orlando Tampa Atlanta Charlotte DMV (DC, MD, VA) Philadelphia Tri-State (NY, NJ, CT) Chicago Dallas Houston Las Vegas Los Angeles San Francisco Phoenix Salt Lake City Columbus Gulf Port Indianapolis St. Louis Browse by country United States 🇺🇸 Puerto Rico (Coming Soon) 🇵🇷 Canada (Coming Soon) 🇨🇦 Mexico (Coming Soon) 🇲🇽 Peru (Coming Soon) 🇵🇪 Colombia (Coming Soon) 🇨🇴 Chile (Coming Soon) 🇨🇱 Popular Events 🏆 Made with mucho by your Tickeri familia © 2011- 2025 Tickeri, Inc. All Rights Reserved."
    },
    {
      "url": "https://www.hindustantimes.com/world-news/us-news/who-was-robert-morales-fsu-shooting-victim-identified-as-founder-of-popular-tallahassee-cuban-restaurant-101744998894717.html",
      "text": "Who was Robert Morales? FSU shooting victim identified as founder of popular Tallahassee Cuban restaurant | Hindustan Times Fri, Sept 12, 2025 New Delhi o C IN IN US Subscribe Subscribe Enjoy unlimited access Subscribe Now! Get features like Ad lite A Minimal Ad Experience HT Premium Articles Expertly crafted articles Quickreads Segment News brief in summary format HT E-paper Access digital news experience Subscribe Now Home Charlie Kirk Shooting BAN vs HKG Live Score Asia Cup 2025 E-Paper HT Premium HT The Next Voice US News Games HTCity India World Entertainment Astrology Real Estate Trending Lifestyle Education Business Cities Latest News Asia Cup Schedule Asia Cup Points Table Asia Cup Most Run Asia Cup Most Wicket Livemint + 20 more US News Games HTCity ht100 India World Entertainment Astrology Real Estate Trending Lifestyle Education Business Cities Latest News Asia Cup Schedule Asia Cup Points Table Asia Cup Most Run Asia Cup Most Wicket Livemint Nepal Protest Live Bihar Election Photos Century of Leadership Web Stories Sports Bengaluru News Delhi News Mumbai News Technology Quickreads Daily Digest Following Bihar Chunav iPhone 17 Games + 8 more Mumbai News Technology Quickreads Daily Digest Following Bihar Chunav iPhone 17 Games Who was Robert Morales? FSU shooting victim identified as founder of popular Tallahassee Cuban restaurant By Vaishnavi Vaidyanathan Updated on: Apr 19, 2025 01:30 am IST Share Via Copy Link Robert Morales has been identified as one of the victims in the FSU shooting. Morales was one of the original founders of Gordos Cuban Cuisine. Robert Morales, a Miami-Dade County native, has been identified as one of the victims in the Florida State University (FSU) shooting, according to NBC Miami, which cited a family friend. Robert Morales has been identified as one of the victims in the FSU shooting.(Getty Images via AFP) Morales was one of the original founders of Gordos Cuban Cuisine, a popular Cuban restaurant in Tallahassee. He is survived by his wife and daughter. His friend, Ricardo Morales Jr., shared a heartfelt tribute on X (formerly Twitter): \"Today we lost my younger Brother, He was one of the victims killed at FSU. He loved his job at FSU and his beautiful Wife and Daughter. I’m glad you were in my Life. Him with our Dad on the left and with our other Brother Sister, Gma and cousin.\" Gordos owner Eddie Agramonte expressed his condolences in a statement: \"This is a horrible, senseless tragedy. While it has been a long time since we worked together, my heart breaks for all the family and friends of Robert Morales. The Seminole nation is strong and I’m proud of how our community is rallying around each other during this time of loss.\" Also Read: FSU shooter Phoenix Ikner's alleged social media profile surfaces A graduate of Hialeah Senior High School and Florida State University, Morales served as the dining director on campus. His LinkedIn profile shows he had worked in dining services since 2015. Morales also previously served as an assistant football coach at Leon High School in Tallahassee , NBC Miami reported. In a statement, the school’s athletics department wrote: \"Coach Morales was a beloved member of our athletic community and served as an assistant coach for Leon Football with dedication, integrity, and a true passion for mentoring young athletes. His commitment to the game and to shaping the lives of his players extended far beyond the field. He was a trusted coach, a respected colleague, and a cherished friend to many.\" Shooting Stay updated with US News covering politics, crime, weather, local events, and sports highlights. Get the latest on Donald Trump and American politics also realtime updates on Indonesia ferry fire . Stay updated with US News covering politics, crime, weather, local events, and sports highlights. Get the latest on Donald Trump and American politics also realtime updates on Indonesia ferry fire . News / World News / US News / Who was Robert Morales? FSU shooting victim identified as founder of popular Tallahassee Cuban restaurant See Less SHARE THIS ARTICLE ON SHARE Copy Whatsapp Twitter Facebook Linkedin Best Deals iPhone 17 price in India will be… Best electric tyre inflators for cars: Top 10 picks to tackle flat tyres anytime Orthopaedic slippers for unmatched support and good health: Our top 8 picks Formal shirts for women to dress like a boss lady at office; Top 8 picks for you Best 8 wheel trolley bags: Top sturdy and stylish picks for your next trip View All Join Hindustan Times Create free account and unlock exciting features like Newsletters, Alerts and Recommendations Get personalised news and exciting deals Bookmark the stories you want to read later REGISTER FOR FREE Already have an account? Sign In SKIP Subscribe to our best newsletters HT Daily Capsule Sign Up to Subscribe Newsletter subscribed successfully Latest News World News India News Cricket Live Score Cricket Schedule Asia Cup 2025 Schedule Asia Cup 2025 Asia Cup 2025 Points Table Suryakumar Yadav Virat Kohli Yashasvi Jaiswal Axar Patel Hardik Pandya Ravindra Jadeja Shivam Dube Rishabh Pant Sanju Samson Arshdeep Singh Jasprit Bumrah Kuldeep Yadav Mohammed Siraj Yuzvendra Chahal Tim David David Warner Cameron Green Travis Head CITY NEWS Bengaluru News Bhopal News Chandigarh News Chennai News Dehradun News Delhi News Gurugram News Hyderabad News Indore News Jaipur News Kolkata News Lucknow News Mumbai News Noida News Patna News Pune News Ranchi News Other Cities Entertainment Bollywood News Hollywood News Music Tamil Cinema Telugu Cinema TV Web Series Entertainment Others Books HT Insight Elections Upcoming Elections Income Tax Calculator ASTROLOGY Horoscope Education Admission News Board Exams Competitive Exams Employment News Exam Results Education News LIFESTYLE Art and Culture Brunch Fashion Festivals Health Recipes Relationship Travel Pet Web Stories Trending Business Photos Videos Environment Science Opinion Editorials Car and Bike Technology Sports Badminton Football Hockey Tennis Others Quickreads Covid 19 Assembly Election GAMES Daily Sudoku Daily Crossword Daily Word Jumble TRENDING NEWS Bangladesh vs Hong Kong Live Score charlie kirk killer image Sushila Karki Manoj Bajpayee Wasim Akram Shubman Gill Capricorn Daily Horoscope Sagittarius Daily Horoscope Scorpio Daily Horoscope Libra Daily Horoscope Virgo Daily Horoscope Leo Daily Horoscope Cancer Daily Horoscope Gemini Daily Horoscope Taurus Daily Horoscope Aries Daily Horoscope Career and Money Horoscope Horoscope Today Asia Cup 2025 Nepal Protest TRENDING TOPICS Asia Cup 2025 Asia Cup 2025 Schedule Asia Cup Most Runs Asia Cup Most Wickets Asia Cup 2025 Points Table Rajat Patidar Yuzvendra Chahal Virat Kohli Cricket Live Score ICC Cricket Ranking Cricket Teams Nehal Wadhera Latest World News Who is Anastasia J. Casey? Mysterious book titled ‘The Shooting of Charlie Kirk’ raises questions Kate Middleton subtly honors Prince William with THIS fashion choice Turning Point USA mourns Charlie Kirk: ‘America’s greatest martyr to free speech' Jair Bolsonaro stares at decades in prison as Brazil Supreme Court votes to convict ex-president for attempted coup ‘This place is ours’: Benjamin Netanyahu clears stand on a Palestinian state DNC HQ bomb threat: Spokesperson issues update amid police activity Trump, other officials mourn Charlie Kirk amid 9/11 tributes Boulder: Fairview High, Southern Hills Middle Schools under lockdown amid gunman reports Alabama, Virginia universities issue lockdowns over ‘terrorist threat’ after Charlie Kirk shooting Stockton University: Shelter-in-place order issued amid unconfirmed shooting, active shooter reports About Us Contact us Terms of use Privacy policy Weather Today HT Newsletters Subscription Print Ad Rates Code of Ethics Site Map RSS Feeds Copyright © 2025 HT Digital Streams Limited. All Rights Reserved. Click to Top Story Saved Live Score Edit Profile Subscribe Now Your Subscription Plan Renew Subscription Activate the WSJ Your The WSJ subscription is active Link your email for The WSJ activation Manage Subscription Saved Articles Following My Reads Sign out Get App Subscribe Now! Home HTLS 2024 Astrology Lifestyle Entertainment Elections Trending Videos Education Photos Sports Cities Daily Digest Quickreads Opinion Analysis For You Following Elections 2025 Web Stories Science HT Games Product Hub Livehindustan Podcasts Weather Technology Latest News India News Bihar Chunav Cricket BAN vs HKG Live Score Asia Cup 2025 Asia Cup Match Today Asia Cup Points Table Asia Cup Most Runs Asia Cup Most Wickets Asia Cup player Stats Live Cricket Score Cricket Players ICC Rankings Cricket Schedule World News Nepal Protest Live US News Cities Delhi Mumbai Bengaluru Gurugram Noida Hyderabad Chennai Kolkata Bhopal Chandigarh Dehradun Indore Jaipur Lucknow Patna Pune Ranchi Other Cities Business Income Tax Calculator Petrol Prices Diesel Prices Gold Rate Silver Rate Lifestyle Fitness Fashion Health Relationships Art and Culture Travel Recipes Festivals Pet Brunch Entertainment Bollywood TV Web Series Music Hollywood Telugu Cinema Tamil Cinema Anime Education News Engineering Exams Board Exams Study Abroad JEE Exam Results Admission News Employment News Competitive Exams BBA Colleges Engineering Colleges Medical Colleges BCA Colleges BBA Exams BCA Exams Medical Exams Astrology Horoscope Horoscope 2025 Love Horoscope Tarot Chinese Panchang Festival Calendar Compatibility Calculator Career Horoscope Manifestation Transits HT Premium E-Paper The Economist Articles The Wall Street Journal HT Insider HT Insight Videos india news infocus HT Insight Explainer Video On The Record HT Weekend Aur Batao Vikram Chandra Daily Wrap Photos Entertainment Photos Lifestyle Photos News Photos Sports Asia Cup Schedule Asia Cup 2025 Asia Cup Points Table US Sports WWE Football Tennis Hockey Other Sports HT Insight Public Health Economic Policy International Affairs Climate Change Gender Equality knowledge future tech Governance Real Estate Gurugram Real Estate More from HT HT Epaper LiveMint Auto HT Tech HT Bangla HT School Quiz HT Friday Finance HT Premium Explore Hindustan Times HT Newsletters Weather Today About Us Contact Us Privacy Policy Terms of Use Print Ad Rates Code of Ethics Sitemap RSS Feeds Subscription - Terms of Use Privacy and Cookie Settings Copyright © HT Digital Streams Ltd. All rights reserved. Follow Us On My Account Sign in Home Cricket Premium Games"
    },
    {
      "url": "https://cubacenter.org/who-we-are/",
      "text": "Who We Are - Cuba Center Language About Us Who We Are Legion of Honor Videos From the Cuba that is Free Cuban Bloggers Cuban Images Cuban Sounds Cuban History Articles & Events Press Releases Cuba Brief Archives Publications Petitions Contact Us Donate Home / Who We Are Meet the team that fights for a free Cuba Our mission is to promote peaceful transition to a Cuba that respects human rights and political and economic freedoms. OUR BOARD OF TRUSTEES Chairman: Mr. Guillermo G. Marmol | Vice Chairwoman: Ms. Mary Curtis Horowitz | President: Mr. Manuel E. Iglesias, Esq. | Treasurer: Mr. Victor J. Pujals | Dr. Javier Garcia-Bengochea | Mr. Erik P. Bethel | Ambassador Everett E. Briggs | Mr. Néstor Carbonell | Mr. Paquito D’ Rivera | Mr. Erich de la Fuente | Ms. Rosa María Payá Acevedo | Ambassador Otto J. Reich | Mr. Rafael Rubio Núñez | Mr. Luis Velasco | Dr. Eduardo Zayas-Bazan | Counsel: Mr. Filiberto Agusti, Esq. OUR RESEARCH COUNCIL Sebastian Arcos (Florida International University), Dr. Jose Azel (University of Miami), Carolina Barrero (Art Historian), Professor Graciella Cruz Taura (Florida Atlantic University), Professor Dr. Sergio Diaz-Briquets (demographer), Humberto Calzada (award-winning visual artist), Jose Cardenas (Dep of State, NSC, USAID – Emeritus), Professor Carlos Eire (Yale University), Dr. Mark Falcoff (American Enterprise Institute-Emeritus), Ileana Fuentes (feminist critic and author), Alexander Guerrero (Rutgers University), Dr. Alexis Jardines (Florida International University), Professor Eusebio Mujal-León (Georgetown University), Dr. Joaquin P. Pujol (trade and development specialist), Jorge A. Sanguinetty (DevTech Systems, Inc.), Professor Jaime Suchlicki (founder and director, Cuban Studies Institute) Experts from the Center for a Free Cuba Chairman: Mr. Guillermo G. Marmol Learn More Guillermo Marmol has spent a lifetime working for the freedom of the people of Cuba.  Upon graduating from college in 1975 he worked with Frank Calzon and Elena Mederos in creating Of Human Rights, an organization that worked to increase attention on political prisoners in Cuba and other extreme violation of basic liberties in the island.  Mr. Marmol is a founding member of The Center for a Free Cuba and is the Chairman of its Board of Trustees.  The Center builds on the legacy of freedom loving Cubans who worked for decades to win political and economic freedoms for the people of Cuba. As President and Chief Executive Officer of Porosome Therapeutics Inc., Mr. Marmol applies his broad and unique wealth of successful strategic planning, development, and operations experience to bring groundbreaking science and technology to market to treat previously intractable and undruggable conditions. Prior to joining Porosome Therapeutics in 2021, Mr. Marmol served as a member of the executive committee that led the successful turnaround of EDS. He also was Chair of the Operating Committee of Perot Systems Corporation through a period of three-fold growth. Mr. Marmol served as a director (senior partner) of McKinsey & Company. During his 18-year career with McKinsey, he assisted several high-performance organizations in the formulation and execution of growth strategies, which resulted in far above peer group performance. His work in organizational design has been recognized in a variety of publications including the Wall Street Journal. Mr. Marmol has a BA in Engineering and Applied Physics, Magna Cum Laude, from Harvard College, and an MBA with distinction from the Harvard Business School. Vice Chairwoman: Ms. Mary Curtis Horowitz Learn More Mary Curtis Horowitz served as Chairman of the Horowitz Foundation for Social Policy from 2012 to 2023, an organization she founded in 1997 with the late Irving Louis Horowitz, and she continues as a Trustee. The Horowitz Foundation provides small grants to young scholars working in the policy sciences.  From 1995 to 2017, she was President of Transaction Publishers, and before that Vice President at John Wiley & Sons and Editor in Chief at Praeger Publishers.  Mary is a member of the National Council of the Brown School at Washington University in St. Louis; the school grants advanced degrees in social work, public health, and policy.  She is also  a Trustee of Literacy Volunteers of Somerset County, a non-profit group that advocates for English language literacy and provides small group and one-on-one English as a Second Language services to New Jersey residents. President: Mr. Manuel E. Iglesias, Esq. Learn More Manuel Iglesias has dedicated his life to combatting the spread of Communism worldwide. In 1974 as president of the Cuban Students Association at Georgetown University, he established with faculty advisor, Jeanne Kirkpatrick and Frank Calzon and Elena Mederos, the organization Of Human Rights, an organization that worked to bring attention to political prisoners of Cuba and the Castro regime extreme violation of basic liberties in the island. Iglesias has been heavily involved with the Republican Party since 1972. During this period, he has participated in multiple initiatives and campaigns, beginning by working for the White House advanced staff in the 1972 Presidential campaign and became the National Hispanic Coordinator for the Nixon-Agnew in 1972 election. He also held many positions within the Republican National Committee, including as founder of the Hispanic American Young Republicans and as National Chairman of the Heritage Groups Youth Division. Mr. Iglesias served on the transition teams for President Richard M. Nixon in 1972, President Ronald W. Reagan in 1980, President George H.W. Bush in 1988 as well as President Donald J. Trump in 2016.  Most recently, from December 2018 through December 2020, Mr. Iglesias served as the National Chairman of the Republican National Lawyers Association. Manuel Iglesias has combined a professional lifetime of entrepreneurship and the practice of law. Since graduating law school, Iglesias has worked in multinational and Florida law firms in the areas of transactional, securities and healthcare law. Mr. Iglesias also has over 40 years’ experience in entrepreneurship and business consulting. He has served as an Officer or Director for various investment banks and public companies. Since 2003 Mr. Iglesias focused his interest in bringing to market cutting edge services and technologies with a focus on energy, pharmaceutical and healthcare. Mr. Iglesias received a Bachelor of Science in Foreign Service from Georgetown University in 1976, a Juris Doctor from the University of Chicago in 1979, and a Masters in Business Administration also from the University of Chicago Booth School of Business in 1981. Mr. Iglesias has studied French at the University of Lausanne in Switzerland and German at the Goethe Institute in both Germany and Austria. Executive Director: Mr. John Suarez Learn More John Suarez is the Executive Director at the Center for a Free Cuba. Mr. Suarez was a program officer for Latin America Programs at Freedom House.  He has been interviewed by TV, radio and print media on Cuba. Mr. Suarez is a human rights activist. He holds degrees from Florida International University and Spain’s Universidad Francisco de Vitoria. He has testified before the Inter-American Commission on Human Rights in Washington DC, the United Nations Human Rights Council in Geneva, and served as an interpreter for Cuban dissidents in Congressional hearings. Since 2009 he has maintained the blog, Notes from the Cuban Exile Quarter. john.suarez@cubacenter.org Prof. Graciella Cruz-Taura Learn More Dr. Cruz Taura teaches history of Cuba at Florida Atlantic University. Her scholarship on Cuban history and culture ranges from early colonial history (‘Espejo de paciencia’ y Silvestre de Balboa en la historia de Cuba) to recent affairs (Rehabilitating Education in Cuba: Assessment of Conditions and Policy Recommendations). cruz@fau.edu Prof. Carlos Eire Learn More A historian at Yale University who fled from Cuba without his parents in 1962 on the Pedro Pan airlift, writes often in the public sphere about Cuban politics and culture.  His first memoir Waiting for Snow in Havana received the National Book Award for Nonfiction in 2003, and his second memoir, Learning to Die in Miami also became a bestseller.   He is the author of several books on late medieval and early modern religion, including War Against the Idols (Cambridge University Press, 1986);  A Very Brief History of Eternity (Princeton University Press, 2010),  Reformations: The Early Modern World (Yale University Press, 2016), and They Flew: A History of the Impossible (Yale University Press, 2023). All of his books and articles are banned in Cuba, where he has been proclaimed an enemy of the state – a distinction he regards as the highest of all honors. carlos.eire@yale.edu Prof. Jaime Suchlicki Learn More Jaime Suchlicki is Director at the Cuban Studies Institute, CSI, a non-profit research group in Coral Gables, FL. He is the author of Cuba: From Columbus to Castro and Beyond, now in its 5th edition; Mexico: From Montezuma to the Rise of the PAN, 2nd edition, and of the recently published Breve Historia de Cuba. Dr. Suchlicki is often interviewed by TV, radio, and printed media on Cuba and Latin American politics. One of his latest reports is Doing Business in Cuba: Investors Beware. jsuchlicki@cubanstudiesinstitute.com Ambassador Everett E. Briggs Learn More Served as American Ambassador to Panama, Honduras, and Portugal, and as director for Latin America and the Caribbean at the National Security Council. A retired career Foreign Service Officer with a lifelong interest in Cuba, he has been interviewed by print and electronic media and written articles on the island and its people. He lives in Connecticut. snigdom@sbcglobal.net Dr. Jorge Sanguinetty Learn More An economist and founder and chairman of DevTech Systems, Inc. who served in Cuba’s Planning Board under the revolution. He monitors and writes about the Cuban economy, Cuban society, and Cuban foreign affairs. Dr. Sanguinetty is a former president of the Association for the Study of the Cuban Economy, a widely respected organization of economists and experts on Cuba. One of his most recent books focuses on the complexities of the issues of a Cuban transition to a market economy. jsanguinetty@devtechsys.com Dr. Eduardo Zayas-Bazán Learn More Professor Emeritus from East Tennessee State University and a Founder and former President of the National Association of Cuban-American Educators (NACAE) and former President of the American Association of Teachers of Spanish and Portuguese. Dr. Zayas-Bazán has lectured on U.S.-Cuban relations, the Bay of Pigs Invasion, Cuban culture and society. He is also the author of a novel set in the early days of the revolution, El pez volador (“The Flying Fish”). He participated as a frogman in the Bay of Pigs Invasion, was wounded, and served a year in prison before being ransomed by the U.S. government. ezbazan@aol.com Mr. Sebastian Arcos Cazabon Learn More Associate Director of the Cuban Research Institute of Florida International University (FIU) and member while in Cuba of the Cuban Committee for Human Rights, the first independent human rights group in Cuba under Castroism. Mr. Arcos has been interviewed on radio, television and print media about Cuban politics and society. He has also written opinion pieces about Cuba. arcoss@fiu.edu Erik Bethel Learn More Erik Bethel is a global finance professional with experience in the private and public sectors. In 2020 he was nominated to serve as the U.S. Ambassador to the Republic of Panama. Previously, he was nominated by the President and confirmed unanimously by the Senate to represent the United States at the World Bank. At the World Bank, Mr. Bethel spearheaded a number of technology initiatives including artificial intelligence, blockchain, and the tokenization of World Bank loans. Earlier in his career, Mr. Bethel worked as an investment banker and private equity professional focused on Emerging Markets. He was a Managing Director at Franklin Templeton Investments where he executed private equity transactions in Latin America. Prior to this, he was based in Shanghai, China as Managing Partner of SinoLatin Capital and Managing Director of ChinaVest. Earlier in his career, Mr. Bethel held a variety of Emerging Markets-focused private equity and investment banking positions at J.P. Morgan and Morgan Stanley in both New York and Mexico City. Mr. Bethel earned a B.S. in Economics and Political Science from the United States Naval Academy, Annapolis and an M.B.A. from The Wharton School of Business, University of Pennsylvania. He speaks Spanish, Portuguese and Mandarin. Ambassador Otto J. Reich Learn More A former Assistant Secretary of State for the Western Hemisphere and American Ambassador to Venezuela, he appears often on TV and has written extensively on Cuba, Venezuela, and Latin American issues. oreich@ottoreich.com Ms. Ileana Fuentes Learn More Ileana Fuentes was a Pedro Pan Operation unaccompanied minor (1961); holds a BA in History from Fordham University; a Certificate in Women's Leadership from the Rutgers University Hispanic Women Leadership Institute; and pursued graduate work in education and women studies. An expert on Cuban exile culture and art, she directed the landmark émigré art and literature project Outside Cuba/Fuera de Cuba (1985-1989) from her post at Rutgers U. An expert on race, gender and women's history. Founder of Red Feminista Cubana (2003), she is a tireless advocate for women's human rights in Cuba. Fuentes coordinated aid for the Ladies in White (2003); has served as guest panelist for Radio and TV Marti; has coordinated women's self-employment and democracy-building projects; and has written for 25 years for El Nuevo Herald, Diario Las Americas, Revista Encuentro, Diario de Cuba, and Cubanet. Her writings are included in several anthologies; she authored Cuba without caudillos: A feminist approach to the 21st century (Princeton: Linden Lane Press, 1994), and is co-author of Dengue: La epidemia secreta de Fidel Castro (Washington DC: CFC, 2000), and Outside Cuba / Fuera de Cuba: Contemporary Cuban Visual Artists (Rutgers and UM, 1989). She was resident consultant (2009-2016) and founding director (2016-2019) of the American Museum of the Cuban Diaspora, and is guest columnist of CubaNet News. ileanafuentes48@gmail.com Support human rights in cuba: donate & make a difference Support us in defending the island’s residents and exposing rights violations. DONATE Friends of the Center – Experts in Cuba The Hon. Elliott Abrams Learn More A Senior Fellow at the Council on Foreign Relations, Mr. Abrams covers the Middle East and human rights around the world. He writes “Pressure Points,” a CFR blog, about those subjects. He served as Assistant Secretary of State for the Western Hemisphere and for Human Rights in the Reagan administration and as a Deputy National Security Advisor for President George W. Bush. EAbrams@cfr.org Prof. Enrico Mario Santí Learn More William T. Bryan Professor of Hispanic Studies at the University of Kentucky in Lexington. Among his books, the noted Bienes del siglo: sobre cultura cubana, and Fernando Ortiz: contrapunteo y transculturación, about one of Cuba’s indispensable thinkers. Dr. Santí follows on a day-to-day basis developments in Cuba and U.S.-Cuban relations. esant2@email.uky.edu Ms. Rosa María Payá Acevedo Learn More A pro-democracy activist who has led civil society activities in Cuba since 2009. A physicist graduated from the University of Havana, she participated in Georgetown University’s Global Competitive Leadership Program. In Cuba, she was part of the Coordinating Team of the Christian Liberation Movement (MCL) and worked with Somos Liberación, and the Catholic magazine IXTHYS. Since 2013, she has participated in several international fora such as the UN Human Rights Council, the European Parliament, the U.S. Senate, the Organization of American States, the Summit of the Americas, and several national parliaments. She works to promote solidarity with the Cuban people and to seek justice for the murder of her father Oswaldo Payá, winner of the European Parliament’s Sakharov Prize and 5-time Nobel Peace Prize nominee. She is the coordinator of Cuba Decide, an international campaign that seeks to carry out a plebiscite in favor of the first free and multiparty elections in Cuba in 67 years. rmariapaya@cubadecide.org Ms. Carolina Barrero Learn More Carolina Barrero is an art historian, activist, and human rights advocate for the end of violence and authoritarianism, for peace and respect for civil and political rights. She took part in the protest movement that challenged Cuba’s totalitarian regime in 2021 as a member of the 27N movement of artists and intellectuals. She was forced into exile in February 2022. carolinacbarrero@gmail.com Ms. Sylvia G. Iriondo Learn More President of Mothers & Women against Repression (M.A.R. por Cuba), a non-governmental organization dedicated to the promotion of human rights and democracy on the island. She was on board the only plane that made it back to base on that fateful day, February 24, 1996, when Cuban Migs -under orders from Fidel and Raul Castro-shot down two Brothers to the Rescue small unarmed aircraft in international airspace while they searched for refugees in international waters. Three U.S. citizens and one Florida resident were murdered. MAR has denounced the increase in prostitution and sexual abuse of Cuban children resulting from the rise of tourism to the island. She has testified before the U.S. Congress, Inter-American Commission on Human Rights, and has been widely quoted. Sylviairiondo@aol.com In Memoriam Manuel Jorge Cutillas 3/1/1932 – 11/4/2013 A fervent defender of freedom in Cuba, Manuel Jorge Cutillas became president of the Center for a Free Cuba in 1997 and held the position for 16 years, until his death. He was the great-great-grandson of Don Facundo Bacardi, who founded the rum distillery that bears the family’s name. Like many Cubans, Cutillas hoped that the Castro Revolution of 1959 would bring peace and prosperity to the island, after the despotic dictatorship of Fulgencio Batista. It soon became clear that this would not be the case. On October 14, 1960, Mr. Cutillas woke up in Santiago to the news that the Castro government had confiscated the assets of the Bacardi family without paying any compensation. Mr. Cutillas traveled to Havana to request permission to leave the country. The government responded by confiscating his passport. So he did what everyone else did: he boarded a boat and set off anyway. After six days of rough seas, he arrived in Miami. Eventually, he and his family settled in the Bahamas, where Bacardi & Company Ltd. established its headquarters. He spent 45 years with the company. A philanthropist and humanitarian, Cutillas was President of the Lyford Cay Foundation, an organization that awards university scholarships to Bahamian students. Known for his optimistic and entrepreneurial disposition, Cutillas was personally committed to “excellence and entrepreneurial spirit.” An innate creator of consensus, he remains an inspiration at the Center for a Free Cuba. Human rights and women’s rights activist, feminist, suffragette, social reformer, wife and mother, Elena Inés Mederos was above all a leader committed to freedom and progress in Cuba. Ms. Mederos founded several organizations, including the School of Social Services at the University of Havana and the Social Services Foundation, which developed programs for children’s organizations in Cuba. She was a co-founder of the National Feminist Alliance, a suffrage organization active in Cuba during the 1920s. Ms. Mederos was Minister of Social Work in Fidel Castro’s first government and resigned months after her appointment citing differences over her undemocratic leadership. . In 1961, at the age of 61, Mrs. Mederos arrived in the United States after having actively participated in Cuba in opposition to the Castro Government. He joined UNICEF, where he distinguished himself in multiple positions of responsibility. In 1975, together with Frank Calzon, Ms. Mederos founded Of Human Rights, predecessor to the Center For A Free Cuba and a pioneer in documenting the plight of Cuban dissidents. In its defense of human rights and its care for Cuban political prisoners, Of Human Rights was instrumental in raising this issue in important public forums in the United States and abroad. Ms. Mederos’ inspiration to all associated with the Center for a Free Cuba guides our work to this day. Elena Inés Mederos Gonzalez 1/3/1900 – 11/25/1981 William C. Doherty 12/26/1926 – 8/28/2011 William C. Doherty, one of the founders of the Center for a Free Cuba in 1997, was part of its Board of Trustees until his death in 2011. A firm defender of civil rights, unions and workers’ rights, he opposed dictatorships of all types throughout Latin America. Mr. Doherty led AFL-CIO outreach to Latin American unions for 35 years as executive director of the American Institute for Free Labor Development. Doherty was born in Kentucky and studied diplomacy and law at Georgetown University. During his student days, he was a defensive lineman on the Catholic University football team. During World War II, he served as an aerial photographer in Europe with the Army Air Forces, and at the end of the War, according to the Washington Post, “he worked in Germany to help rebuild the unions there.” One of the first supporters of the revolt against Fulgencio Batista in Cuba, he denounced Fidel Castro’s turn toward Marxism as “the betrayal of the revolution.” During his years as a trustee, he explained that the United States was not at war with the Cuban people, but that Americans supported the desire for freedom, human rights, and multiparty elections that the Cuban revolution promised while fighting the old regime. Dr. Irving Louis Horowitz was the Hannah Arendt University Professor Emeritus of Sociology and Political Science at Rutgers University. Along with a small group of Cuban-American intellectuals, businessmen, and civic leaders, he helped found the Center for a Free Cuba, serving on its Research Council until his death in 2012. A noted academic, sociologist, editor, and author, he called the attention to the Stalinist nature of the Cuban revolutionary experiment in the early stages of the revolution. In his numerous books, including nine editions of Cuban Communism, and in his magazine Transaction, he shed light on the nature of the tyrannical regime in Cuba and elsewhere. For him, those who lived in freedom, especially intellectuals, had the moral duty to contribute to putting an end everywhere to the persecution of writers, poets, teachers, workers and peasants. Irving Louis Horowitz 9/25/1929 – 3/21/2012 Jeane J. Kirkpatrick 11/19/1926 – 12/7/2006 Jeane J. Kirkpatrick was one of the founding members of the Center for a Free Cuba with the goal of opposing “the Marxist military junta in Havana and helping Cubans achieve the human rights that God has granted them.” Professor Kirkpatrick taught Political Science at Georgetown University and, as a close friend of Senators Daniel Patrick Moynihan (D-New York), Hubert Humphrey (D-Minn.), and Henry M. Jackson (D-Wash.), was involved in American politics. She was a strong supporter of the American labor movement and the AFL-CIO’s efforts to promote labor rights around the world. She became an advisor to then-presidential candidate Ronald Reagan, and after his election she was appointed United States ambassador to the United Nations, while serving on the National Security Council. A renowned academic, Dr. Kirkpatrick wrote many books and essays, and participated in numerous conferences and panel discussions. He traveled around the world and met with numerous foreign ministers and heads of state. Ambassador Sorzano was a university professor, diplomat, presidential advisor and international businessman. He served on several government boards and commissions and was a member for many years of the board of directors of MasTec Inc. Throughout his life he received numerous scholarships, grants, honors and awards. He always described his life as “the American story.” He came to the United States at the age of 20, with his basketball shoes (he was part of the Cuban national champion team) and five dollars. His first job was mopping floors in the kitchen of the Key Bridge Marriott, where he was offered free food and the opportunity to learn English. To understand what had happened to his native country, he enrolled at Georgetown University, where he earned a degree in International Affairs and later a doctorate in Political Philosophy. In 1972 he obtained American nationality, one of the proudest days of his life. For 18 years he was an Associate Professor of Government at Georgetown University, specializing in political theory. José was also Director of the US Peace Corps in Colombia, South America, which during his tenure became the second largest Peace Corps program in the world. In 1981, President Reagan appointed him US Ambassador to the United Nations as US Representative to the Economic and Social Council of the United Nations and subsequently as Deputy Permanent Representative, Ambassador Extraordinary and Plenipotentiary. Ambassador Sorzano served for five years. In 1987, he was appointed Special Assistant to the President (Ronald Reagan) and Senior Director for Latin American Affairs of the National Security Council, a position he held for almost two years. After leaving government service, he was President of the Cuban American National Foundation, a non-profit organization dedicated to promoting a free, independent and democratic Cuba, after which he established his own international consulting company specializing in joint ventures between US companies and foreigners. Ambassador Jose Silverio Sorzano 11/9/1940 – 12/29/2020 In Memoriam Manuel Jorge Cutillas 3/1/1932 – 11/4/2013 A fervent defender of freedom in Cuba, Manuel Jorge Cutillas became president of the Center for a Free Cuba in 1997 and held the position for 16 years, until his death. He was the great-great-grandson of Don Facundo Bacardi, who founded the rum distillery that bears the family’s name. Like many Cubans, Cutillas hoped that the Castro Revolution of 1959 would bring peace and prosperity to the island, after the despotic dictatorship of Fulgencio Batista. It soon became clear that this would not be the case. On October 14, 1960, Mr. Cutillas woke up in Santiago to the news that the Castro government had confiscated the assets of the Bacardi family without paying any compensation. Mr. Cutillas traveled to Havana to request permission to leave the country. The government responded by confiscating his passport. So he did what everyone else did: he boarded a boat and set off anyway. After six days of rough seas, he arrived in Miami. Eventually, he and his family settled in the Bahamas, where Bacardi & Company Ltd. established its headquarters. He spent 45 years with the company. A philanthropist and humanitarian, Cutillas was President of the Lyford Cay Foundation, an organization that awards university scholarships to Bahamian students. Known for his optimistic and entrepreneurial disposition, Cutillas was personally committed to “excellence and entrepreneurial spirit.” An innate creator of consensus, he remains an inspiration at the Center for a Free Cuba. Elena Inés Mederos Gonzalez 1/3/1900 – 11/25/1981 Human rights and women’s rights activist, feminist, suffragette, social reformer, wife and mother, Elena Inés Mederos was above all a leader committed to freedom and progress in Cuba. Ms. Mederos founded several organizations, including the School of Social Services at the University of Havana and the Social Services Foundation, which developed programs for children’s organizations in Cuba. She was a co-founder of the National Feminist Alliance, a suffrage organization active in Cuba during the 1920s. Ms. Mederos was Minister of Social Work in Fidel Castro’s first government and resigned months after her appointment citing differences over her undemocratic leadership. . In 1961, at the age of 61, Mrs. Mederos arrived in the United States after having actively participated in Cuba in opposition to the Castro Government. He joined UNICEF, where he distinguished himself in multiple positions of responsibility. In 1975, together with Frank Calzon, Ms. Mederos founded Of Human Rights, predecessor to the Center For A Free Cuba and a pioneer in documenting the plight of Cuban dissidents. In its defense of human rights and its care for Cuban political prisoners, Of Human Rights was instrumental in raising this issue in important public forums in the United States and abroad. Ms. Mederos’ inspiration to all associated with the Center for a Free Cuba guides our work to this day. William C. Doherty 12/26/1926 – 8/28/2011 William C. Doherty, one of the founders of the Center for a Free Cuba in 1997, was part of its Board of Trustees until his death in 2011. A firm defender of civil rights, unions and workers’ rights, he opposed dictatorships of all types throughout Latin America. Mr. Doherty led AFL-CIO outreach to Latin American unions for 35 years as executive director of the American Institute for Free Labor Development. Doherty was born in Kentucky and studied diplomacy and law at Georgetown University. During his student days, he was a defensive lineman on the Catholic University football team. During World War II, he served as an aerial photographer in Europe with the Army Air Forces, and at the end of the War, according to the Washington Post, “he worked in Germany to help rebuild the unions there.” One of the first supporters of the revolt against Fulgencio Batista in Cuba, he denounced Fidel Castro’s turn toward Marxism as “the betrayal of the revolution.” During his years as a trustee, he explained that the United States was not at war with the Cuban people, but that Americans supported the desire for freedom, human rights, and multiparty elections that the Cuban revolution promised while fighting the old regime. Irving Louis Horowitz 9/25/1929 – 3/21/2012 Dr. Irving Louis Horowitz was the Hannah Arendt University Professor Emeritus of Sociology and Political Science at Rutgers University. Along with a small group of Cuban-American intellectuals, businessmen, and civic leaders, he helped found the Center for a Free Cuba, serving on its Research Council until his death in 2012. A noted academic, sociologist, editor, and author, he called the attention to the Stalinist nature of the Cuban revolutionary experiment in the early stages of the revolution. In his numerous books, including nine editions of Cuban Communism, and in his magazine Transaction, he shed light on the nature of the tyrannical regime in Cuba and elsewhere. For him, those who lived in freedom, especially intellectuals, had the moral duty to contribute to putting an end everywhere to the persecution of writers, poets, teachers, workers and peasants. Jeane J. Kirkpatrick 11/19/1926 – 12/7/2006 Jeane J. Kirkpatrick was one of the founding members of the Center for a Free Cuba with the goal of opposing “the Marxist military junta in Havana and helping Cubans achieve the human rights that God has granted them.” Professor Kirkpatrick taught Political Science at Georgetown University and, as a close friend of Senators Daniel Patrick Moynihan (D-New York), Hubert Humphrey (D-Minn.), and Henry M. Jackson (D-Wash.), was involved in American politics. She was a strong supporter of the American labor movement and the AFL-CIO’s efforts to promote labor rights around the world. She became an advisor to then-presidential candidate Ronald Reagan, and after his election she was appointed United States ambassador to the United Nations, while serving on the National Security Council. A renowned academic, Dr. Kirkpatrick wrote many books and essays, and participated in numerous conferences and panel discussions. He traveled around the world and met with numerous foreign ministers and heads of state. Ambassador Jose Silverio Sorzano 11/9/1940 – 12/29/2020 Ambassador Sorzano was a university professor, diplomat, presidential advisor and international businessman. He served on several government boards and commissions and was a member for many years of the board of directors of MasTec Inc. Throughout his life he received numerous scholarships, grants, honors and awards. He always described his life as “the American story.” He came to the United States at the age of 20, with his basketball shoes (he was part of the Cuban national champion team) and five dollars. His first job was mopping floors in the kitchen of the Key Bridge Marriott, where he was offered free food and the opportunity to learn English. To understand what had happened to his native country, he enrolled at Georgetown University, where he earned a degree in International Affairs and later a doctorate in Political Philosophy. In 1972 he obtained American nationality, one of the proudest days of his life. For 18 years he was an Associate Professor of Government at Georgetown University, specializing in political theory. José was also Director of the US Peace Corps in Colombia, South America, which during his tenure became the second largest Peace Corps program in the world. In 1981, President Reagan appointed him US Ambassador to the United Nations as US Representative to the Economic and Social Council of the United Nations and subsequently as Deputy Permanent Representative, Ambassador Extraordinary and Plenipotentiary. Ambassador Sorzano served for five years. In 1987, he was appointed Special Assistant to the President (Ronald Reagan) and Senior Director for Latin American Affairs of the National Security Council, a position he held for almost two years. After leaving government service, he was President of the Cuban American National Foundation, a non-profit organization dedicated to promoting a free, independent and democratic Cuba, after which he established his own international consulting company specializing in joint ventures between US companies and foreigners. Subscribe to Cuba Briefs Subscribe to our CubaBrief newsletter to receive timely updates on the latest developments in Cuba, including the continued efforts of Cuban citizens to reinstate democracy and human rights in their country, as well as reports on the hostile and destabilizing actions of the Cuban regime against democracies worldwide. First Name * Last Name * Email Address * Subscribe Please do not fill in this field. About Us Who We Are Legion of Honor Videos Contact Us Donate From the Cuba that is free Cuban Bloggers Cuban Images Cuban Sounds Cuban History Articles & Events Press Release Cuba Brief Archives Publications Petitions Get in Touch  Center for a Free Cuba, 417 West Broad Street, Suite 204, Falls Church, VA 22046  612-367-6845 ©2024 Center for a Free Cuba | All Rights Reserved"
    },
    {
      "url": "https://cubalibrelounge.com/",
      "text": "Cuba Libre Ultra Lounge Home Menu / Price List Reviews Events Banquets More Home Menu / Price List Reviews Events Banquets Home Menu / Price List Reviews Events Banquets WELCOME TO\n CUBA LIBRE WELCOME TO\n CUBA LIBRE WELCOME TO\n CUBA LIBRE WELCOME TO\n CUBA LIBRE Where sophistication meets Latin charm. Immerse yourself in our exclusive venue,  crafted with carefully curated drinks. Our services at Cuba Libre Ultra Lounge Concerts At Cuba Libre, our concerts are an electrifying fusion of diverse music genres that guarantee pure fun and unforgettable moments. From lively salsa nights to dynamic Latin pop and beyond, our stage ignites with energy, inviting you to dance, drink, sing along, and create memories that resonate long after the last note. Join us for an exhilarating musical journey and immerse yourself in the vibrant spirit of our Latin-inspired nightlife. Crafted cocktails Savor expertly crafted cocktails at Cuba Libre, where each drink is meticulously prepared to elevate your evening. Whether you're enjoying a classic mojito or sipping on a specialty cocktail, our bar offers a diverse array of libations designed to enhance your experience. Join us for an unforgettable fusion of flavors and ambiance, where every sip creates moments of pure enjoyment and celebration. Plan Your Event at Cuba Libre Ultra Lounge Welcome to Cuba Libre Ultra Lounge!! Looking for the perfect venue to host your next unforgettable celebration? Whether it’s an elegant wedding reception , a lively birthday bash , an epic graduation party , or any special occasion worth celebrating — Cuba Libre Ultra Lounge has everything you need to make it spectacular. Our stylish, high-energy space features premium sound and lighting, a full-service bar, and a vibrant atmosphere that brings people together. We can accommodate both small and large gatherings, offering a unique Latin ambiance with high-end vibes that your guests will never forget. ✅ Customizable space & seating ✅ Professional staff & bartenders ✅ State-of-the-art sound & lighting ✅ Live DJs or music upon request ✅ Catering options available ✅ Perfect for 21+ private events Let us help you create the celebration of a lifetime. 📩 Contact us today to check availability and start planning your event! High End Experiences Food Discover our tantalizing fusion of Latin American flavors at Cuba Libre, where our appetizers are crafted to complement your evening until we close. From savory empanadas to zesty ceviche, each dish invites you to indulge in the vibrant tastes of Latin cuisine while enjoying your drinks. Join us and elevate your nightlife experience with our delicious bites, perfect for sharing and savoring throughout the night. VIP Sections Experience exclusivity at Cuba Libre with our VIP service. Enjoy access to plush, comfortable seating, a free bottle of champagne, and a spacious, exclusive area reserved just for you. Our dedicated staff ensures you receive personalized attention throughout your visit, creating a memorable and indulgent nightlife experience. Treat yourself to the VIP treatment and discover why Cuba Libre is synonymous with elegance and prestige in Jacksonville Cuba Libre Ultra Lounge in Pictures 2024 Expert's Choice Award Winner Contact Us Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. Cuba Libre Ultra Lounge 2578 Atlantic Boulevard, Jacksonville, Florida 32207, United States (904) 399-0609 cuba@havanajax.com Hours Today Closed Drop us a line! Drop us a line! Name Email* Attach Files Attachments (0) This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Get directions Cuba Libre Ultra Lounge Copyright © 2025 Cuba Libre Ultra Lounge - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.tickeri.com/events/5n7hyb3bt8ym/alex-manga-en-vivo-en-jacksonville",
      "text": "ALEX MANGA EN VIVO EN JACKSONVILLE Tickets | Boletos - Cuba Libre at Havana Jax, Jacksonville | 2025-02-14 - Tickeri.com Open main menu Search for events Log In Register Help ES Feb 14 Jacksonville , Florida Cuba Libre at Havana Jax ALEX MANGA EN VIVO EN JACKSONVILLE Jacksonville , Florida · February 14, 2025 Online tickets not available Share with friends : Details Date : Friday, February 14, 2025 Doors : 9:00 PM * Show : After 11 PM * Age : 18+ Seating : Yes, seating available * Subject to change Venue Cuba Libre at Havana Jax 2578 Atlantic Boulevard Jacksonville , Florida 32207 Event description CELEBRANDO EL DÍA DE SAN VALENTÍN 💝 ALEX MANGA EN CONCIERTO VIP ! SOLO EN CUBA LIBRE ULTRA LOUNGE JACKSONVILLE, FL PARA RESERVACION DE MESAS FAVOR DE LLAMAR A +1 718-255-1787 MAS INFORMACION +1 718-255-1787 Got questions about the event? Phone 718-255-1787 Message the event organizer Videos Artists Alex Manga Event organizer About us Help Contact us Terms Privacy policy El Shop Browse by city Miami Orlando Tampa Atlanta Charlotte DMV (DC, MD, VA) Philadelphia Tri-State (NY, NJ, CT) Chicago Dallas Houston Las Vegas Los Angeles San Francisco Phoenix Salt Lake City Columbus Gulf Port Indianapolis St. Louis Browse by country United States 🇺🇸 Puerto Rico (Coming Soon) 🇵🇷 Canada (Coming Soon) 🇨🇦 Mexico (Coming Soon) 🇲🇽 Peru (Coming Soon) 🇵🇪 Colombia (Coming Soon) 🇨🇴 Chile (Coming Soon) 🇨🇱 Popular Events 🏆 Made with mucho by your Tickeri familia © 2011- 2025 Tickeri, Inc. All Rights Reserved."
    }
  ]
}