{
  "fuentes": [
    {
      "url": "https://locumnest.co.uk/contact-us.php",
      "email": "info@locumnest.co.uk"
    },
    {
      "url": "https://www.theday.com/local/20140130/cuckoos-nests-eclectic-mix-sticks-to-a-winning-formula/",
      "email": "b.hallenbeck@theday.combusiness"
    }
  ],
  "mails": [
    "b.hallenbeck@theday.combusiness",
    "info@locumnest.co.uk"
  ],
  "nombre_sitio": "cucusnestbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://locumnest.co.uk/contact-us.php",
      "text": "Get in Touch with Locum Nest | Contact info@locumnest.co.uk 020 8145 5078 Home Services Refer a Friend Sign Up Contact Us Having a question in mind? Fill the given form and we will get back to you soon Full Name Email Address Phone Number Where did you hear about Locum Nest? ---select option--- I found your platform through a search engine. Someone I know shared your details with me. Discovered your brand through social media. My recruitment agency provided me with your details. Another source not listed above. Enter Your Message Send Message Contact Us - Locum Nest Thank you for considering Locum Nest as your trusted partner for payroll and taxation services. We are dedicated to providing you with top-quality support and assistance for all your financial needs. Whether you have questions, need personalized advice, or want to get started with our services, we're here to help. Call Us Directly 020 8145 5078 Email Us info@locumnest.co.uk Office Address 124 City Road, London, UK, EC1V 2NX Any Query Contact Us Join Us SignUp Now Useful Links Home Services Call us Now About Locum Nest Privacy Policy Contact Us Sign Up Reach Our Office Phone 020 8145 5078 Email info@locumnest.co.uk Address 124 City Road, London, UK, EC1V 2NX © 2025 Locum Nest Limited. All rights reserved locumnest.co.uk"
    },
    {
      "url": "https://www.theday.com/local/20140130/cuckoos-nests-eclectic-mix-sticks-to-a-winning-formula/",
      "text": "Cuckoo's Nest's eclectic mix sticks to a winning formula | The Day Okay Close and Never Show Again You must have javascript enabled to view this site. Email Rejected! x We attempted to send a notification to your email address but we were unable to verify that you provided a valid email address.\r\n         Please visit my profile to update your email address if you wish to receive notifications.\r\n         Otherwise, disable notifications and hide this message. Your session was unable to be renewed and will be expiring in 0 seconds. \r\n            Click here to attempt to renew your session. Norwich to save money on refunding bonds Click on the flag next to a comment to report it. WRITE A LETTER Got something to say? Submit a Letter to the Editor. The Day's Digital Archive 142 years of history at your fingertips. Search for FREE here. Courtney to future college students: Make smart choices Back Crop Undo / Cancel Loading... Edit Photo Info Edit Title Edit Caption Credit Source(s) Save Cancel Featured photo until: Applying … Loading... View Page in Progress Cuckoo's Nest's eclectic mix sticks to a winning formula Back To Top About the Day 200 State St. New London, CT 06320 USA Staff Profiles President/Publisher Newsroom Advertising/Marketing FAQs Jobs at The Day Contact Us Quck Links E-Paper Contests Horoscopes Puzzles Movies & TV Milestones Newsletters Advertising About Our Ads Advertise Place a Classifieds Ad Contact Find New London Area Jobs Business Directory Services Day Media Group Photo Reprints Privacy Policy & Terms RSS Text & SMS Alerts"
    }
  ]
}