{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://dadscorp.com/contactus",
      "email": "aa@dadscorp.com"
    },
    {
      "url": "https://www.calldad.com/contact-us",
      "email": "info@calldad.com"
    },
    {
      "url": "https://www.forbes.com/sites/chloesorvino/2019/05/30/the-13-siblings-who-saved-their-family-by-creating-a-300-million-startup-from-their-dying-dads-protein-bar-recipe/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/chloesorvino/2019/05/30/the-13-siblings-who-saved-their-family-by-creating-a-300-million-startup-from-their-dying-dads-protein-bar-recipe/",
      "email": "csorvino@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/chloesorvino/2019/05/30/the-13-siblings-who-saved-their-family-by-creating-a-300-million-startup-from-their-dying-dads-protein-bar-recipe/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://www.dcbar.org/about/contact",
      "email": "coa@dcappeals.gov"
    },
    {
      "url": "https://www.dcbar.org/about/contact",
      "email": "odcinfo@dcodc.org"
    },
    {
      "url": "https://www.nashvillepost.com/business/development/daddys-dogs-founder-developing-east-nashville-bar/article_cfc832b4-43a6-11ef-82ed-33b1907a75a5.html",
      "email": "info@nashvillepost.com"
    },
    {
      "url": "https://www.nashvillepost.com/business/development/daddys-dogs-founder-developing-east-nashville-bar/article_cfc832b4-43a6-11ef-82ed-33b1907a75a5.html",
      "email": "tips@nashvillepost.com"
    }
  ],
  "mails": [
    "aa@dadscorp.com",
    "coa@dcappeals.gov",
    "corrections@forbes.com",
    "csorvino@forbes.com",
    "feedback@forbes.com",
    "info@calldad.com",
    "info@nashvillepost.com",
    "odcinfo@dcodc.org",
    "sales@finewineliquors.com",
    "tips@nashvillepost.com"
  ],
  "nombre_sitio": "curiaonthedrag.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://dadscorp.com/contactus",
      "text": "Contact Us | DADS Corporation Skip to Content Home Shop Events Courses Services Pricing Company News Success Stories About Us Jobs Contact us 0 0 +1 555-555-5556 Sign in Contact Us 0 0 Home Shop Events Courses Services Pricing Company News Success Stories About Us Jobs Contact us +1 555-555-5556 Sign in Contact Us Contact us Contact us about anything related to our company or services. We'll do our best to get back to you as soon as possible. Name * Phone Number Email * Company Subject * Question * Email To Submit My Company 3575 Fake Buena Vista Avenue +1 555-555-5556 info@yourcompany.example.com Useful Links Home About us Products Services Legal Privacy Policy Forum Contact us About us We are a team of passionate people whose goal is to improve everyone's life through disruptive products. We build great products to solve your business problems. Our products are designed for small to medium size companies willing to optimize their performance. Connect with us Contact us aa@dadscorp.com +918069474760 Follow us Copyright © Company name Powered by - \n                    The #1 Open Source eCommerce We use cookies to provide you a better user experience on this website. Cookie Policy Only essentials I agree"
    },
    {
      "url": "https://www.calldad.com/contact-us",
      "text": "Contact Us | Call Dad AC & Heating Making HVAC Comfortable Locations Contact Us Careers Book Online 833-234-2141 Locations Asheville, NC Charlotte, NC Greensboro, NC Hickory, NC Raleigh, NC Winston-Salem, NC Charleston, SC Columbia, SC Greenville, SC Air Conditioning AC Maintenance AC Repair Air Conditioning Installation Air Handler Repair Ductless Mini Split Evaporator Coil Heating Furnace Installation Furnace Repair Heat Pump Heater Installation Heating Maintenance Heating Repair Oil Furnace Repair Air Quality Air Duct Cleaning HVAC Dehumidifier HVAC Filter Replacement Smart Thermostat Installation UV Air Sanitizer Company All HVACÂ Services Locations About Us Contact Us Radio Ads Guarantees Frequently Asked Questions Resources \"Family First\"Â Club D.A.D. University HVACÂ Training Financing Expert Center Government Rebates and Tax Credits 833-234-2141 Book online Contact Us Contact us today to schedule an appointment with a Call Dad professional - we are here to make HVAC comfortable for you. Web Scheduler You can request the work or information you need online hassle-free. Click the button below to submit a request for a service or a free estimate. Book Online Call or Text Call us today and weâll get right to work on scheduling the repair or installation. We can provide you with a free quote on the work you need. 833-234-2141 Send a message Have questions that you canât find the answers to, or a unique service need beyond installation or repair? Fill out our contact form and weâd be happy to assist you. Go to form 40,000 + Customers Served 12,500 + Systems Installed 120+ Qualified Experts âOur [Call Dad AC & Heating] tech was very knowledgeable, on time, and hard working. He went above and beyond to make sure all of our needs were met, and spent more time checking other parts of our system to make sure nothing else was faulty. Absolutely will use againâ David Harwood Asheville, NC âCody was professional and helpful! He kept me in the loop about the process and was very thorough and knowledgeable. I highly recommend this company!â Andrea Ciciarelli Mount Pleasant, SC âHad an emergency with no heat on Christmas Eve. Called these guys at 9:00 in the morning. I figured there was no way we could get anyone out that day, but they showed up at 5:30 and replaced a contact to fix the heat. It had dipped to 48 degrees inside. [Call Dad AC & Heating] literally saved Christmas! Thank you so much for helping us out.â Tim Lupin Asheville, NC See all google reviews Contact Us Request an appointment Have questions about your HVAC service, or want to get in touch?Â Use the form below to leave us a message and one of our team will respond quick! Asheville, North Carolina Charlotte, North Carolina Greensboro, North Carolina Hickory, North Carolina Raleigh, North Carolina Winston-Salem, North Carolina Charleston, South Carolina Columbia, South Carolina Greenville, South Carolina Link Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Link Service needed (Select all that apply) Service Installation Maintenance Repair Thank you! Your submission has been received! We'll be in touch shortly. Oops! Something went wrong while submitting the form. Asheville, NC Charlotte, NC Greensboro, NC Hickory, NC Raleigh, NC Winston-Salem, NC Charleston, SC Columbia, SC Greenville, SC What we do Most Popular Services. Repairing your current system takes skilled technicians that arenât out to oversell to meet quota. Air Conditioning services Keeping you cool and comfortable when you need it most. Learn more about our air conditioning services. See services Heating services When the temperatures drop, our service rises. Learn about our repair and replacement heating services. See services Air Quality services Let us install an indoor air quality device to free your air from mold, mildew, and debris. Leaving the air you breathe fresh & healthy. See services Why should you call dad? We make HVAC comfortable. Every Call Dad technician is background screened and drug tested, so you can feel safe and sound. Our techs roll up right on time in a service van loaded with most used repair parts. Theyâll get your repairs done quick, keep you in the loop every step of the way, and leave your space spic and span. When theyâre done, you wonât even know they were thereâexcept for the cool air, of course! Fantastic and flexible financing options Helping make HVAC more accessible Best customer service in the business We take the time to do the job right The highest quality products around We only use OEM parts & name brand units One year warranty on all labor and parts Guaranteed, and Dad Approved Trusted expert ACÂ &Â Heating Technicians Our D.A.D. University Training is the best around 24/7 Emergency ACÂ &Heating Service Day or night, weâre here for you Join the club âFamily First\" Club The âFamily Firstâ Club includes a 21-point inspection twice a year â once in the spring and once in the fall. Find out more about our membership below! Membership info D.a.d. University - Dependable Accurate diagnostics Training For Future HVAC Technicians. Call Dad has launched University of D.A.D., an in-house HVAC apprentice training school, offering paid training for beginners. The aim is to produce skilled HVAC technicians to serve customers in the Carolinas. Apply today Contact Us Need HVAC Service? Call today or submit a request to ask any question. 833-234-2141 Book Online Explore About Us Locations Careers FAQs Contact Us Book Online Services All HVACÂ Services Air Conditioning Heating Air Quality Resources \"Family First\" Club D.A.D. University HVACÂ Training Financing Expert Center Radio Ads Legal Copyright Notice Disclaimer Privacy Policy Terms and Conditions info@calldad.com Asheville, NC 36 Rosscraggon Road Suite G Asheville, NC 28803 Charlotte, NC 4400 Stuart Andrew Blvd, Suite N Charlotte, NC 28217 Greensboro, NC 6905 Downwind Road Greensboro, NC 27409 Hickory, NC 920 Tate Blvd, Suite 107 Hickory, NC 28602 Raleigh, NC 3200 Gresham Lake Road Suite 101 Raleigh, NC 27604 Winston-Salem, NC 8075 North Point Blvd. Suite A Winston-Salem, NC 27106 Charleston, SC 1111 Bowman Rd Suite C Mt Pleasant, SC 29464 Columbia, SC 1410 St. Andrews Road Suite 270 Columbia, SC, 29210 Greenville, SC 501 Richardson Street Suite C Simpsonville, SC, 29681 Â© 2023 Call Dad AC & Heating. All rights reserved. Site by Sweven By using this website, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. You also agree to keep the cookies away from dad. Mom has been fighting this fight forever and your help is greatly appreciated. View our Privacy Policy for more info. Nom Nom Nom (I Agree)"
    },
    {
      "url": "https://www.forbes.com/sites/chloesorvino/2019/05/30/the-13-siblings-who-saved-their-family-by-creating-a-300-million-startup-from-their-dying-dads-protein-bar-recipe/",
      "text": "The 13 Siblings Who Saved Their Family By Creating A $300 Million Startup From Their Dying Dad’s Protein Bar Recipe Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Business Food & Drink Daily Cover The 13 Siblings Who Saved Their Family By Creating A $300 Million Startup From Their Dying Dad’s Protein Bar Recipe Tim Pannell for Forbes By Chloe Sorvino , Forbes Staff. Chloe Sorvino is a New York-based Forbes staff writer who covers food. Follow Author May 30, 2019, 07:06am EDT Updated Apr 30, 2022, 04:20pm EDT Share Save Comment This story appears in the June 30, 2019 issue of Forbes Magazine. Subscribe L eigh Keith is taking her time flattening a mound of peanut butter, honey, cranberries and chocolate chips with a wooden rolling pin, before cutting it into 4-inch rectangles. She used to do this at race speed, when she and her siblings worked through the night to fill orders for their peanut-butter bars 14 years ago, when they were starting Perfect Snacks. “We didn’t even have the recipe written down,” the 33-year-old says, her wavy hair—blond, like nearly all the Keiths—fastened securely by a hair net. “We started out with a whole lot of ambition. The harder we worked, the more we put into the business, the more we could try and control our destiny.” At the beginning, the Keiths didn’t have much besides their drive. The family of 15’s bank account? Nearly empty. The family real estate? Heavily mortgaged. Dad was sick with cancer. (“We started because we were financially in despair,” says Bill, 36, who is CEO.) All they really had was their father’s recipe for a peanut-butter-based protein bar. And everyone who knew the grocery business told them it was doomed to fail. Sure, the Keiths’ Perfect Bar tasted great, but it needed to be kept refrigerated. That meant it would take up valuable shelf space that would otherwise go to yogurt or cold cuts, far from where Clif and Power bars typically lived. It was like asking stores to start stocking cheese alongside cereal. “With all of your . . . finances invested in peanuts and honey to the very last dollar, you sure as heck got to figure out how to sell this bar,” Leigh says. “Very few companies were really designed to save a family from potential starvation,” says Wayne Wu, a partner at VMG, a San Francisco private equity firm that invested in Perfect Snacks in 2015. “It turned into this American dream story. But it certainly was not an overnight success.” Overnight or not, Perfect Snacks is most definitely a success now. The company did $84 million in 2018 sales, and Forbes conservatively estimates its worth at $300 million. Perfect Snacks’ 16 flavors of $2.49 bars are now sold in over 27,000 stores nationwide, including giants like Target, Walmart, Kroger and Trader Joe’s. The siblings’ father, Bud, came up with the bars while on an extended road trip with his brood in the ’90s. He had quit his 9-to-5 marketing juicers for Jack LaLanne, the fitness guru and former TV-show host, to become a traveling salesman of supplements and omega oils and lecturer-cum-inspirational speaker about healthy living. Rather than leave his family behind, he packed the entire clan—then seven children—into a 1982 21-foot Dodge RV. On the road, Bud developed the recipe for the peanut-butter bars, mixing in the protein powder he sold to make them more nutritious. The kids would sometimes sell them around the neighborhood for pocket money. (In one particularly good year, they earned close to $2,200, helping pay the family’s way to Disneyland.) Bud sometimes added them as a free bonus to supplement orders. As the clan grew to 13 children, Bud and Barbara Keith bought a bed-and-breakfast in a small northern California town but still relied on Bud’s lectures to support the family. Then Bud fell ill with melanoma at 57. By 2005 it was so bad he had to stop traveling. Soon the Keiths had a mountain of medical bills and were two months behind on their mortgage, with $1,000 in the bank and nine kids under 18. Bunks Near The Butter: With six kids in six years, the Keiths were crunched for space. Papa Keith converted kitchen cabinets in their small San Diego home into beds. courtesy of Perfect BAr As Bud got sicker, the eldest children stepped in. Bill, then a 22-year-old junior on the basketball team at College of the Redwoods, dropped out. He was joined by Leigh, then 19, and his siblings Amyas, 18, and Charisse, 17 (now Perfect Snacks’ senior director of operations). They decided to ignore the conventional wisdom and their father’s ten years of struggles in different ventures. “Our backs were against the wall from day one,” says Leigh. First order of business: Raise some working capital. The kids quickly sold the bed-and-breakfast, netting $100,000 after taxes. Two thirds of that went to a used candy-wrapping machine to package the bars, the rest toward organic peanuts and honey. “With all of your . . . finances invested in peanuts and honey to the very last dollar, you sure as heck got to figure out how to sell this bar,” Leigh says. Next, they specialized. Bud moved to San Diego, where the family was originally from, taking some of the clan with him. (He would die of his disease in 2009.) Leigh, Bill, Amyas and Charisse stayed in Sacramento, sharing a two-bedroom apartment. Bill went on the road to pitch their snacks, branded as Perfect Bars, to natural-foods stores and grocery chains up and down the West Coast. Leigh, Amyas and Charisse stationed themselves at home to make the products. No Holds Barred; Perfect Snacks pioneered refrigerated protein bars; its snacks are now sold nationwide, including in 8,500 Starbucks. courtesy of Perfect Bar Still, by 2006, after a year in the business, the Keiths had made little headway, and they had enough cash left to fund only one more month of operations. Then, by chance, Bill met a Whole Foods store manager at a music-and-art festival in northern California. She loved it and figured Whole Foods customers would both dig the idea of a preservative-free protein bar and be curious enough to pick up one from a refrigerated case. Perfect Snacks got a 30-day trial at the manager’s Berkeley Whole Foods. Bill was the in-store pitchman. With no money for a hotel, he lived in his car for a month, showering at a gym. Perfect Snacks sold $20,000 at that Whole Foods in a month, more than it had in the past six months combined—and enough for Whole Foods to expand Perfect Snacks to ten more northern California locations. “That was the match that started the wildfire,” Bill says. Revenue hit a million dollars two years later, and soon a Costco deal followed. Then sales really took off after a cash infusion from the 2015 VMG investment allowed Perfect Snacks to place bigger orders from contract manufacturers and, in turn, take larger orders from grocers. After throwing caution to the wind to start their business, the Keiths, who still own the majority of Perfect Snacks, are now moving more thoughtfully. They’ve chosen to concentrate on rolling out Perfect Kids (portioned for lunch boxes) and Perfect Bites (tiny cubes in resealable containers) rather than launching entirely new products. (“They’ve stayed really focused. A lot of companies like that get some success and start trying to extend the brand into a million other things,” says John Foraker, former CEO of Annie’s, the organic mac ’n’ cheese company.) As the Keiths project sales reaching $130 million by the end of 2019, their battles revolve around finding enough refrigerated trucks to ship their goods cheaply—the boom in fresh grocery items has led to a shortage of drivers and freight prices are surging—and persuading grocery stores to give them better real estate. For now, they’re largely in dairy cases, and the Keiths envision their products in little coolers by the registers, the way Red Bull displays its drinks. “We have the story, the product and the people that can really build this to be a household name and become hopefully an iconic brand for generations,” Leigh says. “The rolling pins are gone. We’re just getting started.” Got a tip? Share confidential information with Forbes. Editorial Standards Reprints & Permissions © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://www.dcbar.org/about/contact",
      "text": "DC Bar - Contact Contact Us Find a Member Sign In Search Toggle Mobile Menu Search For Lawyers MyDCLawyer MyDCLawyer MyDCLawyer Profile Guidelines Membership Membership Frequently Asked Questions Certificates & Forms How to Join Member Connection Suite Member Benefits Free Trust Accounting & Billing Software by Smokeball New Members Membership Classes & Fees District of Columbia Practice Manual Continuing Legal Education Continuing Legal Education Why D.C. Bar CLE? MCLE Credit Courses CLE Abroad CLE Passport Publications Paralegal and Legal Assistant Training Program FAQ and Contact Information AI & ChatGPT Basics Series Communities Communities Join A Community About Communities Programs and Events Publications Connect Leadership Resource Portals Communities On-Demand Library Public Statements Communities Elections Leadership Podcasts Diversity, Equity, Inclusion, and Accessibility Resources Communities Newsletter Annual Well-Being Summit D.C. Bar Communities Lawyer of the Year Awards Legal Ethics Legal Ethics Rules of Professional Conduct Ethics Opinions 210-Present Ask the Ethics Experts Court of Appeals Adopts Amendments to IOLTA Rules Ethics Advice Ethics Opinions Substantively Affected by the Amended Rules D.C. Bar Voluntary Standards of Civility in Professional Conduct Publications Additional Resources Speaking of Ethics Columns Legal Ethics Opinions 2-209 Practice Management Advisory Service Practice Management Advisory Service Courses and Trainings Frequently Asked Questions Get Advice Practice Management Advisor Assessment Practice Tips and Compliance Mentoring Resource Mandatory Course Mandatory Course Process for New Admittees Process for Other Members Lawyer Assistance Program Lawyer Assistance Program Who We Are What We Do Who We Help We Can Help With Career Center Career Center Career Assistance New Member Reception Court News and Judicial Notices External Resources External Resources Legal Links Research Voluntary Bars Fee Dispute Program View All For Lawyers For the Public Legal Resources Legal Resources Family Housing Public Benefits Corporation Environment Estates Resolve Attorney Problems Resolve Attorney Problems Clients’ Security Fund Fee Dispute Program File a Complaint Free Legal Help Hiring a Lawyer Representing Yourself D.C. Courts File a Judicial Complaint View All For the Public For Students Joining the D.C. Bar Law Student Community Lawyer Assistance Program for Law Students Pro Bono Opportunities for Law Students View All For Students Pro Bono About the Center About the Center Successes Pro Bono Center Leadership Pro Bono Center Staff Reports and Financial Information Newsletter Archive Our Mission, Vision and Values News Volunteer Opportunities Volunteer Opportunities How to Volunteer Meet Our Volunteers Resources and Training Resources and Training Pro Bono Center Training Program Pro Bono Partnership Learning from Success Probono.net/dc Free Legal Help Free Legal Help Help for Individuals Help for Nonprofits Help for Small Businesses LawHelp Donate What We Do What We Do Advice & Referral Clinic Advocacy & Justice Clinic Bankruptcy Clinic Family Law Assistance Network Housing Right to Counsel Project Immigration Legal Advice & Referral Clinic Legal Information Help Line Nonprofit & Small Business Legal Assistance Future Planning and Probate Program View All Pro Bono Donate to the Pro Bono Center Your contributions are making a difference in Washington, D.C. With your support, the Pro Bono Center’s innovative clinics, court-based resource centers, and projects will help more than 20,000 District residents living in poverty. Attorney Discipline For the Public For Lawyers Board on Professional Responsibility Board on Professional Responsibility Board Hearing Committee Approved IOLTA Depositories Office of the Executive Attorney Rules Hearing and Oral Argument Schedule Forms and Documents Annual Reports Office of Disciplinary Counsel Office of Disciplinary Counsel Purpose and Mission Certificate Concerning Discipline Filing a Complaint Informal Admonitions Office of Disciplinary Counsel Staff Disciplinary Counsel’s Column Frequently Asked Questions Pending Cases Disciplinary Decisions Attorney Discipline News Attorney Discipline News Administrative Order 2020-8:  Live Streams of Hearing Committee Proceedings Administrative Order 2023-1:  Return to In-Person Proceedings The Court of Appeals Makes Appointments to the Board on Professional Responsibility Amendments to the Rules of the Board on Professional Responsibility Volunteer Opportunities View All Attorney Discipline News & Events News Publications Publications D.C. Bar Blog Washington Lawyer Editorial Guidelines Signature Events Signature Events Celebration of Leadership Presidents Reception Practice 360° Lawyers Have Heart 2026 D.C. Bar Tax Conference Constitution in the Classroom Upcoming Classes & Programs Advertise and Sponsor Advertise and Sponsor Advertising Guidelines Advertise in Washington Lawyer Sponsor Our Events Advertise on the D.C. Bar Website Advertise on SmartBrief and Bar Bulletin Media Inquiries View All News & Events About Who We Are Who We Are Leadership Mission Strategic  Plan Rules and Bylaws Reports Member Spotlight Annual Report Membership Demographics Our Headquarters Our Headquarters COVID Guidelines & Visitor Policy Broadcast Studio Meetings and Events Get Involved Get Involved Volunteer Opportunities Become a Speaker or Instructor Submit a Proposal/Article for Washington Lawyer Awards Awards Past Award Winners William J. Brennan Jr. Award FAQs Employment Opportunities Contact View All About Contact The D.C. Bar This page contains all the contact information you need in order to get in touch with us. You are here: About Contact Share Page Print Page For questions regarding your membership record, please email [email protected] . To reach other departments within the D.C. Bar: BOARD OF GOVERNORS If you would like to contact a member of the Board of Governors, you may send an email to [email protected] . Please include the name(s) of the member(s) to whom you would like to direct your communication. CLE For information on CLE courses/events, including registration and/or access inquiries, or CLE credit inquiries, please email [email protected] . COMMITTEE ON ADMISSIONS For information or inquiries regarding applying to the D.C. Bar, including existing application status and exam inquiries, please email [email protected] . COMMUNITIES For information on courses/events held by the D.C. Bar Communities department, including registration and access questions, please email [email protected] . For information on Communities membership and/or benefits, please email [email protected] . PRO BONO For information on Pro Bono legal help, volunteer/training opportunities or donations, please email [email protected] . OFFICE OF DISCIPLINARY COUNSEL For ethical complaints against members of the D.C. Bar or for other disciplinary related matters, including inquiries for a Certificate Concerning Discipline and disciplinary history, please email [email protected] . Your Email Address Reason for Contact Please Select... Admissions Information (Application Status or Exams) Certificates of Good Standing CLE (Credits or Courses) Communities Membership Communities Registration Disciplinary Information Managing My Membership Media Inquiries Website Inquiries Other First Name Last Name Daytime Phone Number Phone number will not be used to send you SMS Bar Number (optional) Organization/Firm Comment/Question Google reCAPTCHA v3 If you receive a recaptcha error, please click the submit button again. D.C. Bar Office The District of Columbia Bar 901 4th Street, NW Washington, D.C. 20001 Visiting? How to get to the Bar Find nearby Parking Office Number Phone: 202.737.4700 Toll Free: 1.877.333.2227 Member Service Phone: 202.626.3475 Toll Free: 1.877.333.2227 ext. 3475 [email protected] Hours (Monday - Friday): 9 a.m. to 1 p.m. 2 p.m. to 5 p.m. This site uses essential cookies that include tracking technologies to assist with navigation and your ability to provide feedback, analyze your use of our products and services, assist with our promotional and marketing efforts, and provide content from third parties. View Privacy Policy Accept For Lawyers Membership Communities Legal Ethics Lawyer Assistance Program Practice Management Advisory Service Awards Washington Lawyer For the Public Legal Resources Hiring a Lawyer Free Legal Help Resolve Attorney Problems Representing Yourself D.C. Courts For Students Committee on Admissions Communities Regulation Counsel Fulfill My Community Service Student Volunteer Opportunities About Who We Are Advertise with us Media Inquiries Frequently Asked Questions Get Involved Employment Opportunities About the Pro Bono Center Donate to the Pro Bono Center Contact Us Excellence in Practice. Excellence in Service. 901 4th Street, NW, Washington, DC 20001 202-737-4700 © 2025 The District of Columbia Bar. All rights reserved. Terms & Conditions For Lawyers MyDCLawyer MyDCLawyer Profile Guidelines Membership Frequently Asked Questions Certificates & Forms How to Join Member Connection Suite Member Benefits Free Trust Accounting & Billing Software by Smokeball New Members Membership Classes & Fees District of Columbia Practice Manual Continuing Legal Education Why D.C. Bar CLE? MCLE Credit Courses CLE Abroad CLE Passport Publications Paralegal and Legal Assistant Training Program FAQ and Contact Information AI & ChatGPT Basics Series Communities Join A Community About Communities Programs and Events Publications Connect Leadership Resource Portals Communities On-Demand Library Public Statements Communities Elections Leadership Podcasts Diversity, Equity, Inclusion, and Accessibility Resources Communities Newsletter Annual Well-Being Summit D.C. Bar Communities Lawyer of the Year Awards Legal Ethics Rules of Professional Conduct Ethics Opinions 210-Present Ask the Ethics Experts Court of Appeals Adopts Amendments to IOLTA Rules Ethics Advice Ethics Opinions Substantively Affected by the Amended Rules D.C. Bar Voluntary Standards of Civility in Professional Conduct Publications Additional Resources Speaking of Ethics Columns Legal Ethics Opinions 2-209 Practice Management Advisory Service Courses and Trainings Frequently Asked Questions Get Advice Practice Management Advisor Assessment Practice Tips and Compliance Mentoring Resource Mandatory Course Process for New Admittees Process for Other Members Lawyer Assistance Program Who We Are What We Do Who We Help We Can Help With Career Center Career Assistance New Member Reception Court News and Judicial Notices External Resources Legal Links Research Voluntary Bars Fee Dispute Program For the Public Legal Resources Family Housing Public Benefits Corporation Environment Estates Resolve Attorney Problems Clients’ Security Fund Fee Dispute Program File a Complaint Free Legal Help Hiring a Lawyer Representing Yourself D.C. Courts File a Judicial Complaint For Students Joining the D.C. Bar Law Student Community Lawyer Assistance Program for Law Students Pro Bono Opportunities for Law Students Pro Bono About the Center Successes Pro Bono Center Leadership Pro Bono Center Staff Reports and Financial Information Newsletter Archive Our Mission, Vision and Values News Volunteer Opportunities How to Volunteer Meet Our Volunteers Resources and Training Pro Bono Center Training Program Pro Bono Partnership Learning from Success Probono.net/dc Free Legal Help Help for Individuals Help for Nonprofits Help for Small Businesses LawHelp Donate What We Do Advice & Referral Clinic Advocacy & Justice Clinic Bankruptcy Clinic Family Law Assistance Network Housing Right to Counsel Project Immigration Legal Advice & Referral Clinic Legal Information Help Line Nonprofit & Small Business Legal Assistance Future Planning and Probate Program Attorney Discipline For the Public For Lawyers Board on Professional Responsibility Board Hearing Committee Approved IOLTA Depositories Office of the Executive Attorney Rules Hearing and Oral Argument Schedule Forms and Documents Annual Reports Office of Disciplinary Counsel Purpose and Mission Certificate Concerning Discipline Filing a Complaint Informal Admonitions Office of Disciplinary Counsel Staff Disciplinary Counsel’s Column Frequently Asked Questions Pending Cases Disciplinary Decisions Attorney Discipline News Administrative Order 2020-8:  Live Streams of Hearing Committee Proceedings Administrative Order 2023-1:  Return to In-Person Proceedings The Court of Appeals Makes Appointments to the Board on Professional Responsibility Amendments to the Rules of the Board on Professional Responsibility Volunteer Opportunities News & Events News Publications D.C. Bar Blog Washington Lawyer Editorial Guidelines Signature Events Celebration of Leadership Presidents Reception Practice 360° Lawyers Have Heart 2026 D.C. Bar Tax Conference Constitution in the Classroom Upcoming Classes & Programs Advertise and Sponsor Advertising Guidelines Advertise in Washington Lawyer Sponsor Our Events Advertise on the D.C. Bar Website Advertise on SmartBrief and Bar Bulletin Media Inquiries About Who We Are Leadership Mission Strategic  Plan Rules and Bylaws Reports Member Spotlight Annual Report Membership Demographics Our Headquarters COVID Guidelines & Visitor Policy Broadcast Studio Meetings and Events Get Involved Volunteer Opportunities Become a Speaker or Instructor Submit a Proposal/Article for Washington Lawyer Awards Past Award Winners William J. Brennan Jr. Award FAQs Employment Opportunities Contact Contact Us Find a Member Sign In"
    },
    {
      "url": "https://www.nashvillepost.com/business/development/daddys-dogs-founder-developing-east-nashville-bar/article_cfc832b4-43a6-11ef-82ed-33b1907a75a5.html",
      "text": "Daddy's Dogs founder developing East Nashville bar | Development | nashvillepost.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Welcome, Guest Sign Up Log In Dashboard Logout My Account My Account Dashboard Profile Saved items Logout Latest Business Development Health care Headline Homes Finance Legal People Music Retail Technology Entrepreneurs M&A Manufacturing Partner Content Politics State Metro Elections People Federal Courts Sports Titans Predators Nashville SC Sounds Vanderbilt UT Olympics People Preps Area Colleges First & Tenn Podcast It's All Your Fault Podcast Magazine E-edition Past Issues Most Powerful Women 2025 Innovation & Ideas Events Most Powerful Women 2025 In Charge Plaques Photo Galleries Subscribe Site search Search Facebook Twitter LinkedIn Instagram Welcome, Guest Register Log In Dashboard Logout My Account My Account Dashboard Profile Saved items Logout Toggle navigation Site search Search Latest Business Development Health care Headline Homes Finance Legal People Music Retail Technology Entrepreneurs M&A Manufacturing Partner Content Politics State Metro Elections People Federal Courts Sports Titans Predators Nashville SC Sounds Vanderbilt UT Olympics People Preps Area Colleges First & Tenn Podcast It's All Your Fault Podcast Magazine E-edition Past Issues Most Powerful Women 2025 Innovation & Ideas Events Most Powerful Women 2025 In Charge Plaques Photo Galleries Subscribe Share This Facebook Twitter WhatsApp LinkedIn SMS Email Development Daddy's Dogs founder developing East Nashville bar Gramp's Garage to join burgeoning Gallatin Pike corridor Staff Reports Staff Reports Author email Jul 16, 2024 Jul 16, 2024 Updated Jul 26, 2024 Facebook Twitter WhatsApp LinkedIn SMS Email Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Sean Porter Courtesy of Daddy's Dogs The creators of Daddy’s Dogs are set to bring a new bar called Gramp’s Garage to East Nashville. Founder Sean Porter has requested a permit to conduct renovations at the 2913 A Gallatin Pike site. The building is owned by Trinity Corner, LLC which bought the site for $685,000 in 2014. The structure featuring a garage door is next to Tiger Bar and the former home of Eastside Music Supply (which recently relocated to Dickerson Pike) and adjoining East Tattoo Collective . The Post was unable to determine details about the concept or an opening date for Gramp's. Daddy’s Dogs has five locations in the Nashville area, including its flagship spot in The Nations. The business is also planning a Madison location. It has satellite locations at Nissan Stadium and Ober Gatlinburg, as well as three carts in and around Downtown Nashville. The bar is not related to Grandpa Bar coffee and cocktails, which is located at 1501 Herman St. and opened in October 2023. Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Tags Daddy's Dogs Sean Porter Grandpa Bar Staff Reports Author email Follow Staff Reports Trending Subscribers only Headline Homes: August 2025 Ten takeaways from Titans' ugly season-opening loss in Denver Subscribers only Dolly Parton hotel seeks lease agreement with Metro Subscribers only Food Notes: Mel’s Drive-In opens on Second Avenue Subscribers only For-sale recording studio property sees asking price dropped Sections Latest Business Politics Sports Events Magazine Do business with us Meet the team Reach out to us Subscribe Manage your account Advertise FAQs Contact us nashvillepost.com 615 Main Street, Suite 102 Nashville, TN 37206 Phone: 615-844-9307 Email: info@nashvillepost.com Facebook Twitter LinkedIn Instagram × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox Do Not Sell or Share My Personal Information © Copyright 2025 Nashville Post 615 Main Street, Suite 102, Nashville, TN | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    }
  ]
}