{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://cypresswood.net/contact-us",
      "email": "sales@cypresswood.net"
    },
    {
      "url": "https://cypresswood.net/about-us",
      "email": "sales@cypresswood.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "jodi.meinhardt@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "jonathon.gutierrez@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "kelly.ellis@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "lloyd.turner@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "cheryl.foster@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "dwight.williams@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "felicia.mckinney@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "heather.yates@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "joan.delgado@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "joshua.chronister@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "kyle.critton@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "laura.cassidy@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "les.sarles@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "lisa.bergeron@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "marissa.mitchell@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "meaghan.markette@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "penny.harvey@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "tammi.deaton@cfisd.net"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "email": "tyisha.jenkins@cfisd.net"
    },
    {
      "url": "https://cypresschargers.com/Athletic_Training/Staff_Directory",
      "email": "ashley@ashleyhudsontherapy.com"
    },
    {
      "url": "https://cypresschargers.com/Athletic_Training/Staff_Directory",
      "email": "nmarinello@cypresscollege.edu"
    },
    {
      "url": "https://cypresschargers.com/Athletic_Training/Staff_Directory",
      "email": "rkirkpatrick@cypresscollege.edu"
    }
  ],
  "mails": [
    "ashley@ashleyhudsontherapy.com",
    "cheryl.foster@cfisd.net",
    "dwight.williams@cfisd.net",
    "felicia.mckinney@cfisd.net",
    "heather.yates@cfisd.net",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "joan.delgado@cfisd.net",
    "jodi.meinhardt@cfisd.net",
    "jonathon.gutierrez@cfisd.net",
    "joshua.chronister@cfisd.net",
    "kelly.ellis@cfisd.net",
    "kyle.critton@cfisd.net",
    "laura.cassidy@cfisd.net",
    "les.sarles@cfisd.net",
    "lisa.bergeron@cfisd.net",
    "lloyd.turner@cfisd.net",
    "marissa.mitchell@cfisd.net",
    "meaghan.markette@cfisd.net",
    "nmarinello@cypresscollege.edu",
    "penny.harvey@cfisd.net",
    "rkirkpatrick@cypresscollege.edu",
    "sales@cypresswood.net",
    "sales@finewineliquors.com",
    "tammi.deaton@cfisd.net",
    "tyisha.jenkins@cfisd.net"
  ],
  "nombre_sitio": "cypresswoodcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * name Surname Datenschutz E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://cypresswood.net/contact-us",
      "text": "Contact Us | Price's Wood Products Home About About Us About Cypress Products Cypress Products Hardwood Products Tongue & Groove Beams Flooring Kiln Services Moulding Our Location Contact Us Select Page Contact us Give us a call, send us an email, we would love to hear from you! Price’s Wood Products, LLC P.O. Box 70 Maringouin, Louisiana 70757 Telephone (225) 718 – 4297 (225) 718 – 4296 Email : sales@cypresswood.net Payment Types Contact Us  Phone (225) 718 – 4297 (225) 718 – 4296  Address 12100 LA-77, Maringouin, LA 70757  Email sales@cypresswood.net Privacy Policy Terms of Use Cajun Cloud Services LLC | © Copyright 2025"
    },
    {
      "url": "https://cypresswood.net/about-us",
      "text": "About Us | Price's Wood Products Home About About Us About Cypress Products Cypress Products Hardwood Products Tongue & Groove Beams Flooring Kiln Services Moulding Our Location Contact Us Select Page About Price’s Wood Products About Price’s Wood Products exceptional team. Here at Price’s Wood Products, we are the Alpha and the Omega, your lumber starts with us from the growing timber and ends in a finished product with unmatched quality.  Our management team has over 125 years of combined experience in the wood products industry. We are not resellers of other companies products; we are a professional manufacturer of custom lumber products. Our team knows the lumber grade rules, knows the capability of our products, and adheres to our motto of delivering only the best wood products in the industry. We tailor to our customers’ specific needs with attention to the details. We have a state of the art operation that allows us to be efficient and precise in our manufacture of your product. We have the ability to Saw, Kiln, Dry, Profile, Store, and Package our full range of lumber products. This allows us to maintain tight tolerances, exceptional Q/C, and the high standards our customers have come to expect. Price’s Wood Products Owner’s Message “I believe in building strong relationships with our customers. I have instilled this in our team, because a satisfied customer will be back to purchase our products again. I invite you to explore our website, learn about the details of our processes, products, and how we can help YOU our customer succeed in your endeavors. Please reach out to us so we can assist with your next project.” Our owner has over 20 years in the timber procurement, sawmilling, kiln drying, and final manufacturing stages of Cypress lumber and southern hardwoods. Because of this PWP is nationally recognized as an expert in these fields. We are a privately owned company dedicated to providing customer satisfaction and top of the line lumber and millwork products. Who we are Retail sales – Nationwide DIY , Home Owners, Contractors, and Architects. Wholesale – Nationwide and Export Customers in truckload quantities from small private lumber yards to massive public distribution yards. Who we service Retail customers – via internet nationwide and locally. Homeowners, Builders, Contractors, Architects and D-I-Y’s. Wholesale customers – nationwide. To Buy From Us Contact us by phone or email Use the “Contact Us’ for to send details of your needs What We Do Produce and ship Cypress Products nationwide. Produce flooring and mouldings from almost any species of wood. Sell a variety of wood products. Custom Kiln Dry Lumber for commercial and wholesale customers. Manufacturing Capabilities Our modern machinery empowers us to produce high-quality millwork products, including Cypress tongue and groove, siding, and various types of moulding. Our slogan, “Where are the knife marks?” reflects our commitment to delivering exceptionally smooth products. Our facility includes three dry kilns with a total capacity of 190,000 board feet, an automatic lumber stacker, and a Newman 382 quiet cut 30″ double surface planer. We also have a Weinig 23C Hydromat moulder, straight line rip saws, gang rip saws, band resaw, and double end trimming equipment. Our lumber inspection process ensures quality at every stage of production, along with efficient container unloading and loading. We boast a 1,000,000 BF dry storage capacity and truck scales. With our extensive equipment and milling expertise, we can produce just about anything you need. Contact us today to discuss your specific requirements Payment Types Contact Us  Phone (225) 718 – 4297 (225) 718 – 4296  Address 12100 LA-77, Maringouin, LA 70757  Email sales@cypresswood.net Privacy Policy Terms of Use Cajun Cloud Services LLC | © Copyright 2025"
    },
    {
      "url": "https://cywoods.cfisd.net/our-school/faculty-staff/administrative-team",
      "text": "Administrative Team - Cypress Woods High School Skip To Main Content Close Menu Search Clear Search Our School About Us General Information History Enrollment & Demographics Attendance Boundary Maps (opens in new window/tab) Residential Code Listing (opens in new window/tab) School Ratings (opens in new window/tab) Faculty & Staff Administrative Team Staff Emails (opens in new window/tab) Attendance Attendance Policies Absences Career Investigation Visit College Day Requests Military Day Requests Semester Exemptions Clinic Cypress Woods Library Library Resources (opens in new window/tab) Accessing e-Books Librarian District Library Policy Registrar Volunteers (VIPS) VIPS Contact Us Academics Library Resources (opens in new window/tab) HORIZONS Gifted & Talented (opens in new window/tab) Course Descriptions (opens in new window/tab) Home Access Center (HAC) (opens in new window/tab) Advanced Placement (AP) Courses AP Exam Registration (opens in new window/tab) AP Testing Information (opens in new window/tab) Campus Policies (opens in new window/tab) Pass Fail Information Destination Imagination Dual Credit Classes (opens in new window/tab) LTE Central Schoology (opens in new window/tab) Semester Exemption Policy Tutoring Cat Shack Parents & Students Resources SchoolMessenger Community Flyers (opens in new window/tab) Student Insurance (opens in new window/tab) Cy-Fair Tipline Cy Woods Preschool (opens in new window/tab) Child Find Services Fines & Fees Transcript Requests (opens in new window/tab) School Cash Online Bringing out the Best (opens in new window/tab) Request a Language Interpreter (opens in new window/tab) Policies & Procedures Campus Policies Code of Student Conduct/Student Handbook (opens in new window/tab) Conduct on School Premises Policy (opens in new window/tab) Counseling Counseling Team College and Career (opens in new window/tab) Dual Credit (opens in new window/tab) Parent Information FAFSA/TASFA Graduation Requirement Registration - Course Selection Senior Conference Information Back-to-School Information College and Career College & Career College and Career Tips PSAT Test Financial Aid Scholarship News College Academy Military PSAT / SAT Information (opens in new window/tab) ACT Information (opens in new window/tab) Financial Aid (FAFSA) (opens in new window/tab) Scholarships College Academy (opens in new window/tab) Dual Credit (opens in new window/tab) Parking Schedules Bell Schedule Verification of Enrollment (VOE) Student Activities Activities Activities AFJROTC Cheer Choir (opens in new window/tab) Crimson Cadettes (opens in new window/tab) The Crimson Connection (opens in new window/tab) Band (opens in new window/tab) FFA (opens in new window/tab) Orchestra (opens in new window/tab) Speech and Debate Student Council Theater (opens in new window/tab) CDUB Media Destination Imagination POWER Week Seniors Senior Information Transcripts Graduation  Schedule and Tickets (opens in new window/tab) FAFSA/TASFA Graduation Requirement (opens in new window/tab) Senior Conference Information Spirit Days UIL Academics Yearbook Information Athletics Staff Booster Club (opens in new window/tab) RankOne Sport (opens in new window/tab) Athletic Teams Boys Athletics Girls Athletics Hockey (opens in new window/tab) Summer Sports Camps Strength, Agility & Conditioning Camp Baseball Camp Boys Basketball Camp Girls Basketball Camp Cross Country Camp Football Camp Softball Camp Soccer Camp Volleyball Camp Wrestling Camp Tickets (opens in new window/tab) News & Announcements (opens in new window/tab) Calendar Quick Links Bell Schedules (opens in new window/tab) Menus (opens in new window/tab) Buses (opens in new window/tab) Parent Portal (opens in new window/tab) Tipline SchoolCash Online (opens in new window/tab) Facebook (opens in new window/tab) Twitter (opens in new window/tab) Instragram (opens in new window/tab) District Schools Elementary schools Adam Elementary School Andre' Elementary School Ault Elementary School Bane Elementary School Bang Elementary School Birkes Elementary School Black Elementary School Brosnahan Elementary School Byrd Elementary School Copeland Elementary School Danish Elementary School Duryea Elementary School Emery Elementary School Emmott Elementary School Farney Elementary School Fiest Elementary School Francone Elementary School Frazier Elementary School Gleason Elementary School Hairgrove Elementary School Hamilton Elementary School Hancock Elementary School Hemmenway Elementary School Holbrook Elementary School Holmsley Elementary School Hoover Elementary (PK-2) School Horne Elementary School Jowell Elementary (3-5) School Kirk Elementary School Keith Elementary School Lamkin Elementary School Lee Elementary School Lieder Elementary School Lowery Elementary School McGown Elementary School Matzke Elementary School McFee Elementary School Metcalf Elementary School Millsap Elementary School Moore Elementary School Owens Elementary School Pope Elementary School Post Elementary School Postma Elementary School Reed Elementary School Rennell Elementary School M. Robinson Elementary School A. Robison Elementary School Sampson Elementary School Sheridan Elementary School Swenke Elementary School Tipps Elementary School Walker Elementary School Warner Elementary School Wells Elementary School Willbern Elementary School Wilson Elementary School Woodard Elementary School Yeager Elementary School Middle Schools Anthony Middle School Aragon Middle School Arnold Middle School Bleyl Middle School Campbell Middle School Cook Middle School Dean Middle School Goodson Middle School Hamilton Middle School Hopper Middle School Kahla Middle School Labay Middle School Rowe Middle School Salyards Middle School Smith Middle School Spillane Middle School Sprague Middle School Thornton Middle School Truitt Middle School Watkins Middle School High Schools Bridgeland High School Cy-Fair High School Cypress Creek High School Cypress Falls High School Cypress Lakes High School Cypress Park High School Cypress Ranch High School Cypress Ridge High School Cypress Springs High School Cypress Woods High School Jersey Village High School Langham Creek High School Special Campuses ALC East ALC West Brautigam Center Carlton Center Carpenter Center Open Menu Logo Image Logo Title Cypress Woods High School Spirit of 212° Quick Links Bell Schedules (opens in new window/tab) Menus (opens in new window/tab) Buses (opens in new window/tab) Parent Portal (opens in new window/tab) Tipline SchoolCash Online (opens in new window/tab) Open Search Search Clear Search Close Search Our School About Us Faculty & Staff Attendance Clinic Cypress Woods Library Registrar Volunteers (VIPS) Contact Us Academics Library Resources (opens in new window/tab) HORIZONS Gifted & Talented (opens in new window/tab) Course Descriptions (opens in new window/tab) Home Access Center (HAC) (opens in new window/tab) Advanced Placement (AP) Courses Campus Policies (opens in new window/tab) Pass Fail Information Destination Imagination Dual Credit Classes (opens in new window/tab) LTE Central Schoology (opens in new window/tab) Semester Exemption Policy Tutoring Parents & Students Resources Policies & Procedures Counseling Back-to-School Information College and Career Parking Schedules Verification of Enrollment (VOE) Student Activities Activities CDUB Media Destination Imagination POWER Week Seniors Spirit Days UIL Academics Yearbook Information Athletics Staff Booster Club (opens in new window/tab) RankOne Sport (opens in new window/tab) Athletic Teams Hockey (opens in new window/tab) Summer Sports Camps Tickets (opens in new window/tab) News & Announcements (opens in new window/tab) Calendar About Us Faculty & Staff Attendance Clinic Cypress Woods Library Registrar Volunteers (VIPS) Contact Us In This Section About Us General Information History Enrollment & Demographics Attendance Boundary Maps (opens in new window/tab) Residential Code Listing (opens in new window/tab) School Ratings (opens in new window/tab) Faculty & Staff Administrative Team Staff Emails (opens in new window/tab) Attendance Attendance Policies Absences Career Investigation Visit College Day Requests Military Day Requests Semester Exemptions Clinic Cypress Woods Library Library Resources (opens in new window/tab) Accessing e-Books Librarian District Library Policy Registrar Volunteers (VIPS) VIPS Contact Us Home > Our School > Faculty & Staff > Administrative Team Administrative Team Staff Emails (opens in new window/tab) Administrative Team Lloyd Turner Kelly Ellis Associate Principal/Assistant Principals Coordinating Counselor/Counselors Associate Principal/Assistant Principals Jonathon Gutierrez Meaghan Markette Students: A - C Dwight Williams Students: D - F Tyisha Jenkins Students: G - I Lisa Bergeron Students: J - L Marissa Mitchell Students: M - P Les Sarles Students: Q - S Joshua Chronister Students: T - Z Coordinating Counselor/Counselors Jodi Meinhardt Gabby Delgado Students: A - Cam Felicia McKinney Students: Can - Fen Penny Harvey Students: Feo - Hoa Tammi Deaton Students: Hob - Loo Heather Yates Students: Lop - Ngo Cheryl Foster Students: Ngp - Roc Laura Cassidy Students: Rod - Thi Kyle Critton Students: Thj - Z Logo Image Logo Title Cypress Woods High School 13550 Woods-Spillane Blvd. Cypress TX 77429 281-213-1800 Facebook (opens in new window/tab) Twitter (opens in new window/tab) Instragram (opens in new window/tab) Privacy Policy Site Map Accessibility Powered by Finalsite"
    },
    {
      "url": "https://cypresschargers.com/Athletic_Training/Staff_Directory",
      "text": "Staff Directory -  Cypress Chargers Skip to navigation Skip to content Skip to footer Cypress Chargers Sports Men's Sports Baseball Schedule Roster News Instagram Basketball Schedule Roster News Instagram Golf Schedule Roster News Soccer Schedule Roster News Instagram Swim & Dive Schedule Roster News Instagram Water Polo Schedule Roster News Instagram Women's Sports Basketball Schedule Roster News Instagram Beach Volleyball Schedule Roster News Instagram Flag Football Schedule Roster News Instagram Soccer Schedule Roster News Instagram Softball Schedule Roster News Instagram Swim & Dive Schedule Roster News Instagram Volleyball Schedule Roster News Instagram Water Polo Schedule Roster News Instagram Inside Athletics Athletics Calendar Staff Directory Facilities Athletic Training Department Sports Information Department Visitors Guide Coaches Handbook Photo Gallery Eligibility Championships Athletic Department News EADA Data Internships Student-Athletes Recruiting Forms Student-Athlete Bio Form Student-Athlete Handbook Food Pantry Academics Become A Charger Student Athlete Success Center Athletic Counselors Student-Athlete Success Study College & University Transfer Info Hall of Fame Hall of Fame Donate NIL More Tickets Donate Shop Search search MAIN MENU MAIN MENU MAIN MENU Sports Men's Sports Baseball Schedule Roster News Instagram Basketball Schedule Roster News Instagram Golf Schedule Roster News Soccer Schedule Roster News Instagram Swim & Dive Schedule Roster News Instagram Water Polo Schedule Roster News Instagram Women's Sports Basketball Schedule Roster News Instagram Beach Volleyball Schedule Roster News Instagram Flag Football Schedule Roster News Instagram Soccer Schedule Roster News Instagram Softball Schedule Roster News Instagram Swim & Dive Schedule Roster News Instagram Volleyball Schedule Roster News Instagram Water Polo Schedule Roster News Instagram Inside Athletics Athletics Calendar Staff Directory Facilities Athletic Training Department Sports Information Department Visitors Guide Coaches Handbook Photo Gallery Eligibility Championships Athletic Department News EADA Data Internships Student-Athletes Recruiting Forms Student-Athlete Bio Form Student-Athlete Handbook Food Pantry Academics Become A Charger Student Athlete Success Center Athletic Counselors Student-Athlete Success Study College & University Transfer Info Hall of Fame Hall of Fame Donate NIL More Tickets Donate Shop Search search Search Site Search Search Search socials Twitter Instagram Facebook Youtube Tree Composite Schedule Athletic Training Staff Directory Concussion Medical Eligibility Sportsware Student Assist Program Mental Health Book Appointment Nutrition Services Freshman or Transfer Physical Documentation/PPE Returning Student-Athlete PPE More Staff Directory Nicolette Marinello, MS ATC Head Athletic Trainer Nicolette Marinello was selected for the Athletic Trainer position in Fall 2021 after serving as an hourly athletic trainer with Cypress College since 2019. Nicolette has had a diverse background in the field of athletic training thus far. Nicolette received her Bachelor’s degree in Kinesiology with an emphasis in Athletic Training from Chapman University. She had the opportunity to work with Chapman’s athletic teams on the field and in the clinic during athletic games and practices. She graduated with her Master’s Degree in Athletic Training from Chapman University and provided care at multiple colleges including Vanguard University, Chapman University, Cypress College, El Camino College, and Mt. SAC Community College. Through those experiences, she learned to work with collegiate athletes from many different sports including football, soccer, lacrosse, softball, baseball, tennis, water polo, volleyball, and basketball. Prior to the COVID-19 pandemic, Nicolette provided care to athletes from Cypress College and LA Galaxy through rehabilitating injured athletes and assisting in injury prevention protocols with her fellow sports performance specialists. While working with LA Galaxy, she gained experience in treating injuries in elite athletes at the highest level of competition as well as closely collaborating with the registered dieticians and strength and conditioning specialists. Nicolette had been working at Cypress College as a part-time Athletic Trainer since summer of 2019 and had taken the full-time Athletic Trainer position starting in Fall of 2021. She continues to strive for the best comprehensive wellness approach for all student-athletes by encompassing a larger health care team, including Team Physician, Team Fellows, Team Physical Therapist, Team Chiropractor, Sports Psychologist, Dietician, and Team Dentist. As the Head Athletic Trainer, Nicolette oversees all medical aspects of the 14 intercollegiate sport programs. Nicolette believes that treating the patient as a whole is the optimal approach to comprehensive wellness. She believes wellness encompasses mental and socioemotional wellbeing in addition to physical health. She continues to improve the student-athlete experience by building a health care team to allow for the highest level of student success. Athletic training is an ever-evolving field, and she strives to be progressive in her practice. In a field of continuous new advancements and innovations in health care, she believes it is essential to embrace lifelong learning and integrate emerging evidence-based practice to enhance patient care. Athletic Training Clinic: (714)-484-7381 (office) Email: nmarinello@cypresscollege.edu Rachael Kirkpatrick, DAT, ATC Head Athletic Trainer Rachael Kirkpatrick join ed the Charger family in Fall of 2021 as Head Athletic Trainer. She comes to us from Barstow College where she served as the Head Athletic Trainer for 5 years. Rachael began her education at Chapman University. In 2014, she earned a Bachelor of Science in Athletic Training with a Minor in Psychology. During her undergraduate time, Rachael completed clinical rotations at 2 fellow CCCAA institutions, local Orange County Public and Private High Schools, USA Volleyball and volunteered with the Anaheim Ducks of the NHL. After graduating from Chapman, Rachael continued her education at Indiana State University where she earned a Doctorate in Athletic Training (DAT) in May of 2017. During her time as a Graduate Assistant Athletic Trainer, Rachael served as the Head Athletic Trainer for North Vermillion High School in Cayuga, IN. In 2017, Rachael returned to California and became the Head Athletic Trainer at Barstow College from 2017-2021. With the Vikings, Rachael also served in dual roles as the Interim Athletic Director (‘18-’20) and Eligibility Specialist (‘20-’21). Additionally, Rachael supported the following programs while at BCC: Food Insecurity Committee Student Engagement Committee Chaired the Community “B Well” Health and Wellness Fair 2017, 2018 1 st Annual Student PRIDE Celebration Authored the BCC COVID-19 Athletics Return Plan CCCATA COVID-19 Advisory Committee In Fall of 2021, Rachael Kirkpatrick and Nicolette Marinello, took over as Co-Head Athletic Trainers for Cypress College Athletics. Cypress College Sports Medicine strives to provide holistic patient-centered care with its diverse healthcare team. Since 2022, Kirkpatrick and Marinello have developed a comprehensive medical staff including: Team Sports Medicine Physicians, Orthopedic Surgeons, Physical Therapist, Sports Medicine Chiropractor, Sport Psychologist, Dietitian, and Dentist. It is the mission of Cypress College Sports Medicine to provide 1) evidence-based care, 2) personalized accessible interventions, and 3) an inclusive environment. Rachael currently serves as an institution representative within the Orange Empire Conference (OEC) as well as a member of the Student-Athlete Advisory Committee (SAAC). Rachael volunteers as a Clinical Preceptor for both CSULB and CSUF Master of Science in Athletic Training (MSAT) students. She is passionate about Athletic Training and believes in the importance of mentoring and developing the next generation of healthcare providers. Rachael looks forward to continuing to develop and advance the Sports Medicine Department at Cypress College. Go Chargers! Athletic Training Clinic: (714)-484-7381 (office) Email: rkirkpatrick@cypresscollege.edu Ellexis Khan, M.D. Team Physician Ellexis Khan, MD, attended medical school at Ross University in Dominica, and went on to complete her residency in family medicine at Robert Wood Johnson University Hospital in New Brunswick, New Jersey. After her residency, she completed her fellowship in primary care sports medicine at UC Irvine. She chose a career in primary care sports medicine because of her passion for athletics. After playing Rugby during her undergraduate at BYU, she knew she wanted to stay connected with sports and athletes by providing a service needed for athletes at any age. Dr. Khan enjoys working with patients to provide options to help make informed decisions with their health care. MemorialCare Medical Group – Long Beach (Sports Medicine) https://www.memorialcare.org/services/sports-medicine Joshua Snodgrass, M.D., CAQSM Team Physician Joshua Snodgrass, MD, is thrilled to be coming onboard as a MemorialCare Medical Group physician. As both a Primary Care and Sports Medicine provider, Dr. Snodgrass is dedicated to caring for his patients as a whole and is active in discovering emerging technologies and treatments, including sports concussion and evaluation experience with ultrasound-guided musculoskeletal injections. He is also Titleist Performance Institute Certified, which is the world's leading educational organization dedicated to the study of how the human body functions in relation to the golf swing. Dr. Snodgrass has a variety of Sports Medicine affiliations, including holding a position as Team Physician for Long Beach State Athletics and Cypress College. In addition to his various Sports Medicine associations, Dr. Snodgrass offers sideline sports coverage for the action sports industry for snowboarding, skateboarding, surfing, and mountain biking events. He is also a proud medical volunteer for NCAA, FIVB, USA Water Polo and RunDisney. MemorialCare Medical Group – Long Beach (Sports Medicine) https://www.memorialcare.org/services/sports-medicine Dr. Michael Shepard, M.D. Team Orthopedic Surgeon Dr Shepard is a board certified Orthopaedic Surgeon who is subspecialty trained in sports medicine with special emphasis on the care of the overhead athlete and knee ligament reconstruction. Dr Shepard’s clinical expertise includes elbow and shoulder injuries of the overhead athlete, elbow arthroscopy, and complex knee reconstruction. Dr Shepard is one of the few doctors in California to provide game day coverage for Major League Baseball and The National Football League. In the office, Dr. Shepard participates in the care of athletes from the NFL, MLB, NHL, NBA, NCAA, US Olympic teams, and the PGA/LPGA tours. Orthopaedic Specialty Institute Dr. Roni Negro, DC, DACBSP Team Chiropractor Email: sportychiro@gmail.com Dr. Fumiaki Isshiki, PT, DPT Team Physical Therapist Dr. Fumiaki Isshiki \"Fumi\" was born and raised in Japan. He received his Bachelor's of physical therapy degree at Kobegakuin University in Japan. He was a Pilates Instructor during his college days and played baseball until the senior year. He worked with professional baseball team and outpatient physical therapy clinic in Japan. After that, he moved to The United States. Received his Master of Science in Musculoskeletal Physical Therapy at University of Pittsburgh. Internship with NFL Pittsburgh Steelers and MLB Seatle Marriners. Attended proprioceptive neuromuscular facilitation residency program at Kaiser Rehabilitation Hospital Vallejo. After that, He went to Loma Linda University to pursue his Post Professional Doctor of Physical Therapy Degree. On the same time, he received Doctor of Osteopathy and Master of Athletic Therapy from National University of Medical Science in Spain. Email: Fumiaki.isshiki.dpt@gmail.com Dr. Daryn T. Nishikawa, DDS Team Dentist Dr. Daryn Nishikawa earned his Bachelor of Science degree from the University of California, Irvine (UCI), and his Doctor of Dental Surgery (DDS) degree from the Herman Ostrow School of Dentistry at the University of Southern California (USC).  After completing his graduate degree at USC, he went on to complete a General Practice Residency at the University of California, Los Angeles (UCLA) at the Ronald Reagan Hospital. There he received special training in hospital-based dentistry, which included treating and managing severely medically compromised patients, and caring for patients with Special Needs. After residency, he has volunteered his time teaching at the USC School of Dentistry and working in private practice.  In early 2016, he aided in developing the dental clinic at SpaceX in the City of Hawthorne, where he was the lead (solo) dentist for two and a half years. Since the summer of 2018, Dr. Daryn has enjoyed becoming the owner of his practice where he continues to cater towards those with Special Needs and the general public of the South Bay. Furthermore, Dr. Daryn has been active in Sports Dentistry, volunteering his time and serving as the Associate Team Dentist for the MLS Chivas USA team (2012-2015), and MLS Los Angeles Football Club (2018- present).  He is also an active volunteer Dentist for the United States Olympics and Paralympic Committee. Email: Hello@Nishikawafamilydentistry.com Nick Padula Team Dietitian Nick Padula has been practicing Dietitian for eight years in the state of California as a clinical dietitian, a foodservice director; and currently as an educator with the University of Southern California Master's Nutrition program and private practice owner of LBC Nutrition. He studied nutrition and dietetics at Long Beach State University and received a Bachelor's degree in 2012 and Master's degree in Nutrition and Dietetics with a concentration in Sports Nutrition from Texas Tech University. In his sports practice he has worked with triathletes, professional boxers, endurance runners, professional soccer players, high school athletes, and the USC football and basketball teams. Nick is an avid runner, weightlifter, and golfer. Jana Nicholl Team Dietitian Jana Nicholl is a Registered Dietititian and International Board Certified Lactation Consultant. She's an Adjunct Instructor in the department of Family and Consumer Sciences, Nutrition and Dietetics Program at Long Beach City College. She's experienced in pediatric and neonatal nutrition, critical care nutrition, and lactation. She enjoys writing and educating future professionals. She hosts a free podcast called \"RD Exam Made Easy Podcast\" which teaches nutrition concepts through the power of storytelling to help dietetic interns get across the finish line and pass the RD exam. Jana immigrated from Canada and attended California State University, Long Beach where she completed her Bachelor of Science degree in Sports Nutrition, and the Dietetic Internship. Lily Bolgov Team Dietitian Lilia Bolgov is a practicing dietitian in the Southern California area with over 14 years of experience in clinical nutrition, foodservice management, and patient education. She completed her Master in Business Administration degree from Western Governor's University and Master of Science degree in Nutrition Science, and Dietetic Internship from California State Polytechnic University in Pomona. Her passion is helping others achieve overall wellness, positive mindset, and a healthy relationship with food. She is also an advocate for infertility and women's reproductive rights. She is currently working as a Supervising Health Educator at Kaiser Permanente Medical Center focusing on preventative care and reducing health disparities in the community. Ashley Hudson, LMFT Team Psychologist Ashley Hudson is a licensed marriage and family therapist with over 12 years of experience in mental health and a unique specialization in working with athletes. As the founder of Ashley Hudson Therapy in Orange County, CA, she is dedicated to empowering individuals navigating challenges like anxiety, depression, sports performance anxiety, body image issues, trauma, and relational conflicts. A Yorba Linda native, Ashley played Division 1 collegiate softball at UC Davis, giving her firsthand insight into the demands and pressures athletes face. Her early career included coaching high school softball and volunteering at a local group home, sparking her passion for supporting young athletes. With a master's degree in Clinical Psychology from Azusa Pacific University, Ashley’s practice incorporates Brainspotting and CBT, highly effective therapeutic modalities for athletes dealing with mental blocks, performance pressures, and self-doubt. As a group owner, clinical supervisor, and licensed therapist since 2010, she brings a wealth of experience and a compassionate approach to her work with clients. At Ashley Hudson Therapy, the team offers both in-person and telehealth counseling throughout Orange County, utilizing an eclectic, client-centered approach that adapts to individual needs. Rooted in attachment and strength-based frameworks, their practice supports children, teens, and young adults, with a focus on mental health issues that commonly affect athletes, including sports anxiety, recovery from injuries, teammate conflicts, and identity shifts related to retirement from sports. Ashley’s personal journey overcoming sports anxiety and mental blocks further fuels her commitment to helping athletes achieve resilience, confidence, and success both on and off the field. Company Name: Ashley Hudson Therapy 1-714-202-6721 ashley@ashleyhudsontherapy.com www.ashleyhudsontherapy.com 16960 Bastanchury Rd. Suite E Yorba Linda, CA 92886 Share Facebook Twitter Email Print Affiliates CYPRESS COLLEGE ATHLETICS 9200 Valley View Street, Cypress, CA 90630 714-484-7000 Twitter Instagram Facebook Youtube Tree Shop Donate Tickets Learn about the site developer © 2025 Cypress College - All Rights Reserved. Privacy Policy | Terms of Use We use cookies to ensure you have the best browsing experience on our website. By using our site, you acknowledge that you have read and understood our Privacy Policy & Terms of Service . I Accept"
    }
  ]
}