{
  "fuentes": [
    {
      "url": "https://www.staygainesville.com/cypress-grove-brewing-co-a-delicious-taste-of-gainesville",
      "email": "info@staygainesville.com"
    },
    {
      "url": "https://www.visitgainesville.com/event/jazz-bandits-at-cypress-and-grove-brewing-company/",
      "email": "info@visitgainesville.com"
    },
    {
      "url": "https://www.visitgainesville.com/organizer/cypress-grove-brewing-company/",
      "email": "info@visitgainesville.com"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "abyrne@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "afriedrich@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "agilbert@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "alyons@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "amason@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "aroquet@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "asalazar@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "ataylor@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "awells@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "bernst@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "bgwinner@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "ccooke@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "cgrafe@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "cmay@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "coneal@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "cray@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "dschultea@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "dsolomon@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "fborroni@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "fherrning@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "hdecker@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "jahelymartinez@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "jdecoste@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "jkillingsworth@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "jmullins@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "kanderson@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "katterbury@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "khouse@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "kjobb@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "kkey@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "kmontgomery@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "kpalasota@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "ksullivan@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "lcummings@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "llewis@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "lringer@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "ltrainham@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mbaltuswilson@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mcaperton@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mdalton@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mgoodwin@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mhelm@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mmassie@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "mskow@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "nstricker@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "pcameron@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "pcrocombe@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "phadnot@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "rhondawilliams@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "rlapaglia@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "skema@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "skubicek@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "slewis@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "sshafer@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "sswanson@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "staylor@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "tduhon@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "toriwells@csisd.org"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "email": "twolfe@csisd.org"
    }
  ],
  "mails": [
    "abyrne@csisd.org",
    "afriedrich@csisd.org",
    "agilbert@csisd.org",
    "alyons@csisd.org",
    "amason@csisd.org",
    "aroquet@csisd.org",
    "asalazar@csisd.org",
    "ataylor@csisd.org",
    "awells@csisd.org",
    "bernst@csisd.org",
    "bgwinner@csisd.org",
    "ccooke@csisd.org",
    "cgrafe@csisd.org",
    "cmay@csisd.org",
    "coneal@csisd.org",
    "cray@csisd.org",
    "dschultea@csisd.org",
    "dsolomon@csisd.org",
    "fborroni@csisd.org",
    "fherrning@csisd.org",
    "hdecker@csisd.org",
    "info@staygainesville.com",
    "info@visitgainesville.com",
    "jahelymartinez@csisd.org",
    "jdecoste@csisd.org",
    "jkillingsworth@csisd.org",
    "jmullins@csisd.org",
    "kanderson@csisd.org",
    "katterbury@csisd.org",
    "khouse@csisd.org",
    "kjobb@csisd.org",
    "kkey@csisd.org",
    "kmontgomery@csisd.org",
    "kpalasota@csisd.org",
    "ksullivan@csisd.org",
    "lcummings@csisd.org",
    "llewis@csisd.org",
    "lringer@csisd.org",
    "ltrainham@csisd.org",
    "mbaltuswilson@csisd.org",
    "mcaperton@csisd.org",
    "mdalton@csisd.org",
    "mgoodwin@csisd.org",
    "mhelm@csisd.org",
    "mmassie@csisd.org",
    "mskow@csisd.org",
    "nstricker@csisd.org",
    "pcameron@csisd.org",
    "pcrocombe@csisd.org",
    "phadnot@csisd.org",
    "rhondawilliams@csisd.org",
    "rlapaglia@csisd.org",
    "skema@csisd.org",
    "skubicek@csisd.org",
    "slewis@csisd.org",
    "sshafer@csisd.org",
    "sswanson@csisd.org",
    "staylor@csisd.org",
    "tduhon@csisd.org",
    "toriwells@csisd.org",
    "twolfe@csisd.org"
  ],
  "nombre_sitio": "cypressandgrove.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.staygainesville.com/cypress-grove-brewing-co-a-delicious-taste-of-gainesville",
      "text": "Cypress & Grove Brewing Co.: A (Delicious) Taste of Gainesville HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS Book Now Get in touch (352) 519-3994 info@staygainesville.com HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS Cypress & Grove Brewing Co.: A (Delicious) Taste of Gainesville A CYPRESS SIP OF SUNSHINE: EXPLORING GAINESVILLE'S CRAFT BEER OASIS - CYPRESS & GROVE BREWING CO. Website: https://www.cypressandgrove.com/ Address: 1001 NW 4th Street, Gainesville, Florida (the corner of Cypress & Grove) Take a Video Tour with Us: https://fb.watch/rS1ZmGQQtq/ Nestled in the heart of Gainesville, Florida, where the vibrant energy of the University of Florida spills onto the streets, lies a haven for craft beer enthusiasts – Cypress & Grove Brewing Co. Stepping through its doors is like stepping back in time, with the historic Gainesville Ice Factory building housing a modern-day mecca of delicious brews. But Cypress & Grove isn't just about the beer; it's a tapestry woven with local history, community spirit, and a passion for crafting exceptional beverages. From Ice to Ales: A Legacy Reborn The building that now houses Cypress & Grove has a rich history dating back to 1903. Originally, it functioned as the Gainesville Ice Factory, providing vital cooling solutions for a growing city. The deep artesian well on the property provided the source water, a testament to the pure, natural ingredients that remain at the heart of Cypress & Grove's brewing philosophy today. Fast forward to 2011, when two friends, Gary Heil and Patrick Burger, envisioned a space dedicated to crafting artisanal beers in Gainesville. They saw an opportunity to revive the historic ice factory while offering a unique social hub for the community. Thus, Cypress & Grove Brewing Co. was born, drawing its name from the iconic intersection where the building resides. A great article from gainesvilledowntown gives the history of the beloved Cypress and Grove Brewing Co.: Sally Adkins knew that Patrick Burger had a love affair with craft beer long before they crafted a love affair of their own. “On my first date with him, he woke up at 6 a.m. so he could brew beer before we went on a bike ride,” she said. That was in 1999. Almost two decades later, Burger and Adkins are a happily married couple, but Burger’s passion for craft beer is as strong as ever. “It’s always been a pipe dream of his to open a brewery,” Adkins said. This summer, Burger has realized that dream with the opening of Cypress & Grove Brewing Company at 1001 NW 4th St. in the former home of the historic Gainesville Ice and Cold Storage Co. — known by locals as simply “the Ice House.” “There’s a lot of history here,” Burger said. “This was an active ice plant until 1976, but the original part of the building was built in 1896. We have an old well we get our water from that was later used in the ice-making process.” On Saturday, the Cypress & Grove microbrewery celebrates its grand opening from 3-10 p.m. with locally brewed craft beer and craft seltzer as well as live music by Michael McCarthy and food trucks from Cilantro Tacos, Reggae Shack and Jodi Cannoli. The event will also mark the opening of the brewery’s tasting room, known as The Brick Room. The brewery has been open on weekends for the past two months but will now expand its operation from Thursday through Monday. The entrance to Cypress & Grove Brewing Co. (Photo by Gainesville Downtown) On Friday, workers were busy hooking up lights and installing glass doors in the Brick Room and putting finishing touches on other areas of the spacious brewery at the corner of Northwest 4th Street and 10th Avenue, which in the old days was the corner of Cypress and Grove streets, thus the inspiration for the brewery’s name. Burger had planned to call the business Rainstorm Brewing Co. but there was a naming conflict with another brewery. Burger and Adkins are partners in Cypress & Grove with another husband-and-wife team, Gary Heil and Anna Heineman. Heil’s interest in craft beer took off several years ago when his wife bought him a home-brewing kit. Heineman’s grandfather helped rebuild Munich’s historic Hofbrauhaus following World War II. Burger is  a civil engineer who specializes in groundwater hydrology for the St. Johns River Water Management District. Heil is a microbiologist at UF. Adkins coordinates the Clean Water Partnership for the City of Gainesville, while Heineman is an art historian. The new Cypress & Grove tasting room, known as The Brick Room. (Photo by Gainesville Downtown) When the two couples took over the dilapidated Ice House property in May 2015 and announced plans to build a craft brewery, the task seemed overwhelming, if not impossible. “We purchased this building knowing it was a diamond in the rough,” Adkins said. “It looked like a horror house.” There was little left of the roof and trusses from the old structure, and the flooring had to be replaced literally from the ground up. One area of the building required 93 yards of concrete to be poured. “Now it’s clean and shining and beautiful with lots of help from our community, our friends and our families to restore it back to its original glory,” Adkins said. The 15-barrel brewing facility at Cypress & Grove. (Photo by Gainesville Downtown) Adkins said the goal is to make Cypress & Grove not only a popular brewery but a place where people can meet and exchange ideas in much the same way novelists J.R.R. Tolkien and C.S. Lewis built a beautiful friendship over delicious brews at a hometown pub in Oxford, England. “That would be our inspiration, for people to discuss ideas and relax,” Adkins said. Cypress & Grove currently offers six of its own craft beers on tap  — a blonde, pale, IPA, porter and stout, with an American wheat beer added this weekend for the grand opening. Each sells for $5 a glass. Customers can also purchase beers on tap from Swamp Head Brewery and First Magnitude, Mother Kombucha from St. Petersburg as well a variety of wines and locally made seltzer in three flavors. An old sign from the Gainesville Ice & Cold Storage Co. (Photo by Gainesville Downtown) According to Burger, Cypress & Grove has a 15-barrel brewhouse, meaning it can produce 450 gallons of beer at a time. There’s also a 90-barrel fermentation space and a walk-in cooler that can store hundreds of kegs at a time. The brewery’s large Brick Room tasting area is built on the site of the original Ice House building from the 1890s, when ice was brought to Gainesville by railroad and stored. The heavy ice blocks were once rolled into the building and up a ramp on a trolley line. Doug Porch, general contractor for the Cypress & Grove project, replaced the steep ramp with six steps that lead up to the Brick Room. Customers now can enjoy two billiard tables, two Foosball tables and a ping-pong table in an area where blocks of ice were once stored. Other tables in the room are made from heart-pine lumber that was once part of the roof structure. “I think this place is unbelievable,” Porch said. “My favorite part is driving by now and hearing all the laughter from inside.” — Noel Leroux What a story! Visit Cypress & Grove Brewing Co. at https://www.cypressandgrove.com/ See their IG Post about Cypress & Grove Brewing Co.: https://www.instagram.com/p/C4f7mUrN74B/ Looking for a place to stay while visiting the local Gainesville attractions? Look not further than Gainesville's locally owned vacation rental company, StayGainesville . Book directly on our site, or call us at 352-519-3994 for guidance. For homes and condos, StayGainesville has many options- large and small/ budget and luxury, and more. For a shorter stay, we have 2 beautiful historic Inns in downtown Gainesville. The Camellia Rose Inn and The Laurel Oak Inn - both have unique personalities and they both feel like a home away from home. Looking for more things to do in Gainesville? Visit our Things to Do link . < Older Post Newer Post > Why Owners Trust StayGainesville for AirBNB Property Management By Susannah Peddie • September 8, 2025 Discover why property owners trust StayGainesville for expert property management in Gainesville. From guest care to profitability, we protect your investment. Gainesville Vacation Rentals with Beautiful Outdoor Spaces By Susannah Peddie • September 5, 2025 Gainesville Vacation Rentals with Beautiful Outdoor Spaces                                                              When you’re planning a trip to Gainesville, chances are you’re coming for more than just a place to sleep. Whether you’re cheering on the Gators, visiting friends and family, or exploring North Florida’s springs and trails, your accommodations should be a retreat of their own. That’s where StayGainesville comes in.                                                              Our collection of vacation rentals is designed not only for comfort inside but also for relaxation and fun outside. From private pools perfect for Florida sunshine to fenced yards where kids and pets can run free, our homes are built for guests who want more than four walls. In this post, we’re highlighting some of the beautiful outdoor spaces you’ll find when you book with us.                                                                          Why Outdoor Space Matters                                                                         Vacations and getaways are about slowing down, connecting, and making memories. An outdoor area extends your living space and gives you options:                                                        Morning coffee on the porch with birdsong in the background.                                     Afternoon swims in the pool to beat the Florida heat.                                     Evening cookouts on the patio with everyone gathered around.                                     Quiet fenced yards where little ones (and pets) can play safely.                                                      These simple pleasures can make your Gainesville stay feel less like a trip and more like home.                                                                          StayGainesville Homes with Pools                                                                         There’s something magical about having your own pool while on vacation. No crowded hotel decks, no closing hours—just a sparkling, private oasis steps from your back door.                                                              Several StayGainesville rentals feature in-ground pools surrounded by lush greenery or spacious decks where you can stretch out with a book. Families love them for the kids, while adults enjoy winding down after a day of adventure. Gainesville’s warm weather means pool season lasts much longer here than in other parts of the country, so no matter when you visit, you’ll likely get to take a dip.                                                              Imagine spending your Saturday at a Gator football game and then cooling off in your own pool when you get back. That’s the kind of experience that makes guests return to us year after year.                                                                          Patios and Porches Made for Gathering                                                                         For those who prefer lounging over laps, our homes with patios and porches offer the perfect backdrop for relaxation. Picture yourself sipping a glass of wine under string lights, or reading a novel in a rocking chair while the breeze drifts by.                                                        Screened-in porches mean no bug spray needed while you enjoy the Florida evenings.                                     Covered patios provide shade during sunny afternoons.                                     Outdoor seating and dining areas let you take every meal al fresco.                                                      One of the most common comments we hear from guests is how much they loved “just hanging out on the porch.” It’s a simple pleasure that turns a good vacation into a memorable one.                                                                          Fenced Yards for Families and Pets                                                                         We know that for many of our guests, pets are family too. That’s why several StayGainesville properties feature large, fenced yards where dogs can explore and play safely. Families with kids also appreciate these yards—there’s peace of mind knowing everyone can enjoy the outdoors without worry.                                                              Traveling with your furry friend? No need to stress about pet policies or tiny hotel rooms. Our homes are designed to welcome wagging tails, with plenty of space for everyone to stretch out.                                                                          Outdoor Dining and Entertainment                                                                         Vacations are about sharing meals and laughter, and nothing sets the scene better than a great outdoor dining setup. Many of our rentals come with:                                                        Gas or charcoal grills for cookouts.                                     Patio tables and umbrellas for shaded lunches.                                     Fire pits for roasting marshmallows on cooler nights.                                                      In Gainesville, evenings are often balmy and perfect for gathering outside. Whether you’re grilling burgers before a game day or enjoying a quiet dinner under the stars, our outdoor spaces make it easy to stay connected with the people who matter most.                                                                          Gainesville: A City Made for Outdoor Living                                                                         Of course, part of the beauty of having great outdoor space at your rental is how well it pairs with Gainesville’s natural surroundings. When you’re not enjoying the pool or porch, you can step out and explore:                                                        Kanapaha Botanical Gardens, just a short drive away, with 24 themed gardens to wander.                                     Paynes Prairie Preserve State Park, where you might spot wild horses, bison, or a sunset over the prairie.                                     Local springs like Ginnie Springs or Blue Springs, famous for their crystal-clear waters.                                     Biking and walking trails, such as the Gainesville-Hawthorne Trail, perfect for an active morning.                                                      After a day of adventuring, coming back to a home with its own backyard retreat makes your trip feel balanced and refreshing.                                                                          Who Our Outdoor Spaces Are Perfect For                                                                                 Families with kids                          : Let them splash in the pool or play tag in the yard while you relax nearby.                                                   Couples                          : Share morning coffee on the porch or a private dinner under the stars.                                                   Pet owners                          : Give your four-legged friend freedom to roam safely.                                                   Groups of friends                          : Host a cookout, hang by the pool, and make memories together.                                                      Whatever your group looks like, StayGainesville has a property designed with you in mind.                                                                          Why Choose StayGainesville?                                                                         It’s not just about the amenities—it’s about the experience. When you stay with us, you’re choosing:                                                        Homes with personality: Every property is thoughtfully designed and furnished.                                     Local expertise: We’ve been part of Gainesville’s community for years, and we love sharing it with visitors.                                     Flexibility: From whole homes for large groups to cozy retreats for couples, we offer spaces that fit your trip.                                     Peace of mind: Professionally managed homes mean you’ll enjoy a clean, reliable, and comfortable stay.                                                      Hotels can’t compete with the privacy, space, and comfort of a rental home—especially when it comes with a beautiful outdoor area all to yourself.                                                                          Book Your Gainesville Outdoor Retreat                                                                         Your vacation should feel like a breath of fresh air—literally. StayGainesville’s rentals with pools, fenced yards, patios, and porches give you room to relax, play, and connect. Whether you’re here for a weekend or a season, our homes are ready to welcome you.                                                              Browse our collection and find the outdoor oasis that’s perfect for your Gainesville getaway. We’ll handle the details—you just bring the sunscreen, the burgers, and your favorite people.                                                              Ready to plan your stay? Book directly with StayGainesville                       for the best rates and availability.                                                      Call us at                         352-519-3994                        or                         book on our website                        . More Posts Gainesville, FL Find Us: Call: (352) 519-3994 Email: info@staygainesville.com We are a short-term property rental company with a deep local presence. We support the Gainesville community in so many ways. We hire locally, we use local vendors, we partner with local businesses, and we love sharing our love of Gainesville with all of our guests. PRIVACY POLICY TERMS & CONDITIONS FOR ALL BOOKINGS © 2025 All Rights Reserved | Stay Gainesville Share by:"
    },
    {
      "url": "https://www.visitgainesville.com/event/jazz-bandits-at-cypress-and-grove-brewing-company/",
      "text": ""
    },
    {
      "url": "https://www.visitgainesville.com/organizer/cypress-grove-brewing-company/",
      "text": "Cypress & Grove Brewing Company - Visit Gainesville Cookie Settings Close About cookies Essential Analytics Targeting Social media About cookies This control panel describes what kinds of cookies are present on this website and allows you to enable or disable different types of cookies. Cookies are small pieces of text saved by websites to your computer. Cookies are how your computer remembers things you’ve already done on the internet and are an important part of making modern websites work properly. Because cookies may contain information about your browsing habits, some people prefer to turn them off entirely. However, turning off cookies can prevent websites from working the way you expect. Essential cookies These cookies are critical to the functioning of this website and cannot be disabled through this control panel. They don’t contain any information about your identity. They can be disabled through your browser, but doing so could cause some parts of this website to stop working. WordPress wordpress_, wp- Always enabled Analytics cookies These cookies collect information on visitors to our website to help us understand how well our website is working and how to improve it. No vendors are present in this group. Targeting cookies These cookies collect information on your browsing habits to help our advertising partners show you more relevant ads. No vendors are present in this group. Social media cookies These cookies help social media sites understand your likes and dislikes so they can show you more relevant content. They also make it easier to share contents from other websites such as ours to your social media profiles. No vendors are present in this group. Communities University of Florida Blog Meetings & Industry Sports Things To Do Outdoor Recreation Eat & Drink Stay Events MENU SEARCH Things To Do LIVE MUSIC & PERFORMING ARTS FAMILY-FRIENDLY ATTRACTIONS MUSEUMS, GALLERIES & ART WALKS TOURS SHOPPING HISTORY & HERITAGE ITINERARIES ALL ARE WELCOME Outdoor Recreation FRESHWATER SPRINGS PARKS & PLACES HIKING PADDLING TRAILS PICKLEBALL BIRDING HOT SPOTS BIKING GOLF FISHING Eat & Drink RESTAURANTS BREWERIES & WINERIES HOMEGROWN IN ALACHUA COUNTY Stay BED & BREAKFAST Hotels & Lodging RV PARKS & CAMPING VACATION RENTALS Events WHAT’S GOOD.® GUIDE All Events Communities University of Florida Blog Meetings & Industry Sports Loading view. There were no results found. There were no results found. Cypress & Grove Brewing Company Events Organizers Cypress & Grove Brewing Company https://cypressandgrove.com/ Events from this organizer Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Alachua County Visitors & Convention Bureau 33 N Main St, Gainesville, FL 32601 Toll free: (866) 778-5002 Local: (352) 374-5260 info@visitgainesville.com Facebook Instagram Twitter YouTube LinkedIn #WhyILoveGNV • @visitgainesville About Us Contact Us Press Coverage Routes to Roots Carbon Offset Project Partner and Business Resources Apply for a Grant Submit an Event Submit An RFP Tourism Economic Impacts Media Resources Travel Writers, Bloggers and Photographers Filming in Gainesville Alachua County Community and Travel Resources Emergency Preparedness Accessibility Legal Disclaimers, Public Records & Accessibility Privacy Policy Google Translate Disclaimer © 2025 Visit Gainesville Alachua County, FL"
    },
    {
      "url": "https://cg.csisd.org/about-us/faculty-staff",
      "text": "Staff Directory - Cypress Grove Intermediate Skip To Main Content Close Menu Search Clear Search Our School About Cypress Grove Staff Directory Bell Schedule Title I Information Texas Academic Performance Report (opens in new window/tab) School Report Card (opens in new window/tab) Contact Us Academics Academic Calendar State Standards Credit By Exam (opens in new window/tab) CSISD Curriculum (opens in new window/tab) Middle School Summer School Students Daily Announcements Student Handbook (opens in new window/tab) Student Code of Conduct (opens in new window/tab) Library (opens in new window/tab) Helpful Hints Schoology Login (opens in new window/tab) Schoology Support (opens in new window/tab) CSISD P3 (opens in new window/tab) Yearbook (opens in new window/tab) Parents Arrival and Dismissal Procedures Cypress Grove PTO PTO Website (opens in new window/tab) PTO Facebook Page (opens in new window/tab) PTO Instagram Page (opens in new window/tab) PTO Twitter/X Page (opens in new window/tab) Supply Lists Student Handbook (opens in new window/tab) Student Code of Conduct (opens in new window/tab) Kids Klub (opens in new window/tab) Payment Portal (opens in new window/tab) Summer Day Camp (opens in new window/tab) Volunteers Opportunities (opens in new window/tab) Staff CSISD Go Page (opens in new window/tab) CSISD Staff Portal (opens in new window/tab) Email (opens in new window/tab) Absence Management - AESOP (opens in new window/tab) Schoology (opens in new window/tab) Teacher Access Center (opens in new window/tab) P3 Reporting (opens in new window/tab) Staff Directory Register for School (opens in new window/tab) Facebook Twitter Instagram District Schools High Schools A&M Consolidated High School College Station High School College View High School Middle Schools A&M Consolidated Middle School College Station Middle School Wellborn Middle School Intermediate Schools Oakwood Intermediate Pecan Trail Intermediate Cypress Grove Intermediate Elementary Schools College Hills Elementary Creek View Elementary Forest Ridge Elementary Greens Prairie Elementary Pebble Creek Elementary River Bend Elementary Rock Prairie Elementary South Knoll Elementary Southwood Valley Elementary Spring Creek Elementary Open Menu Logo Image Logo Title Cypress Grove Intermediate P3 Reporting (opens in new window/tab) Staff Directory Register for School (opens in new window/tab) Open Search Search Clear Search Close Search Our School About Cypress Grove Staff Directory Bell Schedule Title I Information Texas Academic Performance Report (opens in new window/tab) School Report Card (opens in new window/tab) Contact Us Academics Academic Calendar State Standards Credit By Exam (opens in new window/tab) CSISD Curriculum (opens in new window/tab) Middle School Summer School Students Daily Announcements Student Handbook (opens in new window/tab) Student Code of Conduct (opens in new window/tab) Library (opens in new window/tab) Helpful Hints Schoology Login (opens in new window/tab) Schoology Support (opens in new window/tab) CSISD P3 (opens in new window/tab) Yearbook (opens in new window/tab) Parents Arrival and Dismissal Procedures Cypress Grove PTO Supply Lists Student Handbook (opens in new window/tab) Student Code of Conduct (opens in new window/tab) Kids Klub (opens in new window/tab) Payment Portal (opens in new window/tab) Summer Day Camp (opens in new window/tab) Volunteers Opportunities (opens in new window/tab) Staff CSISD Go Page (opens in new window/tab) CSISD Staff Portal (opens in new window/tab) Email (opens in new window/tab) Absence Management - AESOP (opens in new window/tab) Schoology (opens in new window/tab) Teacher Access Center (opens in new window/tab) About Cypress Grove Staff Directory Bell Schedule Title I Information Texas Academic Performance Report (opens in new window/tab) School Report Card (opens in new window/tab) Contact Us In This Section About Cypress Grove Staff Directory Bell Schedule Title I Information Texas Academic Performance Report (opens in new window/tab) School Report Card (opens in new window/tab) Contact Us Home > Our School > Staff Directory Staff Directory View Full Staff List Administration Staff Administration Piper Cameron Principal Lauren Cummings Assistant Principal/Campus Behavior Coordinator Staff Anderson, Kandi 6th Science Atterbury, Kasey 6th CoT ELA, Fund ELA Baltus-Wilson, Mary 5th SS Borroni, Frank ICS IA Byrne, Amanda Orchestra Caperton, Marci ARD Facilitator Cooke, Christie ICS IA Crocombe, Paige 5th ELA Dalton, Michelle Instructional Coach Decker, Halee 5th/6th Science DeCoste, Jan Attendance Clerk Duhon, Terri 6th ELA Ernst, Brandon 6th SS Friedrich, Amber 5th Math Gilbert, Amber Life Skills Goodwin, Marla Choir, Music Grafe, Christine Art Gwinner, Brittany 6th Math Hadnot, Patricia CASL Helm, Matthew 6th SS Herring, Matthew 5th SS House, Kimberly Instructional Coach Jobb, Kathryn 5th Math Kema, Stephanie Counselor Secretary Key, Karen 5th/6th SS Killingsworth, Jordan 6th Sci Kubicek, Stephanie 6th PE LaPaglia, Becky 5th ELA Lewis, LaBridget Dyslexia Lewis, Shavaya MTSS Coach Lyons, Amanda Nurse Martinez, Jahely Life Skills IA Mason, Amy 5th CoT ELA, Fund ELA Massie, Misty Building Secretary May, Chris 5th CoT Math, Fund of Math Montgomery, Kelly Band Mullins, Jennifer 6th CoT Math, Fund of Math O'Neal, Carmen Library IA Palasota, Kendra 5th PE Ray, Courtney 5th/6th ELA Ringer, Lisa Life Skills IA Roquet, Aimee 6th Fund Reading Salazar, Aaron 5th Science Schultea, Dana Counselor Shafer, Sarrah 5th/6th Math Skow, Michelle Librarian Solomon, Darrylidrea Reset Stricker, Nancy 6th ELA Sullivan, Kathy Receptionist Swanson, Sheryl CASL IA Taylor, Amanda Theatre Taylor, Scharla GT (two days/week) Trainham, Lisa 5th Sci Wells, Nicole ESL Wells, Tori 6th Math Williams, Rhonda ICS IA Wolfe, Tye 5th PE IA Logo Image 900 Graham Rd College Station TX 77845 979-694-5600 Facebook Twitter Instagram Links & Resources Who to Call Calendar Volunteer Work for CSISD Parents & Students Register for School Bus Rider Registration Home Access Center (HAC) Schoology Support for Students Schoology Support for Parents Faculty & Staff Staff Portal Payroll Human Resources Professional Development Privacy Policy Site Map Accessibility Powered by Finalsite"
    }
  ]
}