{
  "fuentes": [
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "email": "brook@cypresspointcc.com"
    },
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "email": "cheryl@cypresspointcc.com"
    },
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "email": "matt@cypresspointcc.com"
    },
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "email": "receptionist@cypresspointcc.com"
    },
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "email": "ryan@cypresspointcc.com"
    },
    {
      "url": "https://cypresscreekgolfersclub.com/contact-us/",
      "email": "golf@ccgcsmithfield.com"
    },
    {
      "url": "https://cypresscreekgolfersclub.com/about-us/",
      "email": "golf@ccgcsmithfield.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "events@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "groupsales@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "info@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "jobs@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "lessons@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "marketing@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "nordic@cypressmountain.com"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "email": "rentals@cypressmountain.com"
    },
    {
      "url": "https://cypresslakegc.com/memberships/",
      "email": "brian@cypresslakegc.com"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "andywoolston@cypresslakesgolfclub.net"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "beckyblack@cypresslakesgolfclub.net"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "info@cypresslakesgolfclub.net"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "johnchilds@cypresslakesgolfclub.net"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "thomasfaddis@cypresslakesgolfclub.net"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "email": "winthomas@cypresslakesgolfclub.net"
    }
  ],
  "mails": [
    "andywoolston@cypresslakesgolfclub.net",
    "beckyblack@cypresslakesgolfclub.net",
    "brian@cypresslakegc.com",
    "brook@cypresspointcc.com",
    "cheryl@cypresspointcc.com",
    "events@cypressmountain.com",
    "golf@ccgcsmithfield.com",
    "groupsales@cypressmountain.com",
    "info@cypresslakesgolfclub.net",
    "info@cypressmountain.com",
    "jobs@cypressmountain.com",
    "johnchilds@cypresslakesgolfclub.net",
    "lessons@cypressmountain.com",
    "marketing@cypressmountain.com",
    "matt@cypresspointcc.com",
    "nordic@cypressmountain.com",
    "receptionist@cypresspointcc.com",
    "rentals@cypressmountain.com",
    "ryan@cypresspointcc.com",
    "thomasfaddis@cypresslakesgolfclub.net",
    "winthomas@cypresslakesgolfclub.net"
  ],
  "nombre_sitio": "cypresscreekgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cypresspointcc.com/contactus/",
      "text": "Contact Us - Cypress Point Country Club Skip to main content Skip to footer Cypress Point Country Club Virginia Beach, VA Home Tee Times Public Tee Times Member Tee Times Golf Course Details Scorecard Lessons Membership Pool Cypress Bar & Grill Contact Us Contact Us Employment Privacy Policy Join Our E-Club! Member Section Contact Us Cypress Point Country Club 5340 Club Head Road Virginia Beach, VA 23455 (757) 490-6300 – Club (757) 490-8822 – Pro Shop Keith King, PGA Director of Golf, Head Golf Professional, Owner Dana Wicht General Manager, Director of F&B, Accounting, Owner Our Staff Matt Watson, Assistant Golf Professional matt@cypresspointcc.com Ryan Keilholtz, Associate Assistant ryan@cypresspointcc.com Cheryl Creekmore, Chef/Kitchen Manager cheryl@cypresspointcc.com Brook Dailey, Event Coordinator/Bar Manager brook@cypresspointcc.com Robbie Rasmussen Course Superintendent Hours Effective March 13, 2022 Monday 8:00 a.m. – 5:00 p.m. (kitchen closed – grab-n-go only) Tuesday, Wednesday, Thursday 8:00 a.m. – 9:00 p.m. Friday 8:00 a.m. – 9:00 p.m. Saturday & Sunday 7:00 a.m. – 9:00 p.m. (serving breakfast, lunch, dinner) Club House hours and Pro Shop hours may not be the same.  Club House hours are subject to change based on events booked. On inclement weather days, contact the Pro Shop to confirm open or closed 757-490-8822. Directions Sorry - your browser does not support iframes. Footer Sign-Up for Email Offers Sorry - your browser does not support iframes. meteoblue Find Us Address: 5340 Club Head Road, Virginia Beach, VA 23455 Phone: (757) 490-6300 Email: receptionist@cypresspointcc.com Follow Us Copyright © 2025 Cypress Point Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://cypresscreekgolfersclub.com/contact-us/",
      "text": "ABOUT US | Cypress Creek Golfers' Club, Smithfield, VA top of page Get Our Mobile App! Download Now > Smithfield, VA BOOK TEE TIME MEMBER PORTAL ABOUT US COURSE DINING BOOK A LESSON CCGC CRITTERS EVENTS CALENDAR MEMBERSHIPS MORE Use tab to navigate through the menu items. About Us Cypress Creek Golfers' Club was carefully carved from the mature hardwood forests and centuries old peanut fields of Smithfield. The peacefully secluded setting is the ideal environment for a round of golf and the challenging design will have you using every club in your bag. The golf course will reward creative shot-making and thoughtful strategy but it is not overly punishing for the high handicapper. The rolling terrain provides plenty of challenging ups and downs throughout and there are many water holes, including the memorable ninth, a short par 4 with an island green. Cypress Creek Golfers’ Club even has its own “amen corner” that starts with the par-4 15th, moves on to the waterlogged 16th, and finishes with another par 4, an uphill hole that is the toughest of the trio. ​ TOUR OUR COURSE Location 600 Cypress Creek Parkway Smithfield VA, 23430 Contact Us 757-365-4774 Golf@CCGCSmithfield.com ©2025 Cypress Creek Golfers' Club Join Our Team! CAREERS bottom of page"
    },
    {
      "url": "https://cypresscreekgolfersclub.com/about-us/",
      "text": "ABOUT US | Cypress Creek Golfers' Club, Smithfield, VA top of page Get Our Mobile App! Download Now > Smithfield, VA BOOK TEE TIME MEMBER PORTAL ABOUT US COURSE DINING BOOK A LESSON CCGC CRITTERS EVENTS CALENDAR MEMBERSHIPS MORE Use tab to navigate through the menu items. About Us Cypress Creek Golfers' Club was carefully carved from the mature hardwood forests and centuries old peanut fields of Smithfield. The peacefully secluded setting is the ideal environment for a round of golf and the challenging design will have you using every club in your bag. The golf course will reward creative shot-making and thoughtful strategy but it is not overly punishing for the high handicapper. The rolling terrain provides plenty of challenging ups and downs throughout and there are many water holes, including the memorable ninth, a short par 4 with an island green. Cypress Creek Golfers’ Club even has its own “amen corner” that starts with the par-4 15th, moves on to the waterlogged 16th, and finishes with another par 4, an uphill hole that is the toughest of the trio. ​ TOUR OUR COURSE Location 600 Cypress Creek Parkway Smithfield VA, 23430 Contact Us 757-365-4774 Golf@CCGCSmithfield.com ©2025 Cypress Creek Golfers' Club Join Our Team! CAREERS bottom of page"
    },
    {
      "url": "https://www.cypressmountain.com/contact-us",
      "text": "Contact Us | Cypress Mountain Resort | Cypress Mountain Skip to main content Cypress Mountain Tickets, Lessons & Rentals Things to Do Plan & Discover Mountain Safety Open conditions trails menu Loading... Open or Close main menu Home Home Contact CONTACT US Guest Services Snow Sports Rentals & Repairs Employment Marketing GUEST SERVICES Downhill Skiing & Snowboarding 855 363 2823 info@cypressmountain.com groupsales@cypressmountain.com Nordic Cross Country Skiing, Snowshoe, Tubing & Sliding 855 397 1166 nordic@cypressmountain.com HELP CENTER ACTIVITY CREDIT VOUCHER PASS DEFERRAL GROUP BOOKINGS Courier Address 6000 Cypress Bowl Road Cypress Creek Lodge (Guest Services) West Vancouver, BC V7V 3N9 Mailing Address PO Box 91252 West Vancouver, BC V7V 3N9 © Boyne Resorts 2025"
    },
    {
      "url": "https://cypresslakegc.com/memberships/",
      "text": "Memberships – Cypress Lake Golf Club – Fort Myers Southwest Florida Skip to content Office: 239-481-1333 Golf: 239-481-3222 Tennis: 239-482-0220 Members Login Ghin Login Facebook Golf The Course Hole By Hole The Forecaddie Hole Illustrations Golf Instruction Practice Facility Memberships Tennis Clubhouse Gallery Hall Of Famers History Contact Us Golf The Course Hole By Hole The Forecaddie Hole Illustrations Golf Instruction Practice Facility Memberships Tennis Clubhouse Gallery Hall Of Famers History Contact Us Memberships At Cypress Lake Each Founder Membership will share in ownership of the Club, can vote on affairs of the Club and hold elected office. Cypress Lake Golf Club –  Est 1959 Memberships Brian Hart, PGA, Membership Director 239-481-1333 419-688-9398 brian@cypresslakegc.com Golf Memberships: Equity Golf: Founder Membership $35,000 stock purchase  –  $12,600 family dues/$8,400 single dues  –  $2,400 capital dues  – $600 food & beverage minimum. Founder Membership is available to an individual or jointly to a married couple and dependent children under the age of 24. As the nucleus of the Club, each Founder Membership will share in ownership of the Club, can vote on affairs of the Club and hold elected office. Founder members have year round use of the clubhouse, golf course, practice facilities, tennis facilities and dining rooms. Sports Memberships: Sports Membership:   – $2,520 (family) dues / $1,680 (single) dues  –  $600 capital dues  –  $100 food & beverage minimum  No stock certificate purchase. Sports Membership is available to an individual or jointly to a married couple and dependent children under the age of 24. Sports members have year round use of tennis facilities, clubhouse and dining rooms. The Club extends Sports members summer golf privileges May through October with payment of appropriate fees. Can be upgraded to a Founder Membership at the then current price, provided a membership is available. Interested? Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * Phone * Area Of Inquiry * Golf Membership Sports Membership Employment Other Email * Comment or Message Comment Of Area Custom Captcha * = Submit Your Inquiry This is a summary of the membership opportunities offered by Cypress Lake Golf Club. Every person who desires to purchase a membership in the Club should carefully read the Club Bylaws and Rules and Regulations. The Club reserves the right to modify the membership program and benefits at any time without notice. Should you have any questions concerning the membership opportunities available at Cypress Lake Golf Club please contact the Membership Office at 6767 Winkler Road, Fort Myers, FL 33919 or by telephone at (239) 481-1333 Please add sales tax to the above dues rates. This Information is accurate as of June 1st, 2024 and may be changed at any time without notice. Cypress Lake Golf Club in Fort Myers, FL is a first class golf course for golfers of any level. Beautiful fairways and pristine greens, makes it the perfect golfing choice. Cypress Lake has a thriving membership and  the pro-shop has everything needed to improve your game including a state of the art practice facility, the latest golf equipment and top PGA pros for lessons and guidance. Call Us Golf Shop 239-481-3222 ClubHouse 239-481-1333 Tennis Shop 239-482-0220 Please ensure Javascript is enabled for purposes of website accessibility Our Location Information 239-481-1333 brian@cypresslakegc.com Cypress Lake GC 6767 Winkler Rd Fort Myers, FL 33919 Backnine Links Facebook Copyright 2025 © All Right Reserved 01239-251-0182 239-842-9751 Website Design By Emcc Web Design"
    },
    {
      "url": "https://www.cypresslakesgolfclub.net/contact/",
      "text": "Contact Us - Cypress Lakes Golf Club - Florida Skip to primary navigation Skip to main content Facebook Instagram Twitter Book A Tee Time Cypress Lakes Golf Club - Florida Home News Course Course Details Rates Book a Tee Time Calendar Tournaments Upcoming Events Membership Membership Info Member Tee Times Instruction Facilities Contact Contact Us Employment Contact Us Staff John H. Childs, Jr. PGA General Manager/Head Golf Professional 850-937-3820 johnchilds@cypresslakesgolfclub.net Becky Black Assistant Manager/Golf Professional 850-937-3820 beckyblack@cypresslakesgolfclub.net Thomas Faddis Assistant Manager thomasfaddis@cypresslakesgolfclub.net Andy Woolston Golf Course Superintendent 850-937-3887 andywoolston@cypresslakesgolfclub.net Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Contact Us 2365 Old Chemstrand Road Cantonment, FL 32533 info@cypresslakesgolfclub.net johnchilds@cypresslakesgolfclub.net (850) 937-3820 Social Media Facebook Twitter The broad tree-lined fairways and quiet water of our golf course are but a couple of the memories that await you at Cypress Lakes Golf Club. Our 18-hole golf course offers four tee boxes and measures nearly 6400 yards from the back tees. Contact Us 2365 Old Chemstrand Road Cantonment, FL 32533 info@cypresslakesgolfclub.net johnchilds@cypresslakesgolfclub.net (850) 937-3820 Weather 2365 Old Chemstrand Road Cypress Lakes Golf Club - Florida Copyright © 2025 Cypress Lakes Golf Club – Florida All Rights Reserved. Powered by"
    }
  ]
}