{
  "fuentes": [
    {
      "url": "https://brewyork.co.uk/our-team/",
      "email": "info@brewyork.co.uk"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-1",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-1",
      "email": "streetbash@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/beerlist",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/about",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadndavesbrewing.com",
      "email": "accounts@dadndavesbrewing.com"
    },
    {
      "url": "https://www.dadndavesbrewing.com",
      "email": "dave@dadndavesbrewing.com"
    },
    {
      "url": "https://www.dadndavesbrewing.com",
      "email": "operations@dadndavesbrewing.com"
    },
    {
      "url": "https://www.dadndavesbrewing.com",
      "email": "sales@dadndavesbrewing.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/contact-4",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://business.eastpascochamber.org/list/member/dade-city-brew-house-2259",
      "email": "ceo@eastpascochamber.org"
    },
    {
      "url": "https://www.dadecitybrewhouse.com",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/events/brunch",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/events/trivia-2021-05-17",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-returns",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-returns",
      "email": "streetbash@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-3",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-3",
      "email": "streetbash@dadecitybrewhouse.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/beerlist/little-gem",
      "email": "contactus@dadecitybrewhouse.com"
    },
    {
      "url": "https://brewround.com/contact-us/",
      "email": "info@brewround.com"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/team",
      "email": "contactus@dadecitybrewhouse.com"
    }
  ],
  "mails": [
    "accounts@dadndavesbrewing.com",
    "ceo@eastpascochamber.org",
    "contactus@dadecitybrewhouse.com",
    "dave@dadndavesbrewing.com",
    "info@brewround.com",
    "info@brewyork.co.uk",
    "operations@dadndavesbrewing.com",
    "sales@dadndavesbrewing.com",
    "streetbash@dadecitybrewhouse.com"
  ],
  "nombre_sitio": "dadecitybrewhouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://brewyork.co.uk/our-team/",
      "text": "Our Team | Brew York Craft Beer Search for: Search 0 items - £ 0.00 No products in the basket. Our Beer Nine Realms Series Signature Cask Signature Keg & Can Shop BEER Signature Seasonal Mixed Cases State of Mind Merchandise Our Venues Central York Osbaldwick, York Old Grey Mare, York Pocklington The Horse & Farrier The Mitre Towers Taproom Book a Brewery Tour Book a table or private event Subscription My account About us News Events Brewery Bash Friends of Brew York Trade Our Team FAQ Contact us Work For Us Wayne Co-Founder and Managing Director Brew York started life in Wayne’s shed back in 2013, but now Wayne steers the brewery ship in the right direction (whilst still doing a little bit of everything!). He loves getting out and representing Brew York at festivals and events, enjoying great beer and good company. Lee Co-Founder and Production Director Co-Founder Lee leads our production team in their never ending journey to create something new and exciting. Hugely passionate and creative innovator with a love of beer, brewing, cooking, cinema and playing poker. Lee’s most at home brewing at the crack of dawn to Slipknot, Korn and System of a Down! Alison HR Director Supported Brew York from the beginning and now dealing with all things people, so there’s never a dull day working here with lots of variety and challenges. Alison’s never been a huge beer fan but with a bit of help and perseverance is starting to learn what she does and doesn’t like. Davide Head Brewer Meet Davide, our Head Brewer and creative force behind the beer. Originally from Italy, Davide brings precision, passion, and a deep respect for tradition to every brew. When he’s not perfecting recipes or overseeing production, you’ll find him exploring the great outdoors with his camera in hand. A keen hiker and talented photographer, Davide finds inspiration in nature—whether it’s a misty mountaintop or a quiet woodland trail. His attention to detail and love for craftsmanship are at the heart of what we do. Gordon Brewer Gordon is one of our talented Brewers here at Brew York. When he’s not crafting your favorite beers, you’ll find him enjoying great music, sipping on a pint, or hanging out with his beloved dog, Nancy. Ben Brewer Meet Ben, our talented and passionate brewer! With years of experience in the industry, Ben has developed a deep love for crafting the perfect beer. His attention to detail and commitment to quality is evident in every batch he brews. When he’s not tinkering with new recipes, you can find Ben sharing his knowledge and expertise with the team, always eager to help others improve their brewing skills. Jack Brewer Meet our Apprentice Brewer Jack! When he’s not helping us to make our craft beer, Jack is an avid gamer and enjoys attending gigs. Kieran Brewer Meet Kieran, our Brewer who has an incredible sense of humour and loves to keep the team entertained. Recently, Kieran dressed up as Sully from Monsters Inc. for Halloween and brought smiles to everyone’s faces. When he’s not busy making us laugh, Kieran is dedicated to ensuring our packaging is top-notch and represents our brand with excellence. Henry Brewer Henry is a local lad from York, and joins us as Brewer! Outside the workplace, Henry likes to play ultimate frisbee with his local sports club, and take care of the chickens and sheep on his family’s farm. Alan QC Manager Meet our QC Manager Alan! When he’s not working hard in the brewery lab, Alan is a volunteer fireman for the North York Moors Railway, and a part-owner of Finn Harps F.C. Yousef Sales Director Yousef, our Sales Director, is someone who is passionate about the outdoors and loves to spend his free time exploring nature. He is an avid hiker and camper, and enjoys nothing more than a weekend spent in the great outdoors. When he’s not out in nature, Yousef can often be found binge-watching episodes of The Simpsons, which he considers to be one of the greatest TV shows of all time. Tyler Head of Business Development Meet Tyler, a man of few words but many talents. Despite his quiet demeanour, he is a hardworking and dedicated employee who always gets the job done. Tyler’s work speaks for itself, and his attention to detail is unparalleled. Sam Sales and Logistics Manager As our resident Export guru, Sam is the one that gets our beer over international borders. She's worn many hats during her time at Brew York, so if there's ever a question, the answer is usually \"ask Sam\"! She can often be found rocking in a corner swearing about Brexit... Or shooting Thom with a Nerf gun. Kimi Yorkshire Senior Account Manager Kimi is our Yorkshire Senior Account Manager, building strong relationships and championing Brew York across the region. Outside of work, he’s a fitness enthusiast who enjoys hitting the gym and competing in handball games nationwide. Jess York Sales Executive Meet Jess! Jess is from Teesside but has been a York native for years. You may see her bobbin around York as the Brew York Sales Executive so say hi if you see her! Her favourite beers are modern pale ales and anything that is outside the box! When she isn't chatting over a pint Jess is an aerial dance teacher and an avid metalhead. Joe London Regional Account Manager Joe is our very own token Londoner. Joe loves talking about brewing and drinking all types of craft beer. Joe was already a huge Brew York fan when he joined in 2022, so when the opportunity to sell his favourite beer ‘Haze of Thunder’ he was ‘well appy!’ Away from craft beer, Joe loves eating out with his wife, walking his dog Winnie, and supporting Aston Villa! Joanna Sales Admin Joanna joined us in the sales team after working as our Pocklington bar manager and after helping out at various beer festivals - she loves the brand so much that she just didn't want to leave and can often be found popping up at many events! When she's not sampling new beers; visiting new breweries or organising beer-tasting getaways she loves watching Marvel; D.C. films and Star Wars ... oh and the odd bit of camping! Andrew Head of Marketing Growing up in a pub set the tone for Andrew’s journey through agency life, corporate brand marketing across the UK and EMEA, and eventually working for himself. He’s shaped brands in beer, wine, whisky and beyond, with a WSET in Wines & Spirits, a licence to sell, and a (brief) past as a gin distiller. Outside work, you’ll find him playing guitar, collecting whisky, drinking beer, and watching classic Clint Eastwood westerns. He travels often, owns too many guitars, and has no limits when it comes to cheese. Pete Marketing Manager Hailing from Hull, Pete is a self-proclaimed ‘craft beer geek’ who works as our Marketing Manager. When he’s not wasting hours away on Instagram, Pete is a weekend wanderer and spends most of his free time hiking across the UK. Ant Digital Content and Design Manager Ant may sound Southern but he’s born of Yorkshire stock and he now runs the Digital Content and Design side here at Brew York. He has put his hand to many things on his route here like chef, printer, web-nerd, and bassist in numerous touring bands along with running backstage at various rock festivals. Kristy Bar Events Manager Originally from Idaho in the Pacific Northwest, Kristy has lived in the UK for nearly 12 years and has immersed herself in the hospitality and events industry, creating unforgettable experiences across the country. Kristy loves hiking in the woods with an audiobook and she’s also a passionate live music fan ranging from folk to K-Pop. Andy Events & Sales Manager Andy, otherwise known as Watters, is our original bar manager who now manages Events & Sales. His favourite pastime is falling asleep as you will see from the photo as he wouldn’t let us take one when he was awake. Chris Financial Controller The Numbers Guy. Chris has combined his love of craft beer with an accountancy career by joining us as Finance Manager. Away from the brewery, you’ll find him cruising the Yorkshire countryside on his mountain bike. Ali Accounts Assistant Meet our Accounts Assistant Ali! A self-confessed Jack of all trades, and master of none, Ali likes exploring lots of different hobbies outside of work. Phil Assistant Management accountant Phil is our Assistant Management Accountant, keeping the numbers in check at Brew York. Outside of work, he’s a passionate Leeds United supporter and a self-confessed foodie who loves exploring great food and craft beer. Emma HR Assistant Emma is working alongside Alison to support their growing team – it’s her first role in HR, and she’s quickly discovered that no two hours (let alone days) are ever the same. That unpredictability is exactly what she loves about it. Outside of work, Emma is deeply involved in her church, where she recently completed an internship. She’s also a keen distance runner, and being outdoors is a big part of who she is – she’ll jump into a lake or the sea at any opportunity! Glenn Senior Packaging Lead It may sound strange for a worker in a brewery but Glenn is a massive fan of craft beer and a lover of beer festivals. When he isn't at beer fest he loves to listen to heavy metal  whilst supping mead. Fave beer is Juice Forsyth. Robin Packaging Assistant Robin is one of our skilled Packaging Assistants, bringing passion and precision to every batch. When he’s not crafting exceptional beers, he’s hitting the pavement on a run, training in MMA, or immersing himself in epic adventures as a Dungeon Master in Dungeons and Dragons. Jasmine Packaging Assistant After years of full-time travel in her self converted van, sampling craft beers from across Europe and the UK, Jas has now planted roots in York driven by a passion to become a Brewer. She loves cats, Lord of the Rings, and any excuse to go the pub! Jayson Warehouse Manager With a career in logistics Jayson is a stickler for order and a lover of an EAN-14 code. Lover of football being a Man Utd season ticket holder however he isn’t a beer fan which is strange at a brewery. Fear not, the Jack Daniels doesn’t last long around him. Tim Drayperson & Warehouse Assistant Tim is from Malton, which he insists is not his fault. When he grew up, he wanted to be a Teenage Mutant Ninja Turtle. To deal with the bitter blow dealt to him by reality he started mucking-in in breweries, and has learned a trick or two as he's gone along.   He'd still really like to be a Ninja Turtle though. Adam Drayperson & Warehouse Assistant Adam is our hardworking Drayperson & Warehouse Assistant, ensuring our beers get where they need to be. Outside of work, he’s a gym enthusiast with a keen interest in the stock market and a soft spot for 2000s pop hits. Bailey Drayperson & Warehouse Assistant Bailey is a dedicated Drayperson & Warehouse Assistant, making sure our beer is always on the move. In his downtime, he enjoys binge-watching Netflix, gaming online with friends, and cheering on his favorite team, Middlesbrough FC. Jake Drayperson & Warehouse Assistant Jake is one of the friendly faces behind the wheel, making sure our beer gets where it needs to be — on time and in perfect condition. When he's not out on the road, you'll find him under the bonnet, taking apart and fixing cars and motorbikes. He’s got a real passion for engines and enjoys the freedom of being out and about delivering the good stuff. Tony Construction Manager Tony, or 'useful Tony' as we call him, is our in-house handyman but when he's not building all sorts of stuff for us he loves to chill by watching stacks of sport. F1, football and rugby union are his favourites. Sal Upkeep Engineer Our pint sized Mary Poppins who keeps everything ship shape. She loves nothing more than a cheeky rosé and gherkins and being in nature. Absolute horror nut, the gorier the better! Russell Maintenance Manager Russell is a master with the tools, fixer of all things bar related. He enjoys nothing more than encouraging Watters to sort his Lindrs out and supping on a pint of Maris. John Bar Operations Director Meet our Bar Operations Director John! Having worked in the industry for 35 years, John has extensive experience cutting his teeth at Black Sheep Brewery, Stonegate Enterprise Inns, and Marstons. Outside of work, John enjoys pursuing various hobbies. He has a passion for photography and is particularly interested in aerial photography, capturing stunning images from unique perspectives. Additionally, John loves nothing more than babysitting and spending time with his granddaughter. Liam Bar Operations Manager Master of pint pulling with a background in cocktails and co-creator of hoptails. Liam is Bar Operations Manager running the floor and making sure you all get through the door, as long as you haven’t had too many already. Ben Regional General Manager: Leeds & Harrogate Ben is our Regional General Manager, overseeing operations across multiple locations with a focus on excellence and growth. Outside of work, he’s an avid golfer, enjoying time on the course whenever he can. Emily Bar Manager: Walmgate Emily leads the team at Brew York’s Beer Hall & Tap Room bringing equal parts charm and spontaneity to the venue. After nearly a decade in the hospitality industry, she’s fluent in beer, banter, and fixing things with duct tape Maddie Bar Supervisor: Taproom & Beerhall Maddie is the Bar Supervisor at the Taproom and Beerhall, ensuring everything runs smoothly behind the bar and delivering top-notch service to every guest. With her passion for great beer and customer care, Maddie creates a welcoming and vibrant atmosphere at both locations. Jacob Bar Supervisor: Taproom & Beerhall Jacob has been a key part of the Brew York team working behind the bar at our bustling Walmgate Tap Room and Beer Hall. As Bar Supervisor, he thrives in the dynamic atmosphere, embracing the organised chaos and always finding something to dive into. When he’s not keeping things running smoothly at Walmgate, Jacob is pursuing an MA in Political Theory at York. A lifelong Arsenal fan, his passion for the Gunners runs as deep as his love for great beer. Aidan Bar Supervisor: Walmgate Aidan is a Yorkshireman through and through, who is ready to give it there all and strives to give nothing but the best customer service. Josh Bar Supervisor: Walmgate Josh brings energy, enthusiasm, and excellent service to the bar at Walmgate. Known for his sharp eye for detail and love of all things beer, he’s always ready with a recommendation or a well-poured pint. Friendly, reliable, and full of banter — Josh helps make Walmgate a great place to be. Jessie Retail Manager Meet Jessie, our brilliant Retail Manager! Jessie oversees everything retail at Brew York, from curating our online webstore to managing our Walmgate gift shop. With her keen eye for detail and passion for delivering top-notch customer experiences, Jessie ensures that every Brew York fan can get their hands on our beers, merch, and more. Avril Bar Manager: Old Grey Mare Avril brings passion, personality, and a love for great hospitality to The Old Grey Mare. A true foodie and wine lover, she’s always happy to recommend the perfect pairing. When she’s not running the bar, you’ll find her planning her next travel adventure, hunting for statement jewellery, or browsing Vinted for hidden gems. Bold, friendly, and full of fun — Avril’s the heart of the pub! Adam Bar Supervisor: Old Grey Mare Dom Bar Manager: The Market Tap Ginger-beardy Pocklington native, Dom has been frequenting the original Tap Room since Brew York’s early days, and more recently the Beer Hall and Market Tap. As he was hanging around so much anyway, we figured we may as well give him some work to do and he jumped at the opportunity to escape the boring world of Facilities Management! When not in pubs and bars for either professional or social reasons, Dom can often be found listening to music with his cat, both of whom share Lee’s taste in music that should come with a health warning! Jonathon Bar Manager: Horse & Farrier Jonathon is the Bar Manager at the Horse & Farrier in Otley, where he ensures everything runs smoothly behind the bar. With his extensive knowledge of drinks and a passion for excellent service, Jonathon creates a welcoming environment for every guest. Sam Assistant Bar Manager: Horse & Farrier Having worked in bars for a number of years, Sam has gained extensive knowledge on all things beer! He loves having a good ol chat with all of the customers, creating a warm welcoming environment for them! Greg Bar Manager: The Mitre Gregg is the Bar Manager at The Mitre in Knaresborough, overseeing the bar operations and ensuring every guest enjoys a top-notch experience. With a wealth of knowledge and a passion for great service, Gregg keeps the atmosphere lively and welcoming. Lucy Bar Supervisor: The Mitre Lucy keeps things running smoothly behind the bar with a love for great beer and good company. Outside of work, she enjoys walking Bess, the family dog, and spending time with her two cats. A big film fan (just don’t mention rom-coms), Lucy also loves heading to the pub to sample the latest craft beers. Friendly, knowledgeable, and always up for a chat about what’s pouring—she’s your go-to for a top pint. Michael Bar Supervisor: The Mitre Michael keeps things running smoothly behind the bar at The Mitre with his calm approach, quick wit, and top-notch pint-pouring skills. Always up for a chat and full of local knowledge, he’s a friendly face you can count on. Whether it’s craft beer, cocktails, or cracking service, Michael’s your guy. Hannah Brewery Tour Guide Hannah is one of our friendly Brewery Tour Guides, offering guests an engaging and informative experience as they explore Brew York. Her passion for craft beer and its production shines through in every tour she leads. Kier Brewery Tour Guide Kier is one of our enthusiastic Brewery Tour Guides, sharing the Brew York story with visitors. Outside of work, he’s passionate about acting, with experience on both TV and stage, bringing his creative energy to every performance. Bob Brewery Tour Guide Pocklington welcomed Bob and his family 35 years ago, and he still lives within walking distance of The Market Tap! After a long career working in the process industry, Bob recently decided it was time to find something new that combined his passion for craft beers with his love of meeting like-minded people. Walmgate Brewery Tours satisfies both, giving Bob the chance to do what he loves while working with a great team. Tia Brew York Mascot Tia is our original brew dog and a beloved member of our team. She’s a friendly, well-behaved dog with a great personality. She’s always happy to greet customers and is a favourite among regulars. Tia loves to hang out with the staff and is always up for a good rub behind her ears. Luca Therapy Dog Luca is a lovable and friendly therapy dog at Brew York. Luca loves spending time with people and bringing joy to everyone around him. He is a regular fixture at the brewery and is always happy to greet visitors with a wagging tail and a big smile. In his free time, Luca enjoys playing fetch, going for walks, and snuggling up with his favourite humans. Kimmy Bar Dog Kimmy is our friendly bar dog at Brew York. After recently retiring from working as a gun dog, Kimmy loves spending time with our team and bringing joy to everyone around her. She is a regular fixture at our bars and is always happy to greet visitors with a wagging tail and a big smile. Information About us Brewery tours Code of Conduct House Rules Trade Contact us General FAQS Ranges Mixed Cases Signature Merchandise State of Mind Seasonal Recent News WE’RE HIRING – ASSISTANT BAR MANAGER WE’RE HIRING: BAR SUPERVISOR Brew York & Valhalla Unite to Launch a Viking-Inspired Birthday Brew Brew York Limited Unit 1, Handley Park, Outgang Lane York, YO19 5UP 01904 848448 Company Reg No. 09607690 info@brewyork.co.uk Trustpilot © 2025 Brew York Limited - Reg 09607690 Cookies Privacy Menu 0 Home Brewery Bash Nine Realms Series Our Beer Signature Cask Signature Keg & Can Shop BEER Signature Mixed Cases Seasonal State of Mind Merchandise Subscribe Our Venues Central York Osbaldwick, York Pocklington The Horse & Farrier The Mitre Towers Taproom Book a Brewery Tour Book a table or private event News Events Beer Festival YouTube Live About us Our Team Contact us Work For Us Trade Friends of Brew York General FAQS My account Search for: Search Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-1",
      "text": "Street Bash Night Market | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Street Bash Night Market Fri, Nov 10 | Dade City Brew House Dade City Brew House's Street Bash Night Market sponsored by Premium Title Inc will return on November 10th (4-9pm).\nInterested Vendors please reach out by email to Jen at: streetbash@dadecitybrewhouse.com\nMore details to come! Time & Location Nov 10, 2023, 4:00 PM – 9:00 PM Dade City Brew House, 14323 7th St, Dade City, FL 33523, USA About the event Dade City Brew House's Street Bash Night Market sponsored by Premium Title Inc will return on November 10th (4-9pm). Interested Vendors please reach out by email to Jen at: streetbash@dadecitybrewhouse.com More details to come! ----------------\n**IMPORTANT** \n----------------\nVendors,  please do not submit payment to anyone on Facebook or any other social  media platform claiming they are taking payments for us. These are  scammers. ALL PAYMENTS are collected at the brewery just like previous  years. No one from our team will contact you via social media for  digital payment as we DO NOT currently accept digital payments. Anyone  contacting you from an account outside of Dade City Brew House regarding  Street Bash is a scammer. Read More > Share this event TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/beerlist",
      "text": "Dade City Brew House Beers on Tap top of page Home About Beer Events Contact More Use tab to navigate through the menu items. BEER ON TAP Canadian Lager Parking Lot Beers On Tap 4.5% ABV Wheat Ale Little Gem On Tap 4.7% ABV Sour Ale Your Dad Called On Tap 6.8% ABV Kolsch Keep 'em Coming On Tap 4.9% ABV Lager ...You Sure About That? On Tap 5.7% ABV West Coast IPA Gilly Goes West On Tap 7.3% ABV Lager Company 7 On Tap 5.0% ABV Helles Rye Lager Mayhem Maker On Tap 5.1% ABV Double Hazy IPA Imaginary Dollar Bills On Tap 8.6% ABV Summer Wheat Ale Daisy Cukes On Tap 5.1% ABV Porter Keep it Regular On Tap 6.5% ABV Sour Ale Alphabet Mafia On Tap ​ Porter Proximity Mines Only On Tap 6.5% ABV Sour Ale Steps of Knowledge On Tap 7.5% ABV Seltzer It's A Numbers Game On Tap 4.4% ABV Pastry Stout A Loaded God Complex On Tap 10.9% ABV Irish Dry Stout Dullahan On Tap 4.1% ABV Dry Irish Stout Nitro - Dullahan On Tap 4.1% ABV TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/about",
      "text": "About | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. 1/5 About Us Dade City Brew House is the vision of Geoff Layne. Located in Dade City’s newest event destination, The Block, Dade City Brew House sits where the car dealership used to be on the corner of 7th and Robinson.  The Block is also home to Crossfit HCP, an event venue, outdoor stage and bar and is conveniently located just off Hardy Trail. Dade City Brew House is a great place to stop during your bike ride or walk. Meet the Team Owner Geoff Lead Beertender Alex Partner Meghan Partner Nancy Brewery Manager Gilly Beertender Vinny Partner Rob Head Brewer Ryan Beertender Piper Partner Brian The Brewery Our brew system at Dade City Brew House is manufactured by Premier Stainless Systems out of California. This is a 10BBL Combi System, meaning the hot liquor and mash tun are combined.  Direct fire is used for heating, running on natural gas.  Specifically, the fire chamber blows in heat as opposed to steam which other systems use.  This is a brew pub style system which works perfect for our taproom brewing needs here at Dade City Brew House. Brewery Ryan Freeman Head Brewer TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadndavesbrewing.com",
      "text": "Dad & Dave's Brewing Skip to Content Open Menu Close Menu Home What's On Menu Brewery Bookings Buy Now Shop Online Shop Wholesale Gift Cards Delta Drinks Our Story Contact Get in Touch Contract Brewing Enquiries Work With Us! Live & Local Return Policy 0 0 Home What's On Menu Brewery Bookings Buy Now Shop Online Shop Wholesale Gift Cards Delta Drinks Our Story Contact Get in Touch Contract Brewing Enquiries Work With Us! Live & Local Return Policy 0 0 Open Menu Close Menu Home What's On Menu Brewery Bookings Folder: Buy Now Back Shop Online Shop Wholesale Gift Cards Delta Drinks Our Story Folder: Contact Back Get in Touch Contract Brewing Enquiries Work With Us! Live & Local Return Policy We Make Beer, Delicious Beer Exciting, sessionable craft beer, outstanding food, & a place to enjoy both, from the team at Dad & Dave’s! Our Story Book Today VISIT THE BREWERY Come and see where the magic happens! From Monday to Friday, our team is brewing, canning and kegging your favourite beers, ready for you to enjoy in our taproom. Our brewery is family and dog friendly, so pop in, grab a beer and one of our famous burgers! Book Today WHAT'S ON The fun never stops at Dad & Dave’s! We’ve got trivia, live and local artists, happy hour, burger specials and more… Check out what events are coming up this month and book a table. Learn More CHECK OUT OUR UPDATED MENU! We’re serving up every mouth-watering burger with a hearty helping of our famous chippies! Get your gang together & come enjoy our beer garden! Book via the button below. We can’t wait to see you! Book Now SHOP DAD & DAVE'S Our whole range is available online, including limited releases, gift cards and merch! With $10 flat rate delivery across New South Wales and the option to pick up from the taproom, you can easily stock up your fridge at home. Buy Now Brewery Bookings Reserve Your Table with Now Book It! Everyone is welcome at Dad & Dave’s Brewing, we are a family and dog-friendly venue. Whether you are popping in for a drink with friends, celebrating a birthday, having dinner with your family or a beer connoisseur looking for a tasting paddle and fellow beer enthusiasts. You’ll always feel welcome in our home. For groups with a crowd of 13 or more, please email our Bar Manager at operations@dadndavesbrewing.com and provide your name, contact number, email address and group size. Sign up with your email address to receive news and updates. Email Address Sign Up We respect your privacy. Thank you! JOIN OUR MAILING LIST Dad & Dave’s Brewing 45 Mitchell Road, Brookvale 2100 NSW Bar/ Bookings: Email: operations@dadndavesbrewing.com Phone: 0450 560 946 (Pref)  /  0452 661 839 Sales/ Wholesale: Email: sales@dadndavesbrewing.com Phone: 0420 982 281 Production: Email: dave@dadndavesbrewing.com Administration: Email: accounts@dadndavesbrewing.com Menu Brewery Bookings Buy  Now Our Story Contact Wild Spirit Distilling Opening Hours Thursday: 5 pm - 10 pm Friday: 4 pm - 10 pm Saturday: 12 pm - 10 pm Sunday: 12 pm - 6 pm You can find our Public Holiday hours under \"What’s On” in the menu bar. Also check out our extended Food Truck hours under “Menu” in the menu bar. Follow Us Facebook Instagram Please drink responsibly License: LIQW880015335 ABN: 53 152 213 119"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/contact-4",
      "text": "Contact | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Contact Us Interested in booking an event at DCBH or have a question? (352) 218-3122 14323 7th St, Dade City, FL 33523 contactus@dadecitybrewhouse.com First Name Last Name Email Message Send Thanks for reaching out! TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://business.eastpascochamber.org/list/member/dade-city-brew-house-2259",
      "text": "Dade City Brew House | Restaurants, Food & Beverage Skip to content Membership Directory Hot Deals Job Postings Member to Member Deals Member Login Membership Application Membership Benefits Ribbon Cuttings Events Calendar Access East Pasco Access to Opportunity Annual Celebration Annual Joe Kiefer Golf Tournament Annual Kumquat Festival® Annual Pigz in Z’Hill BBQ & Blues Festival Business Breakfast Zephyrhills Economic Summit Incredi-Bowl Tournament Member Mixer On the Menu Chamber About Us Board of Directors & Staff Contact Us Events & Programs East Pasco Chamber of Commerce History Information Requests Chamber News (Newsletter) Business Resources Interactive Map Government Major Area Projects Region Transportation Zephyrhills Economic Development Coalition Community Education Community Resources History in East Pasco Map Our Communities Sports & Recreation Foundation About East Pasco Chamber Foundation Citizen of the Month Foundation Board of Directors & Staff Scholarships Skills That Pay Bootcamp Ways to Invest Dade City Brew House Categories Restaurants, Food & Beverage 14323 7th Street Dade City FL 33523 (352) 218-3122 Visit Website Hours: Mon 12pm-10pm; Tue & Wed 12pm-8pm; Thu 12pm-10pm; Fri-Sat 12pm-11pm & Sun 11am-8pm About Us Brewery and tap room Rep/Contact Info Geoff Layne × Close Geoff Layne Owner Phone: (352) 232-4286 Send an Email 14323 7th Street Dade City FL 33523 Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Greater East Pasco Chamber of Commerce | Site by GrowthZone Get In Touch! 352-567-3769 14112 8 th Street, Dade City, FL 33525 813-782-1913 38550 5th Avenue, Zephyrhills, FL 33542 ceo@eastpascochamber.org Additional Resources FAQ Privacy policy Terms and conditions Stay Connected! facebook YouTube The Greater East Pasco Chamber of Commerce is committed to ensuring that its website is accessible to people with disabilities. The Greater East Pasco Chamber of Commerce is in the process of updating all pages on our website. All pages will meet W3C WAI’s Web Content Accessibility Guidelines 2.1, Level AA conformance. For a copy of the Greater East Pasco Chamber of Commerce ADA Compliance Policy or to report any issues, please direct email to ceo@eastpascochamber.org . © 2025 Greater East Pasco Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.dadecitybrewhouse.com",
      "text": "Home | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. BEER ABOUT EVENTS BREWERY HOURS &  LOCATION CONTACT Welcome to Dade City’s original, award-winning brewery! We are proud to offer an extensive lineup of tasty, housemade beers, ciders and seltzers. Found in the heart of downtown Dade City, we are a family and dog friendly establishment where we hope that you come and stay awhile. We look forward to being your go-to place to host all of your events, parties and receptions! About Us IMG_2896(1) IMG_2896(1) 1/6 TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Our Location The Historic 1920's car dealership newly renovated.  Gives homage to Dade City's past and brings a modern feel to the culture of Dade City's future. The newly renovated space at The Block at Dade City is located right in the heart of downtown. 14323 7th St, Dade City, FL 33523 View Map Hours TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Contact Connect Untappd DCBH Insider TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/events/brunch",
      "text": "Events | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Upcoming Events Multiple Dates Hardy Trail & Ales Run Club Wed, Sep 10 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 15 More info Learn more Oktoberfest Sat, Sep 20 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 22 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Sep 24 More info Learn more 4.5 Anniversary and Car Meet Sat, Sep 27 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 29 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 06 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Oct 08 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 13 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 20 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Oct 22 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 27 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 03 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 10 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Nov 12 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 17 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 24 More info Learn more Load More TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/events/trivia-2021-05-17",
      "text": "Events | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Upcoming Events Multiple Dates Hardy Trail & Ales Run Club Wed, Sep 10 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 15 More info Learn more Oktoberfest Sat, Sep 20 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 22 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Sep 24 More info Learn more 4.5 Anniversary and Car Meet Sat, Sep 27 More info Learn more Multiple Dates Monday Night Trivia Mon, Sep 29 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 06 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Oct 08 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 13 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 20 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Oct 22 More info Learn more Multiple Dates Monday Night Trivia Mon, Oct 27 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 03 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 10 More info Learn more Multiple Dates Hardy Trail & Ales Run Club Wed, Nov 12 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 17 More info Learn more Multiple Dates Monday Night Trivia Mon, Nov 24 More info Learn more Load More TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-returns",
      "text": "Street Bash Night Market Returns! | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Street Bash Night Market Returns! Fri, Mar 14 | Dade City Brew House That's right! After a year of research, meetings, and back & forth, Street Bash is back! Join us on March 14 from 4 pm to 9 pm as Dade City Brew House & D|C Social host a St. Patrick's Day take on Dade City's family-friendly Night Market on 7th Street between MLK & Meridian. Time & Location Mar 14, 2025, 4:00 PM – 9:00 PM Dade City Brew House, 14323 7th St, Dade City, FL 33523 About the event That's right! After a year of research, meetings, and back & forth, Street Bash is back! Join us on March 14 from 4 pm to 9 pm as Dade City Brew House & D|C Social host a St. Patrick's Day take on Dade City's family-friendly Night Market on 7th Street between MLK & Meridian. There will be vendors, food trucks, music, kid zone, and nothing but good times. So show up in your finest green attire and explore all of the amazing things Dade City has to offer at Street Bash! Stay tuned for more details! NOTE: If you would like to be a vendor and/or sponsor at Street Bash, the only way to do so is by reaching out to streetbash@dadecitybrewhouse.com via email to get an application. We DO NOT conduct any business on social media at all and we DO NOT accept digital payments whatsoever. If someone approaches you on social media, THEY ARE A SCAMMER. The only way to pay for vendor spots is via cash or check at Dade City Brew House. Read More > Share this event TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/event-details/street-bash-night-market-3",
      "text": "Street Bash Night Market  | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. Street Bash Night Market Fri, Apr 11 | Dade City Brew House Hometown Hoedown Time & Location Apr 11, 2025, 4:00 PM – 9:00 PM Dade City Brew House, 14323 7th St, Dade City, FL 33523 About the event Street Bash - presented by Dade City Brew House & D|C Social - is back on Friday, April 11 and this time we are throwing a Hometown Hoedown! We are talking live DJ, line dancing in the street, vendors, food trucks, and y'all in your cutest country western attire! It is gonna be one heck of a party, so get your crew together and plan for nothing but good times on April 11! NOTE: If you would like to be a vendor and/or sponsor at Street Bash, the only way to do so is by reaching out to streetbash@dadecitybrewhouse.com via email to get an application. We DO NOT conduct any business on social media at all and we DO NOT accept digital payments whatsoever. If someone approaches you on social media, THEY ARE A SCAMMER. The only way to pay for vendor spots is via cash or check at Dade City Brew House. Read More > Share this event TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/beerlist/little-gem",
      "text": "Little Gem | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. All Beers Little Gem Wheat Ale Wheat Ale Wheat Ale ​ Little Gem is a Wheat Ale fermented with the Kveik yeast strain from Norway. We use local Kumquats from our friends at the Kumquat Growers Inc to make it the perfect blend of fruity aromas from the yeast and citrus flavor from the Kumquats. Wheat Ale Style Style 4.7% ABV TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    },
    {
      "url": "https://brewround.com/contact-us/",
      "text": "Contact Us | BrewRound Skip to content Coffee drinkers Find Coffee Shops Takeaway Coffee Best Coffee of Instagram Coffee Shop Owners Coffee Shop Subscription Mobile Ordering Loyalty and Rewards Attract more customers Coffee drinkers Find Coffee Shops Takeaway Coffee Best Coffee of Instagram Coffee Shop Owners Coffee Shop Subscription Mobile Ordering Loyalty and Rewards Attract more customers Shop sign up Get in touch Want to get in touch? We'd love to hear from you. Here's how you can reach us... Talk to sales Interest in what BrewRound offers? Get in touch with our sales team to join the platform. Send us an email Contact customer support Have you had an issue with the app or an order? Get in touch so we can make things right. Send us an email Find us BrewRound LTD Popeshead Court Offices Peter Lane York YO1 8SU Registered in England & Wales: 12660289 Something else? Do you have another enquiry for BrewRound? Whatever it is, we’d love to hear from you. Please complete the contact form below OR call us on 07969370313 Name Email Message Submit enquiry Mobile ordering Find the best coffee See all locations Coffee shops in York Coffee shops in Leeds Coffee shops in Manchester Coffee shops in Hull BrewRound About Us Blog Contact Us For Coffee Shop Owners Why join BrewRound? Pricing F.A.Q Subscription Service like Pret A Manger Follow Us Twitter Instagram Facebook ©2023 BrewRound Privacy Policy | Terms and Conditions | Cookie Policy This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Cookie Duration Description __cf_bm 30 minutes Cloudflare set the cookie to support Cloudflare Bot Management. _hjAbsoluteSessionInProgress 30 minutes Hotjar sets this cookie to detect a user's first pageview session, which is a True/False flag set by the cookie. _hjIncludedInPageviewSample 2 minutes Hotjar sets this cookie to check whether a user is included in the data sampling defined by the site's pageview limit. ig_did past Instagram installs this cookie so that its widgets are enabled on the website. li_gc 5 months 27 days Linkedin set this cookie for storing visitor's consent regarding using cookies for non-essential purposes. lidc 1 day LinkedIn sets the lidc cookie to facilitate data center selection. mid past The mid cookie is set by Instagram to personalise user experience by remembering user preferences and settings. TawkConnectionTime session Tawk.to, a live chat functionality, sets this cookie. For improved service, this cookie helps remember users so that previous chats can be linked together. twk_idm_key session Tawk set this cookie to allow the website to recognise the visitor in order to optimize the chat-box functionality. UserMatchHistory 1 month LinkedIn sets this cookie for LinkedIn Ads ID syncing. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Cookie Duration Description __gads 1 year 24 days Google sets this cookie under the DoubleClick domain, tracks the number of times users see an advert, measures the campaign's success, and calculates its revenue. This cookie can only be read from the domain they are currently on and will not track any data while they are browsing other sites. __hstc 5 months 27 days Hubspot set this main cookie for tracking visitors. It contains the domain, initial timestamp (first visit), last timestamp (last visit), current timestamp (this visit), and session number (increments for each subsequent session). _fbp 3 months Facebook sets this cookie to display advertisements when either on Facebook or on a digital platform powered by Facebook advertising after visiting the website. _ga 1 year 1 month 4 days Google Analytics sets this cookie to calculate visitor, session and campaign data and track site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognise unique visitors. _ga_* 1 year 1 month 4 days Google Analytics sets this cookie to store and count page views. _gat_gtag_UA_* 1 minute Google Analytics sets this cookie to store a unique user ID. _gid 1 day Google Analytics sets this cookie to store information on how visitors use a website while also creating an analytics report of the website's performance. Some of the collected data includes the number of visitors, their source, and the pages they visit anonymously. _hjFirstSeen 30 minutes Hotjar sets this cookie to identify a new user’s first session. It stores the true/false value, indicating whether it was the first time Hotjar saw this user. AnalyticsSyncHistory 1 month Linkedin set this cookie to store information about the time a sync took place with the lms_analytics cookie. hubspotutk 5 months 27 days HubSpot sets this cookie to keep track of the visitors to the website. This cookie is passed to HubSpot on form submission and used when deduplicating contacts. ln_or 1 day Linkedin sets this cookie to registers statistical data on users' behaviour on the website for internal analytics. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Cookie Duration Description __gpi 1 year 24 days Google Ads Service uses this cookie to collect information about from multiple websites for retargeting ads. bcookie 1 year LinkedIn sets this cookie from LinkedIn share buttons and ad tags to recognize browser IDs. bscookie 1 year LinkedIn sets this cookie to store performed actions on the website. fr 3 months Facebook sets this cookie to show relevant advertisements by tracking user behaviour across the web, on sites with Facebook pixel or Facebook social plugin. IDE 1 year 24 days Google DoubleClick IDE cookies store information about how the user uses the website to present them with relevant ads according to the user profile. test_cookie 15 minutes doubleclick.net sets this cookie to determine if the user's browser supports cookies. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Cookie Duration Description _ca.5f2843ada67f460029bccad6 1 year 1 month 4 days Description is currently not available. _ca.5fb25bb528d4cd0029083ce6 1 year 1 month 4 days Description is currently not available. _ca.6439a5811321960029126c3b 1 year 1 month 4 days Description is currently not available. _hjIncludedInSessionSample_1886234 2 minutes Description is currently not available. _hjSession_1886234 30 minutes Description is currently not available. _hjSessionUser_1886234 1 year Description is currently not available. original_referrer never No description available. SAVE & ACCEPT Powered by"
    },
    {
      "url": "https://www.dadecitybrewhouse.com/team",
      "text": "Team | Dade City top of page Home About Beer Events Contact More Use tab to navigate through the menu items. TAP ROOM HOURS Mon Tues Wed Thurs Fri Sat Sun 12P - 10P 12P - 8P 12P - 8P 12P - 10P 12P - 11P 12P - 11P 12P - 8P Contact Email contactus@dadecitybrewhouse.com Directions 14323 7th St, Dade City, FL 33523 Phone 352-218-3122 Connect Untappd DCBH Insider bottom of page"
    }
  ]
}