{
  "fuentes": [
    {
      "url": "https://www.bizbash.com/venue-directory/activity-venues/arcades-virtual-reality-centers/venue/13391446/dave-busters-hollywood",
      "email": "jacqueline_reissent@daveandbusters.com"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5188/dave-busters-hollywood/",
      "email": "standardrentals@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5188/dave-busters-hollywood/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://grouppinnacle.com/rest-in-peace-dave-buster/",
      "email": "info@grouppinnacle.com"
    }
  ],
  "mails": [
    "info@grouppinnacle.com",
    "jacqueline_reissent@daveandbusters.com",
    "standardrentals@2x.png",
    "valet@2x.png"
  ],
  "nombre_sitio": "daveandbusters.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bizbash.com/venue-directory/activity-venues/arcades-virtual-reality-centers/venue/13391446/dave-busters-hollywood",
      "text": "Dave & Buster's Hollywood | Bizbash Venue & Supplier Directory Informa Bizbash is part of the Informa Connect Division of Informa PLC Informa PLC ABOUT US INVESTOR RELATIONS TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. Informa Documents Magazine Awards Events Subscribe Topics Event Production & Planning Related Topics Experiential Marketing Event Fabrication Programming & Entertainment Event Rentals See All > Event Design Related Topics Event Decor Corporate Swag See All > Event Catering Related Topics Food & Beverage Trends See All > Event Tech Related Topics AI for Meetings Event Tools Virtual Events See All > Event Venues Related Topics Hotels See All > Sporting Events Meetings & Trade Shows Related Topics Corporate Events Meetings Trade Shows Suppliers Venues Event Production & Planning Experiential Marketing Event Fabrication Programming & Entertainment Event Rentals Event Design Event Decor Corporate Swag Event Catering Food & Beverage Trends Event Tech AI for Meetings Event Tools Virtual Events Event Venues Hotels Sporting Events Meetings & Trade Shows Corporate Events Meetings Trade Shows Suppliers Venues Connect About us Advertise Resources Webinars White Papers Press Releases Venue & Supplier Directory Join Us Subscribe Gain easy access to downloads, webinars, magazine articles, and more! Follow Us Dave & Buster's Hollywood Venue Description Plan Your Event. You Send the Invites. We’ll Do the Rest.rnrnGreat occasions call for a great venue. Whether you’re planning an award banquet, anniversary, fund-raiser, planning meeting, reunion, or birthday bash, we can easily accommodate 2,000 of your closest friends.rnrnWho knew getting down to business could be so fun? Try our organized team challenges in our full meeting facilities, or simply turn the troops loose in the Midway. Either way, we’ll turn your colleagues into teammates. Fast.rnrnBuffets and entertainment. The food and fun never end. No matter what type of event you have in mind, there are two things you can count on from Dave & Buster’s: amazing buffets and about a zillion ways to have fun.rnrnLet our planning experts help put together your perfect party. Contact your D&B Special Events Team or visit www.daveandbusters.com for more information. Spaces Entire Space Area: 58000 Min. capacity: 4350 Max. capacity (standing): 5800 Showroom Min. capacity: 150 Max. capacity (standing): 200 Markets Florida Categories Activity Venues Venue Dave & Buster's Hollywood Website Email Us 9549235505 Address 3000 Oakwood Blvd. 33020 Hollywood, FL Send inquiry Explore About Us Subscribe to\r\n                BizBash Venue & Supplier Directory BizBash Lists Partner With Us Advertise Get\r\n                Featured Join Us Subscribe Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. Website TOU Code of conduct events Group privacy policy CCPA Cookie Policy Drop Us A Message I have read, understood and consent to your Privacy Policy Send Inquiry JavaScript is not enabled in your browser. Please enable\r\n              JavaScript, or certain functions may not work properly."
    },
    {
      "url": "https://www.wedding-spot.com/venue/5188/dave-busters-hollywood/",
      "text": "Dave & Buster's Hollywood | Venue - Hollywood, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Photo by: Michael Anthony Photography & Video Report Dave & Buster's Hollywood 954-364-6107 CALL VENUE FAVORITE Venue highlights Rentals included Valet parking Venue details Style: Banquet Hall/Restaurant Guest capacity: Accommodates up to 200 guests Services: Ceremony / Reception Indoor VIEW OPTIONS Location: 3000 Oakwood Bulvard Hollywood, FL 33020 Description: Game on! Located in the charming beach town of Hollywood, the Dave and Buster’s is an entertaining and unique location for your special day. Guests will be served cocktails at the impressive bar as the colorful mood lighting sets the scene. Each space has a fully flexible floorplan, so the room can be configured just the way you need it to be. Be impressed by the spacious and elegant dining area in the Showroom and enjoy the deliciously crafted meal before you hit the dance floor and show off your latest moves! Display a photo slideshow of you and your beloved on one of the many screens lining the walls as guests “ooh” and “aah” over the memories you have already created and will create in the future. And of course the best part about having your reception in one of the private spaces? When the work is done and it's all about fun, there is loads of it waiting for your group just outside of the doors. READ MORE Additional details Service Options Venue notes The rental fee is $350 for a ceremony and  reception and includes 3 hours of event time excluding set up and clean up time. Amenities and Restrictions Amenities - Wedding planning services - Tables and chairs provided - Linens, silverware, glassware provided - Security - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - All food and beverage handled by venue - No rice, birdseed, confetti, etc. - Catering provided by venue - Amplified music OK indoors only - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Amenities - Wedding planning services - Tables and chairs provided - Linens, silverware, glassware provided - Security - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - All food and beverage handled by venue - No rice, birdseed, confetti, etc. - Catering provided by venue - Amplified music OK indoors only - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Links Dave & Buster's Hollywood 954-364-6107 CALL VENUE FAVORITE Venue Highlights Rentals included Valet parking STARTING AT $1,686 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor only Max Indoor capacity: 200 Reception Indoor only Max Indoor capacity: 200 STARTING AT $1,686 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://grouppinnacle.com/rest-in-peace-dave-buster/",
      "text": "Rest In Peace... And Thank You, Dave & Buster Skip to content Search for: SERVICES FEC LAUNCH PACKAGE OPERATIONS OPTIMIZATION FEASIBILITY STUDIES GAME-BASED DIGITAL TRAINING ACQUISITION & DIVESTITURE FEC CONSULTING INDUSTRIES FAMILY ENTERTAINMENT CENTERS BOWLING ALLEYS EATERTAINMENT MOVIE THEATERS & CINEMAS HOTELS & RESORTS INDOOR SPORTS PARK WITH FECs CASINOS ARCADES ABOUT US LEADERSHIP HISTORY CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz CLIENTS STRATEGIC PARTNERS TESTIMONIALS RESOURCES WHY HIRE AN FEC CONSULTANT? CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz TYPES OF FACILITIES BLOG CONTACT Search for: SERVICES FEC LAUNCH PACKAGE OPERATIONS OPTIMIZATION FEASIBILITY STUDIES GAME-BASED DIGITAL TRAINING ACQUISITION & DIVESTITURE FEC CONSULTING INDUSTRIES FAMILY ENTERTAINMENT CENTERS BOWLING ALLEYS EATERTAINMENT MOVIE THEATERS & CINEMAS HOTELS & RESORTS INDOOR SPORTS PARK WITH FECs CASINOS ARCADES ABOUT US LEADERSHIP HISTORY CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz CLIENTS STRATEGIC PARTNERS TESTIMONIALS RESOURCES WHY HIRE AN FEC CONSULTANT? CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz TYPES OF FACILITIES BLOG CONTACT SERVICES FEC LAUNCH PACKAGE OPERATIONS OPTIMIZATION FEASIBILITY STUDIES GAME-BASED DIGITAL TRAINING ACQUISITION & DIVESTITURE FEC CONSULTING INDUSTRIES FAMILY ENTERTAINMENT CENTERS BOWLING ALLEYS EATERTAINMENT MOVIE THEATERS & CINEMAS HOTELS & RESORTS INDOOR SPORTS PARK WITH FECs CASINOS ARCADES ABOUT US LEADERSHIP HISTORY CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz CLIENTS STRATEGIC PARTNERS TESTIMONIALS RESOURCES WHY HIRE AN FEC CONSULTANT? CASE STUDIES B&B Theatres JW Marriott Rose Bowl The Workz TYPES OF FACILITIES BLOG CONTACT Rest in Peace… And Thank You, Dave & Buster, Giants of Our Industry Rest in Peace… And Thank You, Dave & Buster, Giants of Our Industry This content was originally published in RePlay Magazine . I can’t imagine there are more than a very few owners or operators in our arcade and family entertainment industry who haven’t visited a Dave & Buster’s to see what they could learn. I remember walking into my first D&B in 1987 or so. The innovative combination of restaurant, bar and upscale arcade was one thing. But the execution –– at those volume levels –– was the part that was most awe-inspiring to me. Dave & Buster’s founders: Dave Corriveau and Buster Corley. Buster Corley passed away far too soon in January, following his business partner Dave Corriveau who left us in 2015. Dave and Buster touched –– and taught –– so many of us who operated and entertained well over a hundred million guests in the 40+ year history of the company they started. I was fortunate to be friends with Dave for many years, met Buster several times, and became friendly with many of their management team who worked with them. With Buster’s passing, I asked for comments from several of them: Andy Newman is the former chairman and CEO of Edison Brother Stores, which owned D&B from 1989 until 1995. He was chairman of D&B after Edison spun off the business to become an independent public company: “From the moment we acquired 80% of Dave & Buster’s in 1989, I really enjoyed working with them. Buster was the consummate ‘people person,’ a great, compassionate leader. Dave was a unique personality, and each brought creative energy to the business, never compromising the level of customer experience. They were a dynamic pair of outstanding pioneers in their field.” At the celebration of Dave & Buster’s 4th anniversary on Dec. 2, 1986, are (from left to right): Cory Haynes, Buster Corley, Tom Aston, Sterling Smith (holding his son, Jacob), Dave Corriveau, Barry Carter (kneeling), Paul Curd, Ted Waldrom, Mike Plunkett (holding his son, Jamie), Calvin Jefferson and Pat Betts. Cory Haynes and Mike Plunkett were both lifelong friends and business colleagues of both Dave and Buster and key players who served in senior roles at D&B from the beginning and for many years. Today, Cory is the president and founder of Amusement Source International while Mike is the owner of JMP Consulting. “In 1982, Dave and Buster had the vision to introduce video game play, billiards and shuffleboard, along with food and beverage, to adults in a Vegas-style setting. They basically took billiards out of the pool hall, video games out of the arcade, and created a setting where guest service was the most important element: ‘Ladies and Gentlemen serving Ladies and Gentlemen.’ “We had the pleasure of working with Dave and Buster for a combined 60-plus years. The most consistent operating principles were ‘Attention to Detail’ and ‘Everybody is Somebody.’ It wasn’t just a saying, it was – and still is – a way of life. Both Dave and Buster had an enormous impact on our lives and thousands of others. We were friends longer than working partners. We will miss and remember them forever.” Reggie Moultrie was the vice president of amusements for Dave and Busters from 1997-2003. Today, he is president and CEO of Moute Point Inc. in Olathe, Kansas. “Dave and Buster hired me into the company at a private dinner held at an exclusive restaurant in New York. I had known Dave for years, but Buster was only an acquaintance at the time of the dinner. I was living in Pennsyl – vania, working as VP of Sales for Skee-Ball, so I drove to New York and met them at the restaurant. Buster was very patient, asked a ton of questions, and then looked at Dave and said, ‘I think we should make Reggie an offer.’ That changed my life! “Buster was a passionate and very wise individual who loved our business and the D&B team. He always emphasized to me that the team was more important than the revenue. I was shocked at the news of his passing. I loved the man, and my prayers go out to his wife Leacy and his daughter Kate.” Keitha McBride started working at D&B #2, the Walnut Hill location, in Dallas in 1989 as a server. She grew with the company, left briefly and with the encouragement of Cory Haynes, returned to the company as merchandise buyer in 1996. Today, Keitha is a senior executive at PIA Products, based in Dallas. “I have always said how grateful I am to have worked for such a family-oriented business. I met both Dave and Buster soon after starting in 1989. I knew I had landed somewhere very special. “Buster was a true mentor and he had high expectations for all his team members. You were expected to know the menu and it was nerve-racking when they sat at Grand Bar for lunch, but it was FUN! You performed because you wanted them to see you as an All-Star! Today, I wouldn’t be doing what I love without both Dave and Buster. I’m so grateful for the two men who were true trailblazers, true entrepreneurs, and a team, quite the duo! EVERYTHING about this company was driven by family. We are still a family!” Pete Stearns and Buster Corley. Pete Stearns began his career at Time-Out and moved to D&B in 1995. He has risen through the ranks at the company and today is the senior director of midway operations. “Back in 1995, this man changed my life…forever. Buster was passionate about everything and everyone … from top to bottom. It didn’t matter who you were or what you did. He was interested in listening. The first day I met Buster was at my interview with D&B. I didn’t even know who he was. He sat down and struck up a conversation with me. He talked with me for 10 minutes in what was the easiest conversation I have probably ever had with a complete stranger. He stood up, shook my hand and said ‘Good luck with your interview.’ Mind you, I still didn’t know who he was (because that wasn’t important to him). Two minutes later, the gentleman who I was there to meet came over and asked, ‘So, what did you think of Buster?’ “He gave away his time, no matter how busy he was. This man took a chance on me as a young guy looking for a new home. I am forever indebted to Buster (he would never agree to this statement). The world has lost a kind, outstanding human being. I wish each and every one of you could have met Buster because he would have made time for you.” Chris Morris is the current CEO of Dave & Buster’s. “While I never had the chance to work with Buster, I felt his impact on the culture of this brand every day since I joined the company. Recently, I had the honor of spending time with Buster, and during that time, it all made sense. Watching him interact with the team, it was clear to me that he was a believer in people. He built a company based on a vision he and Dave had 40 years ago that was made real by all the people who believed in him, and he never forgot that. We will honor his legacy by carrying forward his vision. We’ll also carry forward the culture that makes this brand so special to our teams and to the millions of guests we serve every year.” Howard McAuliffe 2023-01-30T13:37:33-05:00 SHARE Facebook X LinkedIn Pinterest Search for: CATEGORIES Acquisition & Divestiture Bowling Entertainment Center Case Study Casino Cinema Entertainment Center Eatertainment Family Entertainment Center/FEC Feasibility Studies Featured Case Study Large Corporate Client Podcast Resort Hotel Sports Facility Strategic Client Uncategorized RECENT POSTS 10 Steps to Create a Family Entertainment Center Business Plan 8 Steps To Start a Successful Family Entertainment Center Business Game On! Will Smart Operations Shape the Rest of 2025? What Do Consumers Want from Out-of-Home Entertainment & FECs? Opening An Arcade in 2025: How to Do it and How Much it Costs ARCHIVES August 2025 June 2025 May 2025 March 2025 January 2025 April 2024 January 2024 December 2023 November 2023 June 2023 February 2023 January 2023 December 2022 November 2022 June 2022 May 2022 March 2022 November 2021 September 2021 June 2021 May 2021 February 2021 January 2021 December 2020 November 2020 September 2020 Leading the family entertainment industry by helping hundreds of Family Entertainment Centers and Bowling Entertainment Centers meet their potential. CONTACT Pinnacle Entertainment Group 28 Valley Rd Suite 1 Montclair, NJ 07042 314-378-4522 ACCESS Log In Sign Up Site Map FOLLOW Copyright 2022 Pinnacle Entertainment Group, LLC All Rights Reserved | Privacy Policy WordPress website design provided by Jack & Bean Page load link Go to Top"
    }
  ]
}