{
  "fuentes": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://ricsbar.com.au/",
      "email": "kat@royalgeorgehotel.com.au"
    },
    {
      "url": "https://ricsbar.com.au/",
      "email": "bec@royalgeorgehotel.com.au"
    }
  ],
  "mails": [
    "bec@royalgeorgehotel.com.au",
    "info@rivervillegrill.com",
    "kat@royalgeorgehotel.com.au"
  ],
  "nombre_sitio": "daytonahilton.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://ricsbar.com.au/",
      "text": "Home | Ric's Bar Gig Guide Functions Play with Us Hall of Fame Journal Home Menu Functions Gig Guide Play at Rics Journal Your browser does not support the video tag. Step Into Rics Check the Gig Guide Pause Unmute Fostering the bands of the future From its inception Ric's has been an incubator venue. The place you play in order to discover your sound, find your feet and launch into the industry. Having hosted the likes of The Chats, Jungle Giants, Tones and I and Megan Washington, Ric's is the original musical mogul of Brisbane. Moving live music from our front bar into the backyard during the course of COVID in 2020 has seen incredible upgrades in equipment and more importantly the potential for exposure. All gigs are paid, we don't expect you to play for love. So reach out, let's see which future superstars we can add to the list of Rics alumni. Play at Rics Experience the Rics Effect Open every night of the week, we have something for everyone no matter what your schedule. Scroll through to check out what's on 7 days a week at Rics from entertainment to drinks and food deals. What Else is On Drinks Menu Platter Menu Full Menu Function Spaces If you are looking for a venue that has character, atmosphere and attitude, rather than a boring blank box then send us an enquiry or call (07) 3252 2524. Every event is hand designed by Kat, our events coordinator, with your vision at the centre of focus. If you have a crazy idea, hit us. We just might be able to help you bring it to life. Function Enquiry Upstairs 100 Ric's Upstairs is our most popular space for exclusive parties. Catering from 20 all the way up to 100 guests this is the ultimate space for birthdays, going away parties… View Upstairs Front Bar 30 Rics front bar is the original iteration of Rics. Before there was the backyard or upstairs there was the front bar. Affectionately referred to as the karaoke bar now because… View Front Bar Backyard > 250 The backyard is our most iconic space and if you've been there, you'll know exactly why. With room for well over 250 guests, we routinely play host to large uni… View Backyard A little party never killed nobody Sundays aren't for sleeping Make the weekends jealous Rics FAQ Have questions about Rics? Here are some of the ones we hear all the time that might help! Is there a dress code? Rics does have a dress code that precludes track pants, singlets, high vis, basketball or board shorts. Regarding footwear, no thongs are permitted (for safety!). As per house policy we reserve the right to refuse entry if dress standards are not met. These standards may vary on case to case situations. What is an acceptable form of ID? It is a requirement of law that your physical ID is scanned upon entry. We only accept non expired, physical forms of ID and photos of ID will not be accepted. By law one of the following forms of identification are accepted as proof of age and entry: A current Australian driver’s license or permit, current Australian or foreign passport, current Government issued proof of age card, other current identity documents approved by the Liquor Licensing Division such as: the new digital licences or an overseas drivers license that must contain the persons photograph, date of birth and be written in the English language. Student IDs are not a valid form of ID. If your licence has expired and you can show us proof, by way of the digital receipt, that you have purchased your new card, we can use the updated expiry date on that receipt. All we need to do is scan your old ID and manually update the expiry date. What is your tattoo policy? The venue does hold a no face tattoo policy. This policy originated years ago when almost all persons with a face tattoo were associated with outlawed motorcycle gangs. The policy was a means to protecting the safety of the venue's patrons and was a reasonable precaution at the time. We now recognise that there are more reasons that a person may have face tattoos beyond that of symbolising belonging to a bikie gang such as the traditional tribal face tattoos commonly known as Ta Moko or Moko Kauae in Aotearoa (New Zealand). As a result of this cultural edification we approach every instance of face tattoos individually. If you do have a cultural or traditional face tattoo, our policy is for a manager to come and introduce themselves and discuss it with you. Culturally significant face tattoos should not strictly disallow you from entry in this venue. Please make sure you ask for a manager, rather than only discussing the matter with a security guard. Neck and hand tattoos are perfectly fine. Is there a cover charge? Rics only has a cover charge after 9pm on Friday and Saturday nights. his may vary slightly due to special events etc. but is pretty reliably true. Cover charge is $10 after 9pm on Friday and Saturday nights and also gets you access to our sister venue Chattahoochee Joes! Can my band play at Rics? You most certainly can! Submit an enquiry form via this website with some links to recordings/videos your music. If you suit the style of Rics then our venue manager Dylan will get in touch with a date to play! What is your ID Scanning Policy? In accordance with the Liquor Act 1992, we are required to scan your photo identification before you enter the premises after 10pm on all days to check if you have been issued with a banning order that applies to this premises. You may also be prevented from entering if you are subject to a ban initiated by this venue or you are subject to a banning order or venue ban for another venue. If we do not scan your identification as required by the Liquor Act, then we must not allow you to enter the premises. The Liquor Act exempts certain persons from having their ID scanned, such as temporary or permanent residents of the regulated premises. The full list of exemptions is outlined in section 173 EH(7) of the Liquor Act. The personal information we collect when scanning your ID is limited to name, date of birth and photo. It may only be used to: •\tidentify if you have been issued with a current banning order or licensee ban •\tcreate a venue ban. All personal information is stored at the venue and by the approved operator in a way that protects it from unauthorised access, modification or disclosure. Your personal information is automatically and permanently deleted from the ID scanner system 30 days after it is first entered into the system. However, information on banned people will be held in the system for the period of the ban, which may exceed 30 days. You may request access to the personal information that is held about you. You can contact us or our approved operator to request this information. You will need to provide photo ID before any information can be released. Some exceptions apply. You can also ask us to correct the personal information that is held about you. We will require satisfactory proof of the inaccuracy before we consider correcting your personal information. To make a complaint or raise privacy concerns, contact this venue’s privacy officer at (07 3252 2524) or our approved operator Rebecca Pullos (bec@royalgeorgehotel.com.au) or Katherine Pullos (Kat@royalgeorgehotel.com.au) Lost Property Careers Function Enquiry Play at Rics Mental! WE’RE POURING DRINKS ‘Till 5AM TOMORRO Third and final day of @bigsound in the backyard t What a mix of talent joining us tonight for @bigso @bigsound is here!!!! Checkout the incredible line PSA : OPENING UNTIL 5AM ON SEPTEMBER 6!!!! YEP! Ba You know what night it is! See you at the karaoke Become a Rics Kid For Birthday Club Offers, Exclusive Event Invites + To Be the First in the Know. Pullos Group The Royal George Hotel Marquee Bar Party Central 321 Brunswick Street Fortitude Valley Brisbane 07 3252 2524 Opening Times Monday-Wednesday: 8:00pm-3:30am Thursday-Sunday: 6:00pm-3:30am Copyright 2022 - Rics Bar Book a Table Lost Property Name First Last Phone Email Date of Item Lost DD slash MM slash YYYY Description of Item (Required) Marketing Consent I do not consent to joining the Ric's Bar marketing and email list. Δ Play at Rics All bookings are organised through the Muso Platform so please provide your link for a greater chance at being booked. Please Select your Enquiry: DJ Bands \" * \" indicates required fields DJ Name * Email * Contact Name * First Last Phone * Link to Music Marketing Consent I do not consent to joining the Ric's Bar marketing and email list. CAPTCHA Δ \" * \" indicates required fields Band Name * Email * Contact Name * First Last Phone * Link to Music Marketing Consent I do not consent to joining the Ric's Bar marketing and email list. CAPTCHA Δ Join the Rics Team Name First Last Email Phone Tell us a little about yourself. Marketing Consent I do not consent to joining the Ric's Bar marketing and email list. Resume Max. file size: 2 MB. CAPTCHA Δ Function Enquiry Name First Last Phone Email Desired Room Upstairs The Backyard Frontbar Event Date (Required) DD slash MM slash YYYY Event Time (Required) Hours : Minutes AM PM AM/PM Event Budget Guest Count Additional Information Marketing Consent I do not consent to joining the Ric's Bar marketing and email list. CAPTCHA Δ"
    }
  ]
}