{
  "fuentes": [
    {
      "url": "https://www.goodsam.com/campgrounds-rv-parks/florida/daytona-beach/daytona-rv-oasis-910000051",
      "email": "campgrounds@goodsam.com"
    },
    {
      "url": "https://www.oxbowrvresort.com/contact/",
      "email": "oxbow@shaw.ca"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "email": "reservations@idahodunesrv.com"
    },
    {
      "url": "https://daytonarvpark.com/",
      "email": "office@daytonarvpark.com"
    },
    {
      "url": "https://www.goodsam.com/campgrounds-rv-parks/florida/daytona-beach",
      "email": "campgrounds@goodsam.com"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "amy.locklear@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "aquino@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "aquino@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "cerese.ramos@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "cerese.ramos@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "jodi.long@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "kristen.hanson@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "martin.cass@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "martin.cass@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "romualdo.marquinez@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "romualdo.marquinez@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "tanika.clemons@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "thomas.lobasso@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "thomas.lobasso@daytonastate.edu"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "email": "tanika.clemons@daytonastate.edu"
    },
    {
      "url": "https://www.arizonaoasis.com/contact",
      "email": "reservations@arizonaoasis.com"
    },
    {
      "url": "https://www.arizonaoasis.com/about-us",
      "email": "reservations@arizonaoasis.com"
    }
  ],
  "mails": [
    "amy.locklear@daytonastate.edu",
    "aquino@daytonastate.edu",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "campgrounds@goodsam.com",
    "cdungca@diamondheadtheatre.com",
    "cerese.ramos@daytonastate.edu",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "jmartin@diamondheadtheatre.com",
    "jodi.long@daytonastate.edu",
    "kmatsuno@diamondheadtheatre.com",
    "kristen.hanson@daytonastate.edu",
    "martin.cass@daytonastate.edu",
    "office@daytonarvpark.com",
    "oxbow@shaw.ca",
    "productions@diamondheadtheatre.com",
    "reservations@arizonaoasis.com",
    "reservations@idahodunesrv.com",
    "romualdo.marquinez@daytonastate.edu",
    "rtandal@diamondheadtheatre.com",
    "tanika.clemons@daytonastate.edu",
    "thomas.lobasso@daytonastate.edu",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "daytonarvoasis.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.goodsam.com/campgrounds-rv-parks/florida/daytona-beach/daytona-rv-oasis-910000051",
      "text": "Daytona RV Oasis - Daytona Beach, Florida campgrounds | Good Sam Campgrounds & RV Parks Membership & Rewards Rewards Program Benefits How Points Work Membership Overview Join Now Good Sam Credit Card Apply Today Community Groups Everything RV Campgrounds & Rentals Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Book Now RV Rentals Rent an RV List an RV Protection Products Emergency Products Roadside Assistance Find an RV Plan Find an Auto Plan Why Us? Join Now TravelAssist Find a Plan Plan benefits Compare Join Now Water Rescue Join Now Financial Protection Products Extended Service Plan Coverage Benefits Claims Insurance RV/Auto/Boat Insurance Homeowners/Renters Insurance Motorcycle Insurance Life & Health Insurance Pet Insurance Tire & Maintenance Products Tire & Wheel Protection Join Now Tire Sales Loans Loans RV loans Boat loans Unsecured loans Loan Calculator Apply for a loan RV Valuator Mobile RV Service 800-205-2057 Sign In Sign In | Create Account Sign In | Create Account 800-205-2057 Membership & Rewards Rewards Membership Credit Card Community Campgrounds & Rentals Campgrounds RV Rentals Protection Products Emergency Products Roadside Assistance TravelAssist Water Rescue Financial Protection Products Insurance Extended Service Plan Tire & Maintenance Products Tire & Wheel Protection Tire Sales Loans RV Valuator Mobile RV Service Back to main menu Rewards Rewards benefits All benefits Travel Lifestyle Health hub How Points Work Join Renew Back to main menu Membership Elite Standard Basic Overnight Stays Events FAQ Join Renew Back to main menu Credit Card Credit Card Access your account Back to main menu Campgrounds Search Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Book Now Back to main menu RV Rentals List an RV Rent Now Back to main menu Roadside Assistance Find an RV Plan Standard Platinum Platinum Complete Platinum + Compare our RV plans Find an Auto Plan Platinum Platinum + Auto Platinum Complete Auto Compare our Auto plans Why us? FAQ Corporate benefits Partnerships Resources Join Back to main menu TravelAssist Find a Plan Plan Benefits Compare Testimonials FAQ Resources Join Back to main menu Insurance RV/Auto/Boat Insurance Homeowners/Renters Insurance Motorcycle Insurance Life & Health Insurance Pet Insurance Back to main menu Extended Service Plan Coverage Benefits Claims FAQ Resources Stories Get a free quote Retrieve existing quote Back to main menu RV Valuator Find out what your RV is really worth RV Valuator Tool Back to main menu Loans RV Loans Boat Loans Unsecured Loans Loan Calculator Apply for a loan Back to main menu Financial Services Pay your loan Back to main menu Wildsam Wildsam Magazine Stories About Us Shop Field Guides Back to main menu RV.com RV Gear & Accessories Servicing & Care Lifestyle & Travel Back to main menu Community Groups Everything RV Search Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Search Search Campgrounds & RV Parks Search Photos About Site Info Amenities Recreation Deals Reviews Location From $64 / night 4 4 out of 5 stars from 1 review 1 review Daytona RV Oasis Good Sam Verified Campground 3003 W International Speedway Blvd, Daytona Beach, FL 32124 Good Sam Verified Campground (1 review) 4 out of 5 stars from 1 review Good Sam Rating Good Sam Rating Facility 7.5 Restrooms 8 Appeal 8.5 (1 review) 4 out of 5 stars from 1 review View 1 Photos View 1 Photos About Address 3003 W International Speedway Blvd Daytona Beach, FL,  32124 Coordinates: 29.165070, -81.087180 Open all year Contact 386-257-6137 Cards Accepted Things to know Facility Type: RV Park Emergency Phone Control access gate Dump station Laundry Eco-friendly park Learn more Rec Open to the Public Waiting Room Emergency Parking Pit Toilets RV Parking Eco-friendly park Learn more Policies Pets welcome Some restrictions No pets RV age restrictions Day Max Stay () No tents Tents Allowed Folding Tent Campers Allowed Hours: Site Info Road condition: Good Road type: Paved Big rig sites Onsite RV service Table at site Trash pickup at site Tenting Sites Cooking counter Privacy barrier Overflow area Covered area with picnic table Total spaces: 118 Spaces available: 98 Seasonal Sites: 20 Site length: 60 Max length: 60 Paved sites: All-Weather sites: Gravel sites: 98 Pull-thru size: 30 x 60 Pull-thrus: 14 Back-in size: 30 x 60 Room for slideouts: Yes Shaded sites: Some Number of full hookups: 98 Number of water: Number of sewer: Number of electric: Amps: 30 Amp/50 Amp Max Amps: 50 Seasonal sites Available from Amenities Wifi More Info Restroom and Showers Ice Laundry Near NASCAR® Track: 10 mi to Daytona International Speedway Laundry Near NASCAR® Track: 10 mi to Daytona International Speedway Table at site RV supplies LP gas: metered Patios RV supplies LP gas: metered Patios Recreation Outdoor games Enclosed game room Pavilion Horseshoes Horseshoes Recreation nearby (within 10 miles) (within 10 miles) Fishing Kayaking / canoeing Boating Marina Watersports Marina Watersports Hunting nearby (within 20 miles) (within 20 miles) Discounts Military Discount From $64 / night Open all year 386-257-6137 Customer Reviews 4 (1 review) 4 out of 5 stars from 1 review Facility 4 Restroom 0 Appeal 3 What is being rated? Write a review Sort by Most recent Most recent Most helpful Highest rating Lowest rating Gary Ro 10 reviews · 10 review votes Member 4 4 out of 5 stars 12/01/2015 Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they... Read More Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they are participating in the Daytona 500. Next time we will request a site as far from the road as possible. Read Less Helpful 18 Own this park? Reply to this review Write a review Sort by Most recent Most recent Most helpful Highest rating Lowest rating Gary Ro 10 reviews · 10 review votes Member 4 4 out of 5 stars 12/01/2015 Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they... Read More Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they are participating in the Daytona 500. Next time we will request a site as far from the road as possible. Read Less Helpful 18 Own this park? Reply to this review Location 3003 W International Speedway Blvd, Daytona Beach, FL 32124 Coordinates: 29.165070, -81.087180 Directions S-bnd: From jct I-95 exit 261B & US-92W: Go 500 feet W on US-92W, then 150 feet S on CR-415 (Tomoka Farms Rd) (R); or N-bnd: From jct I-95 exit 261 & US-92 W: Go 150 feet W on US-92 W, then 150 feet S on CR-415 (Tomoka Farms Rd) (R) Get directions From $64 / night Previous Next How to read Good Sam Ratings The three-number rating that accompanies each campground listing in the directory gives readers an at-a-glance assessment of a campground's amenities, cleanliness and environment. All three ratings categories are measured on a scale of 1 to 10, with 10 being the best. Less than 1 percent of parks or campgrounds receive the coveted 10 | 10 | 10 rating, which indicates superior facilities that are well maintained, clean, well-appointed restrooms and a highly appealing appearance. Campgrounds are inspected annually by dedicated RVers like you. Completeness of facilities 10 10 10 The first campground rating evaluates completeness and quality of facilities. In this category we rate interior roads, sites, registration area, hookups, recreation, swimming, security, laundry, store and building maintenance. Cleanliness of restrooms and showers 10 10 10 The second rating category concerns the cleanliness and physical characteristics of toilets, walls, showers, sinks/counters/mirrors and floor. If a park achieves a full point in each of the above, it receives a star ( ), indicating exceptionally clean restrooms. Also rated are physical characteristics of restrooms, including interior construction, adequate supplies/odor free, adequate number of facilities, exterior appearance and location in relation to park spaces, and interior appearance. Visual appeal and environmental quality 10 10 10 This category addresses the park's setting and site layout, function and identification of signage, overall exterior building maintenance, noise, trash disposal, litter and debris around the grounds and sites, and appearance of grounds, sites and entrance area. What is being rated? Facility The first campground rating evaluates completeness and quality of facilities. In this category we rate interior roads, sites, registration area, hookups, recreation, swimming, security, laundry, store and building maintenance. Restrooms The second rating category concerns the cleanliness and physical characteristics of toilets, walls, showers, sinks/counters/mirrors and floor. Also rated are physical characteristics of restrooms, including interior construction, adequate supplies/odor free, adequate number of facilities, exterior appearance and location in relation to park spaces, and interior appearance. Appeal This category addresses the park's setting and site layout, function and identification of signage, overall exterior building maintenance, noise, trash disposal, litter and debris around the grounds and sites, and appearance of grounds, sites and entrance area. Reserve Now Non-member From $70 / night Open all year 137 Sites Save 10% at this location Adults Ages 18+ Adults Children Ages 0-17 Children Pets Some restrictions Pets Pet restrictions on quantity, pet restrictions on breed, call for more details (123) 456-7890. Campsite Type* Type Type Type Type Equipment Type* Type Type Type Type RV Length (ft)* Length Length Length Length Has driver side slide(s)? Has passenger side slide(s)? Show Sites What makes this park eco friendly? Good Sam recognizes Parks that are implementing \"green\" practices. If a park complies with 3 or more items from the following list, a special green designation will show in their listing. Non-toxic cleaning products Natural pest control (most of the time) Minimized the use of styrofoam and significantly reduce the use of plastic Landscape managers use appropriate irrigation systems and drought tolerant and indigenous plants Recycling cans for the RVers Changed light bulbs to compact fluorescent lights (CFLs) Insulated water heaters Lowered pool temperatures Installed photocells (solar) Use more fuel efficient vehicles Instead of golf carts, implemented a strategy of encouraging the use of bikes and trikes Tankless water heaters Composting What makes this park family friendly? Good Sam Camping gives special recognition to RV Parks that provide family-friendly amenities, activities and services. No age restrictions Accepts all types of family oriented RVs, including tents, tent campers, camper vans and Class B motorhomes, as well as small trailer On-site activities for children (such as board games, arcades, ring toss, badminton, recreation for adults and children like - hiking, canoeing, bicycling, fishing, boating, horseback riding. Water activities/amenities such as swim pool, lake swimming, splash-ground Is close to Things to See & Do for families such as amusement & theme parks, zoos & animal parks, national monuments, local tours Offers full restrooms and bathhouses with at least 3 toilets and showers for men and women Family focused events on-site such as weekend events geared towards family throughout the season, themed events designed for families like Halloween or Christmas in July Dedicated staff to events Pet restrictions Pet Restrictions Pet Restriction on Quantity Pet Restriction on Breed Call for more information 386-257-6137 WiFi details WiFi at Overnite Sites WiFi at Park WiFi at Park Supports Mobile Devices 50 Sites with WiFi Amenities Bathroom Restroom and Showers Internet and office WiFi at Overnite Sites WiFi at Park WiFi at Park Supports Mobile Devices 50 Sites with WiFi Dining Comp breakfast (daily) Cocktail lounge Restaurant Food Groceries Snack bar BBQ at site Table at site Entertainment DVD rentals Tour/show tickets Cable Pets Pets Pet Restriction on Quantity, Pet Restriction on Breed\n                            call for more details 386-257-6137 Pet Services Dog park Enclosed dog run Pet grooming Dog washing station Pet supplies Pet boarding RV Related On-site RV service Tire repair Auto towing Motorhome mechanical repair Mobile RV service RV appliance repair RV body repair RV towing Emergency road service Engine/chassis repair RV supplies RV sales RV storage: secure RV wash: self-service RV wash: staffed Other ATM Worship services Fire rings Firewood Fishing guides Fishing supplies Fishing licenses Sells fishing gear Golf carts Health services Guest services Ice Laundry Library/book exchange LP gas LP gas: metered LP gas: by weight LP gas: bottle exchange LP gas: bottles only Near NASCAR® Track: 10 mi to Daytona International Speedway Newspaper Patios Personal escort to site Shuttle services Sells outdoor gear Archery services Cycling services Gunsmithing services Sells firearms Recreation Recreational facilities Archery range Badminton Basketball Volleyball Tennis Billiard room Frisbee golf Pickleball Lawn bowling Shuffleboard Outdoor games Golf Driving range Mini golf Putting green Bounce pillow Childrens activities Playground Enclosed game room Enclosed recreation hall Nature trails Exercise room Pavilion Horseback riding Horseshoes Planned activities Casino Hiking trails Bike rentals Pedal cart Water related recreation Swimming Swimming Pool Heated pool Hot tub Wading pool Water slide Splash pad Water umbrella Boating Gulf Ocean River Stream No Motorized Water Vehicles Allowed Lake Fishing Kayaking/canoeing Paddle boats Watersports Boat marina Boat rentals Boat ramp Dock Body of water: Facility log in The login information provided is incorrect. Please try again. Facility ID cannot be left blank Access code cannot be left blank Sign in Customer reviews 4 (1 review) 4 out of 5 stars from 1 review Facility 4 4 out of 5 stars from 1 review Restroom 0 0 out of 5 stars from 1 review Appeal 3 3 out of 5 stars from 1 review Sort by Most recent Most recent Most helpful Highest rating Lowest rating Write a review Gary Ro 10 reviews · 10 review votes 4 4 out of 5 stars 12/01/2015 Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they... Read More Overall this is a very nice campground. The interior roads, hookups,store are very good. The overall exterior building maintenance, trash disposal ,cleanliness, appearance of grounds are also very good. The employees are excellent due to their helpfulness and efficiency. The only down side is the traffic noise which is louder than any campground I have stayed in. However we were next to the road and we were here on an event weekend (event at Daytona raceway) where apparently attendees think they are participating in the Daytona 500. Next time we will request a site as far from the road as possible. Read Less Helpful 18 Own this park? Reply to this review Sign Up By checking this box and clicking Sign Up, I opt-in to receive promotional email communications about products or services or offers that may be of interest to me from the Camping World and Good Sam family of brands . I understand I can withdraw my consent at any time. For questions, please see our Privacy Policy & California Privacy Rights Camping World, Good Sam Insurance Agency, Camping World RV Sales, Good Sam Life Insurance\n        Central, Coast Resorts, Good Sam Life & Health, Good Sam TravelAssist, Good Sam Roadside\n        Assistance, Good Sam Extended Service Plan, Events, Tours and Rallies, Finance Center,\n        MotorHome, Rv.net, Trailer Life, Good Sam Rewards Visa 800-205-2057 [email protected] What We Offer Search Campgrounds & RV Parks Trip Planner Snowbirds Top-Rated Campgrounds Support Contact Us Affiliate Program Become a Good Sam Campground Campground Solutions Cancel Auto-Renewal Learn FAQ About us Resources Community Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services What We Offer Search Campgrounds & RV Parks Trip Planner Snowbirds Top-Rated Campgrounds Support Contact Us Affiliate Program Become a Good Sam Campground Campground Solutions Cancel Auto-Renewal Learn FAQ About us Resources Community Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services Privacy Policy | California Privacy Rights | Do Not Sell or Share My Personal Information | Targeted Advertising Opt Out | Investor Relations | Terms | Accessibility Commitment | Code of Conduct Privacy Policy | California Privacy Rights Do Not Sell or Share My Personal Information Targeted Advertising Opt Out | Investor Relations Terms | Accessibility Commitment | Code of Conduct © 2025 Good Sam Enterprises, LLC. GOOD SAM and the GOOD SAM ICON are registered trademarks of Good Sam Enterprises, LLC. Unauthorized use of any of GSE, LLC's trademarks is expressly prohibited. All rights reserved. Press the escape key to close the popup. 50% off 50% off Roadside Assistance Plans New members only. Offer expires September 30, 2025. Save now Press the escape key to close the popup. Win the ultimate summer road trip. Enter the Good to Go Sweepstakes win a 5 night RV Rental and Good Sam Campground credit. Plus, a year of Membership, Roadside Assistance, and TravelAssist - on us! Enter sweepstakes"
    },
    {
      "url": "https://www.oxbowrvresort.com/contact/",
      "text": "Get in Touch with Us | Contact Oxbow RV Resort in Penticton BC 250-770-8147 oxbow@shaw.ca Discover the Beauty of the South Okanagan Home Rates Nearby Activities Contact / Reservations Select Page Contact Us Or Reserve Oxbow RV Resort, Penticton, BC Please Note: This form is a reservation request only . Please complete the reservation form completely so that we may speed up the contact process. When we receive your form we will check availability and confirm your booking in an email (with instructions on how to submit your deposit within 7 days). Thank you! Our rates are based on 2 adults and 2 children per site (there is maximum of 3 adults allowed per site). Have a question? Checking our availability? We would love to hear from you. Please fill out our form below, or give us a call between 9 am and 8 pm daily at (250) 770-8147 . No RV? Book Our Rental Trailer * THE ASTERISK INDICATES A REQUIRED FIELD. THANK YOU! Please check the form has been successfully completed – if you don’t see a success message, scroll up to see the red boxes and what fields still need to be filled out! Thank you! * THE ASTERISK INDICATES A REQUIRED FIELD. THANK YOU! *RESERVATION POLICY* Times booked must be paid in full upon arrival or chance cancellation. We reserve the right to move any booking. Deposit required to hold site (with a 45day cancellation policy). Booking information must not change without written approval from us. Please: 1 RV or 1 tent 10’x10′ max per site. Oxbow RV Resort 198 Skaha Place, Penticton, BC V2A 7L1 Phone : 250-770-8147 Email : oxbow@shaw.ca Office Hours June 20th to September 8th: 9:00 a.m. to 8:00 p.m. September 8th to October 10th: 10:00 a.m. to 6:00 p.m. October 10th to March 1st: Closed View our listing in the iNFOTEL MULTIMEDIA business directory. Website built by"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "text": "Contact Us - Idaho Dunes RV Skip to content Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Reservations Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Get in touch with us Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Contact Information Idaho Dunes RV 1695 E 500 Rd N St Anthony, ID 83445 Tel: 208-624-3275 Email: reservations@idahodunesrv.com Learn More! Google Maps Frequently asked Questions CampGround Rules Meet our Team Have a question or comment? Please fill out the form below and a knowledgeable Idaho Dunes RV representative will reply to you shortly. Your Name (required) Your Email (required) Your Phone (optional) I am interested in learning more about (optional): Idaho Dunes RV General Campsite Info On Site Amenities Campground Rules Cancellation Policies BLM OHV Rules and Regulations Sand Dune Insight and Tips Seasonal Weather Info Local Attractions On Site Helicopter Tours UTV Trail Tours Nearby River Floats White Water Rafting Day Trips to Yellowstone National Park Day Trips to Jackson WY Lakeside Lodge and Resort Other Your Message (optional) Frequently asked Questions How do I get to Idaho Dunes RV Park? Directions from the South (Idaho Falls) Take SR20 heading East toward Rigby/Yellowstone (approx. 29 miles) Take exit 337 (North Rexburg exit) Turn left on N. Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. Directions from the North (Yellowstone) Take SR20 heading West toward Rexburg Take Exit 337 (North Rexburg exit) Turn right at N Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. How many campsites are there and how are they configured? We have 24 “Standard Full Hook-Up” sites (Water, 50-amp power and sewer, sites 1-24) Pull through. 20-22’ wide X 70’ long. Sites include a concrete patio. Sites 2/3, 4/5, 6/7, 8/9, 10/11, 14/15, 16/17, 18/19, 20/21, 22/23 are configured to share a patio with the neighboring site. We have 32 “Standard Partial Hook-Up” sites (Water and 50-amp power, sites 25-56) Pull through. 25-35’ wide X 70’ long. These sites are configured traditionally at a 45-degree angle all facing the same direction. We have 3 “Premium Partial Hook-Up” sites (Water and 50-amp power, sites 57-59) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 10 “Premium Full Hook-Up” sites (Water, 50-amp power and sewer, sites 60-69) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 25 acres of dry camping (no hook-ups ) Dry camping is always a first come first serve basis. How far is it to St. Anthony Sand Dunes Recreation Area? STATE CITY DISTANCE TIME ID Idaho Falls 40 0.5 ID Pocatello 90 1.2 UT Salt Lake City 250 3.5 MT Helena 275 3.9 MT Billings 300 4.2 ID Boise 325 4.6 WY Casper 350 5.0 WA Spokane 500 7.1 UT St. George 550 7.8 CO Denver 600 8.5 SD Rapid City 600 8.5 NV Las Vegas 675 9.6 ND Bismark 725 10.3 OR Portland 750 10.7 WA Seattle 800 11.4 CA San Francisco 875 12.5 CA Riverside 900 12.8 AZ Phoenix 900 12.8 CA Los Angeles 940 13.5 CA San Diego 1000 14.2 How big are the dunes compared to Glamis? The St. Anthony Sand Dunes cover over 10,000 acres with massive contiguous sand dunes. Osborne Overlook to China Wall in Glamis is approximately 13 miles, in direct comparison Idaho Dunes RV Park to the end of the biggest dunes near “Devils Dune” is approximately 12 miles. The infamous Choke Cherry Hill is steeper than China Wall and a significantly more difficult climb. How close is the campground to the dunes? Immediate access from your campsite to the dunes. Ride your ATV directly from the camp. IDRV is the nearest private campground to the big dunes. What amenities can be found at Idaho Dunes RV Park? Fully Stocked General Store Showers Toilets 69 Hook Up Spots 25 Acre Dry Camping Kids Playground Direct Dune Access Picnic Area On Site Seasonal RV Storage What else can I do while visiting Idaho? Yellowstone National Park Jackson Hole, WY Grand Teton National Park Yellowstone Bear World Fly Fishing Mountain Biking Photography Wildlife Viewing River Rafting Is it possible to make reservations for tent and dry camping on-line? Dry camping sites are always on a first come first serve basis. No reservations are required to camp in this area. Can we reserve a specific dry camping area? Dry camping is on a first come first serve basis and no reservations for a specific area can be provided. We're coming in with a large group and want to be together, can we reserve a group area ahead of time? At this time, we have not assigned specific group areas for camping. Groups for dry camping will on a first come first serve basis only. Is there a dump station at the park and is there a fee to dump? Use of our dump station is reserved for partial hook-up guests only. Our septic system has limited capacity and will not handle high volume dry camping dump volumes. We do not allow non-patrons use of our dump station. What is your reservation policy? Deposit policy: Reservations must be paid in full at time of booking without exception. Cancellation policy: There are no refunds under any circumstance. There are no adjustments for late arrivals or early departures. We will accommodate a one-time rescheduling of your reservation if notified at least 7 days prior to your reservation arrival date. Check-In Upon Arrival: Please check in at the Idaho Dunes RV Store immediately upon arrival. All registered guests will be issued a registration permit and receipt to affix to the window of your vehicle. Permits must be affixed in front windshield in clear view. Late Arrivals: Late arrivals must check in at the Idaho Dunes RV Store before 10:00 AM. Failure to self-register will result in a 20% registration surcharge. How late can I get to Idaho Dunes RV Park on my day of arrival? In consideration of our other campers please arrive prior to 10pm. If this is not possible please call ahead and provide advanced notice of late arrival. What time is check-out? Check out time is 11:00 AM What if I want to spend more time at the park the day we check-out? You are more than welcome to enjoy the dunes the day of check-out. Please see the manager at least one day prior to your check out date for arrangements. Are there shower facilities? The park has four (4) private showers/restrooms available 24 hours a day. There is a nominal fee for taking showers. Showers take quarters only. Showers are for Idaho Dunes RV Park guests only. Can I rent camping trailers on-site? We always recommend https://tetonar.com/rv-rentals/ for trailer rentals. Does the park allow pets? Pets are welcome. Please keep pets on a leash no longer than 10ft. Please clean-up after your pet. Is there a play area for the kids? Idaho Dunes RV has the largest three-story playground in the area for children under 10. All children must be supervised by an adult. Seating for adults is available in the immediate area to watch the kids play. Do you still have the kids track? Idaho Dunes RV does not have a designated area for youth riders on the property at this time. Please take the kids to the dune area to ride ATV’s. How can I stay up to date with what is going on at Idaho Dunes RV Park? Please visit www.idahodunesrv.com for general campground info. For the most up to the minute information on events and activities please visit our Facebook Fan Page at www.facebook.com/idahodunesrv Do you sell food on-site? Idaho Dunes RV Park may have outside food vendors on-site during special events and some holiday periods. Dates and availability will vary. Please contact us at 208-624-3275 for more information. Can we have camp fires in the park? Camp fires are allowed in the steel barrels provided. For your safety please do not dig below ground fire pits anywhere on the property. Smudge Pots are strictly prohibited and must not be used anywhere on the property. If we plan to dry camp will it be possible to fill up with water when we arrive? Water is available to all guests staying at the RV Park. Do you sell fuel on-site? VP Racing 110 Octane Fuel is sold on-site. 5-gallon pails and 54-gallon drums are typically in stock in limited quantities. Pre-ordering of VP 110 fuel is available with 20 days advance notice at https://idahodunesrv.com/vp-racing-fuel-pre-order/ Are there any Hotels/Motels nearby? Hotel accommodations can be found in both Rexburg, ID and St. Anthony, ID. Both cities are about 10 minutes away. Are picnic tables available at each camp site? Idaho Dunes RV Park does not offer picnic tables at each site. We recommend that guests bring their own tables and chairs as required. Can I place a tent on a full or partial hook-up camp site? A tent may occupy a full or partial hook-up camp site but must pay the specific rate for the type of site being occupied. Additional tents may be added for the nightly rate for tent camping. Tents must not extend beyond the physical site, infringe on the adjoining camp sites, or hinder interior roads. A maximum of 2 additional tents per hook-up site will be allowed. Does the campground offer FREE High Speed Internet YES. Idaho Dunes RV has a FREE Wi-Fi Hot Spot located near the general store with excellent connection speeds and coverage. We have installed a dedicated data line to support guests need for internet connectivity while at the campground. Our Wi-Fi is not accessible to the entire 50 acre campground but full-hook up sites are within close enough proximity to get excellent connectivity. Can I run a generator in camp? Generators can be run from 7:00 AM to Midnight in our dry camping area only. All generators must be turned off by 12:00 AM. Should you have needs that require power 24 hours per day please book an appropriate hook-up camping site. CAMPGROUND RULES Welcome to Idaho Dunes RV! Please make your party aware of the following rules and policies: Any violation of these rules may be cause for your immediate removal from the facility without a refund. No riding in camp except to access the dunes. Speed limit in camp is 5 MPH. No Music after 10:00 PM (Absolutely No Noise After Midnight Including Generators) No fireworks or smudge pots on property. All pets must be on a leash and cleaned up after. Dripping or draining of grey or black water will result in a $100 fine. Please check in at office prior to setting up camp. If arriving after hours please check in promptly at 9:00 AM the following day. Maximum of 10 people allowed per site. Limit of 1 “Extra Vehicle” allowed per site. Only 1 “Camping Unit” allowed per site. Extra vehicles staying overnight in sites will be allowed at an additional cost of $10.00 per night. All vehicles and equipment must fit within the site and not overflow onto roadways or into neighboring camps. All vehicles entering the Idaho Dunes RV gate must be registered and properly displaying registration tags. This includes RV’s, cars, and trucks. Lost, missing or stolen registration documentation will not be reissued. Individual named on the site is responsible for all parties. Do not move or alter orange safety cones in any way. Campfires are allowed in above ground burn barrels only. Absolutely no digging or below ground firepits on property. Please make children aware that power, water and communication lines are running below ground. The Idaho Dunes RV dump station is primarily reserved for partial hook-up site guests. If our septic system does have capacity, dry camping guests may pay a $10.00 dump fee to utilize the dump. Please check in with office before dumping. Dumpsters are provided for household garbage only. Any child 16 and under must be directly supervised by an adult at all times. Playground area is for children 10 and under. Children must be supervised by an adult at all times. No parking of vehicles on concrete patios in full hook-up sites. Check-In is after 1:00 PM, Check-Out is before 11:00 AM. Do not trespass on neighboring farms or properties. Please drive carefully. You are personally responsible for any damage to Idaho Dunes RV or other guests property. Idaho Dunes RV reserves the right to refuse service to anyone. Please be aware that you are on private property. We simply ask that you treat our facility as if we were all camping at your home. Ride safe and have a blast at Idaho Dunes RV! Meet the Team Mike McGroarty Owner Mike McGroarty has been an off-road, aviation, and outdoor enthusiast his entire life.  At the age of 15, Mike earned the rank of Eagle Scout in the Boy Scouts of America and by that time had over 300 nights of wilderness camping experience.  His love for the outdoors turned into a passion for off-roading as soon as his first job earned him enough income to purchase his first sport ATV.  This first ATV started an addiction for rock crawling, trail riding and sand duning that still occupies 100% of Mike’s interest to this day. Garrett McGroarty Manager Garrett McGroarty was born into the “Idaho Dunes Way of Life”.  At 3 years old, Garrett started his off-road passion on a Kawasaki KFX 50.  Garrett has logged more trail miles between Idaho Dunes RV and West Yellowstone than anyone in the area.  At a young age, Garrett developed a passion for helicopters and aviation.  Before graduating from high school, Garrett earned both his private helicopter license (PPL-H) and commercial helicopter license (CPL-H).  With advanced pilot training from the best instructors in the industry at Helisafe in Southern California, Garrett has mastered the Robinson R44 Raven II helicopters flight systems and emergency procedures.  If you have questions about the campground, dunes, local area, trail rides, or helicopter tours Garrett is your best bet to get the answers you are looking for. Colter Canon Chief Security Officer Colter Canon is Idaho Dunes RV’s Chief Security Officer. By day Colter serves Fremont County Idaho as a Sherriff’s Deputy as well as South Fremont Highschool as the School Resource Officer (SRO). Colter and his team go out of their way to ensure Idaho Dunes RV’s guests experience a safe but enjoyable atmosphere. “We understand everyone in camp is on vacation and wants to have a great time and let their hair down. We also understand that some people visiting the campground like to sleep. Its our job to make sure everyone can have the experience they are looking for within reason…” Colter Canon Google Contact Instagram Facebook Camping at St Anthony Dunes Phone: 208-624-3275 Email: reservations@idahodunesrv.com Location: 1695 E 500 Rd N, St Anthony, ID 83445 Copyright 2025 © Idaho Dunes Site Built by Moranton Media || Terms and Conditions || Privacy Policy || Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Location Email Us 208-624-3275 Login Username or email address * Required Password * Required Remember me Log in Lost your password? This site uses cookies to offer you a better browsing experience. By browsing this website, you agree to our use of cookies. More info Accept"
    },
    {
      "url": "https://daytonarvpark.com/",
      "text": "Home - Daytona RV Park Skip to content Call Us Today! (386) 304-8680 | office@daytonarvpark.com Facebook Home Gallery Rates Local Attractions Reservations Park Map Directions Home Gallery Rates Local Attractions Reservations Park Map Directions Home Gallery Rates Local Attractions Reservations Park Map Directions Loading... DAYTONA RV PARK Florida's best RV Park! Home valorbound 2025-06-10T16:24:36+00:00 Daytona RV Park of South Daytona Florida OUR RV PARK IS FOR GUESTS 21+ OR OLDER ONLY Give us a like and follow on our Instagram and Facebook Page!! Daytona RV Park of South Daytona Florida Daytona RV Park is situated on 12 acres, close to many local attractions. Within 10 minutes, you will find restaurants, fishing piers, and beautiful white sand beaches, and Bike week and Speed Week events in DAYTONA BEACH. See All Local Attractions! RACEWEEK AND BIKEWEEK 2025/2026 RATE IS  $149/NIGHT! PLEASE USE OUR RESERVATION LINK FOR ALL RESERVATIONS. THANK YOU! RATES RESERVATIONS DIRECTIONS DAYTONA BEACH TURKEY RUN BIKE WEEK RACE WEEK Dailland Real Estate Visit Dailland Real Estate DAILY RATES STARTING AT $49.50 + TAX PLEASE NOTE: NO POOL  IN THE PARK! NO REFUNDS . Daytona RV Park is a  RV resort located in South Daytona, Florida just minutes from the beach. We can accommodate any size RV, Bus, or Class A Coach, including trailer, in our RV Resort! This RV Resort is located within 10 minutes of many local attractions, including: – “World’s Most Famous Beach,” Daytona Beach – Daytona International Speedway, home to NASCAR Speed Week events like the Daytona 500, Coke Zero 400, and Rolex 24 hour endurance race, as well as many Bike Week and Biketoberfest events – Daytona RV Park is pet friendly! – Main Street, Daytona Beach, a popular hub for Biker events – Ponce Inlet Lighthouse and Museum – Fine dining at popular restaurants – Fishing piers along the Halifax River and in the ocean – Shopping at Tanger Outlet Mall, Volusia Mall, and the Port Orange Pavilion – And much more! Park Amenities – VERY LARGE SITES: Most are 30′ x 70′ – Great location central to local area attractions – Laundry on-site – WI-FI is complimentary. It is not meant for streaming or downloading. Daytona RV Park can not be held responsible for connectivity issues and refunds will not be issued. Any guest staying 1 month or longer will need to provide registration for RV and vehicle upon arrival hundreds of newly www.babwigs.org . exceptional and thus wonderful build can be the sign of rolex cartier copy . stringent specifications will be the features regarding luxury kinomania.to . https://www.parissaintgermainfc.ru/ online at acceptable prices. high quality replicauhren.to always keep developing enhance. https://www.vapesstores.fr/ meilleure cigarette électronique for men and women. Pet Policy Daytona RV Park accepts small pets no greater than 15lbs. Any pet larger than 15lbs must be inspected    and provide liability insurance upon check-in. Additionally, ALL pets MUST provide rabies certification upon check-in. NO EXCEPTIONS! At the sole discretion of the management dogs are required to have liability insurance and list the park owner as a co-insured party. PLEASE NOTE: WE RESTRICT CERTAIN BREEDS FROM VISITING THE PARK. PLEASE INQUIRE WHEN YOU BOOK YOUR SITE. RESTRICTED BREEDS INCLUDE, BUT ARE NOT LIMITED TO: – Pit Bulls – Dobermans (full size) – Rottweilers & German Shepard – Any other large, typically dangerous breeds We reserve the right to use our discretion in allowing or refusing service to any and all pet owners in the park. Any guest with a dog must show proof of rabies upon arrival. Daytona RV Park Check out our RV park today! Get A Reservation Only takes a few seconds! Contact Us 2430 South Nova Rd South Daytona Fl, 32119 Phone: (386)-304-8680 Fax: (386)-310-7995 Email: office@daytonarvpark.com Web: daytonarvpark.com Find Us Daytona RV Park © Copyright 2025 | All Rights Reserved | Website Design Daytona Beach Facebook Page load link Go to Top"
    },
    {
      "url": "https://www.goodsam.com/campgrounds-rv-parks/florida/daytona-beach",
      "text": "RV Parks in Daytona Beach, Florida | Daytona Beach, Florida Campgrounds Membership & Rewards Rewards Program Benefits How Points Work Membership Overview Join Now Good Sam Credit Card Apply Today Community Groups Everything RV Campgrounds & Rentals Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Book Now RV Rentals Rent an RV List an RV Protection Products Emergency Products Roadside Assistance Find an RV Plan Find an Auto Plan Why Us? Join Now TravelAssist Find a Plan Plan benefits Compare Join Now Water Rescue Join Now Financial Protection Products Extended Service Plan Coverage Benefits Claims Insurance RV/Auto/Boat Insurance Homeowners/Renters Insurance Motorcycle Insurance Life & Health Insurance Pet Insurance Tire & Maintenance Products Tire & Wheel Protection Join Now Tire Sales Loans Loans RV loans Boat loans Unsecured loans Loan Calculator Apply for a loan RV Valuator Mobile RV Service 800-205-2057 Sign In Sign In | Create Account Sign In | Create Account 800-205-2057 Membership & Rewards Rewards Membership Credit Card Community Campgrounds & Rentals Campgrounds RV Rentals Protection Products Emergency Products Roadside Assistance TravelAssist Water Rescue Financial Protection Products Insurance Extended Service Plan Tire & Maintenance Products Tire & Wheel Protection Tire Sales Loans RV Valuator Mobile RV Service Back to main menu Rewards Rewards benefits All benefits Travel Lifestyle Health hub How Points Work Join Renew Back to main menu Membership Elite Standard Basic Overnight Stays Events FAQ Join Renew Back to main menu Credit Card Credit Card Access your account Back to main menu Campgrounds Search Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Book Now Back to main menu RV Rentals List an RV Rent Now Back to main menu Roadside Assistance Find an RV Plan Standard Platinum Platinum Complete Platinum + Compare our RV plans Find an Auto Plan Platinum Platinum + Auto Platinum Complete Auto Compare our Auto plans Why us? FAQ Corporate benefits Partnerships Resources Join Back to main menu TravelAssist Find a Plan Plan Benefits Compare Testimonials FAQ Resources Join Back to main menu Insurance RV/Auto/Boat Insurance Homeowners/Renters Insurance Motorcycle Insurance Life & Health Insurance Pet Insurance Back to main menu Extended Service Plan Coverage Benefits Claims FAQ Resources Stories Get a free quote Retrieve existing quote Back to main menu RV Valuator Find out what your RV is really worth RV Valuator Tool Back to main menu Loans RV Loans Boat Loans Unsecured Loans Loan Calculator Apply for a loan Back to main menu Financial Services Pay your loan Back to main menu Wildsam Wildsam Magazine Stories About Us Shop Field Guides Back to main menu RV.com RV Gear & Accessories Servicing & Care Lifestyle & Travel Back to main menu Community Groups Everything RV Search Campgrounds & RV Parks Snowbirds Top-Rated Campgrounds Search Search Campgrounds & RV Parks Search 56 results found within  50  mi of                                                             Daytona Beach, Florida Show filters Search Search Sort by Featured Featured Facility rating Restroom rating Appearance rating Distance 56 results found within  50  mi of                                                                     Daytona Beach, Florida Map view List view Map view Sponsored Beverly Beach Camptown RV Resort Flagler Beach, FL (13 reviews) Digital Ad 1500FT OF ATLANTIC OCEAN BEACHFRONT Listen to the waves, swim in the ocean, walk on the beach just steps from your RV. We have clean air-conditioned bathhouses, laundry, a complete convenience store and Cabin Rentals. Near Daytona & St Augustine. Pet friendly. Listen to the waves, swim in the ocean, walk on the beach just steps from your RV. We have clean air-conditioned bathhouses, laundry, a complete convenience store and Cabin Rentals.... Good Sam Rating Facility 9 Restrooms 9.5 Appeal 8.5 From $75 / night From $75 / night Book now View Website View details Coral Sands Oceanfront RV Resort Ormond Beach, FL (4 reviews) Digital Ad ATLANTIC OCEAN FRONT RV RESORT! 900ft of tranquil beautiful beach! Near Daytona Beach, St Augustine, St John's River. Oceanfront heated pool, remodeled air conditioned bath houses. Perfect for families, groups, or special occasions. Free WiFi. Onsite hotel. 900ft of tranquil beautiful beach! Near Daytona Beach, St Augustine, St John's River. Oceanfront heated pool, remodeled air conditioned bath houses. Perfect for families, groups, or... Good Sam Rating Facility 8.5 Restrooms 10 Appeal 8 From $88 / night From $88 / night Book now View Website View details Encore Southern Palms Eustis, FL (0 reviews) Digital Ad ACTIVITIES GALORE AT SOUTHERN PALMS There's something new & exciting here every day! From a friendly game of bocce ball to dancing the evening away, book now to join your friends at this RV resort that's full of fun in Central Florida's Lake County. There's something new & exciting here every day! From a friendly game of bocce ball to dancing the evening away, book now to join your friends at this RV resort that's full of fun... Good Sam Rating Facility 7.5 Restrooms 8.5 Appeal 7 From $58 / night From $58 / night Book now View Website View details Nova Family Campground Port Orange, FL (6 reviews) Digital Ad THREE MILES TO DAYTONA BEACH SHORES For one flat rate, from June through August, stay up to three nights per week with unlimited access to our refreshing pool where you can cool off and relax on every visit. Call now & grab your pass to make the most of summer. For one flat rate, from June through August, stay up to three nights per week with unlimited access to our refreshing pool where you can cool off and relax on every visit. Call now... Good Sam Rating Facility 8 Restrooms 8 Appeal 8.5 From $39 / night From $39 / night Book now View Website View details Encore Rose Bay Port Orange, FL (6 reviews) Digital Ad TROPICAL CAMPING PARADISE Conveniently located to Daytona's fabulous white, sandy beaches and fantastic ocean fishing. Whether you're looking to explore the nearby area, take in the local attractions or relax poolside, there is something for everyone. Conveniently located to Daytona's fabulous white, sandy beaches and fantastic ocean fishing. Whether you're looking to explore the nearby area, take in the local attractions or relax... Good Sam Rating Facility 8.5 Restrooms 8.5 Appeal 8 From $67 / night From $67 / night Book now View Website View details Members save more Good Sam Members SAVE 10% at over 2,000 Good Sam RV Parks and Campgrounds nationwide. Not a member? Join Now 1 2 3 4 › Back to top How to read Good Sam Directory Ratings The three-number rating that accompanies each campground listing in the directory gives readers an at-a-glance assessment of a campground's amenities, cleanliness and environment. All three ratings categories are measured on a scale of 1 to 10, with 10 being the best. Less than 1 percent of parks or campgrounds receive the coveted 10 | 10 ★ | 10 rating, which indicates superior facilities that are well maintained, clean, well-appointed restrooms and a highly appealing appearance. Campgrounds are inspected annually by dedicated RVers like you. Completeness of facilities 10 | 10 ★ | 10 The first campground rating evaluates completeness and quality of facilities. In this category we rate interior roads, sites, registration area, hookups, recreation, swimming, security, laundry, store and building maintenance. Cleanliness of restrooms and showers 10 | 10 ★ | 10 The second rating category concerns the cleanliness and physical characteristics of toilets, walls, showers, sinks/counters/mirrors and floor. If a park achieves a full point in each of the above, it receives a star ( ★ ), indicating exceptionally clean restrooms. Also rated are physical characteristics of restrooms, including interior construction, adequate supplies/odor free, adequate number of facilities, exterior appearance and location in relation to park spaces, and interior appearance. Visual appeal and environmental quality 10 | 10 ★ | 10 This category addresses the park's setting and site layout, function and identification of signage, overall exterior building maintenance, noise, trash disposal, litter and debris around the grounds and sites, and appearance of grounds, sites and entrance area. Hide filters Sort by Featured Featured Facility rating Restroom rating Appearance rating Distance Range 0 mi 50 Online Reservation Type Book Online Request reservation Park Features Full Hook-ups Big rigs Internet access Pets welcome Swimming Open all year Onsite rentals (cabins, etc.) Seasonal sites Types Good Sam Parks only Camping RV parks Public parks Tent camping Lodging Outdoor activities Food & drink Attractions Scenic overlooks RV parts / accessories RV service / repair RV sales RV storage Regions Canada United States Good Sam Rating Facility Rating 10 only 9 or greater 8 or greater 7 or greater Any Restroom Rating 10 only 9 or greater 8 or greater 7 or greater Only - Very clean Any Appearance Rating 10 only 9 or greater 8 or greater 7 or greater Any User Ratings 5 stars only 4 stars or greater 3 stars or greater Any Apply filters How to read Good Sam Ratings The three-number rating that accompanies each campground listing in the directory gives readers an at-a-glance assessment of a campground's amenities, cleanliness and environment. All three ratings categories are measured on a scale of 1 to 10, with 10 being the best. Less than 1 percent of parks or campgrounds receive the coveted 10 | 10 | 10 rating, which indicates superior facilities that are well maintained, clean, well-appointed restrooms and a highly appealing appearance. Campgrounds are inspected annually by dedicated RVers like you. Completeness of facilities 10 10 10 The first campground rating evaluates completeness and quality of facilities. In this category we rate interior roads, sites, registration area, hookups, recreation, swimming, security, laundry, store and building maintenance. Cleanliness of restrooms and showers 10 10 10 The second rating category concerns the cleanliness and physical characteristics of toilets, walls, showers, sinks/counters/mirrors and floor. If a park achieves a full point in each of the above, it receives a star ( ), indicating exceptionally clean restrooms. Also rated are physical characteristics of restrooms, including interior construction, adequate supplies/odor free, adequate number of facilities, exterior appearance and location in relation to park spaces, and interior appearance. Visual appeal and environmental quality 10 10 10 This category addresses the park's setting and site layout, function and identification of signage, overall exterior building maintenance, noise, trash disposal, litter and debris around the grounds and sites, and appearance of grounds, sites and entrance area. Sign Up By checking this box and clicking Sign Up, I opt-in to receive promotional email communications about products or services or offers that may be of interest to me from the Camping World and Good Sam family of brands . I understand I can withdraw my consent at any time. For questions, please see our Privacy Policy & California Privacy Rights Camping World, Good Sam Insurance Agency, Camping World RV Sales, Good Sam Life Insurance\n        Central, Coast Resorts, Good Sam Life & Health, Good Sam TravelAssist, Good Sam Roadside\n        Assistance, Good Sam Extended Service Plan, Events, Tours and Rallies, Finance Center,\n        MotorHome, Rv.net, Trailer Life, Good Sam Rewards Visa 800-205-2057 [email protected] What We Offer Search Campgrounds & RV Parks Trip Planner Snowbirds Top-Rated Campgrounds Support Contact Us Affiliate Program Become a Good Sam Campground Campground Solutions Cancel Auto-Renewal Learn FAQ About us Resources Community Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services What We Offer Search Campgrounds & RV Parks Trip Planner Snowbirds Top-Rated Campgrounds Support Contact Us Affiliate Program Become a Good Sam Campground Campground Solutions Cancel Auto-Renewal Learn FAQ About us Resources Community Our Partners Camping World Overton's RV Sales RV Gear RV Maintenance & Repair Membership & Services Privacy Policy | California Privacy Rights | Do Not Sell or Share My Personal Information | Targeted Advertising Opt Out | Investor Relations | Terms | Accessibility Commitment | Code of Conduct Privacy Policy | California Privacy Rights Do Not Sell or Share My Personal Information Targeted Advertising Opt Out | Investor Relations Terms | Accessibility Commitment | Code of Conduct © 2025 Good Sam Enterprises, LLC. GOOD SAM and the GOOD SAM ICON are registered trademarks of Good Sam Enterprises, LLC. Unauthorized use of any of GSE, LLC's trademarks is expressly prohibited. All rights reserved. Press the escape key to close the popup. 50% off 50% off Roadside Assistance Plans New members only. Offer expires September 30, 2025. Save now Press the escape key to close the popup. Win the ultimate summer road trip. Enter the Good to Go Sweepstakes win a 5 night RV Rental and Good Sam Campground credit. Plus, a year of Membership, Roadside Assistance, and TravelAssist - on us! Enter sweepstakes"
    },
    {
      "url": "https://www.daytonastate.edu/who-we-are/our-leadership/executive-staff.html",
      "text": "Executive Staff Skip to content Skip to footer Home Daytona State College Who We Are Our Leadership Executive Staff Executive Staff Our Leadership Board of Trustees Executive Staff Executive Staff Dr. Thomas LoBasso President Thomas.LoBasso@DaytonaState.edu Dr. Amy Locklear Executive Vice President and Provost Amy.Locklear@DaytonaState.edu Roberto Lombardo Senior Vice President Information Technology and Center for Interactive Media Roberto.Lombardo@DaytonaState.edu Rodnie Marquinez General Counsel Romualdo.Marquinez@DaytonaState.edu Martin Cass Vice President, Finance Chief Business Officer Martin.Cass@DaytonaState.edu Dr. Jodi Long Vice President, Academic Affairs Jodi.Long@DaytonaState.edu Dr. Erik A. D’Aquino Vice President Enrollment Management Erik.D'Aquino@DaytonaState.edu Cerese Ramos Vice President Student Development Cerese.Ramos@DaytonaState.edu Tanika Clemons Associate Vice President of Human Resources, Employment Title IX Coordinator Tanika.Clemons@daytonastate.edu Kristen Hanson Executive Director, DSC Foundation Kristen.Hanson@daytonastate.edu Daytona State College 1200 W. International Speedway Blvd. Daytona Beach, FL 32114 (386) 506-3000 facebook twitter instagram youtube linkedin Accessibility Career Opportunities Civil Rights Compliance Privacy Policy Course Search College Catalog Give Now Public Records Request Contact Us/Campuses Employee Directory Sitemap Visit Us Automatic Last Updated Direct Edit Link © 2025 Daytona State College JavaScript is required to view this site. Please enable JavaScript to continue browsing. Last Updated 8/12/25"
    },
    {
      "url": "https://www.arizonaoasis.com/contact",
      "text": "Contact Us | Arizona Oasis RV Resort — Arizona Oasis RV Resort | Colorado River RV Park Blythe, CA Ways To Stay Things To Do Homes For Sale Book Online (928) 923-8230 Back RV Rates & Info Rental Homes & Cabins Resort Map Referral Program Back Activities Pool & Spa ATV & OHV Trails Boating & Fishing Resort Photos ATV & Boat Storage Back River Vacation Homes River Home Lifestyle River Home Discovery Stay Ways To Stay RV Rates & Info Rental Homes & Cabins Resort Map Referral Program Things To Do Activities Pool & Spa ATV & OHV Trails Boating & Fishing Resort Photos ATV & Boat Storage Homes For Sale River Vacation Homes River Home Lifestyle River Home Discovery Stay Book Online (928) 923-8230 Contact us Get In Touch Have questions? We can help! Reach out to us. Our contact info: 50238 Ehrenberg Parker Hwy. Ehrenberg, AZ 85334 (928) 923-8230 reservations@arizonaoasis.com ﻿ ARE YOU A SOCIAL MEDIA INFLUENCER OR BLOGGER? We want to work with you! Send us a message using the contact form below with your social media pages and website. We’re always looking for people to partner with. Do you have a question about receiving mail while you’re stay at Arizona Oasis? Start here! Connect With Us On Social Media Find us on Facebook and Instagram! Use #arizonaoasis Facebook Instagram Arizona Oasis on the map Get in touch 50238 Ehrenberg Rd. Ehrenberg, AZ 85334 (928) 923-8230 reservations@arizonaoasis.com Resort Map Contact Us Book Now ATV & Boat Storage Apply for Residency Privacy Policy Info Arizona Oasis Ways to Stay About Us RV Reservations Vacation Rentals Homes For Sale Blog Job Openings Try our other resorts Sky Resorts Communities"
    },
    {
      "url": "https://www.arizonaoasis.com/about-us",
      "text": "About Us | Arizona Oasis RV Resort — Arizona Oasis RV Resort | Colorado River RV Park Blythe, CA Ways To Stay Things To Do Homes For Sale Book Online (928) 923-8230 Back RV Rates & Info Rental Homes & Cabins Resort Map Referral Program Back Activities Pool & Spa ATV & OHV Trails Boating & Fishing Resort Photos ATV & Boat Storage Back River Vacation Homes River Home Lifestyle River Home Discovery Stay Ways To Stay RV Rates & Info Rental Homes & Cabins Resort Map Referral Program Things To Do Activities Pool & Spa ATV & OHV Trails Boating & Fishing Resort Photos ATV & Boat Storage Homes For Sale River Vacation Homes River Home Lifestyle River Home Discovery Stay Book Online (928) 923-8230 About us What We’re All About Arizona Oasis exists as a spot to getaway and play. A place to encourage your sense of adventure and see what’s over the next desert hill. A spot to float down the Colorado River or sit on the beach and destress from daily life — all with the people you love the most. We’re here to help you escape for a few days and make memories with people close to you. If you like family friendly atmospheres and playing outdoors, we think you’ll like it here. How We Got Started In The RV Business Arizona Oasis has been owned and operated by the Manthei family since 2014. The family got their start in creating RV communities in 1970 when Mary Manthei gave her son, Tim, the chance to do something with a piece of land in the desert near Palm Springs, California. Tim started digging in the desert and soon recruited a partner, as well as several brothers and cousins, to build an RV and manufactured home community called Sky Valley Resort . In the early 1990s, the family built another RV resort in Southern California called Caliente Springs . Both Sky Valley and Caliente are located on land with sulphur-free natural mineral hot springs. In 2014, the family decided to expand their goal of creating communities that improve lives with the purchase of Arizona Oasis. Today, the three resorts — Sky Valley, Caliente Springs and Arizona Oasis — are operated by Tim’s children and nephews. Get in touch 50238 Ehrenberg Rd. Ehrenberg, AZ 85334 (928) 923-8230 reservations@arizonaoasis.com Resort Map Contact Us Book Now ATV & Boat Storage Apply for Residency Privacy Policy Info Arizona Oasis Ways to Stay About Us RV Reservations Vacation Rentals Homes For Sale Blog Job Openings Try our other resorts Sky Resorts Communities"
    }
  ]
}