{
  "fuentes": [
    {
      "url": "https://deerfieldpatiobar.com/about-us",
      "email": "events@wyndhamdeerfield.com"
    },
    {
      "url": "https://deerfieldpatiobar.com/brunch-menu",
      "email": "events@wyndhamdeerfield.com"
    },
    {
      "url": "https://cedardooraustin.com/",
      "email": "heather@brazosmgtgroup.com"
    },
    {
      "url": "https://www.bankstreetpatio.com/contact-us/",
      "email": "events@bankstreetpatio.com"
    },
    {
      "url": "https://www.bankstreetpatio.com/contact-us/",
      "email": "gm@bankstreetpatio.com"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "adminasst@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "assistanthealthagent@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "bgilmore@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "healthagent@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "nurse@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "thilchey@town.deerfield.ma.us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "email": "tmcdaniel@town.deerfield.ma.us"
    },
    {
      "url": "https://deerfieldpatiobar.com/gallery",
      "email": "events@wyndhamdeerfield.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://deerfieldpatiobar.com/",
      "email": "events@wyndhamdeerfield.com"
    },
    {
      "url": "https://legendsaksarben.com/",
      "email": "info@legendspatiogrill.com"
    },
    {
      "url": "https://deerfieldpatiobar.com/breakfast-menu",
      "email": "events@wyndhamdeerfield.com"
    }
  ],
  "mails": [
    "adminasst@town.deerfield.ma.us",
    "assistanthealthagent@town.deerfield.ma.us",
    "bgilmore@town.deerfield.ma.us",
    "events@bankstreetpatio.com",
    "events@wyndhamdeerfield.com",
    "gm@bankstreetpatio.com",
    "healthagent@town.deerfield.ma.us",
    "heather@brazosmgtgroup.com",
    "hero-contact@2x.jpg",
    "info@legendspatiogrill.com",
    "info@rivervillegrill.com",
    "nurse@town.deerfield.ma.us",
    "thilchey@town.deerfield.ma.us",
    "tmcdaniel@town.deerfield.ma.us"
  ],
  "nombre_sitio": "deerfieldpatiobar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://deerfieldpatiobar.com/about-us",
      "text": "About Us | Patio Bar & Grill Menu Breakfast Menu Brunch Menu All Day Menu Specials ​ Gallery Location 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Menu Breakfast Menu Brunch Menu All Day Menu Specials Gallery Location ​ Oceanfront Deerfield Beach Dining at its Best! WELCOME TO THE PATIO BAR AND GRILL! Pull up a chair just feet from the white sand beach, grab a refreshing drink and relax — those are the primary orders of business at the Patio Bar and Grill, a casual Deerfield Beach dining venue located onsite at Wyndham Deerfield Beach Resort. Whether you are gearing up for a busy day of beach adventures and South Florida sightseeing with a hearty lunch, or grabbing an afternoon snack or drink, our oceanfront grill is the best place in town for casual Deerfield Beach Dining. Come evening, if you’re looking for a romantic, yet casual Deerfield Beach or Boca Raton dining experience, settle in for a delicious evening meal, with plentiful small plates, appetizers, mouth-watering entrees and delicious desserts. Our “beach casual” bar is the ideal place to relax with great company, enjoy a stellar view of Deerfield Beach and a cool ocean breeze. Grab one of our signature martinis, creative coffee drinks or hand-crafted cocktails and take in the stunning white sand scenery just footsteps away. With nightly live music, week day happy hour, and unbeatable late happy hour specials Sunday through Thursday, the party never ends at the Patio Bar and Grill – join us today! Seating is available by walk-in only. The Patio Bar and Grill accepts payment via cash, American Express, MasterCard, Visa and Discover. Patio Bar & Grill 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Our Hours Open Daily: 7am to 11pm *Kitchen closes 10pm Brunch Sat & Sun: 11am to 2pm Happy Hour Monday-Friday: 3pm to 6pm Check Us Out Visit our affiliate restaurants on the Wyndham Resort Property for lunch, dinner and sweet treats. Private Events Plan your rehearsal dinner, wedding reception, beach ceremony and corporate events with us. For more information, please contact our Catering Sales Manager: events@wyndhamdeerfield.com Tel: 754-227-4304 © 2025 The Patio Bar & Grill. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://deerfieldpatiobar.com/brunch-menu",
      "text": "Brunch Menu | Patio Bar & Grill Menu Breakfast Menu Brunch Menu All Day Menu Specials ​ Gallery Location 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Menu Breakfast Menu Brunch Menu All Day Menu Specials Gallery Location Brunch Menu Brunch – Saturday & Sunday – 11AM to 2PM Create Your Own Omelette Three egg omelette, with your choice of three items: bacon, sausage, ham, bell peppers, mushrooms, tomato, onion, mozzarella, or feta Egg Whites, $2 / Add Crab Meat, $10 $15.95 The \"Not So American\" Three eggs any style, with your choice of (1) smoked bacon, Canadian bacon or sausage. Served with breakfast potatoesand a choice of toast or mini pancakes. Egg Whites, $2 / Pancetta, $2 / Add Crab Meat, $10 $15.95 Skirt Steak Open Sandwich Skirt steak, roasted peppers, mushrooms & walnuts in a cream demi-glace topped with feta cheese crumbled on a toasted ciabbata bread. Arugula salad. $23.95 Shrimp & Grits Four shrimp served over southern grits topped with a poached egg $19.95 Brunch Burrito Eggs, chorizo, refried beans, Monterey Jack cheese & cilantro in a wrap. Served with breakfast potatoes. $15.95 Avocado Toast Multi grain toast, avocado purée, pico de gallo, cucumber, tomato and pickled onions. Served with sweet potato fries. $13.95 *Classic Eggs Benedict Two poached eggs on an English muffin, Canadian bacon, hollandaise sauce & breakfast potatoes ​Add Smoked Salmon, $3 $16.95 Morning Happy Hour Mimosas, $8.50 Endless Mimosas, $18 Bloody Mary, $8.50 Endless Bloody Mary, $18 Deluxe Bloody Mary, $14 Served with 2 jumbo shrimp, celery, lemon, and olives 20% gratuity will be added to any party of 6 or more (*Consumer Advisory – Consuming raw or undercooked meat, eggs, poultry or seafood increases your risk of contracting a foodborne illness – especially if you have certain medical conditions. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach, or blood or have immune disorders, you are at greater risk of serious illness from raw oysters and should eat oysters fully cooked.) Brunch Menu (PDF) Patio Bar & Grill 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Our Hours Open Daily: 7am to 11pm *Kitchen closes 10pm Brunch Sat & Sun: 11am to 2pm Happy Hour Monday-Friday: 3pm to 6pm Check Us Out Visit our affiliate restaurants on the Wyndham Resort Property for lunch, dinner and sweet treats. Private Events Plan your rehearsal dinner, wedding reception, beach ceremony and corporate events with us. For more information, please contact our Catering Sales Manager: events@wyndhamdeerfield.com Tel: 754-227-4304 © 2025 The Patio Bar & Grill. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://cedardooraustin.com/",
      "text": "Cedar Door Patio Bar & Grill - Downtown Austin, Austin, TX × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × 🔥 GAME DAY WEEKENDS at Cedar Door 🔥 Join the waitlist now to get ahead of the game, literally! Join Waitlist Reservations - Book your table in advance today with Yelp! Reserve Table Reservations - Book your table in advance today with Yelp! Skip to Main Content Menu Drinks * To Go Private Events About Jobs Gift Cards Press Go to top Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Drinks * To Go Private Events About Jobs Gift Cards Press map marker pin 201 Brazos St. BLD A, Austin, TX 78701 Daily Specials Come on by The Door and check out our menu, made fresh daily from scratch. Join us for Happy Hour Monday-Thursday from 3 PM - 6 PM. Enjoy $5 drafts, $5 appetizers and more food options $7 cocktails, and a selection of spirits for $7. Check our specials Home of original Mexican Martini Our Drinks Hungry? Open Late Night! Order Now Patio • Downtown Large Screen TVs Weekly Specials Book your next Happy Hour with us! Reserve Now! a table Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing Our Menu The Cedar Door’s lively neighborhood ambiance is matched by a casual approach to dining, with a fun and flavorful menu including homemade classics with a southwest influence. Many come for the savory Brazos Burger that's ground in house with fresh fries or the Smoked Brisket Tacos. Pair your meal with an ice-cold local draft and you’ll have all your major food groups covered! View menu Order Online Pickup & Delivery In the mood for comfort food? We've got you covered! Order online now and treat yourself to your favorites, wherever you are. Order now Groups & Parties A UNIQUELY AUSTIN EXPERIENCE Planning a private event should be a seamless experience, and our mission is to design an event that feels special, personal, and fun, one that you and your guests remember. We offer turn-key event services, including a customizable food and beverage menu, and flexible venue spaces to accommodate both large and small groups. Fill out an event form today to start the party! Book a party Still pouring, 47 years strong! Interior, dining area Paloma cocktail Strawberry Limeade cocktail Bartender mixing a cocktail Chicken sandwich, with bacon, cheese guacamole, lettuce, and fries Interior, seating area Fried chicken, with gravy and collard greens Exterior, patio seating chicken fried chicken steak with mashed potatoes and collard greens Cedar Door Patio Bar & Grill Brazos Burger with Cheese and Fries Espresso Martini Chocolate Torte White Wings Steak with sides Strawberry Cheesecake Reviews Review by Google Juan R: Great spot. This place was perfect for a late evening meal and drinks. The Tajin fries are spectacular. The white wings and the dry rub wings were perfectly seasoned and so good, especially with the blue cheese. I also got to try the fish tacos. The tacos were also good and had a nice kick. Staff is friendly, dress is casual and prices are fair Review by Google Daniel S: This place is for sure one of the better places in Austin. We stumbled in while staying at the JW and absolutely loved it. Not only do they have a great selection of local Texas beers, but the food is absolutely delicious. My favorites are the burger and the fried chicken club but the vegan options are also fantastic. If you’re looking for a good pace to have some chill beers and good food make sure you stop by here! Review by Google Melissa P: House martini did not disappoint...delish!  Service was very good and the fries, the best!  This place is a definite do again! Review by Google Edward J: Brussel sprout tacos were savory and delicious. Fish tacos just as good. Cesar salad was adequate. Great beer selection. Good service. Stop reviews carousel Play reviews carousel We are hiring! We are looking for great people to join our amazing team! Check out our current job openings and apply with just a few clicks! Apply now for a job Newsletter Location 201 Brazos St. BLD A Austin, TX 78701 Hours Happy Hour Monday - Friday from 3 PM to 6 PM Sunday            Noon  to 1 AM Monday           3 PM to 1 AM Tuesday           3 PM to 1 AM Wednesday   3 PM to 1 AM Thursday         3 PM to 1 AM Friday                Noon to 2 AM Saturday          Noon to 2 AM NOW OPEN FOR LUNCH ON FRIDAY, SATURDAY & SUNDAY KITCHEN OPEN DAILY UNTIL 10 PM Find us on... Twitter page Facebook page Instagram page google page Contact us (833)-998-8721 heather@brazosmgtgroup.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Order Parties Jobs We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://www.bankstreetpatio.com/contact-us/",
      "text": "Contact Us - Bank Street Patio Bar & Grill - Downtown Ocala Skip to content Menu Photos Events Contact / Book Event Welcome to Bank Street Patio Bar, Downtown Ocala Click Here to Book a Party or Plan an Event Bank Street Patio Hours Monday - Closed Tuesday - 11AM-10PM Wednesday - 11AM-10PM Thursday - 11AM-10PM Friday - 11AM-1AM Saturday - 10AM-1AM Sunday - 10AM-8PM Click Here for Menus Looking to book a party or event? Want to find out if your band can perform at Bank Street? Simply want to sign up for our monthly newsletter? Click Here to Book a Party or Plan an Event Contact Bank Street Please enable JavaScript in your browser to complete this form. How can we help you? I just have a question or comment I would like to book a party My band is available to perform To check availability and to receive information on rates and menu planning please click here to book Your Event or Party Name * First Last Email * Phone * Band's Name * What Type of Music? * Official Band Website or Social Media Page * Questions or Comments: Join Our Newsletter? Yes, please send me special offers and event notifications! Name Submit General Inquiries: Address: 120 E Fort King Street, Ocala, Florida Phone: 352-877-8667 Email: gm@bankstreetpatio.com Menu: Click here for our Menu For Events Please Contact: Events Phone: 352-322-7182 Events Email: events@bankstreetpatio.com ( Click Here For Directions ) Get In Touch! +1 (352) 877-8667 120 E Fort King Street, Ocala, Florida gm@bankstreetpatio.com Visit Us! Directions & Map Bank Street Events Our Menu Photos Follow Us © 2017 Bank Street Patio Bar & Grill - Downtown Ocala. All Rights Reserved. Bank Street requests that all guests review and abide by our Code of Conduct (read here) . Website by Globalsites | Photos by John Jernigan"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    },
    {
      "url": "https://www.deerfieldma.us/231/Board-of-Health",
      "text": "Board of Health | Deerfield, MA Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Government Residents How Do I... Home Government Boards & Committees Board of Health Board of Health Massachusetts Health Data Tool Explore state and community data reports on health outcomes, population demographics, social determinants of health and more. State Health Officials Announce Additional Human Cases of West Nile Virus in Massachusetts Measles (Rubeola) -- What You Need to Know Duties and Responsibilities of the Board of Health: Local boards of health in Massachusetts are required by state statutes and regulations to perform many important and crucial duties relative to the protection of public health, the control of disease, the promotion of sanitary living conditions, and the protection of the environment from damage and pollution. These requirements reflect the legislature’s understanding that many critical health problems are best handled by the involvement of local community officials familiar with local conditions. Board of Health Members/Staff: Tim Hilchey Member thilchey@town.deerfield.ma.us Trevor McDaniel Member tmcdaniel@town.deerfield.ma.us Blake Gilmore Member bgilmore@town.deerfield.ma.us Ned Saviski Health Agent healthagent@town.deerfield.ma.us x 109 Cindy Majewski Town Nurse nurse@town.deerfield.ma.us x   8 Patricia Martin Administrative Assistant adminasst@town.deerfield.ma.us x 111 Our Health Agent: Please be informed that the Health Agent may be out of the office due to inspections or appointments. You are welcome to email the Health Agent at healthagent@town.deerfield.ma.us or leave a voicemail at 665-1400 ext. 109 for his response back. Hours of Operation: Monday - Thursday 9 am to 4 pm Friday Hours Vary - Please Call Ahead * Due to the nature of the work, the Health Agent may not be in the office at all times during hours of operation due to inspections. You are encouraged to call for an appointment if you wish to meet with him. Public Health Programs/Efforts: COVID-19 Resources: Find a COVID-19 Test Find a COVID Vaccine COVID-19 Wastewater Surveillance (WWTP S. Deerfield) COVID-19 Vaccination and Testing Data Air Quality Monitoring: Pioneer Valley Healthy Air Network Tobacco Preventative Action: Pioneer Valley Tobacco Collaborative Tobacco Regulations Sharps Disposal Collection Program: Sharps Disposal Collection Program Contact the Public Health Nurse or Administrative Assistant for scheduling drop-off/exchange. Emergency Preparedness: EDS Color Training Emergency Preparedness and Response Vector-borne communicable diseases: Lyme Disease Is Baffling, Even to Experts Mosquito-borne Diseases Mosquito-Prevention-Flyer Tick-borne Diseases Lyme-not-the-only-tick-borne-illness Japanese-Knotweed Contagious Disease Regulations (105 CMR 300.000) Vaccination Programs (MGL 111§ 181-183 ) Septic/ Title 5: Why Maintain Your Septic System | US EPA Do Your Part, Be SepticSmart: The Do's and Don'ts of Your Septic System (epa.gov) Wastewater & Septic (Title 5) (310 CMR 15.00) Private Wells Regulations Supplemental Title 5 Condominium Regulations Listings of Approved System Inspectors and Soil Evaluators Housing: Lead Paint (105 CMR 460.400) Housing Code Minimum Level of Fitness for Human Habitation (105 CMR 410.00) Swimming Pools: Swimming Pools (105 CMR 435.000) Recreational Camps for Children: Recreational Camps for Children (105 CMR 430.000) Food Safety: Food Safety | Mass.gov Food Allergen Amendments (105 CMR 590) Food Establishments (1999 Federal Food Code & 105 CMR 590.000) Federal Food Code 2013 Temporary Food Operation Guide Procedure for vomit diarrhea clean-up Food allergen poster Body Art: Deerfield-Body-Art-Establishment-Regulations-PDF Substance Use Resources: Harm Reduction for Substance Use (PDF) Other State and Federal Regulations: Beaver Trapping (Ch. 111§ 31 & 31) Burial Permits (M.G.L. 114 § 45) Minimum standards for developed family type campgrounds (105 CMR 440.000) Environmental Code Title 1 (310 CMR 11) Hazardous Materials (MGL 111 § 150B) Air Pollution Control (310 CMR 7.000) Industrial Wastewater Holding Tank Construction, Operation, and Record Keeping Requirements (314 CMR 18.00) Infectious Waste (310 CMR 16.06, 105 CMR 480.000) Noise (310 CMR 7.00) Nuisance (MGL 111§ 122 &123) Pesticide Application (333 CMR 13.00) Solid Waste (310 CMR 16.00) Trash Removal (MGL 111 § 31A & 31B) Tanning (105 CMR 123.000) Termination of Utilities (220 CMR 25.03) South Deerfield Larval Treatment Area Treatment began on Thursday May 2, 2024 Timing of subsequent treatment will be dependent upon weather conditions South Deerfield Proposed Larval Treatment Area.pdf Agendas & Minutes Agendas are available prior to the meetings. Minutes are available following approval. View Most Recent Agendas and Minutes Contact Us Board of Health Physical Address View Map 8 Conway Street Deerfield Municipal Offices South Deerfield , MA 01373 8 Conway Street Deerfield Municipal Offices South Deerfield MA 01373 Directions Phone: 413-665-1400, ext. 109 Fax: 413-665-1411 Directory Applications, Permits & Fees Mosquito Information Instructions for a Homemade Mosquito Trap Tick Testing for Tick-Borne Diseases Pay Online Apply for Building & Board of Health Permits Agendas & Minutes Town Bylaws GIS/Maps Report a Concern Employment Opportunities Contact Us Town of Deerfield 8 Conway Street South Deerfield, MA 01373 Phone: 413-665-1400 Hours of Operation: Monday - Friday 9:00 - 4:00 Quick Links Information for Employees Demographics History (PDF) Selectboard Assessor Forms & Documents Deerfield Alert Smart911 /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://deerfieldpatiobar.com/gallery",
      "text": "Gallery | Patio Bar & Grill Menu Breakfast Menu Brunch Menu All Day Menu Specials ​ Gallery Location 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Menu Breakfast Menu Brunch Menu All Day Menu Specials Gallery Location Gallery Patio Bar & Grill 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Our Hours Open Daily: 7am to 11pm *Kitchen closes 10pm Brunch Sat & Sun: 11am to 2pm Happy Hour Monday-Friday: 3pm to 6pm Check Us Out Visit our affiliate restaurants on the Wyndham Resort Property for lunch, dinner and sweet treats. Private Events Plan your rehearsal dinner, wedding reception, beach ceremony and corporate events with us. For more information, please contact our Catering Sales Manager: events@wyndhamdeerfield.com Tel: 754-227-4304 © 2025 The Patio Bar & Grill. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://deerfieldpatiobar.com/",
      "text": "Patio Bar & Grill Menu Breakfast Menu Brunch Menu All Day Menu Specials ​ Gallery Location 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Menu Breakfast Menu Brunch Menu All Day Menu Specials Gallery Location Pull up a chair just feet from the white sandy beach, grab a refreshing drink and relax — those are the primary orders of business at the Patio Bar and Grill, a casual Deerfield Beach dining venue located onsite at Wyndham Deerfield Beach Resort. More About Us Whether you are seeking breakfast or brunch with a view, a light lunch, delicious dinner, decadent dessert or a creative cocktail, the Patio Bar and Grill has just the dish or drink to wow your palate and keep you satisfied. View Menus The South Florida nightlife scene is known as one of the world’s best, and the nightly live entertainment at the Patio Bar and Grill provides a fun and lively scene for locals and tourists alike. We welcome the best musicians and entertainers from around the region nightly. View Calendar Patio Bar & Grill 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Our Hours Open Daily: 7am to 11pm *Kitchen closes 10pm Brunch Sat & Sun: 11am to 2pm Happy Hour Monday-Friday: 3pm to 6pm Check Us Out Visit our affiliate restaurants on the Wyndham Resort Property for lunch, dinner and sweet treats. Private Events Plan your rehearsal dinner, wedding reception, beach ceremony and corporate events with us. For more information, please contact our Catering Sales Manager: events@wyndhamdeerfield.com Tel: 754-227-4304 © 2025 The Patio Bar & Grill. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://legendsaksarben.com/",
      "text": "Legends Patio Grill & Bar – Aksarben – Creating Food, Fun, and Memories About Online Menu Catering Party Menu Buffet Menu Plan An Event Rewards Rewards Balance Contact ✕ SEE WHAT WE’VE GOT FOR YOU Drinks Menu Games THE BEER IS HERE! Our 20 taps are getting ready for you at Aksarben! Proud to offer some great local options from our friends at Brickway Brewery & Distillery, Nebraska Brewing Company, Kros Strain Brewing Company, Zipline Brewing Co., Lucky Bucket Brewing Company, Pint Nine Brewing Co., Infusion Brewing Company. Like Us... LEGENDS NOW IN AKSARBEN! The unique atmosphere, great crowd and friendly staff makes Legend's Patio Grill and Bar the best place in the Aksarben area to enjoy all the sports games on one of many Flat Screen HD TV's. See more... HAPPY HOUR FOOD SPECIALS Hungry after work? Legends Omaha will have you covered with tons of great happy hour food specials to choose from. From nachos, to our legendary wings, we have you covered for happy hour. Check out our Facebook page for more updates. See more... telephone (402) 315-2305 address 6920 Pacific Street • Suite 100 FACEBOOK TWITTER INSTAGRAM Our Email: info@legendspatiogrill.com OPENING HOURS: Monday - Saturday: 11AM–2AM • Sunday: 12PM–2AM © 2024 Legends Aksarben. All Rights Reserved. Site Designed by: Ryker Web Solutions"
    },
    {
      "url": "https://deerfieldpatiobar.com/breakfast-menu",
      "text": "Breakfast Menu | Patio Bar & Grill Menu Breakfast Menu Brunch Menu All Day Menu Specials ​ Gallery Location 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Menu Breakfast Menu Brunch Menu All Day Menu Specials Gallery Location Breakfast Menu 7AM to 11AM Daily Morning Happy Hour MIMOSA , $8.50 PEACH BELLINI , $8.50 BLOODY MARY , Zing Zang & Deep Eddy Vodka, $8.50 DELUXE BLOODY MARY with Shrimp, $14 Entrees Create Your Own Omelette Two egg omelette, with your choice of three items: bacon, sausage, ham, bell peppers, mushrooms, tomato, onion, mozzarella, or feta. Served with taost & breakfast potatoes. Egg Whites, $2 / Extra Egg, $1.50 $16.95 The \"Not So American\" Two eggs any style, with your choice of (1) smoked bacon, Canadian bacon or sausage. Served with breakfast potatoes and a choice of toast or mini pancakes. Egg Whites, $2 / Pancetta, $2 / Extra Egg, $1.50 $16.95 Huevos Rancheros Two eggs any style, spicy tomato salsa, corn tortillas, refried beans, chorizo, guacamole & breakfast potatoes Egg Whites, $2 / Extra Egg, $1.50 $16.95 *Classic Eggs Benedict Two poached eggs on an English muffin, Canadian bacon, hollandaise sauce & breakfast potatoes Smoked Salmon, $3 $17.95 *Smoked Salmon & Bagel Everything bagel, cream cheese, thin slices of tomatoes, Norwegian smoked salmon, onions & capers $17.95 French Toast Texas style thick challah bread, dipped in vanilla custard, cooked golden brown, topped with cinnamon & sugar. Served with syrup $14.95 Traditional Pancakes Three buttermilk pancakes, plain or with banana, blueberries or chocolate chips. Served with syrup. Your choice of sausage or bacon. $14.95 Belgian Waffles Jumbo waffle, strawberries, whipped cream and syrup $14.95 Granola & Fresh Fruit Fresh slices of seasonal fruits, plain or fruit flavored yogurt, honey nut granola $13.95 Signature Dishes Omelette Primavera Two egg omelette, asparagus, grilled zucchini, yellow squash, Provolone cheese, roasted tomatoes & breakfast potatoes. Your choice of toast & jelly. Egg Whites, $2 / Extra Egg, $1.50 $15.95 Omelette Alla Milanese Two egg omelette, prosciutto ham, Fontina cheese, caramelized onions, roasted red peppers & breakfast potatoes. Your choice of toast & jelly. Egg Whites, $2 / Extra Egg, $1.50 $17.95 Beverages Juice Grapefruit, Cranberry, Tomato or Apple $5.50 Coffee Regular or decaf, fresh Colombian coffee $4.50 Espresso (double $4.95) $3.95 Capuccino $5.50 Hot Herbal Tea Earl Grey, mint, lemon, chamomile, orange or regular $4.50 Whole Milk, Skim Milk, Almond Milk or Oat Milk $4.50 Hot Cocoa & Whipped Cream $4.50 The \"Green Monster\" (VEGAN) Freshly pressed celery, cucumber & carrot juice $8.95 Very Berry Smoothie (VEGAN) Almond milk, strawberries, blueberries & dates $8.95 Sunny Sides English Muffin $5.95 Toast & Jelly White, wheat, multigrain or rye $5.45 Bagel & Cream Cheese Plain, everything or onion $5.95 Strawberries or Banana $4.95 Blueberries $6.45 Fruit Cup $6.45 Fruit Bowl $8.95 Oatmeal Raisins and brown sugar. Add strawberries, banana or blueberry for $2.95 $6.95 Cereal & Milk Cheerios, Raisin Bran, Total, Frosted Flakes, Fruit Loops $4.95 Canadian Bacon (3) $5.95 Bacon (4) $5.95 Sausage (3) $5.95 Ham (2) $5.95 *Two Eggs Any Style $5.95 Short Stack Pancakes $7.95 Breakfast Potatoes $5.45 Muffin Blueberry, chocolate, banana nut, orange or gluten free $3.50 20% gratuity will be added to any party of 6 or more (*Consumer Advisory – Consuming raw or undercooked meat, eggs, poultry or seafood increases your risk of contracting a foodborne illness – especially if you have certain medical conditions. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach, or blood or have immune disorders, you are at greater risk of serious illness from raw oysters and should eat oysters fully cooked.) Breakfast Menu (PDF) Patio Bar & Grill 2096 Northeast 2nd St Deerfield Beach, FL 33441 (954) 596-8618 Our Hours Open Daily: 7am to 11pm *Kitchen closes 10pm Brunch Sat & Sun: 11am to 2pm Happy Hour Monday-Friday: 3pm to 6pm Check Us Out Visit our affiliate restaurants on the Wyndham Resort Property for lunch, dinner and sweet treats. Private Events Plan your rehearsal dinner, wedding reception, beach ceremony and corporate events with us. For more information, please contact our Catering Sales Manager: events@wyndhamdeerfield.com Tel: 754-227-4304 © 2025 The Patio Bar & Grill. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}