{
  "fuentes": [
    {
      "url": "https://www.deercreekgolfcourse.com/about-us/",
      "email": "golf@deercreekgolfcourse.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/davenport/deer-creek-rv-golf-country-club",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://deercreekrvgolf.com/contact/",
      "email": "golf@deercreekrvgolf.com"
    },
    {
      "url": "https://deercreekrvonline.com/",
      "email": "info@deercreekrvonline.com"
    },
    {
      "url": "https://deercreekrvgolf.com/about-us/",
      "email": "info@deercreekrvgolf.com"
    },
    {
      "url": "https://www.deercreekgolfcourse.com/",
      "email": "golf@deercreekgolfcourse.com"
    },
    {
      "url": "https://deercreekrvgolf.com/2022/",
      "email": "info@deercreekrvgolf.com"
    },
    {
      "url": "https://deercreekrvonline.com/admin/",
      "email": "dcmaintenance@artemislifestyles.com"
    },
    {
      "url": "https://deercreekrvonline.com/admin/",
      "email": "ryherren@aol.com"
    },
    {
      "url": "https://deercreekrvgolf.com/2022/04/29/",
      "email": "info@deercreekrvgolf.com"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLPolkDeerCreekRVGolfCountryClub.htm",
      "email": "info@9holegolfcourses.com"
    }
  ],
  "mails": [
    "customerservice@golflink.com",
    "dcmaintenance@artemislifestyles.com",
    "golf@deercreekgolfcourse.com",
    "golf@deercreekrvgolf.com",
    "info@9holegolfcourses.com",
    "info@deercreekrvgolf.com",
    "info@deercreekrvonline.com",
    "ryherren@aol.com"
  ],
  "nombre_sitio": "deercreekrvgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.deercreekgolfcourse.com/about-us/",
      "text": "About Us - Deer Creek Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book Tee Times Deer Creek Golf Club University Park, IL Home Tee Times About Us Contact Us Rates Scorecard Course Photos Leagues Memberships Deer Creek Golf Club University Park, IL Instruction Events Upcoming Events Banquets Text Club About Us The Golf Shop Purchase a gift certificate from Deer Creek for every golfer on your gift-giving list! Gift certificates are available in any dollar increment and can be applied to our golf instruction, rounds of golf, or merchandise. Deer Creek’s Pro Shop offers a full line of professional goods and services. Staff Our friendly staff will help you with all your golfing needs from booking tee-times to buying supplies, to joining one of our popular leagues. Amenities Deer Creek has cart paths throughout the course. We never close – think of us as your sure thing – if you want to play golf in any conditions. Directions Deer Creek is easy to get to. We are located just 25 miles from Chicago and equidistant between Interstates 57 and 394. Just go to our maps in the drop down menu and “Google” us. Page Footer Contact Info Address : 25055 S. Western Ave University Park, IL 60484 Email : golf@deercreekgolfcourse.com Phone : 1-708-672-6667 Copyright © 2025 Deer Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/davenport/deer-creek-rv-golf-country-club",
      "text": "Deer Creek RV Golf & Country Club, Inc., Davenport, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Davenport Public N/A No Reviews Yet Deer Creek RV Golf & Country Club, Inc. Designed by Ward Northrup and opened in 1987 Deer Creek - Davenport , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Nearby Courses Course Details Holes: 18 Par: 60 Length: 3871 yards Slope: 95 Rating: 55.8 Driving Ranges: Yes The 18-hole \"Deer Creek\" course at the Deer Creek RV Golf & Country Club, Inc. facility in Davenport , Florida features 3871 yards of golf from the longest tees for a par of 60. The course rating is 55.8 and it has a slope rating of 95. The estimated green fees for 18 holes is $50. Deer Creek RV Golf & Country Club, Inc. Golf Club has an onsite driving range with 1 practice tees. Designed by Ward Northrup, the Deer Creek golf course opened in  1987. Estimated Green Fees $50 These rates are an estimate of what you might expect to pay at Deer Creek with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Deer Creek HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT Middle 55.80/91 289 130 129 296 144 134 290 119 282 1813 153 114 360 136 167 135 116 319 157 1657 3470 Par 4 3 3 4 3 3 4 3 4 31 3 3 4 3 3 3 3 4 3 29 60 Swipe to See full table Deer Creek Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Deer Creek Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 What Golfers are Saying N/A Be the first to leave a review Write a review Add a Photo Drop Photo Here or Click to Upload Submit View More Courses in Davenport ChampionsGate Country Club, Country Club at Champions Course Public Year Opened: 2015 8950 Cliftons Draw Dr, Davenport, FL, 33896-2601 6 miles from the center of Davenport view course details book a tee time 18 Holes 72 Par 7,058 Yards Driving Range: Yes Highlands Reserve Golf Club, Highlands Reserve Course Public Year Opened: 1998 500 Highlands Reserve Blvd, Davenport, FL, 33897-7325 8 miles from the center of Davenport view course details book a tee time 18 Holes 72 Par 6,673 Yards Driving Range: Yes Omni ChampionsGate Golf Club, International Course Public Year Opened: 2016 8575 White Shark Blvd, Davenport, FL, 33896-8621 6 miles from the center of Davenport view course details book a tee time 18 Holes 72 Par 7,363 Yards Driving Range: Yes Omni ChampionsGate Golf Club, National Course Public Year Opened: 2017 8575 White Shark Blvd, Davenport, FL, 33896-8621 6 miles from the center of Davenport view course details book a tee time 18 Holes 70 Par 7,128 Yards Driving Range: Yes Polo Park Golf Course, Polo Park Course Public Year Opened: 1985 1744 Challenger Ave, Davenport, FL, 33897-6407 11 miles from the center of Davenport view course details 9 Holes 28 Par 1,246 Yards Driving Range: No Polo Park East Golf Club, Polo Park East Course Public Year Opened: 1994 525 Polo Park East Blvd, Davenport, FL, 33897-9416 11 miles from the center of Davenport view course details 9 Holes 29 Par 1,807 Yards Driving Range: No Providence Golf Club, Providence Course Public Year Opened: 2007 1518 Clubhouse Blvd, Davenport, FL, 33837-1724 2 miles from the center of Davenport view course details book a tee time 18 Holes 72 Par 6,950 Yards Driving Range: Yes White Heron Golf Club, White Heron Course Public Year Opened: 2022 200 Eagle Ridge Dr, Davenport, FL, 33837-4515 0 miles from the center of Davenport view course details book a tee time 18 Holes 72 Par 1,454 Yards Driving Range: Yes Nearby cities with courses Auburndale 1 Course Celebration 2 Courses Haines City 5 Courses Kissimmee 9 Courses Lake Alfred 1 Course Lake Buena Vista 6 Courses Lake Wales 1 Course Lakeland 1 Course Orlando 10 Courses Reunion 3 Courses Windermere 1 Course Winter Garden 3 Courses Winter Haven 9 Courses 42749 Highway 27, Davenport, FL 33837-6821 (863) 424-3153 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://deercreekrvgolf.com/contact/",
      "text": "Contact – Deer Creek Golf and Country Club Skip to content Deer Creek Golf and Country Club Deer Creek Golf Course and Pro Shop Info Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Search: Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Contact Deer Creek Golf and Country Club We are looking forward to hearing from you! Notice: JavaScript is required for this content. Our Address: 42749 Hwy 27 Davenport, FL 33837 Call Us: 863.424.3153 EMAIL golf@deercreekrvgolf.com © 2025 - 26 Deer Creek RV Golf and Country Club - Site Design: https://mbgt.com Go to Top One Click Call Button"
    },
    {
      "url": "https://deercreekrvonline.com/",
      "text": "Home • Deer Creek RV Park Online Resource Site Skip to content 863.424.2839 42749 US Hwy 27 Davenport, FL 33837 Facebook page opens in new window X page opens in new window Dribbble page opens in new window Deer Creek RV Park Online Resource Site Deer Creek RV Park Online Resource Site Home Activities Deer Tales and Daily Activities 2025 Activities Blog and Pictures Administration Board of Directors DC HOA Presidents DC Office Announcements Rules and Regulations Important Forms Golf Communities Eagles View Community Pages Osprey Point Community Pages Partridge Pines Community Pages Regal Pointe Community Pages Regal Ridge Community Pages Impressions T&S Impressions – Deer Creek T&S Impressions – Communities T&S Impressions – Activities T&S Impressions – Golf Home Activities Deer Tales and Daily Activities 2025 Activities Blog and Pictures Administration Board of Directors DC HOA Presidents DC Office Announcements Rules and Regulations Important Forms Golf Communities Eagles View Community Pages Osprey Point Community Pages Partridge Pines Community Pages Regal Pointe Community Pages Regal Ridge Community Pages Impressions T&S Impressions – Deer Creek T&S Impressions – Communities T&S Impressions – Activities T&S Impressions – Golf Deer Creek RV Golf and Country Club The Perfect Place to Call Home Built around an 18-hole Executive Golf Course, our gated communities have a full range of amenities. Our activity calendars are jam-packed with something for everyone. Try Deer Creek’s Executive Golf Course and visit our Pro Shop. Both are open to the public. The friendliness of the people in our communities offers a feeling of home. Many residents came for a season and loved our community so much that they have stayed for years! About Us See our Communities Each community has their own pool, 5 feature clubhouses. The perfect place for community dinners, potlucks, meetings, games, events and more… Learn More Deer Creek Administration Our Corporate Management, Corporate Board of Directors and Administration is dedicated to making our communities flourish and continuously improve the quality, value and diversity of our common areas. Learn More See our Activities Thanks to our amazing Activities Director we enjoy shows, live musicians, parties, Karaoke, talks, games, arts and crafts, tournaments and so much more… Learn More Our Golf Pro Shop Our Pro Shop is fully stocked for all your golfing needs. We carry major name brand merchandise including golf bags, balls, clubs, and apparel. Come and join us for a nice round of Golf on our Executive 18 hole golf course. Learn More Looking to Rent or Buy? If you are looking to rent, buy or lease a house, RV lot or a combination of both, please follow this link to Oats Realty Learn More Please update your Information! To facilitate the upcoming budget, phase election and Member at Large/Annual Meeting, we are requesting that ALL homeowners use this link to update/confirm their email address(s) and information sheet.  ALL new owners should complete this and any owner with any changes/updates should complete as well. Owner Information Form Link Location, Location, Location We are located adjacent to one of Florida’s premier road intersections, I-4 and US Hwy 27. It is less than 30 minutes to the Walt Disney World Theme parks, about 45 minutes to Orlando. Right next door is Posner Park and Posner Village featuring an amazing selection of stores, restaurants and even a Movie Theater. See our Community Map Get in Touch We are NOT a Campground or RV Park. Please DO NOT send requests for campsites using this form. Click here instead Contact ``Deer Creek RV Golf & Country Club, Inc.`` 42749 US Hwy 27 Davenport, FL 33837 (863) 424-2839 info@deercreekrvonline.com https://deercreekrvonline.com Please enable JavaScript in your browser to complete this form. Name * First Last Question, Comment or Message * Phone Number * Email * Message Submit (C) 2025 - 26  -- Deer Creek RV, Golf and Country Club --- Site Design: https://mbgt.com Go to Top Give us a Call"
    },
    {
      "url": "https://deercreekrvgolf.com/about-us/",
      "text": "About Deer Creek Golf and Country Club – Deer Creek Golf and Country Club Skip to content Deer Creek Golf and Country Club Deer Creek Golf Course and Pro Shop Info Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Search: Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact About Us The Pro Shop at Deer Creek Golf and Country Club Opening Hours: The Pro Shop is open Daily from: 7 am to 4.00 pm * (* Holiday Opening Hours will be announced as needed) Green Fees An overview of our current pricing schedule can be found here: Green Fees Pro Shop: Book Your Tee Time Online Book Tee Times Online Pro Shop Staff Pro Shop Staff Pro Shop Outside Staff Lynn Zemba Pro Shop Manager Mike Wasson Pro Shop Staff Sue Barlow Pro Shop Staff Coming Soon Pro Shop Staff Melanie Norrow Pro Shop Staff Don Wriedt Pro Shop Outside Staff Gary Smith Pro Shop Outside Staff Paula Bamberg Pro Shop Outside Staff Richard Vincent Pro Shop Outside Staff Coming Soon Pro Shop Outside Staff Deer Creek Golf Pro Shop Whether you are a seasoned pro or a newbie golfer, it’s always fun to look the part. Visit our pro shop for all the latest equipment, accessories, gifts and apparel. Time to Hit the driving range or putting green? Check out our Power Tee System or just hang with your fellow golfers, the Pro Shop is your place to swing by (pun intended!) We have Winn, Golf Pride and Lampkin name brand  grips for our custom re-gripping jobs, and we can order any grip available on the market. We have a wide selection of apparel, clubs, gloves, balls and more. We work with all the major vendors featuring names as: Titleist, Callaway, Greg Norman, Volvik … … Ping, Puma, Cobra and Wilson and more. In addition to stocked items, we can get (almost) any merchandise that anyone might want. Our Pro Shop has Coffee, Gatorade, Soft drinks,  water and beer available as well as an assortment of snacks. Golf Clubs available for Rent ($20)! Our Driving Range and Putting /Chipping Green is available for residents/public practice. We offer small/ medium/ large and extra large buckets of balls to hit from the Power Tee System or off the turf. Balls are available for pick up in the Pro shop. Contact Email: info@deercreekrvgolf.com Address: 42749 Hwy 27\r\nDavenport, FL 33837 Phone: 863.424.3153 Find us on: Facebook page opens in new window Website page opens in new window Our Mission It is our mission to provide a fun, yet challenging golf experience while at the same time fostering fellowship and camaraderie among our players. We strive daily to accomplish this mission by: Presenting and maintaining our golf course at a high standard while showcasing its natural characteristics. Treating our fellow members, employees and guests with respect and providing a satisfying game of golf to all players regardless of playing ability. Making our club enjoyable, accessible and affordable for our members, their families as well as guests. Use our Contact Form to get in touch We'd always love to hear from you. Here is a link to our Contact Form © 2025 - 26 Deer Creek RV Golf and Country Club - Site Design: https://mbgt.com Go to Top"
    },
    {
      "url": "https://www.deercreekgolfcourse.com/",
      "text": "Welcome to Deer Creek Golf Club! - Deer Creek Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book Tee Times Deer Creek Golf Club University Park, IL Home Tee Times About Us Contact Us Rates Scorecard Course Photos Leagues Memberships Deer Creek Golf Club University Park, IL Instruction Events Upcoming Events Banquets Text Club Chicago Southland’s Best Conditioned Golf Course Deer Creek Golf Club BOOK NOW Welcome to Deer Creek Golf Club! Chicago South Suburban foremost public golf facilities. Welcome to Chicago Southland’s Best Conditioned Golf Course. Deer Creek Golf Club is rated 3 1/2 Stars by Golf Digest Magazine and is continually voted as one of Chicago’s places to play. Deer Creek is a beautifully manicured Championship golf course with bent grass greens, 7 lakes and 55 sand bunkers. Throughout the course you will find aesthetically pleasing naturalized areas, which include a wide variety of wildflowers. Deer Creek is recognized as one of the Chicago South Suburban foremost public golf facilities, and is truly a “golfer’s paradise”. Our four tee setup, built in 2003, will challenge the expert player, yet offer the intermediate, senior, women and beginning golfer a very enjoyable and playable experience. In addition to our fine golf course, Deer Creek offers an excellent practice facility with full shot and short game practice areas. Deer Creek has hosted several major golf events such as the Illinois Open Qualifying, PGA Professional Qualifying, and the Illinois Oldsmobile (Buick) Scramble Sectional. Deer Creek is a great golf course to host your next golf outing. We have extremely affordable outing packages for groups of all sizes. Our restaurant and banquet facility are perfect for any special event. We specialize in weddings, showers, birthdays, meetings and awards banquets. Our staff will prepare a menu to fit any of your needs, Deer Creek can accommodate up to 200 people in our banquet room and up to 400 utilizing our popular outdoor pavilion. Deer Creek is an 18-hole golf course. Along with fabulous golf, the facility offers a great golf shop, advance golf reservations, expert instruction, driving ranges and short game. TEE TIMES MEMBERSHIP e-CLUB Banquets Upcoming Events There are no upcoming events. What Are You Waiting For? Book Now Page Footer Contact Info Address : 25055 S. Western Ave University Park, IL 60484 Email : golf@deercreekgolfcourse.com Phone : 1-708-672-6667 Copyright © 2025 Deer Creek Golf Club All Rights Reserved. Powered by Deer Creek Tour 2025 Close The last date for the DC Tour 9/5 will be at Palmira Golf Course Click here for the full schedule"
    },
    {
      "url": "https://deercreekrvgolf.com/2022/",
      "text": "2022 – Deer Creek Golf and Country Club Skip to content Deer Creek Golf and Country Club Deer Creek Golf Course and Pro Shop Info Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Search: Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Yearly Archives: 2022 You are here: Home 2022 Rebuilding more Greens News By Webmaster April 29, 2022 We will be rebuilding six more greens beginning in May, 2023. Temporary greens will be in play until… Details Search: Recent Posts 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Golf Course Closure and Limitations Events (so far) in 2025 2024 Labor Day Golf Tournament & Luncheon Events Category Backwards Golf Golf Tournament Night Golf August September 2025 October MO TU WE TH FR SA SU 1 2 3 4 5 6 7 Events for September 1st 9:00 AM - 6:00 PM Labor Day Golf Tournament Events for September 2nd No Events Events for September 3rd No Events Events for September 4th No Events Events for September 5th No Events Events for September 6th No Events Events for September 7th No Events 8 9 10 11 12 13 14 Events for September 8th No Events Events for September 9th No Events Events for September 10th No Events Events for September 11th No Events Events for September 12th No Events Events for September 13th No Events Events for September 14th No Events 15 16 17 18 19 20 21 Events for September 15th No Events Events for September 16th No Events Events for September 17th No Events Events for September 18th No Events Events for September 19th No Events Events for September 20th No Events Events for September 21st No Events 22 23 24 25 26 27 28 Events for September 22nd No Events Events for September 23rd No Events Events for September 24th No Events Events for September 25th No Events Events for September 26th No Events Events for September 27th No Events Events for September 28th No Events 29 30 1 2 3 4 5 Events for September 29th No Events Events for September 30th No Events Contact Email: info@deercreekrvgolf.com Address: 42749 Hwy 27\r\nDavenport, FL 33837 Phone: 863.424.3153 Find us on: Facebook page opens in new window Website page opens in new window Our Mission It is our mission to provide a fun, yet challenging golf experience while at the same time fostering fellowship and camaraderie among our players. We strive daily to accomplish this mission by: Presenting and maintaining our golf course at a high standard while showcasing its natural characteristics. Treating our fellow members, employees and guests with respect and providing a satisfying game of golf to all players regardless of playing ability. Making our club enjoyable, accessible and affordable for our members, their families as well as guests. Use our Contact Form to get in touch We'd always love to hear from you. Here is a link to our Contact Form © 2025 - 26 Deer Creek RV Golf and Country Club - Site Design: https://mbgt.com Go to Top"
    },
    {
      "url": "https://deercreekrvonline.com/admin/",
      "text": "Administration • Deer Creek RV Park Online Resource Site Skip to content 863.424.2839 42749 US Hwy 27 Davenport, FL 33837 Facebook page opens in new window X page opens in new window Dribbble page opens in new window Deer Creek RV Park Online Resource Site Deer Creek RV Park Online Resource Site Home Activities Deer Tales and Daily Activities 2025 Activities Blog and Pictures Administration Board of Directors DC HOA Presidents DC Office Announcements Rules and Regulations Important Forms Golf Communities Eagles View Community Pages Osprey Point Community Pages Partridge Pines Community Pages Regal Pointe Community Pages Regal Ridge Community Pages Impressions T&S Impressions – Deer Creek T&S Impressions – Communities T&S Impressions – Activities T&S Impressions – Golf Home Activities Deer Tales and Daily Activities 2025 Activities Blog and Pictures Administration Board of Directors DC HOA Presidents DC Office Announcements Rules and Regulations Important Forms Golf Communities Eagles View Community Pages Osprey Point Community Pages Partridge Pines Community Pages Regal Pointe Community Pages Regal Ridge Community Pages Impressions T&S Impressions – Deer Creek T&S Impressions – Communities T&S Impressions – Activities T&S Impressions – Golf Welcome to the Deer Creek Administration Pages, Deer Creek RV Golf and Country Club is a resident owned gated community, consisting of 6 Independent subdivisions plus common areas featuring our Main Club House, Pro Shop, Tiki Bar, Snack Bar, Tennis and Shuffleboard Courses, Main Clubhouse Pool and an 18 hole Executive Golf Course. Our dedicated team of the Administration in cooperation with our Board of Directors is taking care of the day-to-day routine, the “heavy lifting” and most importantly the fun aspect of our community, the Activities. Administration Departments Corporate Manager Samantha Jewell Community Supervisor Benita Coriano Activities Director Kerry King Receptionist Julie Cooper Maintenance Department Maintenance on call: 863-289-4379\nDCmaintenance@artemislifestyles.com Herren Grounds Care Ryan Herren: 863-662-9387\nryherren@aol.com Pro Shop Please visit our official site https://deercreekrvgolf.com\nfor current Golf Rates, to book Tee Times and General Info. Visit our Page (C) 2025 - 26  -- Deer Creek RV, Golf and Country Club --- Site Design: https://mbgt.com Go to Top One Click Call Button"
    },
    {
      "url": "https://deercreekrvgolf.com/2022/04/29/",
      "text": "April 29, 2022 – Deer Creek Golf and Country Club Skip to content Deer Creek Golf and Country Club Deer Creek Golf Course and Pro Shop Info Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Search: Home Book Tee Times Green Fees Daily – Monthly – Summer ’25 Prices for Golf Memberships – Summer ’25 Golf Memberships – Annual / Monthly Driving Range Memberships DC Rules Proper Golf Attire Required About Us Green Fees Daily – Monthly -Summer 2025 Prices for Golf Memberships – Summer 2025 Golf Memberships – Annual / Monthly Prices for Rounds Packages Driving Range Memberships DC Groups & Leagues Golf Events 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Events (so far) in 2025 Calendar of Events Special Events Results / Impressions 2024 American Legion Tournament Oct 19th 2024 9-11-24 Opening Ceremony and Spread 2024 Labor Day Golf Tournament & Luncheon Impressions from Labor Day Tournament Banquet 2024 AM-CAN Photos – Arrowhead GC – Spencerport NY DC Ladies Championship 2024 Reid-Lewis Cup Men’s Tournament 2024 Impressions 2023 Night Golf Oct 2023 CanAm Tournament 2023 Reid-Lewis Cup Men’s Tournament 2023 Memorial Day Tournament 2023 Independence Day Tournament 2023 Labor Day Tournament 2023 News Contact Daily Archives: April 29, 2022 You are here: Home 2022 April 29 Rebuilding more Greens News By Webmaster April 29, 2022 We will be rebuilding six more greens beginning in May, 2023. Temporary greens will be in play until… Details Search: Recent Posts 2025 July4th Golf Tournament 2025 Memorial Day Golf Tournament Golf Course Closure and Limitations Events (so far) in 2025 2024 Labor Day Golf Tournament & Luncheon Events Category Backwards Golf Golf Tournament Night Golf August September 2025 October MO TU WE TH FR SA SU 1 2 3 4 5 6 7 Events for September 1st 9:00 AM - 6:00 PM Labor Day Golf Tournament Events for September 2nd No Events Events for September 3rd No Events Events for September 4th No Events Events for September 5th No Events Events for September 6th No Events Events for September 7th No Events 8 9 10 11 12 13 14 Events for September 8th No Events Events for September 9th No Events Events for September 10th No Events Events for September 11th No Events Events for September 12th No Events Events for September 13th No Events Events for September 14th No Events 15 16 17 18 19 20 21 Events for September 15th No Events Events for September 16th No Events Events for September 17th No Events Events for September 18th No Events Events for September 19th No Events Events for September 20th No Events Events for September 21st No Events 22 23 24 25 26 27 28 Events for September 22nd No Events Events for September 23rd No Events Events for September 24th No Events Events for September 25th No Events Events for September 26th No Events Events for September 27th No Events Events for September 28th No Events 29 30 1 2 3 4 5 Events for September 29th No Events Events for September 30th No Events Contact Email: info@deercreekrvgolf.com Address: 42749 Hwy 27\r\nDavenport, FL 33837 Phone: 863.424.3153 Find us on: Facebook page opens in new window Website page opens in new window Our Mission It is our mission to provide a fun, yet challenging golf experience while at the same time fostering fellowship and camaraderie among our players. We strive daily to accomplish this mission by: Presenting and maintaining our golf course at a high standard while showcasing its natural characteristics. Treating our fellow members, employees and guests with respect and providing a satisfying game of golf to all players regardless of playing ability. Making our club enjoyable, accessible and affordable for our members, their families as well as guests. Use our Contact Form to get in touch We'd always love to hear from you. Here is a link to our Contact Form © 2025 - 26 Deer Creek RV Golf and Country Club - Site Design: https://mbgt.com Go to Top"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLPolkDeerCreekRVGolfCountryClub.htm",
      "text": "Deer Creek RV Golf and Country Club, Davenport, Florida Par 3 Golf Courses Home (current) United States Alabama Alaska Arizona Arkansas California Colorado Connecticut DC Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming International Africa Australia Austria Belgium Canada Caribbean China Croatia CzechRep Denmark Finland France Germany Hungary Iceland Indonesia Ireland Luxembourg Mexico Netherlands New Zealand Norway Portugal Singapore Spain Turkey United Arab Emirates United Kingdom Add/Edit Course About Us Join Email List Our Other Golf Sites GroupChips.com GolfPuns.com GolfMajors2020.com ReachTheGreen.com WinFreeGolfBalls.com Deer Creek RV Golf and Country Club, Davenport, Florida Get your short game on! Florida Home Florida Course List Florida County Map Deer Creek RV Golf and Country Club 4200 Hwy 27 N Davenport FL 33837 Phone: (863) 424-2839 Type: Resort Par: 60 Holes: 18 Website: https://deercreekrvgolf.com/ Comments: Built around an 18-hole Executive Golf Course, we have a full range of amenities. Our activity calendars are jam-packed with something for everyone. Try Deer Creek's Executive Golf Course and visit our Pro Shop. Both are open to the public. Photos info@9holegolfcourses.com Copyright © Morton Technologies, LLC - All rights reserved | Privacy Policy Our disclosure to you: We spend a great deal of time keeping our directory up-to-date.  We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.  We also partner with other advertisers like Rock Bottom Golf and earn commissions by linking to their websites as well.  Please contact us if you have any questions. Par 3 and Executive Golf Courses Privacy Notice × Privacy Notice This privacy notice discloses the privacy practices for Par 3 and Executive Golf Courses. This privacy notice applies solely to information collected by this website. It will notify you of the following: What personally identifiable information is collected from you through the website, how it is used and with whom it may be shared. What choices are available to you regarding the use of your data. The security procedures in place to protect the misuse of your information. How you can correct any inaccuracies in the information. Information Collection, Use, and Sharing We are the sole owners of the information collected on this site. We only have access to/collect information that you voluntarily give us via email or other direct contact from you. We will not sell or rent this information to anyone. We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order. Unless you ask us not to, we may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy. Your Access to and Control Over Information You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website: See what data we have about you, if any. Change/correct any data we have about you. Have us delete any data we have about you. Express any concern you have about our use of your data. Security We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline. Wherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a lock icon in the address bar and looking for \"https\" at the beginning of the address of the Web page. While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers/servers in which we store personally identifiable information are kept in a secure environment. If you feel that we are not abiding by this privacy policy, you should contact us immediately via email. Registration In order to use this website, a user must first complete the registration form. During registration a user is required to give certain information (such as name and email address). This information is used to create a unique user account for you to access our web portal. At your option, you may also provide demographic information (such as gender or age) about yourself, but it is not required. Orders We request information from you on our order form. To buy from us, you must provide contact information (like name and shipping address) and financial information (like credit card number, expiration date). This information is used for billing purposes and to fill your orders. If we have trouble processing an order, we'll use this information to contact you. Cookies We use \"cookies\" on this site. A cookie is a piece of data stored on a site visitor's hard drive to help us improve your access to our site and identify repeat visitors to our site. For instance, when we use a cookie to identify you, you would not have to log in a password more than once, thereby saving time while on our site. Cookies can also enable us to track and target the interests of our users to enhance the experience on our site. Usage of a cookie is in no way linked to any personally identifiable information on our site. Some of our business partners may use cookies on our site (for example, advertisers). However, we have no access to or control over these cookies. Sharing We share aggregated demographic information with our partners and advertisers. This is not linked to any personal information that can identify any individual person.  We use a credit card processing company to bill users for goods and services. These companies do not retain, share, store or use personally identifiable information for any secondary purposes beyond filling your order. Links This website may contain links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. Surveys & Contests From time-to-time our site requests information via surveys or contests. Participation in these surveys or contests is completely voluntary and you may choose whether or not to participate and therefore disclose this information. Information requested may include contact information (such as name and shipping address), and demographic information (such as zip code, age level). Contact information will be used to notify the winners and award prizes. Survey information will be used for purposes of monitoring or improving the use and satisfaction of this site. Close We'd like permission to email you ONCE a month! We promise, just once a month.  We will email you news about our site, deals and offers from Golf retailers, and other Golf info you might find interesting! You can opt-out at any time, but we hope you don't. Just enter your email below.  We will send you a validation link to confirm you really do want email from us (we respect your privacy). Email Address Also enter me for FREE Monthly Golf Ball Drawing at WinFreeGolfBalls.com * Click here to submit form and join our list! * We also own WinFreeGolfBalls.com - we will NEVER sell or otherwise transfer your email address to anyone.  Never! No thanks Golf info isn't important to me"
    }
  ]
}