{
  "fuentes": [
    {
      "url": "https://www.marquette.edu/faith/christmas-reflection-2015.php",
      "email": "brigid.kinsella-alba@marquette.edu"
    },
    {
      "url": "https://www.defuniaksprings.net/895/CITY-COUNCIL",
      "email": "cityclerk@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/1346/Volunteer",
      "email": "adminassist@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/1346/Volunteer",
      "email": "pwadmin@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/1346/Volunteer",
      "email": "volunteer@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/1097/Christmas-Reflections",
      "email": "volunteer@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/1097/Christmas-Reflections?amp=&amp=",
      "email": "volunteer@defuniaksprings.net"
    },
    {
      "url": "https://www.wjhg.com/2022/12/23/defuniak-springs-decked-out-christmas/",
      "email": "daniel.nyman@wjhg.com"
    },
    {
      "url": "https://www.wjhg.com/2022/12/23/defuniak-springs-decked-out-christmas/",
      "email": "publicfile@wjhg.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://christmasbureau.com/contact-us/",
      "email": "coordinator@christmasbureau.com"
    },
    {
      "url": "https://www.marquette.edu/faith/christmas-reflection.php",
      "email": "brigid.kinsella-alba@marquette.edu"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.defuniaksprings.net/230/How-To-Apply",
      "email": "hrassist@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/230/How-To-Apply",
      "email": "hrdirector@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/227/Human-Resources",
      "email": "cityclerk@defuniaksprings.net"
    },
    {
      "url": "https://www.defuniaksprings.net/227/Human-Resources",
      "email": "hrdirector@defuniaksprings.net"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    }
  ],
  "mails": [
    "adminassist@defuniaksprings.net",
    "brigid.kinsella-alba@marquette.edu",
    "cityclerk@defuniaksprings.net",
    "coordinator@christmasbureau.com",
    "daniel.nyman@wjhg.com",
    "hrassist@defuniaksprings.net",
    "hrdirector@defuniaksprings.net",
    "info@inzmo.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "publicfile@wjhg.com",
    "pwadmin@defuniaksprings.net",
    "volunteer@defuniaksprings.net"
  ],
  "nombre_sitio": "defuniaksprings.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.marquette.edu/faith/christmas-reflection-2015.php",
      "text": "A Christmas Reflection // Faith at Marquette // Marquette University Skip to content marquette.edu // Search // A-Z Index // Give to Marquette Marquette University Faith at Marquette Faith at Marquette Prayer Resources See all prayers and reflections Submit a prayer intention Prayer request for Marquette community From the Ignatian tradition Traditional Catholic prayers Other Christian prayers Prayers for college life Prayers for graduates and alumni Prayers from many faith traditions Ignatian Spirituality Living our faith Mission and Ministry Campus Ministry Faber Center for Ignatian Spirituality Mission Week Center for Peacemaking Events Sacred Spaces Marquette.edu // Faith at Marquette // A Christmas Reflection This time of year, It's a Wonderful Life often is on television. It is the quintessential Christmas story with a hero and a villain and we all know that the good guy wins in the end. That Christmas Eve in Bedford Falls reminds us all of Christmases past as we look to the coming of the baby Jesus this year, and Christ who is to come in the future. Like George Bailey, we sometimes focus on the negative. Our world today can present us with many reasons to lose hope with opportunities, attractions, and distractions that make it easy to miss the true meaning of the Christmas season. But in fact, this is the season of light, whether from the lights of the Christmas tree, the glow of the Advent wreath candles, the flame of the Menorah, or perhaps simply the sky on a rare day of sunshine in a Milwaukee December. All of these can remind us of the presence of God and the promise of hope that is fulfilled in this holy season. Remember that behind the packages and the lights is the radiance that is our God. See the hope in the faces of the people around you. See it in the faces of your family and friends and coworkers. See it in your own face when you look in the mirror. Doing this will allow each of us to welcome that little baby on Christmas, the way that Mary and Joseph so willingly welcomed him into their lives. And know that God so lovingly welcomes us into His. May the peace of God rule in your dreams. May your joys be fulfilled and your prayers answered. May you have healing, health, happiness, and prosperity in the new year. Have a graced Advent and a Merry Christmas from all of us at Marquette University. Amen. Rev. Frederick Zagone, S.J. Chaplain, Marquette University Alumni Association Spiritual Resources See upcoming events Recent reflections An Ignatian Friendship Rev. Jim Pribek, S.J., assistant vice president for Mission and Ministry, reflects on the fall 2021 issue of Conversations Magazine and the importance of developing real friendships. “Fall in Love, stay in love and it will decide everything.” — From a prayer attributed to Rev. Pedro Arrupe, S.J. Read more recent reflections Social Media Problem with this webpage? Report an accessibility problem . To report another problem, please contact brigid.kinsella-alba@marquette.edu . Location Marquette University 1250 W. Wisconsin Ave. Milwaukee, WI 53233 Phone: (800) 222-6544 Key Resources español Careers Campus map Campus contacts Contact us Search marquette.edu Marquette Today Marquette Email CheckMarq D2L MyJob University safety MARQUETTE A to Z A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Report a web issue   → Privacy Policy Legal Disclaimer Non-Discrimination Policy Accessible Technology © 2025 Marquette University ©"
    },
    {
      "url": "https://www.defuniaksprings.net/895/CITY-COUNCIL",
      "text": "City Council | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Residents Visitors Center Business Search Mayor, Bob Campbell PROCLAMATIONS Local Amenities Project Updates Todd Bierbaum - Seat 1 Josh Sconiers - Seat 2 Amy Heavilin - Seat 3 (Mayor Pro-Tem) Glen Harrison - Seat 4 Danny Cosson - Seat 5 CITY CHARTER MUNICIPAL CODE OF ORDINANCES POLICIES Social Media Policy Agenda and Minutes Overview Council and Committee Meeting Calendar Home Government CITY COUNCIL City Council Description The City of DeFuniak Springs is governed by a Mayor and City Council who are elected by the people of the City of DeFuniak Springs. The Mayor and City Council acting together are the Governing Body. All Governing Body members serve four-year terms. The Governing Body, being the elected representative of the people, adopts all ordinances and resolutions and determines the general goals and policies. Mission, Vision, and Goals Meetings 5:00 PM ( Second and Fourth Monday of each month ) CST. (Please check agenda in the calendar section for specific location in the event of a change in venue) Meetings are held at City Hall - Council Chambers, 1350 Baldwin Avenue, DeFuniak Springs, FL. Request to be on the Agenda. (WORD document) For all public records requests, please contact City Clerk Rafael Ali by calling (850) 892-8500 Ext. 1103 or email cityclerk@defuniaksprings.net . City Council Committee Appointments: Chamber of Commerce: Councilwoman Amy Heavilin Council on Aging: Councilman Todd Bierbaum Walton Co. Economic Development Alliance: Councilman Todd Bierbaum EDA Business Leadership Council: TBD , Previously Councilman Anthony Vallee Okaloosa/Walton Transportation Planning Organization: TBD , Previously Councilman Anthony Vallee Alternate: Councilwoman Amy Heavilin TRIUMPH Advisory Board City Manager Walton County Community Health Improvement Plan Committee TBD , Previously Councilman Anthony Vallee Walton Correctional Institution Community Advisory TBD , Previously Councilman Henry Ennis, Sr Walton County Coalition Councilwoman Amy Heavilin Emerald Coast Regional Planning City Council Mayor Bob Campbell Mayor Robert \"Bob\" Campbell T erm ends April 2029 Council Member, Seat 1 Mayor Pro-Tempore Todd Bierbaum Term ends April 2027 Council Member, Seat 2 Josh Sconiers Term ends April 2027 Council Member, Seat 3 Amy Heavilin Term ends April 2027 Council Member, Seat 4 Glen Harrison Term ends April 2029 Council Member, Seat 5 Danny Cosson Term ends April 2029 Florida Commission on Ethics Quick Links: Council Agendas Most Recent Agenda | View All Council Approved Minutes Most Recent Minutes | View All Council Audio Files View All Council Adopted Ordinances Most Recent Ordinance / View All Council Adopted Resolutions Most Recent Resolution / View All Employment View current opportunities Agenda / Minutes / Public Notice View the latest Report an Issue Let us know Facility Rentals Book your rental today Bill Pay Pay your bill online today Natural Gas Learn about programs Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.defuniaksprings.net/1346/Volunteer",
      "text": "Volunteer | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In LakeFest Christmas Reflections Marvel of Flight Historic District Tour Search Carriage Rides The Christmas Tour of Homes Volunteer 21st Annual Christmas Parade 2024 Home Visitors Center Christmas Reflections Volunteer Volunteer All spots are currently filled, thank you for those who have volunteered for the 2024 season! VOLUNTEER During Christmas Reflections 2024! We need volunteers to assist with greeting guests and collecting entry fees as they arrive at the Christmas Reflections light show. SIGN UP HERE Nightly, Starting November 29th through December 31st, 5:30 pm - 9:30 pm. Sponsoring businesses or community service organizations may provide advertising at the entrance. For general questions please call City Hall at (850) 892-8500, ext. 1123. For more volunteer information or cancellations please email: volunteer@defuniaksprings.net or call: (850) 951 - 3030 . Your help is deeply appreciated, valued, and is a huge part of making this a success! Volunteer Coordinators Sumie Gabbard Executive Assistant Email Phone: (850) 892-8500, ext. 1104 DeAnn Brooks Administrative Assistant Email Phone: (850) 892-8500 Ext. 1123 Directions Learn More Visitors Center Learn More Things to Do Learn More Walking Tour Map Learn More Participate Learn More Contact Us Learn More Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.defuniaksprings.net/1097/Christmas-Reflections",
      "text": "Christmas Reflections 2024 | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In LakeFest Christmas Reflections Marvel of Flight Historic District Tour Search Carriage Rides The Christmas Tour of Homes Volunteer 21st Annual Christmas Parade 2024 Home Visitors Center Christmas Reflections Christmas Reflections 2024 THANK YOU FOR ANOTHER GREAT SEASON! SEE YOU AT CHRISTMAS REFLECTIONS 2025! HAPPY NEW YEARS! It's THE event of the year! Bring the entire family any night of the week or come and stay the weekend in the beautiful, historic DeFuniak Springs, Florida! Come see more than 10 million lights reflect off a perfectly round spring-fed lake glowing in holiday splendor! Enjoy a holiday family tradition that is a delight to all ages as we light up Chipley Park with the annual Christmas Reflection displays. A variety of Victorian, animal, and toy soldier cutouts, Santa’s workshop, and the grandfather clock ticking away are among the thousands of decorations that adorn these historic grounds. This event is orchestrated and hosted by the City of DeFuniak Springs. See below for free holiday special events, markets, and the Festival of Trees which complement this season's light show. Sign up to Volunteer! (Currently Filled) This is a Drive Around or Walk Around Event Open: Day after Thanksgiving to New Year's Eve. Nightly, 7 days a week, 5:30 pm - 9:30 pm. The last car is at 9 pm.  Lights are out by 9:30 pm. As the weather permits. Mini Buses & Large Buses are not recommended due to minimal turning radius. Dogs must be kept on a leash at all times. Fri Admission: $5 per person Free for children 5 and under Tuesday Discount for Military:  $10 (for a carload of up to 6 people) Group rates- None at this time Walkers get in Free- Donations Accepted Season Passes: Available for $50 (for a car load up to 6 people) (If possible, please pick up your Season Pass in advance at City Hall. If you are unable to do so, inform the entry attendant upon arrival and ask them to check for your pass at the gate. Please ensure you have your emailed payment receipt with you for verification when picking up your pass.) Entry, Passes, and Donations can be paid Online Here Admission:   Admission:  Admission:  Admission:  Admission:  Admission:  Admission:  Admission: (For all Online orders, please ensure you have your emailed payment receipt with you for verification.) Admission:   Admission:  Admission:Pl Admission: Other Related Events: We will have Carriage Rides this year from Pettis's Little Patch of Heaven - SOLD OUT, All Reservations Have Been Made. Watch out for the GRINCH walking around and taking photos - from 5:30 pm to 9:00 pm the following weekends Nov. 29th-30th, Dec. 6th, and Dec. 20th-21st. Christmas Tour of Homes in Historic DeFuniak Springs - Saturday, Dec. 7th, 2024 from 10 AM to 5 PM. Sponsored by St. Agatha's Episcopal Church in DeFuniak Springs. Festival of Trees - On Display Inside The Chautauqua Hall of Brotherhood - Nov. 29th - Dec. 9th, 2024. **Santa has returned to the North Pole, he hopes to see you next year!!** Photos with SANTA! (take with your own camera) Bring the family out to the City of DeFuniak Springs, Amphitheatre (on Circle Drive @ The Lake Yard) and get your 2024 photos with Santa Claus, while you visit Christmas Reflections. Photos with Santa will be available on Fridays, Saturdays, and Sundays - 5:30 pm - 9:00 pm. Directions: ( GPS: 3 Circle Drive, DeFuniak Springs, FL 32435) *With recent FDOT roadwork on 331 and at Live Oak, the entrance has been rerouted to Bruce Ave instead of traditionally at Live Oak Ave* Mini Buses & Large Buses are not recommended due to minimal turning radius. From Pensacola/Crestview: Take U.S. Highway 90 East; turn right onto U.S. Highway 331 South. Turn left onto Bruce Avenue (second red light); turn left on 11th St, turn right on Live Oak Avenue, and follow the Christmas Reflections entrance path. From Alabama: Take U.S. Highway 331 South to DeFuniak Springs. Turn left onto U.S. Highway 90 East; turn right onto U.S. Highway 331 South. Turn left onto Bruce Avenue (second red light); turn left on 11th St, turn right onto Live Oak, and follow the Christmas Reflections entrance. From Tallahassee: Take I-10 West to Exit 85 (DeFuniak Springs); turn right onto U.S. Highway 331 going North; turn right onto Bruce Ave; turn left onto 11th St; turn right onto Live Oak Avenue, and follow to the entrance of Christmas Reflections. From U.S. Highway 98: Take U.S Highway 331 North to DeFuniak Springs. Turn right onto Bruce Ave; turn left onto 11th St, turn right onto Live Oak Avenue, and follow to the entrance of Christmas Reflections. Volunteer! (All spots are currently filled) Click here Volunteer! Volunteer! ( Volunteer! (W Volunteer! (All spots are currently Volunteer! (All spots are currently filled Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled) to volunteer for Christmas Reflections. Nightly volunteers starting Nov. 29th are needed to help greet guests and collect entry fees as guests enter the Christmas Reflections light show. Your help is deeply appreciated, valued, and a huge part of making this a success! Christmas Reflections Information For general questions please call City Hall at (850) 892-8500 x1123. For automated information please call the Christmas Reflections Hotline at (850) 253-7642. For Volunteer Cancellations please call (850) 951 - 3030 or Email Us Here Christmas Reflections Information Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information    Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information      Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information Nov. 29-Dec. 31, 2024 Nightly 5:30 - 9:30 PM CST Christmas Reflections Information (850) 892-8500, ext. 1123 Christmas Reflections Hotline (850) 253-7642 Volunteer Information or Cancellation (850) 951 - 3030 or email us Sponsored In Part By: Directions Learn More Visitors Center Learn More Things to Do Learn More Walking Tour Map Learn More Participate Learn More Contact Us Learn More Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.defuniaksprings.net/1097/Christmas-Reflections?amp=&amp=",
      "text": "Christmas Reflections 2024 | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In LakeFest Christmas Reflections Marvel of Flight Historic District Tour Search Carriage Rides The Christmas Tour of Homes Volunteer 21st Annual Christmas Parade 2024 Home Visitors Center Christmas Reflections Christmas Reflections 2024 THANK YOU FOR ANOTHER GREAT SEASON! SEE YOU AT CHRISTMAS REFLECTIONS 2025! HAPPY NEW YEARS! It's THE event of the year! Bring the entire family any night of the week or come and stay the weekend in the beautiful, historic DeFuniak Springs, Florida! Come see more than 10 million lights reflect off a perfectly round spring-fed lake glowing in holiday splendor! Enjoy a holiday family tradition that is a delight to all ages as we light up Chipley Park with the annual Christmas Reflection displays. A variety of Victorian, animal, and toy soldier cutouts, Santa’s workshop, and the grandfather clock ticking away are among the thousands of decorations that adorn these historic grounds. This event is orchestrated and hosted by the City of DeFuniak Springs. See below for free holiday special events, markets, and the Festival of Trees which complement this season's light show. Sign up to Volunteer! (Currently Filled) This is a Drive Around or Walk Around Event Open: Day after Thanksgiving to New Year's Eve. Nightly, 7 days a week, 5:30 pm - 9:30 pm. The last car is at 9 pm.  Lights are out by 9:30 pm. As the weather permits. Mini Buses & Large Buses are not recommended due to minimal turning radius. Dogs must be kept on a leash at all times. Fri Admission: $5 per person Free for children 5 and under Tuesday Discount for Military:  $10 (for a carload of up to 6 people) Group rates- None at this time Walkers get in Free- Donations Accepted Season Passes: Available for $50 (for a car load up to 6 people) (If possible, please pick up your Season Pass in advance at City Hall. If you are unable to do so, inform the entry attendant upon arrival and ask them to check for your pass at the gate. Please ensure you have your emailed payment receipt with you for verification when picking up your pass.) Entry, Passes, and Donations can be paid Online Here Admission:   Admission:  Admission:  Admission:  Admission:  Admission:  Admission:  Admission: (For all Online orders, please ensure you have your emailed payment receipt with you for verification.) Admission:   Admission:  Admission:Pl Admission: Other Related Events: We will have Carriage Rides this year from Pettis's Little Patch of Heaven - SOLD OUT, All Reservations Have Been Made. Watch out for the GRINCH walking around and taking photos - from 5:30 pm to 9:00 pm the following weekends Nov. 29th-30th, Dec. 6th, and Dec. 20th-21st. Christmas Tour of Homes in Historic DeFuniak Springs - Saturday, Dec. 7th, 2024 from 10 AM to 5 PM. Sponsored by St. Agatha's Episcopal Church in DeFuniak Springs. Festival of Trees - On Display Inside The Chautauqua Hall of Brotherhood - Nov. 29th - Dec. 9th, 2024. **Santa has returned to the North Pole, he hopes to see you next year!!** Photos with SANTA! (take with your own camera) Bring the family out to the City of DeFuniak Springs, Amphitheatre (on Circle Drive @ The Lake Yard) and get your 2024 photos with Santa Claus, while you visit Christmas Reflections. Photos with Santa will be available on Fridays, Saturdays, and Sundays - 5:30 pm - 9:00 pm. Directions: ( GPS: 3 Circle Drive, DeFuniak Springs, FL 32435) *With recent FDOT roadwork on 331 and at Live Oak, the entrance has been rerouted to Bruce Ave instead of traditionally at Live Oak Ave* Mini Buses & Large Buses are not recommended due to minimal turning radius. From Pensacola/Crestview: Take U.S. Highway 90 East; turn right onto U.S. Highway 331 South. Turn left onto Bruce Avenue (second red light); turn left on 11th St, turn right on Live Oak Avenue, and follow the Christmas Reflections entrance path. From Alabama: Take U.S. Highway 331 South to DeFuniak Springs. Turn left onto U.S. Highway 90 East; turn right onto U.S. Highway 331 South. Turn left onto Bruce Avenue (second red light); turn left on 11th St, turn right onto Live Oak, and follow the Christmas Reflections entrance. From Tallahassee: Take I-10 West to Exit 85 (DeFuniak Springs); turn right onto U.S. Highway 331 going North; turn right onto Bruce Ave; turn left onto 11th St; turn right onto Live Oak Avenue, and follow to the entrance of Christmas Reflections. From U.S. Highway 98: Take U.S Highway 331 North to DeFuniak Springs. Turn right onto Bruce Ave; turn left onto 11th St, turn right onto Live Oak Avenue, and follow to the entrance of Christmas Reflections. Volunteer! (All spots are currently filled) Click here Volunteer! Volunteer! ( Volunteer! (W Volunteer! (All spots are currently Volunteer! (All spots are currently filled Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled)  Volunteer! (All spots are currently filled) to volunteer for Christmas Reflections. Nightly volunteers starting Nov. 29th are needed to help greet guests and collect entry fees as guests enter the Christmas Reflections light show. Your help is deeply appreciated, valued, and a huge part of making this a success! Christmas Reflections Information For general questions please call City Hall at (850) 892-8500 x1123. For automated information please call the Christmas Reflections Hotline at (850) 253-7642. For Volunteer Cancellations please call (850) 951 - 3030 or Email Us Here Christmas Reflections Information Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information    Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information      Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information   Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information  Christmas Reflections Information Nov. 29-Dec. 31, 2024 Nightly 5:30 - 9:30 PM CST Christmas Reflections Information (850) 892-8500, ext. 1123 Christmas Reflections Hotline (850) 253-7642 Volunteer Information or Cancellation (850) 951 - 3030 or email us Sponsored In Part By: Directions Learn More Visitors Center Learn More Things to Do Learn More Walking Tour Map Learn More Participate Learn More Contact Us Learn More Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.wjhg.com/2022/12/23/defuniak-springs-decked-out-christmas/",
      "text": "DeFuniak Springs decked-out for Christmas Skip to content Watch Live News Your County We the People National Weather Sports Chapter Chat WJHG Apps Submit Photos & Video Shop Local Homepage News State Regional National International Crime Politics Watch Live Your County Bay Calhoun Gulf Franklin Holmes Jackson Liberty Okaloosa Walton Washington Weather Closings & Delays Hurricane Hurricane Michael: 5 Years Later Live Doppler Radar Map Room Severe Weather Guide Weather Cameras Wildfire Forecast Sports Headlines Friday Night Overtime Scoreboard Share Your Highlights Student Athlete Of The Week Sports Talk Community Community Calendar Golden Apple Award Summertime Learning 850 Student Of The Week Chapter Chat NewsChannel 7 Today Live Shots with Shaun Morning Interviews Medical Monday Foodie Friday Time Travel Tuesday We the People Contests Contact Us Meet the Sales Team Advertise With Us Find a Job Internship Opportunity Meet the Team Election Results Newsletter Discover Northwest Florida Shop Local Submit Photos & Video WJHG 7+ Time Travel Sports Talk Faces and Places 7 @ 7 Community Extra Programming Schedule NextGen TV Zeam - News Streams Circle Country Gray DC Bureau InvestigateTV Watching Your Wallet PowerNation My NetworkTV Digital Marketing DeFuniak Springs decked-out for Christmas Faces: DeFuniak Reflections By Daniel Nyman Published : Dec. 22, 2022 at 10:57 PM CST Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn PANAMA CITY, Fla. (WJHG/WECP) - Temperatures are falling, families are gathering, and a sea of lights is glistening across Lake DeFuniak. Every December, the City of DeFuniak Springs flips the switch on its crown jewel event. Its Christmas Reflections light display has lit up the perimeter of Lake Defuniak in Chipley Park since the late 1990s. Each year, the event grows bigger and better, drawing thousands of visitors. “The Christmas lights transform DeFuniak Springs into your quintessential hallmark town in December. We have a 260-acre park that surrounds a perfectly round lake, and we line that with over ten million Christmas lights and we see tens of thousands of visitors every year. It is absolutely the crown jewel of DeFuniak Springs,” said Todd Beirbaum, a City Councilman in DeFuniak Springs. Christmas Reflections comes from humble beginnings, but it’s now a prize of the Panhandle. “The community loves this and it’s something that people make tradition with their family every year, they come to walk the lake yard, they do carriage rides, they drive it, and if they have family in town they bring them back to it. It’s just a great way to make everlasting memories with your family,” said business owner Amanda Bierbaum, who is also the president of the Main Street DeFuniak board. The attraction is enjoyed by visitors of all ages. Santa Claus is available to chat with the little ones, while the park paths make for a scenic stroll for those looking to get into the holiday spirit. Many folks make a stop at Christmas Reflections as part of their yearly tradition. Like 12-year-old Olivia - a DeFuniak native - who makes the trek out to Chipley Park every Christmas. “We come out here every year just to enjoy the lights. I usually come out here with my aunt and my cousins; it’s a tradition, hopefully, I’ll always stick to it,” Olivia said. But Christmas Reflections is about so much more than the lights. In a season of giving - and of course, shopping - tourism brings an economic boost to the city. “All of us downtown do what we can to help supplement and make sure that people who come from out of town to come to see the lights have something to keep them here and entertain them while they’re here so they spend more time here which helps stimulate the economy here in DeFuniak,” Amanda Bierbaum said. In a holiday season plagued with inflation, the best gift for businesses is more customers. “It means an incredible amount because when you shop local and support local businesses a vast majority of that dollar stays local to the area and for the times we’re in right now that means more than anything to people,” Todd Bierbaum said. For families, the quality time spent dashing around the park makes a great gift too. The Christmas Reflections light display remains open through December 31st. It’s open daily from 5:00 p.m. to 9:00 p.m., and costs $5 per person for entry. More information on the event, including directions, can be found here . Copyright 2022 WJHG. All rights reserved. Most Read Former Sneads High softball coach pleads guilty after sexual misconduct with player Conservative activist Charlie Kirk dead after being shot at university event; initial persons of interest released Open carry ban ruled unconstitutional in Florida Hand soap recall expanded to include shampoos, lotions, sanitizers over sepsis concerns Virginia man missing, last seen at Ponce de Leon Springs State Park Flesh-eating bacteria brings together two survivors Investigation targeting online child predators leads to arrest of 7 Suspect dead and 2 critically injured in shooting at Colorado high school, officials say Latest News Flooding issues addressed in a Bay County neighborhood Sheriff A.J. Smith shares information about upcoming kidney transplant Ellie’s Boxes of Hope partners with PCFD to help fire victims JAMAICAN LAKE WORKSHOP PCPD PARTNERS WITH ELLIES BOXES OF HOPE Conservative activist Charlie Kirk dead after being shot at university event; initial persons of interest released Suspect dead and 2 critically injured in shooting at Colorado high school, officials say Franklin County Sheriff A.J. Smith to receive kidney transplant Tuesday News Sports Weather Contact Us Advertise with Us Programming Shop Local Submit Photos & Video Find a Job Hurricane Facebook Twitter Instagram WJHG 8195 Front Beach Road Panama City Beach, FL 32407 (850) 234-7777 Public Inspection File publicfile@wjhg.com - (850) 234-7777 Closed Captioning/Audio Description Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Surname E-Mail name Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://christmasbureau.com/contact-us/",
      "text": "Contact Us | Surrey Christmas Bureau 604-581-9623 coordinator@christmasbureau.com Home About Us What is the Surrey Christmas Bureau Our Board of Directors Our Team Blog Adopt a Family Family Stories Adopt A Family Guidelines Adopt A Family Application Form In-Kind Tax Receipt Request #BeAnElf How you can #BeAnElf Sporty Elves Donate Donate Now Become a Business Donor Donate by Mail Form Sponsors Volunteer Volunteer Application Form Events Event a Calender Host An Event Register for Help Contact Us Select Page Get in Touch! Get in touch with the Surrey Christmas Bureau and join us in spreading joy to low-income families. Whether you have questions, want to donate, or are interested in volunteering, we’d love to hear from you. Your support makes a meaningful difference during the holiday season! Name Email Address Message Submit  Phone +1 604 581 9623  Email coordinator@christmasbureau.com  MAILING Address PO Box 547, 10688 King George Blvd., Surrey, BC V3T 5W7 Get in Touch. Get Involved.  +1 604 581 9623  coordinator@christmasbureau.com  PO Box 547, 10688 King George Blvd., Surrey, BC V3T 5W7 Name Email Address Message Submit Design & Developed By Quiresoft Technologies"
    },
    {
      "url": "https://www.marquette.edu/faith/christmas-reflection.php",
      "text": "Christmas Reflection  // Faith at Marquette // Marquette University Skip to content marquette.edu // Search // A-Z Index // Give to Marquette Marquette University Faith at Marquette Faith at Marquette Prayer Resources See all prayers and reflections Submit a prayer intention Prayer request for Marquette community From the Ignatian tradition Traditional Catholic prayers Other Christian prayers Prayers for college life Prayers for graduates and alumni Prayers from many faith traditions Ignatian Spirituality Living our faith Mission and Ministry Campus Ministry Faber Center for Ignatian Spirituality Mission Week Center for Peacemaking Events Sacred Spaces Marquette.edu // Faith at Marquette // Christmas Reflection “The people who walked in darkness have seen a great light; upon those who dwelt in the land of gloom, a light has shown.” This is the prophecy of Isaiah and we are living in as disturbing times as the prophet was with our government gridlock, terrorism on the upswing, and urban and domestic poverty and violence on the increase. But there is good news: “For a child is born to us, a son is given us; upon his shoulder dominion rests.” Isaiah gives names to this child—all of which are Christmas gifts to us: Wonder-Counselor: All of us need someone to whom we can turn to who points us in the right direction. Who better knows what is in the human heart and what we need for the fullness of life than the resurrected Jesus who carries with him his human experience? God-Hero: We need models of integrity, humanity, and valor in our live, people who encourage us to realize our potential. What better hero can we have than the one in the Gospel who challenges the weak-hearted to bravery, the sinners to repentance, the blind to see the deaf to hear, and the crippled to walk. Father-Forever: No one has a father long enough. He gives the unconditional love we all long for. What better father can we have than the Father who waits for his son to return from his life of foolishness or goes out to draw his other stubborn into his embrace? Prince of Peace: St. Augustine says, “Our hearts are restless until they rest in you.” Most of us have a restless heart syndrome. Where does true peace come from? It can only come from the Prince of Peace who implants this gift into men’s and women’s hearts and gives them the vocation to bring “peace on earth to all people of Good Will.” “For a child is born to us, a son given us; upon his shoulder dominion rests.” Spiritual Resources See upcoming events Recent reflections An Ignatian Friendship Rev. Jim Pribek, S.J., assistant vice president for Mission and Ministry, reflects on the fall 2021 issue of Conversations Magazine and the importance of developing real friendships. “Fall in Love, stay in love and it will decide everything.” — From a prayer attributed to Rev. Pedro Arrupe, S.J. Read more recent reflections Social Media Problem with this webpage? Report an accessibility problem . To report another problem, please contact brigid.kinsella-alba@marquette.edu . Location Marquette University 1250 W. Wisconsin Ave. Milwaukee, WI 53233 Phone: (800) 222-6544 Key Resources español Careers Campus map Campus contacts Contact us Search marquette.edu Marquette Today Marquette Email CheckMarq D2L MyJob University safety MARQUETTE A to Z A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Report a web issue   → Privacy Policy Legal Disclaimer Non-Discrimination Policy Accessible Technology © 2025 Marquette University ©"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.defuniaksprings.net/230/How-To-Apply",
      "text": "How To Apply | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Residents Visitors Center Business Search How To Apply Employee Benefits List Florida Retirement System Health Insurance Dental Insurance Vision Insurance Life Insurance Health Reimbursement Arrangement Personnel Policy Employment Forms Holiday Schedule COVID-19 Guidelines Pay Schedule Home Government DEPARTMENTS Administration Human Resources How To Apply How To Apply To Applicant: We appreciate your interest in our organization. Once you have submitted your application, it will be reviewed by the hiring supervisor and you will either receive a phone call requesting to schedule an interview, or a letter notifying you that you have not been selected for the position that you have applied for. If you are interested in applying for another open position, you can notate each position you are interested in on that one application. All open positions are advertised in the local newspaper. We reserve the right to re-post or not fill positions. The City of DeFuniak Springs is an Equal Employment Opportunity, E-Verify and Drug Free Workplace Employer. We consider applicants for all positions without regard to race, color, national origin, gender, age, disability, marital status, religion, Veterans’ or any other legally protected status. Application: In order to be considered for employment for all available position with the City, a completed application must be submitted to the Human Resources Department. Application link is below to print or complete electronically. Interested applicants may mail in or drop off completed applications to: 1350 Baldwin Ave DeFuniak Springs, Florida 32435 Application can be submitted via email to hrdirector@defuniaksprings.net or hrassist@defuniaksprings.net or by fax (850) 892-8570. Photos of application will NOT be accepted. If you have any questions, please contact the Human Resources Department at (850) 892-8500 or via email at hrdirector@defuniaksprings.net . See link below to print an application or to complete electronically for employment with the City of DeFuniak Springs.  This application is also used for the office of the City Marshal.  If completed electronically, please remember to e-sign the application. PDF fillable application Employment View current opportunities Agenda / Minutes / Public Notice View the latest Report an Issue Let us know Facility Rentals Book your rental today Bill Pay Pay your bill online today Natural Gas Learn about programs Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.defuniaksprings.net/227/Human-Resources",
      "text": "Human Resources | DeFuniak Springs, FL - Official Website Skip to Main Content News Alert Florence Park Closure Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Residents Visitors Center Business Search How To Apply Employee Benefits List Florida Retirement System Health Insurance Dental Insurance Vision Insurance Life Insurance Health Reimbursement Arrangement Personnel Policy Employment Forms Holiday Schedule COVID-19 Guidelines Pay Schedule Home Government DEPARTMENTS Administration Human Resources Human Resources Responsibilities The City of DeFuniak Springs Human Resources Department is responsible for the overall administration, coordination, and evaluation of the Human Resources function. Assist employees with all aspects of employment and benefits administration along with adhering to the applicable employment laws. These activities include: Administering the position, classification, and pay plan Overseeing the areas of recruitment, selection, placement, and training of employees in all departments Facilitating resolution of employee complaints and grievances Maintaining centralized personnel records Administering all benefits Ensuring compliance with state and federal employment related laws and regulations Collective Bargaining Investigating and reporting workers' compensation claims Assisting in writing and revising city policies and procedures. Public Records Requests It is the policy of this agency to provide accurate and timely public records requests in accordance with Chapter 119 of Florida Statutes. If you would like to request a public record from the Human Resources Department, please contact our Public Records Custodian using the information below: Public Records Custodian- Rafael Ali, City Clerk Phone: 850-790-1805 Email Once request is received by the City Clerk it will be forwarded to the Human Resources Department. You may also appear in person, by proxy, or mail your request to: City of DeFuniak Springs 1350 Baldwin Ave DeFuniak Springs, FL 32435 The production of records may incur fees in accordance with public records law. Contact Us Julie Chance Human Resources Director Email Phone: (850) 892-8500, ext. 1119 FAQs When will I be contacted for an interview? When will this job posting close? Where can I find your job postings? View All FAQs /FAQ.aspx Quick Links ESS Tyler Login for Employee Timecard Florida Retirement System Direct Deposit Change View All Links /QuickLinks.aspx Employment View current opportunities Agenda / Minutes / Public Notice View the latest Report an Issue Let us know Facility Rentals Book your rental today Bill Pay Pay your bill online today Natural Gas Learn about programs Contact Us City of DeFuniak Springs 1350 Baldwin Avenue DeFuniak Springs, FL 32435 Phone: 850-892-8500 Quick Links City Employee Links City Observed Holiday Closures Current City Council Agenda City Council Audio Files Parks and Facilities /QuickLinks.aspx Helpful Links Agendas & Minutes Resource Directory Burn Ban Info Careers /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    }
  ]
}