{
  "fuentes": [
    {
      "url": "https://carnivalwarehouse.com/newsserver/new-rides-and-family-operation-drive-deggeller-attractions-1579651200",
      "email": "midwayoffun@yahoo.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "email": "acashman@marylandstatefair.com"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "email": "evansunited@aol.com"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "email": "fairoffice@martincountyfair.com"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "email": "info@claycountyfair.org"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "email": "manager@bradfordcountyfair.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.nbcnews.com/news/latino/risky-rides-carnival-workers-grueling-hours-may-threaten-safety-n186966",
      "email": "data.engineering@nbcuni.com"
    },
    {
      "url": "https://www.nbcnews.com/news/latino/risky-rides-carnival-workers-grueling-hours-may-threaten-safety-n186966",
      "email": "donna.pilikyan@nbcuni.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    }
  ],
  "mails": [
    "acashman@marylandstatefair.com",
    "data.engineering@nbcuni.com",
    "donna.pilikyan@nbcuni.com",
    "evansunited@aol.com",
    "fairoffice@martincountyfair.com",
    "info@claycountyfair.org",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "manager@bradfordcountyfair.com",
    "midwayoffun@yahoo.com",
    "sales@finewineliquors.com"
  ],
  "nombre_sitio": "deggeller.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://carnivalwarehouse.com/newsserver/new-rides-and-family-operation-drive-deggeller-attractions-1579651200",
      "text": "New Rides and Family Operation Drive Deggeller Attractions - CarnivalWarehouse.com CHANGE SECTIONS: Carnivals & Fairs • Amusement Parks CarnivalWarehouse.com THE #1 NEWS SOURCE FOR CARNIVALS, FAIRS & EVENTS Menu Subscribe Amusement Warehouse Magazine Buy Photo Calendars CARNIVALS Carnival Industry News Headlines from the Web Carnival Routes Carnival Directory Manufacturer and Supplier Directory Help Wanted Ads Industry Events Photo Galleries FAIRS & EVENTS Fair, Festival & Event News Headlines from the Web Top 50 Fairs Fair List Manufacturer and Supplier Directory Industry Events Photo Galleries AMUSEMENT PARKS Park News Headlines from the Web Park Directory Manufacturer and Supplier Directory Industry Events Photo Galleries Podcast Classifieds Forum About About Us Advertising Information Marketing Services Web Development Contact Us E-Mail News Sign Up FREE Carnival & Fair News Read Amusement Park News Carnival Industry News Fairs and Events News Amusement Park News ---- Carnival Industry News from the Web Fairs and Events News from the Web Amusement Park News from the Web Change Print All News New Rides and Family Operation Drive Deggeller Attractions Show adds new Gosetto Fun House for 2020 By: Mary Weber Wednesday, January 22, 2020 Deggeller Attractions' 2020 season is just around the corner and the show has done plenty of work during the winter months in preparation for the start of the season according to Andy Deggeller, who took over management of the family-owned and operated company about 8 years ago. Deggeller is looking forward to a consistent route, some new equipment, and continuing to work with his supportive family in 2020. The show has ordered a new Gosetto Funhouse set to be delivered in the Spring of 2020; “I don't have an exact delivery date for it but am hoping to have it out on my route n April of 2020,” says Deggeller. While the Funhouse is his only conformed ride purchase for 2020, Deggeller is thrilled to be rolling out the FunTagg digital ticketing system, making his midway totally cashless. “We were supposed to go online with the system in 2019 but hit a few hiccups so we'll start with it in 2020,” says Deggeller. He's enjoyed working with FunTagg system developer Stephen Riegel to ensure a smooth transition when implementing the system on his midway. Deggeller Attractions has continued to play a solid route of events starting in Florida running up through the mid-Atlantic region. “We had a great run this year and even set records at some of our biggest spots,” says Deggeller. “We're certainly hoping for some cooler weather in 2020.” When reflecting on accomplishments in the 2019 season, Deggeller has a dual focus: Deggeller Attractions and the OABA. “I'm on the OABA board so we've been working really hard, especially recently, on making the H2B program easier to use for people in our industry and just getting clarification for certain processes; we want people to be able to rely on getting their H2B employees,” says Deggeller. This upcoming year, he will take over as 1st Vice Chairman on the OABA board so his duties will increase significantly in 2020; “I love doing this work and Degeller Attractions has always been a huge supporter of the OABA,” says Deggeller. As the 2020 season quickly approaches, Deggeller Attractions has 3 major refurbishment projects planned; “we're planning on overhauling our Wacky Worm, Ring Of Fire, and Tornado,” says Deggeller. Big projects like his refurbishment plans are only possible thanks to he help of his supportive management team and long-term staff. He works closely with his wife, his mother, and his sister to keep the company running smoothly. Their efforts are supported by a strong group of American workers, and of course, awesome H2B employees. “Many of my American workers have been around the company for 20 or more years; some worked for my father before me and some even worked for my grandfather,” says Deggeller. For their busier periods of the season, Deggeller Attractions splits into two units, but “for our bigger events we want to make sure we're giving our full focus so we come back together a lot,” added Deggeller. Recently, they've done more corporate and specialty events, some of which have become yearly occurrences. “We had our Ferris Wheel set up on the tarmac at the Atlanta airport which was really cool,” says Deggeller. “We're always looking for new opportunities; we've maintained a similar route for a very long time now and sometimes you get calls about events that are out of your wheelhouse and it's fun to push yourself,” says Deggeller. The Deggeller Attractions family is currently preparing for safety and fair meetings during the winter. “We always brainstorm about ideas before attending conventions like IAAPA, IAFE, and IISF. This year, Deggeller sent about half of his key staff to the AIMS seminar and the other half to the NAARSO seminar. It's important to Deggeller and his family that they are educated in new safety measures and keep up with the fair community. Deggeller Attractions is a family and community focused company. Deggeller proudly shared that they currently have 11 students in their traveling school; “it's great to have our family members out on the road with us while still getting a great education. I'm 3rd generation in the business and I have the 4th generation out here with me,” says Deggeller. For 5-6 weeks out of the year, Deggeller Attractions plays both fairs and still dates in the Virginia Beach, Virginia area; it's a place that's near and dear to Degeller and his family. This year, the Virginia Beach community was deeply affected by a mass shooting in one of the Virginia Beach municipal buildings. Deggeller Attractions furthered their commitment to the area by raising funds for the Virginia Beach community in the wake of the disaster; they also changed their lights to blue to represent the “Virginia Beach Strong” slogan. “You know, we work with these safety officials like the VA Beach police and get our permits from that exact municipal building; it really hit close to home and we waned to do what we could,” says Deggeller. With an awesome new funhouse headed their way, big refurbishment projects beginning, and a solid plan for furthering education within their company, Deggeller Attractions is poised for a successful 2020 season. Related Photos All News Other Carnival & Fair News 9/8/2025 New Generation Taking Charge, Luehrs Ideal Rides Excited & Optimistic About Midwestern Fairs 9/3/2025 Minnesota State Fair Announces 2025 Best Awards 9/3/2025 Ron Weber Passes 8/29/2025 Amusement Warehouse Podcast Episode 61 - Kirk Slaughter & Scott Munz, Oklahoma State Fair 8/28/2025 Kastl Amusements Finds Niche with Fairs, Subcontracts, Fundraisers & Hollywood Rentals 8/26/2025 Strong Attendance & Rebuilt Strates Himalaya Highlight 260th York State Fair 8/21/2025 Amusement Warehouse Podcast Episode 60 - Andrea Wiesenmeyer, Colorado State Fair 8/20/2025 Near-Record Turnout & International News Coverage: Cowboy Cool is 2025 Calgary Stampede More Carnival & Fair Headlines ›› Amusement Park News 9/3/2025 Ron Weber Passes 8/29/2025 Belluevue Bay Indoor Waterpark Coming to Nebraska in 2026-2027 8/22/2025 Dixie Landin Amusement Park to Cease Operations after Short 2025 Opening 8/14/2025 Spokane's Looff Carousel Gets Digital Makeover 8/8/2025 Merlin Entertainment Launches Partnership With Major Gaming Creator 8/1/2025 Universal Kids Resort Reveals Its Six Themed Lands 7/31/2025 How Social Media Builds Your Brand & Packs Your Venue 7/25/2025 Six Flags Announces Major Changes to Theme Park Operations More Amusement Park Headlines ›› CARNIVALS & FAIRS News Industry Buzz News Links From The Web Top 50 Fairs Directories Fairs and Events Carnival Routes Industry Calendar Help Wanted Ads Classifieds Message Forum Photo Gallery Amusement Warehouse Magazine AMUSEMENT PARKS News Industry Buzz News Links From The Web Amusement Park Directory Industry Calendar Help Wanted Ads Classifieds Photo Gallery Amusement Warehouse Magazine OUR COMPANY About Us Magazine Subscription Advertise Here Web Development Event Marketing Contact Us FREE E-Mail News Signup Privacy Policy Terms of Service CarnivalWarehouse.com, Inc. 1998-2022: Company |  Web site developed by Matt's Web Design, Inc."
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://carnivalwarehouse.com/tracker-viewer-routes.asp?mode=viewRoute&seasonYear=2021&filterData=863",
      "text": "Carnival Routes and Schedules - CarnivalWarehouse.com CHANGE SECTIONS: Carnivals & Fairs • Amusement Parks CarnivalWarehouse.com THE #1 NEWS SOURCE FOR CARNIVALS, FAIRS & EVENTS Menu Subscribe Amusement Warehouse Magazine Buy Photo Calendars CARNIVALS Carnival Industry News Headlines from the Web Carnival Routes Carnival Directory Manufacturer and Supplier Directory Help Wanted Ads Industry Events Photo Galleries FAIRS & EVENTS Fair, Festival & Event News Headlines from the Web Top 50 Fairs Fair List Manufacturer and Supplier Directory Industry Events Photo Galleries AMUSEMENT PARKS Park News Headlines from the Web Park Directory Manufacturer and Supplier Directory Industry Events Photo Galleries Podcast Classifieds Forum About About Us Advertising Information Marketing Services Web Development Contact Us E-Mail News Sign Up FREE Carnival Routes and Schedules View Other Routes and Schedules Viewing Route: Deggeller Attractions - 2021 Season 5 Events Found Go Back Martin County Fair 2/12/2021 - 2/20/2021 View Event Website Event Location 2616 Southeast Dixie Highway Stuart, FL  34996 View at Google Maps Event Contact Chester Edwards P: (772) 220-3247 F: (772) 220-2424 Contact via Email Carnival Information Deggeller Attractions P: (772) 286-2011 F: (772) 286-4474 Contact via Email View Website Bradford County Fair 3/9/2021 - 3/14/2021 View Event Website Event Location 2300 North Temple Avenue Starke, FL  32091 View at Google Maps Event Contact Dale Woodruff P: (904) 964-5252 F: (904) 964-2895 C: (904) 964-5995 Contact via Email Carnival Information Deggeller Attractions P: (772) 286-2011 F: (772) 286-4474 Contact via Email View Website Putnam County Fair 3/19/2021 - 3/27/2021 View Event Website Event Location PO Box 400 East Palatka, FL  32131 View at Google Maps Event Contact Fair Board P: (386) 328-3247 F: (386) 328-3239 Contact via Email Carnival Information Deggeller Attractions P: (772) 286-2011 F: (772) 286-4474 Contact via Email View Website Clay County Fair 4/1/2021 - 4/10/2021 View Event Website Event Location 2493 State Rd 16 W Green Cove Springs, FL  32043 View at Google Maps Event Contact Tasha Hyder P: (904) 284-1615 F: (904) 529-9690 Contact via Email Carnival Information Deggeller Attractions P: (772) 286-2011 F: (772) 286-4474 Contact via Email View Website Maryland State Fair 8/26/2021 - 9/6/2021 View Event Website Event Location P.O. Box 188 Timonium, MD  21094 View at Google Maps Event Contact Andy Cashman P: (410) 252-0200 F: (410) 561-5610 Contact via Email Carnival Information Deggeller Attractions P: (772) 286-2011 F: (772) 286-4474 Contact via Email View Website Go Back Goto Top CARNIVALS & FAIRS News Industry Buzz News Links From The Web Top 50 Fairs Directories Fairs and Events Carnival Routes Industry Calendar Help Wanted Ads Classifieds Message Forum Photo Gallery Amusement Warehouse Magazine AMUSEMENT PARKS News Industry Buzz News Links From The Web Amusement Park Directory Industry Calendar Help Wanted Ads Classifieds Photo Gallery Amusement Warehouse Magazine OUR COMPANY About Us Magazine Subscription Advertise Here Web Development Event Marketing Contact Us FREE E-Mail News Signup Privacy Policy Terms of Service CarnivalWarehouse.com, Inc. 1998-2022: Company |  Web site developed by Matt's Web Design, Inc."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name First Surname Nachricht Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.nbcnews.com/news/latino/risky-rides-carnival-workers-grueling-hours-may-threaten-safety-n186966",
      "text": "Risky Rides: Carnival Workers' Grueling Hours May Threaten Safety BREAKING: Consumer price growth ticked up in August IE 11 is not supported. For an optimal experience visit our site on another browser. Skip to Content NBC News Logo U.S. News Politics World Local New York Los Angeles Chicago Dallas-Fort Worth Philadelphia Washington, D.C. Boston Bay Area South Florida San Diego Connecticut Sports Shopping Tipline Culture Business Health Science Share & Save — My News Manage Profile Email Preferences Sign Out Search Search Profile My News Sign Out Sign In Create your free profile Sections U.S. News Politics World Business Sports Investigations Culture & Trends Health Science Tech Weather Video Features Photos NBC Select NBC Asian America NBC BLK NBC Latino NBC OUT Local New York Los Angeles Chicago Dallas-Fort Worth Philadelphia Washington, D.C. Boston Bay Area South Florida San Diego Connecticut tv Today Nightly News MSNBC Meet the Press Dateline Featured NBC News Now Nightly Films Stay Tuned Special Features Newsletters Podcasts Listen Now More From NBC CNBC NBC.COM NBCU Academy Peacock NEXT STEPS FOR VETS NBC News Site Map Help Follow NBC News news Alerts There are no new alerts at this time Search Search Facebook Twitter Email SMS Print Whatsapp Reddit Pocket Flipboard Pinterest Linkedin Latest Stories U.S. News Politics World Sports Shopping Tipline Culture Business Health Science Latino Risky Rides: Carnival Workers' Grueling Hours May Threaten Safety Rides at America's carnivals are operated by seasonal, migrant workers who can work long, grueling hours under tough conditions. Get more news Live on Aug. 24, 2014, 7:37 AM EDT / Updated Aug. 26, 2014, 4:43 PM EDT As summer temperatures rise, carnivals and county fairs pop up in small towns across the United States. They appear for a weekend or run through the fall, and they all have a few things in common: cotton candy, corn dogs, and classic amusement rides like roller coasters and Ferris wheels. But these attractions may come with hidden dangers: Seasonal migrant workers who staff many of these carnivals often put in long, grueling hours operating rides under conditions some worker advocates say threaten the health and safety of workers and fairgoers alike. One Fourth of July weekend three years ago, Samantha Goad was at the Salem Fair in Virginia with a close friend. The sun had long since set when they decided to ride the sleek, fast, red-and-blue Riptide rollercoaster one last time. Goad, then 17, had just finished her junior year at Roanoke Catholic School. A promising athlete, she was a star of her high school softball team. She pitched, played first and third base and was good enough, in the eyes of her coach, to shoot for a college scholarship. \"We saw the other car coming for us, and we braced ourselves.\" The two girls hopped into the second car from the front and secured the safety bar over their laps. The coaster climbed steeply before dropping down a fast dip. Then, according to Goad and others on the ride, the coaster came to an abrupt stop. It was stuck. Goad and the other passengers shouted to the operator below. But he didn’t seem to hear them – and released another coaster onto the track. As the second coaster accelerated toward them, they knew within seconds they would be struck from behind. \"We looked back and saw the other car coming for us,” Goad says, “and we braced ourselves.\" The Riptide, as with all the midway rides at the Salem Fair, was run by Deggeller Attractions, a family-owned business in Stuart, Florida, which touts itself as “America’s No. 1 carnival company.” Deggeller runs midways in half a dozen states on the Eastern Seaboard, from Florida to Pennsylvania. It’s one of over 100 traveling carnival companies that manage amusement rides and midways throughout North America. No overtime or minimum wage for seasonal workers According to a 2013 report by the American University Washington College of Law Immigrant Justice Clinic, which represents immigrants in legal cases, the industry is troubled, marred by frequent accidents and poor treatment of an overworked and underpaid workforce, who often work about 14 hours a day, seven days a week, and whose exhaustion may place themselves and ride patrons at risk. Tight schedules require companies to break down rides and set them up at the next location with alarming speed, often within 48 hours. This means operators sometimes work without sleep until the midway is up and running in the new town. Some companies, including Deggeller, depend heavily on seasonal migrant workers, hired by means of H-2B temporary work visas, to keep labor costs down. At the height of summer, there are some 5,000 migrant workers running midways across the country. Deggeller, like other operators, relies on a provision in the Fair Labor Standards Act (FLSA) that exempts companies from paying minimum wage or overtime to seasonal workers. The heavily foreign carnival workforce has little fluency in English and little knowledge of their rights, and so safety and wage violations tend to go unreported, according to the law clinic report, which was based on interviews with workers in Maryland, Virginia and Mexico, and conducted in collaboration with the clinic’s client, Centro de los Derechos del Migrante, Inc., a nonprofit organization focused on improving the working conditions of migrant workers in the United States. Florida Legal Services (FLS), a nonprofit civil rights firm, filed two lawsuits against Deggeller in March 2013 on behalf of 19 Mexican migrant carnival workers. According to depositions and interviews with several of the plaintiffs, these workers believed they were contracted at about $300 a week for a 40-hour work week. Yet they often ended up working 70 to 80 hours a week, with no additional compensation. “It seemed like he didn’t understand English and looked very tired.\" Enrique Vasquez, from Tlapacoyan, Mexico, a town that provides Deggeller with much of its migrant workforce, was a plaintiff in the lawsuit. “I worked for seven seasons” for Deggeller, Vasquez said, operating rides at large state fairs in Virginia, Maryland and Florida, typically for six to eight months each season. On Fridays, Saturdays, and Sundays, he said, he would start work at 9 or 10 in the morning and work until 11 at night. By Sunday night, he said, he would be operating rides while completely exhausted. On the days Deggeller moved its rides to the next town, which required breaking down the rides at the end of a long shift, he said he would often work 40 to 50 hours in the space of three days. Earlier this year, FLS withdrew its wage violation claims and concluded that Deggeller Attractions, and the carnival industry in general, was in compliance with the law. According to Greg Schell, lead attorney on the suit, the FLSA exemption for seasonal workers means that “you can pay workers ten cents an hour if you choose,” he said. The lawsuit was dismissed earlier this year. Amusement ride accidents are on the rise But while long hours and low pay for carnival workers may be legal, these exhausted workers sometimes make mistakes. The Consumer Product Safety Commission, which tracks emergency room admissions, has documented a dramatic increase in amusement ride accidents over the past five years, data that includes both permanent amusement parks and traveling carnivals. The agency estimates 44,000 injuries on amusement rides in 2012, up from nearly 30,000 in 2007. (These annual estimates are generated by CPSC based on samples of carnival accident reports from patients at 96 hospital emergency rooms in the U.S.) According to Saferparks.org, a private watchdog organization that until 2009 compiled data on amusement ride injuries, park patrons are to blame for most of these injuries, for failing to abide by safety regulations, but equipment failure and operator error are responsible for as many as 30 percent of the accidents. At the Salem Fair on that Fourth of July weekend three years ago, George Roseberry was sitting in the first seat of the Riptide coaster with his girlfriend Brittney Simms, directly in front of Samantha Goad and her friend. He recalls shouting repeatedly to the operator to stop the second coaster as it barreled toward them down the tracks, but the operator didn’t even seem to hear them. “I knew we were about to get hit really hard,” Roseberry says. “All I could do was close my eyes. I don't remember anything after that.” Roseberry said he was knocked out by the impact of the second coaster slamming into them; Goad felt a sharp pain in her head and back as she was thrown forward. After that, Goad says, it was all a blur. She recalls medical technicians placing her head and back in restraints and lifting her onto a gurney and into an ambulance. The following day in the hospital she learned that she had suffered severe whiplash and a cervical spine injury. Her softball career was over. Five others were hurt in the collision, according to three separate lawsuits filed by Goad, Simms and Roseberry, a truck driver, who said he now lives with such severe back pain that he has been unable to find steady work and has at times had to live on disability. The suits, filed against Deggeller Attractions, were settled out of court in May (Goad received $50,000, Simms $60,000 and Roseberry an undisclosed amount, according to the plaintiff's attorney.) A countersuit by Deggeller against Roseberry, claiming he caused the accident when his hat flew off his head and became lodged in the tracks, was dismissed in July. “I knew we were about to get hit really hard.” The Riptide operator was a seasonal worker from Mexico who failed to notice the stalled car, said plaintiff’s attorney, John Edwards. In an interview, Roseberry said, “It seemed like he didn’t understand English and looked very tired. I’m sure he had a long day, he just didn’t seem to be paying attention to anything.” Roseberry said most of the rides were already shutting down when he boarded the Riptide that evening. The lawsuits allege that fatigue was a decisive factor in the operator’s failure to stop the second coaster– or even notice the passengers shouting from the stuck one in front. In a deposition, the operator said he had worked long days all weekend, according to Edwards. The accident took place just before 11 p.m. on Sunday, when he was at the end of long shift. Vasquez, the former carnival worker, said he’d never been involved in an accident himself but said that in his experience, Deggeller did not always put safety first. He recounted an incident from a few seasons ago, when he was working for Deggeller at the Maryland State Fair and injured his leg riding a bicycle. He went to a nearby clinic, he said, where a doctor told him he had torn a ligament and prescribed him an anti-inflammatory. He says the doctor instructed him to rest the leg and said that he should not operate machinery while he was taking the medication. But Vasquez said that his supervisor assigned him to operate a carnival ride the next day, despite being aware of his injury and the narcotic effects of the medication. Seasonal workers usually return every year Deggeller referred interview requests to an attorney, Wayne Pierce, who said he was unaware of Vasquez’s injury and would not comment on that particular incident. “The Deggellers run a very good, very well-respected, small family business,” he said. “You don’t get to where they are by treating your employees poorly.” Deggeller provides several benefits for workers, Pierce said, such as covering workers’ transportation costs from their home country to the United States and providing workers with temporary housing in mobile trailers ($60 per week is deducted from workers' paychecks to partially reimburse the company for rent.) Deggeller also pays for workers’ medical visits and for their travel to stores or laundromats, he said. According to Pierce, “80 or 90 percent” of Deggeller’s seasonal workers “come back year after year…and therefore there’s a very strong basis that these folks know what their job entails, and they like it. So the likelihood that any individual was not aware of what they were getting into is very small.” In responding to workers’ claims about lengthy work weeks, he pointed to the seasonal nature of the carnival business, which is busier in summer and quieter during the shoulder seasons. “For them to take the position … that they were regularly working 60 or 80 hours-that’s not the way the season works,” Pierce said. “If you took the entire season and averaged it out, it’s probably going to be over 40 [hour weeks]. I wouldn’t be surprised if it was 45 or possibly a little bit more than that on a seasonal basis.” Workers are paid a set amount, Pierce said, whether they work more or fewer than 40 hours in any given week. Meanwhile, FLS continues to attempt to build a legal case against Deggeller. In May 2014, the group filed a new lawsuit in Arkansas, claiming the company violated state law by not paying the foreign workers minimum wage. In a motion to dismiss the lawsuit, Deggeller argued that the minimum wage complaint is preempted by the FLSA. The lawsuit also accuses Deggeller of tax fraud and breach of contract. According to court documents, Deggeller refutes all claims made but did not respond to requests for comment on the Arkansas suit. The case is still pending. “You don’t get to where [the Deggellers] are by treating your employees poorly.” With the future of his legal efforts against Deggeller uncertain, Schell insists that something needs to be done to make carnivals safer -- for workers and the general public. Carnivals are a low profit-margin business, he said. “There’s a great incentive to cut corners on safety. The workers will say, without exception, they have no training on how to properly operate the Octopus ride, for example. So you better hope it doesn’t spin out of control,” Schell said. “There’s a safety issue here in addition to the concern about just people not being treated as we would like people to be treated under our wage laws.” Meanwhile, Goad, the former softball star, is now 19 and attends Ferrum College in Virginia. She said she still suffers from neck and back pain and has difficulty sleeping, and doctors have told her she might be dealing with the painful effects of her roller coaster injury for the rest of her life. After going to the Salem Fair every summer since she was eight years old, she hasn’t returned since the accident. “I’ll never ride another roller coaster again,” she said. This story was reported in partnership with The Investigative Fund at The Nation Institute, where John Carlos Frey is a reporting fellow. About Contact Help Careers Ad Choices Privacy Policy Your Privacy Choices CA Notice Terms of Service (Updated JULY 7, 2023) NBC News Sitemap Closed Captioning Advertise Select Shopping © 2025 NBCUniversal Media, LLC NBC News Logo MSNBC Logo Today Logo"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    }
  ]
}