{
  "fuentes": [
    {
      "url": "https://www.atlanticavemagazine.com/the-delray-beach-club-reimagined/",
      "email": "droberts@thedelraybeachclub.com"
    },
    {
      "url": "https://www.atlanticavemagazine.com/the-delray-beach-club-reimagined/",
      "email": "info@atlanticavemagazine.com"
    },
    {
      "url": "https://www.atlanticavemagazine.com/the-delray-beach-club-reimagined/",
      "email": "info@atlanticavemagazine.com.com"
    },
    {
      "url": "https://www.seagatedelray.com/beachclub",
      "email": "info@seagatedelray.com"
    },
    {
      "url": "https://www.seagatedelray.com/beachclub",
      "email": "membershipsales@seagatedelray.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "email": "bryan@jcdsportsgroup.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "email": "mildnerj@mydelraybeach.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/delray-beach-club/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://www.linkedin.com/company/delray-beach-club",
      "email": "careers@thedelraybeachclub.com"
    },
    {
      "url": "https://www.linkedin.com/company/delray-beach-club",
      "email": "droberts@thedelraybeachclub.com"
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "email": "cmaoffice@countrymanors.net"
    },
    {
      "url": "https://delraybeach.com/membership/chairmans-club/",
      "email": "fcb-logo-horiz-web-2020@2x.png.transform"
    },
    {
      "url": "https://www.delraylibrary.org/contact/",
      "email": "reference@delraylibrary.org"
    }
  ],
  "mails": [
    "bryan@jcdsportsgroup.com",
    "careers@thedelraybeachclub.com",
    "cmaoffice@countrymanors.net",
    "droberts@thedelraybeachclub.com",
    "fcb-logo-horiz-web-2020@2x.png.transform",
    "info@atlanticavemagazine.com",
    "info@atlanticavemagazine.com.com",
    "info@bocaratonobserver.com",
    "info@seagatedelray.com",
    "membershipsales@seagatedelray.com",
    "mildnerj@mydelraybeach.com",
    "reference@delraylibrary.org"
  ],
  "nombre_sitio": "delraybeachclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.atlanticavemagazine.com/the-delray-beach-club-reimagined/",
      "text": "THE DELRAY BEACH CLUB: Reimagined - atlanticavemagazine.com Home Locals Only City People Health Issues Ad Specs & Sizes Pickup Locations Search 80 F Delray Beach Thursday, September 11, 2025 Facebook Instagram Twitter Vimeo Youtube Home Locals Only Locals Only Posh Welcomes New Member Locals Only The Morikami Museum and Japanese Gardens Presents Light as Air: The Buoyant Sculptures of Mariko Kusumoto Locals Only Delray Citizens for Delray Police Awards 15 College Scholarships Locals Only JARC Florida to Celebrate Topping Off of New Caryn J.Clayman Life Skills Center in Boca Raton Locals Only Achievement Centers for Children & Families (ACCF) to Hold 14th Annual Witches of Delray Beach Bike Ride City People City People Doing, Supporting, Giving – How Do We Count The Ways City People Ewa Maas: Changing Young People’s Lives One at a Time City People Angela Burns: A Woman of Goodness, Graciousness and Guidance For All City People Rob Long: A Legacy of Public Service And Commitment To Humanity City People Corey Heyman: Sunshine Spreader and Miracle Worker Health Health All Health TV Issues Issues September 2025 Issues August 2025 Issues July 2025 Issues June 2025 Issues May 2025 Ad Specs & Sizes Pickup Locations Search Home Locals Only Locals Only Posh Welcomes New Member Locals Only The Morikami Museum and Japanese Gardens Presents Light as Air: The Buoyant Sculptures of Mariko Kusumoto Locals Only Delray Citizens for Delray Police Awards 15 College Scholarships Locals Only JARC Florida to Celebrate Topping Off of New Caryn J.Clayman Life Skills Center in Boca Raton Locals Only Achievement Centers for Children & Families (ACCF) to Hold 14th Annual Witches of Delray Beach Bike Ride City People City People Doing, Supporting, Giving – How Do We Count The Ways City People Ewa Maas: Changing Young People’s Lives One at a Time City People Angela Burns: A Woman of Goodness, Graciousness and Guidance For All City People Rob Long: A Legacy of Public Service And Commitment To Humanity City People Corey Heyman: Sunshine Spreader and Miracle Worker Health Health All Health TV Issues Issues September 2025 Issues August 2025 Issues July 2025 Issues June 2025 Issues May 2025 Ad Specs & Sizes Pickup Locations Search Home Featured THE DELRAY BEACH CLUB: Reimagined By Diane Feen April 1, 2025 Facebook Twitter Pinterest WhatsApp A refreshed coastal retreat awaits. The Delray Beach Club has unveiled its stunning renovation, reimagining the member experience with elevated amenities, refined dining, and an invigorated social scene—all set against the backdrop of 3.5 acres of pristine oceanfront. Designed for those who seek the perfect balance of leisure and activity, the club’s refreshed ambiance effortlessly integrates indoor and outdoor spaces. Whether basking in the serenity of the oceanfront pool, embracing high-energy tennis and fitness programs, or indulging in premiere coastal dining, every moment is crafted to inspire. CULINARY EXCELLENCE & ELEVATED EXPERIENCES With a redefined culinary program, members can indulge in a variety of dining experiences— from a relaxed, coastal-inspired casual gatherings and sunset dinners in REEF, to an elegant fine dining experience with oceanfront views, gourmet dishes, and expertly paired wines in BLEU. And our lively outdoor dining space, featuring casual bites, refreshing drinks, and a vibrant social atmosphere at HIGH TIDES. At the helm of this exciting evolution is our new Executive Chef, David Morales, whose expertise and creativity bring a fresh perspective to our kitchens. Under his leadership, our dining venues offer elevated menus, innovative flavors, and a commitment to exceptional quality that enhances every meal. Beyond dining, the Delray Beach Club is a place where families create lasting memories. Members can enjoy an exciting calendar of events designed for all ages, from festive holiday celebrations, family fun days, and kids’ activities to engaging wine tastings, chef showcases, and lively poolside parties. Whether savoring a fine dining experience, gathering for a casual meal, or enjoying a fun-filled family day by the ocean, the Delray Beach Club provides the perfect setting for connection, entertainment, and coastal sophistication. A NEW ERA, A NEW VISION At the heart of this transformation is an extraordinary team, led by a dynamic new General Manager, Tracy Bradbury. With a fresh perspective and a passion for excellence, Tracy and the dedicated team are committed to delivering an unparalleled club experience—where tradition meets innovation, and every detail is crafted with our members in mind. “The new Delray Beach Club is more than a renovation—it’s a transformation of the member experience,” says Tracy Bradbury, General Manager. “With a commitment to both tradition and innovation, we are setting a new benchmark in coastal luxury, ensuring that every aspect of club life reflects our commitment to excellence.” Board President Mr. Tripp Rea echoes this excitement, stating, “The transformation of our Club is complete. A new facility, five-star oceanside dining, exciting new events, and an expansion of our family-oriented programming provides an experience for everyone. We are excited to welcome our Summer Members to the Beach Club Experience.” With refreshing breezes, an enhanced member experience, and a forward-thinking vision, the Delray Beach Club is where ocean views and elegance meet to form a premier seaside escape. ACTIVE LIVING AT THE DELRAY BEACH CLUB At The Delray Beach Club, staying active is part of the lifestyle, with premier tennis, fitness, and beachside amenities designed for both recreation and relaxation. Tennis enthusiasts can enjoy professional instruction, and programs for all skill levels, from private lessons to social matches. Fitness and wellness offerings include a redesigned fitness center, group classes, and personalized training for a well-rounded approach to health. Meanwhile, the beach concierge team ensures effortless oceanfront enjoyment, from lounge chair and umbrella service to refreshing cocktails delivered right to the sand. Whether you’re perfecting your serve, strengthening your body, or simply unwinding by the water, The Delray Beach Club offers a balanced, active lifestyle in a breathtaking coastal setting. A COASTAL EXPERIENCE FOR THE WHOLE FAMILY Life at The Delray Beach Club is about more than just a beautiful location—it’s about the moments shared, the traditions built, and the effortless joy of days spent by the ocean with family and friends. Whether its kids splashing in the pool, members enjoying a friendly match on the courts, or taking in a breathtaking sunset over dinner, every experience here is designed to bring generations together in a setting that feels like home. As we embrace this exciting new chapter, we look forward to welcoming familiar faces and new friends alike. The Delray Beach Club is more than a destination—it’s a coastal lifestyle for the whole family, and there’s never been a better time to be part of it. A limited number of summer memberships are still available for May 2025 – October 2025. The Club is also accepting members onto the waitlist for full-time membership. For more details contact Diane Roberts, DBC Membership Director, at droberts@thedelraybeachclub.com or call 561-278-6226. THE DELRAY BEACH CLUB 2001 S. Ocean Blvd. Delray Beach, FL 561-278-6226 delraybeachclub.com Share Facebook Twitter Pinterest WhatsApp Previous article 2025 Delray Beach Open Serves Up One for the Record Books! Next article South Florida’s Go-To For Any Occasion Diane Feen Related Articles Locals Only Posh Welcomes New Member Locals Only The Morikami Museum and Japanese Gardens Presents Light as Air: The Buoyant Sculptures of Mariko Kusumoto Locals Only Delray Citizens for Delray Police Awards 15 College Scholarships LEAVE A REPLY Cancel reply Comment: Please enter your comment! Name:* Please enter your name here Email:* You have entered an incorrect email address! Please enter your email address here Website: Save my name, email, and website in this browser for the next time I comment. Latest Articles Featured The Illlustrious Seagate Hotel Featured A ROLLING FESTIVAL: My First RAGBRAI Adventure Featured DELRAY BEACH PLAYHOUSE: Cultural Enlightenment Featured Life at its Finest On and Off the Court Featured THE PREMIER GROUP AT COMPASS: Alex Platt and Geoff Braboy Launch Grove Estates in Downtown Delray Beach Load more Whether it is what to do, where to eat or what to wear, Atlantic Ave Magazine has it all!\n\nAtlantic Ave Magazine is a home grown publication packed with local information serving residents, visitors and the business community.\n\nThe people of Delray Beach are the real owners of this magazine and they are an integral part of it's success.\n\nEvery month you can read about the people, events and happenings that make this city a vibrant and special place. Contact us info@atlanticavemagazine.com 335 East Linton Blvd. B14-832090 Delray Beach, FL 33483 Ph. 888-309-1110 Facebook © Copyright - Atlantic Ave Magazine"
    },
    {
      "url": "https://www.seagatedelray.com/beachclub",
      "text": "Delray Beach Club | Private Beach | The Seagate Hotel & Spa skip to main content 561-665-4800 Best Rate Guarantee Members Sign in Book Now Rooms & Suites Amenities Offers Dining Spa Experiences Events Beach Club Golf Club Golf Course Racquets Wellness Membership THE SEAGATE BEACH CLUB THE SEAGATE BEACH CLUB Indulge in a selection of light bites, bowls, and handheld favorites while you soak up the sun by The Seagate Beach Club pool, the perfect spot for a coastal escape. Beach Club Privileges Oceanview Dining Direct Beach Access Saltwater Swimming Pool Complimentary Valet Parking Towel Service, Chairs & Umbrellas Delray Beach Water Sports Rentals Poolside Bar Poolside & Beachside Beverage Service THE SEAGATE BEACH CLUB Savor refreshing drinks and beachside cocktails with our poolside and beachside cocktail service at The Seagate Beach Club, making it easy to relax without missing a moment of sun. BEACHSIDE BEVERAGE SERVICE: Daily, 11:30am - 5:00pm POOLSIDE ATTENDANT: Daily, 11:30am - 5:00pm POOL BAR: Daily, 11:30am - 5:00pm View Drink Menu | View Food Menu MR. SEAS Mr. Seas is a vibrant beachside restaurant known for its bold flavors, refreshing cocktails, and exceptional service, offering the perfect setting to enjoy a relaxed yet unforgettable dining experience by the sea. MR. SEAS LUNCH Daily, 11:30 am - 2:00 pm View Menu MR. SEAS HAPPY HOUR Daily, 4:00 pm - 6:00 pm View Menu MR. SEAS DINNER Daily , 5:00 pm - 8:00 pm View Menu Dinner service ends at 8:00 pm, with drinks served until 9:00 pm. Contact the concierge to make a dinner reservation at (561) 665-4800 . MEMBERSHIP Seize the sun, surf, and exclusivity with a Seagate Beach Club membership. Dive into a world tailored just for you. Click here or email membershipsales@seagatedelray.com for more information. Hotel Pool Bar - Drinks SIGNATURE COCKTAILS APEROL SPRITZ $ 18.00 Aperol, St-Germain, Prosecco, Orange Juice VAMPIRE $ 18.00 Corazón Tequila or Mezcal, House Bloody Mary Mix, Tajín, Lime BLACKBERRY MARGARITA $ 18.00 Corazón Tequila, Muddled Blackberries Agave, Lime SPICY MEZCAL PALOMA $ 18.00 Empress Gin, Limoncello, Prosecco, Lemon Juice, Soda THE 1908 $ 18.00 Empress Gin, Limoncello, Prosecco, Lemon Juice, Soda BLENDED COCKTAILS MANGO MOJITO $ 18.00 Myers Platinum Rum, Mango Purée, Mint Lime Juice STRAWBERRY COLADA $ 18.00 Myers Platinum Rum, Strawberry, Coconut Pineapple FROSE $ 18.00 Hampton Water Rosé, Wheatley Vodka, Fresh Raspberries BERRY LEMONADE $ 18.00 Wheatley Vodka, Lemonade, Fresh Berries MUDSLIDE $ 18.00 Wheatley Vodka, Baileys, Kahlúa, Ice Cream Chocolate Add a Floater +$4 COCONUTS THE 'SG' COLADA $ 25.00 Myers Platinum Rum, Coconut Water Pineapple Juice, Myers Dark Rum Float UNDER THE PALMS $ 30.00 Casa Amigos Blanco Tequila, Coconut Water Pineapple Juice, Lime, Agave BEER & SELTZERS BEERS $ 9.00 Michelob Ultra Modelo Bud Light Corona Corona Light Corona Non-Alcoholic Stella Artois Local Selection SELTZERS $ 9.00 High Noon Vodka Seltzer High Noon Tequila Seltzer WINES BY THE GLASS SPARKLING Ruffino Prosecco, Italy 14/56 Moet Chandon Brut Imperial Split 26 Domaine Chandon Brut Rosé Split 22 ROSÉ Hampton Water, France 15/60 Whispering Angel, France 18/72 RIESLING Willamette Valley Vineyards, OR 14/56 PINOT GRIGIO Ruffino “Lumina”, Italy 14/56 Santa Margherita, Italy 18/72 SAUVIGNON BLANC Kim Crawford, New Zealand 14/56 CHARDONNAY Flowers, Sonoma Coast, CA 19/76 Chalk Hill, Russian River, CA 15/60 NON-ALCOHOLIC REFRESHMENTS LEMONADE $ 5.00 ICED TEA $ 5.00 RED BULL $ 6.00 SODA $ 5.00 FIJI WATER 500ml $ 5.00 FIJI WATER 1L $ 8.00 SAN PELLEGRINO 1L $ 8.00 Hotel Pool Bar - Food SNACKS CHIPS & DIP $ 18.00 house made guacamole & hummus, zesty corn chips, grilled pita, crudité JOYCE FARMS CHICKEN WINGS $ 19.00 (GF) buffalo sauce, blue cheese ranch, crudité TRUFFLE FRIES $ 9.00 (GF) lemon aioli CRISPY CALAMARI $ 22.00 buttermilk marinade, cajun aioli, charred lemon SHRIMP COCKTAIL $ 21.00 (GF) spiked cocktail sauce, lemon SALADS ITALIAN CHOPPED $ 19.00 (GF) chopped romaine, pepperonicini , aged salami, marinated chickpeas, creamy red wine vinaigrette CAESAR $ 18.00 baby gem lettuce, anchovy dressing, garlic croutons Add Grilled Chicken +10  |  Add Grilled Shrimp +12 GRILLED CHICKEN COBB $ 24.00 iceberg, grilled chicken, danish blue cheese tomato, avocado, bacon, egg, ranch HANDHELDS included fries WAGYU STEAK SANDWICH* $ 28.00 wagyu skirt steak, garlic ciabatta, fontina, horseradish aioli THE SEAGATE SMASH BURGER* $ 19.00 double patty, american cheese, bacon onion sauce BLT $ 18.00 Thick Cut Bacon, Bibb Lettuce, Roma Tomato, White Toast, Fries CURRIED CHICKEN SALAD WRAP $ 18.00 Mango Chutney, Toasted Curry Aioli, Golden Raisins, Slivered Almonds, Bibb Lettuce, Wheat Wrap, Fries KOREAN BBQ SALAD SANDWICH $ 25.00 Purple Cabbage Slaw, Pickled Cucumber, Brioche, Fries KIDS FRIED CHICKEN TENDERS $ 14.00 GRILLED CHICKEN BREAST $ 14.00 GRILLED HAMBUGER OR CHEESEBURGER $ 14.00 BUTTERED PASTA $ 14.00 SWEET SEASONAL GELATO OR SORBET SCOOP $ 6.00 vanilla, chocolate ICE CREAM SANDWICH $ 8.00 housemade cookies JUMBO COOKIE $ 5.00 Chocolate Chip, Oatmeal Raisin, White Chocolate Macadamia ACAI BOWL $ 12.00 Fresh Seasonal Fruit, Housemade Granola, Local Honey Hotel Pool Bar Drink Menu Hotel Pool Bar Food Menu The Gate Café Beverages COFFEE ADD A SHOT OF ESPRESSO      $2 ADD A FLAVORED SYRUP          $1 ESPRESSO single $4 | double $6 BREWED COFFEE $ 5.00 ICED COFFEE $ 5.00 COLD BREW $ 6.00 MATCHA LATTE $ 7.00 hot or cold, with choice of milk CAFFÉ MACCHIATO $ 5.00 espresso with warm, frothy milk CORTADO $ 5.00 espresso with warm milk CAPPUCCINO $ 6.00 espresso blended with warm, frothy milk CAFFÉ LATTE $ 6.00 espresso mixed with hot milk and finished with a layer of froth CAFFÉ MOCHA $ 6.00 espresso blended with chocolate and steamed milk TEA CHAI TEA LATTE $ 7.00 hot or cold, with your choice of milk HOT TEA $ 5.00 art of tea – earl grey crème, english breakfast, french lemon ginger, egyptian chamomile, mint green, seasonal ICED TEA $ 5.00 SMOOTHIES SUPER GREENS SMOOTHIE $ 10.00 organic spinach, kale, cucumber, ginger, celery, pineapple VITAMIN SEA SMOOTHIE $ 10.00 knaus berry farm strawberry, blueberry, pineapple, orange FLORIDA TROPICAL SMOOTHIE $ 10.00 pineapple, mango, coconut water MEP COLD-PRESSED JUICES PINEAPPLE $ 10.00 BEET $ 10.00 GREEN $ 10.00 ORANGE $ 10.00 LOCAL CRAFT BEER AND SELTZERS $9 BOTTLE & CAN REFRESHMENTS WATER $ 8.00 1 liter fiji | san pellegrino SODA $ 5.00 SIMPLY LEMONADE $ 5.00 RED BULL $ 6.00 The Venetian Street Hotel Bar SIGNATURE COCKTAILS SOUTHERN COLADA $ 18.00 jameson orange, giffard coconut, pineapple juice, lemon juice, buffalo trace AMALFI LAVENDER SPRITZ $ 18.00 malfy limon gin, lavender mint syrup, lemon juice, prosecco SMOKIN' PINEAPPLE $ 18.00 fresno-infused corazon tequila, pineapple juice, lime juice, agave, black salt BEACHSIDE BONFIRE $ 18.00 hibiscus cardamom, mezcal. green chartreuse, st-germain, lime THE FASHIONABLE PALM $ 18.00 orange coconut buffalo trace bourbon, demaura, bitters GREEN THUMB SOUR $ 18.00 cucumber lime svedka, lemon juice, rose simple, egg white GOLDEN TIDE $ 18.00 myers's platinum goslings black, passionfruit, coconut, lime, coconut lime salt foam ORANGE HAZELNUT ESPRESSO MARTINI $ 18.00 vanilla vodka, frangelico, kahlua, espresso, demura, orange bitters, orange zest SNACKS TRUFFLE FRIES $ 9.00 (GF0 lemon aioli JOYCE FARMS CHICKEN WINGS $ 19.00 (GF) buffalo sauce, blue cheese ranch, crudité CHIPS & DIP $ 18.00 house made guacamole & hummus, zesty corn chips, grilled pita, crudité CRISPY CALAMARI $ 22.00 (GF) buttermilk marinade, cajun aioli, charred lemon GRILLED SPANISH OCTOPUS $ 26.00 (GF) romesco sauce, crispy garbanzo beans, castelvetrano olives, roasted red pepper SALUMI $ 25.00 (GF) pistachio mortadella, salami, prosciutto, honey, manchego, rosemary focaccia crisp MARGHERITA FLATBREAD $ 18.00 savory tomato jam, stracciatella, guanciale, arugula, pickled onions SALADS add grilled chicken $10 | grilled shrimp $12 | grilled salmon $14 CAESAR $ 18.00 baby gem lettuce, anchovy dressing, garlic croutons BURRATA CAPRESE $ 21.00 local heirloom tomatoes, garden basil, 18-year-old balsamic ITALIAN CHOPPED $ 19.00 (GF) chopped romaine, pepperonicini , aged salami, marinated chickpeas, creamy red wine vinaigrette HANDHELDS included fries THE SEAGATE SMASH BURGER* $ 19.00 double patty, american cheese, bacon onion sauce GRILLED CHICKEN SANDWICH $ 19.00 toasted ciabatta, fresh mozzarella, fresh basil, romesco WAGYU STEAK SANDWICH* $ 28.00 wagyu skirt steak, garlic ciabatta, fontina, horseradish aioli TURKEY CLUB $ 19.00 turkey, bibb lettuce, roma tomato, swiss cheese, bacon, avocado aioli ENTREES RIGATONI ‘ALLA VODKA’ $ 23.00 san marzano tomato, italian burrata, fresh basil GRILLED BRANZINO* $ 36.00 (GF) grilled broccolini, italian capers, brown butter, fresh parsley STEAK FRITES* $ 44.00 (GF) wagyu skirt steak, chimichurri, truffle fries VERLASSO SALMON* $ 34.00 (GF) shaved fennel, baby zucchini, meyer lemon vinaigrette JOYCE FARMS CHICKEN PAILLARD $ 32.00 (GF) arugula, sweet drop red peppers, citrus segments, shaved parmesan, lemon vinaigrette DESSERT CHOCOLATE BLACKOUT CAKE $ 14.00 dark chocolate cake, house Madde chocolate pudding, chocolate frosting, berry compote CROISSANT BREAD PUDDING $ 14.00 warm apple and apricot pudding, vanilla bean rum custard, vanilla gelato NY STYLE CHEESECAKE $ 14.00 vanilla bean whipped cream, roasted strawberries SEASONAL GELATO OR SORBET SCOOP $ 6.00 vanilla, chocolate The Gate Café Menu 7am - 11am BREAKFAST 7 AM to 11 AM OATMEAL $ 12.00 BERRY Blueberries, Pomegranate Seeds, Toasted Coconut, Meyer Lemon Sugar CHOCOLATE White Chocolate, Pistachio, Candied Orange Peel SUNRISE BREAKFAST $ 24.00 Two eggs any style, herb tater tots, English muffin, choice of bacon or sausage THE GATE OMELET $ 21.00 Mushroom, organic kale, fontina cheese, herb tater tots AVOCADO TOAST $ 19.00 Poached egg, pickled shallots, arugula, fontina cheese BACON EGG & CHEESE WRAP $ 12.00 American cheese, bacon, spinach wrap SPINACH WRAP $ 12.00 Scrambled egg whites, spinach, roma tomatoes, spinach wrap EGGS BENEDICT $ 24.00 poached eggs, english muffin, canadian bacon, spinach, herb tater tots WAFFLES $ 16.00 fresh berries, whipped cream PANINIS 7am - 4pm ITALIAN CAPRESE $ 16.00 Mozzarella, heirloom tomato, garden basil, pesto, aged balsamic ROAST TURKEY BREAST $ 16.00 Smoked Cheddar, berry jam, tarragon aioli, arugula SIDES FENNEL CHICKEN SAUSAGE $ 9.00 BACON $ 8.00 PORK SAUSAGE $ 8.00 PARMESAN FINE HERB TATER TOTS $ 8.00 Mr. Seas Happy Hour BITES MEDITERRANEAN HUMMUS DIP $ 12.00 Carrots, Celery, Watermelon Radish, Cucumber, Pita Chips TUNA TARTARE* $ 12.00 Ahi Tuna, Citrus Soy, Avocado, Sesame Seed, Served on Rice Crackers BLACKENED SPICED CALAMARI $ 12.00 Charred Lemon Aioli, Micro Parsley BUFFALO CHICKEN WINGS* $ 12.00 Buttermilk Dressing, Carrot and Celery Crudite SNAPPER CEVICHE $ 12.00 (GF) Citrus Juice, Onion, Peppers, Cilantro, Served with Housemade Chips MR. SEAS QUARTER POUND BURGER* $ 12.00 Wagyu Beef Patty, House Bacon Aioli, American Cheese, Lettuce, Tomato, Onion DRINKS LIQUORS $ 9.00 WHEATLEY VODKA BOMBAY GIN MYERS PLATINUM RUM CORAZON TEQUILA BENCHMARK BOURBON DEWARS SCOTCH WINES $ 7.00 RUFFINO PROSECCO RUFFINO PINOT GRIGIO KIM CRAWFORD SAUVIGNON BLANC ROBERT MONDAVI CHARDONNAY KIM CRAWFORD ROSE MEIOMI PINOT NOIR ROBERT MONDAVI CABERNET SAUVIGNON BEER + SELTZERS $ 5.00 LOCAL CIGAR CITY JAI ALAI IPA | FUNKY BUDDHA FLORIDIAN HEFEWEIZEN DOMESTIC BUD LIGHT | MICHELOB ULTRA IMPORT CORONA CORONA LIGHT STELLA MODELO CORONA NON-ALCOHOLIC HIGH NOON $ 5.00 VODKA WATERMELON | PINEAPPLE MANGO | PASSIONFRUIT TEQUILA STRAWBERRY | LIME GRAPEFRUIT | PASSIONFRUIT Mr. Seas Brunch SHAREABLES MEDITERRANEAN HUMMUS DIP $ 14.00 carrots, celery, radish, cucumber, grilled pita JOYCE FARMS CHICKEN WINGS $ 19.00 (GF) buttermilk dressing, ranch, crudite CRISPY CALAMARI $ 22.00 charred lemon aioli, micro parsley GULF SHRIMP COCKTAIL* $ 21.00 (GF) spiked cocktail sauce, horseradish OYSTERS ON THE HALF SHELL* $ 4.00 (S) (GF) mignonette, horseradish, tabasco AHI TUNA POKE BOWL* $ 21.00 sesame, edamame, spiced macadamia nuts, rice, crispy shallot BRUNCH GREEK YOGURT PARFAIT $ 14.00 flax seed granola, local honey, berries CLASSIC EGGS BENEDICT $ 18.00 poached egg, smoked ham, sautéed spinach, hollandaise, side salad add jumbo lump crab $12  |  smoked salmon $6 SHAKSHUKA $ 24.00 spicy tomato and pepper stew, egg, grilled sourdough AVOCADO TOAST $ 21.00 smashed avocado, grilled sourdough, poached egg, espelette WALNUT BANANA CARAMEL WAFFLE $ 18.00 toasted walnut, organic strawberries, citrus caramel GOAT CHEESE QUICHE $ 18.00 caramelized onion, baby spinach, truffle vinaigrette SALADS LOBSTER COBB $ 26.00 (GF) crisp iceberg, candied bacon, boiled egg, avocado, tomato, blue cheese crumble, buttermilk ranch MR. SEAS-AR $ 18.00 crisp romaine, garlic focaccia croutons, house-made caesar dressing add grilled chicken $10.00  |  grilled shrimp $12.00 |  grilled salmon $12.00 ASIAN CHICKEN $ 22.00 crunchy lettuce, shredded carrots, spiced macadamia nuts, crispy onion, cucumber, toasted sesame, ginger-sesame dressing WATERMELON TOMATO $ 18.00 (GF) charred cucumber, pistachio, crumbled feta, white balsamic vinaigrette SIGNATURE HANDHELDS served with french fries & pickle spear TURKEY CLUB $ 19.00 turkey, bacon, bibb lettuce, roma tomatoes, swiss cheese, avocado aioli, toasted multigrain BLACKENED SNAPPER SANDWICH $ 21.00 tropical coleslaw, lettuce, tomato, tartar sauce, toasted brioche LOBSTER ROLL $ 26.00 maine lobster, young celery, toasted brioche WAGYU SMASH BURGER* $ 19.00 double patty, american cheese, bacon onion sauce, toasted brioche TUNA SALAD WRAP $ 18.00 red onion, lettuce, tomato, spinach wrap BLACKENED MAHI TACOS $ 19.00 pineapple cabbage slaw, avocado aioli, serrano, charred lime, flour tortilla HEBREW NATIONAL HOT DOG $ 16.00 caramelized onions, toasted brioche SIDES TRUFFLE PARMESAN FRIES (GF) $ 9.00 GARDEN SALAD (GF) $ 6.00 TROPICAL COLESLAW $ 8.00 (GF) FRUIT CUP (GF) $ 8.00 DESSERTS ROASTED PINEAPPLE $ 13.00 coconut sorbet, vanilla brown sugar streusel, rum caramel TURTLE SUNDAE $ 15.00 (GF) dark chocolate brownie, vanilla bean gelato, hot fudge, brown butter caramel sauce, candied pecans SEASONAL MINI DESSERT TOWER $ 18.00 key lime polvorones, coconut macadamia bars, brownie bites, NY style cheesecake GELATO/SORBET SCOOP $ 6.00 (GF) vanilla bean / chocolate / seasonal sorbet Mr. Seas Lunch SHAREABLES MEDITERRANEAN HUMMUS DIP $ 14.00 carrots, celery, radish, cucumber, grilled pita JOYCE FARMS CHICKEN WINGS $ 19.00 (GF) buttermilk dressing, ranch, crudite CRISPY CALAMARI $ 22.00 charred lemon aioli, micro parsley GULF SHRIMP COCKTAIL* $ 21.00 (GF) spiked cocktail sauce, horseradish OYSTERS ON THE HALF SHELL* $ 4.00 (S) (GF) mignonette, horseradish, tabasco AHI TUNA POKE BOWL* $ 21.00 sesame, edamame, spiced macadamia nuts, rice, crispy shallot SALADS LOBSTER COBB $ 26.00 (GF) crisp iceberg, candied bacon, boiled egg, avocado, tomato, blue cheese crumble, buttermilk ranch MR. SEAS-AR $ 18.00 crisp romaine, garlic focaccia croutons, house-made caesar dressing add grilled chicken $10.00  |  grilled shrimp $12.00 |  grilled salmon $12.00 ASIAN CHICKEN $ 22.00 crunchy lettuce, shredded carrots, spiced macadamia nuts, crispy onion, cucumber, toasted sesame, ginger-sesame dressing WATERMELON TOMATO $ 18.00 (GF) charred cucumber, pistachio, crumbled feta, white balsamic vinaigrette SIGNATURE HANDHELDS served with french fries & pickle spear TURKEY CLUB $ 19.00 turkey, bacon, bibb lettuce, roma tomatoes, swiss cheese, avocado aioli, toasted multigrain BLACKENED SNAPPER SANDWICH $ 21.00 tropical coleslaw, lettuce, tomato, tartar sauce, toasted brioche LOBSTER ROLL $ 26.00 maine lobster, young celery, toasted brioche WAGYU SMASH BURGER* $ 19.00 double patty, american cheese, bacon onion sauce, toasted brioche TUNA SALAD WRAP $ 18.00 red onion, lettuce, tomato, spinach wrap BLACKENED MAHI TACOS $ 19.00 pineapple cabbage slaw, avocado aioli, serrano, charred lime, flour tortilla HEBREW NATIONAL HOT DOG $ 16.00 caramelized onions, toasted brioche SIDES TRUFFLE PARMESAN FRIES (GF) $ 9.00 GARDEN SALAD (GF) $ 6.00 TROPICAL COLESLAW $ 8.00 (GF) FRUIT CUP (GF) $ 8.00 DESSERTS ROASTED PINEAPPLE $ 13.00 coconut sorbet, vanilla brown sugar streusel, rum caramel TURTLE SUNDAE $ 15.00 (GF) dark chocolate brownie, vanilla bean gelato, hot fudge, brown butter caramel sauce, candied pecans SEASONAL MINI DESSERT TOWER $ 18.00 key lime polvorones, coconut macadamia bars, brownie bites, NY style cheesecake GELATO/SORBET SCOOP $ 6.00 (GF) vanilla bean / chocolate / seasonal sorbet Beverage Cart SANDWICHES & SNACKS Sandwiches or Wraps | 14 Beef Jerky | 5 Assorted Chips | 4 Mixed Nuts | 5 Protein Bar | 5 1st or 10th Tee Bar | 5 Candy Bar | 5 BEERS & SELTZERS LOCAL | 8 Islamorada Citrus Ale Islamorada IPA DOMESTIC | 8 Bud Light Michelob Ultra IMPORT | 9 Corona Corona Light Stella Modelo SELTZERS | 9 Austin Cocktails Vodka - Ruby Red Grapefruit | Lime & Mint | Lime & Mint Mojito Austin Cocktails Tequila -  Bergamot Orange | Lime Margarita High Noon Vodka | High Noon Tequila WINE Ruffino Prosecco, Italy | 13 Matua Kiwi Sauvignon Blanc, NZ | 9 She Can Dry Rosé, CA | 10 She Can Crisp White, CA | 10 MIXED DRINKS COCKTAILS | 12 Wheatley Vodka Bombay Myers Platinum Rum Dewar’s Scotch Benchmark Bourbon SOFT DRINKS Large Fiji | 8 Gatorade | 5 Red Bull | 5 Lemonade | 4 Iced Tea | 4 Canned Soda | 4 19th Hole & Courtyard SALADS ADD A PROTEIN chicken * 12 |  shrimp * 12 |  steak* 15 GARDEN $ 13.00 Mixed Greens, Peppers, Onions, Tomatoes, Cucumbers, Carrots, Choice of Dressing CAESAR $ 13.00 Romaine, Shaved Parmesan, Garlic Croutons CHEF'S SALAD $ 14.00 Ham, Turkey, Shredded Cheddar, Cherry Tomatoes, Hard Boil Egg, Ranch Dressing HANDHELDS DELI SANDWICH Half 10 | Full 16 Turkey, Chicken Salad, Egg Salad, or Tuna Salad on Choice of Bread CLASSIC BLT $ 16.00 Bacon, Romaine Lettuce, Vine Ripened Tomato, Mayonnaise, White Toast TURKEY CLUB $ 18.00 Vine Ripened Tomatoes, Thick Bacon, Bibb Lettuce, Pesto Mayo, Multigrain TUNA MELT $ 16.00 Vine Ripened Tomatoes, Swiss Cheese, Thick Cut Seeded Rye FISH SANDWICH $ 21.00 Daily Catch, Olive Tapenade, Avocado, Lemon Aioli, Brioche Bun GRILLED CHEESE $ 16.00 White American, Million-Dollar Bacon, Griddled Tomatoes, Brioche Toast WINGS $ 18.00 Ranch, Carrots, Celery, Choice of Barbecue or Garlic Parmesan Sauces YOU PICK TWO $ 15.00 Choice of Half Deli Sandwich and Half Soup or Salad SIDES THICK CUT SWEET POTATO FRIES $ 8.00 FRENCH FRIES $ 8.00 FRUIT $ 5.00 KETTLE COOKED CHIPS $ 6.00 Ranch, Barbecue, Salt & Vinegar From The Grill 11 AM - 4 PM, Daily DAWGS HOT DOG $ 14.00 Ketchup, Mustard, Chopped Onions, Relish BRATWURST $ 14.00 Housemade Sauerkraut, 3 Mustard Aioli ITALIAN CHICKEN APPLE SAUSAGE $ 14.00 Peppers, Onions GRILLED CHICKEN SANDWICH $ 14.00 Sundried Tomatoes Aioli, Buffalo Mozzarella, Fresh Basil SMASH BURGER single 14 | double 18 4 Oz Patty With Housemade Remoulade Pickles, Cheddar Cheese KABOBS Served with grilled pita and a small side salad BEERS & SELTZERS $ 5.00 Local Islamorada Citrus Ale | Islamorada IPA Domestic Bud Light | Michelob Ultra Import Corona | Corona Light | Stella | Modelo Modelo Negro | Becks Non-Alcoholic | Matua Kiwi Sauvignon Blanc High Noon Vodka Watermelon | Pineapple Mango | Passionfruit Tequila Strawberry | Lime Grapefruit | Passionfruit YOGURT MARINATED CHICKEN $ 16.00 WAGYU FLANK STEAK WITH CHIMICHURRI $ 18.00 FLATBREADS WHITE FLAT BREAD $ 15.00 Confit Garlic, Herbed Ricotta, Spinach MARGARITA $ 15.00 Tomatoes Sauce, Mozzarella Cheese Blend, Garlic, Herbs Mr. Seas Dinner SHAREABLES CRISPY CALAMARI $ 22.00 charred lemon aioli, micro parsley MEDITERRANEAN HUMMUS $ 14.00 carrots, celery, radish, cucumber, grilled pita GULF SHRIMP COCKTAIL $ 21.00 (GF) spiked cocktail sauce, horseradish JOYCE FARMS CHICKEN WINGS $ 19.00 (GF) buttermilk dressing, ranch, crudité OYSTERS ON THE HALF SHELL $ 4.00 (S) (GF) mignonette, horseradish, tabasco TUNA TARTARE $ 21.00 yellowfin tuna, fresh avocado, yuzu aioli, ginger soy ponzu, rice cracker JUMBO LUMP CRAB CAKE $ 24.00 meyer lemon, celery, potato crisp SALADS ADD A PROTEIN chicken * 10 | shrimp * 12 | salmon * 12 WATERMELON TOMATO $ 18.00 (GF) charred cucumber, pistachio, crumbled feta, white balsamic vinaigrette MR.SEAS-AR $ 18.00 crisp romaine, garlic focaccia croutons, house-made caesar dressing add grilled chicken $10  |  grilled shrimp $12  |  grilled salmon $12 LOBSTER COBB $ 26.00 (GF) crisp iceberg, candied bacon, boiled egg, avocado, tomato, blue cheese crumble, buttermilk ranch ASIAN CHICKEN $ 22.00 crunchy lettuce, shredded carrots, spiced macadamia nuts, crispy onion, cucumber, toasted sesame, ginger-sesame dressing MR. SEAS SIGNATURES FILET MIGNON AU POIVRE $ 52.00 (GF) 6 oz filet, crispy fingerlings, swiss chard, au poivre VERLASSO SALMON $ 34.00 (GF) fennel salad, grilled artichokes, lemon vinaigrette WHOLE BRANZINO $ 42.00 (GF) parsley pistou, summer vegetables, grilled lemon SKEWER PLATTER $ 54.00 filet mignon, marinated chicken thigh, orange labneh, grilled peppers, saffron basmati pilaf, pita SIDES SUMMER VEGETABLES (GF) $ 9.00 TRUFFLE PARMESAN FRIES (GF) $ 9.00 GARDEN SALAD (GF) $ 6.00 FINGERLING POTATOES (GF) $ 8.00 DESSERTS ROASTED PINEAPPLE $ 13.00 coconut sorbet, vanilla brown sugar streusel, rum caramel SEASONAL DESSERT TOWER $ 18.00 key lime polvorones, coconut macadamia bars, brownie bites, NY style cheesecake TURTLE SUNDAE $ 15.00 (GF) dark chocolate brownie, vanilla bean gelato, hot fudge, brown butter caramel sauce, candied pecans GELATO OR SORBET SCOOP $ 6.00 (GF) vanilla bean / chocolate / seasonal sorbet AFTER DINNER DRINKS COFFEE COFFEE | 4.50 ESPRESSO | 4 DOUBLE ESPRESSO | 5.50 CAPPUCCINO | 5.50 LATTE | 5.50 TEA FRENCH LEMON GINGER | 5 EARL GREY | 5 ENGLISH BREAKFAST | 5 MINT | 5 CHAMOMILE | 5 DIGESTIFS / LIQUEURS AMARETTO DISARONNO  |13 BAILEY’S IRISH CREAM | 15 DRAMBUIE | 15 FERNET BRANCA | 12 FRANGELICO | 13 GRAND MARNIER | 15 KAHLUA | 13 SAMBUCA | 14 Mr. Seas Kids All served with Soft Drink Choice of French Fries, Fruit Cup, or Steamed Broccolini Beach Club | Beach & Pool Drinks SIGNATURE COCKTAILS SPICY MEZCAL PALOMA $ 18.00 nosotros mezcal, grapefruit, lime juice, agave, jalapeño, sparkling grapefruit STRAWBERRY BASIL SPRITZ $ 18.00 hendricks gin, strawberry purée, lime juice, fresh basil, prosecco PASSIONFRUIT MAI TAI $ 18.00 myers platinum rum, domaine canton, passionfruit lime, juice, myers dark rum float THE 1596 $ 18.00 orange vodka, malibu coconut rum, pineapple juice, prosecco BLENDED COCKTAILS add a floater +$4 BLUEBERRY MOJITO $ 18.00 myers platinum rum, fresh blueberry, mint, lime juice MANGO MARGARITA $ 18.00 corazon tequila, mango purée, fresh lime, tajin rim BEACH CLUB COLADA $ 18.00 myers platinum rum, coconut cream, pineapple FROSÉ $ 18.00 kim crawford rosé, svedka vodka, fresh raspberries COCONUTS THE ‘SG’ COLADA $ 25.00 myers platinum rum, fresh coconut water, pineapple juice, myers dark rum float UNDER THE PALMS $ 30.00 nosotros blanco tequila, pineapple juice, fresh coconut water, fresh lime, agave COCO H20 $ 15.00 BEERS & SELTZERS DRAFT/CANS 9 | BUCKET OF (6) 45 MICHELOB ULTRA $ 9.00 BUD LIGHT $ 9.00 BUDWEISER $ 9.00 CORONA $ 9.00 CORONA LIGHT $ 9.00 STELLA ARTOIS $ 9.00 FUNKY BUDDHA HOP GUN IPA $ 9.00 FUNKY BUDDHA FLORIDIAN HEFEWEIZEN $ 9.00 CIGAR CITY BREWING JAI LAI IPA $ 9.00 CORONA NON ALCOHOLIC $ 9.00 HIGH NOON VODKA $ 9.00 HIGH NOON TEQUILA $ 9.00 WINES BY THE GLASS SPARKLING RUFFINO PROSECCO, ITALY 13/52 MOET CHANDON BRUT IMPERIAL SPLIT 26 DOMAINE CHANDON BRUT ROSÉ SPLIT 22 ROSÉ KIM CRAWFORD, FRANCE 13/52 WHISPERING ANGEL, FRANCE 18/72 RIESLING WILLAMETTE VALLEY VINEYARDS, OR 13/52 PINOT GRIGIO RUFFINO “LUMINA”, ITALY 13/52 SANTA MARGHERITA, ITALY 18/72 SAUVIGNON BLANC KIM CRAWFORD, NEW ZEALAND 14/56 CHARDONNAY ROBERT MONDAVI, PRIVATE SELECTION, CA 13/52 CHALK HILL, RUSSIAN RIVER, CA 15/60 NON ALCOHOLIC REFRESHMENTS SIMPLY LEMONADE $ 5.00 ICED TEA $ 5.00 COLD BREW COFFEE $ 6.00 RED BULL $ 6.00 SODA $ 5.00 FIJI WATER 500ML $ 5.00 FIJI WATER 1 LITER $ 8.00 SAN PELLEGRINO 1 LITER $ 8.00 Mr. Seas Drinks SIGNATURE COCKTAILS STRAWBERRY BASIL SPRITZ $ 18.00 hendricks gin, strawberry purée, lime juice, fresh basil, prosecco HOT ‘SEAS’ $ 18.00 pa’lante habanero rum, cointreau, mango purée, lime juice, agave OLD 1888 $ 18.00 brugal 1888 rum, chocolate, bitters, demerara syrup WATERMELON MINT COOLER $ 18.00 wheatley vodka, watermelon, mint shrub, lime juice, prosecco COCONUT GIMLET $ 18.00 empress gin, giffard coconut syrup, lime juice, coconut salt BOURBON SUNSET $ 18.00 benchmark bourbon, pama pomegranate, liqueur, ginger syrup, orange juice SPICY MEZCAL PALOMA $ 18.00 nosotros mezcal, grapefruit, lime juice, agave, jalapeño, sparkling grapefruit BEERS & SELTZERS DRAFT/CANS 9 | BUCKET OF (6) 45 MICHELOB ULTRA $ 9.00 BUD LIGHT $ 9.00 BUDWEISER $ 9.00 CORONA $ 9.00 CORONA LIGHT $ 9.00 STELLA ARTOIS $ 9.00 FUNKY BUDDHA HOP GUN IPA $ 9.00 FUNKY BUDDHA FLORIDIAN HEFEWEIZEN $ 9.00 CIGAR CITY BREWING JAI LAI IPA $ 9.00 HIGH NOON VODKA $ 9.00 HIGH NOON TEQUILA $ 9.00 CORONA NON ALCOHOLIC $ 9.00 WINES BY THE GLASS SPARKLING RUFFINO PROSECCO, ITALY 13 / 52 MOET CHANDON BRUT IMPERIAL SPLIT 26 DOMAINE CHANDON BRUT ROSÉ SPLIT 22 VEUVE CLICQUOT, YELLOW LABEL, FRANCE 26 / 150 ROSÉ KIM CRAWFORD, FRANCE 13 / 52 WHISPERING ANGEL, FRANCE 18 / 72 PINOT GRIGIO RUFFINO “LUMINA”, ITALY 13 / 52 SANTA MARGHERITA, ITALY 18 / 72 SAUVIGNON BLANC KIM CRAWFORD, NEW ZEALAND 14 / 56 DETAILS BY SINEGAL, CA 16 / 65 CHATEAU LANGLOIS, SANCERRE, FRANCE 20 / 80 CHARDONNAY CHALK HILL, RUSSIAN RIVER, CA 15 / 60 THE PRISONER, CARNEROS, CA 18 / 72 FLOWERS, SONOMA COAST, CA 19 / 76 OTHER WHITES MOSCATO, D’ASTI, SARACCO, ITALY 13 / 52 RIESLING, WILLAMETTE VALLEY VINEYARDS, OR 13 / 52 PINOT NOIR MEIOMI, CA 13 / 52 VAN DUZER, WILLAMETTE VALLEY, OR 18 / 72 MERLOT DECOY BY DUCKHORN, SONOMA COUNTY, CA 15 / 60 CABERNET SAUVIGNON DETAILS BY SINEGAL, SONOMA COUNTY, CA 16 / 65 THE PRISIONER, CA 18 / 72 CARAVAN BY DARIOUSH, NAPA VALLEY, CA 24 / 98 RED BLEND TAPESTRY, PASO ROBLES, CA 14 / 56 THE PRISONER, NAPA VALLEY, CA 22 / 90 OTHER REDS CLOS DE LOS SIETE, MALBEC, ARGENTINA 14 / 56 Minibar Any product consumed will be charged to the room. All prices are inclusive. If you wish to have any product replenished or have any additional questions please contact our In Room Dining team for assistance at (561) 665-4918 (opens in new window) Pool Side and Beach Side Happy Hour Happy Hour SMASHED AVOCADO (V, GF) $ 10.00 Corn Tortilla Chips, Feta Cheese, Pomegranate Seeds HUMMUS (V) $ 10.00 Traditional & Roasted Pepper Hummus Garden Vegetables, Grilled Pita WATERMELON & TOMATO GAZPACHO (V, GF) $ 10.00 Mediterranean Cucumber Salad, Fresh Micro Mint CAULIFLOWER BITES (V) $ 10.00 Crispy Tempura Cauliflower, Blue Cheese Crumble, Cajun Buffalo Sauce JUMBO SHRIMP COCKTAIL (GF) $ 10.00 Cocktail Sauce, Lemon CRISPY HONEY HOT WINGS (8 PIECES) $ 10.00 Celery, Carrots, Honey Mustard Sauce Beach Club | Beach & Pool Food SHAREABLES TRUFFLE PARMESAN FRIES $ 9.00 (GF) herb-lemon aioli BUFFALO CHICKEN WINGS* $ 19.00 buttermilk dressing, carrot, and celery crudite FRESH FROM THE SEAS GULF SHRIMP COCKTAIL* $ 19.00 spiked cocktail sauce, horseradish BLACKENED SPICED CALAMARI* $ 22.00 charred lemon aioli, micro parsley SALADS ADD A PROTEIN chicken * 10 | shrimp * 12 | salmon * 12 LOBSTER WEDGE SALAD $ 24.00 (GF) buttermilk ranch dressing, candied bacon, boiled egg, avocado “MR.SEAS-AR” $ 17.00 crisp romaine, house made caesar dressing, garlic focaccia crisps GREEK SALAD WITH A TWIST $ 18.00 kale and frisée, tomato, cucumber, olives, marinated goat cheese SIGNATURE HANDHELDS WAGYU BURGER* $ 21.00 wagyu beef, bacon onion jam, american, cheese sauce, parmesan fries TURKEY CLUB* $ 21.00 turkey, bibb lettuce, roma tomato, swiss cheese, bacon, parmesan fries LOBSTER ROLL* $ 24.00 maine lobster, young celery, toasted brioche, parmesan fries BLACKENED MAHI TACOS* $ 19.00 flour tortilla, pineapple-cabbage slaw, serrano, charred lime KIDS All served with a soft drink Choice of fries, fruit cup, or steamed broccolini FRIED CHICKEN TENDERS* $ 14.00 GRILLED CHICKEN BREAST* $ 14.00 HAMBURGER* $ 14.00 CHEESEBURGER* $ 14.00 GRILLED CHEESE SANDWICH $ 14.00 SIDES GRILLED BROCCOLINI (GF) $ 9.00 CRISPY BRUSSELS SPROUTS $ 9.00 TRUFFLE PARMESAN FRIES (GF) $ 9.00 GARDEN SALAD (GF) $ 6.00 FRUIT SALAD (GF) $ 8.00 Poolside and Beachside Drinks SIGNATURE COCKTAILS $18 SPICY MEZCAL PALOMA nosotros mezcal, grapefruit, lime juice, agave, jalapeño, sparking grapefruit STRAWBERRY BASIL SPRITZ hendricks gin, strawberry purée, lime juice, fresh basil, prosecco PASSIONFRUIT MAI TAI myers platinum rum, domaine canton, passionfruit lime, juice, myers dark rum float THE 1596 orange vodka, malibu coconut rum, pineapple juice, prosecco BLENDED COCKTAILS $18 BLUEBERRY MOJITO myers platinum rum, fresh blueberry, mint, lime juice MANGO MARGARITA corazon tequila, mango purée, fresh lime, tajin rim BEACH CLUB COLADA myers platinum rum, coconut cream, pineapple FROSE kim crawford rosé, svedka vodka, fresh raspberries COCONUTS THE “SG” COLADA $ 25.00 myers platinum rum, fresh coconut water, pineapple juice, myers dark rum float UNDER THE PALMS $ 30.00 nosotros blanco tequila, pineapple juice, fresh coconut water, fresh lime, agave COCO H2O $ 15.00 BEERS & SELTZERS Draft/Cans $9 | Bucket of (6) $45 MICHELOB ULTRA BUD LIGHT BUDWEISER CORONA CORONA LIGHT STELLA ARTOIS FUNKY BUDDHA HOP GUN IPA FUNKY BUDDHA FLORIDIAN HEFEWEIZEN CIGAR CITY BREWING JAI LAI IPA CORONA NON ALCOHOLIC HIGH NOON VODKA HIGH NOON TEQUILA WINES BY THE GLASS SPARKLING RUFFINO PROSECCO, ITALY | 13/52 MOET CHANDON BRUT IMPERIAL SPLIT | 26 DOMAINE CHANDON BRUT ROSÉ SPLIT | 22 ROSÉ KIM CRAWFORD, FRANCE | 13/52 WHISPERING ANGEL, FRANCE | 18/72 RIESLING WILLAMETTE VALLEY VINEYARDS, OR | 13/52 PINOT GRIGIO RUFFINO “LUMINA”, ITALY | 13/52 SANTA MARGHERITA, ITALY | 18/72 SAUVIGNON BLANC KIM CRAWFORD, NEW ZEALAND | 14/56 CHARDONNAY ROBERT MONDAVI, PRIVATE SELECTION, CA | 13/52 CHALK HILL, RUSSIAN RIVER, CA | 15/60 NON ALCOHOLIC REFRESHMENTS SIMPLY LEMONADE $ 5.00 ICED TEA $ 5.00 COLD BREW COFFEE $ 6.00 RED BULL $ 6.00 SODA $ 5.00 SPARKLING WATER $ 8.00 SAN PELLEGRINO 1 LITER WATER $ 5.00 $ 8.00 FIJI 500 ML FIJI 1 LITER Beach Club Dessert DESSERT JUNIORS NEW YORK CHEESECAKE $ 11.00 Seasonal Berry Compote Sweetened Vanilla Cream KEY LIME PIE $ 11.00 Coconut Macaroon, Tropical Sauce Coconut GelatoCoconut Macaroon, Tropical Sauce MOLTEN CHOCOLATE TORTE $ 11.00 Raspberry Coulis, Vanilla Bean Ice Cream GOLD BRICK SUNDAE $ 12.00 Vanilla & Chocolate Ice Cream Whipped Cream, Candied Pecan, Gold Brick SORBETS & GELATOS $ 8.00 Choice of Sorbets Lemon & Mango Choice of Gelato Coconut, Vanilla, Chocolate $ 8.00 À La Carte Mother's Day Dinner À La Carte Mother's Day Dinner from 5pm to 10pm. Soup LOBSTER BISQUE $ 18.00 Sweet sherry, crème fraiche, croutons, caviar Entrées AG SURF & TURF $ 55.00 Grilled flank steak, crabcake, corn puree, haricot vert, local salad PAN SEARED HALIBUT $ 48.00 Sweet pea puree, spring vegetables, trout roe Dessert Cake $ 14.00 Raspberry Lemon Bundt Cake Beach Club > Brunch Menu Brunch All brunch items are served with a side of breakfast potatoes Vegetable Frittata $ 22.00 Spinach, Tomato, Peppers, Cheddar Cheese, Bacon Jam Avocado Toast $ 26.00 Grilled Sourdough, Blackened Shrimp, Tomato, Frisee Salad, Feta, Pomegranate Chicken & Waffles $ 24.00 Belgian Waffles, Honey Hot Chicken, Bacon, Watermelon, Grade A Maple Syrup Captain Crunch Battered Brioche French Toast $ 18.00 Fruit Compote, Pecan Praline Sauce Cheese Blintzes $ 24.00 Strawberry Compote, Powdered Sugar, Creme Fraiche Mains Steak Frites (gf) $ 38.00 10oz Wagyu Skirt Steak, Chimichurri, Fries Fresh Catch (gf) $ 36.00 Simply Grilled, Key Lime Tartar, Grilled Lemon Pan Seared Local Snapper (gf) $ 34.00 Wilted Spinach, Ratatouille Vinaigrette Salads Old Fashioned Wedge $ 16.00 Iceberg, Tomato, Applewood Smoked Bacon, Creamy Blue Cheese Dressing Seafood Cobb $ 30.00 Lobster, Shrimp, Egg, Avocado, Tomatoes, Bacon, Garden Greens, Gorgonzola Dressing Greek Salad (v, gf)) $ 16.00 Romaine, Cucumber, Heirloom Tomatoes, Olives, Red Onion, Feta, Lemon Vinaigrette Spinach & Kale Salad (gf) $ 16.00 Red Onion, Tomato, Gorgonzola Cheese, Toasted Pine Nuts, Warm Bacon Vinaigrette Caesar Salad $ 15.00 Romaine, Caesar Dressing, Focaccia Croutons Additions Grilled Chicken 9 Blackened Salmon 10 Cajun Shrimp 12 Wagyu Skirt Steak 14 Bites Market Oysters 6 (gf) $ 22.00 Cocktail Sauce, White Balsamic-Lemon Mignonette Conch Fritters $ 18.00 Citrus Aioli, Old Bay Salt,Grilled Lemon Tuna Poke Bowl $ 28.00 Brown Sushi Rice, Mango, Avocado, Edamame, Roasted Corn Scallions, Sesame, Soy Dressing Mahi Dip $ 17.00 Pita Chips, Pickled Vegetables Jumbo Shrimp Cocktail (gf) $ 21.00 Cocktail Sauce, Lemon Cauliflower Bites (v) $ 16.00 Crispy Tempura Cauliflower, Blue Cheese Crumble, Cajun Buffalo Sauce Hummus (v) $ 15.00 Traditional & Roasted Pepper Hummus, Garden Vegetables, Grilled Pita Watermelon & Tomato Gazpacho (v,gf) $ 11.00 Mediterranean, Cucumber Salad, Fresh Micro Mint Handhelds All handhelds are served with a choice of side. Sand Dollar Burger $ 25.00 Spicy Aioli, Bibb, Tomato, Red Onion, B&B Pickles, Cheddar, Brioche Bun Beach Club $ 22.00 Roasted Turkey, Lettuce, Tomato Smoked Bacon, Swiss, Avocado Aioli, Multigrain Toast Grilled Chicken Caprese Sandwich $ 22.00 Local Tomatoes, Mozzarella, Arugula Pesto, Brioche Bun Mahi-Mahi Fish Tacos $ 23.00 Flour Tortilla, Avocado Crema, Creamy Slaw, Salsa Cajun Fish Sandwich $ 24.00 Key Lime Tartar, Tomato, Tropical Slaw, Brioche Bun Tuna Salad Wrap $ 21.00 Spinach Wrap, Bibb Lettuce, Tomato New England Lobster Roll $ 34.00 Celery, Cajun Mayo, Toasted Bun Sides Grilled Asparagus $ 8.00 Cole Slaw $ 8.00 Market Salad $ 8.00 Seasonal Fruit $ 8.00 French Fries $ 8.00 Additions Etc. Café Lunch Menu From Our Award Winning Bakery Scone $ 5.00 Bagel $ 5.00 Muffin $ 5.00 Coffee Cake $ 5.00 Chocolate Croissant $ 5.00 Savory Croissant $ 6.00 Croissant $ 5.00 Dessert Bar $ 4.00 Cheesecake Jar $ 6.00 Cookie $ 4.00 Cake Pop $ 4.00 Sweet of The Day $ 5.00 Brownie $ 4.00 Macaron 6 Count $ 18.00 Macaron 12 Count $ 29.00 Cinnamon Roll $ 5.00 Bites Salads Chicken Caesar 15 Kale Greek 12 Mixed Greens 11 Sandwiches Tuna Salad Wrap 12 Club Sandwich 12 Chicken Caprese Wrap 12 Italian on Focaccia 12 Beverages Hot Tea $ 5.00 Brewed Coffee (HOT OR ICED) $ 6.00 Espresso $ 4.00 Double Espresso $ 6.00 Cappuccino $ 7.00 Cold Brew $ 6.00 Café Latte $ 7.00 Matcha Latte $ 7.00 Mocha Latte $ 7.00 Chai Tea Latte $ 7.00 Frappe $ 7.00 Café Macchiato $ 7.00 Cortado $ 6.00 Add Flavored Syrup to A Beverage $ 1.00 Vanilla, SF Vanilla, Caramel, SF Caramel, Hazelnut Fresh Fruit Smoothies $ 10.00 Berry, Green, or Tropical- Add protein $2.00 Local Pressed Juice $ 10.00 Fiji Liter $ 8.00 San Pellegrino Liter $ 8.00 Red Bull $ 6.00 Organic Coconut Water $ 6.00 Soda $ 4.00 Ruffino Prosecco Split $ 15.00 Kim Crawford 375 $ 24.00 Whispering Angel 375 ML $ 28.00 Craft Beer $ 7.00 Domestic Beer $ 6.00 15% service charge automatically included. Please inform us of any severe allergies. Etc. Café Morning Menu Bites Breakfast Sandwich or Wrap $ 12.00 Seasonal Berry Bowl $ 10.00 Fruit Bowl $ 8.00 Parfait $ 9.00 From Our Award Winning Bakery Bagel $ 5.00 Muffin of the Day $ 5.00 Savory Croissant $ 5.00 Chocolate Croissant $ 5.00 Donut $ 5.00 Cookie $ 4.00 Sweet of The Day $ 5.00 Beverages Hot Tea $ 5.00 Brewed Coffee (HOT OR ICED $ 6.00 Cold Brew $ 6.00 Espresso $ 4.00 Double Espresso $ 6.00 Cappuccino $ 7.00 Caffe Latte $ 7.00 Matcha Latte $ 7.00 Caffe Machiatto $ 7.00 Cortado $ 6.00 Add Flavored Syrup to A Beverage $ 1.00 Vanilla, SF Vanilla, Caramel, SF Caramel, Hazelnut Fresh Fruit Smoothies $ 10.00 Berry, Green, or Tropical- Add Protein $2.00 Local Pressed Juice $ 9.00 Fiji Liter $ 9.00 San Pellegrino Liter $ 9.00 Soda $ 5.00 15% service charge automatically included. Please inform us of any severe allergies. Additional grab & go snack available at register. Item availability subject to change. Hotel Pool> Drink Menu SPECIALTY COCKTAILS The Lagoon $ 18.00 Lime Rum, Blue Curacao, Lemonade Aperol Spritz $ 18.00 Aperol, St. Germaine, Prosecco, Orange Vodka Breeze $ 18.00 Pomegranate Vodka, Pineapple & Grapefruit Juices The Paradise $ 18.00 Jung & Wulf Luxury Rums, Fresh Pineapple & Lime Juices, Simple Syrup Vampire $ 18.00 Corazon Tequila, Signature Bloody Mary Mix Blackberry Margarita $ 18.00 Corazon Tequila, Muddled Blackberries, Lime Paloma $ 18.00 Casamigos Blanco, Fresh Grapefruit, Soda, Salt Rim VIRGIN DRINKS Milkshake $ 8.00 Vanilla, Strawberry, Chocolate, or Lemon Ice Daiquiri $ 8.00 Light Rum, Strawberry or Mango WINES BY THE GLASS Ruffino Prosecco Split $ 15.00 Moet & Chandon Brut Imperial Split $ 26.00 Domaine Chandon Brut Rosé Split $ 22.00 Hampton Water Rose $ 13.00 Ruffino Pinot Grigio $ 13.00 Kim Crawford Sauvignon Blanc $ 13.00 Flowers Chardonnay $ 19.00 Meiomi Pinot Noir $ 13.00 CANS Matua Kiwi Sauvignon Blanc $ 9.00 High Noon Seltzers $ 9.00 Vodka or Tequila Corona Extra $ 9.00 Modello $ 9.00 Corona Light $ 9.00 Stella Artois $ 9.00 Michelob Ultra $ 9.00 Local Selection $ 9.00 COCONUTS The “SG” Colada $ 26.00 Parrot Bay, Fresh Coconut Water, Pineapple and Lime Juice, Dark Rum Float Under The Palms $ 30.00 Casamigos Blanco, Fresh Coconut Water, Pineapple and Lime Juice, Touch of Agave BOTTLED WATER & ICED TEAS Soda $ 5.00 Fiji Water $ 8.00 San Pellegrino $ 8.00 Iced Tea $ 5.00 Lemonade $ 5.00 A 20% service charge and applicable taxes will be added to the check. Beach Club>Happy Hour HAPPY HOUR Monday - Friday 4 - 6 pm Imported Beers Stella Artois $ 4.00 Corona Light $ 4.00 Corona $ 4.00 BITES Tuna Poke Bowl $ 14.00 Brown Sushi Rice, Mango, Avocado, Edamame Roasted Corn, Scallions, Sesame, Soy Dressing Mahi Dip $ 8.00 Pita Chips, Pickled Vegetable Market Oysters (6) (gf) $ 11.00 Cocktail Sauce, White Balsamic-Lemon Mignonette Conch Fritters $ 9.00 Citrus Aioli, Old Bay Salt, Grilled Lemon Jumbo Shrimp Cocktail (gf) $ 10.00 Cocktail Sauce, Lemon Cauliflower Bites (v) $ 8.00 Crispy Tempura Cauliflower, Blue Cheese Crumble, Cajun Buffalo Sauce Hummus (v) $ 7.00 Traditional & Roasted Pepper Hummus,Garden Vegetables, Grilled Pita Well Beverages Tequila $ 6.00 Scotch $ 6.00 Burbon $ 6.00 Vodka $ 6.00 Gin $ 6.00 Domestic Beers Budweiser $ 4.00 Michelob Ultra $ 4.00 Bud Light $ 4.00 Wines This only applies to a glass Sokol $ 7.00 Pinot Noir Robert Mondavi Private Select $ 7.00 Cabernet Ramey $ 7.00 Chardonnay Kim Crawford $ 7.00 Sauvigion A 20% service charge and applicable taxes will be added to the check. Atlantic Grille Dinner Raw Bar HALF DOZEN MARKET OYSTERS $ 24.00 Champagne Mignonette, Cocktail Sauce Horseradish SHRIMP COCKTAIL $ 23.00 Cocktail Sauce, Lemon, Remoulade SEAFOOD TOWER $ 105.00 1 1/2 lb Maine Lobster, Market Oysters (8) Shrimp Cocktail (8) AHI TUNA CRUDO $ 22.00 Crispy Rice, Avocado, Spicy Mayo, Sesame Seeds Bowls & Bites ROASTED TOMATO SOUP $ 14.00 Grilled Cheese Croutons, Basil, Balsamic LEMON PEPPER CALAMARI $ 20.00 Bravas Sauce, Green Goddess Aioli, Grilled Lemon GRILLED SPANISH OCTOPUS $ 22.00 Crispy Potato and Goat Cheese Croquettes Grilled Fennel, Romesco KANSAS CITY BBQ RIBS $ 20.00 Pickled Fresno’s & Chives SEAGATE CHICKEN WINGS $ 19.00 Blue Cheese, Celery, Carrot Sticks SUMMER HEIRLOOM BURRATA $ 22.00 Heirloom Tomatoes, Watermelon, Pickled Shallots, Mint, Basil Pesto, Micro Radish CAESAR SALAD $ 17.00 Parmesan Reggiano, Foccaccia Croutons KALE & LOCAL LETTUCE GREEK $ 18.00 Olives, Feta, Crispy Seeds, Cucumber, Red Onions, Herb Vinaigrette SHAVED GARDEN SALAD $ 18.00 Shredded Kale, Arugula, Carrots, Celery, Cucumber, Asparagus, Watermelon Radish, Dried Apricots Entrees VEGAN PASTA BOLOGNESE $ 29.00 Portobello, Tomatoes, Spaghetti, Basil WILD MUSHROOM PASTA $ 33.00 Fresh Rigatoni, Roasted Local Mushrooms Truffle Cream, Herbs GLUTEN-FREE PASTA AVAILABLE UPON REQUEST Add: Grilled Chicken 9 | Shrimp 12 | Salmon 12 | Lobster 24 CRISPY SKIN BRANZINO VERACRUZ $ 42.00 Tomato Sauce, Capers, Garlic, Olives, Potatoes ROASTED SEABASS OSCAR $ 56.00 Garlic Mash, Grilled Asparagus, Lobster, Hollandaise LOBSTER RISOTTO $ 54.00 Saffron, English Peas, Grilled Zucchini Parmesan, Herbs ISLAMORADA IPA BRAISED SHORT RIB $ 40.00 Creamy Polenta, Roasted Root Vegetables, Gremolata KOREAN BBQ PORK CHOP $ 38.00 Gojuchang BBQ, Crunchy Pineapple Salad, Crispy Rice WAGYU STEAK FRITES $ 46.00 Lightly Blackened Grilled Flank Steak Parmesan Truffle Fries, Chimi Simply Grilled Served with Choice of Chimichurri, Mâitre d’Hôtel Butter, Bearnaise Sauce or Au Poivre Sauce. FILET MIGNON 8OZ $ 58.00 NEW YORK STRIP 14OZ $ 59.00 RIBEYE STEAK 16OZ $ 62.00 GROUPER $ 46.00 MAHI MAHI $ 36.00 SCOTTISH SALMON $ 34.00 Sides CRISPY BRUSSELS SPROUTS $ 12.00 Sweet Soy, Toasted Peanuts, Garlic Aioli GRILLED ASPARAGUS $ 12.00 Lemon, Almond, Red Chili Flakes SPICE ROASTED CARROTS $ 12.00 Maple Butter MASHED POTATOES $ 10.00 GARLIC-HERB FRIES $ 9.00 There is risk associated with consuming raw and under-cooked fish, oyster, meat or poultry products (medium, medium-rare, rare, or extra-rare). If you have chronic illness of the liver, stomach, or have immune disorders, you are at greater risk of serious illness from fish, meat, or poultry and should eat them fully cooked. Some of these conditions have no symptoms, so you may not know you are at risk. Particularly vulnerable young children, pregnant women, or older adults, sufferers of liver disease or alcoholism and those with compromised immune systems. We recommend that these people eat only fully cooked food to insure personal safety. The Seagate Beach Club buys the best possible products from licensed, qualified purveyors and continually strives to safeguard the health and safety of our Members and Guests. Beach Club > Pool Food Menu BITES BUFFALO CHICKEN TENDERS $ 28.00 Crispy Tenders Tossed In Buffalo Sauce, Celery Carrot and Creamy Ranch TUNA POKE BOWL $ 28.00 Brown Sushi Rice, Mango, Avocado, Edamame, Roasted Corn, Scallions, Sesame, Soy Dressing MAHI DIP $ 17.00 Pita Chips, Pickled Vegetable CONCH FRITTERS $ 18.00 Citrus Aioli, Old eBay Salt, Grilled Lemon JUMBO SHRIMP COCKTAIL (GF) $ 21.00 Cocktail Sauce, Lemon CAULIFLOWER BITES (v) $ 16.00 Crispy Tempura Cauliflower, Blue Cheese Crumble, Cajun Buffalo Sauce WATERMELON & TOMATO GAZPACHO (V) (GF) $ 11.00 Mediterranean Cucumber Salad, Fresh Micro Mint HUMMUS (v) $ 15.00 Traditional & Roasted Pepper Hummus Garden Vegetables, Grilled Pita SALADS SPINACH & KALE SALAD (GF) $ 16.00 Red Onion, Tomato, Gorgonzola Cheese Toasted Pine Nuts, Warm Bacon Vinaigrette CAESAR SALAD $ 15.00 Romaine, Caesar Dressing, Focaccia Croutons SEAFOOD COBB $ 30.00 Lobster, Shrimp, Egg, Avocado, Tomatoes Bacon, Garden Greens, Gorgonzola Dressing GREEK SALAD (V, GF) $ 16.00 Romaine, Cucumber, Heirloom Tomatoes Olives, Red Onion, Feta, Lemon Vinaigrette OLD FASHIONED WEDGE $ 16.00 Iceberg, Tomato, Applewood Smoked Bacon Creamy Blue Cheese Dressing ADDITIONS Grilled Chicken $9.00 Blackened Salmon $10.00 Cajun Shrimp $12.00 Wagyu Skirt Steak $14.00 HANDHELDS All handhelds are served with a choice of side IMPOSSIBLE BURGER (v) $ 25.00 Spicy Aioli, Bibb, Tomato, Red Onion, B&B Pickles, Cheddar, Brioche Bun SAND DOLLAR BURGER $ 24.00 Spicy Aioli, Bibb, Tomato, Red Onion, B&B Pickles, Cheddar, Brioche Bun BEACH CLUB $ 22.00 Roasted Turkey, Lettuce, Tomato, Smoked Bacon, Swiss, Avocado Aioli, Multigrain Toast CHICKEN CAPRESE SANDWICH $ 22.00 Local Tomatoes, Mozzarella, Arugula Pesto Brioche Bun MAHI MAHI FISH TACOS $ 23.00 Flour Tortilla, Avocado Crema, Creamy Slaw Salsa CAJUN FISH SANDWICH $ 24.00 Key Lime Tarter, Tomato, Tropical Slaw Brioche TUNA SALAD WRAP $ 21.00 Spinach Wrap, Bibb Lettuce, Tomato NEW ENGLAND LOBSTER ROLL $ 34.00 Celery, Cajun Mayo, Toasted Bun SIDES French Fries $ 8.00 Seasonal Fruit $ 8.00 Market Salad $ 8.00 Cole Slaw $ 8.00 Grilled Asparagus $ 8.00 A 20% service charge and applicable taxes will be added to the check. The Beach Club Valentine's Day Dinner Served with a glass of complimentary champagne per guest. APPETIZER Choice of: LOBSTER RAVIOLI seafood vodka sauce, fennel salad BABY SPINACH & GARDEN CRESS SALAD dried cranberries, roasted pine nuts, parmesan shavings, strawberry vinaigrette MAIN COURSE Choice of: WILD MUSHROOM RISOTTO black truffle, aged parmesan, fresh parsley GRASS FED FILET MIGNON garlic mashed potatoes, grilled asparagus red wine demi DESSERT CHOCOLATE FONDUE strawberries, marshmallows salted pretzels, bananas There is risk associated with consuming raw and under-cooked fish, oyster, meat or poultry products (medium, medium-rare, rare, or extra-rare). If you have chronic illness of the liver, stomach, or have immune disorders, you are at greater risk of serious illness from fish, meat, or poultry and should eat them fully cooked. Some of these conditions have no symptoms, so you may not know you are at risk. Particularly vulnerable young children, pregnant women, or older adults, sufferers of liver disease or alcoholism and those with compromised immune systems. We recommend that these people eat only fully cooked food to insure personal safety. The Seagate Beach Club buys the best possible products from licensed, qualified purveyors and continually strives to safeguard the health and safety of our Members and Guests. Christmas Eve & Christmas Day Dinner Menu Price $75 Roast Butternut & Sweet Potato Soup Spiced Pepitas, Queso Fresco, Extra Virgin Olive Oil Salad of Kale & Brussels Apple, Dried Cherries, Spiced Pecans, Orange Ginger Vinaigrette Seared Scallops Sunchoke Puree, Wild Mushrooms, Bacon Lardons Choice Of Vegan Ancient Grain Mushroom “Risotto” Delicata Squash, Root Vegetables, Broccolini, Red Wine Gastrique Seabass Oscar Crab Cake, Asparagus, Hollandaise Roast Prime Rib of Beef Gorgonzola Potato Gratin, Creamed Spinach, Demi-Glace Choice Of Holiday Cookie Plate Cuccidati, Snow Balls, Chocolate Peppermint, Amaretti Chocolate Peppermint Tart Chocolate Sable, Peppermint Ganache, Whipped Cream, Candied Mint, Crushed Peppermints Gingerbread Caramel Bread Pudding Vanilla Anglaise, Candied Pepitas, Vanilla Ice Cream New Year's Eve Dinner Price $95 Served with a glass of complementary champagne.Choice Of Creamy Cauliflower Soup Roasted Cauliflower, Saffron, Smoked Salmon, Brioche Oysters Rockefeller Spinach, Bacon, Breadcrumbs Prosciutto & Melon Compressed Melon, Fig, Pickled Beet, Pistachio, Goat Cheese Winter Salad of Kale, Frisée & Radicchio Celery, Dates, Pear, Hazelnut, Honey-Citrus Dressing Choice Of Vegan Ancient Grain Mushroom “Risotto” Delicata Squash, Root Vegetables, Broccolini, Red Wine Gastrique Roasted Seabass Filet Corn & Root Succotash, Truffle Broth Veal Scallopini Arugula, Roasted Tomato, Capers, Lemon, Fennel Surf & Turf 6oz Prime Filet, Maine Lobster Tail Celeriac Puree, Garlic Spinach, Shishito Peppers, Herb Butter Choice Of Chocolate & Champagne Dark Chocolate Sphere Strawberry Champagne Mousse White Chocolate, Berry Coulis Beach Club > All Day Starters Chilled Watermelon Gazpacho $ 8.00 Mediterranean cucumber salad, citrus oil, fresh micro mint Shrimp Cocktail (6)* $ 18.00 Cold Water Lobster Tail (1)* $ 28.00 Cocktail sauce, mustard sauce, charred lemon Seafood Cocktail* $ 18.00 Shrimp, squid, lobster, tomato sauce, coriander, lime, jalapeño, red onion, corn chips Charcuterie Board $ 24.00 Assorted meats and cheeses, fig jam, apricot spread, truffle honey, crostini Grilled Octopus $ 18.00 Tossed Pamentier potatoes, cilantro, artichoke, blistered tomatoes, edamame, chili lime Salads Caesar Salad $ 10.00 Romaine, house made Caesar dressing, focaccia crostini Shellfish Cobb* $ 26.00 Lobster meat, jumbo shrimp, egg, avocado, pepitas, bacon, Gorgonzola dressing Raspberry + Baby Spinach Salad* $ 14.00 Spinach, tomato, Gorgonzola cheese, toasted pine nuts, raspberry vinaigrette Greek Salad* $ 15.00 Romaine, feta cheese, cucumber ribbons, heirloom tomatoes, red onion, marinated artichokes, olive medley, oregano red wine vinaigrette Salad Enhancements House Made Falafel Balls (6)* $ 8.00 8oz Marinated Grilled Chicken Breast* $ 10.00 8oz King Salmon* $ 16.00 Jumbo Oishii Shrimp (4)* $ 14.00 Chef's Specialties Seagate Burger $ 18.00 Brie cheese, bacon, grilled apple, chipotle raspberry sauce, brioche bun Marinated Grilled Chicken Breast Sandwich $ 16.00 Ciabatta, manchego, arugula, tomato, truffle mayo Cajun Mahi Sandwich $ 17.00 Pineapple slaw, citrus tartar sauce, onion roll Pan Seared Snapper* $ 34.00 Coconut island rice, chili mango salsa Kung Pao Tofu Steak $ 22.00 Zucchini, red chili peppers, scallions, cashews Fresh Cuts + Seafood The following items are only available after 5pm Served with micro herb salad, blistered shishito peppers with choice of sauce and one side. Sauce selection: Valencia orange beurre blanc, chimichurri sauce, port wine shallot demi, romesco sauce 8oz Center-Cut Prime Filet Mignon* $ 48.00 Grouper* $ 34.00 14oz Bone-In Chicken Breast* $ 22.00 Chef’s Daily Catch MP Prepared Blackened, Grilled or Pan-Seared Sides The following items are only available after 5pm Loaded Baked Potato* $ 8.00 Baked Sweet Potato* $ 8.00 Bacon Honey Balsamic Brussels Sprouts* $ 8.00 Garlic Spinach* $ 8.00 Roasted Seasonal Vegetables* $ 8.00 French Fries $ 8.00 Sweet Potato Tots $ 8.00 Fresh Fruit* $ 8.00 Lobster Mac + Cheese $ 16.00 with parmesan bread crust Prix Fixe 3-Course Menu | $38 The following items are only available after 5pm Starters Chilled Watermelon Gazpacho Mediterranean cucumber salad, citrus oil, fresh micro mint Ceasar Salad Romaine, house made Caesar dressing, focaccia crostini Short Rib Wontons Shredded braised short ribs, cream cheese, chives, citrus ponzu Entrée Selection Blackened Mahi Tomato risotto, mango salsa, cilantro oil Pan Roasted Salmon Lentil dahl, seasonal roasted vegetables, herb velouté sauce Grilled Oishii Jumbo Shrimp Red spicy wakame slaw, Fresno pepper, soy reduction Desserts Key Lime Pie Kiwi sauce, graham cracker crust, whipped cream, candied lime wheel Chocolate Lava Cake Fresh berries, graham cracker crust, whipped cream, coffee ice cream Atlantic Grille Dessert Desserts BRULEED BANANA SPLIT $ 13.00 Bruleed Banana, Vanilla & Chocolate Ice Cream, Recrystallized Peanuts, Caramel Drizzle, Whipped Cream, Fresh Strawberries TRIPLE LAYER CHOCOLATE CAKE $ 12.00 Whipped Cream, Cocoa Powder WARM CHOCOLATE CHIP COOKIE SKILLET $ 13.00 Vanilla Ice Cream, Chocolate Fudge Sauce KEYLIME PIE $ 14.00 Graham Cracker Base, Meringue ICE CREAMS & SORBETS (GF) $ 12.00 Vanilla, Chocolate, Seasonal Sorbet Coffee + Espresso ESPRESSO $ 4.00 Rich and aromatic, prepared in its purest form DOUBLE ESPRESSO $ 6.00 CAFFÉ MACCHIATO $ 5.00 Espresso with a dollop of warm frothy milk CAPPUCCINO $ 6.00 Espresso blended with warm frothy milk CAFFÉ LATTE $ 6.00 Espresso mixed with hot milk and finished with a rich layer of froth FRESH BREWED COFFEE $ 6.00 Dessert Cocktails ESPRESSO MARTINI $ 18.00 Vanilla Infused Wheatley Vodka, Espresso Liquor Espresso, Demerara Syrup NUTTY IRISHMAN $ 18.00 Jameson, Frangelico, Baileys, Shaved Chocolate CINNAMON ROASTED ESPRESSO MARTINI $ 18.00 Casamigos Reposado, Espresso Liquor, Espresso Cinnamon Dust AFTER DINNER POURS BAILEYS $ 14.00 AMARETTO $ 14.00 AVERNA AMARO $ 17.00 NONINO AMARO $ 16.00 SAMBUCA ROMANO WHITE $ 12.00 SAMBUCA ROMANO BLACK $ 12.00 Cognac + Brandy REMY LOUIS XIII $ 225.00 MARTELL CORDON BLEU $ 42.00 REMY MARTIN VSOP $ 16.00 REMY MARTIN XO $ 36.00 *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A gratuity of 20% will be added to parties of six or more. ETC Cafe Menu Specialty Coffee Brewed Coffee Regular $ 5.00 Large $ 6.00 Iced Coffee Regular $ 5.00 Large $ 6.00 Cold Brew Regular $ 6.00 Large $ 8.00 Espresso Single $ 4.00 Double $ 6.00 Caffé Macchiato $ 5.00 Espresso with a dallop of warm, frothy milk Cortado $ 5.00 Espresso with warm milk Cappuccino $ 6.00 Espresso blended with warm, frothy milk Caffé Latte $ 6.00 Espresso mixed with hot milk and finished with a layer of froth Caffé Mocha $ 6.00 Espresso blended with rich, dark chocolate and steamed milk Tazo Chai Tea Latte $ 7.00 Hot or cold, with your choice of milk Add a flavored syrup $ 3.00 (Vanilla, Sugar-Free Vanilla, Caramel, Sugar-Free Caramel, Hazelnut) Add a shot of Espresso $ 4.00 Frappe $ 8.00 Blended Iced Coffee Matcha Latte $ 8.00 Hot or cold, with choice of milk Eggs, etc. Bacon, Egg and Cheese Wrap $ 8.00 Egg and Cheese Wrap $ 6.00 Seasonal Berries $ 6.00 Fruit Salad $ 5.00 Daily Quiche $ 8.00 Breakfast Sandwich $ 8.00 Hot Oatmeal $ 7.00 Overnight Oats $ 7.00 Yogurt Parfait $ 9.00 From the Bakery Coffee Cake $ 4.00 Dessert Bar $ 4.00 Brownie $ 4.00 Cinnamon Roll $ 5.00 Scone $ 4.00 Bagel with Cream Cheese $ 4.00 Savory Croissant $ 5.00 Muffin $ 4.00 Sweet of the Day $ 5.00 Cookie $ 4.00 Croissant $ 4.00 Beverages Breakfast Smoothie $ 10.00 Low-fat vanilla yogurt, granola, blueberries, strawberries, blackberries, bananas, apple juice Add protein powder +3 Strawberry Banana Smoothie $ 10.00 Low-fat vanilla yogurt, apple juice, bananas, strawberries Add protein powder +3 Mixed Berry Smoothie $ 10.00 Low-fat yogurt, blueberries, strawberries, blackberries, apple juice Add protein powder +3 MEP Cold-Pressed Juices $ 10.00 Heart Water $ 4.00 $ 6.00 Celsius $ 6.00 Fiji Water $ 7.00 Harmless Harvest Coconut Water $ 6.00 Hot Tea $ 5.00 Iced Black Tea $ 5.00 Kamsa Probiotic $ 6.00 Skim, Whole, 2%, Almond, Soy, Oat Country Club > Breakfast Chef's Specialties CHEESE BLINTZES $ 16.00 Powder sugar / blueberry compote / sour cream OATMEAL $ 9.00 Golden raisin / slice banana / cinnamon / cane brown sugar VANILLA YOGURT PARFAIT $ 10.00 Honey-almond granola / fresh blubbery /peaches SEAGATE OMELET $ 10.00 Choice of fillings / Breakfast potatoes / bacon / toast EGG WHITE OMELET $ 12.00 Choice of fillings / multigrain toast / fresh fruit SOUTH BEACH EGGS BENEDICT $ 12.00 Two poached eggs / toasted English muffins / smoked ham / charred tomato smash avocado / tarragon hollandaise sauce TWO EGGS ANY STYLE $ 10.00 Choice of toast / sausage / bacon CRAB SALAD MELT $ 17.00 Tomato bruschetta / fontina cheese / arugula / avocado / slice challah toast STEAK & EGGS $ 18.00 Potatoes / sunny side eggs / slice steak / sweet onions / scallions Pancakes, Waffles & French Toast FULL STACK BUTTERMILK PANCAKES $ 10.00 Chocolate chips / fresh strawberries / whipped cream / banana maple syrup FRESHLY PREPARED BELGIAN WAFFLE $ 12.00 Vanilla whipped cream / macerated berries CHALLAH STUFFED FRENCH TOAST $ 14.00 Mascarpone coconut cream / vanilla essence maple syrup / fresh berries Saladas & More BASKET OF DANISH $ 7.00 Fresh croissant / cheese danish / muffins SEAGATE HOUSE SALAD $ 9.00 Garden greens / carrot / cucumber / heirloom tomato / red onion seasoned croutons / balsamic vinaigrette ICEBERG WEDGE SALAD $ 10.00 Roasted corn / heirloom tomatoes / Applewood bacon / blue cheese dressing / crispy shallots BABY KALE SALAD $ 14.00 Black currants / toasted pine nuts / cilantro-lime vinaigrette / parmesan SMOKE SALMON PLATTER $ 18.00 Poach egg / avocado / pickle red onions / tomato / citrus goat cream cheese lemon / cucumber slice / choice of bagel GRILLED SHRIMP MARTINI $ 14.00 Mango-passion gelée / guacamole / horseradish scented gazpacho Salad Enhancements POACHED SHRIMP $ 12.00 GRILLED SALMON $ 10.00 SLICED STEAK $ 10.00 GRILLED CHICKEN $ 8.00 Extra Sides ASSORTED CEREAL BOWL $ 7.00 BACON OR PORK SAUSAGE $ 4.00 BAGEL & CREAM CHEESE $ 5.00 Gluten-Free Items** A $6.00 sharing charge will be applied for the splitting of entrée. Consuming raw or undercooked meats, seafood or eggs may increase your risk of food-borne illness. Country Club > Dinner Menu Available 5:00 p.m. - 9:00 p.m. Starters French Onion Soup $ 10.00 Garlic herb croutons, Gruyere + Swiss Torn Short Rib Tacos (3) $ 14.00 Sriracha sour cream aioli, cheddar cheese, corn tortillas, tomatoes, shredded lettuce Cocktail Shrimp (4)* $ 16.00 Spicy cocktail sauce, charred lemon, lemon garlic aioli Delightful Beef Carpaccio $ 16.00 Cremini jam, shaved parmesan, truffle aioli, crostini Cauliflower Hush Puppies $ 12.00 Pico slow, lemon garlic aioli Fried Chicken Potstickers $ 13.00 Sesame seed citrus ponzu, scallions Salads Chopped Salad* $ 12.00 Heirloom tomato, cucumber, watermelon radish, romaine lettuce, honey-shallot vinaigrette Kale Caesar Salad $ 12.00 Baby kale, parmesan tuile, garlic confit, anchovies, house made herb + parmesan croutons Fennel + Arugula Salad* $ 14.00 Dried cranberry orange craisins, watermelon radish, citrus vinaigrette Salad Enhancements Falafel Balls $ 8.00 8oz Marinated Grilled Chicken Breast* $ 10.00 8oz Grilled Skirt Steak* $ 14.00 8oz King Salmon* $ 14.00 Large Shrimp (4)* $ 16.00 From the Grill Served with herb salad, blistered shishito peppers with choice of sauce. Prepared Blackened, Grilled or Pan-Seared 8oz Center-Cut Filet Mignon $ 40.00 8oz Skirt Steak $ 23.00 14oz New York Strip $ 48.00 8oz Airline Chicken Breast $ 20.00 8oz Florida Grouper $ 28.00 Chef's Daily Catch MP Accessories: Bearnaise sauce, pickled peppadew chimichurri, black truffle butter, burgundy demi, tomatillo salsa verde Specialties Roasted Veggie Stack* $ 20.00 Zucchini, red pepper, yellow squash, eggplant, crispy parsley, tomato vinaigrette, herb oil Rotisserie Chicken* $ 24.00 Sweet tea brined, smashed Yukon gold potatoes, collard greens, onion gravy Gargannelli Pasta Bowl $ 20.00 Tomato sauce, fried basil, crispy prosciutto Grilled Pork Chop* $ 30.00 Wild rice pilaf, bacon apple butter Braised Prime Beef Rib $ 36.00 Applewood smoked bacon potato salad, black cherry BBQ sauce Sides Sticky Brussels Sprouts $ 8.00 Roasted Seasonal Vegetables $ 8.00 Bacon Cream Spinach $ 10.00 Charred Garlic Broccoli $ 8.00 Loaded Baked Potato $ 10.00 Truffle Pomme Frites $ 10.00 *Gluten-free menu items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. A gratuity of 20% will be added to parties of six or more. Country Club > Kids Menu Kids Menu *Ages 12 and UNDER* CHEDDAR MAC & CHEESE $ 12.00 GRILLED CHEESE $ 12.00 Sourdough Bread I Cheddar Cheese CHICKEN FINGERS (3) $ 12.00 French Fries I Honey Mustard I Tomato Ketchup KIDS PASTA $ 12.00 Parmesan Cheese | Fettuccine | Tomato Sauce CHICKEN QUESADILLA $ 12.00 Cheddar Cheese | Grilled Chicken breast | Salsa | Sour Cream CHEESE BURGER $ 12.00 American Cheese I Served on a Warm Honey Wheat Bun LOBSTER ROLL $ 12.00 Lettuce I Lobster Roll I Toasted Lobster Roll Served with choice of one side: Fresh Fruit Plate | Coleslaw | French Fries or Sweet Potato Fries *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A gratuity of 20% will be added to parties of six or more. Country Club Lunch Menu Appetizers Pita & Dips (v) $ 4.00 hummus, bomba, garden vegetables, grilled pita Warm Salted Pretzel (v) $ 13.00 cheese sa uce, craft beer mustard sauce Shrimp Cocktail (S) (gf) $ 20.00 COCÜfä Ïl SüIUCe', Cha rred IE'mon Buffalo Chicken Wings (B) $ 16.00 celery, carrot, ranch dressing Salads Caesar Salad $ 11.00 romaine, parmesan, croutons Wedge Salad (gf) $ 12.00 iceberg, bacon bits, heirloom tomatoes, gorgonzola dressing Creek Salad (v, gf) $ 13.00 tomatoes, feta, cucumbers, red onion, kalamata, pepperoncini, lemon oregano 19th Hole Buffet $18 Assortment of Sandwiches and Wraps Soup & Salad Bar with available protein Variety of Dessert offerings Main Healthy Salmon (gf) $ 25.00 herb rice pilaf, grilled vegetables, charred lemon Falafel Power Bowl (v, gf) $ 19.00 kale, butternut squash, beets, avocado, walnuts, dried cranberries, tahini dressing Handhelds Blackened Chicken $ 16.00 honey mustard, a rug ula, tomato, avocado, ciabatta Turkey Club $ 16.00 shaved turkey breast, bacon, bibb, tomato, avocado mayo, house wheat The Rachel $ 16.00 black pepper crested pastrami, sauerkraut, swiss, thousand island, rye Impossible Burper (v) $ 18.00 plant based, bread n butter pickle, spicy aioli, brioche bun Cheeseburger $ 18.00 8oz blend of chuck, american cheese, shortrib & brisket, bread n butter pickle, spicy aioli, brioche bun Sides & add ons Fries Sweet Patato Fries Coleslaw Fresh Fruit Grilled Chicken $ 8.00 Blackened Salmon $ 10.00 Cajun Shrimp $ 12.00 *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A gratuity of 20% will be added to parties of six or more. Beach Club Kids Menu All items are served with a choice of one side: Fresh fruit cup, Coleslaw, French fries or Sweet potato fries Kids Menu KIDS PASTA $ 14.00 Cavatappi Pasta Choice of Cheese Sauce Tomato Sauce Butter Sauce CHEESE BURGER $ 16.00 Brioche Bun, Lettuce Tomato Choice of Fruit or French Fries CHICKEN TENDERS $ 12.00 Southern Style Breaded Chicken Tenders Honey Mustard, and Ranch Choice of Fruit or French Fries GRILLED CHEESE $ 12.00 White Bread American Cheese Cheddar Cheese Choice of Fruit or French Fries ALL BEEF HOT DOG $ 14.00 Soft Brioche Roll Choice of Fruit or French Fries GRILLED CHICKEN BREAST $ 18.00 Choice of Steamed Asparagus French Fries BIG WARM BROWNIE $ 12.00 Vanilla Gelato, Chocolate Sauce, Oreo Pieces, Cherries *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A 20% service charge and applicable taxes will be added to the check. Beach Club > Lite Fare Menu Lite Fare Cilantro Edamame Hummus $ 12.00 Krackle chips, radishes, citrus oil, black sesame seeds Charcuterie Board $ 24.00 Assorted meats + cheeses, fig jam, apricot spread, truffle honey, crostini Warm Seagate Lobster Roll $ 22.00 Scallion, charred lemon Maple Smoked Cheddar Burger $ 18.00 Grilled apple smoked bacon, butter lettuce, heirloom tomato slice, brioche bun Char-Grilled Octopus* $ 16.00 Romesco sauce, quinoa salad, charred tomato, marinated artichokes, arugula Greek Salad* $ 14.00 Romaine lettuce, feta cheese, cucumber ribbons, olive medley, red onion, heirloom tomatoes, oregano red wine vinaigrette Salad Enhancements Falafel Balls (6)* $ 8.00 Cold Water Lobster Tail* $ 18.00 8oz Marinated Grilled Chicken Breast* $ 10.00 8oz King Salmon* $ 16.00 Large Shrimp (4)* $ 14.00 *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A gratuity of 20% will be added to parties of six or more. Beach Club Dinner Menu Bites SMASHED AVOCADO (V, GF) $ 16.00 Corn Tortilla Chips, Feta Cheese, Pomegranate Seeds HUMMUS (V) $ 15.00 Traditional & Roasted Pepper Hummus, Garden Vegetables, Grilled Pita WATERMELON & TOMATO GAZPACHO (V, GF) $ 11.00 Mediterranean Cucumber Salad, Fresh Micro Mint CAULIFLOWER BITES (V) $ 17.00 Crispy Tempura Cauliflower, Blue Cheese Crumble, Cajun Buffalo Sauce STEAMED MUSSELS DIABLO $ 20.00 White Wine, Tomato Sauce, Red Pepper, Garlic Crostini MARKET OYSTERS (6 pieces)  (GF) $ 24.00 Cocktail Sauce, White Balsamic-Lemon Mignonette JUMBO SHRIMP COCKTAIL (GF) $ 22.00 Cocktail Sauce, Lemon TUNA POKE BOWL $ 28.00 Brown Sushi Rice, Mango, Avocado, Edamame Roasted Corn, Scallions, Sesame, Soy Dressing Salads CAESAR SALAD $ 17.00 Romaine, Caesar Dressing, Focaccia Croutons BEACH SALAD (V, GF) $ 19.00 Romaine, Cucumber, Heirloom Tomatoes, Olives, Red Onion, Feta, Lemon Vinaigrette GREEK SALAD (V, GF) $ 18.00 Romaine, Cucumber, Heirloom Tomatoes, Olives Pepperoncini, Red Onion, Feta, Lemon Vinaigrette SEAFOOD COBB (GF) $ 30.00 Lobster, Shrimp, Egg, Avocado, Tomatoes, Bacon Garden Greens, Ranch Dressing BURRATA SALAD (GF) $ 22.00 Local Tomatoes, Heirloom Cherry Tomatoes, Arugula, Balsamic, Pesto, Sea Salt Comfort All comfort is served with a choice of side. Fries, Sweet Fries, Market Salad, Cole Slaw, Fruits NEW ENGLAND LOBSTER ROLL $ 34.00 Celery, Cajun Mayo, Toasted Bun FISH N CHIPS $ 30.00 Beer Battered Cod, Herb Fries, Tartar Sauce Grilled Lemon, Malt Vinegar MAHI-MAHI FISH TACOS $ 23.00 Flour Tortilla, Avocado Crema, Creamy Slaw, Salsa SAND DOLLAR BURGER BAR $ 25.00 Choice of One Seagate All Beef Blend | Turkey | Impossible Spicy Aioli, Bibb, Tomato, Red Onion, B&B Pickles Cheddar, Brioche Bun Mains PAN SEARED BRANZINO (GF) $ 34.00 Wilted Spinach, Ratatouille Vinaigrette BLACKENED SALMON $ 34.00 Avocado Aioli, Corn-Edamame Succotash FRESH CATCH (GF) $ 36.00 Simply Grilled, Key Lime Tartar, Grilled Lemon LOBSTER RISOTTO (GF) $ 38.00 Oven Roasted Tomatoes, Peas, Asparagus, Shaved Parmesan, Fresh Basil STEAK FRITES $ 38.00 10 oz Wagyu Skirt Steak, Chimichurri, Fries RIGATONI BOLOGNESE $ 28.00 House Made Beef, Veal & Tomato Sauce Parmesan, Basil, Garlic Toast GRILLED 6OZ FILET (GF) $ 48.00 Loaded Baked Potato, Grilled Asparagus, Chive Butter, Sea Salt Additions GRILLED CHICKEN $ 10.00 BLACKENED SALMON $ 12.00 CAJUN SHRIMP $ 12.00 WAGYU FLANK STEAK $ 14.00 Sides FRENCH FRIES $ 8.00 BAKED POTATO $ 8.00 MARKET SALAD $ 8.00 FRUIT SALAD $ 8.00 SWEET FRIES $ 8.00 WILTED SPINACH $ 8.00 GRILLED ASPARAGUS $ 8.00 BRUSSELS SPROUTS $ 8.00 *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A 20% service charge and applicable taxes will be added to the check. Beach Club Lunch Menu Bites SMASHED AVOCADO (V, GF) $ 16.00 Corn Tortilla Chips, Feta Cheese, Pomegranate Seeds HUMMUS (V) $ 16.00 Traditional & Roasted Pepper Hummus, Garden Vegetables, Grilled Pita WATERMELON & TOMATO GAZPACHO (V, GF) $ 11.00 Mediterranean Cucumber Salad, Fresh Micro Mint CAULIFLOWER BITES (V) $ 17.00 Crispy Tempura Cauliflower, Blue Cheese Crumble Cajun Buffalo Sauce JUMBO SHRIMP COCKTAIL (GF) $ 22.00 Cocktail Sauce, Lemon TUNA POKE BOWL $ 28.00 Brown Sushi Rice, Mango, Avocado, Edamame Roasted Corn, Scallions, Sesame, Soy Dressing CRISPY HONEY HOT WINGS (8 pieces) $ 18.00 Celery, Carrots, Honey Mustard Sauce Handhelds All handhelds are served with a choice of side. Fries, Sweet Fries, Market Salad, Cole Slaw, Fruits NEW ENGLAND LOBSTER ROLL $ 34.00 Celery, Cajun Mayo, Toasted Bun TUNA SALAD WRAP $ 21.00 Spinach Wrap, Bibb Lettuce, Tomato CAJUN FISH SANDWICH $ 24.00 Key Lime Tartar, Tomato, Tropical Slaw, Brioche Bun MAHI-MAHI FISH TACOS $ 23.00 Flour Tortilla, Avocado Crema, Creamy Slaw, Salsa GRILLED CHICKEN CAPRESE SANDWICH $ 22.00 Local Tomatoes, Mozzarella, Arugula Pesto Brioche Bun BEACH CLUB $ 22.00 Roasted Turkey, Lettuce, Tomato Smoked Bacon, Swiss, Avocado Aioli Multigrain Toast SAND DOLLAR BURGER BAR $ 25.00 Choice of One Seagate All Beef Blend | Turkey | Impossible Spicy Aioli, Bibb, Tomato, Red Onion, B&B Pickles Cheddar, Brioche Bun Mains PAN SEARED BRANZINO (GF $ 34.00 Wilted Spinach, Ratatouille Vinaigrette FRESH CATCH (GF) $ 36.00 Simply Grilled, Key Lime Tartar, Grilled Lemon FISH N CHIPS $ 30.00 Beer Battered Cod, Herb Fries, Tartar Sauce Grilled Lemon, Malt Vinegar STEAK FRITES $ 38.00 10oz Wagyu Flank Steak, Chimichurri, Fries Salads CAESAR SALAD $ 17.00 Romaine, Caesar Dressing, Focaccia Croutons BEACH SALAD (V, GF) $ 19.00 Spinach, Kale, Orange, Avocado, Dried Cherries Quinoa, Pinenuts, Citrus Vinaigrette GREEK SALAD (V, GF) $ 18.00 Romaine, Cucumber, Heirloom Tomatoes, Olives, Red Onion, Feta, Lemon Vinaigrette SEAFOOD COBB  (GF) $ 30.00 Lobster, Shrimp, Egg, Avocado, Tomatoes, Bacon Garden Greens, Ranch Dressing BURRATA SALAD (GF) $ 22.00 Local Tomatoes, Heirloom Cherry Tomatoes Arugula, Balsamic, Pesto, Sea Salt Additions GRILLED CHICKEN $ 10.00 BLACKENED SALMON $ 12.00 CAJUN SHRIMP $ 12.00 WAGYU FLANK STEAK $ 14.00 Sides FRENCH FRIES $ 8.00 SWEET FRIES $ 8.00 SEASONAL FRUIT $ 8.00 MARKET SALAD $ 8.00 ASPARAGUS $ 8.00 COLE SLAW $ 8.00 *Gluten Free Menu Items. Consuming raw or undercooked meat, seafood, shellfish or eggs may increase your risk of food borne illness. There is risk associated with consuming raw oysters. If you have chronic illness of the liver, stomach or blood, or have immune disorders, you are at greater risk of serious illness from raw oysters, and should eat oysters fully cooked. If unsure of your risk, consult a physician. A 20% service charge and applicable taxes will be added to the check. Breakfast Menu Bakery Blueberry Muffin $ 3.00 Butter Croissant $ 3.00 Scone $ 3.00 Homemade Biscuit $ 4.00 Delray Beach honey, house made strawberry jam Monkey Bread $ 10.00 Cinnamon vanilla caramel Bowls + Bites House Made Granola $ 13.00 Greek yogurt, local honey, market fruit Steel Cut Oatmeal $ 10.00 Seasonal berries, brown sugar Berry Bowl† $ 10.00 Tropical Fruit Plate† $ 14.00 Seasonal selection of fruits Avocado Toast $ 15.00 Whipped ricotta, basil, lemon zest, poached egg, roasted tomato, balsamic glaze Add beet cured salmon +8 Entreés Cajun Breakfast Hash $ 21.00 Shrimp, andouille sausage, peppers, onion, potato, sunny-up egg, avocado, Cajun butter Seagate All American $ 20.00 Two eggs any style with breakfast potatoes and your choice of applewood smoked bacon, chicken sausage or griddled ham Add avocado +2.50 Omelet Your Way $ 21.00"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "text": "Contact Us - Delray Beach Golf Club Skip to main content Skip to primary sidebar Delray Beach Golf Club Delray Beach, FL Open to the Public! |  (561) 243-7385 | 2200 Highland Avenue, Delray Beach, FL, 33445 Tee Times Golf Rates Photo Gallery Course History Scorecard Practice Area Getting Started at DBGC Calendar Instruction Professional Teaching Staff Clinics & Junior Programs Loyalty Card Weddings & Events Director of Catering, Bryan Tyrell Events Photo Gallery Catering Event Calendar Restaurant Restaurant Menu Join E-Club Contact Course Managers Join the Team Book Tee Times E-Club Signup Contact Us Delray Beach Golf Club 2200 Highland Avenue, Delray Beach, FL, 33445 Hours of Operation Open Daily from 6:45am – 6:00 pm Main # : (561) 243-7385 Fax # : (561) 243-7386 Bryan Tyrell Director of Clubhouse Operations Bryan@jcdsportsgroup.com For information on JCD Sports Group’s other courses, please visit www.jcdsportsgroup.com . Primary Sidebar Quick Links Tee Times Rates Scorecard Getting Started at DBGC Contact Us Delray Beach Golf Club | 2200 Highland Avenue | Delray Beach, FL 33445 | (561) 243-7385 Copyright © 2025 Delray Beach Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://bocaratonobserver.com/locations/delray-beach-club/",
      "text": "Delray Beach Club - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home Delray Beach Club Delray Beach Club 2001 S. Ocean Blvd. , Delray Beach , Florida 33483 Print Video Photos × 1 of 4 × 2 of 4 × 3 of 4 × 4 of 4 Prev Next Phone 561-278-6226 Visit Website The Delray Beach Club is a private member-owned Beach Club that sits on 3.5 acres of pristine oceanfront property overlooking the illustrious Atlantic Ocean. This exclusive Beach Club, that was recently renovated, has a history and heritage of over 40 years. A lot has changed in the past 40 years, but not our original premise of providing a nurturing, exciting, illuminating and social epicenter for like minds to gather for sun, surf, dining, intellectual pursuits, sports and fitness. Since its inception in 1969 the Delray Beach Club has remained a family oriented beach club with unlimited social and sporting activities for families, couples and singles of all ages. If you have children we have a kid’s camp as well as social and recreational sports and activities for young people. For adults the activities are endless. We have social events such as evening galas, holiday parties, themed dinners, cocktail parties, pool parties, happy hour and nightly entertainment. We also sponsor outings that are cultural and educational in nature, as well as excursions for those who like to explore the outer parameters of Florida. There are also many activities to challenge your more cerebral inner landscape. We have bridge games and lessons (also duplicate and twosomes), canasta, a book club, theater trips, luncheons, a lecture series, musical entertainment, holiday celebrations and other group activities for your entertainment and enlightenment. We also have a fitness facility to energize and exercise your most precious asset – Your Body. There are men’s and women's locker rooms, various massages and treatments, state-of-the-art fitness equipment, exercise classes, water aerobics, personal training sessions, Har-Tru® tennis courts (tennis instruction and tennis events), a gym attendant and other activities year round. We also have dining areas to fit your mood and lifestyle. They range from our Ocean Room (with a picture window overlooking the ocean) to our newly renovated Grille Room where Ernest Hemingway would have been proud to hold court. There is also a poolside bar, a newly constructed pavilion and kitchen with a pizza oven serving food 5 days a week. To help everyone get to know each other we have Friday night Mix and Mingle Events outside by the pool. It is there you can make new friends, enjoy old ones and trip the night fantastic under the stars! Make The Delray Beach Club your Home Away From Home Back to Search Results Tags Beach Tennis 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.linkedin.com/company/delray-beach-club",
      "text": "DELRAY BEACH CLUB | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now DELRAY BEACH CLUB Hospitality DELRAY BEACH, Florida 376 followers The DBC is a Private Beach, Aquatics, Fitness & Tennis Club located 1/4 mile south of Linton Ave. Follow View all 30 employees Report this company About us At The Delray Beach Club, we take great pride in catering to our members, their families, friends, guests and colleagues. We offer a variety of venues for every age group. The focal point is the majesty of the Atlantic Ocean. Located in beautiful surroundings, we have one thing in mind – your complete relaxation and enjoyment with no luxury left unfulfilled. Located on three acres with 350 feet of stunning beach front, we provide a resort-style setting offering pool, beach & ocean fun, tennis & fitness, a variety of social activities and dining experiences along with entertainment. Website http://delraybeachclub.com External link for DELRAY BEACH CLUB Industry Hospitality Company size 51-200 employees Headquarters DELRAY BEACH, Florida Type Privately Held Locations Primary 2001 S OCEAN BLVD DELRAY BEACH, Florida 33483, US Get directions Employees at DELRAY BEACH CLUB Samuel Fried Consigliere to founders and boards Kara Wiswall Director of Human Resources David Morales Culinary Curator Damian Burke Director of Operations See all employees Updates DELRAY BEACH CLUB 376 followers 4mo Report this post ☀️ Your Summer Starts Here! ☀️ 24 2 Comments Like Comment Share DELRAY BEACH CLUB 376 followers 5mo Report this post 📣 Summer just got even better! ☀️\n ⁣\nJoin the Delray Beach Club from May 23 – October 31, 2025 and experience the BEST of summer as a Summer Member! 🐚\n ⁣\n ✨ Private beach access\n ✨ Oceanfront dining & social events\n ✨ Poolside and beach Fun for the whole family\n ⁣\n It’s all happening at your exclusive beachside getaway in Delray Beach! 🌊\n ⁣\n📩 Contact Diane Roberts at droberts@thedelraybeachclub.com or call 561-921-0244 for more info. 20 Like Comment Share DELRAY BEACH CLUB reposted this DELRAY BEACH CLUB 376 followers 8mo Report this post We're Hiring! Join Our Team! If you're interested, please contact Gary Lewis at careers@thedelraybeachclub.com . We’d love to hear from you!\n\nKnow someone who might be a great fit? Share this opportunity with them! #Hiring #CareerOpportunities #JoinOurTeam 33 3 Comments Like Comment Share DELRAY BEACH CLUB reposted this DELRAY BEACH CLUB 376 followers 8mo Report this post We're Hiring! Join Our Team! If you're interested, please contact Gary Lewis at careers@thedelraybeachclub.com . We’d love to hear from you!\n\nKnow someone who might be a great fit? Share this opportunity with them! #Hiring #CareerOpportunities #JoinOurTeam 33 3 Comments Like Comment Share DELRAY BEACH CLUB 376 followers 8mo Report this post We're Hiring! Join Our Team! If you're interested, please contact Gary Lewis at careers@thedelraybeachclub.com . We’d love to hear from you!\n\nKnow someone who might be a great fit? Share this opportunity with them! #Hiring #CareerOpportunities #JoinOurTeam 33 3 Comments Like Comment Share Join now to see what you are missing Find people you know at DELRAY BEACH CLUB Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Team Pelican Atlantic Beach Country Club Hospitality Atlantic Beach, FL High Ridge Country Club Hospitality Boynton Beach, Florida Grand Harbor Golf and Beach Club Hospitality Vero Beach, Florida Aberdeen Golf & Country Club Hospitality Boynton Beach, FL Aloft Delray Beach Hotel Hospitality Delray Beach, Florida Delray Beach Community Redevelopment Agency Government Administration Delray Beach, FL Healing Manor Hotel, Grimsby Hospitality Grimsby, Lincolnshir, Lincolnshire Lago Mar Country Club Spectator Sports Plantation, Florida Makena Golf & Beach Club Hospitality Kihei, Hawaii Show more similar pages Show fewer similar pages Browse jobs Bartender jobs 74,499 open jobs Server jobs 186,577 open jobs Account Executive jobs 71,457 open jobs Real Estate Analyst jobs 28,041 open jobs Sales Consultant jobs 91,260 open jobs Salesperson jobs 172,678 open jobs Executive jobs 690,514 open jobs Marketing Coordinator jobs 36,340 open jobs Client Analyst jobs 46,132 open jobs Hospitality Specialist jobs 62,565 open jobs Marketing Director jobs 53,789 open jobs Social Media Manager jobs 27,779 open jobs Concierge jobs 66,817 open jobs Sales Development Representative jobs 45,085 open jobs Real Estate Agent jobs 44,326 open jobs Assistant jobs 711,811 open jobs Sales Technician jobs 78,850 open jobs Business Development Associate jobs 31,101 open jobs Trader jobs 6,670 open jobs Manager jobs 1,880,925 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Server jobs Bartender jobs Business Development Representative jobs Account Executive jobs Technician jobs Account Manager jobs Assistant jobs Ambassador jobs Yacht Broker jobs Business Development Specialist jobs Analyst jobs Veterinarian jobs Nurse jobs Director jobs Cocktail Server jobs Director of Operations jobs Customer Service Representative jobs Life Coach jobs Director Restaurant jobs Senior Director jobs Culinary Director jobs Manager jobs Content Producer jobs Client Manager jobs Medical Specialist jobs Vice President Operations jobs Construction Inspector jobs Concierge jobs Plant Controller jobs Marketing Manager jobs Specialist jobs Accounting Supervisor jobs Quality Inspector jobs Control Engineer jobs Industrial Engineer jobs Financial Controller jobs Accounting Manager jobs Design Engineer jobs Vice President jobs Controller jobs Mechanical Engineer jobs Aquatics Manager jobs Decorator jobs Administrator jobs Assistant Director of Food And Beverage jobs Social Media Manager jobs Bakery Manager jobs Tax Lawyer jobs Land Surveyor jobs Safety Engineer jobs Service Technician jobs Safety Manager jobs Planner jobs Chief Financial Officer jobs Attorney jobs Officer jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at DELRAY BEACH CLUB Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "text": "Contact Details | Country Manors Association, Inc. Skip to content Country Manors Association, Inc. Home About Us Contact Us × Home About Us Contact Us Home About Us Contact Us × Home About Us Contact Us Contact Us Reach Out To Us Thanks for stopping by! Country Manors Association, Inc. is a condominium association with villas that carry all the necessary amenities. The condominium has eight sections, each with a heated pool and a carport for each villa. Enjoy the benefits by becoming a member. If you wish to become a member or need further information on our condominium, please do not hesitate to contact us. For any other questions or concerns, you may have, drop us a line! Contact Info Phone (561) 498-8300 Fax (561) 498-4099 4900 Country Manors Boulevard, Delray Beach, FL 33445 cmaoffice@countrymanors.net send us a message Name * * Phone * * Email * * Message Comments This field is for validation purposes and should be left unchanged. Country Manors Association, Inc. 4900 Country Manors Boulevard Delray Beach, FL 33445 cmaoffice@countrymanors.net Tuesday: 9:00 AM - 12:00 NOON Wednesday: 3:00 PM -6:00 PM Friday: 9:00 AM -12:00 NOON Home About Us Contact Us © 2025, Country Manors Association, Inc. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://delraybeach.com/membership/chairmans-club/",
      "text": "Delray Beach Chairman's Club"
    },
    {
      "url": "https://www.delraylibrary.org/contact/",
      "text": "Contact - Delray Beach Public Library Skip to content (561) 266-0194 100 W. Atlantic Ave. Delray Beach, FL 33444 View Our Hours Facebook X-twitter Instagram Linkedin Youtube Mdi-bookshelf Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies & Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Special Events Laugh with the Library The Very Berry Bake Off Do Good Delray 2025 Retail Therapy Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Something for Everyone Study Rooms Technology, Training & Innovation Lab 3D Printing Large Format Printing Recording Studio Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Library Giving Day Our History Past Newsletters Staff Directory Volunteer Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies & Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Special Events Laugh with the Library The Very Berry Bake Off Do Good Delray 2025 Retail Therapy Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Something for Everyone Study Rooms Technology, Training & Innovation Lab 3D Printing Large Format Printing Recording Studio Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Library Giving Day Our History Past Newsletters Staff Directory Volunteer My Account Get Your Card! Donate! Catalog Website Contact Us Connect with Your Library! Hello from the Delray Beach Public Library! Your feedback and inquiries are important to us. We strive to make our library a welcoming and resourceful place for everyone in the community. Here’s how you can get in touch: Hours Mon–Wed: 9AM - 8PM Thu–Sat: 9AM - 5PM Sun: 1PM - 5PM (Sep–May) Main Desk / Circulation Phone: (561) 266-0194 Fax: (561) 266-9757 Reference Phone: (561) 266-0196 Reference@DelrayLibrary.org Use the form below for a convenient way to reach us! Name Email Subject Message / Questions / Comments Send Holiday Schedule (Closings) January 1, 2025: New Year’s Day (Wednesday) January 20, 2025: Martin Luther King Jr. Day (Monday) February 17, 2025: Presidents’ Day (Monday) April 18, 2025: Good Friday/Passover (Friday) April 20, 2025: Easter (Sunday) May 26, 2025: Memorial Day (Monday) June 19, 2025: Juneteenth Day (Thursday) July 4, 2025: Independence Day (Friday) September 1, 2025: Labor Day (Monday) October 13, 2025: Indigenous People’s Day (Monday) November 11, 2025: Veterans Day (Tuesday) November 26, 2025: Day before Thanksgiving- close at 5:00 pm November 27, 2025: Thanksgiving (Thursday) November 28, 2025: Friday after Thanksgiving December 24, 2025: Christmas Eve – close at noon (Wednesday) December 25, 2025: Christmas (Thursday) December 31, 2025: New Year's Eve – close at noon (Wednesday) Would you like to support the amazing work your local nonprofit library is doing? Donations Welcome! Volunteer Today! Newsletter Sign-Up! Statistics The Delray Beach Public Library , one of only two nonprofit public libraries operating in the State of Florida, is dedicated to igniting curiosity, fueling discovery and encouraging creativity through access to trusted information, reliable resources and vital community connections. Welcome! (561) 266-0194 100 W. Atlantic Ave. Delray Beach, FL 33444 View Our Hours Follow Us! Facebook X-twitter Instagram Linkedin Youtube Mdi-bookshelf Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies/Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs View All Classes & Programs Children’s Classes & Programs Babies/Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Research Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Recording Studio Something for Everyone Study Rooms Technology, Training & Innovation Lab Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Recording Studio Something for Everyone Study Rooms Technology, Training & Innovation Lab Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Our History Past Newsletters Staff Directory Volunteer About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Our History Past Newsletters Staff Directory Volunteer Delray Beach Public Library 2024. All Rights Reserved. Legal Disclaimer Privacy Policy This library has been funded under the provisions of the State Aid to Libraries Grant program, which is administered by the Florida Department of State’s Division of Library and Information Services. Website Design By The Non-Profit Team & ABO Design Library Hours Mon–Wed: 9AM - 8PM Thu–Sat: 9AM - 5PM Sun: 1PM - 5PM (Sep–May) Seasonal Hours Winter Hours Sep–May Mon-Wed: 9am-8pm Thurs-Sat: 9am-5pm Sun: 1pm-5pm Summer Hours June–August Mon-Wed: 9am-8pm Thurs-Sat: 9am-5pm Stay Connected with the Delray Beach Public Library! Don’t miss out on the latest library events, programs, and resources. Sign up for our newsletter today and get updates delivered straight to your inbox! Join our community and stay informed – it’s free! First Name Last Name Email Send"
    }
  ]
}