{
  "fuentes": [
    {
      "url": "https://www.delraymarket.com/event-list",
      "email": "drbgroupllc@drbgroupllc.com"
    },
    {
      "url": "https://www.delraymom.com/event/marketplace-music-fest/",
      "email": "drbgroupllc@drbgroupllc.co"
    },
    {
      "url": "https://www.delraymom.com/event/marketplace-music-fest/",
      "email": "drbgroupllc@drbgroupllc.com"
    },
    {
      "url": "https://delraycra.org/green-market/",
      "email": "johnsonlori@mydelraybeach.com"
    },
    {
      "url": "https://www.delraymarket.com/event-list?category=Live+Music",
      "email": "delraysales@frankcompanies.com"
    },
    {
      "url": "https://www.delraymarket.com/event-list?category=Live+Music",
      "email": "drbgroupllc@drbgroupllc.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "aurora@mexicankitchen.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "contact@icestasy.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "contact@mondepice.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "info@lapaellachef.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "johnsonlori@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "jon@sciabica.com"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "email": "lmflows@att.net"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "johnsonj@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "markert@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "weberm@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "burns@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "cabrerai@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "carney@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "casale@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "claytong@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "gdaniecg@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "jadusinghr@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "johnsonlori@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "long@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "pamerm@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "pelissierd@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "tibbsc@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "waterlandert@mydelraybeach.com"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "email": "weberm@mydelraybeach.com"
    },
    {
      "url": "https://www.delraymarket.com/event-list/2019/10/2/music-fest",
      "email": "drbgroupllc@drbgroupllc.com"
    },
    {
      "url": "https://www.delraymarket.com/event-list/sip-shop",
      "email": "drbgroupllc@drbgroupllc.com"
    }
  ],
  "mails": [
    "aurora@mexicankitchen.com",
    "burns@mydelraybeach.com",
    "cabrerai@mydelraybeach.com",
    "carney@mydelraybeach.com",
    "casale@mydelraybeach.com",
    "claytong@mydelraybeach.com",
    "contact@icestasy.com",
    "contact@mondepice.com",
    "delraysales@frankcompanies.com",
    "drbgroupllc@drbgroupllc.co",
    "drbgroupllc@drbgroupllc.com",
    "gdaniecg@mydelraybeach.com",
    "info@lapaellachef.com",
    "jadusinghr@mydelraybeach.com",
    "johnsonj@mydelraybeach.com",
    "johnsonlori@mydelraybeach.com",
    "jon@sciabica.com",
    "lmflows@att.net",
    "long@mydelraybeach.com",
    "markert@mydelraybeach.com",
    "pamerm@mydelraybeach.com",
    "pelissierd@mydelraybeach.com",
    "tibbsc@mydelraybeach.com",
    "waterlandert@mydelraybeach.com",
    "weberm@mydelraybeach.com"
  ],
  "nombre_sitio": "delraymarket.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.delraymarket.com/event-list",
      "text": "Events — Delray Marketplace Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions The place to shop, dine and play in Delray Beach. Sep 2 to Sep 30 Events , Amphitheater Yoga on the Green Tue, Sep 2, 2025 5:30 PM 17:30 Tue, Sep 30, 2025 6:30 PM 18:30 Delray Marketplace (map) Google Calendar ICS Our FREE yoga sessions are back! Love yoga or thinking about trying it out? We are offering a series of FREE yoga sessions at the Delray Marketplace amphitheater with certified yoga instructor, Kim Rose Flows! Pick a date that works for you, or sign up for all. Enjoy first and last Tuesday evening sessions from 5:30-6:30pm through May. Sign up for the free session here: Tuesday, September 2: https://www.eventbrite.com/e/1571451215889?aff=oddtdtcreator Tuesday, September 30: https://www.eventbrite.com/e/1571515698759?aff=oddtdtcreator Remember to bring your own mat. Events subject to change without notice. By participating in this exercise or exercise program, you agree that you do so at your own risk and are voluntarily participating in these activities. Delray Marketplace and the instructor are not responsible for any injuries. For more information, email drbgroupllc@drbgroupllc.com. View Event → Oct 1 to Apr 29 Events , Amphitheater , Family , Live Entertainment , Live Music Delray Marketplace Music Fest Wed, Oct 1, 2025 6:00 PM 18:00 Wed, Apr 29, 2026 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 1 through April 29, 2025, 6-8pm. MUSIC FEST SCHEDULE: OCTOBER 1 The Prymates Classic Rock and More OCTOBER 8 Mojo's Katel Classic Rock OCTOBER 15 The Cool Water Band Best of the 50's, 60's, 70's & 80's OCTOBER 22 Mad Mellow 80's thru Today, including Reggae OCTOBER 29 Cover to Cover Band Rock ’N Roll NOVEMBER 5 The Gritty Groove Rock Dance and Pop NOVEMBER 12 Mischief Party & Dance, Hits of Today NOVEMBER 19 Whisky Six Band South Florida's Favorite Local Country Band NOVEMBER 26 It Takes Two 50's thru Today DECEMBER 3 Doubleback The Best Hits of the 80's DECEMBER 10 Dance Party 3X Disco and R&B Hits DECEMBER 17 Forever Eric Eric Clapton Tribute DECEMBER 24 Christmas Eve - NO CONCERT DECEMBER 31 New Year’s Eve - NO CONCERT JANUARY 7 Bombshell 80's thru Today, Top 40 Music JANUARY 14 Relentless Classic Rock and Top 40 JANUARY 21 Preservation Road Rock and Blues JANUARY 28 Anthony Quaranti The Sinatra Songbook FEBRUARY 4 Don’t Stop the Music Doo Wop, Motown, Disco and Classic Rock FEBRUARY 11 Six Foot Swell Surf Band Surf and Rock N Roll FEBRUARY 18 3siXty Classic Rock & Pop FEBRUARY 25 Live Feed Rock, Pop, Funk & Dance MARCH 4 Jupiter Rock Farm Classic Rock & Pop MARCH 11 The Fake News Huey Lewis & the News Tribute Band MARCH 18 The Renegades Dance Rock, 70's - 90's MARCH 25 Krush Party Band Motown Disco, Party Dance Music APRIL 1 Happy Daze Band Oldies, 50's and 60's APRIL 8 Trial and Error Rock, Pop and Jazz APRIL 15 ReVibe Dance Party Music, 70's thru today APRIL 22 The Prymates Classic Rock and More APRIL 29 Mojo's Katel Classic Rock Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Aug 7 to Sep 8 Events Summer Splash $100 Gift Card Giveaway Thu, Aug 7, 2025 12:00 AM 00:00 Mon, Sep 8, 2025 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Apr 12 11:00 AM 11:00 Events , Amphitheater , Family Easter Egg Hunt Saturday, April 12, 2025 11:00 AM 2:00 PM 11:00 14:00 Delray Marketplace (map) Google Calendar ICS A Fun Celebration for the Entire Family! Children up to age 10 can hunt for fun-filled Easter Eggs (by age group): • Easter Egg Hunt Schedule Ages 2 and under……11:15am Ages 3-5……12:00pm Ages 6-8……12:45pm Ages 9-10……1:30pm • Face Painters • Train Rides • Games and Crafts • Music • Palm Beach Sheriff’s Department Vehicle Display Rain Date: Sunday, April 13 Egg Hunt taking place at the Amphitheater, other activities throughout Delray Marketplace. While supplies last. Some eggs contain toys that are suitable for ages 4 and up. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Apr 11 to May 12 Events Mother’s Day $100 Gift Card Giveaway Fri, Apr 11, 2025 12:00 AM 00:00 Mon, May 12, 2025 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Jan 22 to Feb 17 Events We Love Our Customers $100 Gift Card Giveaway Wed, Jan 22, 2025 12:00 AM 00:00 Mon, Feb 17, 2025 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Nov 23 3:00 PM 15:00 Events , Family , Amphitheater Holiday Happenings Saturday, November 23, 2024 3:00 PM 6:00 PM 15:00 18:00 Delray Marketplace (map) Google Calendar ICS Join us for a night of free fun, music and celebration! Tree Lighting at Dusk! • Visit with Santa • Carolers • Crafts • Trackless Train • Face Painting • Performers • Activities • Hot Cocoa • Local Dignitaries Rain date: Sunday, November 24, 2024 While supplies last. Weather permitting. Event subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com View Event → Nov 8 to Dec 2 Events Give Thanks $100 Gift Card Giveaway Fri, Nov 8, 2024 12:00 AM 00:00 Mon, Dec 2, 2024 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Nov 5 to May 27 Amphitheater , Events , Fitness in the Park Yoga on the Green Tue, Nov 5, 2024 5:30 AM 05:30 Tue, May 27, 2025 6:30 PM 18:30 Delray Marketplace (map) Google Calendar ICS Love yoga or thinking about trying it out? We are offering a series of FREE yoga sessions at the Delray Marketplace amphitheater with certified yoga instructor, Kim Rose Flows! Pick a date that works for you, or sign up for all. Enjoy first and last Tuesday evening sessions from 5:30-6:30pm through May. Sign up for each class by clicking the links below: Tuesday, April 29, 5:30pm-6:30pm Tuesday, May 6, 5:30-6:30pm Tuesday, May 27, 5:30-6:30pm Remember to bring your own mat. Events subject to change without notice. By participating in this exercise or exercise program, you agree that you do so at your own risk and are voluntarily participating in these activities. Delray Marketplace and the instructor are not responsible for any injuries. For more information, email drbgroupllc@drbgroupllc.com . View Event → Oct 24 5:00 PM 17:00 Amphitheater , Events , Family Trick or Treat Thursday, October 24, 2024 5:00 PM 7:30 PM 17:00 19:30 Delray Marketplace (map) Google Calendar ICS Join us for a FREE, fun Halloween celebration: For safety, parents must accompany children throughout the event. • Trick or Treating for kids 10 and under in costume • Pumpkins for Kids • Crafts • Balloon Twister RAIN DATE: Friday, October 25, 2024 While supplies last. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Oct 2 to Apr 30 Events , Amphitheater , Family , Live Entertainment , Live Music Delray Marketplace Music Fest Wed, Oct 2, 2024 6:00 PM 18:00 Wed, Apr 30, 2025 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 2 through April 30, 2024, 6-8pm. MUSIC FEST SCHEDULE: OCTOBER 2 Happy Daze Band Oldies from the 50’s and 60’s OCTOBER 9 (CANCELLED) The Renegades Dance Rock from 70’s-90’s OCTOBER 16 The Honey Project Rock, Blues and Dance OCTOBER 23 Six Foot Swell Band Surf Music Favorites OCTOBER 30 The Prymates Classic Rock and Upbeat Blues NOVEMBER 6 Krush Party Band Motown, Disco, Party and Dance Music NOVEMBER 13 Rio Rio The Best Hits Duran Duran NOVEMBER 20 Doubleback The Best Hits of the 80’s NOVEMBER 27 Relentless Top 40 Dance Rock DECEMBER 4 Dance Party 3X All Your Favorite Dance Tunes DECEMBER 11 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock DECEMBER 18 The Whisky Six Band Modern Country Rock DECEMBER 25 Merry Christmas! NO CONCERT JANUARY 1, 2025 Happy New Year! NO CONCERT JANUARY 8 Moonlight Band Dance & Disco JANUARY 15 Dr. K and the Co-pays Party Rock & Motown JANUARY 22 - CANCELLED Preservation Road Rock, Blues and Dance JANUARY 29 The Prymates Classic Rock and Upbeat Blues FEBRUARY 5 Happy Daze Band Oldies from the 50’s and 60’s FEBRUARY 12 The Fake News Huey Lewis & the News Tribute Band FEBRUARY 19 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock FEBRUARY 26 Business As Usual 70’s - 90’s, Disco, Motown and More MARCH 5 Reminisce Hits from the 50’s, 60’s & 70’s MARCH 12 Tailored Soul Show Disco Music of the 70’s MARCH 19 ReVibe Dance Party Music, 70’s thru Today MARCH 26 Forever Eric Eric Clapton Tribute APRIL 2 Tony Quaranti The Sinatra Songbook APRIL 9 3Sixty Beatles to Pop to Country APRIL 16 Vibes Farm Reggae, Rock, Hip Hop Fusion Band APRIL 23 Feelin’ Good Michael Bublé Tribute APRIL 30 Mojo’s Katel Classic Rock Check back for more to come! Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Aug 2 to Aug 19 Events Summer Fun $100 Gift Card Giveaway Fri, Aug 2, 2024 12:00 AM 00:00 Mon, Aug 19, 2024 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Jun 20 to Jun 21 Events Experience the Power of Sanctuary™ Thu, Jun 20, 2024 12:00 PM 12:00 Fri, Jun 21, 2024 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS Lincoln welcomes you to join us at Delray Marketplace near EVO Entertainment, June 20-21 from 12:00pm-8:00pm to experience the Power of Sanctuary™ with the all-new Lincoln Nautilus®. This vehicle delivers a bold new take on design, connectivity, and revitalization with the largest panoramic display in its class, an available hybrid engine, and more. In addition to this exclusive look and test drive* opportunity, you'll receive a thank you gift for joining us. DATE: June 20-21 TIME: 12:00pm-8:00pm View Event → Apr 17 to May 13 Events Mother’s Day $100 Gift Card Giveaway Wed, Apr 17, 2024 12:00 AM 00:00 Mon, May 13, 2024 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Mar 24 2:00 PM 14:00 Events , Amphitheater , Family Easter Egg Hunt Sunday, March 24, 2024 2:00 PM 5:00 PM 14:00 17:00 Delray Marketplace (map) Google Calendar ICS DATE CHANGE: Due to the expected inclement weather, our Easter Egg Hunt event has been moved to the rain date/time, Sunday, March 24 from 2pm-5pm. Children up to age 10 can hunt for fun-filled Easter Eggs (by age group): • Easter Egg Hunt Schedule Ages 2 and under……2:15pm Ages 3-5……3:00pm Ages 6-8……3:45pm Ages 9-10……4:00pm • Face Painters • Train Rides • Games and Crafts • Music • Inflatable Obstacle Course Egg Hunt taking place at the Amphitheater, other activities throughout Delray Marketplace. While supplies last. Some eggs contain toys that are suitable for ages 4 and up. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Jan 26 to Feb 14 Events We Love Our Customers $100 Gift Card Giveaway Fri, Jan 26, 2024 12:00 AM 00:00 Wed, Feb 14, 2024 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Dec 11 4:30 PM 16:30 Events Grand Chanukah Celebration Monday, December 11, 2023 4:30 PM 7:30 PM 16:30 19:30 Delray Marketplace (map) Google Calendar ICS The Chabad Centers of Delray Beach present Grand Chanukah Celebration at Delray Marketplace 4:30pm - Menorah Parade Begins at the Big Apple Shopping Bazaar, 5283 W Atlantic Avenue, Delray Beach 5:30pm - Party for All at the Delray Marketplace Amphitheater Followed by Menorah Lighting and Gelt Drop RSVP in advance, chanukahdelray.com or 561.666.2770. View Event → Nov 11 3:00 PM 15:00 Events , Family Holiday Happenings Saturday, November 11, 2023 3:00 PM 6:00 PM 15:00 18:00 Delray Marketplace (map) Google Calendar ICS Join us for a night of fun, music and celebration! Tree Lighting at Dusk • Visit with Santa • Carolers • Crafts • Trackless Train • Face Painting • Performers • Activities • Hot Cocoa • Local Dignitaries Rain date: Sunday, November 12, 2023 While supplies last. Weather permitting. Event subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com Below is a preview of the event map and schedule of activities that will be handed out at the event. Come join the fun! View Event → Nov 3 to Nov 27 Events Give Thanks $100 Gift Card Giveaway Fri, Nov 3, 2023 12:00 AM 00:00 Mon, Nov 27, 2023 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Oct 26 5:00 PM 17:00 Events , Family Trick or Treat Thursday, October 26, 2023 5:00 PM 7:30 PM 17:00 19:30 Delray Marketplace (map) Google Calendar ICS Join us for a FREE, fun Halloween celebration: For safety, parents must accompany children throughout the event. • Trick or Treating for kids 10 and under in costume • Pumpkins for Kids • Crafts • Balloon Twister RAIN DATE: Friday, October 27, 2023 One pumpkin per child. While supplies last. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com. View Event → Oct 4 to Apr 24 Events , Amphitheater , Family , Live Entertainment , Live Music Music Fest Wed, Oct 4, 2023 6:00 PM 18:00 Wed, Apr 24, 2024 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 4 through April 24, 6-8pm. SCHEDULE: OCTOBER 4 Big City Dogs Classic Rock and Blues OCTOBER 11 - CANCELLED Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock OCTOBER 18 Hot Sauce Moon Classic Rock and Blues OCTOBER 25 The Cravens Dance Rock with Rolling Stones Influence NOVEMBER 1 Happy Daze Band Oldies from the 50’s and 60’s NOVEMBER 8 Krush Party Band Motown, Disco, Party Dance Music NOVEMBER 15 - CANCELLED JD Danner Band Classic Dance Rock NOVEMBER 22 Double Back The Best Hits of the 80’s NOVEMBER 29 ReVibe Dance Party Music, 70’s thru Today DECEMBER 6 Moon Light Thief Classic R&B Dance DECEMBER 13 - CANCELLED The Hard Way Rock ’n Roll DECEMBER 20 The Whisky Six Band Modern Country Rock DECEMBER 27 Forever Eric Eric Clapton Tribute JANUARY 3 Happy Daze Band Oldies from the 50’s and 60’s JANUARY 10 Preservation Road Rock, Blues and Dance JANUARY 17 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock JANUARY 24 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock JANUARY 31 Champagne Pop Top 40 Variety thru the Decades FEBRUARY 7 The Prymates Classic Rock with Upbeat Jazz FEBRUARY 14 Reminisce Hits from the 50’s, 60’s & 70’s FEBRUARY 21 At The Hop 50’s and 60’s Tribute FEBRUARY 28 Tony Quaranti The Sinatra Songbook MARCH 6 - CANCELLED Big City Dogs Classic Rock and Blues MARCH 13 Doubleback to the Eighties The Best Hits of the 80’s MARCH 20 Core Band Dance Rock MARCH 27 Relentless Band Dance Rock APRIL 3 The Horizons Duo Popular music from the 50’s thru 70”s APRIL 10 PoPo Rock, Pop, Blues and Country Hits APRIL 17 Tony Quaranti The Sinatra Songbook APRIL 24 ReVibe Dance Party Music, 70’s thru Today Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com. View Event → Sep 1 to Sep 25 Events Step into Fall $100 Gift Card Giveaway Fri, Sep 1, 2023 12:00 AM 00:00 Mon, Sep 25, 2023 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → May 21 6:00 PM 18:00 Amphitheater , Events , Live Entertainment , Live Music Sunday with Sinatra Sunday, May 21, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, May 21, from 6:00pm-8:00pm for another Sunday with Sinatra! A Sinatra tribute artist will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com. View Event → Apr 23 6:00 PM 18:00 Events , Amphitheater , Live Entertainment , Live Music , Family Sunday with Sinatra Sunday, April 23, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, April 23, from 6:00pm-8:00pm for another Sunday with Sinatra! The Sinatra tribute artist Peter Scott Ruben & His Fabulous Trio will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com. View Event → Apr 19 to May 15 Celebrate Mom $100 Gift Card Giveaway Wed, Apr 19, 2023 12:00 AM 00:00 Mon, May 15, 2023 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Apr 13 to Apr 14 Events Skillets - Job Fair Thu, Apr 13, 2023 8:00 AM 08:00 Fri, Apr 14, 2023 5:00 PM 17:00 Delray Marketplace (map) Google Calendar ICS Skillets Job Fair If you’re looking for a job with best-in-class pay, great working hours (our restaurants close at 2:30 pm) in a fast-paced, fun, and friendly environment, please stop by the restaurant (located next to European Wax Center) and apply on Thursday, April 13th and Friday, April 14th from 8:00 am to 12:00 pm or from 1:00 pm - 5:00 pm. 14859 Lyons Rd #132 Delray Beach View Event → Mar 25 11:00 AM 11:00 Amphitheater , Events , Family Easter Egg Hunt Saturday, March 25, 2023 11:00 AM 2:00 PM 11:00 14:00 Delray Marketplace (map) Google Calendar ICS Children up to age 10 can hunt for fun-filled Easter Eggs (by age group): • Easter Egg Hunt Schedule Ages 2 and under……11:15am Ages 3-5……12:00pm Ages 6-8……12:45pm Ages 9-10……1:30pm • Balloon Artist • Train Rides • Games and Crafts • Music • Inflatable Obstacle Course Egg Hunt taking place at the Amphitheater, other activities throughout Delray Marketplace. Rain Date: March 26 While supplies last. Some eggs contain toys that are suitable for ages 4 and up. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Mar 12 6:00 PM 18:00 Amphitheater , Events , Live Entertainment , Live Music Sunday with Sinatra Sunday, March 12, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, March 12, from 6:00pm-8:00pm for a Sunday with Sinatra! The Legends Radio All-Star Band will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com . View Event → Jan 20 to Feb 14 Events We Love Our Customers! $100 Gift Card Giveaway Fri, Jan 20, 2023 12:00 AM 00:00 Tue, Feb 14, 2023 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Dec 18 5:00 PM 17:00 Events , Amphitheater , Family Chanukah at Delray Marketplace Sunday, December 18, 2022 5:00 PM 7:00 PM 17:00 19:00 Delray Marketplace (map) Google Calendar ICS The Chabad Centers of Delray Beach present Chanukah at Delray Marketplace Menorah Lighting at 6:30pm • Firetruck Gelt Drop • Inflatables • Fire Juggling Show • Latkes • Children’s Choir • Petting Zoo • Mocktails • Music RSVP in advance, chanukahdelray.com or 561.666.2770 . View Event → Nov 4 to Nov 28 Events Give Thanks $100 Gift Card Giveaway Fri, Nov 4, 2022 12:00 AM 00:00 Mon, Nov 28, 2022 11:59 PM 23:59 Delray Marketplace (map) Google Calendar ICS View Event → Oct 27 5:30 PM 17:30 Events , Family Trick or Treat Thursday, October 27, 2022 5:30 PM 7:30 PM 17:30 19:30 Delray Marketplace (map) Google Calendar ICS Join us for a FREE, fun Halloween celebration: For safety, parents must accompany children throughout the event. • Trick or Treating for kids 10 and under in costume • Crafts • Balloon Twister RAIN DATE: Friday, October 28, 2022 While supplies last. Event is subject to change without notice. For your safety, please follow COVID-19 safety guidelines. For more information, email drbgroupllc@drbgroupllc.com. View Event → Delray Marketplace 14851 Lyons Rd, Delray Beach, FL, 33446, United States 561-865-4613 FOLLOW DELRAY MARKETPLACE"
    },
    {
      "url": "https://www.delraymom.com/event/marketplace-music-fest/",
      "text": "Marketplace Music Fest - Delray Beach Activities - Delray Mom Blog Calendar About Marketplace Music Fest Calendar When: February 7, 2018 @ 6:00 pm – 8:00 pm Repeats 2018-02-07T18:00:00-05:00 2018-02-07T20:00:00-05:00 Where: Delray Marketplace 14851 Lyons Rd Delray Beach FL 33446 Cost: Free Contact: Email Event website Family fun, free music and more! Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Apeiro Kitchen & Bar. Check out our NEW Music Fest Market on the first Wednesday of each month! FREE EVENT, open to public Here’s What’s Playing at the Delray Marketplace Amphitheater Through May 2018! March 7 WT HECK Jazz Classic Rock PLUS, Music Fest Market March 14 THE LAST WORD BAND 60’s thru 90’s Rock March 21 THE JAGZ Classic Rock March 28 DRYVIN’ SOUTH Classic Rock with Touch of Soul April 4 RANDY STEPHENS AND THE GROOVE MAKERS Blues Rock PLUS, Music Fest Market April 11 SOLID BRASS BAND Tribute to Chicago & Horn Bands of the 70’s April 18 SOUTH FLORIDA SWING BAND American Standard, Swing, Jazz & Pop April 25 MARK TELESCA BAND Blues Rock May 2 THE FAKE NEWS Huey Lewis Tribute PLUS, Music Fest Market May 9 BIG CITY DOGS Classic Rock May 16 THE NASH CAREY BAND Country Rock & Funk May 23 ERIK O’NEILL TRIO Rock, Indie Pop & Soul (was on American Idol 2017) May 30 BUSINESS AS USUAL 60’s, 70’s & 80’s Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.co m. On February 5, 2018 • By Delray Mom 0 Previous Post Brain BITS Next Post Free Frozen Yogurt Day No Comments Leave a Reply Cancel Reply Name * Email * Website Δ Upcoming Events There are no upcoming events. View Calendar Add Add to Timely Calendar Add to Google Add to Outlook Add to Apple Calendar Add to other calendar Export to XML Follow us on Facebook Recent Posts Delray Beach Halloween Events Delray Beach Summer Camps Palm Beach County Produce Boxes – The Full List Easter Egg Hunts in Delray Beach Delray Beach Spring Break Camps Facebook Twitter Instagram Pinterest Copyright 2023 - Delray Mom. All Rights Reserved. Designed & Developed by Keene Designs"
    },
    {
      "url": "https://delraycra.org/green-market/",
      "text": "GreenMarket - Delray Beach Community Redevelopment Agency Skip to content Delray Beach Community Redevelopment Agency A local government agency that works in collaboration with residents, property owners, businesses, and other community organizations to foster redevelopment. Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up Search: Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up The GreenMarket is a Saturday morning destination as an open-air marketplace located in Old School Square.  Started in 1996 by the Community Redevelopment Agency, the Delray GreenMarket has become one of the most popular and charming aspects of the “season” in Delray Beach. At the GreenMarket you’ll find more than 50 premier food vendors featuring farm-to-fork produce, just picked citrus, tropical fruit and juice, farm fresh eggs, artisan cheese and jams, fragrant baked goods, plenty of gluten-free, vegan and organic products, fresh cut flowers, plants and other unique gourmet fare along with live musical entertainment each Saturday. The GreenMarket has two seasons – Winter and Summer. 30th Annual Winter GreenMarket Season October 25, 2025 – May 16, 2026 Every Saturday 9AM – 2PM Old School Square Campus The GreenMarket will be closed on Saturday, December 13, 2025, (City of Delray Beach Holiday Parade), Saturday, March 14, 2026, (City of Delray Beach St. Patrick’s Day Festival) and Saturday, April 11, 2026, (Delray Affair) NOW ACCEPTING 2025-2026 Winter GreenMarket Vendor Applications EXTENDED Application Deadline: August 20, 2025 at 5:00PM Click Here for Vendor Application NON-PROFIT ORGANIZATIONS The GreenMarket provides an opportunity for non-profit organizations to raise awareness of their organization, mission, and goals. If you are interested, please read more about the non-profit spaces and submit your application here: Winter Non-Profit Vendor Application (Coming Soon) ROTATING VENDOR OPPORTUNITIES The Rotating Vendor spaces provide local, small businesses who may not be able to commit to a full or half season at the GreenMarket an opportunity to set up a booth/tent space on a “pop-up” and/or rotational basis. If you are interested, please read more about the Rotating Vendor spaces and submit your application here: Winter Rotating Vendor Application (Coming Soon) For vendor information and GreenMarket questions contact the GreenMarket Manager: Lori Johnson Phone 561-276-7511 Email johnsonlori@mydelraybeach.com SNAP at the GreenMarket: The Delray Beach CRA is excited to offer SNAP benefits at the Delray Beach GreenMarket. Want to learn more about SNAP? Click Here to Learn More To speak with someone about SNAP at the GreenMarket, please contact Program Assistant Dominique Pelissier at PelissierD@mydelraybeach.com. Search CRA NEWSLETTER Email * GREEN MARKET NEWSLETTER Email * Follow Us on Social Media Find us on: Facebook Instagram Go to Top"
    },
    {
      "url": "https://www.delraymarket.com/event-list?category=Live+Music",
      "text": "Events — Delray Marketplace Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions The place to shop, dine and play in Delray Beach. Filtering by: Live Music Oct 1 to Apr 29 Events , Amphitheater , Family , Live Entertainment , Live Music Delray Marketplace Music Fest Wed, Oct 1, 2025 6:00 PM 18:00 Wed, Apr 29, 2026 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 1 through April 29, 2025, 6-8pm. MUSIC FEST SCHEDULE: OCTOBER 1 The Prymates Classic Rock and More OCTOBER 8 Mojo's Katel Classic Rock OCTOBER 15 The Cool Water Band Best of the 50's, 60's, 70's & 80's OCTOBER 22 Mad Mellow 80's thru Today, including Reggae OCTOBER 29 Cover to Cover Band Rock ’N Roll NOVEMBER 5 The Gritty Groove Rock Dance and Pop NOVEMBER 12 Mischief Party & Dance, Hits of Today NOVEMBER 19 Whisky Six Band South Florida's Favorite Local Country Band NOVEMBER 26 It Takes Two 50's thru Today DECEMBER 3 Doubleback The Best Hits of the 80's DECEMBER 10 Dance Party 3X Disco and R&B Hits DECEMBER 17 Forever Eric Eric Clapton Tribute DECEMBER 24 Christmas Eve - NO CONCERT DECEMBER 31 New Year’s Eve - NO CONCERT JANUARY 7 Bombshell 80's thru Today, Top 40 Music JANUARY 14 Relentless Classic Rock and Top 40 JANUARY 21 Preservation Road Rock and Blues JANUARY 28 Anthony Quaranti The Sinatra Songbook FEBRUARY 4 Don’t Stop the Music Doo Wop, Motown, Disco and Classic Rock FEBRUARY 11 Six Foot Swell Surf Band Surf and Rock N Roll FEBRUARY 18 3siXty Classic Rock & Pop FEBRUARY 25 Live Feed Rock, Pop, Funk & Dance MARCH 4 Jupiter Rock Farm Classic Rock & Pop MARCH 11 The Fake News Huey Lewis & the News Tribute Band MARCH 18 The Renegades Dance Rock, 70's - 90's MARCH 25 Krush Party Band Motown Disco, Party Dance Music APRIL 1 Happy Daze Band Oldies, 50's and 60's APRIL 8 Trial and Error Rock, Pop and Jazz APRIL 15 ReVibe Dance Party Music, 70's thru today APRIL 22 The Prymates Classic Rock and More APRIL 29 Mojo's Katel Classic Rock Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Oct 2 to Apr 30 Events , Amphitheater , Family , Live Entertainment , Live Music Delray Marketplace Music Fest Wed, Oct 2, 2024 6:00 PM 18:00 Wed, Apr 30, 2025 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 2 through April 30, 2024, 6-8pm. MUSIC FEST SCHEDULE: OCTOBER 2 Happy Daze Band Oldies from the 50’s and 60’s OCTOBER 9 (CANCELLED) The Renegades Dance Rock from 70’s-90’s OCTOBER 16 The Honey Project Rock, Blues and Dance OCTOBER 23 Six Foot Swell Band Surf Music Favorites OCTOBER 30 The Prymates Classic Rock and Upbeat Blues NOVEMBER 6 Krush Party Band Motown, Disco, Party and Dance Music NOVEMBER 13 Rio Rio The Best Hits Duran Duran NOVEMBER 20 Doubleback The Best Hits of the 80’s NOVEMBER 27 Relentless Top 40 Dance Rock DECEMBER 4 Dance Party 3X All Your Favorite Dance Tunes DECEMBER 11 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock DECEMBER 18 The Whisky Six Band Modern Country Rock DECEMBER 25 Merry Christmas! NO CONCERT JANUARY 1, 2025 Happy New Year! NO CONCERT JANUARY 8 Moonlight Band Dance & Disco JANUARY 15 Dr. K and the Co-pays Party Rock & Motown JANUARY 22 - CANCELLED Preservation Road Rock, Blues and Dance JANUARY 29 The Prymates Classic Rock and Upbeat Blues FEBRUARY 5 Happy Daze Band Oldies from the 50’s and 60’s FEBRUARY 12 The Fake News Huey Lewis & the News Tribute Band FEBRUARY 19 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock FEBRUARY 26 Business As Usual 70’s - 90’s, Disco, Motown and More MARCH 5 Reminisce Hits from the 50’s, 60’s & 70’s MARCH 12 Tailored Soul Show Disco Music of the 70’s MARCH 19 ReVibe Dance Party Music, 70’s thru Today MARCH 26 Forever Eric Eric Clapton Tribute APRIL 2 Tony Quaranti The Sinatra Songbook APRIL 9 3Sixty Beatles to Pop to Country APRIL 16 Vibes Farm Reggae, Rock, Hip Hop Fusion Band APRIL 23 Feelin’ Good Michael Bublé Tribute APRIL 30 Mojo’s Katel Classic Rock Check back for more to come! Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Oct 4 to Apr 24 Events , Amphitheater , Family , Live Entertainment , Live Music Music Fest Wed, Oct 4, 2023 6:00 PM 18:00 Wed, Apr 24, 2024 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from October 4 through April 24, 6-8pm. SCHEDULE: OCTOBER 4 Big City Dogs Classic Rock and Blues OCTOBER 11 - CANCELLED Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock OCTOBER 18 Hot Sauce Moon Classic Rock and Blues OCTOBER 25 The Cravens Dance Rock with Rolling Stones Influence NOVEMBER 1 Happy Daze Band Oldies from the 50’s and 60’s NOVEMBER 8 Krush Party Band Motown, Disco, Party Dance Music NOVEMBER 15 - CANCELLED JD Danner Band Classic Dance Rock NOVEMBER 22 Double Back The Best Hits of the 80’s NOVEMBER 29 ReVibe Dance Party Music, 70’s thru Today DECEMBER 6 Moon Light Thief Classic R&B Dance DECEMBER 13 - CANCELLED The Hard Way Rock ’n Roll DECEMBER 20 The Whisky Six Band Modern Country Rock DECEMBER 27 Forever Eric Eric Clapton Tribute JANUARY 3 Happy Daze Band Oldies from the 50’s and 60’s JANUARY 10 Preservation Road Rock, Blues and Dance JANUARY 17 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock JANUARY 24 Don’t Stop the Music Doo Wop, Motown, Disco, Classic Rock JANUARY 31 Champagne Pop Top 40 Variety thru the Decades FEBRUARY 7 The Prymates Classic Rock with Upbeat Jazz FEBRUARY 14 Reminisce Hits from the 50’s, 60’s & 70’s FEBRUARY 21 At The Hop 50’s and 60’s Tribute FEBRUARY 28 Tony Quaranti The Sinatra Songbook MARCH 6 - CANCELLED Big City Dogs Classic Rock and Blues MARCH 13 Doubleback to the Eighties The Best Hits of the 80’s MARCH 20 Core Band Dance Rock MARCH 27 Relentless Band Dance Rock APRIL 3 The Horizons Duo Popular music from the 50’s thru 70”s APRIL 10 PoPo Rock, Pop, Blues and Country Hits APRIL 17 Tony Quaranti The Sinatra Songbook APRIL 24 ReVibe Dance Party Music, 70’s thru Today Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com. View Event → May 21 6:00 PM 18:00 Amphitheater , Events , Live Entertainment , Live Music Sunday with Sinatra Sunday, May 21, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, May 21, from 6:00pm-8:00pm for another Sunday with Sinatra! A Sinatra tribute artist will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com. View Event → Apr 23 6:00 PM 18:00 Events , Amphitheater , Live Entertainment , Live Music , Family Sunday with Sinatra Sunday, April 23, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, April 23, from 6:00pm-8:00pm for another Sunday with Sinatra! The Sinatra tribute artist Peter Scott Ruben & His Fabulous Trio will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com. View Event → Mar 12 6:00 PM 18:00 Amphitheater , Events , Live Entertainment , Live Music Sunday with Sinatra Sunday, March 12, 2023 6:00 PM 8:00 PM 18:00 20:00 Delray Marketplace (map) Google Calendar ICS Join us on Sunday, March 12, from 6:00pm-8:00pm for a Sunday with Sinatra! The Legends Radio All-Star Band will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com . View Event → Oct 5 to Apr 26 Live Entertainment , Live Music , Amphitheater , Family , Events Music Fest Wed, Oct 5, 2022 6:00 PM 18:00 Wed, Apr 26, 2023 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS CONCERT CANCELLED - Due to the severe weather forecast, our last 2022-2023 Music Fest Concert (April 26) has been cancelled. Thanks to all who joined us this season! FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater and enjoy musical entertainment by talented local artists, located near Burt & Max’s. Every Wednesday from 6-8pm SCHEDULE: OCTOBER 5 Hot Sauce Moon Americana Classic Artists OCTOBER 12 Don't Stop The Music Hits Thru the Decades OCTOBER 19 - CANCELLED The Cravens Dance Rock with Rolling Stones Influence OCTOBER 26 Moon Light Thief Classic R&B Dance NOVEMBER 2 It Takes Two Variety from the 50's, thru Today Including Motown NOVEMBER 9 - CANCELLED Brenda Johnson Unplugged The Best of Yesterday and Today's Music NOVEMBER 16 Big City Dogs Classic Rock and Blues NOVEMBER 23 Revibe Best Music of the 60's, 70's, 80's, and Today NOVEMBER 30 Double Back The Best Hits of the 80's DECEMBER 7 (Band Change) Preservation Road Classic Rock & Soulful Blues DECEMBER 14 Don't Stop The Music \"Return To Saturday Night Fever\" DECEMBER 21 The Horizons Duo Variety Tropical, Calypso, Buffett, and Latin DECEMBER 28 Krush Party Band Motown Disco, Party Dance Music JANUARY 4 JD Danner Band Country Rock JANUARY 11 Double Back The Best Hits of the 80’s JANUARY 18 Happy Daze Band Oldies 50’s and 60’s JANUARY 25 Primal Soul Classic Rock FEBRUARY 1 Trial and Error Rock, Pop  and Jazz FEBRUARY 8 Moon Light Thief Classic R&B Dance FEBRUARY 15 At the Hop 50’s, 60’s Dance Band FEBRUARY 22 Sand Dunes Country Rock MARCH 1 ReVibe Dance Party  Music, 70’s thru Today MARCH 8 Happy Daze Band Oldies 50’s and 60’s MARCH 15 Fake News Huey Lewis Tribute Huey Lewis Tribute MARCH 22 Krush Party Band Motown, Disco, Party Dance Music MARCH 29 - CANCELLED Dr. K and the Co-Pays Party Rock and Motown APRIL 5 Trial and Error Rock, Pop and Jazz APRIL 12 - CANCELLED CORE Band Classic Rock through the 90’s APRIL 19 Relentless Dance Rock 60’s thru Today APRIL 26 - CANCELLED Nick Orr and the Spectrum 60’s to 90’s Rock and Roll Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com. View Event → Dec 5 5:00 PM 17:00 Events , Amphitheater , Live Entertainment , Family , Live Music Grand Chanukah Celebration Sunday, December 5, 2021 5:00 PM 7:00 PM 17:00 19:00 Delray Marketplace (map) Google Calendar ICS Be part of a wonderful, exciting Hanukkah Celebration and have an amazing time. Enjoy a PARDES 2.0 LIVE Concert, kids activities, music, latkes and donuts, and concessions for purchase! A project of Chabad Centers of Delray and West Boynton in partnership with Delray Marketplace. Event taking place at the Delray Marketplace Amphitheater. For more information, visit: chanukahdelray.com or call 561-666-2770 While supplies last. Weather permitting. Event is subject to change without notice. View Event → Nov 17 to Apr 27 Amphitheater , Events , Family , Live Music Music Fest Concerts Wed, Nov 17, 2021 6:00 PM 18:00 Wed, Apr 27, 2022 8:00 PM 20:00 Delray Marketplace (map) Google Calendar ICS Due to expected inclement weather, our APRIL 6 Music Fest concert has been cancelled for the safety of all involved. FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Pagoda Kitchen. Every Wednesday through April SCHEDULE: NOVEMBER 24, 2021 SOLPARTY The dark side of SOL; The Ultimate Tribute to Pink Floyd DECEMBER 1, 2021 Don’t Stop the Music Top hits thru the decades, from 1940's to current DECEMBER 8, 2021 Atlantic Coast Wreckin’ Machine Classic Rock DECEMBER 15, 2021 Tony Quaranti presents The Sinatra Songbook DECEMBER 22, 2021 An Evening with JayCee Driesen One Women Show DECEMBER 29, 2021 Happy Daze Band Best of the Oldies JANUARY 5, 2022 Big City Dogs Classic Rock JANUARY 12, 2022 - CANCELLED DoubleBack to the 80’s Back to the 80’s JANUARY 19, 2022 ReVibe Best Music of the 60’s, 70’s, 80’s and 90’s JANUARY 26, 2022 Moonlight Thief R&B Dance Music FEBRUARY 2 Sand Dunes Classic and Contemporary Country Hits FEBRUARY 9 Krush Band Favorite Dance Party Mix FEBRUARY 16 Don’t Stop the Music Top Hits thru the Decades, from 1940’s to Current FEBRUARY 23 Doubleback to the 80’s Back to the 80’s MARCH 2 Revibe Best Music of the 60’s, 70’s, 80’s and 90’s MARCH 9 Happy Daze Band Best of the Oldies MARCH 16 - CANCELLED An Evening with the Music of Paul Anka MARCH 23 JD Danner Band Southern Country Rock MARCH 30 Champagne Pop Pop to Top 40 APRIL 6 - CANCELLED Don’t Stop the Music Top Hits thru the Decades, from 1940’s to Current APRIL 13 The Cravens Rock thru the Ages APRIL 20 Moonlight Thief R&B, Variety Dance Music APRIL 27 Trial and Error Classic Rock Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Jun 12 4:00 PM 16:00 Events , Live Entertainment , Amphitheater , Live Music Smith Smiles Presents Rock for a Cause Saturday, June 12, 2021 4:00 PM 8:30 PM 16:00 20:30 Delray Marketplace (map) Google Calendar ICS Smith Smiles presents their free event, Rock for a Cause - Youth Rock-N-Roll Music Fest, at Delray Marketplace Amphitheater on Saturday, June 12, 2021 from 4:00-8:30pm. FEATURING: Awkward Silence Beautiful Disaster Cropsey’s Hideout Maximum Friction And special guests: Tillia Ubeda & Jesse Mark This is a free event benefiting \u0003Smith Smiles and featuring live music by local youth bands. Please help them by \u0003bringing a new, \u0003unwrapped toy to \u0003the event as a \u0003donation. Any size \u0003or value is appreciated. Benefiting Smith Smiles Who is Smith Smiles: Smith Smiles is a 501 c3 nonprofit organization who focuses on bringing toys to hospitals to help children who are healing be as comfortable as possible during their stay. To learn more visit: https://www.smithsmiles.org/ Please bring a chair or blanket to enjoy the entertainment. Weather permitting. Events subject to change without notice. View Event → Oct 20 to Apr 19 Events , Amphitheater , Family , Live Entertainment , Live Music Sundays with Sinatra Sun, Oct 20, 2019 6:00 PM 18:00 Sun, Apr 19, 2020 8:00 PM 20:00 Google Calendar ICS Our March 15 Sundays with Sinatra has been CANCELLED. Please continue to follow us on Facebook and our website for any future event updates. Join us on the third Sunday from October 2019 through April 2020, from 6:00pm-8:00pm for our new season of Sundays with Sinatra! Jeff Grainger - Sinatra Tribute performer will entertain you with Frank Sinatra favorites. Bring your lawn chair or blanket and enjoy the show. Presented by Legends Radio 100.3 FM - Where Legendary Music Lives - WLML Events subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com . View Event → Oct 11 to Nov 22 Events , Live Music , Live Entertainment Friday Night Live Fri, Oct 11, 2019 7:00 PM 19:00 Fri, Nov 22, 2019 9:00 PM 21:00 Google Calendar ICS Enjoy live music every other Friday evening, from October 11 through November 22, while strolling, shopping and dining at Delray Marketplace! Near Batch Gastropub and CineBowl and Grille October 11 - Kevin Millard October 25 - Rich Sorren November 8 - Rich Sorren November 22 - Rich Sorren Weather permitting. Event is subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → Oct 2 to May 27 Events , Amphitheater , Live Entertainment , Live Music , Night Out , Family Music Fest Wed, Oct 2, 2019 6:00 PM 18:00 Wed, May 27, 2020 8:00 PM 20:00 Google Calendar ICS As a precaution, our Music Fest concerts through April 8th have been cancelled. FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Apeiro Kitchen & Bar. Here’s What’s Playing at the Delray Marketplace Amphitheater Through May 2020! MARCH 25 - CANCELLED Don’t Stop the Music Top Hits thru the Decades APRIL 1 - CANCELLED Mary Washington Brooks Band Blues and R&B APRIL 8 - CANCELLED Joey Tenuto Band Rock, Soul and Blues APRIL 15 The Cravens Dance Rock with Rolling Stones Influence APRIL 22 Friday At Five Rock from the 60’s to Today APRIL 29 Preservation Road Tribute to the Kings of Blues and Rock MAY 6 Happy Daze Band Oldies 50’s and 60’s MAY 13 Joel Dasilva Band 60’s to 90’s Rock and Blues MAY 20 The Last Word Band Top 40 from the 60’s to Today MAY 27 At the Hop 50's Musical Tribute Weather permitting. Events subject to change without notice. For more information, please email drbgroupllc@drbgroupllc.com with subject line: Delray Marketplace Music Fest View Event → Oct 3 to May 29 Events , Amphitheater , Live Entertainment , Live Music , Family , Night Out Music Fest Wed, Oct 3, 2018 6:00 PM 18:00 Wed, May 29, 2019 8:00 PM 20:00 Google Calendar ICS FREE EVENT from 6-8pm, open to public Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Apeiro Kitchen & Bar. Here’s What’s Playing at the Delray Marketplace Amphitheater through May 2019! May 29 David Morin Dancing thru the Decades Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com . View Event → May 4 to May 6 Events , Family , Live Music Cinco de Mayo at Cabo Flats Fri, May 4, 2018 11:30 AM 11:30 Sun, May 6, 2018 11:00 PM 23:00 Google Calendar ICS Celebrate Cinco de Mayo at Cabo Flats! View Event → Oct 4 to May 30 Events , Amphitheater , Live Music , Live Entertainment , Family Music Fest - WEDNESDAYS Wed, Oct 4, 2017 6:00 PM 18:00 Wed, May 30, 2018 8:00 PM 20:00 Google Calendar ICS CANCELLED - Our final Music Fest concert of the season, on Wednesday, May 30, has been CANCELLED due to inclement weather. See you in the fall! FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Apeiro Kitchen & Bar. Check out our NEW Music Fest Market on the first Wednesday of each month! Here’s What’s Playing at the Delray Marketplace Amphitheater Through May 2018! May 30  -  CANCELLED BUSINESS AS USUAL 60’s, 70’s & 80’s Events are subject to change without notice. For more information, email drbgroupllc@drbgroupllc.com. View Event → Sep 16 to Jan 1 Events , Live Entertainment , Live Music Frank Theatres CineBowl & Grille - A Tribute to Rod Stewart Sat, Sep 16, 2017 7:30 PM 19:30 Mon, Jan 1, 2018 12:30 AM 00:30 Google Calendar ICS View Event → Apr 6 to May 25 Events , Amphitheater , Live Entertainment , Live Music , Family May Music Fest Thu, Apr 6, 2017 6:00 PM 18:00 Thu, May 25, 2017 8:00 PM 20:00 Google Calendar ICS CANCELLED - Our final FREE Music Fest concert for the Spring has been cancelled due to inclement weather. See you in the fall! View Event → Mar 31 to May 27 Events , Live Entertainment , Live Music , Night Out , Restaurant Events Tribute Bands Spring Concert Series at Frank Theatres Fri, Mar 31, 2017 7:30 PM 19:30 Sat, May 27, 2017 9:30 PM 21:30 Google Calendar ICS Frank Theatres CineBowl & Grille at Delray Marketplace presents a Tribute Bands Spring Concert Series featuring eight shows! The first show is Friday, March 31 from 7:30 - 9:30 p.m. Dinner reservation required for Table Seating – DelraySales@FrankCompanies.com or 561.454.8002, Ext. 1. Gather some friends and enjoy these nights on the town! View Event → Mar 30 6:00 PM 18:00 Amphitheater , Events , Family , Live Music March Music Fest Thursday, March 30, 2017 6:00 PM 8:00 PM 18:00 20:00 Google Calendar ICS The concert on Thursday, March 23 is CANCELLED due to expected inclement weather and for the safety of the band and our guests. Join us in the Amphitheater on Thursdays through May for FREE Music Fest! View Event → Feb 8 to Dec 27 Events , Live Music , Restaurant Events , Live Entertainment , Night Out Live Music at Cabo Flats Every Wednesday Wed, Feb 8, 2017 6:00 PM 18:00 Wed, Dec 27, 2017 8:00 PM 20:00 Google Calendar ICS Enjoy Live Music every Wednesday at Cabo Flats from 6pm - 8pm! View Event → Delray Marketplace 14851 Lyons Rd, Delray Beach, FL, 33446, United States 561-865-4613 FOLLOW DELRAY MARKETPLACE"
    },
    {
      "url": "https://delraycra.org/green-market-directory/",
      "text": "Green Market Directory - Delray Beach Community Redevelopment Agency Skip to content Delray Beach Community Redevelopment Agency A local government agency that works in collaboration with residents, property owners, businesses, and other community organizations to foster redevelopment. Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up Search: Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up Green Market Directory Welcome to our Virtual Green Market! Here you can find your favorite vendors along with their emails, business phone numbers, and links to social media. If you have any further questions regarding the Green Market, please contact Green Market Manager Lori Johnson at johnsonlori@mydelraybeach.com or 561-276-7511 . Aurora’s Mexican Kitchen Aurora’s Mexican Kitchen 561-542-7928 Bushdogs Bushdogs Crab Cakes, Shrimp and Soups 772-215-4379 Counter Culture Counter Culture 305-834-6774 Court Street Court Street Artisan Vegan Cheeze 561-376-2080 Crafted House Crafted House 954-801-9639 Curich Novoandino Curich Novoandino Best Ceviche of South Florida 954-348-1097 Diane's Fun with Food Diane’s Fun with Food 954-238-9050 European Bakery European Bakery 347-854-8007 Frik & Frak Frik & Frak Artisanal Sauce 561-532-8644 Gratitude Garden Farm Gratitude Garden Farm 954-234-5247 Icestasy Italian ice Icestasy Italian Ice 305-744-1057 Laurie’s Pantry Laurie’s Pantry Gourmet Homemade Granola 213-709-7415 La Paella Chef La Paella Chef 954-548-9272 Love, KatieKakes Love, KatieKakes 561-635-5831 MondÉpice MondÉpice Spices & Teas Co. PitBull BBQ PitBull BBQ 561-818-1042 Sciabica Olive Oils and Balsamic Vinegars Sciabica Olive Oils and Balsamic Vinegars 561-302-1218 Serenity Flows Soaps Serenity Flows Soaps 561-312-2919 Smak Attack Smak Attack 954-448-6660 Tennessee Bob’s Hot Sauce Tennessee Bob’s Hot Sauce 561-997-4812 A Touch of Spain A Touch of Spain 954-560-4864 2 Cousins 2 Cousins 561-870-3027 Search CRA NEWSLETTER Email * GREEN MARKET NEWSLETTER Email * Follow Us on Social Media Find us on: Facebook Instagram Go to Top"
    },
    {
      "url": "https://delraycra.org/staff-board/",
      "text": "Board & Staff - Delray Beach Community Redevelopment Agency Skip to content Delray Beach Community Redevelopment Agency A local government agency that works in collaboration with residents, property owners, businesses, and other community organizations to foster redevelopment. Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up Search: Home About Who We Are Board & Staff Annual Reports Workplan & Financials Plans Employment Learn More Redevelopment Advisory Committee (RAC) Public Notices Press Information Stories Watch Newsletters Property Map Agendas & Minutes Agendas & Minutes Past Meeting Videos Programs GreenMarket SNAP at the GreenMarket Arts Warehouse Work Space on 5th CRA Events Opportunities Bids Tenant Opportunities Funding Funding Assistance A.-G.U.I.D.E. Contact Us Contact Information Newsletter Sign Up BOARD & STAFF Board of Commissioners Angela Burns Angela Burns Chair March 2023 – 2026 Tom Markert Tom Markert Vice-Chair March 2024 – 2027 Juli Casale Juli Casale Deputy Vice-Chair March 2024 – 2027 Tom Carney Tom Carney CRA Commissioner March 2024 – 2027 Rob Long Rob Long CRA Commissioner March 2023 – 2026 Staff Directory Renee Jadusingh, Esq., FRA-RA Executive Director jadusinghr@mydelraybeach.com Christine Tibbs Assistant Director tibbsc@mydelraybeach.com Gina Clayton Finance and Operations Director claytong@mydelraybeach.com Ivan Cabrera, AICP, FRA-RA Redevelopment Manager cabreraI@mydelraybeach.com Mackenzie Weber Redevelopment Coordinator weberm@mydelraybeach.com Tracy Waterlander Executive Coordinator waterlandert@mydelraybeach.com Dominique Pelissier Program Assistant pelissierd@mydelraybeach.com Marilyn Pamer Finance Coordinator pamerm@mydelraybeach.com Jamilah Johnson Program Assistant JohnsonJ@mydelraybeach.com Grace Gdaniec Program Director gdaniecg@mydelraybeach.com Maria Alcala Barcelo Arts Warehouse Assistant AlcalaBarceloM@mydelraybeach.com Lori Johnson GreenMarket Manager johnsonlori@mydelraybeach.com Search CRA NEWSLETTER Email * GREEN MARKET NEWSLETTER Email * Follow Us on Social Media Find us on: Facebook Instagram Go to Top"
    },
    {
      "url": "https://www.delraymarket.com/event-list/2019/10/2/music-fest",
      "text": "Music Fest — Delray Marketplace Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions The place to shop, dine and play in Delray Beach. Back to All Events Music Fest Wednesday, October 2, 2019 6:00 PM 18:00 Wednesday, May 27, 2020 8:00 PM 20:00 Google Calendar ICS As a precaution, our Music Fest concerts through April 8th have been cancelled. FREE EVENT, open to public Bring your own chair or blanket to the Amphitheater, located between Burt & Max’s and Apeiro Kitchen & Bar. Here’s What’s Playing at the Delray Marketplace Amphitheater Through May 2020! MARCH 25 - CANCELLED Don’t Stop the Music Top Hits thru the Decades APRIL 1 - CANCELLED Mary Washington Brooks Band Blues and R&B APRIL 8 - CANCELLED Joey Tenuto Band Rock, Soul and Blues APRIL 15 The Cravens Dance Rock with Rolling Stones Influence APRIL 22 Friday At Five Rock from the 60’s to Today APRIL 29 Preservation Road Tribute to the Kings of Blues and Rock MAY 6 Happy Daze Band Oldies 50’s and 60’s MAY 13 Joel Dasilva Band 60’s to 90’s Rock and Blues MAY 20 The Last Word Band Top 40 from the 60’s to Today MAY 27 At the Hop 50's Musical Tribute Weather permitting. Events subject to change without notice. For more information, please email drbgroupllc@drbgroupllc.com with subject line: Delray Marketplace Music Fest Posted in Events , Amphitheater , Live Entertainment , Live Music , Night Out , Family Earlier Event: September 5 Step into Fall $100 Gift Card Giveaway Later Event: October 11 Friday Night Live Delray Marketplace 14851 Lyons Rd, Delray Beach, FL, 33446, United States 561-865-4613 FOLLOW DELRAY MARKETPLACE"
    },
    {
      "url": "https://www.delraymarket.com/event-list/sip-shop",
      "text": "March Sip & Shop — Delray Marketplace Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions Cart 0 Directory Events Deals Job Postings Connect Subscribe Directions The place to shop, dine and play in Delray Beach. Back to All Events March Sip & Shop Thursday, March 19, 2020 5:00 PM 9:00 PM 17:00 21:00 Google Calendar ICS As a precaution, our March 19 Sip & Shop has been cancelled. Enjoy an Evening of Shopping and Mingling SIP - Meet at Apricot Lane, our March Sip & Shop location of the month and mingle with others from your area! SHOP - Receive a FREE tote bag* with special offers from participating stores, restaurants and services, then shop and save until 9pm! Space is limited. Please RSVP below for the March Sip & Shop. Check back here for the list of March participating stores, restaurants and services and their offers: Come join the fun and enjoy the savings! * While supplies last. Event is subject to change without notice. For more information, contact drbgroupllc@drbgroupllc.com . Name * First Name Last Name Email Address * Subject Message Bringing a Friend(s)? Please supply the name(s) of the other ladies attending with you. * THANK YOU for submitting your RSVP! Enjoy our Sip & Shop event on Thursday, March 19, 2020 from 5-9pm! Posted in Events Earlier Event: February 4 Fitness Fun Later Event: March 28 Easter Egg Hunt - CANCELLED Delray Marketplace 14851 Lyons Rd, Delray Beach, FL, 33446, United States 561-865-4613 FOLLOW DELRAY MARKETPLACE"
    }
  ]
}