{
  "fuentes": [
    {
      "url": "https://www.delraybeachgolfclub.com/bryanjcdsportsgroup-com/",
      "email": "bryan@jcdsportsgroup.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/bryanjcdsportsgroup-com/",
      "email": "tyrellb@mydelraybeach.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/663-delray-beach-golf-club/search",
      "email": "nbc-golf-white@2x.png"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "andrew.robb@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "brodie.morcom@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "cade.webb@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "christian.puccini@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "daniel.scholz@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "david.oakley@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "gary.begg@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "getintogolf@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "luke.grinham@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "luke.woods@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "marc.pike@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "mark.ingrey@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "scott.simons@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "simon.weston@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "tahnia.stalker@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "tanya.smith@golfnsw.org.au"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-1024x708.jpg"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-1536x1062.jpg"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-2048x1416.jpg"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-300x207.jpg"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-600x415.jpg"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "email": "fallen-damaged-palm-trees-@-golf-course-1-768x531.jpg"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/restaurant/",
      "email": "tyrellb@mydelraybeach.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/restaurant/",
      "email": "mullen@mydelraybeach.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/getting-started-at-dbgc/",
      "email": "mgrewcoe@yahoo.com.au"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/getting-started-at-dbgc/",
      "email": "tools49@aol.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "email": "bryan@jcdsportsgroup.com"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "email": "mildnerj@mydelraybeach.com"
    },
    {
      "url": "https://kingspointdelraybeachgolf.com/contact-us/",
      "email": "golfinfo@vestapropertyservices.com"
    },
    {
      "url": "https://clubchampion.com/locations/delray-beach",
      "email": "info@clubchampiongolf.com"
    }
  ],
  "mails": [
    "andrew.robb@golfnsw.org.au",
    "brodie.morcom@golf.org.au",
    "bryan@jcdsportsgroup.com",
    "cade.webb@golfnsw.org.au",
    "christian.puccini@golf.org.au",
    "daniel.scholz@golf.org.au",
    "david.oakley@golfnsw.org.au",
    "fallen-damaged-palm-trees-@-golf-course-1-1024x708.jpg",
    "fallen-damaged-palm-trees-@-golf-course-1-1536x1062.jpg",
    "fallen-damaged-palm-trees-@-golf-course-1-2048x1416.jpg",
    "fallen-damaged-palm-trees-@-golf-course-1-300x207.jpg",
    "fallen-damaged-palm-trees-@-golf-course-1-600x415.jpg",
    "fallen-damaged-palm-trees-@-golf-course-1-768x531.jpg",
    "gary.begg@golfnsw.org.au",
    "getintogolf@golf.org.au",
    "golfinfo@vestapropertyservices.com",
    "info@belfairsgolfclub.co.uk",
    "info@clubchampiongolf.com",
    "luke.grinham@golfnsw.org.au",
    "luke.woods@golfnsw.org.au",
    "marc.pike@golf.org.au",
    "mark.ingrey@golfnsw.org.au",
    "mgrewcoe@yahoo.com.au",
    "mildnerj@mydelraybeach.com",
    "mullen@mydelraybeach.com",
    "nbc-golf-white@2x.png",
    "scott.simons@golf.org.au",
    "simon.weston@golf.org.au",
    "tahnia.stalker@golfnsw.org.au",
    "tanya.smith@golfnsw.org.au",
    "tools49@aol.com",
    "tyrellb@mydelraybeach.com"
  ],
  "nombre_sitio": "delraybeachgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.delraybeachgolfclub.com/bryanjcdsportsgroup-com/",
      "text": "Director of Catering, Bryan Tyrell - Delray Beach Golf Club Skip to main content Skip to primary sidebar Delray Beach Golf Club Delray Beach, FL Open to the Public! |  (561) 243-7385 | 2200 Highland Avenue, Delray Beach, FL, 33445 Tee Times Golf Rates Photo Gallery Course History Scorecard Practice Area Getting Started at DBGC Calendar Instruction Professional Teaching Staff Clinics & Junior Programs Loyalty Card Weddings & Events Director of Catering, Bryan Tyrell Events Photo Gallery Catering Event Calendar Restaurant Restaurant Menu Join E-Club Contact Course Managers Join the Team Book Tee Times E-Club Signup Director of Catering, Bryan Tyrell Thank you for considering Delray Beach Golf Club to host your special day. Our service oriented, professionally trained and dedicated staff will ensure your day is worry free, allowing you and your guests to indulge in our hospitality and superb culinary fare from our award winning executive chef and her professional culinary team. For more information contact Bryan Tyrell at TyrellB@mydelraybeach.com Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Phone Number: Date of Event: Number of People: Event Details: Preferred Day/Time: Message Submit Primary Sidebar Quick Links Tee Times Rates Scorecard Getting Started at DBGC Contact Us Delray Beach Golf Club | 2200 Highland Avenue | Delray Beach, FL 33445 | (561) 243-7385 Copyright © 2025 Delray Beach Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/663-delray-beach-golf-club/search",
      "text": "Delray Beach Golf Club Tee Times - Delray Beach FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters League Available Delray Beach Golf Club 2200 Highland Ave. , Delray Beach , Florida , 33445 Holes 18 Par 72 Length 6907 yards Slope 126 Rating 73.0 Delray Beach Golf Club in Delray Beach, Florida, is an 18-hole, par 72 golf course designed by legendary course architect Donald Ross. Stretching 6,907 yards from the longest tees, Delray Beach Golf Club is enjoyable for golfers of all skill levels. Water comes into play on several holes throughout the course, creating challenges and providing beautiful views. A driving range, putting green, and chipping green are available to all golfers. Book your tee time today. Read More... Directions Course Details Review Mobile Check-In Skip the line and check in for your tee time directly in the GolfNow app. Learn More Leagues Available Social golf leagues available at this course Join Now Powered by Spark Golf We partnered up with Spark Golf to bring you social, competitive 9-hole leagues at your favorite courses. Each round has a 2-person team & individual game with end of league champs. Compete in a laid-back atmosphere over 9-holes Play with friends and meet like-minded new ones. Join the League × Last Modified: 9/8/2025 8:24:01 PM +00:00 Policies Metal spikes allowed: No Credit cards accepted: VISA, MasterCard Welcomed Rentals/Services Carts: Yes - included in green fees Clubs: Yes Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "text": "Get Into Golf contacts | Golf Australia This app works best with JavaScript enabled. Sign up Log in Find a program Info for participants Get Into Golf for everyone Get Into Golf for women Get Into Golf for seniors Get Into Golf All Abilities Participant FAQs Info for venues Get your venue involved Login Download CoachMate App National Program Deliverer Contact us Golf Australia Log in or sign up to use Handicap Look-Up and view your profile. Search Golf Australia Contact Us - Get Into Golf Golf Australia (GA) are the owners of the Get Into Golf website and are responsible for its maintenance. If you have any queries about the website please get in touch with one of our friendly staff members. Golf Australia Golf Australia\nContact: Jack Macleod\nP: 0433 841 449\nE: getintogolf@golf.org.au New South Wales Golf New South Wales\n\nNewcastle/Hunter Region\nDavid Oakley\nEmail: david.oakley@golfnsw.org.au\n\nMurray Region\nCade Webb\nEmail: cade.webb@golfnsw.org.au\n\nCentral West Region\nAndrew Robb\nEmail: andrew.robb@golfnsw.org.au\n\nWestern Region\nGary Begg\nEmail: gary.begg@golfnsw.org.au\n\nSydney Metro North Region\nMark Ingrey\nEmail: mark.ingrey@golfnsw.org.au\n\nSydney Metro South Region\nTanya Smith\nEmail: tanya.smith@golfnsw.org.au\n\nIllawarra Region\nTahnia Stalker\nEmail: tahnia.stalker@golfnsw.org.au\n\nNorthern Region\nLuke Woods\nEmail: luke.woods@golfnsw.org.au\n\nSouth Coast/ACT\nLuke Grinham\nEmail luke.grinham@golfnsw.org.au Northern Territory Brodie Morcom\nP: 0498 631 983\nE: brodie.morcom@golf.org.au Queensland Scott Simons\nP: 07 3564 8914\nE: scott.simons@golf.org.au South Australia Christian Puccini \nP: 0412 401 534\nE: christian.puccini@golf.org.au Tasmania Simon Weston\nP: (03) 6244 3600\nE: simon.weston@golf.org.au Victoria Daniel Scholz\nP: 0411 663 565\nE: daniel.scholz@golf.org.au Western Australia Marc Pike\nP: (08) 9367 2490\nE: marc.pike@golf.org.au Get Into Golf Find a program near you Search Join our newsletter Get weekly updates on news, golf tips and access to partner promotions! Your Email Address * Subscribe Stay up to date Privacy Policy Terms of Use Ⓒ Golf Australia. All rights reserved"
    },
    {
      "url": "https://delraybeachhistory.org/blog/a-good-walk-unspoiled-a-history-of-the-delray-beach-golf-club/",
      "text": "A Good Walk Unspoiled: A History of the Delray Beach Golf Club - Delray Beach Historical Society Become a Member Make a Donation Contact Us About Our Story Our Place in the Community Board of Governors Mission, Vision, Values Our Sponsors Employment Opportunities Volunteer Visit History Exhibits Heritage Garden School & Group Tours Free Archive Research Events Current Events Blog & Storytelling Blog Delray Beach Historical Backroads Docuseries Support Memberships + Sponsorships Make A Donation Legacy Bricks Shop Gift Shop Legacy Bricks Historic Photos Gallery About Our Story Our Place in the Community Board of Governors Mission, Vision, Values Our Sponsors Employment Opportunities Volunteer Visit History Exhibits Heritage Garden School & Group Tours Free Archive Research Events Current Events Blog & Storytelling Blog Delray Beach Historical Backroads Docuseries Support Memberships + Sponsorships Make A Donation Legacy Bricks Shop Gift Shop Legacy Bricks Historic Photos Gallery Become a Member Make a Donation Contact Us Back to Blog A Good Walk Unspoiled: A History of the Delray Beach Golf Club By Kayleigh Howald The Delray Beach Golf Club, located on West Atlantic Avenue, has provided Delray Beach residents with a local place to enjoy a round of golf for nearly 100 years. Throughout its surprisingly complex history, the course has seen changes in its surrounding landscape, its ownership, and its membership. As August is National Golf Month, it seems like a perfect time to explore one of the city’s unique recreational amenities. Golfer with spectators at Delray Beach municipal golf course, c. 1947. DBHS Archives. Demand Grows for Florida Golf During the 1920s, Florida experienced the first of many land booms. Following World War I and the Progressive Era, Americans experienced new economic opportunities, allowing them both time and money to take vacations, travel in cars, and invest in real estate. Land speculation became popular for those inside and outside of Florida, causing land prices to increase dramatically. Tourism also became extremely popular, with many cities developing as winter resorts, including Miami Beach, Naples, and Marco Island. The Alterep Hotel, now the Colony Hotel, housed real estate offices on its ground floor retail spaces, c. 1920s. DBHS Archives. Delray, though primarily an agricultural center known best for its tomatoes, beans, and other winter vegetables, also became a center for tourism, sports, and leisure. The town’s most iconic hotels/structures — the Arcade Building, the Alterep Hotel (now the Colony Hotel), the Bon Aire Hotel, and the Seacrest Hotel — were built during the 1920s. Delray also became the winter residence of several artists, cartoonists, and writers, such as Fontaine Fox and Nina Wilcox Putnam. In addition to winter tourists, Delray’s permanent population increased nearly 120% from 1,051 residents in 1920 to 2,333 in 1930. The Gulf Stream clubhouse was designed by Addison Mizner in his signature Mediterranean Revival style, c. 1920s. DBHS Archives. Delray had an additional boost from nearby Gulf Stream, incorporated in 1925. In 1922, the Phipps family (descendants of Henry Phipps Jr., Andrew Carnegie’s business partner in the Carnegie Steel Company) started developing the land for a golf course and polo fields, attracting winter residents from Palm Beach and Miami. The Gulf Stream Golf Club opened in 1925 with a clubhouse designed by Addison Mizner and a course planned by famed Scottish golfer and architect Donald Ross. The Early Years, 1923-1945 The increase in both permanent and temporary residents created the need for more recreational facilities in Delray. In addition to land for the city park along the Florida East Coast Canal – purchased for $10,500 in 1924 – the City purchased and constructed a municipal golf course between 1923 and 1925. On January 1, 1926, a nine-hole course, also designed by Donald Ross, opened for play. The original clubhouse at the Delray Beach municipal golf course, c. 1920s. DBHS Archives. Throughout the 1920s and 1930s, the golf course remained one of Delray’s top attractions and recreational hot spots. Residents played during the winter months and throughout the summer, with the city offering reduced greens fees of only 50 cents per game from June to August. The club hosted tournaments and professional matches with prizes donated by local businesses. In 1929, for example, Adams Hardware Co. donated a Pfleuger ocean reel as a trophy. A round of golf at the Delray Country Club, c. 1931. Courtesy of John Miller, Jr. Both local and state newspapers covered Delray tournaments, matches, and wins. Hole-in-ones by Delray residents were even reported as far as Tampa! In July 1929, the Tampa Bay Times ran a note about local banker Ollie Helland, who “joined the hole in one club by dropping his tee shot in hole No. 8 of the municipal golf course. He used an iron and his ball fell a few feet in front of the cup and trickled in. The hole is par 3 and has a water hazard.” Lida Diggans and friends golfing on the municipal course, c. 1920s. DBHS Archives. The course was often considered quite challenging, both due to the course and the native wildlife. In a 1927 match between Canadian Open champion and Gulf Stream Golf Club professional C.R. Murray and Delray professional Henry Ostro, the Delray Chief of Police shot an alligator in a water hazard. According to Canadian Golfer (1927), this stopped the “game for fifteen minutes.” Young Bob and Norma Miller playing on the municipal golf course, c. 1930s. Miller Family Collection, DBHS Archives. To maintain the course, the City established a golf committee to oversee its management. Their tasks included purchasing equipment and fertilizer, installing telephones, and initiating general improvements of both the clubhouse and greens. The committee included several notable city leaders, including first mayor John S. Sundy, Benjamin F. Sundy, E.M. Wilson, Clint Moore Jr., J.C. Keen, Dwight Bradshaw Sr., and J.B. Smith. Fallen palm trees and damage to the municipal golf course following a hurricane, September 1947. DBHS Archives. Like other neighboring golf courses, the club closed during World War II. When it reopened in 1945, there appeared to be a renewed interest in the course, coinciding with yet another land boom. The Front Nine After World War II, Florida entered a second land boom with many soldiers, families, and retirees relocating to Florida. In Palm Beach County alone, the population increased from 114,688 in 1950 to 348,993 in 1970. Delray’s population, specifically, rose from 6,312 to 19,366. To accommodate the new residents, the City once again looked to expanding the golf course. Players scattered across the greens at the Delray Beach municipal course, c. 1940s. State Archives of Florida. In 1950, the City opened the second nine holes, designed by preeminent course architect Louis Sibbet “Dick” Wilson. Wilson had an extensive career before turning to architecture. A Philadelphia native, Wilson worked with designers Howard C. Toomey and William S. Flynn as a construction supervisor on a variety of projects, including the Shinnecock Hills Golf Club, the Cleveland Country Club, the Indian Creek Club in Miami, and the Boca Raton Resort. According to an interview with Sports Illustrated in 1962, the Great Depression kept Wilson in Florida. “Building golf courses in Depression days was about as lucrative as peddling hard liquor to Mormons,” wrote golf sportswriter Herbert Warren Wind, “so Wilson found a job managing the Delray Beach Country Club and took small renovation jobs when he could find them. He camouflaged airfields early during World War II and launched himself into golf architecture on a full-time basis in 1945.” Members of the Delray Beach Women’s Golf Association, Delray Beach Golf Committee, and Delray Beach Golf Club management breaking ground on the front nine, 1949. DBHS Archives. The new course cost approximately $42,000 and Mike Blank oversaw the course’s construction. Blank, of course, was no stranger to golf courses. Tropical Golf Center, located on Federal Highway, was also known as the Mike Blank Golf Center. Golfers at the Delray Beach Golf Club, February 1957. DBHS Archives. In 1952, a small group of regular players — all men over the age of 60 — formed the “Inner Circle.” The impromptu club began in 1949 when the men began gathering each Monday, Wednesday, and Friday morning to play. While they did not have formal competitions until 1966, the men began playing for prizes in 1957 when Wilson gifted them a dozen golf balls as trophies. Professionals in Paradise The Delray Beach municipal golf course was often frequented by golf professionals who would play through the first nine holes before heading down to Miami. They included Gene Sarazen, Tommy Bolt, Tom Creavy, and Walter Hagen. Gene Sarazen caught in a sand trap, c. late 1940s. DBHS Archives. Gene Sarazen playing for spectators, c. 1950s. DBHS Archives Toney Penna, a touring professional with MacGregor Golf Company and golf club designer, also played on the municipal course. Penna moved to Delray in approximately 1946 and lived across the Intracoastal from his longtime friend and Boca Raton Club professional, Tommy Armour. Autographed photograph of Toney Penna, c. 1940s. DBHS Archives. Once Armour’s regular caddie at the Westchester Country Club in the 1920s, Penna often hit golf balls across the waterway, trying to make it into Armour’s backyard. Armour, of course, returned the favor. In 1955, Bob Hope visited Toney Penna’s Delray Beach home. Delray Beach News Journal. DBHS Archives. According to the Florida Historic Golf Trail, during a dinner party at Penna’s house, a group of professional and amateur golfers wanted to see who could hit a golf ball “across the canal to Armour’s house, using his back window as the target. To make it harder they had to stand on one foot. After they marked the balls, they started sending them nearly 250 yards across the canal. Only one ball made it to Armour back yard and that was from Jimmy Demaret.” Armour, also known as the “Silver Scot,” served as a golf instructor at the Delray Beach club for approximately 15 years. Delray Beach resident and golf club professional Ralph Stewart in front of the clubhouse, c. 1950s. DBHS Archives. Women in Golf Jeannette DeWitt, Jessie Butts, Ralph Stewart, Cecilia Chace, and Maria Nieder with their trophies at the Delray Beach municipal golf course, c. 1949. Women in Delray were also avid golfers. By the 1940s, women joined the City’s golf committee and later formed the Delray Beach Women’s Golf Association. The organization participated in tournaments throughout Palm Beach County, often playing against other organizations from West Palm Beach and Lake Worth. Agnes Boughton with her trophy at the Delray Beach Women’s Golf Association luncheon at Patio Delray, 1949. Members included Elizabeth McDaniel, Elizabeth Spencer, Eulalie Garner, Monna Van Kooy, Maria Nieder, Grace Stewart, Gladys Senior, Grace Nickell, Jeanette DeWitt, Dorotha Bauer, Elizabeth Doherty, Elsie Byrd, Cecilia Chace, Alberta McNeece, and Jessie Butts. In March 1966, the golf club held the inaugural Louise Suggs Invitational, a golf tournament on the Ladies Professional Golf Association (LPGA) tour. While it was open to amateur players, they played against several top golfers, such as Marilynn Smith (winner of the St. Petersburg Open), Kathy Whitworth, and Gloria Armstrong. Suggs, an LPGA player and Delray resident, hosted the event for several years. Suggs also taught golf at the Delray Beach golf club as well as LPGA Hall of Famer Betty Jameson. In 1990, the course hired Sandra Eriksson, an LPGA Teaching & Club Professional member, to be head professional. Before arriving in Delray, Eriksson was the Director of Research for the National Golf Foundation and Regional Sports Director for the March of Dimes. Louise Suggs playing at the Delray Beach Country Club, c. 1950s. DBHS Archives. Golf and Jim Crow: Integration Prompts Sale While the city-owned course made golf accessible to many Delray Beach residents, like most facilities in the Jim Crow South, it was far from equitable. After Brown v. Board of Education (1954) declared “separate but equal” legislation unconstitutional, schools and other public facilities slowly began to integrate across the country. This included beaches, parks, swimming pools, and golf courses. Dedication ceremony of the new clubhouse at the municipal golf course. Delray Beach News Journal, 1955. DBHS Archives. In 1956, Delray Beach residents fought to desegregate the municipal beach and pool. When a federal judge dismissed a lawsuit against the city, citing testimony that there were no ordinances banning people of color from the municipal beach and pool, Delray’s Black citizens exercised their right to access the beach. After a group of angry white citizens attacked the group and threatened violence, civic leadership passed several “emergency ordinances” to curb racial violence, but these laws often disproportionally harmed Delray’s Black community. This included an outright ban of African Americans on the beach and municipal pool, police searches, roadblocks, and a resolution to exclude the entire Black district from Delray Beach’s city limits. Delray’s municipal beach, c. 1950s. DBHS Archives. Although city leadership agreed to drop the exclusion resolution after a televised meeting with the Delray Beach Civic League, the tumultuous summer of 1956 seemingly influenced the sudden sale of the golf course in 1957. Several local newspapers, including the Delray Beach Journal , Palm Beach Post , Fort Lauderdale News and The Miami Herald , pointed to integration as a key component of the City’s decision. “The proposal to sell the golf course to private individuals is interpreted as a move by the city to prevent use of the course by Negroes,” the Palm Beach Post reported. “Private ownership of the golf course has been suggested as a method of regulating use of the course.” Ralph Stewart and unidentified caddie in front of the Delray Beach Country Club clubhouse, c. 1950s. While African Americans were permitted to work at the club, including later community leader and activist Rev. Semmie Taylor, they were not allowed to play golf or enjoy the public amenities until the 1970s. DBHS Archives. According to Fort Lauderdale News reporter Bill Beck, commissioners and city officials often agreed – off the record – that the major reason for the sale was to “avoid any possible racial controversy. Yet, when the question was asked ‘What weight did integration have in the decision to sell?’ it prompted only a chorus of ‘let’s not talk about’ and ‘no comment.’” Officials cited the construction of the new City Hall and general improvements throughout the city as the reason for the sale. The Delray Beach Journal expressed a similar opinion in an October 1957 editorial. “While it will probably never gain any official recognition, the main reason advanced for disposing of the golf course to private ownership is to avoid eventual integration.” The Journal , however, also believed “integration may be forestalled for many years. It is possible there could be even a reversal in the present trend.” The Grimes Foundation Takes Over In September 1957, airplane lighting inventor and philanthropist Warren G. Grimes offered the lone bid to purchase the golf course for $350,000 (approximately $3.9 million today). Under the terms of the deed, the land could only be used as a golf course and recreation center for 50 years or it reverted to the city; the city had the right to repurchase the course 20 years after the transfer of ownership; and the city had the right of first refusal to any potential sale within that 20-year period. During later negotiations, the Grimes Foundations insisted the word “private” also be included in the deed, insisting he was trying to “save the city from a problem.” Grimes built his research facility on the northwestern side of Lake Ida, alongside the Seaboard Air Line Railroad tracks, 1959. Courtesy of Gary Fishman. People are often surprised by Grimes’ involvement with the golf course. Instead, Grimes is best known for his contributions to Delray Beach, including sponsoring the city’s July 4 th fireworks display over Lake Ida and the Christmas Tree on the beach, donating land to Bethesda Hospital, and regular contributions to the library. In a July 1957 telegram to the Delray Beach Journal , Grimes noted his Foundation also lent the city $100,000 for the golf course’s 1955 clubhouse and to pay off past debts on the course. While the loan carried 3% interest, the interest paid by the city was then donated by the Foundation to the public library. Grimes insisted any profit made by the golf course would be used for “charitable or educational purposes” within Delray Beach. Warren Grimes attended the dedication of the clubhouse in 1955. Delray Beach News Journal, DBHS Archives. Several residents were vehemently opposed to the sale. In August 1957, former commissioner and city attorney Neil E. MacMillan circulated a petition against the sale, noting: “Land is gold. Large tracts are unobtainable and small tracts are scarce and expensive to replace. The land comprising the golf course, in event of discontinuance of the golf course in the future, would be needed as a large public park or for other public municipal purposes not yet foreseen. To sell the land now at any price would ‘sell out’ the heritage of our children. Our city is perpetual and its assets should be preserved with this in mind.” The petition was backed by former city commissioner John Kabler, former city commissioner and business owner W.C. Musgrave, and planning and zoning board member James I. Sinks. Their comments focused heavily on the scarcity of land within the city and the need to preserve land as the city grew, a notable concern amid the population and land boom. The petition inspired the Chamber of Commerce to conduct a poll of its membership and the Kiwanis Club to study aspects of the proposed sale. The Delray Beach Journal also expressed opposition. Aerial view of Delray Beach looking north, including the Delray Beach Country Club, 1959. DBHS Archives. During a commission meeting in late August 1957, the commission decided to hold a referendum in November, allowing taxpayers to vote on the transfer of ownership. Following the meeting, the Grimes Foundation began a newspaper and mail advertising campaign, hoping to persuade voters to support the sale. They also met with the local Golf Association, who gave “overwhelming support to the sale.” JB Smith and other golfers at Delray Beach Country Club, c. 1950s. DBHS Archives. The Women’s Golf Association was also in favor, explaining the club would remain under control of committees elected by club members and annual tournaments would continue. Their campaigns, it seemed, ultimately worked. On November 5, 1957, 1,361 out of 1,800 freeholders voted in favor of the sale. After several months of contentious negotiations over details of the deed, the city finally delivered the deed and title to the Grimes Foundation on March 21, 1958. The Delray Beach Country Club For the most part, the Grimes Foundation’s ownership of the golf course changed very little. The course and clubhouse continued to hold tournaments, wedding receptions, political events, and fundraisers (including a “brunch-eon” fashion show). Housing developments along West Atlantic Avenue also took advantage of the proximity to the Country Club, often utilizing it in advertisements. Advertisement for Rainbow Homes of Delray Beach. The Miami Herald, 1960. The only major disagreement that arose between Grimes and the city commission occurred over three trailers/mobile homes on the property. When the clubhouse and new pro shop were robbed twice in less than a week, Grimes wanted to install mobile homes to house the club’s security personnel. The city denied his request, citing a new ordinance prohibiting trailers within city limits. Grimes declared the city had a “moral responsibility” for any future thefts and even proposed a lawsuit to remove the course from city limits if he was not granted a variance. Eventually, in March 1961, the city conceded to Grimes, who, in return, provided all the sod and soil needed for landscaping the new City Hall grounds. Scorecard and course map for the Delray Beach Country Club, c. 1950s. DBHS Archives. In addition to new security and course improvements, Grimes also worked to expand the course. In 1961, he acquired over 42 acres and hired Robert Lawrence to design a “third nine,” creating a 27-hole course. The third nine opened on January 15, 1962, and featured Ormond Bermuda grasses and Everglades No. 1 strains. Management also planted 1,000 palm trees and melaleuca trees, the latter of which is now considered an invasive species. The course held junior tournaments and classes to encourage young players, 1961. DBHS Archives. R.W. McDowell and Robert Bruce Harris In February 1964, the Grimes Foundation requested to sell the golf course. The bidder was R.W. “Rollie” McDowell, a Fort Lauderdale man who owned similar properties. Although rumored to be “representing a Chicago syndicate of golf course operators,” according to the Palm Beach Post , McDowell’s attorney denied those accounts. After the city declined repurchasing the course in early March, McDowell bought the club for $500,000. McDowell quickly began refurbishing the clubhouse and greens. He replaced the framework and jalousie windows with concrete blocks and plate glass; added a tap room, patio, and covered walkway; and installed air conditioning throughout the clubhouse. By October 1965, however, McDowell went before the commission and notified them about his intention to sell the club again for $563,500. Advertisement for the Delray Beach Country Club. Boca Raton News, December 1966. This time, in November 1965, the golf course was purchased by Robert Bruce Harris, a Chicago-based golf course architect. Harris was well-known in southern Palm Beach County golfing circles. In addition to his two golf courses in Chicago, Harris established and designed the Country Club of Florida in the Village of Golf, a small municipality just west of Boynton Beach. (An interesting fact: while the city was considering repurchasing the course, Harris was designing a new golf course in Lake Geneva, Wisconsin for Playboy.) During his tenure, Harris made the course “semi-private.” This meant the new ownership would accept private memberships, but guests of club members could play on a greens-fee basis. Harris owned the property until his death in 1976. After his death, ownership passed to his wife, Elizabeth Harris through their company, Florida Golf Club, Inc. The Municipal Course By 1977, the Delray Beach Country Club was in dire straits. The course had not been actively maintained following Harris’ death and the pro shop was still not air conditioned. While the city had a chance to repurchase a section of the course in 1973, the $3.7 million price tag was deemed too steep. City leadership, including avid golfer and former mayor Jim Scheifley, recognized they could repurchase the course beginning on March 21, 1978 and bring a public course back to Delray Beach. In addition to city commissioners, numerous residents expressed their support of repurchasing the course during the January 9th commission meeting, such as Chamber of Commerce President Jeff Hill and residents from developments neighboring the course. Palm Beach Post, 1978. On February 1, 1979, the city officially purchased the 18-hole golf course from Elizabeth Harris and Florida Golf Club Inc. for $2 million in municipal bonds (Harris sold the third nine at an earlier date). Approximately $1.5 million went toward the land and $500,000 funded rebuilding the greens, replanting fairways, installing an automatic sprinkler system, improving the clubhouse, and buying golf carts. In June 1980, the city hired Frank Clark as manager of the municipal golf course. Clark was commended by golfing associations for his improvements, particularly installing rain shelters with emergency phones and first aid kits. Head groundskeeper Tom Egnaczyk at the Delray Municipal Golf Course, 1985. DBHS Archives. Delray Beach Golf Club, 1994-2024 The municipal course’s past thirty years have seen numerous changes and growth. In 1995, the club opened a new $2.2 million clubhouse designed by local architect Digby Bridges. The grand opening ceremony was well-attended by both city officials and golf professionals, including Betty Jameson, Louise Suggs, Tommy Armour, golf course architects Alice and Pete Dye, former mayors Jim Scheifley and Leon Weeks, and longtime Delray golfer Stuart Weeks. Program for the grand reopening of the Delray Beach Golf Club, 1995. DBHS Archives. In 2000, the US Golf Association named the Delray Beach Golf Club “one of the finest public golf courses in the nation.” In 2003, under Eriksson’s direction, the course underwent significant improvements, such as the installation of TifEagle, a more heat resistant strain of grass, on all 18 holes. In recent years, the course was featured on the Florida Historic Golf Trail, which highlighted the club’s notable professionals and Donald Ross-designed back nine. The city also faced another prospective bid for a portion of the course, but ended when citizens voiced their concerns over development of the green space with arguments that echoed those of the 1958 sale. In June 2023, the Delray Beach City Commission unanimously agreed the course should be listed on the local Register of Historic Places. As the history of the municipal course suggests, it has undergone many changes over the years. Yet, despite its variations, it remains the site of memories and stories from longtime Delray Beach residents and golf players, and one of the relatively few public golf courses in Palm Beach County. This National Golf Month, be sure to enjoy a good walk (and perhaps a few rounds of golf) on Delray’s historic course. For questions or comments, email the Archivist! [email protected] Related Posts Adventurous and Spirited Women Set Out to Change Delray, 1902-1924 March 8, 2023 Mayor Catherine E. Strong: Making H(er)story in Delray Beach March 18, 2024 Prohibition in the Sunshine State: South Florida's History of Temperance and Rebellion, 1896-1934 May 22, 2025 Search Upcoming Events & Programs October 15th, 2025 Annual Membership Meeting October 21st, 2025 Heritage Lecture: \"Preserving Local Treasures: Lake Worth Lagoon\" October 25th, 2025 Welcome to Fall: Our Harvest Cookout! View All Events & Programs History Exhbits Visit year-round. Tuesday - Saturday: 11am - 3pm View All Exhibits Contact Us Phone: (561) 274-9578 DBHS Mailing Address: 3 NE 1st Street Delray Beach, FL 33444 E-mail: [email protected] Office & Archive Hours Tuesday - Friday: 9am – 5pm Archive Research by Appointment Tuesday - Friday: 10am – 4pm History Exhibits Tuesday - Saturday: 11am – 3pm Heritage Garden 7 days / week 10am - 5pm (self-guided) Newsletter Sign Up Follow Us Copyright © 2025, Delray Beach Historical Society. All Rights\n Reserved. | Website by: Green Group Studio"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/restaurant/",
      "text": "Delray Beach Golf Club Restaurant - Delray Beach Golf Club Skip to main content Skip to primary sidebar Delray Beach Golf Club Delray Beach, FL Open to the Public! |  (561) 243-7385 | 2200 Highland Avenue, Delray Beach, FL, 33445 Tee Times Golf Rates Photo Gallery Course History Scorecard Practice Area Getting Started at DBGC Calendar Instruction Professional Teaching Staff Clinics & Junior Programs Loyalty Card Weddings & Events Director of Catering, Bryan Tyrell Events Photo Gallery Catering Event Calendar Restaurant Restaurant Menu Join E-Club Contact Course Managers Join the Team Book Tee Times E-Club Signup Delray Beach Golf Club Restaurant The Delray Beach Golf Club restaurant was recently voted “Best of Delray.” Our culinary team has a full menu daily for lunch and we offer an unlimited selection of special event menus. Be sure to stop by before or after your round to enjoy a simple snack or full meal prepared by our outstanding staff. For more information, please contact TyrellB@mydelraybeach.com Primary Sidebar Quick Links Tee Times Rates Scorecard Getting Started at DBGC Contact Us Delray Beach Golf Club | 2200 Highland Avenue | Delray Beach, FL 33445 | (561) 243-7385 Copyright © 2025 Delray Beach Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/getting-started-at-dbgc/",
      "text": "Getting Started at DBGC - Delray Beach Golf Club Skip to main content Skip to primary sidebar Delray Beach Golf Club Delray Beach, FL Open to the Public! |  (561) 243-7385 | 2200 Highland Avenue, Delray Beach, FL, 33445 Tee Times Golf Rates Photo Gallery Course History Scorecard Practice Area Getting Started at DBGC Calendar Instruction Professional Teaching Staff Clinics & Junior Programs Loyalty Card Weddings & Events Director of Catering, Bryan Tyrell Events Photo Gallery Catering Event Calendar Restaurant Restaurant Menu Join E-Club Contact Course Managers Join the Team Book Tee Times E-Club Signup Getting Started at DBGC DBGC Men ’ s Groups Men’s Golf Association (Wednesdays): The Men’s Golf Association plays every Wednesday throughout the year.  The MGA has weekly games with tee times beginning at 7:15 a.m., and is often followed with good conversation at the Tommy Armour lounge! An annual membership fee is required which also covers the cost of your GHIN handicap. Contact John Danis at 440 796-0311 or jvdanis1@gmail.com for more information how to join this very popular men’s group! “The Bandits” (Mondays): The Bandits play every Monday year-round, with tee times beginning at approximately 7:30 a.m. This group is associated with the Men’s Golf Association with many familiar faces, The Bandits have multiple formats throughout the year, and often have over 60 players per week! For more information, please contact Mark Grewco mgrewcoe@yahoo.com.au  561 229-5077. “The Wolfpack” (Saturdays): Similar to “The Bandits”, “The Wolfpack” plays every Saturday year-round with tee times beginning at approximately 7:45 a.m. An optional skins game and closest to the pin contest is also played. Afterwards, join the men in the Tommy Armour lounge for laughs and lunch! For more information, please contact Tulio Pasini: tools49@aol.com / 516-317-3362 DBGC Ladies Groups Ladies Golf Association (Thursdays): The Ladies Golf Association plays every Thursday from November to May. This is a very active league with players of all skill levels. An annual membership fee is required which also covers the cost of your GHIN handicap. Tee times begin at 7:30 a.m. with new games every week. This is a league you don’t want to miss out on! For more information, please contact Sandra Maier: msmaier126@gmail.com Primary Sidebar Quick Links Tee Times Rates Scorecard Getting Started at DBGC Contact Us Delray Beach Golf Club | 2200 Highland Avenue | Delray Beach, FL 33445 | (561) 243-7385 Copyright © 2025 Delray Beach Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.delraybeachgolfclub.com/contactus/",
      "text": "Contact Us - Delray Beach Golf Club Skip to main content Skip to primary sidebar Delray Beach Golf Club Delray Beach, FL Open to the Public! |  (561) 243-7385 | 2200 Highland Avenue, Delray Beach, FL, 33445 Tee Times Golf Rates Photo Gallery Course History Scorecard Practice Area Getting Started at DBGC Calendar Instruction Professional Teaching Staff Clinics & Junior Programs Loyalty Card Weddings & Events Director of Catering, Bryan Tyrell Events Photo Gallery Catering Event Calendar Restaurant Restaurant Menu Join E-Club Contact Course Managers Join the Team Book Tee Times E-Club Signup Contact Us Delray Beach Golf Club 2200 Highland Avenue, Delray Beach, FL, 33445 Hours of Operation Open Daily from 6:45am – 6:00 pm Main # : (561) 243-7385 Fax # : (561) 243-7386 Bryan Tyrell Director of Clubhouse Operations Bryan@jcdsportsgroup.com For information on JCD Sports Group’s other courses, please visit www.jcdsportsgroup.com . Primary Sidebar Quick Links Tee Times Rates Scorecard Getting Started at DBGC Contact Us Delray Beach Golf Club | 2200 Highland Avenue | Delray Beach, FL 33445 | (561) 243-7385 Copyright © 2025 Delray Beach Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://kingspointdelraybeachgolf.com/contact-us/",
      "text": "Contact Us - Kings Point Delray Beach Golf About Kings Point Golf Golf Course Courses Course Rates Hole-by-Hole Memberships Events Golf Leagues Events & Community Contact Us Select Page Contact Us Kings Point Delray Beach Golf  Call Us Tee Times: 561-638-2719 Executive Course: 561-499-7840 Par 3 Course: 561-499-0140  Hours: Tee Time Bookings: 7 AM–12 PM Executive Course: 7 AM–4 PM Last tee-times: Par 3 – 2:52pm Exec – 3:57pm  Find Us 6561 Flanders Way 6561 A, Delray Beach, FL 33484, United States Contact Us Play golf in  Delray Beach, FL  561-499-0140  [email protected]  7000 W Atlantic Delray Beach, FL 33446 © Copyright Kings Point Golf & Country Club by Lightspeed"
    },
    {
      "url": "https://clubchampion.com/locations/delray-beach",
      "text": "Custom Golf Club Fitting in Delray beach, FL| Club Champion Skip to main content My Store: Book fitting ORDER STATUS OUR FITTING PROCESS OUR FITTING PROCESS WHAT TO EXPECT RESULTS + REVIEWS CLUB CHAMPION DIFFERENCE FITTING TYPES OUR BUILD PROCESS MASTER FITTERS TECHNOLOGY PRODUCTS + SERVICES PRODUCTS + SERVICES FITTING TYPES + PRICING RESULTS + REVIEWS BRANDS GIFT CARDS ADDITIONAL SERVICES GIFT CARDS CLUB CHAMPION GIFT CARDS CLUB CHAMPION eCARDS LOCATIONS LOCATIONS NORTH AMERICA UNITED KINGDOM AUSTRALIA PRICING PRICING FINANCING GOLF CLUB CUSTOMIZATION FITTING TYPES CONTENT CONTENT BLOGS VIDEOS FITTING EXPERIENCE PODCASTS PRODUCTS + BRANDS ABOUT ABOUT CAREERS AMBASSADORS NEWSROOM PARTNERSHIP PROGRAM CONTACT US CONTACT US SUPPORT (FAQ) CAREERS CORPORATE EVENTS CHARITY REQUESTS Contact Us Contact Us Support (FAQ) Careers Corporate Events Charity Requests Order Status Gift Cards My Store: Our Fitting Process What to Expect What to Expect Results + Reviews Our Build Process Club Champion Difference Perfect Fit Guarantee Fitting Types Master Fitters Technology BOOK FITTING What is a Custom Club Fitting? The Club Champion Difference Products + Services Golf Club Fittings Golf Club Fittings Results + Reviews Brands Gift Cards Golf Club Customization Trade In P. A. R. — PERKS + REWARDS BOOK FITTING Club Champion's Results + Reviews What is a Custom Club Fitting? Gift Cards Locations Locations United States Canada United Kingdom Australia BOOK FITTING Club Champion Glendale, AZ Club Champion Bridgewater, NJ Pricing Pricing Pricing Financing Golf Club Customization Fitting Types BOOK FITTING 12 Month Promotional Financing* Custom Club Fitting Types Content Content Blogs Videos Fitting Experience Podcasts Product & Brands BOOK FITTING Building the Ultimate Driver // 5 Steps Toward Driver Success PODCAST: (Don't) Hate the Player About About Careers Newsroom Military + First Responder Partnership Program Affiliate Program BOOK FITTING Work With Us - Club Champion Careers News About Club Champion Contact Us Support (FAQ) Careers Corporate Events Charity Requests BOOK FITTING Work With Us - Club Champion Careers News About Club Champion Order Status Book fitting My Store: WillowBrook SELECT A STORE Search View All Locations DELRAY BEACH GOLF CLUB FITTING Parking at the store is limited; you can use the valet service located right next to the store or you can drop your clubs there and self-park your car. GET DIRECTIONS IN GOOGLE BUSINESS *Terms *Terms Delray Beach, FL MAKE THIS MY STORE 14917 Lyons Road, Suite #102 Delray Beach, FL 33446 Phone: (561) 774-2147 Store Hours: Monday 9 AM—6 PM Tuesday 9 AM—6 PM Wednesday 9 AM—6 PM Thursday 10 AM—6 PM Friday 9 AM—5 PM Saturday 9 AM—5 PM Sunday Closed Ready to book a fitting? Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Receive Club Champion email messages Invalid Input Get started IMPROVE YOUR GAME — LET CLUB CHAMPION SHOW YOU HOW Take your game to new heights with a Club Champion custom golf club fitting. For golfers in the Delray Beach area, Club Champion is your #1 destination for golf club fitting for any level of golfer. We deliver a Tour-level custom club fitting that produces longer, more accurate shots. Our approach is unbiased; no specific vendor is promoted. The only goal is to find the best combination of golf club components to lower your scores. Everything from clubhead, shaft, length, grip, loft, lie, swingweight and more is addressed using state-of-the-art club fitting technology and analyzed by Club Champion’s master fitters and builders. With 65,000+ hittable head and shaft combinations, your best golf is waiting for you at Club Champion. Our studio is conveniently located between Apiero restaurant and Visual Eyes in the Delray Marketplace. Club Champion also has Florida studios in Bradenton , Brandon , Destin , Fort Myers , Jacksonville , Jupiter , Miami , Naples , Orlando , Sanford , and The Villages . FAQ's Are custom fit golf club more expensive Not necessarily. Because Club Champion hand builds clubs to the tightest tolerances and offers aftermarket equipment options, custom clubs can be more expensive than off-the shelf options. However, custom clubs are built to ever golfer's specific swing details, leading to lower scores and better golf. What are custom fit golf clubs? Custom-fit golf clubs are clubs that match a specific golfer's swing and needs. This involves using technology to determine a variety of ideal metrics like loft, lie, shaft flex, length, and more to ensure the club is working with your swing, and not against it. Does this location offer driver shaft repair? Yes! All Club Champion locations offer shaft repair services. Does this location offer regripping for golf clubs or grip replacements? Yes! All Club Champion locations offer regripping and grip replacement services. Can you repair golf clubs? Club Champion offers club repair services. Some golf clubs can be repaired, but it depends on the issue and condition of the club. MEET OUR MASTER CLASS OF CLUB FITTERS A better game starts with a better custom golf club fitting. That’s why each one of our fitters goes through hundreds of hours of rigorous textbook and hands-on training at our exclusive Club Champion University. That’s on top of manufacturer certifications and bi-weekly training calls. Because of our unmatched high standards, Club Champion has been ranked as one of Golf Digest’s Top 100 Club Fitters for the past ten years in a row. David Barraza Master Fitter and Builder FAVORITE PRO GOLFER Jason Day and Minjee Lee FAVORITE LOCAL COURSE Madison Green Country Club, Palm Beach National, High Ridge Country Club Read more FAVORITE SPORTS TEAM Tampa Bay Bucs and The Ohio State University OTHER HOBBIES Video Games Ryan Matruder Master Fitter and Builder FAVORITE PRO GOLFER Jon Rahm + Cam Smith FAVORITE LOCAL COURSE North Palm Beach Country Club Read more FAVORITE SPORTS TEAM Philadelphia Eagles OTHER HOBBIES Fishing, hunting John Stefaniw Master Fitter and Builder FAVORITE PRO GOLFER Tiger Woods & Jordan Speith FAVORITE LOCAL COURSE The Boca Raton Golf Course Read more FAVORITE SPORTS TEAM New York Jets, New York Rangers and New York Mets OTHER HOBBIES Local Run Club WHAT OUR CUSTOMERS SAY WHAT OUR CUSTOMERS SAY IMPROVE YOUR GOLF GAME WITH A CUSTOM GOLF CLUB FITTING Club Champion is the globe’s top club fitter, with more than 125 locations worldwide. Each cutting-edge studio offers industry-leading Master Fitters who fit and handcraft every club to your unique needs. Make breaking 100, 90, or 80 a reality with our unrivaled, comprehensive custom club fittings. We’re happy to fit your existing set or fit you for new clubs. THE CLUB CHAMPION DIFFERENCE CLUB FITTINGS WITH DATA DRIVEN RESULTS. The quickest way to measurable game improvement is through a custom club fitting. Whether you're looking for more distance off the tee, tighter and more predictable dispersion, fewer putts, or all-around lower scores, a custom fitting at Club Champion is the recipe for your success. FITTING OPTIONS + PRICES Fitting Types Price Duration Full Bag Fitting (all woods, irons, wedges, putter) $400 3 hrs Full Bag Fitting Minus Putter (all woods, irons, wedges) $325 2.5 hrs Long Game Fitting (driver, fairways, hybrids) $250 2.5 hrs Driver Fitting $175 1.5 hrs Iron + Wedge Fitting $175 1.5 hrs Fairway Wood/Hybrid Fitting $125 1 hr Putter Fitting $125 1 hr Wedge Fitting $100 1 hr CLUB CHAMPION FITTINGS: THE BEST VS. THE REST When you compare, there’s no comparison. With superior equipment, cutting-edge technology, world-class fitters and master builders, a Club Champion custom fitting is the best in the business. By far. So, forget the rest – get fit at Club Champion and play your best. Our in-depth process starts in the fitting bay and ends with you shooting lower scores. Every step along the way was designed to match custom golf clubs to your individual swing. LEARN MORE ABOUT THE FITTING PROCESS A TOUR-DE-FORCE OF TOUR-LEVEL TECH. To help lower your scores, make a date with data. Because at your custom fitting, data drives everything we do. Golf’s very best technology — the same tech the pros use — will measure every metric of your game, provide invaluable insights and optimize performance. From TrackMan Pro in-depth analysis, to the industry standard SAM PuttLab, to SST Pure Golf Shaft Alignment, your game is not only in the best hands. It’s in the best tech. LEARN MORE ABOUT PRODUCTS + SERVICES 65,000+ head, shaft and grip combos to design and fine-tune the perfect clubs for your game. Golf Pride BGT Best Grips Veylix Axis1 Cleveland Edel Miura Nippon LAB Golf Titleist PXG Bettinardi Vice Golf Mitsubishi Sacks Parente Wilson Staff Fujikura True Temper P2 Iomic Accra SuperStroke Graphite Design Cobra Newton Golf Shafts Arccos TaylorMade ProjectX Evnroll JP Golf Lamkin Kinetixx LA Golf Srixon Garsen Ben Hogan SeeMore Winn 2Thumb Odyssey TourEdge More Golf UST Mamiya Toulon PRGR No1 Vice Golf Aerotech SwitchGrips Traxion Callaway Bridgestone GripMaster Homna Aldila Epon XXIO Flat Golf PING Scotty Cameron KBS VA composites Mizuno OBAN Bloodline Explore Products + Services Set C — Alert CSS Products + Services Perfect Fit Guarantee Pricing Locations Content FAQ About Contact us Careers Privacy Policy CCPA Privacy Notice Manufacturer Warranty Gift Card Terms + Conditions Contest Rules Products + Services Perfect Fit Guarantee Pricing Locations Content FAQ About Contact us Privacy Policy CCPA Privacy Notice Perfect Fit Guarantee Products + Services Pricing LOCATIONS Location Directory CONTENT About FAQ Contact Us Careers MILITARY + FIRST RESPONDERS Products + Services Perfect Fit Guarantee Pricing Locations Content FAQ About Contact us Careers Privacy Policy CCPA Privacy Notice Manufacturer Warranty Gift Card Terms + Conditions Contest Rules Products + Services Perfect Fit Guarantee Pricing Locations Content FAQ About Contact us Privacy Policy CCPA Privacy Notice Perfect Fit Guarantee Products + Services Pricing LOCATIONS Location Directory CONTENT FAQ Military + First Responder RESULTS + REVIEWS About P. A. R. — PERKS AND REWARDS Contact Us Careers My Account NEWSLETTER SIGN UP SUBSCRIBE NOW Copyright © Club Champion. All rights reserved. Privacy Policy CCPA Privacy Notice Manufacturer Warranty Gift Card Terms and Conditions BOOK A FITTING Please complete all required fields! Full Name* Full Name Required (First Name and Last Name) Email* Valid Email Required Receive Club Champion email messages Invalid Input Get started Change fitting location Search × × BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input State Please select a state. Alabama Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Idaho Illinois Indianapolis Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina Tennessee Texas Utah Vermont Virginia Washington Wisconsin Invalid Input Store Please select a store. Huntsville Montgomery Mountain Brook Invalid Input Store Please select a store. Scottsdale Tucson Invalid Input Store Please select a store. Little Rock Invalid Input Store Please select a store. Agoura Hills Corona Del Mar Newport Beach Palm Desert Pleasanton Roseville San Carlos San Jose Santa Monica Torrance Invalid Input Store Please select a store. Colorado Springs Highlands Ranch Westminster Invalid Input Store Please select a store. Hartford Westport Invalid Input Store Please select a store. Christiana Invalid Input Store Please select a store. Bradenton Brandon Coral Springs Delray Beach Destin Fort Myers Jacksonville Jupiter Marco Island Naples Orlando Pembroke Pines Reunion Sanford The Villages Invalid Input Store Please select a store. Buford Peachtree City Sandy Springs Invalid Input Store Please select a store. Meridian Invalid Input Store Please select a store. Chicago Deerfield Schaumburg Willowbrook Invalid Input Store Please select a store. Indianapolis Invalid Input Store Please select a store. Des Moines Invalid Input Store Please select a store. Overland Park Invalid Input Store Please select a store. Louisville Invalid Input Store Please select a store. Mandeville Metairie Invalid Input Store Please select a store. Westbrook Invalid Input Store Please select a store. Frederick Owings Mills Rockville Invalid Input Store Please select a store. Bedford Hanover Needham Northborough Invalid Input Store Please select a store. Ann Arbor Grand Rapids Royal Oak Invalid Input Store Please select a store. Edina Woodbury Invalid Input Store Please select a store. Ridgeland Invalid Input Store Please select a store. Creve Coeur Lake St. Louis Invalid Input Store Please select a store. Omaha Invalid Input Store Please select a store. Las Vegas Reno Invalid Input Store Please select a store. Portsmouth Invalid Input Store Please select a store. Cherry Hill Hackensack Livingston Princeton West Long Branch Invalid Input Store Please select a store. Albuquerque Invalid Input Store Please select a store. Albany Manhattan Syosset Victor White Plains Williamsville Invalid Input Store Please select a store. Asheville Cary Charlotte Durham Wilmington Winston Salem Invalid Input Store Please select a store. Cincinnati Columbus Perrysburg Warrensville Heights Westlake Invalid Input Store Please select a store. Oklahoma City Invalid Input Store Please select a store. Tigard Invalid Input Store Please select a store. Center Valley Pittsburgh Wayne Invalid Input Store Please select a store. Warwick Invalid Input Store Please select a store. Bluffton Columbia Greenville Mount Pleasant Myrtle Beach Invalid Input Store Please select a store. Farragut Franklin Memphis Invalid Input Store Please select a store. Austin Dallas Fort Worth Houston Kingwood Midland Plano San Antonio Shenandoah Southlake Sugar Land Invalid Input Store Please select a store. Salt Lake City Invalid Input Store Please select a store. Williston Invalid Input Store Please select a store. Ashburn Charlottesville Fairfax Fredericksburg Richmond Virginia Beach Invalid Input Store Please select a store. Bellevue Tacoma Invalid Input Store Please select a store. Brookfield Madison Invalid Input SCHEDULE NOW × × P.A.R. PROGRAM (PERKS AND REWARDS PROGRAM) TERMS AND CONDITIONS Club Champion may, at any time, terminate, alter or modify the P.A.R. program and/or these Terms and Conditions without any further obligations and/or benefits to members without notice even though such changes may affect the value of benefits or rewards for redemption. Club Champion reserves the right to apply changes retroactively to benefits already accrued under the program. These terms and conditions are void where prohibited by law. BENEFIT TERMS: 1 free fitting, excluding full bag. Use your P.A.R. Membership # to book your free fitting, excluding full bag fittings, online or by calling Club Champion. This fitting must be booked and completed within your membership period. This benefit does not roll over in the event of a requalification. Fitting must be completed in one appointment. Not applicable to previous fittings or bookings. Appointments are limited. 3 free 1-hour TrackMan practice sessions. 1-hour TrackMan practice sessions must be booked through your fitter or through Club Champion’s Customer Experience team; please relay your P.A.R. Membership #. TrackMan sessions may be subject to blackout times. TrackMan sessions cannot be booked more than 14 days out. TrackMan sessions cannot be canceled or rescheduled; a request for cancelation or rescheduling will result in a forfeiture of the asset. Sessions must be booked in one-hour (60-minute) increments and cannot be split. This benefit does not roll over in the event of a requalification. Sessions are subject to bay and fitter availability. Appointments are limited. $5 discount per golf ball dozen. Receive a $5 discount on golf ball brands carried in-store. Not applicable to golf balls that are already discounted. Please relay your P.A.R. Membership # at time of purchase. Purchase must be made in-store. Subject to ball inventory. Not applicable on previous purchases. Free new grip installation. Receive a waived installation fee ($6 savings per grip) per new grip. Only applicable on grips purchased through Club Champion. Please relay your P.A.R. Membership # at time of purchase. Purchase must be made in-store. Grip selection subject to inventory. Not applicable on previous purchases. 50% off SST PUREing and retro-PUREing. Receive 50% off shaft SST PUREing or retro-PUREing. Please relay your P.A.R. Membership # at time of purchase. Purchase must be made in-store. PUREing or retro-PUREing may require that clubs be sent to a Club Champion warehouse; the process, including shipping, may take up to 10 business days and is subject to third-party shipping timelines. Not applicable on previous purchases. Club customization. Receive customization (stamping, paint fill, custom ferrules) up to a $50 value. The $50 value must be used on a single transaction; if the entire value is not used, the remainder will be forfeited. Please relay your P.A.R. Membership # at time of purchase. Customization must be done by Club Champion builders; refinishing and other third-party customizations are excluded. Customization may require that clubs be sent to a Club Champion warehouse; the process, including shipping, is subject to builder availability and third-party shipping timelines. This benefit does not roll over in the event of a requalification. Subject to availability. Not applicable on previous purchases. Exclusive offers and giveaways. Subject to the offer or giveaway terms. MEMBERSHIP/ELIGIBILITY Club Champion P.A.R. program is open to all persons who are at least 13 years of age, residents of the United States (including United States territories) or Canada; and have provided a valid email address at the time of their fitting and qualifying purchase. Club Champion customers are automatically enrolled in the program by completing a qualifying purchase of $1,500 or more. By participating in the P.A.R. program, you represent that you agree to these terms and conditions. Customers may opt out of the program by notifying Club Champion (see details below). Your membership is non-transferable and is subject to these terms and conditions, as they may be amended from time to time. Enrollment begins upon the completion of your first qualifying purchase. After your qualifying purchase, you will receive an email with your membership account number. You are solely responsible for protecting your membership number and not sharing your membership number with anyone else. HOW TO QUALIFY Every Club Champion customer who purchases $1,500 or more within the calendar year qualifies for the program. Re-qualification takes place with every $1,500 in qualifying purchases. Upon requalification, TrackMan and fitting benefits reset (do not stack. Calculations are based upon pre-tax dollars spent at checkout. Dollars cannot be earned on purchases made prior to October 1, 2023. Non-qualifying purchases include returned merchandise, refunds, and gift cards. Only one membership account number may be used in connection with a purchase. Dollars will only post to one Club Champion P.A.R. program account per person. GENERAL TERMS Membership account number has no cash value and is non-transferable. Club Champion is not responsible for communication errors, including distribution of and notification of dollars spent due to a change of email address or email deliverability. Unused benefits do not roll over in the event of requalification. Other restrictions or exclusions may apply. MEMBERSHIP CANCELLATION, MODIFICATION, EXPIRATION AND TERMINATION You may cancel your membership at any time by contacting Club Champion’s Customer Service by mail, email or telephone. Club Champion will in its sole discretion, terminate your account on or after the last day of the of your membership period if you have not completed additional qualifying purchases to extend. In all matters relating to the administration of the Club Champion P.A.R. program, the decisions of Club Champion shall be final. Club Champion reserves the right to cancel, amend or revoke any program, including, without limitation, the P.A.R. program, at any time due to reasonable business consideration or circumstances beyond its control or as required by applicable law. In addition, Club Champion reserves the right to terminate your P.A.R. membership and void any balance accumulated in such account(s), if you, in Club Champion’s sole discretion, violate any of these terms and conditions or any applicable law, via deception, forgery, fraud, or commit any other abuse of the P.A.R. program. HOW TO CONTACT THE CLUB CHAMPION P.A.R. PROGRAM Official terms for this program can be found at: ClubChampion.com/rewards. For information about your account or to update your account information, or to schedule reward services contact Club Champion’s Customer Service. Please have your membership number with you when contacting Customer Service. Customer service hours are 8 am - 6 pm Central Standard Time, Monday – Friday. You can contact us by mail at: Club Champion, 7501 S. Quincy Street, suite 130, Willowbrook, IL 60527 or by email: This email address is being protected from spambots. You need JavaScript enabled to view it. . By phone: (888) 340-7820. × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input State Please select a state. Alabama Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Idaho Illinois Indianapolis Iowa Kansas Kentucky Louisiana Maryland Massachusetts Michigan Minnesota Mississippi Missouri Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina Tennessee Texas Utah Virginia Washington Wisconsin Invalid Input Store Please select a store. Huntsville Montgomery Mountain Brook Invalid Input Store Please select a store. Scottsdale Tucson Invalid Input Store Please select a store. Little Rock Invalid Input Store Please select a store. Agoura Hills Corona Del Mar Newport Beach Palm Desert Pleasanton Roseville San Carlos San Jose Santa Monica Torrance Invalid Input Store Please select a store. Colorado Springs Highlands Ranch Westminster Invalid Input Store Please select a store. Hartford Westport Invalid Input Store Please select a store. Christiana Invalid Input Store Please select a store. Bradenton Brandon Delray Beach Destin Fort Myers Jacksonville Jupiter Miami Naples Orlando Sanford The Villages Invalid Input Store Please select a store. Buford Peachtree City Sandy Springs Invalid Input Store Please select a store. Meridian Invalid Input Store Please select a store. Chicago Deerfield Schaumburg Willowbrook Invalid Input Store Please select a store. Indianapolis Invalid Input Store Please select a store. Des Moines Invalid Input Store Please select a store. Overland Park Invalid Input Store Please select a store. Louisville Invalid Input Store Please select a store. Mandeville Metairie Invalid Input Store Please select a store. Frederick Owings Mills Rockville Invalid Input Store Please select a store. Bedford Needham Northborough Invalid Input Store Please select a store. Ann Arbor Grand Rapids Royal Oak Invalid Input Store Please select a store. Edina Invalid Input Store Please select a store. Ridgeland Invalid Input Store Please select a store. Creve Coeur Invalid Input Store Please select a store. Omaha Invalid Input Store Please select a store. Las Vegas Invalid Input Store Please select a store. Cherry Hill Hackensack Livingston Princeton West Long Branch Invalid Input Store Please select a store. Albuquerque Invalid Input Store Please select a store. Manhattan Syosset Victor White Plains Williamsville Invalid Input Store Please select a store. Cary Charlotte Wilmington Winston Salem Invalid Input Store Please select a store. Cincinnati Columbus Warrensville Heights Westlake Invalid Input Store Please select a store. Oklahoma City Invalid Input Store Please select a store. Tigard Invalid Input Store Please select a store. Center Valley Pittsburgh Wayne Invalid Input Store Please select a store. Warwick Invalid Input Store Please select a store. Bluffton Columbia Greenville Mount Pleasant Myrtle Beach Invalid Input Store Please select a store. Farragut Franklin Memphis Invalid Input Store Please select a store. Austin Dallas Fort Worth Houston Kingwood Midland Plano San Antonio Shenandoah Southlake Invalid Input Store Please select a store. Salt Lake City Invalid Input Store Please select a store. Ashburn Charlottesville Fairfax Fredericksburg Richmond Virginia Beach Invalid Input Store Please select a store. Bellevue Tacoma Invalid Input Store Please select a store. Brookfield Madison Invalid Input SCHEDULE NOW × × WIN A FULL BAG FITTING WITH PAIGE Terms and conditions: See full terms and conditions . Winners must be 18 years or older and reside in the United States. Winners must provide their own transport, room and board, golf equipment, and any other requirement to participate in the content. Content capture will take place at Club Champion Manhattan, 220 E 42nd St Ground Floor, New York, NY 10017. By accepting the prize, winners agree to be filmed – name, image, and likeness will be used on Paige Spiranac's YouTube channel. Winner holds harmless Paige Spiranac, Club Champion, and all subsidiaries. Winner must be able to physically perform the actions required of a golf club fitting. × × $50 DRIVER, WEDGE, OR PUTTER FITTINGS WITH CUSTOM CLUB PURCHASE TERMS AND CONDITIONS: Get a Club Champion full bag fitting for $100 with a custom equipment purchase OR any other fitting type for $50 with a custom equipment purchase when you book and complete your fitting by 9/30/25. Promo code provided must be used at time of booking. Equipment purchase must be made at the time of the fitting for discount to apply. Applicable at Club Champion US stores only. Clubs built by Original Equipment Manufacturer (OEM) do not qualify for promotional fit fee. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × \"I did a full bag fitting with Adam over the winter, and WOW was I blown away! I'll share a bit of my experience here: I originally went to Club Champion because they have access to more exotic shaft options on hand, in particular for my driver. After doing my research, I narrowed down what I wanted to two different shafts. At my fitting, I was able to swing both of those, and they just weren't getting the results I wanted. Adam had me try a couple other options that I hadn't considered, and I was astounded by the results. Within 20 minutes, Adam had me dialed in to a new shaft that increased my ball speed, reduced spin, and increased the total distance of my driver by 23 yards . INCREDIBLE! After getting fit for the driver, we went through the rest of the bag; hybrid, irons, wedges, and putter. Adam had a no-pressure sales style, even at one time saying that I'd be a fool to replace the wedges I'm currently hitting, since the data showed he couldn't fit me into anything better. He didn't have any bias towards certain brands. He just wanted whatever works best for my swing. I appreciate that he's all about data and results, and not just trying to sell me as much as possible. Fast forward to this summer: I've had by far the best season of golf of my life, mostly because of my increased accuracy and length off the tee with my new driver and hybrid. Par 5s have started to surrender eagles and birdies more frequently, and I have much shorter approaches coming into the greens than I ever have. I was already a golf junkie beforehand, but my enjoyment for the game has been elevated to a whole new level this year. If you're serious about improving your game, don't spare the expense. There is so much more that goes into selecting a club than just picking a regular/stiff flex shaft. Unlike some of the other places you can go, these guys know what they're doing and are going to get you exactly what you need.\" — Jonny J. | Edina, MN × × \"Really pleased with my Club Champion fitting. Wasn't quite sure what to expect, my prior fittings (if you want to call it that) in a golf shop bay were based on a handful of demo clubs they had available to test. Stock items only, no selection or ability to try different shafts, etc. Now Club Champion is a whole different story. Racks and racks of shafts and clubheads...which actually was a bit daunting at first. Then met with Rich, a Master Fitter & Club Builder. He put me through the paces with my own clubs to establish a baseline and actually \"watch\" my swing. Then the tweaking began with different clubheads from different manufacturers and shaft combinations, with him picking up the nuances of my swing and finding the best combos. He could tell when I had a great shot as soon the ball left the clubhead, while we waited for the TrackMan to catch up and confirm just how great it was. I was impressed. I'm 69 years old, my mobility is not what it used to be, and I've been losing distance at a frustrating rate. BUT, I have to tell you after we were done, I was hitting the irons 20-30 yards further (with a slight draw, no less) than when I walked in the door. Amazing! Then on to the driver. We tried a few combos and came to the conclusion that I was hitting my existing driver pretty good as is. That in itself sold me on Rich as a club fitter and Club Champion as a company. Rich took the time, answered all my questions and had answers that I didn't even know the questions to ask. No pressure.\" — BG | Del Mar, CA × × \"This was the first time I'd had a club fitting. I've not had the opportunity to play that often, but retirement is just around the corner and I want to get back into the swing of golf. Taylor was the best! He was extremely knowledgeable about the right club type, weight, and length to match my swing . I saw firsthand through the advanced technology the difference a club change made. Taylor helped me with a full bag fitting. He did not try to push me into a club I did not need but truly focused on an actual reduction in club count. Can't wait to use my new clubs in the weeks ahead. I would highly recommend Club Champion and Taylor to a club fitting to get the best out of your game.\" — Dave W. | Charlotte, NC × × COMPLIMENTARY Get a Club Champion full bag fitting $100 off with an equipment purchase when you book and complete your fitting by 7/31/24. Promo code provided must be used at time of booking. Applicable at Club Champion stores only. Exclusions apply; golf balls are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be complete × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Please select a store. Dallas Fort Worth Plano Southlake Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Please select a store. Pleasanton San Carlos San Jose Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Please select a store. Fort Myers Marco Island Naples Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Please select a store. Huntsville Montgomery Mountain Brook Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Please select a store. Edina Woodbury Invalid Input SCHEDULE NOW × × TERMS Get a Club Champion full bag fitting for $100 with an equipment purchase OR any other fitting type for $50 with an equipment purchase when you book your fitting by 12/31/24. Promo code provided must be used at time of booking. Equipment purchase must be made the same day as the fitting for discount to apply. Applicable at Club Champion stores only. Exclusions apply; golf balls and grips are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input Store Mount Pleasant Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input State Please select a state. Delaware Illinois New Jersey Pennsylvania Invalid Input Store Please select a store. Christiana Invalid Input Store Please select a store. Chicago Deerfield Schaumburg Willowbrook Invalid Input Store Please select a store. Cherry Hill Princeton Invalid Input Store Please select a store. Center Valley Wayne Invalid Input SCHEDULE NOW × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" Zip Code Invalid Input State Please select a state. Alabama Arizona California Florida Illinois Maine Maryland Massachusetts Minnesota Mississippi Missouri Nevada New Hampshire New Jersey New York North Carolina Ohio Pennsylvania South Carolina Tennessee Texas Utah Vermont Virginia Wisconsin Invalid Input Store Please select a store. Montgomery Invalid Input Store Please select a store. Chandler Scottsdale Invalid Input Store Please select a store. Agoura Hills Roseville San Carlos Invalid Input Store Please select a store. Coral Springs Delray Beach Fort Myers Marco Island Naples Orlando Reunion The Villages Invalid Input Store Please select a store. Chicago Willowbrook Invalid Input Store Please select a store. Westbrook Invalid Input Store Please select a store. Frederick Invalid Input Store Please select a store. Hanover Northborough Invalid Input Store Please select a store. Woodbury Invalid Input Store Please select a store. Creve Coeur Lake St. Louis Invalid Input Store Please select a store. Ridgeland Invalid Input Store Please select a store. Asheville Cary Durham Invalid Input Store Please select a store. Portsmouth Invalid Input Store Please select a store. Hackensack Invalid Input Store Please select a store. Reno Invalid Input Store Please select a store. Albany Manhattan Syosset Invalid Input Store Please select a store. Perrysburg Westlake Invalid Input Store Please select a store. Center Valley Invalid Input Store Please select a store. Greenville Invalid Input Store Please select a store. Farragut Franklin Invalid Input Store Please select a store. Fort Worth Kingwood Midland Plano Southlake Sugar Land Invalid Input Store Please select a store. Salt Lake City Invalid Input Store Please select a store. Williston Invalid Input Store Please select a store. Fredericksburg Invalid Input Store Please select a store. Brookfield Madison Invalid Input SCHEDULE NOW × × NEXT ROUND TRADE IN TERMS AND CONDITIONS:Next Round trade in only available at Club Champion studios in the USA. You must have a Club Champion fitting appointment scheduled for July 1 - 31, 2025 and you must complete the trade in process at that appointment. All trade-ins are paid via Club Champion credit; credit must be applied to Club Champion order. No cash will be given in exchange for trade ins at Club Champion; no store credit will be given for future use. A Club Champion employee will assess your clubs via Next Round's guidelines and issue both the value of the clubs and a 25% bonus on top of the value as a credit on your order. You do not need to surrender your assessed clubs until you take delivery of your new clubs from Club Champion. If the assessed clubs are not provided, the full balance of your purchase will be charged to the payment method on file. A Next Round representative will verify that the provided clubs match the quote. If there are discrepancies, the trade-in amount may be adjusted accordingly. Once clubs are provided, the transaction is finalized, and store credit is issued, items cannot be returned. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × PARTNERSHIP TERMS AND CONDITIONS *All partners, regardless of past performance, start at “Partner Level” in 2023 and must qualify for higher levels. My partnership may not be renewed in 2025 if my account does not refer at least $5,000 for the full year (or a prorated amount from my 2024 signing date) but I will not be charged if I do not reach this minimum. If my account is not tagged to a client before an appointment, I may not be granted a commission. An individual sale’s commission percentage will be lowered if a junior/military/repeat discount is applied, or a non-Mill River discount is granted over 5%. The benefit package can change at any time at the discretion of Club Champion with written notice. Revenue Share: Qualifying Referrals – Referral commissions are only granted for referrals that come after partnership signing. A record of referral must exist for payment to be granted. No referral payment will be extended for an existing customer of Club Champion that predates the original partnership. Referrals can be made in three ways: • Partner sets up the appointment for the client using the portal. • Partner shares name of referred client before an appointment takes place. • Client directly references the name of the partner as the referral source when booking or at fitting. Lifetime Commissions – Commissions are paid for the lifetime of every qualifying referral for the life of partnership. Payments encompass the entirety of qualifying sales: shaft, head, grip, PUREing, customization, repairs and fitting fees. Commission percentages are based on level of partner and the amount of discount applied. All commission payments are made monthly to the partner after the purchased product is built and shipped in full. Mill River/Facility Buying Programs – Club Champion will still provide the normal commission/discounting terms for any club on a Mill River buying program in addition to a 15% client discount on club head sales UNLESS it is a stock order. If a Mill River discount is offered on a stock order, no commission will be given. Military/Junior/Repeat Discounting – Club Champion will provide a 5% commission on military/junior/repeat discounted sales of 10%. Club Champion will not provide any referral payment for any non-Mill River, military, junior, or repeat discount granted to a customer over 5%. Military: Any order with a Military discount of 5-10% results in a maximum referral payment of 5%. Over 10% results in no payment. Under 5% results in normal payment. Junior: Any order with a Junior discount of 5-10% results in a maximum referral payment of 5%. Over 10% results in no payment. Under 5% results in normal payment. Second Bag: Any order with a Second Set discount of 5-10% results in a maximum referral payment of 5%. Over 10% results in no payment. Under 5% results in normal payment. OEM Orders — Any OEM or direct from manufacturer order will result in no commission payout, however, the order will still count towards a partner's yearend referral total and partner levels. Missed-Payment Window – Partners can qualify to request commission payments if they feel a qualifying referral has been missed. All requests are subject to review and proof of referral must be given by the partner. Commission payments will not be considered without written proof of referral. Personal Benefits: Complimentary Personal Fittings – Amount of access determined by space availability, store manager discretion, and level. Benefit is only applicable for partners and select golf staff. Complimentary PUREing and VIP PUD Pricing – Amount of access determined by level. Benefit is only applicable for partners and select golf staff. Annual Master Staff Gifts – Reserved for partners that reach $50,000+ in referred sales during a calendar year. Gifts are paid out in 2023 and the Master Staff package can vary each year. In 2022, these gifts included a custom built Bettinardi Putter and Headcover created exclusively for Club Champion Master Staff Only. Business Benefits: Complimentary Use of TrackMan Bays for Personal Teaching – Access based on level. Only offered at select stores and is at the discretion of individual store managers. Inquire with a local store for full details and to book. Complimentary Client Fitting Certificates – Client fitting certificates do not accrue. Partners must use given certificates while in each level or lose them. × × Rules - This sweepstakes is hosted by Club Champion — it is not affiliated with any third party. Entries shall be made based on instructions provided; one entry per person. Any attempt to enter more than one may result in disqualification. Winners will be chosen at random and contacted via email. Any winner who does not respond within three (3) business days to accept their prize will forfeit the prize and another winner will be drawn. Prizes are subject to availability and fulfilled at Club Champion's discretion. Prizes may not be substituted, transferred, returned, or redeemed for cash. Club Champion reserves the right to remove or modify this sweepstakes at any time. × × YOU’VE BOOKED YOUR FULL BAG FITTING — NOW WHAT? Take a step-by-step look at what happens in the Club Champion fitting bay. Your fitter will get to know you and your game, along with any goals for your full bag fitting and budget considerations to keep in mind. You’ll stretch and warm up, then hit your existing clubs to set a baseline for the data we’re looking to beat. If you don’t have clubs, we can start out with a quick build from our demo matrix. For full bag fittings, we’ll work with you to pick a part of the bag — woods, irons, wedges — to start with and tackle one section at a time. Once we know what variables — ball speed, spin, launch angle, clubhead speed, distance, etc. — we want to improve, we will start with shaft options. Isolating one component at a time allows your fitter to dial in the basis of your improvement and build upon it as you go. When the best shaft profile and model is identified, your fitter will move on to clubheads and repeat the testing, using that ideal shaft for consistency. Now that you have the perfect shaft and clubhead, your fitter will finalize the details like length, lie, loft, swingweight, and grip choice before moving on to the next part of the bag and starting the process again. Once the full swing clubs are completed, you will then move to the SAM PuttLab putter studio to dial in your putter’s length, loft, toe hang, and more. There is a full bag fitting option without a putter fitting included should you want to skip the flatstick. Once everything is dialed in, you’ll be presented with a customized blueprint for lower scores — a build sheet showing you all the specs for each club, along with an itemized recommendation that lays out costs. After you place your order for a custom build by one of our Master Builders , we’ll keep you updated on your equipment’s progress via email and tell you more about our Perfect Fit Guarantee . × × Free Fitting with Custom Club Purchase Terms: Use the code provided to get a free Club Champion club fitting when you make a custom club purchase. Fittings must be booked by 4/19/25 and completed by 6/30/25. Promo code provided must be used at time of booking. Club purchase must be made the same day as the club fitting for discount to apply. Applicable at United States and Canada Club Champion stores only. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × Terms: Get a Club Champion full bag fitting for $100 with a custom equipment purchase OR any other fitting type for $50 with a custom equipment purchase when you book and complete your fitting by 12/31/25. Promo code provided must be used at time of booking. Equipment purchase must be made at the time of the fitting for discount to apply. Applicable at Club Champion United States stores only. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × Terms: Use the code provided to get a free Club Champion driver fitting. Fittings must be booked by 6/30/25 and completed by 6/30/25. Promo code provided must be used at time of booking. Applicable at United States Club Champion stores only. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × Terms: Use the code provided to get a free Club Champion club fitting when you make a custom club purchase. Fittings must be booked by 6/30/25 and completed by 7/31/25. Promo code provided must be used at time of booking. Club purchase must be made the same day as the club fitting for discount to apply. Offer only applies to bookings impacted by the technical issue on 5/24/25–5/25/25. Applicable at United States Club Champion stores only. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × Please complete all required fields! BOOK A FITTING Full Name Full Name Required (First Name and Last Name) Email Valid Email Required Phone Phone number format Required: \"123-456-7890\" SCHEDULE NOW × × FREE DRIVER OR IRON FITTING WITH CUSTOM CLUB PURCHASE* TERMS AND CONDITIONS: Use promo code provided to get a FREE Club Champion driver OR iron fitting with a custom equipment purchase when you book your fitting by 7/31/2025 and complete your fitting by 8/31/2025. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Offer only valid at US Club Champion stores. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Club purchase must be made the same day as club fitting for discount to apply. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × FREE DRIVER OR IRON FITTING WITH CUSTOM CLUB PURCHASE* TERMS AND CONDITIONS: Use promo code provided to get a FREE Club Champion driver OR iron fitting with a custom equipment purchase when you book your fitting by 8/31/2025 and complete your fitting by 9/15/2025. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Offer only valid at US Club Champion stores. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Club purchase must be made the same day as club fitting for discount to apply. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited. × × FREE DRIVER OR IRON FITTING WITH CUSTOM CLUB PURCHASE* TERMS AND CONDITIONS: Use promo code provided to get a FREE Club Champion driver OR iron fitting with a custom equipment purchase when you book your fitting by 8/31/2025 and complete your fitting by 9/15/2025. Exclusions apply; golf balls, grips, and OEM builds are not considered an equipment purchase. Waitlist appointments are not considered a booking and do not apply; the fitting must be booked and confirmed during the promotional period. Offer only valid at US Club Champion stores. Promotional fittings may be rescheduled no more than one time. Fitting must be completed in one appointment. Club purchase must be made the same day as club fitting for discount to apply. Not valid on prior fittings or purchases. Not valid in conjunction with any other fitting offer or discount. Not valid in conjunction with PAR Program benefits. Club Champion reserves the right to remove or modify this promotion at any time. Appointments are limited."
    }
  ]
}