{
  "fuentes": [
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    },
    {
      "url": "https://landscapedepotinvestments.com/about-us/",
      "email": "info@landscapedepotinvestments.com"
    },
    {
      "url": "https://landscapedepotinvestments.com/about-us/",
      "email": "info@landscapedepotinvestments.com"
    },
    {
      "url": "http://www.depotpark.org/news/2016/7/11/giggle-magazine-article-not-your-typical-park-experience",
      "email": "harveyck@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/news/2016/7/11/giggle-magazine-article-not-your-typical-park-experience",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/contact-us",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/contact-us",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/rentals",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/rentals",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/history/",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "https://www.depotslc.com/plan-your-visit",
      "email": "thedepot@livenation.com"
    },
    {
      "url": "https://www.depotslc.com/plan-your-visit",
      "email": "u003ethedepot@livenation.com"
    },
    {
      "url": "http://www.depotpark.org/sponsors",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "https://theparkpeople.org/Who-We-Are/About-Us",
      "email": "info@theparkpeople.org"
    },
    {
      "url": "http://www.depotpark.org/news",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/news",
      "email": "depotpark@parkrun.com"
    },
    {
      "url": "http://www.depotpark.org/accessibility",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/vendors",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/directions",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "https://www.staygainesville.com/an-urban-oasis-exploring-depot-park-in-gainesville-fl",
      "email": "info@staygainesville.com"
    },
    {
      "url": "http://www.depotpark.org/fieldtrips",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/depot-rules-regs",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "http://www.depotpark.org/depot-rules-regs",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "https://www.loandepot.com/about/leadership",
      "email": "20customercare@loandepot.com"
    },
    {
      "url": "https://www.loandepot.com/about/leadership",
      "email": "22customercare@loandepot.com"
    },
    {
      "url": "https://www.loandepot.com/about/leadership",
      "email": "customercare@loandepot.com"
    },
    {
      "url": "http://www.depotpark.org/",
      "email": "depotpark@cityofgainesville.org"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    }
  ],
  "mails": [
    "20customercare@loandepot.com",
    "22customercare@loandepot.com",
    "anirudh.shetye@skanem.com",
    "app-promo-phones@2x.png",
    "beatrice.malle@skanem.com",
    "customercare@loandepot.com",
    "customerservice@encorepack.com",
    "depotpark@cityofgainesville.org",
    "depotpark@parkrun.com",
    "harveyck@cityofgainesville.org",
    "info.nairobi@skanem.com",
    "info@landscapedepotinvestments.com",
    "info@staygainesville.com",
    "info@theparkpeople.org",
    "jane@skanem.ke",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sales@encorepack.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "thedepot@livenation.com",
    "u003ethedepot@livenation.com"
  ],
  "nombre_sitio": "depotpark.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    },
    {
      "url": "https://landscapedepotinvestments.com/about-us/",
      "text": "About Us - Landscape Depot Investments Skip to content Home About Us About Us Testimonials Careers Buying Buying A Business Buyer Forms Resources Immigration Visa Selling Valuation Business Listings Sold! Blog Faq Contact Search for: Search for: About Us Chad 2021-08-06T16:28:07+00:00 Who We Are Landscape Depot Investments is a brokerage firm specializing in the Acquisitions, Mergers & Sales of companies in the Agricultural and Landscape Industry, unquestionably the dominant leader in the Landscape Industry. We Specialize in the Acquisition and Sales of Landscape Related Companies such as Hardscape Design & Installation Indoor Horticultural Services Irrigation Services Lake Management Landscape & Irrigation Supply Stores Landscape Architectural Firms Landscape Design & Installation Landscape Lighting Landscape Maintenance Landscape Maintenance Accounts-Only Landscape Management Landscape Truck & Trailer Sales Lawn Equipment Sales & Repair Shops Nursery & Tree Farm Pest Control & Fertilization Plant & Tree Nurseries Pool Maintenance Pressure Cleaning Retail Garden Center Sod Installation Synthetic Turf Installation Tree Service What We Do Whether you are ready to buy a business or sell a business in the Landscape Industry, we will be with you throughout the entire process, from initial valuation, through negotiations, and on to final settlement. With years of experience analyzing and managing deals from small owner-operated businesses to large multimillion-dollar businesses, let us put our direct landscape industry and brokerage experience to work for you. Landscape Depot Investments has an active database and active relationships with over 500 qualified buyers including individual buyers, investment partners, same trade business owners, and private equity firms – all of which have a SPECIFIC INTEREST in acquiring business opportunities in the Landscape Industry. In our 15+ years of experience, we have developed considerable expertise in bringing together buyers and sellers in a discrete and confidential manner so as not to disrupt the harmony of the company and the flow of business. Interested in buying or selling your business? CONTACT US TODAY! (877) 303-9009 Info@LandscapeDepotInvestments.com MONDAY – FRIDAY, 9:00AM – 5:00PM REQUEST INFORMATION Real Estate/Business Broker : Chad B. Butler Copyright © 2023 Landscape Depot Investments. All Rights Reserved. Subscribe Subscribe to be notified of new blogs coming with great information for you! Name (Required) Email (Required) Phone Number (Required) Gravity Captcha (Required) Go to Top"
    },
    {
      "url": "http://www.depotpark.org/news/2016/7/11/giggle-magazine-article-not-your-typical-park-experience",
      "text": "Giggle Magazine Article: Not Your Typical Park Experience — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home July 11, 2016 BDP CRA Giggle Magazine Article: Not Your Typical Park Experience BDP CRA July 11, 2016 Giggle Magazine Article: Not Your Typical Park Experience BDP CRA July 11, 2016 Not Your Typical Park Experience 32-acre, Family-Friendly Depot Park Opening in Gainesville this Summer! BY CRA PROJECT MANAGERS NATHALIE McCRATE & CINDI HARVEY Photos courtesy of Ben Tobias and City of Gainesville Alachua County parents, brace yourselves for an onslaught of carpool requests and beautiful bluebird days outdoors. In just a few months, toddlers and teenagers alike will be begging you to take them to Downtown Gainesville’s “Central Park.” Listed on the National Register of Historic Places, Depot Park is anchored by a restored, 1860s-era train station that served as Gainesville’s main railroad hub for 60 years. This rustic, railroad theme informs the aesthetic of the whole park — from a towering, weathered steel gateway feature to a football field-sized Adventure Play Area built around a custom splash pad. The $5.9 million park includes: a water’s edge promenade designed to host food truck rallies and festivals; picnic pavilions perfect for birthday parties and barbecue cookouts; and winding trails ideal for birdwatchers and nature lovers. The Adventure Play Area at Depot Park isn’t a “15-minutes-and-the-kids-are-bored-now” playground, either. With a North Florida springs-inspired splash pad — complete with water soakers, ground jets, and waterfalls — many of the play elements draw from Gainesville’s rich ecology and history. Kids can scale a brick smokestack and dangle from utility-inspired climbers that pay tribute to Gainesville’s industrial Power District. A series of domes hints at the traditional dwellings of the area’s Native American Timucuan tribe. Carvings of raccoons, butterflies, mice and other critters are hidden within the oak tree climber for children to discover. Other interactive play features include: a wheelchair-accessible choo-choo train replica; an oak tree climber; a sandpit with hidden fossils; an abandoned stormwater pipe; a rolling hill; dueling slides; and more than a dozen swings. The playground area is safely fenced in to keep children from wandering too far away, so parents can find a comfortable bench and just relax. Clean restrooms are in close proximity to the play area. A parking lot will be built on the east side of the park and more parking spots are available on Southeast 4th Street and along South Main Street. The Cade Museum for Creativity and Invention (which celebrates the invention of Gatorade and entrepreneurship) is on-track to construct a world-class facility on the west side of Depot Park by 2017. Soon, children will be able to exercise their creativity in the labs at the Cade Museum and then play at Depot Park. THINKING GREEN Depot Park marries environmental sustainability with economic development. It has taken more than two decades of partnerships and planning to convert the land from an industrial brownfield site into a flourishing, urban park. The park wraps around a large stormwater pond that collects runoff from Gainesville’s urban core and cleanses it before it flows into Sweetwater Branch Creek and Paynes Prairie. The southern half of Depot Park is a brilliant integration of manmade and natural wetlands. The historic Depot Train Station was restored using certified U.S. Green Building Council Gold LEED standards. Prominent features include original old growth heart pine, energy-efficient lighting and interactive rain barrels that capture rainwater from the roof’s copper gutters. Depot Park is also designed to make it easy for visitors to arrive using eco-friendly modes of transportation, like public transit, walking and bicycling. It’s conveniently located across the street from the Rosa Parks Downtown RTS Station, which receives buses bringing passengers from 19 different bus routes around the city. The popular Gainesville-Hawthorne rail trail feeds cyclists directly into the southern edge of the park. The newly redeveloped Depot Avenue features wide sidewalks, beautiful palm trees and bright lighting, making a nice jog from P.K. Yonge to Depot Park a fun exercise route. Want to learn more about Depot Park’s highly anticipated summer 2016 grand opening? We can’t wait to unveil this landmark destination! Please follow the Gainesville CRA on social media under #DepotPark2016 #GCRA or visit our website at Gainesvillecra.com. Email Depot Park CRA project manager Cindi Harvey at HarveyCK@cityofgainesville.org for more information. Originally published in Giggle’s April/May 2016 Issue Read Article Newer Post Depot Park earns $60,000 Capital City Bank grant for Adventure Play Area Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/contact-us",
      "text": "Contact Us — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Chat Contact Us Contact Us If you have any questions or suggestions about Depot Park, or would like to inquire about rentals, please contact the Depot Park Team by submitting the following form or emailing DepotPark@CityOfGainesville.org For inquires about the Historic Depot Building, please send an email to TheDepotGainesville@gmail.com Name * First Name Last Name Email Address * Phone (###) ### #### Message Please confirm that this is not SPAM * This is not SPAM Thank you!  We will reply to your message as soon as possible during office hours, which are M-F, 8am-5pm. Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/rentals",
      "text": "Rental Requests — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Due to staffing shortages, please be patient as we process applications in the order they are received. Pavilion Rentals Requests must be made at least 7 days in advance. Applications may be submitted up to one year in advance. Please allow 72 hours for a response. Pavilion A & B are available to rent for private events of fewer than 25 people per pavilion. If you wish to accommodate more than 25 people, please rent both Pavilion A & Pavilion B. If your event will be open to the public, please complete a Special Event Application. Both pavilions will be available first-come, first-serve when not rented. Time Blocks Available: 8am-12pm 1pm-5pm Pavilion Rental Fees (per pavilion, per time block): Monday-Thursday  $44.00 rental fee Friday-Sunday $71.75 rental fee 20% non-refundable reservation fee is required to hold dates and will be applied to the balance due. Rental dates/times are not guaranteed until fees are paid in full. Please review our Good Weather Guarantee and Cancellation Request policy prior to submitting your rental request. All rental requests are now submitted using AdobeSign as part of our new touchless rental process. Once you click the link below and complete the request, your must then go to your email to verify the request. Be sure to check your Junk folder. Check our calendar for availability ↓ Pavilion Rental Request Special Events Special Event Rental Applications must be made at least 60 days in advance. Applications may be submitted up to one year in advance. Please allow 72 hours for a response. All special event rental cancellations must be emailed to the Depot Park Office at DepotPark@CityOfGainesville.org and confirm receipt. Please review our Cancellation Request policy prior to submitting your rental request. 30 days or more prior notice of cancellation will receive a full refund of rental fees and full deposit. Between 15 and 29 days prior notice of cancellation will receive 50% refund of rental fees and full deposit. Less than 14 days prior notice of cancellation will receive NO refund of rental fees or deposit. To hold dates/times, a non-refundable reservation fee of 20% is required for all rentals and will be applied to the balance due. Rental dates/times are not guaranteed until fees and deposits are paid in full. All rental requests are now submitted using AdobeSign as part of our new touchless rental process. Once you click the link below and complete the request, your must then go to your email to verify the request. Be sure to check your Junk folder. ↓ Check Our Calendar for availability ↓ Special Event Application Map of Rentable Spaces View fullsize Click image to enlarge map PLEASE NOTE: The Historic Depot Building is privately managed and separate from Depot Park. For rental information regarding The Depot Station, please visit thedepotstation.com or contact thetopsecretevents@gmail.com . Click here for information about renting the Mobile Stage for other venues. Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/history/",
      "text": "History — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home The History of Depot Park Learn History News Sponsors About Depot Park Depot Gallery Welcome to Depot Park, the junction of past and future in downtown Gainesville, Florida. What was once contaminated earth, the residue from the site’s history as a rail yard, is now a blooming field of wildflowers and native plantings lined by decorative tracks that commemorate this former railroad transportation hub. The vision for Depot Park was to create a contemporary public greenspace to serve as Gainesville’s “Central Park”.  To be a signature city park located downtown and provide a space for public outdoor enjoyment unique to the city. How did the evolution happen? The City of Gainesville was awarded a Regional Brownfield Pilot project grant in 1997 by EPA, Region 4.  The brownfield site , located in the vicinity of the former railroad depot on Depot Avenue in downtown Gainesville, consisted of a 32-acre tract of land with several landowners and several former sources of contamination (gas stations, cement plant, other industrial operations, railroad activities, petroleum tank farms, manufactured gas plant [MGP], and potentially others).  The primary contamination source at the site was coal tar residues from the former MGP. Photo Gallery of the Journey In 2000, a remedial action plan (RAP) was developed to remediate the site and Gainesville Regional Utilities (GRU) began “The Big Dig”.  The area remediated was excavated to a depth of 50 feet and over 147,000 tons of contaminated soil was removed. Over 40 million gallons of contaminated water was treated and discharged.  Contaminated soils removed from the site were transported to an approved landfill for disposal. In addition, the city wanted ponds designed for the site to capture and treat stormwater from an 89-acre area in downtown Gainesville. The City of Gainesville Public Works Department developed a basin plan and designed a stormwater treatment system to capture the runoff from 47 acres of downtown and runoff from the remaining 42 acres re-routed from the adjacent Sweetwater Branch Creek.  The design consists of a treatment train approach where stormwater flows through a series of baffle boxes, forebays, wet detention ponds, a braided stream and wetlands. In 2012, the Gainesville Community Redevelopment Agency (CRA) rehabilitated the Historic Depot Building.  Listed on the U.S. National Register of Historic Places, the historic train station is a reminder of the important role this site played in Gainesville’s industrial history.  Following the restoration of the building, the CRA began construction of the park amenities at Depot Park.  Completed in Summer 2016, after years of planning and restoration, Depot Park features a  one of a kind Children's Play Area with a custom splash pad of tumbling waterfalls, water soakers, and ground jets. And a picturesque water’s edge promenade which hosts special events like festivals, 5K runs and performances. The City of Gainesville Parks, Recreation, and Cultural Affairs Department manages Depot Park.  The park is fully staffed and free to the public. Depot Park is wonderful amenity for the residents and visitors of Gainesville, FL.  Depot Park is a place where everyone plays! Thank You A special thank you goes to the individuals and organizations who worked tirelessly to make Depot Park a reality. Contact Us Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "https://www.depotslc.com/plan-your-visit",
      "text": "Plan Your Visit: Parking, Amenities, Policies & FAQs | The Depot Skip to content Shows Plan Your Visit FAQs Private Events Premium Plan Your Visit Parking The Depot is located at 13 N 400 W, Salt Lake City, UT 84101. We recommend parking across the street or in The Gateway underground parking lots. If taking TRAX, please take the Blue Line & get off at the Arena stop. View Map Food & Drinks Enjoy a wide variety of well-known and local beer, wine, spirits, and non-alcoholic beverages. Appetizers and entrees are available for order at both bars. View Menu Amenities Enhance your concert experience with our amenities options. Upstairs suites include a designated cocktail server and some of the best views in the building. Or beat the rush with Fast Lane access, quench your thirst with a bottomless soda, or store your items with Coat Check. View Options Frequently Asked Questions (FAQs) You have questions & we have answers. Allowed & Prohibited Item Policies What am I not allowed to bring to the show? Click here to view Customer Safety information and restricted items. What is your bag policy? The following bag policy is in place: Bags up to 12” x 6” x 12” are allowed in the venue. All bags will be searched prior to entry. Bags that are not clear will be subject to additional search. Are cameras allowed? Professional cameras and/or cameras will detachable lenses are NOT allowed without a valid media pass. Personal point-and-shoot cameras or cellphones are OK. General Policies Is there a Lost and Found? If you lose an item while you are at an event, please click HERE Please allow 24 to 48 hours for the team to look for your item and respond back to you. The venue is not responsible for any lost, stolen, or damaged items. As a courtesy, we hold lost items for 30 days. Do you have coat check? The Depot offers a coat check service inside the lobby for a $5.00 service fee. We are a CASHLESS venue-- all major credit and debit cards are accepted. Can I smoke at The Depot? The Depot is a completely non-smoking venue. Smoking is only allowed in designated outdoor smoking areas. Where is my seat? Most events only offer General Admission standing and seating, which are first-come, first-serve. Please refer to the event page for seating options by event. Do I need an ID to attend an event? A valid ID is required to attend any age restricted events and to consume alcohol. Accepted forms of identification include state-issued ID or Driver’s License, valid non-expired US Government or US Military ID, or an official passport. The Depot has a very strict underage drinking policy that follows state law, and if you do not have acceptable ID that states your age at 21 or older, you will be considered the same as a minor and will not be able to purchase, consume or possess alcohol in the venue. Violators will be removed from the building without warnings and will not be eligible for a refund. What are the age restrictions? Age requirements differ depending on the event. All age requirements are listed on our online event calendar . If no age restriction is listed, the event is all ages. If the event is age-restricted a legal ID is required. Can I rent your venue for a meeting or private event? Yes, you can book our event venue for your next corporate event, private concert, social gathering, wedding, reception, fundraiser and more. For more information, please click here . Can I leave the venue and come back in? In-and-outs are not permitted at our venue. Make sure you don't leave the venue unless you don't plan on coming back! Ticketing Policies What are the box office hours? The box office is open one hour before doors on show days only. Do children need a ticket? All guests ages 3 and older need a ticket for entry. Please provide ear protection for children. I have tickets at will call. When can I pick them up? Will call tickets can only be picked up at the venue Box Office on the night of the event. Acceptable forms of identification include: a valid passport, a valid U.S. driver's license or military identification card with a date of birth and a photo, or an official U.S. state issued identification card. Please note that will call tickets will not be distributed prior to the day of the event. I have tickets at will call and I can’t make it to the show anymore. Can I transfer tickets to my friend? Tickets are not transferable. The original ticket purchaser must go back to the original point of purchase to make the change. If you are a radio contest winner, guest of someone in the band, or a VIP client, please touch base with your original point of contact and they will get in touch with us to make any changes on your behalf. I bought tickets but can’t attend the event; can I get a refund? Unless a show cancels or changes time by more than two hours, refunds are handled on a case-by-case basis. Please contact the point of purchase for inquiries. How can I get a refund for a canceled or rescheduled show? If you’re looking to obtain a refund for a show that was either canceled or rescheduled, visit www.livenation.com/refund for more information. If you purchased tickets at the box office, please email us at TheDepot@LiveNation.com . Accessibility Policies What accommodations exist for guests with disabilities? The Depot strives to make our venue and live experiences inclusive and accessible to everyone. The main entrance to The Depot is fully accessible. Please use the main elevator in the lobby to access the rest of the venue. The accessible restroom is located on the third floor and also has a lift for use. While our venue is standing-room only, we do have an ADA section for qualified patrons. We suggest you get to the venue early for the best viewing options in the ADA area. For all of our accessibility information, click here. Do you have an elevator? Yes, we do! Follow Us Be the first to know about live music and specials Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Plan Your Visit Private Events Premium Amenities Accessibility Careers Get in touch The Depot 13 North 400 West Salt Lake City, UT 84101 TheDepot@LiveNation.com 801.456.2802 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "http://www.depotpark.org/sponsors",
      "text": "Sponsors — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Learn History News Sponsors About Depot Park Depot Gallery Thank You Depot Park Sponsors Hey! Did you know... Hidden throughout the Blue Grotto rock sculpture are sea cow ribs (totally real!), whale vertebra (real too!!), megalodon teeth (okay, those are molds of real teeth) and many many more things of the past to discover. These were generously donated by: Depot Park offers many sponsorship opportunities for giving back to the community and becoming a lasting part of this beautiful, historic space.  If you're interested in becoming a Depot Park Sponsor, please contact us. Name * First Name Last Name Email Address * Subject * Sponsor would be Business Individual Organization Message * Thank you! Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "https://theparkpeople.org/Who-We-Are/About-Us",
      "text": "About Us The Park People Search × Search Menu Who We Are About Us Our Staff & Board Sponsors & Partners Contact Us Press Room What We Do Intro Capital Projects Robinson Park Playground Save Our Sundial Denver Digs Trees Tree Sale Tree Planting Guide Tree Care Guide Sign up for a Tree Application Reminder Frequently Asked Questions Mile High Tree Champions TreeForce: Workforce Development Park Legacy Program Gates Tennis Center Community Greening Hub Community Forester Sign up for a Registration Reminder! Inscríbase en Community Forester Community Tree Adoptions Preguntas-frecuentes FAQ for CLG Tree Adoption Community Connectors Community Climate Ambassadors Irrigation Solutions Rainwater Harvesting Solutions City Water & Other Solutions Community Resources Be A Smart Ash Resources for Residents Pruning Project Information Community Greening Projects Get Involved Sign Up For Our Newsletter Volunteer with Us Learn Our Blog Ways to Give Ways to Give Donate Online Wednesday, September 10, 2025 Who We Are About Us About Us The Park People is a private 501(c)(3) nonprofit organization working with communities to plant trees and improve parks for a healthy, resilient future. We are passionate about our local parks, our city trees, and other shared community resources. We believe that healthy parks help grow healthy communities. We believe that our community forest not only makes our neighborhoods beautiful places to live, but provides critical functions to the health, well-being, and sustainability of urban life. And we believe that all Denver residents should have access to these critical urban resources. We work towards our mission by raising private funds for capital improvement projects of various sizes and through several ongoing programs: Denver Digs Trees , Community Forester , Mile High Tree Champions , TreeForce , and Park Legacy . We are Denver's oldest and primary city-wide park advocacy group and longest-standing tree organization. We have infused tens of millions of dollars into the city's public spaces, and we have planted more than 60,000 trees in Denver. Learn more about What We Do . Our History The Park People was created in 1969 by a small group of park enthusiasts who banded together to raise private funds to support Denver's extensive parks and recreation system. We are a separate entity from Denver's Department of Parks and Recreation, but have worked in close partnership with the department since our founding. In our 50+-year history, The Park People has infused many millions of dollars into Denver's parks through the restoration of existing park infrastructure, such as fountains and historic park buildings, and through new construction, such as playgrounds and recreation facilities. Our projects include sites in Denver's highest profile parks like the Washington Park Boat House, Cheesman Park Pavilion, Civic Center Esplanade, and City Park fountains. We also value the city's lesser known community treasures, such as the beloved Sundial & Plaza in Cranmer Park, the historic James Fleming House in Platt Park, and the award-winning Gates Tennis Center in Cherry Creek. And we look for high-need projects, such as playground builds in neighborhoods that lack access to recreation resources. Learn about our Capital Projects . The Park People is best known as the home of Denver Digs Trees , a beloved, city-wide tree distribution program founded in 1991. The program's roots grow from the initiative of a small group of neighbors in West Wash Park who organized around kitchen tables to bring affordable trees to plant throughout their neighborhood in the 1980's. These scrappy neighbors distributed 50 trees out of residents' garages their first year. Their initiative expanded in scope and was adopted by The Park People in response to a city-wide need for affordable trees. Denver Digs Trees has since become a cherished community tradition, known throughout the city as a provider of carefully selected tree species appropriate for our arid climate and urban environment. We are proud to provide affordable trees to residents in all of Denver's neighborhoods and place particular emphasis on distributing trees in under-canopied neighborhoods. Since 1991, Denver Digs Trees has distributed more than 60,000 trees to Denver residents. Learn more about Denver Digs Trees and our other urban forestry programs . Support for The Park People comes from individual donations, program fees, foundation and government grants, and corporate sponsorships. The Park People is managed and executed by a small staff, a dedicated Board of Trustees, and many hundreds of volunteers each year. Find out how you can Get Involved and how you can Contribute . CONTACT US 303.722.6262 info@theparkpeople.org 450 Decatur St. Denver, CO 80204 STAY CONNECTED Login Terms Of Use Privacy Statement Copyright 2025 by The Park People Back To Top"
    },
    {
      "url": "http://www.depotpark.org/news",
      "text": "News — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home News Depot Park February 17, 2022 THE CADE MUSEUM AND DEPOT PARK, THE PERFECTLY INNOVATIVE PAIR Depot Park February 17, 2022 The power of imagination is thriving in Gainesville’s Depot Park and its bright and shiny anchor, the Cade Museum. Read the full article here: https://guidetogreatergainesville.com/cade-museum-at-depot-park/ Source: https://guidetogreatergainesville.com/cade-museum-at-depot-park/ Depot Park May 27, 2021 Depot Park parkrun was one of the events that restarted this weekend  for the first time since COVID-19 hit us last year. Depot Park May 27, 2021 Read the full article here: https://blog.parkrun.com/us/2021/05/27/like-riding-a-bike/ Depot Park February 26, 2020 Depot Park Event #74 Depot Park February 26, 2020 What a beautiful morning at Depot Park parkrun, event #74! This week 40 people ran, jogged and walked the course, of whom 5 were first timers and 6 recorded new Personal Bests! We even got to wave and cheer on those running the LifeSouth 5K that came next to us! Congratulations to #parkruntourist Vanessa Clark for reaching her 20 parkrun milestone hailing all the way from Ann Arbor, MI (shoutout to #lillieparkrun)! The event was made possible by 9 volunteers: Dari SMITH • Pat PHILLIPS • Laura ELENA • Sergio QUINTANA • Rebecca NYROS • Brianna NYROS • Choeeta CHAKRABARTI • Phillip BRATANATAWIRA, Veronica MEDINA Thank you all, you are awesome to give of your time to all of us at parkrun! More pictures will be posted to our Instagram account, follow us @depotparkparkrun ! See you all next week! Depot Park February 8, 2020 Road Closure Update Depot Park February 8, 2020 We are looking forward to seeing everyone tomorrow! We just received this updated information on the road closure by the park: ***Update on SE 4th Street Construction*** Follow the PINK paths to our Overflow Parking lot accessible from 100 SE 10th Ave. We have been granted limited access via the GREEN path only into our smaller parking lot at 874 SE 4th Street. But you must turn left NORTHBOUND when exiting this lot. Southeast Fourth Street will be open NORTHBOUND ONLY from Williston Road to Depot Avenue. All lane and road closures are subject to change due to unforeseen conditions, such as inclement weather. Depot Park February 3, 2020 Depot Park parkrun: Road Closure Depot Park February 3, 2020 ROAD CLOSURE: We all were a bit surprised to arrive for parkrun on Saturday to find the southbound lane closed off SE 4th Street. Below is a map you can use to get to the back of the overflow lot, or to the northbound lane. Depot park parkrun will continue through the road construction! Depot Park February 2, 2020 Depot Park Event #72 Depot Park February 2, 2020 It’s always a great morning at Depot Park parkrun - even if our hands were numb and cheeks were rosy from the cold! Everyone gets cheered on & today Depot Park staff got in on the action, not only cheering but sprinting into the finish with a few participants! You all rock! We had a solid 44 participants come out today, including 9 first timers! We welcomed Danny & Tiffany Donaldson from Belfast, N. Ireland (#waterworksparkrun) and Matthew Bayliss from St. Pete, Fl (#weedonislandparkrun) congratulations to Danny on being our first finisher today! 14 of our participants achieved personal bests today! We had 3 participants achieve milestones: Matthew Bayliss - 20, Natalie Carpenter - 30 & Dari Smith - 40…you’ll be wearing the 50 sash soon!!! We are very grateful to the volunteers who made this event happen: Katherine BAUMANN, Kristen BRYANT, Stewart DUNCAN, Tammy GOMES, Dianna HIGHSMITH, John HIGHSMITH, Veronica MEDINA, Brianna NYROS, Rebecca NYROS, Terry SHEEHAN, Ryder WUBBEL We hope you’ve all had a chance to warm up! We’ll see you next week! Depot Park January 26, 2020 Depot Park Event #71 Depot Park January 26, 2020 We had a clear, crisp and beautiful morning at event #71 in Depot Park! We had 78 participants and 13 first timers! 25 participants achieved their personal bests and one who ran her first 5K! Amazing! Special congratulations go to those parkrun/walkers achieving milestones today: Kristina Garcia - 10, Anne Ray - 20, Raul Gonzalez - 40 & Joan Gonzales with her phenomenal 50!!! (Our first 50!) Huge thanks to our always incredible volunteers: Alison IVEY  •  Amy WEBER  •  Brianna NYROS  •  Marta WAYNE  •  Phillip BRATANATAWIRA  •  Rebecca NYROS  •  Ryder WUBBEL  •  Stewart DUNCAN  •  Tammy GOMES  •  Terry SHEEHAN  •  Veronica MEDINA & Kat HAMPSON for the wonderful photos! It was also great to have the Gainesville Area Rowing team with us again today! Some of you may have seen one of our participants take a bad fall today, we are happy to report that they are okay and on the road to recovery. Thank you for the concern many of you shared. Have a wonderful week! We’ll see you Saturday! Depot Park January 23, 2020 Tall buildings could be in Depot Park's future Depot Park January 23, 2020 https://www.gainesville.com/news/20200123/tall-buildings-could-be-in-depot-parkrsquos-future Depot Park January 19, 2020 Depot Park parkrun #70 Depot Park January 19, 2020 A chill was in the air this morning at Depot Park parkrun #70! The sun came out and we had an absolutely glorious morning! We had 79 participants turn out with 24 first timers and 19 folks achieving personal bests! Asad & Carrie completed 10 parkruns & Terry has completed 40! Congratulations to everyone for these milestones! We were so pleased to meet parkrun tourists Debra & Mitch Giulietti from England (shout out to #kingsburywaterparkrun!) Thank you so much to our many volunteers this morning: Alison IVEY • Amy WEBER • Brittany EVANS • Carl THOMAS • Christian LANDAETA • Jennifer WRIGHTON • Jonathan WRIGHTON • Joseph SMITH • Kristen BRYANT • Ludovica WEAVER • Pamela THOMAS • Ryder WUBBEL • Sara ZLOTNIK • Sukanya MCGRIFF • Thomas STORY • Veronica MEDINA We simply would not be at our best without you supporting us! And, thank you Thomas for the awesome photos! We had quite a few folks listed as unknown because they forgot their barcode today. Please remember #DFYB (Don’t forget your barcode!) Best wishes to those heading out to local races tomorrow and next weekend! We can’t wait to hear how you all did! See you next week! Depot Park January 12, 2020 Depot Park parkrun #69 Depot Park January 12, 2020 Depot Park parkrun enjoyed a beautiful morning for event #69, albeit a bit warm for this time of year. A total of 87 participants showed up and completed their free, timed 5K! In that number we had 16 folks finish with Personal Bests and 19 first timers! Several first timers said their new year’s resolution brought them to parkrun today, many said the fun and wonderful community helped them decide to come back next week! No one reached a milestone today, but a handful are so close! We had 2 parkrun tourists, welcome Roger from the new Atlanta parkrun, Northside Beltway and first timer Christian from France, who is heading back to check out parkrun there! It’s always nice to have Gainesville Area Rowing team join us, and helps us push a little harder to keep up! What a crew of volunteers we had today! Thank you to everyone who handled a larger parkrun for us like champs. Brittany EVANS  •  Dari SMITH  •  Hugo MOON  •  Joan GONZALEZ  •  Joshua CROSBY  •  Kristen BRYANT  •  Laura ELENA  •  Phillip BRATANATAWIRA  •  Ryder WUBBEL  •  Sergio QUINTANA  •  Sukanya MCGRIFF  •  Veronica MEDINA It also should be said that we did NOT have to enforce the no barcode no time rule because everyone had brought them! Well done! Keep up the good work & see you next parkrunday! Depot Park January 8, 2020 Depot Park parkrun #68 Depot Park January 8, 2020 Our parkrun participants did not let the wet conditions get in the way of starting their Saturday the best way - at Depot Park #parkrun #68!!! 37 people participated, including 8 first timers (well done!), 3 folks received personal bests (can’t wait to see what they can do in fair weather!) - Peter & Shauna ran their 20th parkrun and Veronica tailwalked her way to her 10th parkrun! Great job everyone! Our volunteers get special kudos today for supporting us all in the bad weather. You all rock! Thank you Amy, Brittany, Joan, Joshua, Katie, Kristen, Marcia, Phillip, Rebecca & Veronica! Need to waterproof your barcode? Try using packing tape or even a snack baggie. Remember, strict no barcode no time rule is in effect! Huge thank you to Shauna for everything she has done in establishing and growing #DepotParkparkrun! We wish you all the best on your new chapter! We will miss you and hope you can come back to visit soon! #parkrunusa #loveparkrun Depot Park December 31, 2019 Depot Park parkrun: Happy New Year and more... Depot Park December 31, 2019 Happy New Year from all of us at Depot Park parkrun!! Join us in our special New Year’s Day parkrun at 10 am tomorrow. A great way to start your new year and perhaps a resolution to do a 5k every Saturday!! Set goals, achieve results and repeat. :D For the past 15 months we, as a community, have worked hard together to grow and share this wonderful weekly event with our friends, family, tourists, volunteers and all who come out on a Saturday morning to exercise. My wish for 2020 is that it continues to grow and makes its mark in Gainesville as a consistent venue for people of all ages and abilities to have the opportunity to do a free, timed 5k each weekend, make new friends and meet tourists from all over the world who frequently join us. As Event Director and founder of your parkrun, I wanted to use this platform to let you know that the new year will be bringing many changes for me personally, one of them being an amazing opportunity to pursue a new career out west. With this comes the reality that I will be leaving Depot Park parkrun, but with every intention of starting another one, should I be lucky enough to find a location as perfect as the one we have here in Gainesville. You are in good hands with Kristen Bryant, who has served as the CO-ED for months already. She is every bit as passionate about parkrun as I am. Please reach out to her and lend a helping hand whenever you can. Without our volunteers (you), we could not have parkrun, and I would never have had the pleasure of meeting you and all of the wonderful people who have made Saturday mornings extra special week after week because of parkrun. I am full of parkrun pride as I wish you a very happy and healthy new year and lots of parkrunning/walking in 2020 and beyond. Fondest Regards, Shauna Dixon Depot Park December 26, 2019 Depot Park parkun: New Year's Day parkrun & double! (10:00am) Depot Park December 26, 2019 Happy Holidays!! The New Year will be kicking off to a great start with the first parkrun of 2020 at Depot Park at 10am on the 1st of January. Bring your friends, family and BARCODE! All ages and abilities welcome. If you would like a challenge to begin your 2020, join us in the parkrun Double event, starting with Clermont parkrun at 7:30am and then making our way back to Gainesville in time to participate in our Depot Park parkrun beginning at 10am. If you would like to volunteer at the 10am parkrun or any future parkruns please email us at depotpark@parkrun.com As our parkrun is growing and becoming a staple in our community we ask that you please bring your Barcode each time you participate, insuring that we get your time and place recorded for you. Keep it in your car, purse, or wallet so it is always there when you need it. Barcodes should be laminated for protection or may be purchased in many different forms, ie. wristbands, key ring tags etc. on the parkrun.us website under the ‘shop’ tab or shop.parkrun.org.uk Wishing you a happy and safe holiday season and looking forward to seeing you at parkrun!! Depot Park November 21, 2019 Standing in solidarity: Community holds vigil for Transgender Day of Remembrance Depot Park November 21, 2019 https://www.alligator.org/news/standing-in-solidarity-community-holds-vigil-for-transgender-day-of/article_8e00bf2c-0cba-11ea-ac8a-bb24a8b0dc3b.html Depot Park November 16, 2019 Depot Park parkrun: New Year's Day Double!!! Depot Park November 16, 2019 Continuing our parkrun New Year’s Day tradition, we will be partnering with Clermont parkrun to complete two parkruns on New Year’s Day. Clermont will start at 7:30 am and Depot Park will start at 10:00 am. Several Depot Park participants will be driving down early to Clermont. Email depotpark@parkrun.com if you are interested in carpooling, completing and repeating! Clermont participants will caravan back with us to do Depot Park parkrun, completing our New Year’s Day double. Join us for the New Year’s Day double! Depot Park November 3, 2019 History Hunt celebrates 150 years of Gainesville figures, events Depot Park November 3, 2019 https://www.gainesville.com/news/20191103/history-hunt-celebrates-150-years-of-gainesville-figures-events Depot Park October 20, 2019 Gainesville rocks and rolls at Tom Petty Birthday Bash Depot Park October 20, 2019 https://www.alligator.org/the_avenue/gainesville-rocks-and-rolls-at-tom-petty-birthday-bash/article_60e45026-f3b5-11e9-979f-f380b5a49cd2.html Depot Park September 22, 2019 Runners find a colorful way to raise opioid abuse awareness Depot Park September 22, 2019 https://www.wcjb.com/content/news/Runners-find-a-colorful-way-to-raise-opioid-abuse-awareness-561065991.html Depot Park September 21, 2019 International food, art and culture at Depot Park Saturday Depot Park September 21, 2019 https://www.gainesville.com/news/20190921/international-food-art-and-culture-at-depot-park-saturday Depot Park March 23, 2019 Depot Park parkrun: Event Cancelation, March 23, 2019 Depot Park March 23, 2019 Due to another running event utilizing the park, we will not host a parkrun that day. Older Posts Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/accessibility",
      "text": "Accessibility — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Depot Park's Accessible Design Depot Park was designed and constructed with ADA compliance top-of-mind.  All hardscaped paths in Depot Park meet ADA compliance standards.  All gravel pathways in Depot Park are designed and constructed utilizing an ADA compliant material called gravelpave; a material that has been successfully utilized in other  places like the Pentagon Memorial in Arlington, VA and the National Garden in Washington, D.C. The play area in Depot Park, including the splash pad (which we call the Blue Grotto), meets ADA compliant standards as well.  Depot Park also has ADA compliant picnic tables under each of the pavilions as well as ADA compliant picnic tables in the park. There are ADA parking spots available in both lots located in the park and identified on the parking map on this page. There is one area of the park, however, where ADA accessibility is limited: The Hill .  This portion of the park was intended to be built out in a future phase of construction.  The City is still determining the future plans for that space.  In the interim, the Depot Park team is working to identify ways to temporarily resolve the limited accessibility in that area of the park so every guest in Depot Park can enjoy events and programs on this space. If you will be visiting Depot Park and would like assistance of a Park Ambassador, please contact the Depot Park Visitor Center during office hours (M-F, 8am-5pm) and we will gladly coordinate your visit. Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services. Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/vendors",
      "text": "Vendor Application — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Become a Depot Park Vendor Do you want to join the rotation of food and drink vendors that pop up in Depot Park? Here are the details: Food and non-alcoholic drink sales only. Alcohol sales are not permitted in Depot Park. Electric connections available for 120v, 30amp, and 50 amp. No generators. Prearranged load-in and load-out times must be honored due to staff availability: Load-in times are flexible, as early as 7:30am Load-out times are flexible, but no later than 8:30pm Vendors must complete the Depot Park Vendor Agreement and submit all required documents a minimum of seven business days in advance of attendance. $75 non-refundable vendor fee, per day. $95 Special Event vendor fee, per day. Vendor fees must be pre-paid a minimum of 7 business days in advance of attendance to allow for staff scheduling. No refunds, rainchecks, or credits. By booking 7 days out, you have plenty of time to check the weather and make an informed decision. Vendor spots will be assigned first-come, first-serve at the time of payment. When you are ready to reserve dates by processing payment, please email depotpark@cityofgainesville.org If we have special events renting the park we may or may not be able to double book. We will do our best to accommodate everyone. If you have more than one electric option or more than one truck/setup, please indicate at time of payment which outlet you will be using. Vendors must follow the Gainesville Zero Waste Initiative Food trucks are booked up to 60 days in advance. Food truck bookings can be found on our Events Calendar We look forward to working with you to showcase your business in Depot Park! Vendor Application Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/directions",
      "text": "Directions & Parking — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather When & Where: Children’s play area: 7am to Sunset Conservation area: 7am to Sunset Lit areas in the park: 7am to 11:30 pm 874 SE 4th Street Gainesville, FL 32601 Visitor Center: Monday - Friday, 8:00 a.m. to 5:00 p.m. 100 S.E. 10th Avenue Gainesville, FL 32601 Parking Options: In addition to Depot Park's main parking lot and Overflow parking, street parking is available in the areas indicated in pink below.  After hours and on weekends, the GRU lot is available for use. Parking at the Cade Museum is for museum patrons only. Large vehicles and RV’s are encouraged to park on SE 5th Ave. No overnight parking or camping is allowed. See the Park Map View fullsize Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "https://www.staygainesville.com/an-urban-oasis-exploring-depot-park-in-gainesville-fl",
      "text": "An Urban Oasis: Exploring Depot Park in Gainesville, FL HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS Book Now Get in touch (352) 519-3994 info@staygainesville.com HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS An Urban Oasis: Exploring Depot Park in Gainesville, FL An Urban Oasis: Exploring the Delights of Depot Park in Gainesville, FL The StayGainesville Connection: Depot Park is home to The Cade Museum , with which StayGainesville's Susannah Peddie was actively involved as a board member and volunteer for many years. Susannah saw the park transform from a federal Superfund site to a beautiful oasis. Susannah and her family often walk to Depot Park for an afternoon to fly kites, walk around on the beautiful trails, and eat a meal at one of the food trucks. Susannah lives in the historic downtown Duckpond, which is very close to Depot Park. Nestled amidst the bustling streets of Gainesville, Florida, lies a vibrant green haven – Depot Park ( http://www.depotpark.org/information ), a 13-acre urban oasis that offers a refreshing escape from the city's energy.  This beloved park caters to a variety of interests, providing a space for relaxation, recreation, and connection with nature.  Whether you're seeking a peaceful afternoon stroll or a community event under the Florida sunshine, Depot Park has something for everyone. A Storied Past: The History of Depot Park Depot Park's story stretches back to the late 19th century when it served as a vital transportation hub.  The park's namesake, the Seaboard Coast Line Railroad Depot, once stood on the site, bustling with activity as passengers and freight arrived and departed.  As Gainesville transitioned from a railroad town to a thriving university city, the depot's role diminished.  In 1967, the city acquired the land and many years later embarked on a transformation in creating a park that would serve the needs of the growing community. A Landscape of Leisure: Unveiling the Park's Offerings Depot Park's sprawling green space offers a variety of ways to unwind and connect with nature: Tranquil Trails: Meandering walking paths weave through the park, inviting visitors to enjoy a leisurely stroll beneath the shade of towering trees. These paths are perfect for a quiet escape from the city's hustle and bustle, allowing you to reconnect with nature and immerse yourself in the park's peaceful atmosphere. Lush Lawns: Expansive stretches of green lawns provide ample space for picnicking, playing frisbee, or simply relaxing and enjoying the Florida sunshine. Whether you're seeking a solo retreat with a good book or a fun-filled afternoon with friends and family, Depot Park's lawns offer the perfect setting. A Haven for Recreation: Activities for Every Interest Beyond relaxation, Depot Park offers a variety of recreational activities to keep you entertained: Playground Paradise: A dedicated playground area provides a haven for children to unleash their energy. Swings, slides, climbing structures, and other equipment offer endless opportunities for imaginative play and physical activity. Depot Park transcends the boundaries of a traditional park, transforming into a vibrant community hub: Thriving Events Calendar: Throughout the year, Depot Park hosts a variety of events that cater to diverse interests. From farmers markets overflowing with fresh produce to lively music festivals and cultural celebrations, the park offers a platform for community gathering and shared experiences. Check the park's website for upcoming events. ( http://www.depotpark.org/information ) A Green Gateway: Exploring Beyond Depot Park Depot Park's convenient location allows you to extend your exploration beyond its borders: Paynes Prairie Preserve State Park: A short drive away lies Paynes Prairie Preserve State Park, a sprawling natural wonderland offering a glimpse of Florida's pre-settlement landscape. Hike through longleaf pine savannas, spot a variety of wildlife including bison and alligators, and immerse yourself in the beauty of this unique ecosystem. Downtown Delights: Depot Park sits at the heart of Gainesville's dynamic downtown district. Explore the area's vibrant shops, sample delectable cuisine at local restaurants, or catch a live performance at a nearby music venue. A Park for All Seasons: Year-Round Activities at Depot Park Depot Park's appeal extends throughout the year, offering unique experiences depending on the season: Springtime Splendor: Spring paints the park in vibrant colors as flowers bloom and trees awaken from their winter slumber. Enjoy a picnic beneath the blossoming trees or participate in a community egg hunt during Easter celebrations. Autumnal Hues: Fall transforms the park with a breathtaking display of changing foliage. Walk along the trails and soak in the vibrant autumn colors, or participate in a fall festival celebrating the season's bounty. Winter Wonderland (Florida Style): While Florida winters are mild, the cooler temperatures offer a welcome respite from the summer heat. Enjoy a brisk walk through the park or participate in a holiday-themed event like a caroling competition or a tree lighting ceremony. Planning Your Visit to Depot Park: Location and Accessibility: Depot Park is conveniently located at 874 SE 4th St, Gainesville, FL 32601. The park is easily accessible by car, bike, or even on foot if you're staying nearby. Ample parking is available around the park's perimeter. Things to Bring: Pack sunscreen, a hat, and comfortable shoes if you plan to spend extended time outdoors. Bring a picnic basket and blanket if you're planning a picnic lunch. Water is essential to stay hydrated, especially during the warmer months. Dog-Friendly Fun: Depot Park welcomes leashed and well-behaved dogs. Designated areas within the park allow your furry friend to run and play freely. Be sure to clean up after your pet to maintain a clean and pleasant environment for everyone. Supporting the Park: Depot Park thrives thanks to the dedication and support of the community. Consider volunteering your time to help maintain the park or donating to support its ongoing programs and events. Depot Park: A Testament to Urban Design Depot Park serves as a testament to the power of well-designed urban green spaces.  It provides a vital oasis within the city limits, offering a place for recreation, relaxation, and community gatherings.  Whether you're a local resident seeking a break from the daily grind or a visitor exploring Gainesville's charm, Depot Park offers a unique and enriching experience for all.  So, on your next trip to Gainesville, be sure to add Depot Park to your itinerary and discover the magic of this vibrant urban oasis. Looking for a place to stay while visiting the local Gainesville attractions? Look no further than Gainesville's locally owned vacation rental company, StayGainesville . Book directly on our site, or call us at 352-519-3994 for guidance. For homes and condos, StayGainesville has many options- large and small/ budget and luxury, and more. For a shorter stay, we have 2 beautiful historic Inns in downtown Gainesville. The Camellia Rose Inn and The Laurel Oak Inn - both have unique personalities and they both feel like a home away from home. < Older Post Newer Post > Satchel’s Pizza: Gainesville's Most Artistic Slice By Susannah Peddie • September 10, 2025 Experience Satchel’s Pizza in Gainesville, FL — iconic pies, funky art, and the legendary van you can dine in. A must-visit blend of food, culture, and fun. Fall is here! 30 Day Calendar (of fun) for Gainesville, FL By Susannah Peddie • September 10, 2025 Discover the best events in Gainesville, High Springs, and Newberry over the next 30 days. Festivals, concerts, football, food, and family fun—plan your trip today! More Posts Gainesville, FL Find Us: Call: (352) 519-3994 Email: info@staygainesville.com We are a short-term property rental company with a deep local presence. We support the Gainesville community in so many ways. We hire locally, we use local vendors, we partner with local businesses, and we love sharing our love of Gainesville with all of our guests. PRIVACY POLICY TERMS & CONDITIONS FOR ALL BOOKINGS © 2025 All Rights Reserved | Stay Gainesville Share by:"
    },
    {
      "url": "http://www.depotpark.org/fieldtrips",
      "text": "Field Trips & Tour Requests — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Field Trips & Tours Want to learn about the of the Conservation Area and our Stormwater Treatment Train? Interested in the “Big Dig” and how Depot Park was constructed? How about a brief history of Gainesville as told through the Children’s Play Area? Just want to schedule a field trip to play in the Children’s Play Area? By completing this Field Trip & Tour Request form, Depot Park staff are able to better prepare, keep you apprised of scheduled maintenance that may conflict, and ensure your visit is as smooth as possible. Here are the details: This form is a request only and requests are not guaranteed. Depot Park Manager reserves the right to refuse requests. Use of electricity, DJs, or amplified sound is prohibited without prior approval. Confetti, glitter, bounce houses, large inflatables, and water balloons are prohibited. The Children’s Play  Area and Blue Grotto Splash Pad are designed for children ages 2-12, children must be accompanied by an adult at all times. Food is not allowed inside the Children’s Play  Area or Blue Grotto Splash Pad. Absolutely no staking in Depot Park. The park is a brownfield site and the ground cannot be penetrated. In lieu of staking,  sandbags,  bricks,  or water jugs are often used. Requests should be submitted at least two weeks in advance. Buses may unload from the ADA lot at 201 SE Depot Ave or the little lot at 874 SE 4th Street. All buses must park in the Overflow Parking lot, parking on the grass or across multiple spaces in the little lot is prohibited. We look forward to making your next visit to Depot Park an educational experience! Request a field trip or Tour Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "http://www.depotpark.org/depot-rules-regs",
      "text": "Rules and FAQs — Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Rules and FAQs Park Hours Children’s play area: 7am to Sunset Conservation area (the south end of the park): 7am to Sunset Lit areas (most of the north side of the park): 7am to 11:30 p.m. NO TRESPASSING AFTER HOURS Office Hours Monday - Friday, 8:00 a.m. to 5:00 p.m. Rules Absolutely no staking in Depot Park. The park is a brownfield site and the ground cannot be penetrated. In lieu of staking, sand bags, bricks, or water jugs are often used. Adults of drinking age may drink alcoholic beverages outside within the Sip & Stroll Areas between 8 a.m. and midnight daily. Please note, glass containers are always prohibited. Open containers are not allowed in public parking lots or garages, even if they are in the Sip & Stroll Areas. S moking is prohibited. Camping or open fires are not allowed at any time. Personal grills are not allowed at Depot Park. Grills are provided at the pavilions and are available for use when the pavilions are not being rented. Activities or events requiring open flames (such as candles - excluding birthday cake candles in a cake) are not permitted in Depot Park unless approved by the Depot Park Manager at least 72 hours in advance. Amplified sound (DJ, bluetooth speakers, etc.) is not permitted in Depot Park unless approved by the Depot Park Manager at least 72 hours in advance. Pets must remain on a physical leash. Do not leave property unattended in the park. Frequently Asked Questions Q: HOW MUCH IS THE ENTRANCE FEE? A: There is no charge! Depot Park is a division of the City of Gainesville Parks, Recreation and Cultural Affairs Department and therefore is a free city park. There are charges for renting spaces , and for some specialty classes that are offered from time to time in the park, such as yoga, or swing dancing lessons. Q: WHAT ARE THE HOURS OF THE SPLASH PAD? A: The Blue Grotto Splash Pad is located inside the Children's Play Area, which hours are 7am to sunset. The Splash Pad operates year round as long as the temperature outside is above 70 degrees and there isn't lighting within 10 miles of the park. Q: CAN I BRING ALCOHOLIC BEVERAGES TO DEPOT PARK? A: Alcohol is not allowed in the park. However, you are allowed to purchase beer and wine in the Depot Building - from the Boxcar Beer & Wine Garden and Pop-a-Top General Store - and consume on their patio. Q: HOW LONG ARE THE TRAILS? A: The outer most trail is a picturesque 0.8-mile loop. Our trail connects to the Gainesville-Hawthorne Rail to Trail. The zero mile marker for the trail is at the intersection of paths near the Pop-a-Top General Store. Q: DO I NEED TO RESERVE A PICNIC TABLE? A: Individual picnic tables that are located throughout the park are available on a first come, first served basis to park users. There are currently 10, four-seater tables throughout the park. Q: CAN I FISH AT DEPOT PARK? A: Fishing is NOT allowed in Depot Park. The ponds are filled with runoff from Downtown Gainesville and are lined with a plastic liner which can easily be damaged by hooks. Q: IS THERE Wi-Fi IN DEPOT PARK? A: Not yet! It's on our wish list. Q: ARE THERE ELECTRICAL OUTLETS AVAILABLE FOR USE? A: Use of electricity in Depot Park has to be approved and coordinated with Depot Park Manager prior to using it. Q: ARE THERE ANY GRILLS AVAILABLE AT THE PARK, OR CAN I BRING MY OWN? A: There are two grills located in both Pavilion A and B. Although, these are only available if the pavilions are not rented, click here to check pavilion availability . Depot Park does not provide a place to dispose of your charcoal, so whatever you bring in, you must also take out. Personal grills are not allowed to be carried into the park. Q: CAN I HIRE A DJ OR BRING SPEAKERS? A: You are not able to have amplified sound without getting special permission from Depot Park Manager prior to your event. Q: CAN I BRING A SHADE TENT OR SHADE UMBRELLA? A: Yes. However, nothing can be staked into the ground because Depot Park is a brownfield site. Please plan to secure your items with weights, sand bags, water containers or bricks. Q: CAN I DECORATE THE PAVILIONS FOR MY EVENT? A: Decorate as much as you would like with festive garland and such, but only attach things by tape to avoid damaging the wood. Glitter and confetti are not permitted in Depot Park. Q: CAN I RENT A BOUNCE HOUSE, OR INFLATABLE TO BE SET UP AT THE PARK? A: No. Large inflatables, such as a bounce house, are not permitted in Depot Park. Q: HOW DO I GO ABOUT HOLDING AN EVENT AT DEPOT PARK? A: To rent a space in Depot Park, click here . To rent a space in the Historic Depot Building, click here . And to rent a space inside the Cade Museum, click here . Q: CAN I GET MARRIED IN DEPOT PARK? A: Yes! The West Overlook is an ideal location in the park to get married. The Pavilions or the Historic Depot Building are great locations for receptions. To rent the West Overlook, the Pavilions, or another space in the park, click here. For rental information on the Depot Event Space, please visit thedepotstation.com or contact thetopsecretevents@gmail.com . Q: WHEN WOULD I NEED TO ACQUIRE A PERMIT? A: You will need to apply for a permit if you are charging admission; selling goods or food; impacting traffic in any way; putting up a tent larger than 10'x10'; playing amplified music; or holding an event with over 50 people. Contact us for for more information. Q: CAN I SELL FOOD OR OTHER PRODUCTS IN THE PARK A: Selling food, drinks, merchandise or services in the park requires special permission and rental of the space. Contact us for for more information. Q: ARE PETS ALLOWED IN DEPOT PARK? A: We love pets. For their safety, pets must remain on a physical leash. There are no off-leash areas. No pets except service animals are allowed in the Children’s Play Area. Q: WHAT IS THE CANCELLATION POLICY FOR PAVILION RENTALS? A: Cancellations must be submitted to the Depot Park Office 72-hours prior to the rental for a full refund of rental fees and deposits. Processing fees are not refundable. If a ‘Rain Out’ is declared by Depot Park Management, and the rented pavilion was not used for at least 2 hours, a request to reschedule may be made at no charge. If the preference is not to reschedule, a refund may be requested for the full rental fee and deposit. Processing fees are not refundable. Q: WHAT IS THE CANCELLATION POLICY FOR SPECIAL EVENTS? A: All cancellations must be emailed to the Depot Park Office at DepotPark@CityOfGainesville.org and confirm receipt. 30 days or more prior notice of cancellation will receive a full refund of rental fees and full deposit Between 15 and 29 days prior notice of cancellation will receive 50% refund of rental fees and full deposit Less than 14 days’ prior notice of cancellation will receive NO refund of rental fees or deposit ADDITIONAL REGULATIONS, LAWS AND ORDINANCES APPLY CITY OF GAINESVILLE CODE OF ORDINANCES APPLY CHAPTER 15-6 NOISE ORDINANCE CHAPTER 18 at WWW.GAINESVILLEFL.GOV If you have any questions or concerns, please contact us . Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "https://www.loandepot.com/about/leadership",
      "text": "loanDepot Leadership | Our Executive Team Click here on LoanDepot Logo will open a new tab Products Find an Expert Home Search Learning Center New & Pending Loans (888) 983-3240 Existing Loans (866) 258-6572 My Account Apply Now Skip to Main Content Skip to Footer menu loanDepot.com home Products Find an Expert Home Search Learning Center New & Pending Loans (888) 983-3240 Existing Loans (866) 258-6572 Apply Now My Account loanDepot Leadership Anthony Hsieh Founder and CEO David Hayes Chief Financial Officer Tom Fiddler President of Retail Lending Dan PeÃ±a President of Partnership Lending Viviana Pitre Managing Director of Mortgage Lending Operations Sean DeJulia Chief Innovation Officer Jeff DerGurahian Chief Investment Officer and Head Economist TJ Freeborn Chief Marketing and Customer Experience Officer Darren Graeler Chief Accounting Officer Melanie Graper Chief Human Resources Officer Joe Grassi Chief Risk Officer Dominick Marchetti Chief Digital Officer Marissa Moore Executive Vice President, Product and Strategy Gregg Smallwood Chief Legal Officer, Corporate Secretary Let's build our future, together We are passionate about helping Americans achieve the dream of homeownership. Join a team where you can make a difference, each and every day. View Current Openings arrow_forward Loan Servicing Have questions about your existing loan? call (866) 258-6572 telephone 866 258-6572 Customer Care Have general questions? mail_outline customercare@loandepot.com mail To customercare@loandepot.com call (888) 337-6888 x 6789 telephone 888 337-6888 x 6789 Weekdays 10:00 am - 9:00 pm (EST) LinkedIn - Instagram - Instagram - LinkedIn - youtube Home Purchase Purchase a New Home Purchase a New Home Home Loan Rates Home Loan Rates Link House Buying Questions House Buying Questions Link How To Buy a House How To Buy a House Link Mortgage Preapproval Mortgage Preapproval Link Home Purchase Calculator Home Purchase Calculator Link About Us Overview Leadership Mission, Vision, and Values Contact Us Careers Opens in a new tab Investor Relations Opens in a new tab Builder Partnership Joint Ventures Home Refinance Home Refinancing Home Refinancing Link Refinance Rates Refinance Rates Link Cash Out Refinance Cash Out Refinance Link Reasons to Refinance Reasons to Refinance Refinance FAQs Refinance FAQs Link Refinance Process Refinance Process Link Refinance Calculator Refinance Calculator Link Help Payment Assistance Payment Assistance Link Vendor Management Vendor Management Link Loan Options Mortgage Types Mortgage Types Link Compare Mortgage Rates Compare Mortgage Rates Link Adjustable Rate Mortgage Adjustable Rate Mortgage Link Fixed Rate Mortgage Fixed Rate Mortgage Link FHA Loan FHA Loan Link Jumbo Loan Jumbo loan link VA Loan VA Loan Link 203k Loan 203k Loan Link Legal Privacy & Security Privacy & Security Link Cookie Policy Cookie Policy Link Cookie Settings Cookie Settings Link Terms of Use Terms of Use Link State Licensing State Licensing Link Lifetime Guarantee Lifetime Guarantee Fair Lending Fair Lending Link Fees Fees Link HOME PURCHASE HOME REFINANCE LOAN OPTIONS LEGAL ABOUT US HELP To view legal disclosures and important notices, please click the following: Lifetime Guarantee Disclaimers Rate Assumptions Accessibility Accessibility Unsubscribe Unsubscribe NMLS#174457 - NMLS Consumer Access | Â©2009-2025 loanDepot.com, LLC all rights reserved"
    },
    {
      "url": "http://www.depotpark.org/",
      "text": "Depot Park Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Rentals Rentals Rental Availability Vendor Application Field Trips & Tour Requests Cancellations Cade Learn History News Sponsors About Depot Park Depot Gallery Chat Contact Us Visit Things to Do Events Calendar Directions & Parking Map of Depot Park Rules and FAQs Accessibility Weather Home Play More! Update 4/23: The Depot Park Splash Pad is Open The splash pad is on 7 days a week, 365 days as year as long as the temperature is above 70 degrees. We do our best to open the play area and splash pad every morning, as close to 7AM as possible. Please be patient with staff. The play area and splash pad close at sunset daily. As a reminder, in order to keep the play area safe and the water clean, food and pets are not allowed in the play area. As a reminder, for your safety as well as staff safety, the play area and splash pad close for 30 minutes when there is lightning within 10 miles of the park. Check our Weather page for the latest alerts. We also have a newly installed lightning detection device. If you hear a 15 second siren, please seek shelter. The all clear alert is 3 short horn blasts, at that time play may resume. Park Hours: Children’s play area: 7 am to Sunset Conservation area: 7 am to Sunset Restrooms: 7 am to 9:00 pm Lit areas in the park: 7 am to 11:30 pm We do our best to open as close to 7 am as possible. Please be patient with the staff. Office Hours: Monday - Friday, 8:00 a.m. to 5:00 p.m. except City Holidays Connect with Depot Park on Instagram and Facebook @Depot.Park and share your fun moments! View fullsize View fullsize View fullsize View fullsize View fullsize Parking & Directions Back to Top Depot Park, 200 Southeast Depot Avenue, Gainesville, FL, 32601, United States depotpark@cityofgainesville.org Depot Park Park Location: 874 SE 4th St., Gainesville, FL, 32601 Visitor Center: 100 S.E. 10th Ave., Gainesville, FL 32601, Monday-Friday, 8am-5pm Things to Do at Depot Park | Rules and Regulations | Rental Information | Directions Persons needing a special accommodation to participate in any proceeding should contact the City of Gainesville Office of Equal Opportunity at 352-334-5051 (voice) or 711 (Florida Relay Service) for TDD/TTY users. Requests must be made at least 48 hours in advance of meetings in order to allow the city time to provide the requested services."
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    }
  ]
}