{
  "fuentes": [
    {
      "url": "https://visitcocoavillage.com/business/dirty-oar-beer-company",
      "email": "paul@dirtyoarbeercompany.com"
    },
    {
      "url": "https://dirtyoarbeercompany.com/contact/",
      "email": "info@dirtyoarbeercompany.com"
    },
    {
      "url": "https://www.floridatoday.com/story/entertainment/dining/apleasantrepast/2017/07/11/dirty-oar-brewery-opens-cocoa-village/468724001/",
      "email": "sleonard@floridatoday.com"
    },
    {
      "url": "https://www.visitspacecoast.com/cocoa/restaurants/dirty-oar-beer-company",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "boyle@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "jc@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "josh@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "mark@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "sundar@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "tom@beerboard.com"
    }
  ],
  "mails": [
    "boyle@beerboard.com",
    "chosen-sprite@2x.png",
    "info@dirtyoarbeercompany.com",
    "jc@beerboard.com",
    "josh@beerboard.com",
    "mark@beerboard.com",
    "paul@dirtyoarbeercompany.com",
    "sleonard@floridatoday.com",
    "sundar@beerboard.com",
    "tom@beerboard.com"
  ],
  "nombre_sitio": "dirtyoarbeercompany.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://visitcocoavillage.com/business/dirty-oar-beer-company",
      "text": "Cocoa Village Florida | Dirty Oar Beer Company View My Itinerary Plan Your Trip Click the heart icon on businesses and activities to build your own itinerary and share with friends! contact | Organization discover free shuttle historic walking tour events art & craft fairs sip & shops book fest small business conference – 2025 halloween golf cart parade cocoa village concours hot cocoa holidays volunteer directory buy a brick Dirty Oar Beer Company 321-301-4306 329 King St, Cocoa, FL, USA Email Us Brewery, tap room & beer garden featuring 22 taps of craft beer. Cider, wine and soda options as well. “Nobody has more fun than us!” Monday CLOSED Tuesday CLOSED Wednesday 4:00 PM – 9:00 PM Thursday 4:00 PM – 9:00 PM Friday 2:00 PM – 10:00 PM Saturday 12:00 PM – 10:00 PM Sunday 12:00 PM – 8:00 PM Visit Website ©2025 Historic Cocoa Village Main Street   | Privacy Policy discover events directory members page organization news submit your event contact ©2025 Historic Cocoa Village Main Street   | Privacy Policy Discover FREE SHUTTLE Historic Walking Tour Events Art & Craft Fairs Sip & Shops Book Fest Small Business Conference – 2025 Halloween Golf Cart Parade Cocoa Village Concours Hot Cocoa Holidays Volunteer Directory Buy a Brick Share Your Itinerary"
    },
    {
      "url": "https://dirtyoarbeercompany.com/contact/",
      "text": "Contact - DIRTY OAR BEER COMPANY Your cart is currently empty! About Events Dungeons and Dragons Night Contact The Brewery Gallery Menu Specials Team Reach Out Get in Touch with Dirty Oar Beer Company: The Ultimate Brewery Experience What type of brews do you serve? We offer a diverse selection for all tastes. Enjoy our unique craft beers, ales, and ciders brewed to perfection. Ideal for a night out or a casual hangout. Do you offer any non-alcoholic options? Our menu includes options for all, including non alcohol drinks. What is the atmosphere like at Dirty Oar Beer Company? Our brewery’s atmosphere is friendly and fun, reflecting our dedication to quality brews and great times. It’s a welcoming space where you’ll feel right at home. Get in Touch with Dirty Oar Beer Company – Contact Us Today! 329 King Street Cocoa, FL 32922 (321) 301-4306 info@dirtyoarbeercompany.com DIRTY OAR BEER COMPANY Instagram Facebook Twitter"
    },
    {
      "url": "https://www.floridatoday.com/story/entertainment/dining/apleasantrepast/2017/07/11/dirty-oar-brewery-opens-cocoa-village/468724001/",
      "text": "Dirty Oar brewery opens in Cocoa Village News Space Sports Opinions Restaurants Advertise Obituaries eNewspaper Legals A PLEASANT REPAST Dirty Oar brewery opens in Cocoa Village Suzy Fleming Leonard Florida Today The Dirty Oar Beer Company has dipped its paddle into the river of brews now flowing into Brevard County. The Cocoa Village establishment brings the Space Coast's brewery count up to 10. While the brewery doesn't yet have any of its own beers on tap, it opened June 30 with 20 craft beers and ciders from across Florida. \"We're in the process of brewing our six core beers,\" said co-owner Paul Hill. Opening a brewery isn't a quick process. Hill and his partners — Chris Hughes, Pat Buonomo and Mark Alderman — signed the lease on the former furniture and appliance store in January 2016. Time Out sports bar coming soon to Cocoa Village Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Hill said he and his partners wanted to be in Cocoa Village, but first they had to find the right place, with enough room for a bar and the brewing operations. The taproom, brewery and beer garden are off King Street (State Road 520). It took almost a year to complete the paperwork, then another six months to renovate the building. The building dates back to the 1930s, said Buonomo. All the plumbing and electrical work had to be replaced, and tanks for brewing had to be installed, as well as a huge cooler to hold the finished beer. The result is a spacious taproom with a long bar and multiple picnic tables, as well as an airy beer garden with more tables out back. The name came from a friend's basement bar back in New York, said Buonomo. But the oar in Dirty Oar also refers to the paddle used to stir the mash during the brewing process. Plus, according to Hughes, it's a name that's easy to spell and easy to remember. Buonomo and Hughes are the brewmasters behind the Dirty Oar. They met at Bugnutty Brewing Company on Merritt Island and realized they were neighbors. Both were home brewers. They decided they wanted to open their own place, so they signed Hill and Alderman on as partners. Buonomo and Hill said they have opened in Cocoa Village at the perfect time. The city just completed a beautification project along Florida Avenue, which makes the far west side of the downtown shopping and entertainment district more attractive. Florida Avenue runs near the Dirty Oar's back door, offering easy access to its beer garden. Along that street, Time Out Sports Bar & Grill is scheduled to open in the next few days, as is Crydermans Barbecue. Maxi-O Home Decor and Artwork has relocated there. These businesses join long-time anchors El Charro Mexican Restaurant to the south and Norman's Raw Bar & Grill to the north. \"There's a lot happening in the Village right now,\" Buonomo said. \"We're happy to be a part of it.\" Their part is brewing local beers, and they plan to have six Dirty Oar brews ready and on tap by August. Featured will be: A Double IPA A Pale Ale A Stout A Chai Latte Brown Ale A Light Alsner (a pilsner beer brewed as an ale) A Hoppy Saison \"Chris and I are both hop heads,\" Buonomo said. \"We like hop-heavy beers.\" Hill and Buonomo said their reception in the Village has been great so far. \"People are wanting to come check us out,\" Buonomo said. \"The biggest complaint is that our beer isn't on yet.\" August — and Dirty Oar's beers — will be here before we know it. The Dirty Oar Beer Company is at 329 King St., Cocoa Village. Call 321-301-4306, or follow the brewery on Facebook . The Dirty Oar taproom is open 4-10 p.m. Thursday, 2 p.m. to midnight Friday, noon to midnight Saturday and noon to 6 p.m. Sunday. Let’s tour Brevard’s breweries Oh, and for those following the Brevard brewery scene, those 10 breweries are: Playalinda Brewing Co. Hardware Store, Titusville Playalinda Brewing Co. The Brix Project, Titusville Florida Beer Co., Port Canaveral Cocoa Beach Brewing Co., Cocoa Beach Bugnutty Brewing Co., Merritt Island Dirty Oar Beer Co., Cocoa Village Charlie & Jakes Brewery & Grille, Suntree Intracoastal Brewing Co., Eau Gallie Lost Shirt Brewing Co., Melbourne Hell 'n Blazes Brewing Co., Melbourne Email Leonard at sleonard@floridatoday.com . Follow her on Facebook at /SuzyFlemingLeonard and on Instagram @SuzyLeonard . About Us Corrections Staff Directory Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.floridatoday.com. All rights reserved."
    },
    {
      "url": "https://www.visitspacecoast.com/cocoa/restaurants/dirty-oar-beer-company",
      "text": "Dirty Oar Beer Company - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Dirty Oar Beer Company Add to Wishlist Dirty Oar Beer Company Dirty Oar Beer Company, located in Cocoa Village, believes that great beer and great memories go well together. The beers on tap are brewed true-to-style and hand crafted in-house to ensure deliciousness in every pint. Between food trucks, monthly events, live music, and much more, there’s always something going on in the taproom. Dirty Oar takes pride in a family-friendly atmosphere and encourages your four legged friends to come along! Add to Trip Visit Website Direction 329 King St, Cocoa, FL 32922 Contact (321) 301-4306 Discover More nearCocoa Beach All Hotels Restaurants Events Add to Wishlist Juice N Java Cafe Cocoa Beach Sip into the season with a specialty coffee from Juice N Java Cafe. Add to Trip Add to Wishlist Coastal Market Cocoa Beach Cocoa Beach Fresh • Local • Coastal At Coastal Market, you’ll find everything from handcrafted deli sandwiches and fresh-baked pastries to fresh produce, premium meats, and specialty groceries. We even cater your gatherings with custom trays and menus. Stop by and taste why we’re Cocoa Beach’s favorite neighborhood market! Enjoy  1/2 Sandwich,… Add to Trip Add to Wishlist Fuji Yama THAI and sushi Cocoa Beach Lunch special starting at $12.95, name this ad get Asahi beer for only 5 bucks! Add to Trip Add to Wishlist Boardroom Cocoa Beach Located just steps away from main street, where you can enjoy our casual but trendy atmosphere. We offer the largest selection of boutique wines at the beach by both the glass and bottle; as well as craft, classics & local beer, seltzer and a variety of other beverages like house… Add to Trip Add to Wishlist 2georges oceanside bar & grill Cocoa Beach Enjoy a glass of house wine on us with any dinner purchase! Just minutes from the Cocoa Beach Pier and world-famous Ron Jon Surf Shop, 2georges oceanside bar & grill is a local favorite for fresh seafood, especially known for our world famous jumbo lump crab cakes. We also have… Add to Trip Add to Wishlist Cape Grill and Bar Cocoa Beach Come visit Cape Grill and Bar, the hidden jewel of Cape Canaveral, to try our made-from-scratch Prix Fixe lunch or dinner offerings! We are open to the public inside the Holiday Inn Club Vacations Resort. Both menus feature appetizers of house-made Crab Rangoon Flautas or Mozzarella Sticks, along with a… Add to Trip Add to Wishlist Rebellion Beachside Bar and Bistro Cocoa Beach Enjoy a revolving 4-course prix fixe menu for $45! We are excited to change up this menu as fresh, local ingredients become available! Here’s a sample of what may be available for your reservation! 1st Course: Crudo 2nd Course: Oyster Stew 3rd Course: Roasted Chicken with Mushrooms and Truffles OR… Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist Shark Tank Cocoa Beach Vacation Rentals Cocoa Beach Come to Shark Tank Vacation Rentals, your exclusive getaway just steps from downtown Cocoa Beach and the pristine shores of Florida’s Space Coast. Each unit in our newly renovated quadplex features two bedrooms, a bathroom, and a stylish blend of seaside charm and contemporary elegance. Spend your days surfing, relaxing… Add to Trip Add to Wishlist Space Coast Sights LLC Cocoa Beach Our family owned small business offers excursions that highlight Natural Florida (including hike options), a historic village with a waterfront park, and famous landmarks on sandy beaches. Visit coastal communities of Cocoa, Merritt Island, Cocoa Beach, and Cape Canaveral where dining, entertainment, wildlife, education, and relaxation await. Our sightseeing destinations… Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Kabob-a-licious Cocoa Beach Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a… Add to Trip Add to Wishlist Central Florida Kayaking Inc. Cocoa Beach Central Florida Kayaking offers guided kayak tours throughout Brevard County, including Merritt Island, Cocoa Beach, Melbourne, and other locations near Orlando. Kayaking tours explore the beauty of The Thousand Islands, mangrove tunnels, and the Indian River Lagoon. If you would like to see dolphins, manatees, and wild birds, or experience… Add to Trip Add to Wishlist Skull & Books VR Cocoa Beach Discover the Space Coast’s most unique adventure! Skull & Books VR combines the magic of a cozy used bookstore with the excitement of a cutting-edge VR arcade—all in one unforgettable destination. Whether you’re solving mysteries in an immersive VR escape room, battling alongside friends in multiplayer games, or just picking… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Comments This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "text": "Meet The Leadership Team | BeerBoard Search for: Search for: Home Solutions Retail Solutions SmartOrders SmartBar SmartMenus Supplier Solutions About Team Partners Integrations Careers News Stories & Releases In the News On-Premise Insights Contact Request a Demo Login Skip to content Home Solutions Retail Solutions SmartOrders SmartBar SmartMenus Supplier Solutions About Team Partners Integrations Careers News Stories & Releases In the News On-Premise Insights Contact Request a Demo Login Alcohol Industry Experts Meet Our Leadership Team Contact Us Home Meet The Leadership Team Share Facebook Twitter LinkedIn Email Mark Young Founder & CEO mark@beerboard.com Sundar Ravindran Chief Technology Officer sundar@beerboard.com John Boyle SVP Business Development boyle@beerboard.com Tom Young VP Client Relations tom@beerboard.com Josh Solomon VP Channel Partnerships josh@beerboard.com JC Whipple VP Marketing & Communications jc@beerboard.com Let's deliver the right solution for your business Book a Consultation Key Pages About Us Retail Solutions Supplier Solutions Our Clients Meet The Team Contact Us Search Beers & Bars Near You Claim Your Brand Bar Login Brewery Login Privacy Policy Terms & Conditions Recent Posts Buddy’s Pizza Taps BeerBoard to Power Alcohol Intelligence (AI), Streamline Beverage Operations and Strengthen Supplier Partnerships August 4, 2025 Kirby Ice House Partners with BeerBoard to Optimize Alcohol Management with Cutting-Edge Technology July 29, 2025 Follow Us © 2025 BeerBoard Top"
    }
  ]
}