{
  "fuentes": [
    {
      "url": "https://www.harrys.com.sg/contactus",
      "email": "careers@harrys.com.sg"
    },
    {
      "url": "https://www.harrys.com.sg/contactus",
      "email": "franchise@harrys.com.sg"
    },
    {
      "url": "https://www.harrys.com.sg/contactus",
      "email": "marketing@harrys.com.sg"
    },
    {
      "url": "https://tortugas.milbstore.com/",
      "email": "jimjaworski@daytonatortugas.com"
    },
    {
      "url": "https://tortugas.milbstore.com/",
      "email": "tugamerch@daytonatortugas.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "sechemendia@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "spike@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "abooth@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "amesmer@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "bbentley@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "blittle@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "bredmon@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "cgrimes@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "crand@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "gamado@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "jkies@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "jsims@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "kdigiacomo@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "kgalloway@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "lcb@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "mrobin@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "rdenson@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "sharlow@daytonabeach.com"
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "email": "tboyd@daytonabeach.com"
    },
    {
      "url": "https://allmusicmagazine.com/venues/dirty-harrys-pub-package/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://allmusicmagazine.com/venues/dirty-harrys-pub-package/",
      "email": "dirtyharrys@doanmgt.com"
    },
    {
      "url": "https://www.harryandedge.co.uk/contact-us",
      "email": "info@harryandedge.co.uk"
    }
  ],
  "mails": [
    "abooth@daytonabeach.com",
    "all-music-logo-white@2x.png",
    "amesmer@daytonabeach.com",
    "bbentley@daytonabeach.com",
    "blittle@daytonabeach.com",
    "bredmon@daytonabeach.com",
    "careers@harrys.com.sg",
    "cgrimes@daytonabeach.com",
    "crand@daytonabeach.com",
    "dirtyharrys@doanmgt.com",
    "franchise@harrys.com.sg",
    "gamado@daytonabeach.com",
    "info@harryandedge.co.uk",
    "jimjaworski@daytonatortugas.com",
    "jkies@daytonabeach.com",
    "jsims@daytonabeach.com",
    "kdigiacomo@daytonabeach.com",
    "kgalloway@daytonabeach.com",
    "lcb@daytonabeach.com",
    "marketing@harrys.com.sg",
    "mrobin@daytonabeach.com",
    "rdenson@daytonabeach.com",
    "sechemendia@daytonabeach.com",
    "sharlow@daytonabeach.com",
    "spike@daytonabeach.com",
    "tboyd@daytonabeach.com",
    "tugamerch@daytonatortugas.com"
  ],
  "nombre_sitio": "dirtyharrysdaytonabeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.harrys.com.sg/contactus",
      "text": "Contact us | Harry's Singapore top of page *Menu Wellness Options Promos Rewards Happenings Entertainment Groove Acts Sports EAT. PLAY. RACE. Outlets Events More Use tab to navigate through the menu items. Make a Reservation Let's Talk! At Harry’s, we want your voice to be heard. Speak to us and drop us a message and we’ll get in touch with you shortly. Contact us: About Contact us: Contact Contact Us For additional questions and inquiries, do drop us a note at the following emails. For Franchising enquiries: franchise@harrys.com.sg For Marketing/Public Relations enquiries: marketing@harrys.com.sg For Human Resource enquiries: careers@harrys.com.sg For Events & Catering enquiries: Click Here Harry's Singapore Corporate Office Blk 3E River Valley Road, #03-01, Singapore 179024 Name Email Subject Outlet Message Contact Number (optional) SUBMIT Thanks for submitting! Harry's International ©2025 Harry's International Pte Ltd Privacy Policy Terms & Conditions Contact bottom of page"
    },
    {
      "url": "https://tortugas.milbstore.com/",
      "text": "Daytona Tortugas Official Store Daytona Tortugas Official Team Store | 110 E. Orange Ave, Daytona Beach, FL 32114 Search Close menu Menu You Just Added: Qty: Remove Product Quantity Total You have items in your cart You have 1 item in your cart Total Have a discount code? Continue to checkout to redeem it. Shopping Cart Menu Shop All All Apparel Men Shop All Caps T-Shirts Jerseys Outerwear NEW ERA 59FIFTY HOME CAP Women Shop All Caps T-Shirts Jerseys Outerwear WOMEN'S GRAY OMEGA MESH TECH POLO Kids Shop All Caps T-Shirts Youth Toddler & Infant NAVY INFANT ONESIE Caps Shop All Adjustable Fitted Stretch Fit On-Field Collection Men's Women's Kid's Brand '47 Brand Bimm Ridder New Era Outdoor Cap DAYTONA TORTUGAS MARVEL 59FIFTY CAP NEW ERA 59FIFTY BP CAP Novelties Marvel Rumberos Clearance Search Account Cart 0 Cart You Just Added: Qty: Remove Product Quantity Total You have items in your cart You have 1 item in your cart Total Have a discount code? Continue to checkout to redeem it. Shopping Cart Search Close menu Shop All All Apparel Men Shop All Caps T-Shirts Jerseys Outerwear NEW ERA 59FIFTY HOME CAP Women Shop All Caps T-Shirts Jerseys Outerwear WOMEN'S GRAY OMEGA MESH TECH POLO Kids Shop All Caps T-Shirts Youth Toddler & Infant NAVY INFANT ONESIE Caps Shop All Adjustable Fitted Stretch Fit On-Field Collection Men's Women's Kid's Brand '47 Brand Bimm Ridder New Era Outdoor Cap DAYTONA TORTUGAS MARVEL 59FIFTY CAP NEW ERA 59FIFTY BP CAP Novelties Marvel Rumberos Clearance Log in Create account Shop All Shop Caps Shop Apparel Shop Novelties TEAM STORE HOURS Monday - Friday:  10AM - 4PM Saturday and Sunday: Closed *Open During Games for Fans with Tickets* For questions please call us at (386)-271-8745 Get Directions SIGN UP & SCORE 10% OFF! Join our email newsletter and get access to new merch drops, discounts, and other exclusive store news! Go By signing up, you are agreeing to receive news and offers from MiLB, MiLB Store and its affiliates. Customer care Get answers to your questions Contact Us Return Policy Privacy Policy Terms of Use VCDPA Compliance CCPA Compliance Account & Ordering Get the information you need My Account Ordering Policy Shipping Policy International Orders Merchandise Inquiries Explore MiLB Learn more about us MiLB.com MiLBStore.com MiLB Auctions MiLB.TV MiLB Tickets MiLB Team Stores Follow Us DAYTONATORTUGAS.COM About Us Welcome to the Official Online Store of the Daytona Tortugas, the Single-A Minor League Baseball Affiliate of the Cincinnati Reds. Merchandise for the Daytona Tortugas Official Store is provided in an effort to offer the most extensive selection of officially licensed Daytona Tortugas products on the internet. The Daytona Tortugas Official Store is located at 110 E. Orange Avenue Daytona Beach, FL, 32114. For questions regarding merchandise and order status please call the Daytona Tortugas Official Store directly at (386) 257-3172 or email tugamerch@daytonatortugas.com For more team information please visit http://www.daytonatortugas.com , the official website of the Daytona Tortugas. Thank you for supporting the Daytona Tortugas. Accepted Payments American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa © 2025 Baseball Internet Rights Company, LLC (\"BIRCO\"). All rights reserved. The following are trademarks or service marks of Minor League Baseball entities and may be used only with permission of Baseball Internet Rights Company, LLC or the relevant Minor League Baseball entity: Minor League Baseball, MiLB, the silhouetted batter logo, The Road to the Show, Pro Debut, and the names, nicknames, logos, uniform designs, color combinations, and slogans designating the Minor League Baseball clubs, leagues and entities, and their respective mascots, events and exhibitions. MiLB Ecommerce Marketplace Powered by Snow Commerce, Inc."
    },
    {
      "url": "https://www.daytonabeach.com/about/our-organization/our-team/",
      "text": "Our Team | Daytona Beach Area CVB Departments & Staff Directory Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us SEARCH SEARCH About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources About Our Organization Share Our Team The Daytona Beach Convention and Visitors Bureau (CVB) works with area tourism and hospitality-related businesses, non-profit organizations, and event promoters, to represent the area to potential travelers, tour operators, travel agents, meeting planners, and the travel media. The CVB staff of marketing, sales, communication and administration professionals act in accordance with initiatives outlined by the Halifax Area Advertising Authority (HAAA). ADMINISTRATION Administration is responsible for the overall management and operations of the CVB as well as Finance and Human Resource services. Staff Lori Campbell Baker , APR, CDME, Executive Director Chuck Grimes , Director of Finance Steven Pike , HR/Finance DESTINATION SALES Working closely with meeting planners, tour and travel operators, and sports groups, the Group Sales Department helps to recruit and coordinate with area partners to provide services for group meetings, citywide conventions, trade shows, and sports competition events to the destination. The CVB is an active member of many industry professional associations and promotes the area's meeting facilities and hotels at industry events worldwide. Staff Brenda Redmon , Director of Sales Brandon Little , Senior Sales Manager, Sports Business Development Mara Robin , Corporate Sales Manager Shannon Echemendia , Sales Manager Karen DiGiacomo , Tour & Travel Sales Manager Rashanda Denson , Group Sales Coordinator Gabriela Amado , Convention Services and Events Coordinator MARKETING & DESIGN This division of the CVB handles advertising, marketing, tourism event funding, consumer promotions, visitor information services and business development. Staff Kay Galloway , TMP, Chief Marketing Officer Jennifer Sims , CHIA, CAHTA, Marketing Systems Manager Tangela Boyd , Digital Marketing Manager Connor Rand , Partner Liaison & Tourism Affairs Brian Bentley , PDM, Manager of Corporate Partnerships and Events Ashley Mesmer , Digital Content Creator COMMUNICATIONS This division of the CVB focuses on media relations, travel journalist press trips, editorial and online content, event calendar, brand and message consistency, community relations, speaker's bureau and crisis communications. Staff Andrew Booth , Director of Communications Sharon Harlow , Communications Specialist, Community Outreach View Our Destination Guide SIGN UP FOR OUR eNewsletter About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources © 2025 Daytona Beach Area CVB © 2025 Daytona Beach Area CVB"
    },
    {
      "url": "https://allmusicmagazine.com/venues/dirty-harrys-pub-package/",
      "text": "Dirty Harry's Pub & Package - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Dirty Harry’s Pub & Package Daytona Beach Rock (386) 252-9877 dirtyharrys@doanmgt.com View Website 705 Main St Daytona Beach Florida 32811 Smoking About The Venue Dirty Harry’s Pub & Package is the best place to party on Main Street 365 days a year. Home of the 1st Sunday BBQ. Live music, free BBQ, and the hottest bartenders on Main Street. Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.harryandedge.co.uk/contact-us",
      "text": "Contact Us - Harry & Edge Skip to main content Connect With Us info@harryandedge.co.uk Home About Us About Us COVID-19 Information Blog FAQs Jobs Testimonials Past Events Services Digital Screens Digital Graffiti Wall Mini Digital Graffiti Wall Photo Booth Hire Classic Photo Booth Compact Photo Booth GIF Photo Booth Hashtag Printing iPad Photo Booths Mirror Photo Booth 360 Camera Booth Vintage booth Ultra booth Social booth Backdrops Flower walls Venue Decorations 3D LED Dance Floor LED Light Up Letters Event Hire Services Arcade Games Hire Candy Floss Machine Chocolate Fountain Fruit Palm Tree Games Table Hire Mosaic Wall Photo Globe Popcorn Machine Racing Car Simulator Virtual Reality Pods in London Waffle Station Events Events Anniversaries Awards Ceremonies Bar Mitzvahs Birthdays Brand Launches Corporate Events Charity Events Fashion Shows Product Launches University Events Weddings Proms & Balls Gallery Contact Us 0203 369 5950 Contact Us Home Contact Us Published by Harry & Edge on 05 th October 2020 , Contact Us , Updated on 02 nd August 2021 We’re Just A Phone Call Away! Help Your Event To Reach Its Full Potential Whether you’re eager to get booked in or have a few questions for our team, we’re always more than happy to help! Get in touch via one of the methods featured below, and we’ll get back to you shortly. Full Name Email Address Telephone Company Name Service Needed Select Service Mirror Photo Booth Ipad Photo Booths Hashtag Printing Gif Photo Booth Compact Photo Booth Classic Photo Booth Digital Graffiti Wall Mini Digital Graffiti Wall 3d Led Dance Floor Led Light Up Letters Virtual Reality Pod Waffle Station Racing Car Simulator Popcorn Machine Photo Globe Mosaic Wall Games Table Hire Fruit Palm Tree Chocolate Fountain Candy Floss Machine Other Event Type Select Event Type Anniversaries Awards Ceremonies Bar Mitzvahs Birthdays Brand Launches Corporate Events Charity Events Fashion Shows Product Launches University Events Weddings Proms Balls Other Event Date Venue Name Venue Address Message By clicking this checkbox, you accept that your details are shared with our team to contact you back. View Map Get In Touch. Ready To Get Planning? 0203 369 5950 info@harryandedge.co.uk 63-66 Hatton Garden , Holborn , London , United Kingdom , EC1N 8LE We use cookies to give you the best experience from our website, visit our website terms and conditions to find out more. By continuing to browse our site you are agreeing to our use of cookies. Making events come to life. Get in touch with our team today. CALL US NOW 0203 369 5950 EMAIL US NOW info@harryandedge.co.uk Get in touch now Home About Us services events gallery blog jobs subscribe faqs Contact Us Website T&C's Sitemap XML Sitemap 63-66 Hatton Garden, Holborn,  London,  London © Copyright 2025 Harry And Edge"
    }
  ]
}