{
  "fuentes": [
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "prepaidhealth@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "willsandtrust_info@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "discoverylifeinfo@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "gapcover@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "healthpartnerinfo@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "insureinfo@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "invest_complaints@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "prepaidhealth@discovery.co.za"
    },
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "email": "webinfo@discovery.co.za"
    },
    {
      "url": "https://discoverycove.com/orlando/help/guests-with-disabilities/",
      "email": "dco-guestrelations@discoverycove.com"
    },
    {
      "url": "https://www.quora.com/How-can-you-contact-Discovery-Cove-in-Orlando-Florida",
      "email": "jo@samaritans.org"
    },
    {
      "url": "https://discoverycove.com/orlando/help/reservation-reschedule/",
      "email": "dco-guestrelations@discoverycove.com"
    },
    {
      "url": "https://bearsdenorlando.com/theme-parks/discovery-cove/",
      "email": "aditya.harsh@ndmhospitality.com"
    },
    {
      "url": "https://www.pacificdiscovery.org/contact-us/get-in-touch",
      "email": "info@pacificdiscovery.org"
    },
    {
      "url": "https://discoverycove.com/orlando/contact-us/",
      "email": "dco-guestrelations@discoverycove.com"
    },
    {
      "url": "https://leadiq.com/c/discovery-cove/5a1d95b72300005b008465b0/employee-directory?page=5",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/discovery-cove/5a1d95b72300005b008465b0/employee-directory?page=5",
      "email": "sales@leadiq.com"
    }
  ],
  "mails": [
    "aditya.harsh@ndmhospitality.com",
    "dco-guestrelations@discoverycove.com",
    "discoverylifeinfo@discovery.co.za",
    "gapcover@discovery.co.za",
    "healthpartnerinfo@discovery.co.za",
    "info@pacificdiscovery.org",
    "insureinfo@discovery.co.za",
    "invest_complaints@discovery.co.za",
    "jo@samaritans.org",
    "name@company.com",
    "prepaidhealth@discovery.co.za",
    "sales@leadiq.com",
    "webinfo@discovery.co.za",
    "willsandtrust_info@discovery.co.za"
  ],
  "nombre_sitio": "discoverycove.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.discovery.co.za/corporate/leadership",
      "text": "Leadership - Discovery Back to old site Welcome to our new site. INDIVIDUALS BUSINESS Discovery Health Medical Scheme Online banking Register Log in Individuals Bank Medical aid More Health Cover Life Insurance Investments Car and home insurance Vitality Travel Find an adviser Business MAIN MENU Get 8 free workouts every month! Visit any gym or fitness facility in our network until 30 September 2025. Find out more Join Discovery Bank or log in Join now Log in to Online Banking Compare your current bank account with Discovery Bank Shared-value banking About Shared-value banking Vitality Money Discovery Bank rewards Rewards Ðiscovery Miles Vitality Travel Friend Referral Rewards Calculate your potential rewards Discovery Bank accounts Explore all Discovery Bank accounts Credit cards & credit facilities Discovery Bank credit cards Full banking suites Home loans Revolving Credit Facility Personal Loans Transaction & other accounts Transaction accounts - bundled fees Transaction accounts - pay-as-you-transact fees Real-time forex accounts Savings accounts Other products and benefits Prepaid products and digital vouchers Energy Solutions Trade and invest with EasyEquities Digital Banking The Discovery Bank app Discovery AI Payments with Discovery Bank Discovery Pay Vitality Money Financial Analyser Quick links to more information Safety and security Info and tips Latest news Bank Blog How-to videos MAIN MENU Earn up to R500 when you Activate Personal Health Pathways and complete your recommended health action. EARN TODAY Get medical aid Get a medical aid quote DHMS medical aid plans Compare Medical Aid Plans What is medical aid Your health plan Benefits and cover WELLTH Fund cover Extra savings and services Your 2025 benefits and contributions Your health Find a healthcare provider Discovery Health App Going to hospital Your chronic cover Discovery Health magazine Personal Health Pathways Nominate a primary care GP Get help Ask Discovery Find documents and certificates About us About Discovery Health Medical Scheme About Discovery Health Understanding NHI 404 Page Error MAIN MENU Your safety net, on us! Enjoy 3 months free gap cover. T&Cs apply. Find out more Gap Cover Our gap cover products Get a gap cover quote Apply for Gap Cover Find a document Emergency Cover Get Emergency Cover now Supplementary Illness Benefit The Supplementary Illness Benefit Apply for Supplementary Illness Benefit Prepaid Health Prepaid Health Flexicare health insurance Join Flexicare now Our Flexicare products Flexicare DebiCheck Flexicare 2025 benefits and premiums MAIN MENU Financially protect your life with R2 million life cover from R200 pm* and access award-winning** benefits and rewards today. *Risk profile dependent. **Efma-Accenture and ICON recognition. Get a Life quote Discovery Life Ltd, a licensed life ins & reg credit provider. Auth FSP. Ts&Cs apply. *Efma Accenture. Get a quote today Get a life insurance quote in 60 seconds Get a Global Education Protector quote Get a Funeral Plan quote About life insurance Why you need a life plan Bespoke life cover for you and your family Life cover that pays out in US dollars Life cover for your business Life Claims Experience Rewards Premium discounts and PayBack Personalised PayBack Booster Estate planning Wills and estate planning Get an Estate Preserver MAIN MENU Grow your wealth in US dollars with the Discovery Dollar Capital 150|250+ Find out more Invest with us today Invest today Current offers Shared-value investing Educational content Basics of investing Planning for retirement Offshore investing Retirement investment plans Fixed Annuities Retirement savings plans Retirement income plans Lifespan Linked Income Plan Secured Capital Annuity retirement plan | Discovery Invest Global investment plans Lump-sum global endowment Global flexible investment plan Recurring global endowment Funds Investment opportunities Discovery funds External funds Fund commentary Interactive fund factsheets Discretionary Investments Flexible investment plans Endowment plans Guaranteed return plans Useful links About us How we reward you Phishing scams Which investment is right for me? Market indicators Find an adviser MAIN MENU Get up to R1,500 cash back every month just for driving well. Get a quote in 60 seconds Car Insurance Get a quote Comprehensive Car Insurance Plans Short-Term Insurance Warranty cover About us Why choose Insure Force for good Interesting content Vitality Drive Shell rewards Fuel cash back Vitality Active Rewards Stay safe with safety features Join Vitality Drive Home Insurance Get a quote Buildings insurance Household content insurance Portable Possessions Help Emergency FAQs MAIN MENU Donate your preloved shoes and inspire new dreams. Find out more Join Vitality today Join Vitality free for 3 months now What is Vitality? How Vitality works Science of Vitality Vitality is here to help you get healthier Tools to know your health Quick and easy tips to improve your health Essential health checks Rewards Vitality Fitness and Gym Vitality HealthyFood Vitality Travel rewards Vitality rewards for the family Amazing reward partners Get rewarded weekly with Vitality Active Rewards Get rewarded with Discovery Insure Get boosted rewards with Discovery Bank Discovery Miles More ways to live life with Vitality Vitality 65+ Join SA's biggest running and cycling club Book a course at the Healthy Food Studio now Quick links Vitality latest news Upcoming Events Vitality FAQs MAIN MENU #Give2Move and donate your pre-loved running shoes. Find out more Travel Log in to book Travel More about Vitality Travel Latest Vitality Travel News The Lounge by Discovery and SAA Explore Discovery Bank Forex Accounts Find out about travel insurance Vitality Traveller Magazine MAIN MENU Bank Medical aid More Health Cover Life Insurance Investments Car and home insurance Vitality Travel Find an adviser Join Discovery Bank or log in Join now Log in to Online Banking Compare your current bank account with Discovery Bank Shared-value banking About Shared-value banking Vitality Money Discovery Bank rewards Rewards Ðiscovery Miles Vitality Travel Friend Referral Rewards Calculate your potential rewards Discovery Bank accounts Explore all Discovery Bank accounts Credit cards & credit facilities Discovery Bank credit cards Full banking suites Home loans New Revolving Credit Facility New Transaction & other accounts Transaction accounts - bundled fees Transaction accounts - pay-as-you-transact fees Real-time forex accounts Savings accounts Other products and benefits Prepaid products and digital vouchers Energy Solutions Trade and invest with EasyEquities Digital Banking The Discovery Bank app Discovery AI New Payments with Discovery Bank Discovery Pay Vitality Money Financial Analyser Quick links to more information Safety and security Info and tips Latest news Bank Blog How-to videos Get 8 free workouts every month! Visit any gym or fitness facility in our network until 30 September 2025. Find out more Get medical aid Get a medical aid quote DHMS medical aid plans Compare Medical Aid Plans Your health plan Benefits and cover Extra savings and services Your 2025 benefits and contributions Your health Find a healthcare provider Discovery Health App Going to hospital Your chronic cover Discovery Health magazine Personal Health Pathways New Get help Ask Discovery Find documents and certificates About us About Discovery Health Medical Scheme About Discovery Health Understanding NHI Earn up to R500 when you Activate Personal Health Pathways and complete your recommended health action. EARN TODAY Gap Cover Our gap cover products Get a gap cover quote New Apply for Gap Cover Find a document Emergency Cover Get Emergency Cover now Supplementary Illness Benefit The Supplementary Illness Benefit Apply for Supplementary Illness Benefit Prepaid Health Prepaid Health Flexicare health insurance Join Flexicare now Our Flexicare products Flexicare DebiCheck Flexicare 2025 benefits and premiums Your safety net, on us! Enjoy 3 months free gap cover. T&Cs apply. Find out more Get a quote today Get a life insurance quote in 60 seconds Get a Global Education Protector quote Get a Funeral Plan quote About life insurance Why you need a life plan Bespoke life cover for you and your family Life cover that pays out in US dollars Life cover for your business Life Claims Experience Rewards Premium discounts and PayBack Personalised PayBack Booster Estate planning Wills and estate planning Get an Estate Preserver Financially protect your life with R2 million life cover from R200 pm* and access award-winning** benefits and rewards today. *Risk profile dependent. **Efma-Accenture and ICON recognition. Get a Life quote Discovery Life Ltd, a licensed life ins & reg credit provider. Auth FSP. Ts&Cs apply. *Efma Accenture. Invest with us today Invest today Current offers Shared-value investing Educational content Basics of investing Planning for retirement Offshore investing Retirement investment plans Retirement savings plans Retirement income plans Global investment plans Lump-sum global endowment Global flexible investment plan Recurring global endowment Funds Investment opportunities Discovery funds External funds Fund commentary Interactive fund factsheets Discretionary Investments Flexible investment plans Endowment plans Guaranteed return plans Useful links Phishing scams Which investment is right for me? Market indicators Find an adviser Grow your wealth in US dollars with the Discovery Dollar Capital 150|250+ Find out more Car Insurance Get a quote Comprehensive Car Insurance Plans Short-Term Insurance Warranty cover About us Why choose Insure Force for good Interesting content Vitality Drive Fuel cash back Vitality Active Rewards Stay safe with safety features Join Vitality Drive Home Insurance Get a quote Buildings insurance Household content insurance Portable Possessions Help Emergency FAQs Get up to R1,500 cash back every month just for driving well. Get a quote in 60 seconds Join Vitality today Join Vitality free for 3 months now What is Vitality? How Vitality works Science of Vitality Vitality is here to help you get healthier Tools to know your health Quick and easy tips to improve your health Essential health checks Rewards Vitality Fitness and Gym Vitality HealthyFood Vitality Travel rewards Vitality rewards for the family Amazing reward partners Get rewarded weekly with Vitality Active Rewards Get rewarded with Discovery Insure Get boosted rewards with Discovery Bank Discovery Miles More ways to live life with Vitality Vitality 65+ Join SA's biggest running and cycling club Book a course at the Healthy Food Studio now Quick links Vitality latest news Upcoming Events Vitality FAQs Donate your preloved shoes and inspire new dreams. Find out more Log in to book Travel More about Vitality Travel Latest Vitality Travel News The Lounge by Discovery and SAA Explore Discovery Bank Forex Accounts Find out about travel insurance Vitality Traveller Magazine #Give2Move and donate your pre-loved running shoes. Find out more close search Leadership Executive Directors Adrian Gore Founder, Executive Director and Group Chief Executive Read more Adrian is the founder and Group Chief Executive of the Discovery Group. In 1998, he was recognised as South Africa's Best Entrepreneur by Ernst & Young and was chosen as South Africa's leading CEO in the annual Moneyweb CEO of the Year Awards in 2004. In 2008, he received the Investec Award for Considerable Contribution in a Career/Profession, and he was named Sunday Times Business Leader of the Year in 2010. Alongside his commitments, he works with other leaders to stimulate entrepreneurship in South Africa. In 2017, Adrian received the Frost and Sullivan Visionary Innovation Leadership Award for Africa, and the Ernst & Young Global Life Time Achiever (Entrepreneurship) Award. Deon Viljoen Executive Director, Group CFO Read more Deon joined the Discovery Group in May 2017 as Group CFO. He serves on the boards of various of the Group's subsidiaries and committees, including the Group Executive Committee. Before joining Discovery, he was with the Alexander Forbes Group, where he joined in 2003 as Finance Director of Investment Solutions. He later became Finance Director of the group's African operations and, in 2007, assumed the role of Group CFO. In this role, Deon served as Executive Director on Alexander Forbes Group Holdings Limited's Board and the listed special purpose vehicle Alexander Forbes Preference Share Investments Limited, as well as various subsidiary boards and committees. Deon was instrumental in strategic repositioning during the private equity holding and the relisting in 2014. He also served as interim CEO in 2016. Deon was named CFO of the Year 2015 by CFO SA. Earlier in his career, he was a Partner and Director of PwC Johannesburg. As part of his specialisation in banking and financial services, he advised clients and presented on topics such as financial risk management. While in the accountancy profession, Deon was a member of the SAICA Banking Industry Group and chaired the Investment Management and the Collective Investment Schemes industry groups. Barry Swartzberg Executive Director, CEO: Vitality Group Read more Barry is the co-founder of Discovery. He was instrumental in establishing Discovery Health's marketing, distribution and operational functions as Chief Marketing Officer from 1992 to 1996 and Chief Operations Officer from 1997 to 1999. He then served as CEO from 2000 to 2005, launching the first low-income medical scheme plans and Discovery Health's administration services business for closed medical schemes. From 2005 to 2014, he served as Group Executive Director responsible for Discovery's strategy and new business development. In this role, he initiated Discovery's strategy to launch a retail bank, helped start Discovery Insure, secured the shareholding in Ping An Health Insurance, established the first insurance partnership with AIA and established Vitality USA. Barry now serves as Vitality Group CEO, responsible for expanding Discovery's Shared-value Insurance model beyond South Africa and the UK. He also serves on the boards of Discovery Insure, Vitality Group and Ping An Health Insurance in China. Non-Executive Directors Mark Tucker Independent Non-Executive Director Read more Mark is a qualified Chartered Accountant with over 35 years' experience in the financial services industry in the UK, US and Asia - including 25 years based in Hong Kong. Mark is the Non-executive Group Chairperson of HSBC Holdings. Most recently, Mark served as Group Chief Executive and President of AIA Group Limited, where he spearheaded its world-record-breaking initial public offering in Hong Kong in 2010. Before AIA, Mark held various senior executive roles with Prudential, including Group Chief Executive of Prudential plc. He was the founding Chief Executive Officer (CEO) of Prudential Corporation Asia Limited. Mark was also an Independent Non-executive Director of the Goldman Sachs Group and served on the Court of the Bank of England as a Non-executive Director from 2009 to 2012. Monhla Hlahla Independent Non-Executive Director Read more Monhla is a highly experienced executive and business leader with over 35 years' experience in infrastructure development and management. Monhla has a depth of experiences in corporate governance, based on a demonstrated history of nonexecutive directorships in a variety of industries. Her experiences are a combination of strong operational experiences and extensive exposure to private and public sector governance and leadership, that places Monhla uniquely among the leading Executive Coaches from the African continent. She previously served as Managing Director of Airports Company South Africa (ACSA), and under her management, ACSA embarked on its biggest ever capital expenditure programme to cater for the increasing number of passengers going through South African airports. She also served as the Chairperson of the Johannesburg Water Utility, the Trans-Caledon Water Authority and the Industrial Development Corporation. In 2014, Monhla was honoured by the President of France with the Chevalier de la Legion d'Honneur and, in 2005, both the Black Business Quarterly and the Businesswomen's Association named her Businesswoman of The Year. Bridget van Kralingen Independent Non-Executive Director Read more Bridget started her career as a senior researcher for the Council for Scientific and Industrial Research in South Africa, after which she became a managing partner for strategy and organisation development at Deloitte South Africa. In 1997, she moved to New York City to serve as national managing partner for financial services at Deloitte. Bridget joined IBM Global services in 2004 and served in multiple roles. As Senior Vice President of IBM Global Business Services, she led IBM's Industry Platforms, establishing IBM as the leader in enterprise blockchain. In 2020, Bridget was named Senior Vice President of IBM Global Markets managing IBM sales teams, business partners, business development and industry capabilities globally. In this role, she was responsible for IBM's revenue, profit, and client satisfaction worldwide. Bridget brings a wealth of global business experience and technology and artificial intelligence expertise to the Board, which supports Discovery's global expansion. Faith Khanyile Independent Non-Executive Director Read more Faith is a founding member and CEO of WDB Investment Holdings. Faith has over 24 years financial services sector experience. She held various senior and executive roles with Standard Bank Corporate and Investment Banking between 2001 and 2013. She was the Head of Corporate Banking, where she was responsible for strategy development and execution, people leadership, key client relationship management and business development. She also served on Standard Bank's CIB Executive and Credit committees. Before joining Standard Bank, Faith was with Brait Private Equity. In May 2016, Faith was accorded Doctor of Law by Wheaton College. She is also a recipient of the 2017 Business Woman of the Year Award (Corporate category) from the Businesswomen's Association of South Africa Richard Farber Non-Executive Director Read more Richard joined Discovery as CFO in 2003 and was appointed Financial Director on 1 July 2009. Richard relinquished these roles on 30 April 2017 and has since remained a Discovery Board member. He was a partner at Fisher Hoffman Sithole (PKF) from 1998 until 2001, before joining Investec Bank as Group Accountant until 2003. Marquerithe Schreuder Independent Non-Executive Director Read more Marquerithe is a qualified actuary and has been a Fellow of the Institute of Actuaries and a Fellow of the Actuarial Society of South Africa since 2000. She was an Independent Director of Hannover Re Africa Group, where she acted as the Chairperson of the Actuarial and Risk and Remuneration committees. Marquerithe was also a Director at the Actuarial Insurance Solutions division of Deloitte. Further, she continues to serve on the Actuarial Society of South Africa's Life Assurance Tax Subcommittee. David Macready Independent Non-Executive Director Read more David was an audit partner at Deloitte in South Africa and, subsequently, in London for six years before entering financial services. He held positions as Managing Director of Syfrets Private Bank, Managing Director of Nedbank Wealth, CEO of Old Mutual Investment Group and CEO of Old Mutual South Africa. Over a period of 21 years, he served on the Group Executive of Nedcor Investment Bank, Nedbank Group Limited and Old Mutual Limited. David retired following the Old Mutual managed separation at the end of 2018. Lisa Chiume Independent Non-executive Director Read more Lisa was a Senior Director at Deutsche Bank South Africa from 2002 to 2014, where she was involved in mergers and acquisitions and equity capital markets. Lisa joined RMI Holdings Limited and RMH Holdings Limited in 2014 as a Senior Investment Executive until March 2023. Due to RMI/RMH's previous shareholding in Discovery Limited, Lisa has worked closely with Discovery and senior Discovery management over the years on strategic issues, including capital allocation, remuneration, mergers and acquisitions activity and new business initiatives. She was involved in a substantial value unlock for the shareholders of RMI/RMH through the unbundling of RMI/RMH interests in FirstRand, Discovery and Momentum Metropolitan, the sale of Hastings as well as the rebranding of RMI to OUTsurance and its subsequent listing on the JSE. Lisa is currently an Executive Director at Alphacode Holdings. Alphacode is responsible for the management and orderly disposal of the remaining fintech and asset management businesses of OUTsurance (formerly RMI) as well as raising and deploying third party funds to invest in fintech and related verticals in Africa. Christine Ramon Independent Non-executive Director Read more Christine is a seasoned finance executive with extensive board experience at large listed entities across industry sectors, including natural resources, media and entertainment, and energy and chemicals. Christine was the CFO of AngloGold Ashanti Limited from 2014 to 2022, where she also served as interim CEO from 1 September 2020 to 31 August 2021. She was the CFO of Sasol Limited from 2006 to 2013 and, prior to this, was the CEO of Johnnic Holdings. She also served as a Non-executive Director on the boards of MTN Group, Rand Refinery, Lafarge SA, Johnnic Communications, Transnet, the World Gold Council and the International Council on Mining and Metals and the International Federation of Accountants. In 2007, Christine was nominated as a Young Global Leader of the World Economic Forum. Christine currently serves as a member of the Presidential Council for State-Owned Enterprises. About us Our business Investor relations Sponsorships Sustainability Newsroom Careers at Discovery Privacy Legal & Disclosures Contact us Select company Medical aid Find an adviser Vitality Bank Car and home insurance Life Insurance Investments Provider administration Digital Support Discovery Green Corporate and Employee Benefits Gap Cover Prepaid Health View all contact details Unclaimed benefits Wills and Trust Get help faster with our Get Help service Chat to us on WhatsApp If you still can't find what you are looking for call: 0860 99 88 77 Operating hours: 07:00 - 20:00 Monday to Friday 08:00 - 13:00 Saturdays Closed on Sundays and public holidays Click here to find an adviser Chat to us on WhatsApp Vitality Help Call 0860 99 88 77 Monday to Friday: 07:00 - 18:00 Call 0800 07 96 97 24/7, 365 days a year Fraud or stolen card? Call 011 324 4444 24/7 Call 0860 751 751 Monday to Friday: 08:00 to 18:00 Saturday: 08:00 to 13:00 insureinfo@discovery.co.za Frequently asked questions Visit a Discovery Drive Centre Call 0860 00 54 33 Monday to Thursday: 08:00 to 17:00 Friday: 08:00 to 16:00 discoverylifeinfo@discovery.co.za Call 0860 67 57 77 Monday to Thursday: 08:00 to 17:00 Friday: 08:00 to 16:00 invest_support@discovery.co.za invest_complaints@discovery.co.za Frequently asked questions Call 0860 44 55 66 Monday to Friday 07:00 to 18:00 Closed on the weekend and public holidays healthpartnerinfo@discovery.co.za Call 0860 100 696 Operating hours: Monday to Friday: 07:00 - 18:00 webinfo@discovery.co.za Monday to Friday: 08:00 to 17:00 Closed weekends and public holidays support.DiscoveryGreen@discovery.co.za Frequently asked questions Group Risk: Call 0860 04 76 87 (general queries) 0860 54 33 22 (claims) Retirement Funds: Call 0860 22 29 99 Operating hours: 08:30 - 17:00 Monday - Wednesday 09:00 - 17:00 Thursday 08:30 - 16:00 Friday Call 0860 99 88 77 Gap Servicing 7:00 - 17:00 Monday - Friday Gap New Business 8:00 - 17:00 Monday - Friday Closed weekends and public holidays gapcover@discovery.co.za Call Prepaid Health on 0800 33 78 46 Prepaid Health 7:00 - 17:00 Monday - Friday Closed weekends and public holidays Prepaidhealth@discovery.co.za Contact us Click here 0860 101 255 Monday to Friday: 08:00 - 16:30 Willsandtrust_info@discovery.co.za Visit a Discovery Store Join Discovery Individuals Business Financial advisers Healthcare professionals Suppliers Connect with us Download our app Discovery Magazine Cookie policy Site Map Security & fraud Terms & conditions Copyright Discovery Ltd is the licensed controlling company of the designated Discovery Insurance Group. Registration number: 1999/007789/06. Companies in the Group are licensed insurers and authorised financial services providers. Join us Discovery Vitality Join us Discovery Vitality Log in Please click here to login Please click here to login into Discovery Digital Id Please click here to login into Discovery Digital Id close IFrame not supported by your browser version... × An IFRAME capable web browser is required to view this part of the site. Close An IFRAME capable web browser is required to view this part of the site. × loading... Close loading... × An IFRAME capable web browser is required to view this part of the site. Your session will expire in 60 seconds. To remain logged in, please click on the \"Extend session\" button below. Log out to start a new session or go to the home page . To secure your account you have been logged out Log in to start a new session or go to the home page . An IFRAME capable web browser is required to view this part of the site."
    },
    {
      "url": "https://discoverycove.com/orlando/help/guests-with-disabilities/",
      "text": "Guest with Disabilities Information | Discovery Cove Orlando Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Subtotal Plus taxes & fees Total savings of Checkout Book Now Are you sure you want to delete this item? Yes No Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Sign In Accessibility At Discovery Cove, we are committed to creating an environment where all guests feel welcome and accommodated, regardless of their abilities. Below, you will find details about our accessibility offerings and services for physical, visual, hearing, autism, sensory needs, as well as information regarding food allergies. If you have any additional questions about accessibility at Discovery Cove after reviewing the information on this page, please don’t hesitate to contact us. You can reach us by emailing [email protected] or by calling (407) 513-4600 . Alternatively, you may visit Guest Relations, located just inside Discovery Cove’s entrance on the day of your visit, to inquire. General Information Contact Information If you have any additional questions about accessibility at Discovery Cove after reviewing the information on this page, we’re here to help. Please feel free to email us at [email protected] , call us at (407) 513-4600 , or simply stop by Reception during your visit. Parking Accessible parking spaces are available in the parking lot near the park entrance, with many of those spaces accessible to vans. Guest Services Guest Services is conveniently located just inside the Park Entrance. Please feel free to visit Guest Services on the day of your visit if you have any questions regarding the services available. Wheelchair and Electric Convenience Vehicles (ECV’s) Guests may utilize their own wheelchairs or Electric Convenience Vehicles (ECV’s).  Guests are welcome join any line at Guest Services. Wheelchairs and ECV’s are also available for rental, based on availability, inside the park to the right of Guest Services. Reservations for Wheelchairs and ECV’s can be made by calling (407) 513-4600 . Guest who are able to maneuver themselves with limited assistance (or with the aid of a companion) during their dolphin experience and in the various wading locations. Discovery Cove also offers specially-designed outdoor wheelchairs with oversized tires for easy maneuvering on the beach. The wheelchairs are not self-maneuverable and guests will need assistance operating them. Segways Two-wheeled, self-balancing electric vehicles, such as Segways, are not permitted at Discovery Cove. We are pleased to offer alternative forms of personal transportation, including Electric Convenience Vehicles (ECV’s) and standard wheelchairs. Rollator Walkers Guests are permitted to use their own rollator walkers; however, they may not be used as a substitute for a wheelchair or Electric Convenience Vehicle (ECV). Please note that guests are not allowed to be pushed while seated in a rollator walker. Rollator Walkers are not available for rental. Accessible Restrooms All restrooms in the park are wheelchair accessible and are marked with a wheelchair symbol. Additionally, Discovery Cove has Family or Companion restrooms available in the following locations: Main Reception Lobby Near Blue Bamboo Bar Near Starfish Cabana Near Grand Reef Near Serenity Bay Laguna Grille First Aid First Aid is located near Laguna Grill and is staffed by Registered Nurses or Emergency Medical Technicians.  Please be aware that any Ambassador throughout the park can call for assistance on your behalf. Gift Shops All gift shops are wheelchair accessible. Please ask an Ambassador if you need any assistance. Restaurants Laguna Grill at Discovery Cove offers cafeteria-style service. Please refer to the Food Allergen Information on this page for more information on Discovery Cove's Allergy Friendly program prior to your visit. Food Policy No outside food, beverages, or coolers are allowed to be brought into Discovery Cove, with the exception of bottled water or refillable water bottles. Exceptions may be made for guests with special dietary needs, including food allergies and baby food/formula. Guest should contact [email protected] prior to their visit to request accommodations. Disability Services Available Contact Information If you have any additional questions about accessibility at Discovery Cove after reviewing the information on this page, we’re here to help. Please feel free to email us at [email protected] , call us at (407) 513-4600 , or simply stop by Reception during your visit. Service Animals Service Animals are welcome at Discovery Cove. Service Animals are limited to dogs and miniature horses only, that have been individually trained to do work or perform tasks for the benefit of an individual with a disability. Service Animals must always remain on a leash or harness and under the control of their handler. If at any time your service animal’s behavior is out of control, you will be asked to remove your service animal from the premises. Service Animals must be housebroken. Relief areas are marked on the park map. Service animals are not permitted in pools, rivers, or other water attractions and must remain at least 10 feet from the water’s edge. Emotional Support Animals are not permitted at Discovery Cove. Hearing Impaired Services Discovery Cove provides complimentary Qualified American Sign Language (ASL) interpreters upon request. To request an ASL Interpreter, please email us at [email protected] or call (407) 513-4600 . We kindly ask that you request this service at least 14 days prior to your visit. Visually Impaired Services Discovery Cove offers complimentary park guidance upon request. To request a guide, please email [email protected] or call (407) 513-4600 at least 14 days prior to your visit. If you do not receive a response within 7 days, we encourage you to follow up via email or phone. Guests who are blind or have limited/low vision must have someone—either a companion or an Ambassador—explain the ride or attraction and read the ride requirements and instructions prior to riding. Please note that Ambassadors are unable to ride attractions with guests while assisting as a companion or guide. Autism and Sensory Needs IBCCES Partner Discovery Cove has partnered with The International Board of Credentialing and Continuing Education Standards (IBCCES), a global leader in online training and certification programs, to become designated as a Certified Autism Center™ (CAC). It is our goal to provide every family with an enjoyable and memorable visit to Discovery Cove, and we are proud to offer specialized services to guests with autism and other special needs. Certified Staff Discovery Cove Ambassadors receive specialized training to ensure they have the requisite knowledge, skills, temperament, and expertise to cater to all guests, including those with special needs. Training focuses include: sensory awareness, motor skills, program development, social skills, communication, environment, and emotional awareness. IBCCES Sensory Guide The IBCCES Sensory Guide provides insight on how a guest with sensory processing issues may be affected by each sense for experiences at Discovery Cove. Quiet Space Guests in need of some quiet time and relief from sensory stimulation can utilize our Quiet Space located near our First Aid unit. This space is a low traffic and low noise area with seating for guests who need to take a break. Guests who would like to use the Quiet Space may do so on a first come first served basis. Discovery Cove has lots of open, clear space; this makes attractions and services more accessible and reduces “sensory overload” for guests with cognitive disorders like autism spectrum disorder (ASD). People with autism often experience hypersensitivity to touch, taste, sound, smell and sight. Discovery Cove is quite serene and relaxing, with opportunities for higher stimulus activities such as animal encounters and swimming. Discovery Cove provides a vast array of amenities, attractions and services (including dining options) to assist and engage guests with special/sensory needs. Food Allergen Information Contact Information If you have any additional questions about accessibility at Discovery Cove after reviewing the information on this page, we’re here to help. Please feel free to email us at [email protected] , call us at (407) 513-4600 , or simply stop by Reception during your visit. Food Allergen Information Discovery Cove offers cafeteria-style service with allergy-friendly options available at Laguna Grille. While Laguna Grille is not allergen-free, our team will take the utmost care to ensure that your meal is free from cross-contact.  Upon arriving at Laguna Grille, please proceed directly inside and request to speak with a supervisor to explain your allergen concerns in detail. The supervisor can answer your questions and ensure your meal is prepared without any cross-contact. What to Do Upon arriving at Laguna Grill please proceed to the Exit and ask to speak with a Supervisor or Chef in order to discuss the severity of your allergens and determine a meal that will be safe for you. Offering of Specialty Items Our Park offers several allergen friendly prepackaged items for your special dietary needs. Please contact [email protected] if you wish to address specific dietary needs. Cross Contact Not all of our meal facilities are free from cross contact. In order to ensure your meal is safe, please discuss the preparation process for your meal with the supervisor as you place your order to ensure no cross-contact takes place. Tips for a Safe Trip Follow these tips to allow us to best serve you and ensure a safe and great dining experience with us! Always ask for a supervisor upon arriving at a meal facility Visit meal facilities during non-peak hours or ahead of meal time so that you can be efficiently assisted and served Always ask about cross-contact potential Discovery Cove Orlando Help Accessibility at Discovery Cove Visit Us Packages and Pricing Purchase Upgrades Florida Resident Rates Hotel Packages Things to Do Resort Attractions Upgrade Experiences Fun for Kids Dining and Beverages SeaWorld and Aquatica Park Info Park Map Climate and Weather Directions to Discovery Cove Lost and Found Park Accessibility Frequently Asked Questions Our Mission Conservation Efforts Media Room Community Relations Partners Discovery Cove Blog About Us Orlando Parks Company Info Jobs Travel Advisors Contact Us (407) 513-4600 Contact Us © 2025 SeaWorld Parks & Entertainment, Inc. All Rights Reserved. Discovery Cove, 6000 Discovery Cove Way, Orlando, FL 32821 Privacy Policy Notice of Collection Terms and Conditions Do Not Sell or Share my Personal Information Cookie Preferences"
    },
    {
      "url": "https://www.quora.com/How-can-you-contact-Discovery-Cove-in-Orlando-Florida",
      "text": "How to contact Discovery Cove in Orlando, Florida - Quora Something went wrong. Wait a moment and try again. Try again Please enable Javascript and refresh the page to continue"
    },
    {
      "url": "https://discoverycove.com/orlando/help/reservation-reschedule/",
      "text": "Discovery Cove Reservation Reschedule Request Form | Discovery Cove Orlando Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Subtotal Plus taxes & fees Total savings of Checkout Book Now Are you sure you want to delete this item? Yes No Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Sign In Discovery Cove Reservation Reschedule Request Form Until further notice, Discovery Cove will be open Friday through Monday and a new available reservation date can be referenced using the calendar below . Your request will be reviewed by our Guest Relations Team and we will make every effort to respond within 5 business days with an answer on your request. However, response times can be affected due to the high volume of emails we receive each day. If you do have any changes outside of the original reservation products, please contact the Discovery Cove Call Center at 407-513-4600 to complete those changes. Discovery Cove Reservation Reschedule Request Form Until further notice, Discovery Cove will be open Friday through Monday and a new available reservation date can be referenced using the calendar below. Your request will be reviewed by our Guest Relations Team and we will make every effort to respond within 5 business days with an answer on your request. However, response times can be affected due to the high volume of emails we receive each day. If you have any changes outside of the original reservation products, please contact the Discovery Cove Call Center at 407-513-4600 to complete those changes. *Indicates Required Field *FIRST NAME *LAST NAME *EMAIL *ORDER NUMBER *ORIGINAL DATE OF VISIT: *NEW DATE OF VISIT (ONLY FRIDAY THRU MONDAY DATES AVAILABLE): SPECIAL REQUESTS / COMMENTS: Discovery Cove Orlando Help Reservation Reschedule Request Visit Us Packages and Pricing Purchase Upgrades Florida Resident Rates Hotel Packages Things to Do Resort Attractions Upgrade Experiences Fun for Kids Dining and Beverages SeaWorld and Aquatica Park Info Park Map Climate and Weather Directions to Discovery Cove Lost and Found Park Accessibility Frequently Asked Questions Our Mission Conservation Efforts Media Room Community Relations Partners Discovery Cove Blog About Us Orlando Parks Company Info Jobs Travel Advisors Contact Us (407) 513-4600 Contact Us © 2025 SeaWorld Parks & Entertainment, Inc. All Rights Reserved. Discovery Cove, 6000 Discovery Cove Way, Orlando, FL 32821 Privacy Policy Notice of Collection Terms and Conditions Do Not Sell or Share my Personal Information Cookie Preferences"
    },
    {
      "url": "https://bearsdenorlando.com/theme-parks/discovery-cove/",
      "text": "Discovery Cove Orlando – Near Bear’s Den Resort Orlando Skip to content Stay Special Offers Experiences Golf Groups & Weddings Local Area Blog 407-426-4861 407-426-4861 Book Now Resort Offers Stay More, Save More Dining Chef Experience/Mixology Catering Delivery Grocery Delivery Finns Restaurant Traditions Concierge Resort Information Services Transportation Attraction Tickets Equipment Rentals Activities & Events Tennis Pickleball Footgolf Miniature Golf Golf Cart Rentals Surrey Bike Rentals Upcoming Events Amenities Water Parks Golden Bear Park Fitness Center Spa Rentyl Resort Collection Luxury Golf Experiences & Amenities Private Golf Lessons Driving Range & Putting Greens Golf Pro Shop Photo Gallery Golf FAQ's Three Championship Golf Courses Jack Nicklaus Course Arnold Palmer Course Tom Watson Course Weddings Meetings Catering Request for Proposal Meeting & Event Venues Orlando Theme Parks Transportation Resort & Area Map © Discovery Cove Theme Parks SeaWorld Orlando Theme Parks Discovery Cove Discovery Cove © Discovery Cove Achieving relaxation and excitement in one day is easy at Discovery Cove thanks to its tropical resort pools. Swimming in Serenity Bay makes you feel like you are at the beach with the scenic palms and tropical setup, and visiting early gives you the chance to watch flamingos walk through the area. With Wind-Away River, you can ride the currents of a tropical river through a dense rain forest and an underwater cave before floating down the lazy river. Discovery Cove is just a 24-minute drive from the Bear’s Den resort. Animal Encounters If you are looking for ways to have fun with animals, Discovery Cove has you covered with the opportunity to meet dolphins with their animal care specialists. You can also feed different species of rays, as well as embark on tours involving anteaters, armadillos, kinkajou, sloths, and different types of birds. Discovery Cover also offers training sessions with blacktip, reef, nurse, zebra, and bonnethead sharks. © Discovery Cove SeaWorld® Orlando Theme Parks & Attractions SeaWorld Orlando Aquatica Discovery Cove No posts found Explore Orlando Area Theme Parks & Attractions Island H2O Water Park Walt Disney World® Resort Universal Orlando Resort SeaWorld Orlando Theme Parks Fun Spot America ICON Park LEGOLAND Florida Gatorland Sign Up & Receive Exclusive Offers First Name (Required) Last Name (Required) Email (Required) Contact Us FAQ Why Bear’s Den? Travel Agents Careers (Opens a new window) Buy a Membership Home Property Management (Opens a new window) Owner’s Portal (Opens a new window) Lost & Found (Opens a new window) Media (Opens a new window) 7750 Sandy Ridge Dr., Kissimmee, FL 34747 407-426-4861 [email protected] Facebook Instagram Linkedin Pinterest X (Twitter) X Leave us a review on Google (Opens a new window) and Facebook (Opens a new window) . © 2025 The Bear’s Den Resort Orlando. All rights reserved. Terms & Conditions Pet Policy Privacy Policy Accessibility Sitemap Just Released: New Luxury Homes Due to high demand, we’ve expanded our collection of exquisite residences — but they’re booking fast! Book Now New!"
    },
    {
      "url": "https://www.pacificdiscovery.org/contact-us/get-in-touch",
      "text": "Contact Us - Get in Touch | Pacific Discovery Programs Semesters New Zealand & Australia Polynesian Journey Australia & Bali South America Southeast Asia View All Mini Semesters Hawaii Thailand Costa Rica Australia Caribbean View All Summer Bali | 4 Week Hawaii | 2 Week Hawaii | 4 Week Australia | 4 Week New Zealand & Fiji | 4 Week View All Study Abroad New Zealand & Australia Polynesian Journey Australia & Bali South America Southeast Asia View All Why Choose Us Core Curriculum Program Design Accreditation Reviews Safety Ethical Travel Diversity & Inclusion Basecamp Take The Quiz Need To Know Scholarships & Financial Aid Program Availability Parents & Advisors Gap Year Guide Program Catalog College Credit Enrollment Process Eligibility Criteria Program Rules & Guidelines FAQs Blog Book a Call Book A Call Get In Touch Our Story About Us Ask Our Alumni Employment Login Apply Now Get In Touch You are welcome to email, call, or complete the form below. Phone: 1 877 636 2603 Address: 202 Glenda Drive, Frankton, Queenstown, New Zealand If you have questions or would simply like to have a chat about a program, please contact us. To join a program, please check availability then apply at any time through our online application. You can request a program-specific information booklet for the program you are interested in here . Pacific Discovery - New Zealand Headquarters Office hours: Mon - Fri, 8am - 5pm NZT Visit or send us mail 202 Glenda Drive Frankton Queenstown, 9349 New Zealand Call us US Tel: +1 877 636 2603 NZ Tel: +64 3 288 2527 Email us [email protected] Book a meeting with an Admissions Advisor Get in touch Please fill in the form below, we will respond as soon as possible. Book A Meeting With Our Admissions Team Want to learn more? Book a meeting with our Admissions team. Book A Meeting Who are Pacific Discovery? Pacific Discovery was founded in 2001 by directors Rachel Sanson and Scott Burnett with the express purpose of providing pivotal experiences for young people that would also have a positive impact on the world – life changing experiences that make the world a better place! In 2018 the reins were handed to another kiwi, Zach Johnston. Alongside continued input from Rachel and Scott, Zach’s varied educational and leadership experience made him the perfect person to continue the focus on authentic and inspiring international travel. What makes Pacific Discovery different? Pacific Discovery is a small organization and is very personable. Our team takes an active interest in each student’s journey with Pacific Discovery. We deliberately use an overseas adventure travel environment to maximize the educational and life-skills potential for our students. Our programs are made up of six different but interrelated components – experiential education, service projects, cultural immersion, international travel, adventure education, and personal and leadership development. We facilitate these program elements to maximize the educational opportunities making our programs so much more than a travel or traditional study abroad experience. Why should I choose Pacific Discovery? Our programs are meticulously researched and individually designed by our Program Directors. We continually refine our programs so that they are cutting-edge in the field of experiential education. Every program is a very special and unique experience. We work directly with each individual student and family to ensure programs are a good fit and help students gain as much as they can from their program experience. The Program Directors and a small team of dedicated staff are involved in every aspect of the programs – from answering phone and email inquiries to developing and running our programs. As a small educational travel organization, we are able to offer some of the most affordable Gap Year programs while maintaining integrity and excellence. If you want to travel with a small organization offering 'real' unsantized experiences; if you want to travel with a group of like-minded people who become family;  if you want your sides to hurt from laughing; if you want a program that's like a shot of adrenaline, snapping you into the present moment, engaging you, then holding your interest through a deliberate series of challenging and rewarding experiences, facilitated to enable learning and growth...then cool, join us! What accreditations does Pacific Discovery hold and why does this matter? We have undergone and maintain comprehensive accreditations with the  Gap Year Association (USA), Year Out Group (UK), and OutdoorsMark (NZ). We have chosen to go through a rigorous accreditation process with these bodies to ensure that Pacific Discovery has cutting edge ‘best practice’ policies in the gap-year and outdoor education fields and to assure the students and families we work with that we maintain the highest safety and program standards in the industry. Does Pacific Discovery have any religious affiliations? Pacific Discovery has no religious affiliations and has no bias for or against any religion. We embrace diversity and are happy to have students of any faith join our programs and will happily accommodate religious students so long as their observances do not adversely impact their group mates. How do I choose the right program? Each program varies in physical challenge, wilderness expeditions, and service-learning projects; however, they all are designed to push your comfort zones and facilitate a meaningful experience. If you are unsure of which program you want to participate in, contact us and we will help you to find the right fit. You can also check out our program specific itineraries for a day-to-day schedule of each program, or take our gap semester and summer program quiz . What age range is accepted? Our published age range is 17-22. We will also take participants up to 26 years of age if they are still a student or have recently graduated. In either case, we reserve the right to decline applicants outside the 17-22 age range and require those applying to contact us before registering. What is the minimum and maximum group size? Our minimum group size is 8 students and our maximum is either 12 or 14 (varies by program). Research into experiential education programs has found that the size of the group has a great deal of bearing on the success of the program. The ideal size being an interdependent peer group with between 7 - 15 participants. Do I have to be a student? Our programs are open to anyone, students and non-students, aged 17-22 years old. Anyone within this age range who meets our essential eligibility requirements may apply. Where do Pacific Discovery students come from? The majority of students come from North America (USA and Canada). Students regularly join us from Australia, Belgium, France, Germany, Ireland, The Netherlands, New Zealand, Spain, Switzerland and the United Kingdom. We have also had students from Bermuda, Brazil, China, Colombia, Costa Rica, Guatemala, Hong Kong, Japan, Latvia, Mexico,  Nigeria, Norway, Portugal, Puerto Rico, South Africa and South Korea. We enjoy having students from other countries and encourage you to join us. What is the gender ration on program? Our programs average 60% female students, 40% male students. Perhaps young women are more adventurous than men, or more organized? Regardless, we find that our programs have a fantastic group dynamic as our alumni attest . What is a typical day like? We have worked hard to design program itineraries which balances structured activities, travel, service-learning and free-time. Some days you will have time to explore villages, local markets, cities, and historical sites. Other days will be spent doing outdoor or wilderness activities such as white-water rafting, surfing or canyoning. What is expected of me? You are expected to join the program with a positive can-do attitude; an enthusiasm for a group experience (you need to work closely with your group mates); a willingness to step outside your comfort zone and be challenged, physically and mentally; and an open mind and desire for new experiences. You also need to abide by the program rules and behavior guidelines. What is the role of the instructors? The program instructor’s first priority is to manage the safety of our students. We have an impeccable safety record and our program instructors are thoroughly trained on how to utilize our comprehensive safety management system. The program instructors facilitate your program, provide mentorship and support, create space for reflection, coordinate logistics, answer questions, and help you learn as much as possible from your experience. To put it simply, they keep you safe, healthy, and guide you to have the best experience possible while on the program. Are all applications accepted? Not all applications are accepted, however by presenting our programs as accurately as possible, we attract students who know what they are getting into, who are willing to be challenged, and to work together as a group throughout the program. Once you submit your application, you will be emailed by Pacific Discovery and invited to arrange a phone/skype interview. Applicants with health/medical issues should contact us prior to application to check upon the suitability of the program. We will not accept applicants who require therapeutic services while in the field. If you apply for a program and you are not accepted, we will refund your deposit in full. What requirements are there? Our programs are open to anyone, students and non-students, aged 17-22 years old. 55% of students are taking a gap year; 35% are at university and 10% are recent graduates. Anyone who meets our essential eligibility requirements may apply. We will also take applicants up to 26 years of age if they are still a student or have just recently graduated. In either case, we reserve the right to decline applicants outside the 17-22 age range and require those applying to contact us before submitting an application. We fill programs on a first to apply basis. We believe in making our programs accessible to anyone. Therefore we have no minimum GPA requirements. Simply complete the application form and submit it with your deposit. Can I apply if I live outside of the USA? We enjoy having students from other countries and encourage you to join us. The majority of students come from North America (USA and Canada) and the UK and Europe. Students have joined us from Australia, Belgium, Bermuda, Brazil, Canada, China, Colombia, Costa Rica, England, France, Germany, Guatemala, Hong Kong, Ireland, Japan, Latvia, Mexico, The Netherlands, New Zealand, Nigeria, Norway, Portugal, Puerto Rico, Spain, South Africa, South Korea and Switzerland. If you do not live in the United States, you are still able to enrol in optional academic classes offered on our programs. What happens after I submit my application? We will contact you to schedule an application interview. This interview is to ensure that you have a good understanding of the program and to check that the program will be a good fit for you. This is also an opportunity to discuss any health concerns (allergies, physical or mental health conditions etc) you have and discuss how these can be managed during the program. After this interview you will be confirmed upon the program and given a log-in to the pre-departure information and checklist specific to your program. What if my first choice of program is not available? If your first choice is not available then we will contact you with a list of options which include: wait-listed for your top choice; confirmed on another program and wait-listed for your top choice; confirmed on another program without being wait-listed; refund your program deposit and cancel your application. What if I need to cancel or change programs? We understand that plans change… If you decide to cancel your participation in a program, the following fees apply at the time (prior to departure) we receive written notice of your cancellation: More than 91 days before departure – Full refund available excluding $1,500 deposit fee and $500 application fee 61 to 90 days before departure – forfeit 50% of program tuition 0 to 60 days before departure – forfeit 100% of program tuition If you fail to join the program, join after its departure or leave prior to its completion, no refund will be given. Students sent home early, or who choose to leave for any reason, including sickness, personal emergencies or injury, will be responsible for all medical costs, and travel costs related to their early departure. Will I like my group and will they like me? The group dynamic is a powerful aspect to the Pacific Discovery experience. Students are usually surprised by how fast the group bonds, how supportive it is, and how much they enjoy the shared group experience. That's not to say that group bonding magically happens. You should come on the program with an open mind and be prepared to work with and support others in your group. Group skills learnt on a Pacific Discovery program are invaluable throughout life, where you often have to work as part of a group whether it's in your workplace or community. What if we don’t get along? Our program instructors are skilled facilitators and if there are any issues within the group, your program instructors will address the issue immediately and work with the group until the problem is resolved. We find that our programs have a fantastic group dynamic, attested to by past students . How is it to travel in a group? Although traveling is often romanticized, the reality is that it can be bumpy, tiring, and difficult at times. These moments can be some of the most rewarding part of the experience; as your group navigates its unique challenges, you will learn to keep an open mind and come to form a tight-knit Pacific Discovery family. You will form deep friendships with every member of your group and by the end of your journey together, you will have developed invaluable personal, group, and leadership skills. Our programs are a shared group experience. We expect you to join the program with an open mind and a willingness to work together with your group mates to make the program an amazing experience for the whole group. Additionally, the program will be as much about the inner journey of personal growth and learning about yourself as it is about what you will experience in the outer physical journey. We expect you to be open to learning and challenging your ideas and assumptions. If you are interested in a party trip, an independent travel experience, or a relaxing holiday, then we are not the right program for you. How much free time is there? You will find that we strike a good balance between structured group activities and free time. We allow roughly one day a week as a free day. This is always in a town or city where you will have access to laundry, WiFi, etc. Can I join a program with a friend or my significant other? If you wish to be on the same group as a friend, just indicate this in the designated space on the application form. For group dynamics reasons, we prefer to have no more than two people who know each other in the same group, however this is not a hard and fast rule, and if you are wanting to join the program with a couple of friends, please contact us to discuss this. If you join a program with a friend, please note that rooming will run on a rotation system over the course of the program, so you will spend equal amounts of time with everyone in your group. Who are the Program Instructors? We are really proud of our Program Instructors. They are between 25-35 years old with an average age of 28. They come from a variety of backgrounds, but all have extensive international group leadership experience, a lot of experience and knowledge of the country/s they are leading in, and an ability to impart their knowledge to the group. Most importantly, they have the interpersonal skills to connect with every student and create a great group dynamic. They are organised, sensible, personable, and don't take unnecessary risks. What experience and qualifications do instructors have? Our program instructors have extensive experience in the region in which they lead. They have then gone through comprehensive in-house training. They are at an age that they have extensive life experience, yet they are not so old that they can’t relate to our students. All are between 25-35 with an average age of 29. All of the program instructors hold a minimum of a B.A. in areas such as teaching and outdoor education. We require all of our program instructors to have a current Wilderness First Responder qualification (WFR). New Zealand & Australia program instructors also hold a professional bus driver license. When should I apply? Spaces are limited to just 12-14 students per program group. To avoid missing out on a space, we encourage you to apply once you have read through the program information booklet, discussed the program with your family and adviser (if relevant), and are sure you are able to join the program. Places are allocated on a first to register basis, and our semester and summer programs usually fill 3-4 months before departure. However, at any time, you can check availability . How many instructors will be on my program? We have two program instructors per program who remain with the group for the duration of the program. Will I get to talk to my instructors before the program begins? Your program instructors will introduce themselves to you and your group mates around 1 month prior to program departure. You can then reach out to them to chat! What is a gap year? A gap year is an experiential semester or year which is can be taken either between high school and college, during college, or between college and your first job in order to deepen practical, professional, and personal awareness. A gap year can either entail a single summer or semester abroad, or it could include two full semesters overseas combined with work, internships, or volunteering. Can I do multiple programs? Absolutely. You can combine summer, fall, and spring programs to create a phenomenal gap year experience. Please contact us to discuss your interests so that we can help you plan your gap year with us. Alternatively, you can work with a gap year advisor to help you plan your perfect gap year. Can I travel, volunteer, study, or work abroad before or after my program? If you would like to volunteer, work, or study before or after a program, please discuss this with us. It is also quite common for students to choose to travel before or after the program. We do not arrange work, volunteer placements, or extended travel visas, but we can provide the necessary information that will help you organize this for yourself. Do universities support gap programs? As you already know, it can be very stressful and competitive when applying to colleges and universities. Research has shown that students who take a Gap Year before starting college are: More motivated and have a renewed interest to study [Birch, \"The Characteristics of Gap-Year Students and Their Tertiary Academic Outcomes\", Australia, 2007]. Confirm or discover their choice of academic major or career [Karl Haigler & Rae Nelson, The Gap Year Advantage, independent study of 300 Gap Year students between 1997 - 2006]. Likely to return to college; 90% of students who take a gap year during college return to school within a year [http://online.wsj.com]. Gain a better sense of self and are provided with additional skills and knowledge that contributes to their career and academic major [Haigler & Nelson, independent study of 280 Gap Year students]. Many Ivy League colleges such as Middlebury and Princeton now recognize the benefits and importance of taking a gap year, and encourage their applicants to do so before starting college. Many colleges will offer a semester or year deferment for those who plan to take a gap year. In short, colleges recognize the benefits and importance of taking a gap year.  Students arrive or return to their campus with renewed passion, focus, and stronger sense of self. What is Pacific Discovery's safety record? In all of our years of running programs (over 2,000 students and more than 100,000 student days in the field), we have an excellent safety record. Not one student has had to leave a program due to program-related illness or injury sustained on the program (we have had some students go home due to aggravating pre-existing conditions). We have had our safety management systems assessed and accredited by the US Gap Year Association, the UK's Year Out Group, and NZ's Outdoor Mark scheme. Are the locations we travel to safe? New Zealand and Australia are as safe as the United States for travel. Travel in the developing world is not as safe as in your own country. Access to good medical care is not as immediate and there is a higher level of risk from fire, the impact of natural disasters, and road accidents. We manage this increased level of risk with careful safety planning and excellent safety systems. How does Pacific Discovery assess political safety? We closely monitor developments in countries in which we run programs, and if we perceive an increase of risk in an area, we would not hesitate to re-route, curtail, postpone, or cancel the program. Our extensive and longstanding relationships with community partners supports us in keeping student safety and well-being at the forefront of our work. What sort of safety training do you offer to students? All students take part in a comprehensive orientation when they first arrive in-country. This covers how the program will run, cultural information, personal safety and health, and healthy group dynamics. We insist upon a few simple rules to ensure student safety on the program. For example, students are required to be with at least one other group member at all times and to always carry their program instructors' mobile phone number and travel insurance card on them. Throughout the program, students are then given region and activity-specific briefings and instruction prior to relevant experiences. What is Pacific Discovery’s drug and alcohol policy? Pacific Discovery has a no drugs policy that includes illegal drugs, narcotics, recreational use of prescription medications, and drugs that may not be illegal at home or in the host country, including tobacco, marijuana, and herbal highs. Consumption, purchase, or possession, of any of these will result in immediate dismissal. Recreational use of alcohol is not permitted on any grounds as it incurs high risk for student safety and is very disruptive for the group experience. Occasional social or cultural events are included in Pacific Discovery programs where participants, who are of legal age under local laws, may be permitted to consume a limited amount of alcohol in the presence of their instructors to help model safe and responsible attitudes and behaviors towards alcohol. Outside of these occasional events, consumption, purchase, or possession of alcohol is not permitted, and will result in immediate dismissal. What happens if I get sick or injured? Pacific Discovery has an umbrella medical and political evacuation insurance policy with AIG Asia Pacific for all group members. We require all students to have a comprehensive medical/travel insurance policy to cover them in the unlikely event that they need medical attention while abroad. If anyone on a program gets sick, there are good medical facilities and doctors in most towns and cities. Our instructors also have access to 24/7 medical advice through AIG Asia Pacific. We have a comprehensive safety plan in place for each program. Our program instructors carry a cellphone and have contact information for medical evacuation and medical facilities, as well as students' travel insurance details, on them at all times.  Our program instructors and entire team work with students to ensure their health needs are met. Can I communicate with the students while they’re on program? Students are allowed to bring their phones with the option to buy a SIM card in country. We advise against this to promote connection and to be present on their program, especially on summer programs for only 2-3 weeks. There will be opportunities for students to access wifi in certain locations on program, but at certain times students may be off the grid or unable to access wifi depending on location and their activity that day. Pacific Discovery will send departure and arrival emails to parents, along with weekly updates from their student’s program to ensure parents are aware that their student is happy and healthy. Can I contact alumni and families? We encourage you to contact program alumni or parents to hear unbiased first-hand experience of our programs. Please contact us and we will provide their contact details to you. Can you accommodate dietary preferences and food allergies? Yes, we regularly have participants who have dietary preferences (vegetarian, vegan etc) or food allergies on our programs. Please refer to the meals section of this travel information page for more information. What if I don’t speak the local language? Our programs don’t require any prior language experience. In Southeast Asia and Nepal/Tibet there is a lot of English spoken and we have great local guides who join us for big portions of the program where English is not spoken. We support you to learn the basics in each language, so that you can be polite and make an effort with local language, which helps break down cultural barriers and results in you being able to connect with locals. We also have local contacts who can assist with interpretation in the event of an incident occurring. In South America if you have some Spanish it is really useful but our program leaders are fluent Spanish speakers and we’ve had plenty of participants who have never taken Spanish language classes. Do I need prior experience in any of the activities offered? No prior experience is necessary. All activities and instruction are aimed at the novice level. However, for those experienced in particular skills, opportunities for challenge at their level are facilitated. We always have a range of students and abilities, from those who have never traveled, never swum in the ocean, never slept in a tent, never been on a day hike, to others who are experienced travelers or experienced in various outdoor pursuits. The diversity enriches the experience for all of us. Do I need to be really fit and active? There are no specific health or fitness requirements to participate in our programs. However, to maximize your enjoyment of the program, we suggest you begin a fitness program several months before departure. As a guideline, prior to the trip, at a minimum, you should be able to comfortably hike with a day-pack for up to four hours. What if I have physical or medical conditions? We will consider participants with existing physical and medical conditions. We have had participants join us with hearing impairment, diabetes, artificial limbs, epilepsy, ADHD, asthma, anxiety, depression etc. Please contact us about your condition and note the program you are interested in, so we can discuss the feasibility of your participation to ensure you will be able to manage the program. What if I have not travelled alone before? Our programs are a facilitated group experience and designed to accommodate those who have never traveled before. Most of our programs do not require previous travel experience and are intended to provide skills and experience to build each student's confidence and independence - learning the tao of travel. Can I trust a referral to Pacific Discovery? We do not pay commissions for referrals, so if you've received a referral from an advisor, you can be assured that they have done so because they believe the program could be a good fit for you. How do flights work? Flights are not included in the program cost, however, all in-program travel and transport is. Students on our high school summer programs have the option to meet their group and at least one instructor at a hub city airport to then fly to the program start location, or, families can purchase flights independently on their own or through our in house travel agent, The Travellist. You are responsible for coordinating and funding travel to and from the hub city. What is supervision like on high school programs? Our dedicated and experienced instructors will be with the group throughout the entire program. Students will be expected to abide by curfews set by their instructors and nightly check-ins will follow. Students are always expected to be in a buddy system with at least one other person during free time or activities where the group may be more dispersed, but instructors will always remain with the group. What is the accommodation like? We know that getting a good night’s sleep is critical when you have a busy schedule traveling the world. We ensure that all of the accommodations we utilize are comfortable, clean, and safe. Our groups do not share rooms with non-Pacific Discovery members and in many instances we book private accommodations. Whether you are staying on an exotic Chinese Junk boat in Halong Bay, Vietnam or you are staying at an outback farm in Australia, we ensure that you will be well looked after. Accommodation will vary from simple guesthouses with shared facilities to modern hotels with private bathrooms. Depending on the program, our groups also do homestays in rural villages, camp in stunning outdoor locations, and do multi-day backpacking excursions. Accommodations will be segregated based on gender throughout the entirety of high school programs. Laundry, postal, telephone, and email facilities will be available most days except while on expeditions. There will be times where you will be staying in an accommodation that is outside of your comfort zone such as a rural village homestay. We encourage you to embrace these new experiences with an open-mind and gratitude! Are Pacific Discovery programs non-smoking? Yes – we have a no-smoking policy for all of our programs. If you are a smoker, you will not be allowed to smoke while on a Pacific Discovery program. What are my options for college credit? Head to our college credit page for specific information regarding college course options. We offer options for both semester and summer programs. How many people typically take optional academic credit? Around 80% of participants come on our programs purely for the experience. There is no compulsion to take classes, though they are offered as an optional addition to the program to enhances the learning experience. How are classes structured? The classes are mostly self-directed and require motivation, maturity, and diligence on the part of the student to ensure their coursework is completed to a high standard and on time. Who can take credit? Students of any age, from any country, and any university can enroll in classes offered on the program. Gap year students often take credit even if they have not yet enrolled in university. However, it is your responsibility to check that credit for these classes will transfer to and be accepted by your university. You should discuss this with your academic adviser as they can better assist you with this process given the specific requirements of your university. Are credits transferable? Print off the class outlines and take these to your academic advisor and registrar. Classes offered should easily transfer into your degree as general elective requirements. Can I take credit through my own school? We have had a number of students design their own field studies/internship project with a professor at their own school. This enabled those students to retain their financial aid, and earn credit that is specifically relevant to their major course of study. This is up to you to organize, but we are happy to assist you to find information, set up meetings, etc. Will I have time on the program to do my schoolwork? Yes, there is sufficient down-time during the program for you to complete schoolwork requirements. Can I use my financial aid to pay for the credit or pay for the program? Financial aid is usually tied to your school, meaning you can only use financial aid to pay for credit from the school in which you are enrolled. We have had a number of students design their own field studies/internship project with a professor at their own school. This enabled those students to retain their financial aid and earn credit that is specifically relevant to their major course of study. This is up to you to organize, but we are happy to assist you to find information, set up meetings, etc. Where can I find pre-departure information after I apply for a program? We know that getting everything organized for your overseas experience can be overwhelming so we try to keep things as simple as possible for you. We have developed an online space specific for each program departure. When you are accepted into the program, you will be able to view all pre-departure information and requirements in your student portal. How will Pacific Discovery prepare me for the program? When we receive your application we will schedule an informal interview with you to discuss the program and to check that you are clear about what you are getting yourself into. Once accepted onto a program, you will be able to view all pre-departure information for your program through your student portal. This has a checklist of what you need to organize and has lots of handy information around flights, vaccinations, packing list, spending money, travel insurance, etc. Prior to program departure, we schedule another chat with you to discuss goals for your program experience and to answer any last minute questions you might have. Upon arrival in-country, you will be met at the airport by one of your program instructors and over the first days of the program, you will complete a comprehensive orientation that covers safety and cultural information, expectations, rules, and helps you get you comfortable with your group. Where do I meet my group? Each program has an arrival day. You will meet your group mates upon arrival in Auckland, Bangkok, Lima, Sydney, Hanoi, Quito, Delhi, Cairns, etc. Upon arrival, you will commence a comprehensive program orientation where you will quickly get to know your instructors and group mates. Do I need to bring everything on the packing list? Yes, it is on the packing list for a reason. If there is anything you don’t understand, please contact us for clarification. Should I bring extra casual clothes? The short answer is no, please stick to the packing list. If you have specific questions please contact us . Responsible travel is about minimizing your impact on the world. The more you keep your possessions to a minimum, the smaller your environmental footprint will be. Should I bring a phone or laptop on the program? Some gap year programs have a no-technology policy in place, however we find that this isn’t realistic in today’s connected society. We also find that using a WiFi-enabled device or cellphone is the easiest way to keep in contact with family during the program. We do, however, require all students to use their devices only during free-time in the evenings so that they can remain present and get the most out of their experience. Most students bring their phone to use as a camera and to keep in touch with friends and family over WiFi in the evenings that WiFi is available. Some students bring a laptop, particularly if they are taking credit - this is a personal choice. If bringing a laptop we recommend a protective/waterproof case. Some students have their phone set up for use abroad, our buy local SIM cards. What vaccinations do I need? Vaccinations requirements vary by program. Specific requirements are outlined in the program pre-departure info in the student log-in area. How do I manage my prescription medication during the program? You will take responsibility for caring for your medication and administering it to yourself for the duration of the program. If loss of your medication could cause problems, your program instructors can carry a backup supply. What are the rules and guidelines? We try to keep rules to a minimum. Those in place are there to help ensure your and your group mates' safety. Please refer to the program rules and guidelines . Do I really need travel insurance? It is really important that, in the unlikely event of illness or injury, you have access to good medical care. We require all students to have insurance that covers them for medical evacuation and treatment/care while abroad and provides coverage for all of the adventure activities on the program. Travel insurance covers this in addition to other benefits like cover for lost luggage, etc. How do I purchase my travel insurance? To make things easy for you, we have partnered with The Travellist Co. , a full service travel agency that can arrange everything from flights and pre/post trip accommodation to comprehensive travel insurance for our participants. Partnering with the most recognized, respected and trusted suppliers worldwide, The Travellist Co. can guide and advise you on all aspects of your travel experience. They have all the travel insurance requirements for our programs and offer 10+ years direct industry experience, enabling them to create and deliver independent and expertly cultivated journeys. Do I need a passport? Travel abroad requires a passport. If you don’t have one, you need to apply for one as soon as possible. To do so, please visit the US Government Passport website . If you already have a passport, it must be valid for more than 6 months after program end, otherwise you need to get a new one issued before joining the program. Please do this as soon as possible. Do I need to arrange my own visas? Visa requirements vary depending on the program. However, we typically organize all visa arrangements unless special circumstances exist (i.e. if you wanted to travel before or after the program). Once you apply for the program, you will be given the log-in details to your program's pre-departure page which will outline all visa notes and requirements. Are international flights included in the program tuition? International flights to and from the program are not included. We work closely with The Travellist Co . and suggest that you book your flights with them; they have all of the flight requirements for our programs and we will put you in touch with them when it comes time to purchase your international flights. Do you have group flights? We do not have group flights for a number of reasons: Group fares are no longer cheaper than regular fares, in fact they tend to be more expensive. We have students joining our programs from all over North America (and other countries) and group flights often don’t suit every family. Some families wish to use air miles. Some students wish to arrive earlier or depart later to travel independently before or after the program. Can I fly with others in my group? We work closely with The Travellist Co. and suggest that you book your flights with them, as they have all of the flight requirements for our programs and will do their best to get students from the same region on the same flights to/from the program. Can I use air-miles? Yes, absolutely. How much does it cost? We work hard to keep our programs affordable. Please visit our summer or semester program pages for program tuition costs, inclusions and additional expenses you have to budget for. How much spending money should I bring? A minimum amount would be $10-$15 per day for meals not included, laundry, Wi-Fi, snacks, etc. Of course if you buy souvenirs, do optional activities, or are not careful, it is possible to spend a lot more than this. Our instructors discuss budgeting and money-saving techniques during our program orientation. What is covered by the program tuition? The program cost includes all accommodation, all in-country transport (and depending on the program some in-program flights as well);  all meals; all expeditions, activities, excursions, entry fees and adventure travel as described in the itinerary; Service learning projects; Experiential core curriculum that pushes students to reflect and ask questions of themselves - working towards a deeper understanding of their values, identity, passions and purpose; Individual mentorship from program instructors, supporting you in your personal goals for the program; Informal lectures from resident experts on conservation, development, eco-tourism, ecology and sustainability; 1-3-week optional extension information if you wish to continue travelling independently after the program; Pre-departure web-page with all information you need in one place to prepare for the program;  Global medical rescue and political evacuation insurance; Instructors have 24/7 access to a physician and a psychologist, for advice and support; Pacific Discovery T-shirt, water bottle stickers and a buff; Online image library for your program It does not include flights to and from your program. Are there additional fees or costs? We keep things as simple and affordable as possible. The only additional fee you may incur is a $150 late fee for information or final payment submitted after the final deadline, however we work closely with each participant and family and can accommodate delays on a case-by-case basis. How do I pay? You pay a $500 application fee by credit card when you apply. To confirm your position, 50% of your program tuition will be due within 30 days of acceptance. Late payments will incur a $150 late fee. The final program payment is due on the following dates: Summer Programs = April 10th Fall Programs = June 20th Spring Programs = Nov 15th You can still apply for a program after these due dates! If you apply after the last payment date, full payment is due within 14 days of applying. There are 3 payment options provided: Credit Card, Mail in Check, or Wire Transfer What financial aid, scholarships and funding options are there? Pacific Discovery is delighted to announce that we now offer a limited number of scholarships every year. Please view our scholarships and financial aid page for more information about this. Additionally, through taking the optional credit, or arranging their own 'home school' credit in areas such as ‘internship' and ‘field studies' students have often been able to retain their 'home school' financial aid. Is tuition refunded if I become ill or I am dismissed from the program? Once you embark on a program, we have already paid for all activities, accommodation, travel, and staff for the duration of the program. If you have to leave the program early, you will not be refunded the program fee as these costs are non-recoverable. Can my family visit me during a program? We discourage families from visiting their daughter/son during our programs as this can be disruptive for the student, community, and group. Instead, we suggest that families meet their daughter/son once the program is finished. Can my family meet me at the end of a program? We are happy for students to meet their families once the program has finished. We can assist with coordinating dates and logistics to this end. Can I apply the community service hours to my school requirement? This is something that you will need to check with your school. We are happy to write you a letter before the program stating how many service hours and what sort of service work you will do so that you can get confirmation ahead of time. We can also write you an official letter stating the number of service hours you completed at the end of the program. What is the volunteer work / service-learning like? All of our programs have a volunteer/service project component. We really enjoy this aspect of our programs, and we work hard to ensure that the volunteer projects are well-structured and benefit both our partners and students. Volunteer projects are planned around the expressed needs of a range of community groups and non-governmental organizations (NGOs). Volunteer projects allow our students to really immerse themselves in a place and share an experience with local people, bridging the gap that often exists between visitor and host. The work itself typically involves physical labor including planting trees, painting, beach clean-ups, trail maintenance, etc. What will the transportation be like on the program? Programs are designed to maximize comfort and safety while also giving you the opportunity to experience local transport and take part in daily life. We utilize chartered transport for long distances (typically vans or a bus), reducing the length of travel and increasing safety. Then we use a variety of public transport for shorter distances within towns and cities. How do meals work on the program? Tasting different cuisines is a highlight of travelling and there are many opportunities on our programs to taste the best of what each region has to offer. Special dietary requirements and vegetarians can be accommodated. All meals are included in the program cost. On New Zealand and Australia programs, students self-cater most meals during the program. Meals will fresh, healthy, and varied.  Breakfasts include a choice of cereals, toast, fresh fruit, and coffee.  Lunches are usually sandwiches and wraps. Dinners are varied, from fresh salads and BBQ, to curries and stir-fry, to simple camping meals during expeditions. In Southeast Asia, Nepal & Tibet and South America meals will either be provided set-menu or buffet style, or you will eat out in cafés and restaurants where you can choose what to order. There will be a good mix of local and western meals. Special dietary requirements and vegetarians can be accommodated. Vegetarian or vegan – No problem, we will happily cater to your dietary needs. Food allergies – We are happy to work with students with food allergies. However, we cannot guarantee non-exposure to allergens and require students to be involved in menu-planning to ensure they are not inadvertently exposed to allergens. Picky eaters - It is easy to work with you if you don’t like tomatoes or don’t like cheese, but on occasion we have had students who basically only eat pizza, or don't eat vegetables, or only eat fried chicken the way their mom makes it. If you are one of these people, please be aware that you will need to step outside of your comfort zone and expand your diet while on our program. Paleo diets – If you are health conscious and eat a high protein diet without carbs and starches, please be aware that eating in this way is more expensive to cater for than a regular diet. Our program instructors have a meal budget they need to manage and you may be required to contribute to the additional costs for your meals. Will I have cell phone reception during the program and how do I set up my phone? This varies by program and is something you need to look into yourself. Will I have internet access during the program? During our programs you should be able to access free Wi-Fi at least once a week. Expect the Wi-Fi to be limited; there may not be enough bandwidth for Facetime or Skype calls. Instead, we recommend that you use a messaging app for the majority of communication with family and friends. Is there a 24/7 emergency contact? Before your program departs, we will send out our 24/7 free-call emergency contact number to students and families for the travel to program start. Once the program is underway, our phone will be answered during business hours and we regularly check voice mail and email outside of office hours and will get back to you promptly if there is an emergency. Once the program is underway, instructors have 24/7 access to PDHQ and 24/7 access to a medical doctor. How do I communicate with my family during the program? Our programs allow you to easily make contact with family and friends back home, however we do have guidelines around the use of technology to help you be as present and engaged as possible. There is WiFi available in most of our accommodation at times we are not on expeditions or service projects. You can go online during the evenings to catch up with friends and family. Outside of this time we expect you to only use your device to take pictures, so that you are present and engaged. How does rooming work? Rooming runs on a roster system and every time you stay in a new accommodation you'll have a new room-mate/s, so by the end of the program you'll have roomed with all the students in the group an equal number of nights. We find this roster system works really well to develop strong bonds and a healthy group dynamic. Rooming is mixed gender and we do a lot of set-up for this during Program Orientation around how to be a good room-mate - respect, privacy, boundaries. Students may request single-sex rooming assignments from instructors, if not comfortable rooming with the other sex. How do I carry money on the program? We recommend you bring 2 credit or debit cards (one as a back-up in case the first card is lost, stolen or eaten by an ATM machine). Cards can be used to withdraw cash in local currencies from ATM machines during the program. You don't need to buy any foreign currency before you leave home. Subscribe to our Newsletter Subscribe to our newsletter to gain access to our gap year guide. Talk To Us Have you got more questions or would you like to talk to us about a custom trip? [email protected] 1 877 636 2603 Get in Touch Program Terms & Conditions Home TESTIMONIALS ABOUT Privacy Policy © 2025 Pacific Discovery. Website by Tomahawk"
    },
    {
      "url": "https://discoverycove.com/orlando/contact-us/",
      "text": "Contact Us - Discovery Cove Phone & Address | Discovery Cove Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Subtotal Plus taxes & fees Total savings of Checkout Book Now Are you sure you want to delete this item? Yes No Book Now Book Now Florida Resident Offer Hotel Packages Upgrades Ultimate VIP Experience Military Discounts Private Events Gift Cards Buy Upgrades Cabanas Swim with Dolphins Animal Upgrades Ultimate Animal Experience Flamingo Mingle SeaVenture Premium Drink Package Ultimate VIP Experience Photo Package Add Parks Special Occasions Weddings All Upgrades Plan Your Visit About Discovery Cove Things to Know Park Map FAQs Directions Accessibility Download the App Park Policies Rainy Day Policy Paradise with Purpose Orlando Parks SeaWorld Aquatica Things To Do Included Experiences Swim with Dolphins The Grand Reef Explorer’s Aviary Serenity Bay Wind-Away River Freshwater Oasis Flamingo Point Dining Options Ultimate VIP Experience Ultimate Animal Experience Fun with Kids Animal Upgrades Sign In Discovery Cove Contact Information Questions?  Comments?  Contact us! Please send us your comments, suggestions and questions.  Your message will be reviewed by the appropriate department and we will make every effort to respond within 5 business days, however, response times can be affected due to the high volume of emails we receive each day. You can also find answers for commonly asked questions on our frequently asked questions page. *Indicates Required Field *FIRST NAME *LAST NAME ADDRESS CITY STATE ZIP / POSTAL CODE: *COUNTRY USA CANADA UNITED KINGDOM BRAZIL OTHER *EMAIL ADDRESS *PHONE NUMBER *MESSAGE SUBJECT TICKETS MILITARY TICKETS ANNUAL PASS ANNUAL PASS - EZPAY PASS MEMBER BENEFITS CABANAS ONLINE / TELEPHONE ORDERS ADA / DISABILITY / SPECIAL NEEDS ATTRACTIONS CHARITABLE DONATION REQUEST SPECIAL EVENTS FOOD & DINING MERCHANDISE PARTNER HOTELS LOST & FOUND PARKING & TRANSPORTATION GENERAL INFORMATION OTHER ORDER NUMBER *YOUR MESSAGE Discovery Cove Orlando Contact Us Visit Us Packages and Pricing Purchase Upgrades Florida Resident Rates Hotel Packages Things to Do Resort Attractions Upgrade Experiences Fun for Kids Dining and Beverages SeaWorld and Aquatica Park Info Park Map Climate and Weather Directions to Discovery Cove Lost and Found Park Accessibility Frequently Asked Questions Our Mission Conservation Efforts Media Room Community Relations Partners Discovery Cove Blog About Us Orlando Parks Company Info Jobs Travel Advisors Contact Us (407) 513-4600 Contact Us © 2025 SeaWorld Parks & Entertainment, Inc. All Rights Reserved. Discovery Cove, 6000 Discovery Cove Way, Orlando, FL 32821 Privacy Policy Notice of Collection Terms and Conditions Do Not Sell or Share my Personal Information Cookie Preferences"
    },
    {
      "url": "https://leadiq.com/c/discovery-cove/5a1d95b72300005b008465b0/employee-directory?page=5",
      "text": "Discovery Cove Employee Directory, Headcount & Staff | LeadIQ Learn more at LeadIQ.com Start free Discovery Cove Employee Directory Hospitals and Health Care United States 10001+ Employees Learn about working at Discovery Cove. Join LinkedIn today for free. See who you know at Discovery Cove, leverage your professional network, and get hired. Sign up for free to view info Company overview Email format Find Discovery Cove employees' phone numbers or email addresses Find Employee Discovery Cove Global Highlights Location Employees North America 234 United States Of America 233 Panama 1 Asia 3 Malaysia 1 Kuwait 1 India 1 Africa 1 South Africa 1 Europe 1 Italy 1 South America 1 Brazil 1 Discovery Cove 's Leadership C. O. Vice President Of Marketing Mobile Phone Email S. W. Gm Owner Mobile Phone Email T. R. Owner Mobile Phone Email L. L. VP, NSM Mobile Phone Email K. N. Aviculturist Mobile Phone Email G. G. Early Childhood Director Mobile Phone Email D. E. Manager Of Zoological Mobile Phone Email G. D. Zoological Leader Mobile Phone Email Contact profiles from Discovery Cove Name Title Contact Info Location Last Update A. R. Guest Services Associate Mobile Phone Email United States Florida Mar 05, 2024 A. V. Diver Mobile Phone Email Apr 23, 2025 A. P. Videographer Mobile Phone Email United States North Carolina Jul 31, 2025 A. R. Lifeguard Mobile Phone Email Oct 23, 2024 A. R. Lifeguard Mobile Phone Email Oct 17, 2024 A. A. N. Associate Aquarist Mobile Phone Email United States Florida Oct 22, 2024 A. A. Guest Services Mobile Phone Email Apr 24, 2025 B. T. Business Analyst Mobile Phone Email United States Tennessee Oct 21, 2024 B. G. Sales Associate Mobile Phone Email Apr 24, 2025 B. J. Photographer Mobile Phone Email Apr 25, 2025 < Prev 1 â¦ 3 4 5 Frequently Asked Questions What is Discovery Cove known for? Discovery Cove operates in the Hospitals and Health Care industry . The company's main headquarters is located in US ; you can contact the main corporate office by phone at +1-877-557-**** . Explore Discovery Cove 's company overview page for more information. What is Discovery Cove 's most common email format? Discovery Cove employees' email format typically follows the pattern of . Trying to find reliable and up-to-date employee contact data? Find more Discovery Cove email formats with LeadIQ. How many employees does Discovery Cove have currently? Discovery Cove has approximately 10K employees as of August 2025 . These team members are located across 5 continents, including North America Asia Africa . Who are Discovery Cove 's key employees and leadership? As of August 2025 , Discovery Cove 's key employees include: Vice President Of Marketing: C. O. Gm Owner: S. W. Owner: T. R. VP, NSM: L. L. Aviculturist: K. N. Looking for contact data? Unlock accurate emails and phone numbers for your ideal prospects with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    }
  ]
}