{
  "fuentes": [
    {
      "url": "https://www.dixiecountychamber.org/about-us",
      "email": "info@dixiechamber.org"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "22chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.queenschamber.org/",
      "email": "bizdev@queenschamber.org"
    },
    {
      "url": "https://www.queenschamber.org/",
      "email": "glueup-logo-white@2x.png"
    },
    {
      "url": "https://chamber.nyc/contactus",
      "email": "info@chamber.nyc"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.cornwallchamber.com/contact",
      "email": "info@cornwallchamber.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/",
      "email": "info@dixiechamber.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/",
      "email": "info@dixiecountychamber.org"
    },
    {
      "url": "https://www.champaigncounty.org/",
      "email": "info@champaigncounty.org"
    },
    {
      "url": "https://jaspersc.org/contact-us/",
      "email": "jasperchamber@jaspersc.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "brittany@hellzapoppin.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "jesse@meridianpursuit.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "allaboutairandheat@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "andrew@naturecoastinsurance.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "baggott.lorilee@ccbg.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "bryanco@bellsouth.net"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "cbellot@3riverslibrary.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "ccowart@radiantcu.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "citymanager@townofcrosscity.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "cmckwest@bellsouth.net"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "dalekight65@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "daniel.collins@duke-energy.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "debbie.dembo@amerisbank.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "dixieappliance@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "dixiegirl_85@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "dlilesace@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "editor@dixiecountyadvocate.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "info@careersourceflcrown.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "info@dixiechamber.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "j-cneal@live.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "j.weingart@oldtownupholstery.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "jason.banks@resolutefp.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "john@locklearconsulting.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "koons@ncfrpc.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "koons@www.ncfrpc.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "kvanaernam@dcadc.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "lgstoddard@bellsouth.net"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "lhudson@anotherwayinc.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "lovelacera@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "manderson@quitdoc.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "mcannon@dixiecountytax.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "paddlepaws00@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "padixie@bellsouth.net"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "president@fgc.edu"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "rick@couchfamilyrv.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "russffp@bellsouth.net"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "sfrierson@dcadc.org"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "steve.smith3@edwardjones.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "twosweetsdonutshop@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "upthelimitfishingadv@yahoo.com"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "email": "virginia@sanchezfarms.net"
    },
    {
      "url": "https://www.shelbycountykychamber.com/board-of-directors/",
      "email": "chase@myagentchase.com"
    },
    {
      "url": "https://www.shelbycountykychamber.com/board-of-directors/",
      "email": "troy@shelbyvillekentucky.com"
    },
    {
      "url": "https://www.shelbycountykychamber.com/board-of-directors/",
      "email": "info@shelbycountykychamber.com"
    },
    {
      "url": "https://www.shelbycountykychamber.com/board-of-directors/",
      "email": "store3325@theupsstore.com"
    }
  ],
  "mails": [
    "22chamber@lexingtonchamber.net",
    "allaboutairandheat@yahoo.com",
    "andrew@naturecoastinsurance.com",
    "baggott.lorilee@ccbg.com",
    "bizdev@queenschamber.org",
    "brittany@hellzapoppin.com",
    "bryanco@bellsouth.net",
    "cbellot@3riverslibrary.com",
    "ccowart@radiantcu.org",
    "chamber@lexingtonchamber.net",
    "chase@myagentchase.com",
    "citymanager@townofcrosscity.com",
    "cmckwest@bellsouth.net",
    "dalekight65@yahoo.com",
    "daniel.collins@duke-energy.com",
    "debbie.dembo@amerisbank.com",
    "dixieappliance@yahoo.com",
    "dixiegirl_85@yahoo.com",
    "dlilesace@yahoo.com",
    "editor@dixiecountyadvocate.com",
    "gabe@journeysherwood.org",
    "glueup-logo-white@2x.png",
    "info@careersourceflcrown.com",
    "info@chamber.nyc",
    "info@champaigncounty.org",
    "info@cornwallchamber.com",
    "info@dixiechamber.org",
    "info@dixiecountychamber.org",
    "info@journeysherwood.org",
    "info@shelbycountykychamber.com",
    "j-cneal@live.com",
    "j.weingart@oldtownupholstery.com",
    "jason.banks@resolutefp.com",
    "jasperchamber@jaspersc.org",
    "jesse@meridianpursuit.com",
    "john@locklearconsulting.com",
    "koons@ncfrpc.org",
    "koons@www.ncfrpc.org",
    "kvanaernam@dcadc.com",
    "leadershipboard@journeysherwood.org",
    "lgstoddard@bellsouth.net",
    "lhudson@anotherwayinc.org",
    "lovelacera@yahoo.com",
    "manderson@quitdoc.com",
    "mcannon@dixiecountytax.com",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "paddlepaws00@yahoo.com",
    "padixie@bellsouth.net",
    "president@fgc.edu",
    "rick@couchfamilyrv.com",
    "russffp@bellsouth.net",
    "scott@journeysherwood.org",
    "sfrierson@dcadc.org",
    "steve.smith3@edwardjones.com",
    "store3325@theupsstore.com",
    "troy@shelbyvillekentucky.com",
    "twosweetsdonutshop@yahoo.com",
    "upthelimitfishingadv@yahoo.com",
    "virginia@sanchezfarms.net"
  ],
  "nombre_sitio": "dixiecountychamber.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dixiecountychamber.org/about-us",
      "text": "About Home Business Directory Contact Events Activities About Us Explore our County JOIN CONTACT Home Business Directory Events Explore Our County About Us Contact JOIN Why Join Dixie County Chamber of Commerce? About us Dixie Chamber of Commerce is a dedicated group of local businesses and individuals, along with a few businesses from outside our borders that are engaged in commerce or offering services in Dixie County. Together, we strive to support and promote businesses within our community, with a focus on advancing local commerce and fostering team building and leadership development through collaborative local projects. We convene every second Thursday of the month at noon to synchronize membership activities. We extend invitations to guest speakers who can offer valuable insights or seek our support for significant community improvement projects. Members share updates on their committee work and highlight opportunities for promoting their individual businesses through participation in specific activities or projects. Our diverse membership includes young entrepreneurs and seasoned business leaders, fostering a wealth of experience and perspectives. We've found that the best practices are often shared when members collaborate on events such as business expos, festivals, airport fly-ins, or broader economic development initiatives. By joining forces with other community groups, members have the opportunity to learn and share skills while also having fun, bringing impactful ideas to life. We actively support various youth-centered activities, including scholarships, livestock fairs, and initiatives to combat tobacco use. The current Membership Form is available on our website or by calling 352-498-5572. We hope that you will consider joining us in our efforts to promote commerce and enhance our community, ensuring that Dixie County remains a wonderful place to live, work, and play. Join Board of Directors Every member of our board of directors is a thought leader who has made significant contributions to our society. Officers Melanie Anderson Vice-President Debbie Deweese President Christy Roberts Secretary Debbie Dembo Treasurer Tina Keen Director Sheila Frierson Director Beverly Pivacek Director Debbie Deweese Director John Cherry Director Rebecca Fusco Director Debbie Dembo Director Cindy Bellot Director Melanie Anderson Director Andrew Rains Director Jason Banks Director Anne Hodges Director Steve Smith Director Dr. Linda Stoddard Director Barbie Higginbotham Director Christy Roberts Director ﻿ Home Business Directory About Us Contact CONTACT PO BOX 547 ﻿ Cross City, FL 32628 ( 352) 498-5572 info@dixiechamber.org JOIN Share by:"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "text": "Contact Us - Lexington Area Chamber of Commerce Skip to content Home Member Directory Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Expand Employment Opportunities Special Deals Portraits of Davidson County Events Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Search Toggle Menu Search Contact Us Your questions and concerns are important to us, and we want to answer any questions you may have. However, the high volume of messages we receive can make it difficult for us to respond to every one promptly. If you sent us a message/question and haven’t heard back within a week, please call us at 336-248-5929 . Location: 507 East Center Street., Lexington, NC 27292 Contact Information: PH: 336-248-5929 Mail: Lexington Area Chamber of Commerce P.O. Drawer C, Lexington, NC 27293 Follow Us Facebook LinkedIn Contact Us \" * \" indicates required fields Δ Today's Date * MM slash DD slash YYYY Name * First Last Email * Enter Email Confirm Email Main Contact Number * Organization * If not an organization or business, please put N/A. Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Comments * Please let us know what's on your mind. Have a question for us? Ask away. About The Chamber Community Resources Member Directory Join The Chamber Contact Us Get In Touch! PH: 336-248-5929 chamber@lexingtonchamber.net 507 East Center St. Lexington, NC 27292 Facebook LinkedIn Instagram © 2025 Lexington Area Chamber of Commerce - WordPress Theme by Kadence WP Scroll to top Scroll to top Home Member Directory Toggle child menu Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Toggle child menu Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Toggle child menu Expand Employment Opportunities Special Deals Portraits of Davidson County Events Toggle child menu Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://www.queenschamber.org/",
      "text": "Queens Chamber of Commerce Skip to main content Register Login Call us: 718-898-8500 Search Search Enter the terms you wish to search for. About Message from President About the Chamber Team Affiliates and Partners Membership Join The Chamber Digital Directory Member Committees Member Affinity Benefits Jobs Events Chamber Events Member Events Webinars Gallery Media Gallery BENEFITS AI Tools TIQ This is Queensborough Magazine Submissions Press Press Kit and Releases Contact Contact JOIN NOW Login Register About Message from President About the Chamber Team Affiliates and Partners Membership Join The Chamber Digital Directory Member Committees Member Affinity Benefits Jobs Events Chamber Events Member Events Webinars Gallery Media Gallery BENEFITS AI Tools TIQ This is Queensborough Magazine Submissions Press Press Kit and Releases Contact Contact About Message from President About the Chamber Team Affiliates and Partners Membership Join The Chamber Digital Directory Member Committees Member Affinity Benefits Jobs Events Chamber Events Member Events Webinars Gallery Media Gallery BENEFITS AI Tools TIQ This is Queensborough Magazine Submissions Press Press Kit and Releases Contact Contact Join the Chamber! Educate. Advocate. Network. Join us today! Next Stop Queens Welcome to the BOOM BOROUGH! Learn more Queens Tech Council The Queens Tech Council is committed to creating a diverse, inclusive, thriving, and self-sustaining tech economy in Queens, New York. Learn More today! This is Queensborough Read our latest issue of This is Queensborough! Visit our Digital Copy --> Previous Next Join the Chamber! 01 Next Stop Queens 02 Queens Tech Council 03 This is Queensborough 04 Previous Next Upcoming Events See All Events 15 Sep 2025 | 10:00 AM - 09:00 PM Garden City Country Club ... Queens Chamber of Commerce & QCC Foundation Annual Golf Outing and Dinner 2025 Queens Chamber of Commerce Annual Golf Outing and Dinner\nhttps://queenschamber.glueup.com/event/queens-chamber-qcc-foundation-annual-golf-outing-and-dinner-80159/home.html 17 Sep 2025 | 10:00 AM - 11:00 AM Queens Chamber of Commerce ... New Member Orientation Orientation designed to introduce new members to fellow new members, staff, and overview of benefits to get the most out of Chamber membership. 17 Sep 2025 | 05:00 PM - 08:00 PM Greater Nexus ... A night with the NYC DOB – Local Law Compliance Stay ahead on NYC Local Laws! Join NYC DOB officials & industry experts for insights on LL11, LL126, parapet walls & more. Network, learn, and stay compliant. LinkedIn Follow Us On LinkedIn Instagram Follow us on Instagram! Facebook Follow us on Facebook! Previous Next LinkedIn Follow Us On LinkedIn Instagram Follow us on Instagram! Facebook Follow us on Facebook! Previous Next Join the Chamber Committed to Building a Strong and Innovative Community Join the chamber Latest News See All News Community Ridgewood and Sunnyside among best cyclist… The Queens neighborhoods of Ridgewood and Sunnyside were included among StreetEasy’s list of… 08/31/2023 Community Queensborough Community College celebrates… Queensborough Community College (QCC) celebrated the opening of its new Queensborough Male… 08/30/2023 Community Woodhaven BID back-to-school event offers free… The Woodhaven Business Improvement District back-to-school event was well supported by Queens… 08/25/2023 Community Queens BP Richards presents Elmhurst Hospital… Queens Borough President Donovan Richards presented representatives of Elmhurst Hospital with… 08/22/2023 All News Stay Up to date Please enter a valid email Sign Up Major Corporate Sponsors Previous Next Subscribe to our TIQ Magazine Sign Up Navigate History & Mission Join the Chamber Events News & Media Jobs Contact Us Connect With Us Contact Information Queens Chamber of Commerce The Bulova Building 75-20 Astoria Blvd. Suite 140 Jackson Heights, NY 11370 Phone: 718-898-8500 Email: bizdev@queenschamber.org Powered by"
    },
    {
      "url": "https://chamber.nyc/contactus",
      "text": "Contact Us | Greater New York Chamber of Commerce JOIN CHAMBER Home Membership Become a Member Member Benefits Member Directory Monthly Member Highlights Events Chamber TV News Export Documentation Business Resources Assistance Programs Chamber Legal Center Connect With Us Contact Us About US Tourism Receive Chamber's E Mails Greater New York Chamber of Commerce 212-CHAMBER Join Chamber Spotlight Event - September 26, 2025 Annual Business Expo at the Marriott Marquis - Times Square 9:00 am - 4:00 pm, Friday View Event JOIN CHAMBER Home Membership Become a Member Member Benefits Member Directory Monthly Member Highlights Events Chamber TV News Export Documentation Business Resources Assistance Programs Chamber Legal Center Connect With Us Contact Us About US Tourism Receive Chamber's E Mails Contact The Greater New York Chamber of Commerce Questions? Email Us To contact the Greater New York Chamber of Commerce please email info@chamber.nyc Greater New York Chamber of Commerce 20 W. 44th Street, 4th Floor NY, NY  10036 Telephone: 212-686-7220 212-CHAMBER Email: info@chamber.nyc Contact us Sign up for Chamber's Emails Subscribe Join the Chamber News Events Member Benefits Chamber TV Business Directory Member Monthly Profiles Business Resources © 2024, Greater New York Chamber of Commerce Privacy Policy"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.cornwallchamber.com/contact",
      "text": "Get in Touch | Contact | Cornwall and Area Chamber of Commerce Looking to pay your invoice? Click here > About Events News Resources Sponsorship Partners Ribbon Cuttings Chambers Plan HR Covered Directory Contact Log out Become a Member > Become A Member Have a question or just want to say Hello? Feel free to reach out to us! You can contact us by phone, email or the contact form. We are available and happy to help you! Our business hours are 8:00 AM to 4:00 PM, Monday to Thursday; Closed on Friday's. We're here to help! Simply fill in the form below, and we'll respond within 1-2 business days! Inquiring about... Membership Events Grants & Financial Support Advertising Sponsorships Other Thank you! Your submission has been received! Something went wrong. Please try again. Here's where you can reach us 16 Second Street West, Cornwall, ON K6J 1G2 (613) 933-4004 info@cornwallchamber.com FREQUENTLY Asked Questions How much does a membership cost? The price ranges depending on your business type and the number of employees you have. For a full breakdown, visit our Become a Member page for more details! How can I join? Visit our Become a Member page and sign up at the bottom of the page. We'd love to have you join! How do I pay an invoice? Payment can be made via EFT, cheque, or e-transfer to bero@cornwallchamber.com. Click here for more information. How is the Chamber funded? We are a Non-Profit Organization run by Volunteer Board Members, with our funding coming from Events, Membership Fees, and Sponsorship Revenue. We are not government funded. Why should I become a member? The Cornwall and Area Chamber of Commerce is the voice for our local businesses. We advocate for our members, provide new opportunities, and connect you with the community! Learn more about how we support you here > What are the member benefits? Members can access exclusive offers like discounted insurance policies and shipping, group medical plans, grant opportunities, and more. We also give your business opportunities to grow with our member directory, newsletters, sponsorships, and more! Learn about all the details here > How do I register for the benefits? Some benefits require a code you'll receive once you sign up, and others will automatically apply for being a Chamber member. What is Pub Night? When is the next one? Pub Nights are a monthly networking event hosted by the Cornwall and Area Chamber of Commerce. Each Pub Night is held at a different business (i.e. Schnitzels, Boston Pizza, etc.) Check out our Events page to see when the next Pub Night takes place! Where can I find Government Grants? Government Grants will be posted here on our website and sent to your inbox through our Chamber Newsletters as they become available. Join the Cornwall & Area Chamber of commerce Benefit from all the resources available to help your business thrive, join us at networking events, and more. Become a member Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events 16 Second St W, Cornwall, ON K6J 1G2 (613) 933 - 4004 info@cornwallchamber.com Find what you're looking for: Home About *NEW* Billboard Events & Sponsorships Contact Become a Member Member Directory News Careers Partners Pivot Points FAQ Grants & Financial Support Chamber Members View Account Sign Up Log In Reset Password Purchase a Membership Pay An Invoice Â© All rights reserved by the Cornwall and Area Chamber of Commerce"
    },
    {
      "url": "https://www.dixiecountychamber.org/",
      "text": "Dixie County Chamber of Commerce Home Business Directory Contact Events Activities About Us Explore our County JOIN CONTACT Home Business Directory Events Explore Our County About Us Contact JOIN Expand Your Community By Becoming a Part of Ours LEARN MORE JOIN NOW About Us The Dixie Chamber of Commerce is an all-volunteer organization of local businesses and individuals, and a few businesses outside our borders doing commerce or providing services in Dixie County. We collectively advocate for the businesses within our community, with the goal of furthering local commerce and team building and leadership development by working on local projects. READ MORE Hero Flag Form (Click to download form) Become a Member (Click to download form) Our Focus Connection The chamber of commerce is dedicated to the development of teamwork and leadership skills. Growth We aim to enhance trade and foster the growth of local businesses in our community. Community Growing commerce requires the support of a whole community. With a strong community in place, anything is possible. Featured Member Dixie Appliance Co Cross City, Florida Visit Website Activities Suwannee River Button Steinhatchee River Button Town of Suwannee Button Shired Island Button Horseshoe Beach Button Jena-Steinhatchee Button Upcoming Events September 2025 Sun Mon Tue Wed Thu Fri Sat 31 1 2 3 4 5 6 7 8 9 10 11 12pm Dixie County Chamber of Commerce Meeting 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Home Business Directory About Us Contact CONTACT PO BOX 547 ﻿ Cross City, FL 32628 ( 352) 498-5572 info@dixiechamber.org JOIN Share by:"
    },
    {
      "url": "https://www.champaigncounty.org/",
      "text": "Home - Champaign County Chamber of Commerce - IL Skip to content Join Login Explore Champaign County Calendar Facebook Twitter Instagram LinkedIn Menu Directory Members Chamber Store Committees Energy Cooperative Fisher Area Business Association (FABA) Health Insurance Plan Member Benefits Member Deals Member Login Top Investors About About Us Board of Directors Chamber Foundation Chamber Staff Contact Us Join Us Explore Champaign County Champaign Fisher Mahomet Rantoul Savoy St. Joseph Tolono Urbana Advocacy Champaign County First Business Empowered PAC National Civics Bee® News/Events Events Calendar News Publications Photo Gallery Shop Campaign County Gift Card Talent Development Available Sites Business Counseling Services iRead • iCount® Job Bank LEAD Champaign County Microloan Program Procurement Resources Tools for Business Talent Development Welcome to the Champaign County Chamber of Commerce The Champaign County Chamber of Commerce leads in economic, community, talent and member development. We are a member focused business association that facilitates growth and improves the quality of life in the region. Directory Jobs News Events Hot Deals Mark Your Calendar View all events Learn More Shop Champaign County Gift Card Program Shoppers can use the new Shop Champaign County gift card at any local business that accepts Mastercard, and there are no hoops for retailers, restaurants, or the card owner to jump through to keep the money locally. Learn More Champaign County Business Empowered PAC The Champaign County Business Empowered Political Action Committee (PAC), a subsidiary corporation of the Chamber, endorses and supports business-friendly candidates for state and local office. Learn More iRead • iCount iRead • iCount is a literacy and math program to close achievement gaps. We need your help to be part of the solution to overcome these issues. This initiative will tremendously impact the lives of the students served and the community as a whole. Learn More Become a Member Membership in the Champaign County Chamber of Commerce is a key economic development tool for businesses, offering you resources that can help your company to better succeed. As the voice of the business community, the Chamber helps to shape the business climate in Champaign County. Becoming a member of the Champaign County Chamber of Commerce, the area’s premiere business association, allows you to: Save Money Improve Skills Networking Marketing Resources Join Today Top Investors © 2025 Champaign County Chamber of Commerce – IL | Site by GrowthZone Building Business. Building Community. Champaign County Chamber of Commerce map and address 303 W. Kirby Ave., Champaign, IL 61820 phone number 217. 359.1791 email info@champaigncounty.org Facebook Twitter instagram Linked In © 2025 Champaign County Chamber of Commerce - IL. All Rights Reserved | Site by GrowthZone"
    },
    {
      "url": "https://jaspersc.org/contact-us/",
      "text": "CONTACT US | Jasper County Chamber of Commerce | South Carolina Facebook Twitter Instagram Join | Calendar | News | Farmers Market | Contact HOME DISCOVER JASPER SC DISCOVER JASPER COUNTY ► Discover Jasper County ► History ► Relocation Information ► Fast Facts ► Points of Interest ► Neighbors RIDGELAND HARDEEVILLE CHAMBER MEMBERSHIP MEMBER DIRECTORY ABOUT DIRECTIONS BOARD OF DIRECTORS CHAMBER STAFF BLOG CONTACT US CONTACT US webheadsjasper 2021-11-16T16:57:32-05:00 CONTACT THE JASPER COUNTY CHAMBER OF COMMERCE To contact the Jasper County Chamber of Commerce, please feel free to fill in the form below and we’ll get back to you as soon as we can…or please call us at 843-726-8126. Name (required) Your Email (required) Address City State Zip Phone Who referred you to the Chamber? Join the Chamber JASPER COUNTY CHAMBER 403 Russell Street | PO Box 1267 Ridgeland, SC 29936 (843) 726-8126 or 205 Main Street (inside City Hall) Hardeeville, SC 29927 (843) 226-2607 jasperchamber@jaspersc.org LATEST NEWS Uncover the Charms of Jasper County:  Relocating to Hardeeville or Ridgeland, SC March 3, 2025 Romantic Getaway in Jasper County, South Carolina February 5, 2025 7 Small Business Tips for the New Year:  Insights from Your Jasper County Chamber of Commerce January 10, 2025 3 Festive Events & Other Ways to Kick Off the Holidays in Jasper County December 1, 2024 A Guys’ Getaway in Jasper County, South Carolina November 10, 2024 JASPER COUNTY CHAMBER 403 Russell Street Ridgeland, SC 29936 843-726-8126 or 205 Main Street (inside City Hall) Hardeeville, SC 29927 843-226-2607 LINKS Home Discover Chamber Membership Member Directory About Calendar News Farmers Market Contact Us Copyright Jasper County Chamber | All Rights Reserved Website Developed, Hosted & Maintained by Webheads Inc. Facebook Twitter Instagram"
    },
    {
      "url": "https://www.dixiecountychamber.org/who-we-are",
      "text": "Business Directory | Dixie County Businesses Home Business Directory Contact Events Activities About Us Explore our County JOIN CONTACT Home Business Directory Events Explore Our County About Us Contact JOIN About the Chamber \"We strive to support and promote businesses within our community, with a focus on advancing local commerce and fostering team building and leadership development through collaborative local projects.\" Connecting Local Businesses Explore Our Business Directory Banks Radiant Credit Union www.radiantcu.org ccowart@radiantcu.org 352-381-5200 ext. 5712 25873 SE Hwy 19 Old Town, FL 32680 Ameris Bank debbie.dembo@amerisbank.com 352-541-6053 79 NE 121st Street Cross City, FL 32628 Bankers Title ccbg.com baggott.lorilee@ccbg.com 352-541-6160 PO Box 1149 Cross City, FL 32628 Capital City Bank sfrierson@dcadc.org 352-210-4710 79 NE 121st Street Cross City, FL 32628 Restaurants 2 Sweets Donuts twosweetsdonutshop@yahoo.com 352-578-8050 16552 SE Hwy 19, Cross City, FL 32628 Taste of Dixie Diner Barbie Higginbotham barbiehigginbotham67@gmail.com 352-538-7847 1367 NE 188th Ave Old Town, FL 32680 1927 Steakhouse 1927steakhouse.com 352-440-0414 15487 NW Hwy 19, Cross City, FL 32628 Sunset Seafood Bar & Grill Doug Laney dougLANEY9 7@gmail.com 352-231-1972 110 Main ST. Horseshoe Beach, FL 32648 Retail Couch Family RV Inc Rick Couch couchfamilyrv.com rick@couchfamilyrv.com 352-578-3000 16215 SE Hwy 19 Cross City, FL 32680 Cracker House Winery Cathy Polock crackerhousewinery.com crackerhousewinery@gmail.com 352-356-2822 522 SE 897 St Old Town, FL 32680 Dixie Appliance Kevin dixieappliance@yahoo.com 352-498-3320 16266 SE Hwy 19 Cross City, FL 32628 Florida Forest Products Russell Allen russffp@bellsouth.net 352-498-3746 P O Box 1176 Cross City, FL 32628 Liles Hardware Danny Liles dlilesace@yahoo.com 352-498-3318 16608 SE Hwy 19 Cross City, FL 32628 Resolute Cross City LLC Jason Banks jason.banks@resolutefp.com 352-498-3363 40 SW 10th Street Cross City, FL 32628 Sanchez Farms Virginia Sanchez virginia@sanchezfarms.net 352-498-5360 479 NE 446th Ave Old Town, FL 32680 HSB Outfitters, Inc Tammy Bryan hsboutfitters@gmail.com 352-356-1296 126 Main Street Horseshoe, FL 32648 Florida Cracker Bait & Shrimp Company Renee Futch 352-210-2544 366 Main Street Horseshoe, FL 32648 McCall Blue Crab Market Lucretia McCall 931-397-1106 14419 SW 351 Highway, Horseshoe Beach, FL 32648 Neely Shrimp Company Jacky Neely dixiegirl_85@yahoo.com 352 440 4765 13416 SW Highway 351, Horseshoe Beach, FL 32648 Kight Shrimp Lloyd \"Buddy\" Kight 352 240 4513 PO Box 152 Horseshoe Beach, FL 32648 95 SW 659th Avenue, Horseshoe Beach, FL 32648 Janalou's Seafood Dale Kight www.janalouseafood.com dalekight65@yahoo.com 352 210 8379 15507 SW 35 Highway, Horseshoe Beach, FL 32648 South Tide Seafood Brett Selph upthelimitfishingadv@yahoo.com 352 210 6769 PO Box 244, Horseshoe Beach, FL 32648 216 East 6th Avenue, Horseshoe Beach, FL 32648 Service Dixie Title Services Terry Moody www.dixietitelservices.com 352-554-3272 Duke Energy Danny Collins daniel.collins@duke-energy.com Bryan Co Services m.bryancoservices.com bryanco@bellsouth.net 352-498-0816 352-578-4048 15037 SW 351 Hwy, Horseshoe Beach, FL 32648 Central Florida Electric Cooperative www.cfec.com 352-493-2511 Main Office: 11491 NW 50th Avenue Chiefland, FL 32626 Cross City Office: 207 NE 210th Avenue Cross City FL 32628 Inglis Office: 165 Highway 40 W Inglis, FL 34449 Compass Realty www.compassnfl.com Horseshoe Beach Office: compassrealtysales@gmail.com 352-498-2400 130 Main St, Horseshoe Beach, FL 32648 Cross City Office: vacationhorseshoe@gmail.com 352-578-8044 16660 SE Hwy 19, Cross City FL 32628 Edward Jones-Steve Smith Steve Smith edwardjones.com/steve-smith3 steve.smith3@edwardjones.com 386-758-6888 330 SW Main Blvd Lake City 32025 Hellzapoppin Trading Co. Custom Screen-Printed Apparel Brittany Shaara www.HellzapoppinTradingCo.com Brittany@hellzapoppin.com 352-443-4256 399 NE Hwy 353 Old Town, FL 32680 Fiber by Central Florida LLC www.cfec.com/home-fiber 844-533-4237 11491 NW 50th Avenue Chiefland, FL 32626 ﻿ Forward Fitness-Live Well Karen VanAernam forwardfitnessstudio@gmail.com 352-356-0304 P O Box 181 Cross City, FL 32628 GatorGas LP Inc Jennifer Anderson gatorgas.jen@gmail.com 352-542-8420 P O Box 425 Old Town, Fl 32680 Hatcher Realty Services Inc. www.hatcherrealtyinc.com 352-498-5151 1402 Riverside Drive, Steinhatchee, FL 32359 Locklear & Associates John Locklear locklearconsulting.com john@locklearconsulting.com 352-682-0781 210 SW 4th Ave Gainesville 32601 Nature Coast Insurance Andrew Rains naturecoastinsurance.com andrew@naturecoastinsurance.com Old Town Upholstery Jay Weingart j.weingart@oldtownupholstery.com 352-542-9783 194 Northeast 597 Street Old Town, FL 32680 Smith Asset Management Co LLC www.smithamco.com 352-493-7700 322 E Park Avenue, Chiefland FL 32626 Smith Law Firm LLC www.smithlawfirmfl.com 352-490-5353 322 E Park Avenue, Chiefland FL 32626 The Print Shop of Chiefland printshopofchiefland.com tpschiefland@gmail.com 352-493-0322 1517 N Young Blvd, Chiefland, FL 32626 Mission Metals Lucas Rollison www.missionmetalsmfg.com (352) 283-8860 20822 SE Highway 19, Old Town, FL 32680 Bryan Co Services Inc Tammy Bryan bryanco@bellsouth.net 352-356-1296 130 Main St, Horseshoe Beach, FL 32648 16660 SE Hwy 19, Cross City, FL 32628 Shamrock Timber, Inc. Karen Van Aernam 352-356-0304 175 NE 223rd Ave, Cross City, FL 32628 S&D Carriers Davide Sanders 352-498-3892 504 NE 162nd St Cross City, FL 32628 Hope's Gold Cart Rental Hope Reinke paddlepaws00@yahoo.com 382-623-3713 62 W 9th Ave, Horseshoe Beach FL 32648 PO Box 385 Horseshoe Beach FL 32648 Gulfside Lawn + Maintenance Carla and John Neal j-cneal@live.com 352 440 1799 | 352 210 1751 PO Box 323 Horseshoe Beach, FL 32648 15138 SW Highway 351, Horseshoe Beach, FL 32648 All About Air and Heath/Refrigeration LLC James Brennan allaboutairandheat@yahoo.com 352-342-3588 | 3523421342 1107 NE 755th Ave, Old Town, FL 32680 Dixie Dirt, LLC Allen Clark 352 440 0352 4134 SW 449th Street, Horseshoe Beach, FL 32648 Up the Limit Fishing Adventures Brett Selph upthelimitfishingadv@yahoo.com 352 210 6769 PO Box 244, Horseshoe Beach, FL 32648 216 East 6th Avenue, Horseshoe Beach, FL 32648 Chosen Waters Fishing Charters Captain Bill Yates williamyarteshawg190@gmail.com 850 408 5834 5588 NW 26th Street Lawtey, FL 32058 40 1st Ave E, Horseshoe Beach, FL 32648 Mobile Fuel To Go Tom Cushman tcush10@hotmail.com 386 623 0243 PO Box 326, Horseshoe Beach, FL 32648 Clark's Markings Brett Clark www.clarksmarkings.com clarksmarkings@gmail.com 352 210 5491 4024 SW 449th Street, Horseshoe Beach, FL 32648 East Coast West Coast Charters, LLC Rhonda and JD Nobles eastcoastwestcoastcharter@gmail.com 904 669 5624 (Rhonda) 904 826 9267 (JD) PO Box 171, Horseshoe Beach, FL 32648 Charter Egret Landing C103 138 8th Avenue E, Horseshoe Beach, FL 32648 Government Dixie County Board of County Commission www.dixiecounty.us/dixie-county-commissioners North Central Florida Regional Planning Council Executive Director Scott Koons www.ncfrpc.org koons@www.ncfrpc.org 352-955-2200 ext 101 2009 NW 67th Pl Gainesville, FL 32653 Community Another Way Inc. Lisa Hudson anotherwayinc.net lhudson@anotherwayinc.org 386-719-2700 P O Box 1038 Lake City, FL 32056 Career Source Florida Crown Robert Jones careersourceflcrown.com info@careersourceflcrown.com 386-755-9026 1389 US 90 Suite 170B Lake City, FL 32025 Dixie Co Antidrug Coalition Katrina Van Aernam kvanaernam@dcadc.com 352-356-0306 79 NE 121st Street Cross City, FL 32628 Florida Gateway College Brian Lloyd/Dr Barrett fgc.edu president@fgc.edu 386-754-4200 149 SE College Place, LC 32025 Hanley Foundation Lisa McNeil hanleyfoundation.org 386-215-6380 101 North Point Parkway, West Palm Beach, FL 33407 N Central Fl Reg Planning Council Scott Koon ndfrpc.org koons@ncfrpc.org 352-955-2200 2009 NW 67th Pl, Gainesville, FL 32653 Quit Doc Foundation Melanie Anderson wwwtwp-dixie.org manderson@quitdoc.com 352-256-1061 P.O. Box 75, Trenton, FL 32693 Lodging Putnam Lodge Beverly/Ed Pivacel putnamlodge.com putnamlodge@gmail.com 352-440-0414 15487 NW 19 Hwy, Cross City, FL 32628 Suwannee River Bend RV Park, LLC srbrvpark.com SRBRVPark@gmail.com 352-542-7680 28872 SE HWY 19, Old Town, FL 32680 Yellow Jacket RV Resort Bibbi Oxendyne yellowjacketrvresort.com info2yellowjacketrvresort.com 352-542-8365 55 SE 503 Ave, Old Town, FL 32680 East Coast West Coast Charters, LLC Rhonda and JD Nobles eastcoastwestcoastcharter@gmail.com 904 669 5624 (Rhonda) 904 826 9267 (JD) PO Box 171, Horseshoe Beach, FL 32648 Charter Egret Landing  C103 138 8th Avenue E, Horseshoe Beach, FL 32648 Media/Advertising Meridian Pursuit Jesse & Alieta Sampley Jesse@MeridianPursuit.com 270-307-4982 MeridianPursuit.com Hardison Ink Newspaper Jeff Hardison Hardisonink@gmail.com 352-493-9950 352-949-5280 HardisonInk.com Dixie County Advocate Joey/Kim Lander editor@dixiecountyadvocate.com 352-498-3312 PO Box 5030 Cross City, FL 32628 Medical/Dental North Central Florida Hospice , Inc. Pauline Taylor 352-378-2121 4200 NW 90th Blvd., Gainesville, FL 32606-3809 Andrews Healthcare Consulting Logan Andrews www.andrewshealthcareconsulting.com andrewshealthcareconsulting@gmail.com 352-577-5252 103 SE 3rd ST Trenton, FL 32693 Individual Members Carol M. West cmckwest@bellsouth.net 352.542.4362 P.O. Box 790, Cross City, FL 32628 Cindy Bellot cbellot@3riverslibrary.com 352.356.0026 188 SE Hwy 55A, Cross City, FL 32628 Debbie DeWeese debdeweese54@hotmail.com 352.210.0142 76 SE 221st Ave., Old Town, FL 32680 Linda Stoddard PO Box 1620 Cross City, FL 32628 lgstoddard@bellsouth.net 507-456-3697 ﻿ Mike Cassidy rmcassidy91@gmail.com 352-213-4420 135 SE 66 Ave., Cross City, FL 32628 Michelle F. Cannon mcannon@dixiecountytax.com 352.498.1214 P.O. Box 5040, Cross City, FL 32628 Robbie Lee padixie@bellsouth.net 352.356.0742 150 SE 265 St., Cross City, Fl 32628 Ruth Ann Lovelace lovelacera@yahoo.com 352.498.9944 493 NE 214 Ave., Cross City, FL 32628 ﻿ Jennifer Johnson 352-440-0377 John Driggers, Jr citymanager@townofcrosscity.com 352-498-3306 PO Box 417 Cross City, FL 32628 Daryl Ratterree ratscats5@gmail.com 352-578-5441 Home Business Directory About Us Contact CONTACT PO BOX 547 ﻿ Cross City, FL 32628 ( 352) 498-5572 info@dixiechamber.org JOIN Share by:"
    },
    {
      "url": "https://www.shelbycountykychamber.com/board-of-directors/",
      "text": "Board of Directors - Shelby County Chamber of Commerce Skip to content Member Log In The Chamber About Us Board of Directors Committees What Theyâre Saying Contact Us Info Requests Hot Deals Directory Member Center Member & Diplomat of the Year Membership Information Membership Application About Member to Member Member Login Events Calendar Sponsorships Photo Gallery Event List Community Involvement Young Leaders Chamber Funded Scholarship SCIDF Expanding Resources Community Resource Guide Weather Jobs Radio Spotlights Connect.Build.Grow Connect Build Grow Board of Directors Ray Leathers Executive Director Shelby County Chamber 316 Main Street Shelbyville, KY 40065 633-1636 www.shelbycountykychamber.com Ray is the President/CEO Shelby County Industrial & Development Foundation. He is the author of âShut Up, Get Leanâ-Lean Manufacturing, and retired as President/CEO Shelby Counties oldest manufacturer: Roll Forming Corporation. Ray is a decorated military service, Kentucky Manufacturing Employee of the Year, and Boy Scouts Citizen of the Year. When Ray is not wearing one of his many professional hats, you can find him at a University of Kentucky game, taking youth to harvest their first deer/turkey, take his old military jeep to parades or spending time with his wife; âtheâ Sue Nally. Beth Judd Associate Executive Director Shelby County Chamber 316 Main Street Shelbyville KY 40065 633-1636 www.shelbycountykychamber.com Beth has been with the Shelby County Chamber for over 5 years working alongside Ray Leathers to help ensure the quality of benefits for not only their members but also the community is one that will be sought after as a benefit to Shelby County. With her bachelorâs in business management and business marketing, she can bring professional experience as well as a functional mindset to assist all members in different walks of life with their business needs. Beth and her spouse Mike are the parents of three very active kiddos: Trace and Amelia both attending the University of Kentucky, and Brayden, a senior at Shelby County High School as well as an overweight 7-year-old puppy Justice. They are diehard Kentucky fans who love relaxing outdoors when time will allow! Matthew Page President Old Kentucky Insurance 311 Main Street Shelbyville, KYÂ  40065 633-1829 https://www.oldkentuckyinsurance.com/contact/shelbyville Matthew graduated from Shelby County High school, went to play football and graduate at Lindsey Wilson College.Â  After graduation he decided to move back home where he started in the insurance industry.Â  He serves on several local boards and enjoys serving his community. Matthew has been in the insurance industry for 9 years as an agent.Â  As a local independent insurance agent he can shop all of your insurance needs, personal or business insurance, with several different companies to insure you are getting the best price.Â  His agency is licensed in over 40 states! When Matthew isnât working or serving his community he enjoys spending time with his wife, Haven, chasing around their two daughters, Savannah (3) and Addison (1).Â  He also enjoys playing golf and cheering for his favorite sports teams, the Kentucky Wildcats and Cincinnati Bengals. Aaron Garofola Past President UofL Health Shelbyville Hospital 727 Hospital Dr, Shelbyville, KY 40065 502-647-4000 https://uoflhealth.org/locations/shelbyville-hospital/ Mr. Garofola is a Kentucky Colonel, a recipient of the 2021 Shelby Life Magazine Community Service Award, Alumni of Leadership Shelby (class of â23) and is currently serving as President of the Shelby County Chamber of Commerce. Mr. Garofola earned his Bachelor of Science Degree in Organizational Development from Oakland City University in Oakland City, Indiana, and a Master of Business Administration in Healthcare Management from Indiana Wesleyan University. During his 20-year career in healthcare, Mr. Garofola also served in Operation Joint Forge in Bosnia, and Operation Enduring Freedom in Afghanistan with the Indiana Army National Guard with honors including the Combat Infantry Badge and the Meritorious Service Medal. Fun fact, Aaron was in Toby Keithâs music video âCourtesy of the Red, White and Blueâ. Josh Berkley Incoming President Berkley & Oliver, PLLC 77 Mack Walters Rd, Suite 200 Shelbyville, KYÂ  40065 205-9005 https://berkleyoliver.com/ Joshua G. Berkley is an Owner and Attorney at Berkley Oliver PLLC where he focuses on Estate and Trust Planning, Probate, and Elder Law.Â  Josh is proud to live in Shelby County with his Wife, Katie, their daughter, and one dog.Â  In addition to serving with the Chamber, Josh serves as the President of the Leadership Shelby board, Vice-President of the Dorman Preschool Center Board, and is a member of the boards for the Shelby County Parks Foundation, and the Shelby County Community Theatre. Kelly McNew Secretary Shelby County Pubic Schools 1155 West Main Street, Shelbyville KY 40065 633-2375 https://www.shelby.kyschools.us/ Kelly is the Work Based Learning Liaison for Shelby County Public Schools helping to connect the schools to the community! She has fun all the time, everywhere she goes! She is married to her high school sweetheart, mom to 3 kiddos, has 2 dogs, 1 cat, a bunny, guinea pig and 7 chickens! Most of all, Kelly loves everything about BAGDAD! Jason Edwards Treasurer Edwards Moving & Rigging 200 Everett Hall Rd Shelbyville KY 40065 633-1961 https://edwardsmoving.com/ Jason is a lifelong resident of the Shelby County community, where his family proudly lives and works today. After going to college at Eastern Kentucky University, he moved back to Shelby County to work at the family business âEdwards Moving & Rigging.â Jason has held several positions throughout the company ranging from a crew member to my current position as the CEO of Edwards Moving & Rigging. He understands the value of hard work and working your way up through the ranks of a company. Jason still resides in Shelby County with my wife, Becca, and 2 children. They all love the Shelby County Community and are always looking for ways to help and give back. Judge Dan Ison County Judge Executive Shelby County Fiscal Court 419 Washington Street Shelbyville, KYÂ  40065 633-1220 http://www.shelbycounty.ky.gov Dan lson has deep Kentucky roots as the son of a WWII veteran and a pioneering female police officer. Raised by his grandparents in Louisville's south end, he developed an early interest in civic affairs. After graduating from Butler High School, he worked as a photographer at Kentucky thoroughbred racetracks before enlisting in the Air Force at 19, serving in Vietnam. Following his military service, Dan climbed the ranks at Philip Morris in Louisville, eventually becoming Director of Community Relations. He furthered his education at Bellarmine University and Virginia Commonwealth University before retiring and consulting for Guthrie-Mayes Public Relations. As an entrepreneur, he ran a government relations firm, serving clients like Diageo and Philip Morris. Dan is actively involved in community efforts, holding leadership positions with the Simpsonville Volunteer Fire Department, Operation Brightside, and the Kentucky Derby Festival. He is a dedicated husband to real estate leader Debbie Holloway and a proud father and grandfather, enjoying farm life, reading, and time with his horses in his spare time. Mayor Troy Ethington City of Shelbyville 315 Washington Street Shelbyville, KYÂ  40065 633-8000 Troy@shelbyvillekentucky.com www.shelbyvillekentucky.com Troy Ethington is a lifelong resident of Shelbyville and has worked in public serve for 31 years.Â  He retired from the City of Shelbyville Fire & Rescue with the rank of Assistant Fire Chief after 25 years, specializing in Emergency Management.Â  After serving on the Shelbyville City Council for six years, Troy is excited to put his experience to work as Mayor to continue to make Shelbyville a great place to live, work, and play. He is a graduate of Shelby County High School and received an Associateâs Degree from Eastern Kentucky University. Troy has three sons, a daughter, and a new grandbaby.Â  In his spare time he enjoys spending time with family and friends, watching Steelers football, and supporting both U of K and U of L programs. Julie Hamond Traditional Bank 601 Taylorsville Rd Shelbyville, KY 257-8253 www.traditionalbank.com Julie Hammond is an employee of Traditional Bank where she serves as a Community Loan Officer. Â She is a lifelong Shelby Countian who enjoys volunteering and giving back to her community. Julie has spent 40 plus years in the banking profession and enjoys her current role as a community banker.Â  More importantly Julie enjoys time spent with her family and loves all sports and all things agriculture! She is a staple in our community serving on many committees and boards such as Shelby County Farm Bureau past president, Shelby County Rotarian, Young Leaders Advisory Committee, Shelby County Community Charities and Farmers Feeding Families. Renee Clark The UPS Store 18 Village Plaza Shelbyville KY 40065 647-1848 store3325@theupsstore.com Renee has been the franchisee owner of our local UPS Store #3325 for 25 years and previously served at the Shelby County Chamber of Commerce past President in 2010. She is a church lay leader, business mentor and participates in a variety of community services outlets, pantries and charities. With her fun personality bringing a smile to everyone, Renee always finds a way to put others first, except if they have spiders or snakesâ¦. Chase Young State Farm 7205 Shelbyville Road Simpsonville, KYÂ  40067 513-5139 Chase@myagentchase.com Chase Young is a proud small business owner of a State Farm agency in Simpsonville & Shelby County.Â  He was born and raised in South Texas and attended Texas A&M University where he earned an Undergraduate and Masterâs degree. Chase and his team love serving the needs of the people of Kentucky.Â  They are proud to offer services that include but are not limited to Auto, Home, Life and Disability Insurance.Â  Chase and his team are there to help life go right for folks when the unexpected happens! Family is everything to Chase.Â  He is blessed to have been married to his wife Whitney since 2014 and recently welcomed a baby girl into the world.Â  Harper and big brother (Jackson, 6) complete the Young Family of 4! Mary Beth Dennis Shelby Energy Cooperative 620 Old Finchville Road Shelbyville,Â KYÂ  40065 633-4420 www.shelbyenergy.com Mary Beth serves as the director of new business for the SCIDF and works to support economic development efforts in Shelby County. She also has a focus on developing communication strategies for the coop and positioning Shelby Energy as a trusted community partner. Mary Beth has her bachelors of Arts in Communication from Bellarmine University and is a certified meeting planner! She lives in Louisville with her husband Dave and their 2 children. They children are very involved in multiple sports including volleyball, which she coaches. When not at sporting events, Mary Beth loves to travel. Steve Eden City of Simpsonville 108 Old Veechdale Road Simpsonville, KYÂ  40067 722-8110 www.cityofsimpsonvilleky.comÂ Steve has served the Simpsonville Community in three roles over the past 33 years as Manager of West Shelby Water District, Mayor and now City Administrator. He thinks one of his greatest accomplishments must have been a part of helping build the sustaining infrastructureÂ that we have in Simpsonville of Sewer, Water and Streets. Even though it's not his job, he loves driving the Snow truck for the city. Matt Burgin Independence Bank 65 Mack Walters Rd Shelbyville, KYÂ  40065 487-5220 https://www.1776bank.comÂ Matt currently works for Independence Bank here in Shelbyville and serve as a Vice President, Loan Officer. He has been in community banking here in Shelby County for almost 15 years and love getting to partner with others in our community to make it a better place. No matter if itâs a new home for someone, a new office space for a business or a piece of equipment for a local contractor he is always glad to help in any way he can. Matt enjoys working at a place that gives me the opportunity to serve and give back to our community. He has previously served on the board of directors for Leadership Shelby, Shelby KY Tourism and as an elder at Christ Community Church. Currently he serves as Chairman of the Shelby Co Parks Board, ShelbyKY Tourism board and President of the Shelby Co Library Board of Trustees. Donna Meador Pegasus Industries 420 Haven Hill Rd Shelbyville, KYÂ  40065 647-9500 https://www.pegasuspackaging.com/ Donna has been a registered nurse for 42 years and spent several years as a nurse lead at our local hospital. Her husband, Steve and her own a business and have headquartered the business in Shelbyville for the last 27 years. Shelbyville and Shelby County has been a blessing to the Meador family. Donnaâs family has been in Shelby County for about 33 years and they fell in love with the community. All 4 of her children are graduates of Shelby County High School. John Leeper Alton Webb 4280 Freedoms Way, Shelbyville KY 40065 480-6024 https://altonwebb.com/ Born and raised in Benton, KY, John graduated from Centre College in 1995, but his passion for teaching extended beyond the English classroom, as he also coached football, basketball, and tennis. Over his 27-year career, John showcased exceptional leadership skills and a talent for building high-performing teams. Recently retired, John's retirement has been an unexpected adventure, filled with activities like tending to his property, learning golf, and engaging in community service, including mentoring and coaching at his church. A graduate of Leadership Shelby in 2015, John's dedication to his community led him to volunteer for the Chamber, eventually joining the Executive Board, and becoming president. He did this all in hope to help foster collaboration between local professionals and students. His commitment to merging education and business aims to cultivate a strong workforce, thriving families, and prosperity in Shelby County. Now a commercial real-estate agent with Alton Webb Commercial Real Estate, John resides in Shelby County with his wife Melissa and their two sons, Alex and Luke. During his free time, he enjoys chatting over coffee or meals and taking part in outdoor activities that let him soak in the beauty and vibrant community atmosphere of Shelby County. Candice Hollingsworth Shelby County Cooperative Extension 1117 Frankfort Road Shelbyville, KY 40065 633-4593 http://ces.ca.uky.edu/shelby/ Candice is the Shelby County Extension Agent for 4-H Youth Development. Candice has been dedicated to her work with positive youth development here in Shelby County since she first started with Extension years ago and is excited to continue to grow 4-H programs. She moved to Kentucky with her husband Chad and has two sons Everett and Casey. Candice grew up in Ohio which is where her passion for 4-H programs began. She attended college in Tennessee and holds a B.S. in Animal Science and Masterâs in Education. Â She is excited for the opportunity to serve on the Shelby County Chamber of Commerce Board of Directors. Lacey Stivers Lacey Stivers State Farm 871 Taylorsville Road Shelbyville, KY 40065 633-1131 https://callteamlacey.com/ Laceyâs husband Taylor, and her two boys, Kash and Kam, are her world! They love all things food, and travel! She has been voted the best insurance agent in Shelby County for four years in a row and has her amazing team to thank for continuing to deliver the best customer service and are currently one of the top 120 State Farm agencies in the country for commercial insurance! Lacey loves the show, Dexter, and she put John Lithgowâs wrist band on him at the World Equestrian Games in Lexington in 2010. That same year she met Ron White at Lexington Country Club and answered his cell phone for him when Billy Bob Thornton called him. 2010 was a pretty cool year! Charlotte Couvillion Kentucky Farm Bureau 1201 Mt. Eden Rd Suite 201 Shelbyville, KY 40065 (502) 633-2310 https://www.kyfb.com/shelby/insurance/charlotte-couvillion/ Charlotte is a Western Kentucky graduate who majored in Marketing and Sales. She likes to spend her free time with her friends and family. She has worked at Kentucky Farm Bureau as an agent since 2023 and loves being able to connect with her customers while helping them navigate the insurance industry. Georgina Ivers Crescent Place Assisted Living 148 Allen Drive Shelbyville, KY 40065 (502) 633-6622 http://www.crescentplaceassistedliving.com/ Georgina is the executive director with Crescent Place Assisted Living for the last 4 years but has worked in healthcare for over 30 years. She is a member of the Kiwanis Club and Shelby County Fire Department Auxiliary. Georgina is married to Jeff Ivers and mother to Elizabeth and Robbie (Kelsey) Ivers, grandmother to Karson and Addison. She enjoys her pets and reading a good book. Sarah Flowers Kosair For Kids 512 Main Street Shelbyville, KY 40065 (502) 305-0443 http://www.kosair.org Sarah has worked in non-profits for over 20 years and very active within the community. She is an alumni of Leadership Shelby, Rotarian member, Honorable Kentucky Colonel as well as a member with the Bullitt County Chamber while being a director for the Shelby County Chamber. Sarah has been married to her husband Michael for 17 years and has 2 children, Alex and Cecilla. She graduated from Western Kentucky University in 2002 and is on the athletic board at St. Maryâs Academy and volunteer minister at St. Bernadetteâs. Charlie Leppo ServPro of Oldham/Shelby 612 Gordan Lane Shelbyville, KY 40065 (859) 225-3193 http://servprooldhamshelbycounty.com Charlie has been the Reconstruction Manager at ServPro for 6 years currently with the ambition to purchase the franchise in the future. He has worked in general management and many other tasks within ServPro. Charlie graduated from the University of Kentucky in 2020 with his degree in business management and communications. He moved to Shelbyville 2 years ago to help grow ServPro in the community. Charlie and his wife started their family here welcoming their now 5 month old. They enjoy spending time outdoors, traveling, skiing and going to car shows. Patrick Hargadon Hargadon Farms 461 Buetel Lane Waddy, KY 40076 (502) 220-0739 Patrick Hargadon, the son of Pat and Terry Hargadon, is a lifelong resident of Shelby County, currently living in Waddy with his girlfriend Olivia and their two beloved dogs, Steve and Dolly. He serves as the general manager of Hargadon Farms, where he oversees the daily operations of the full calving herds, calf backgrounding facility, and custom forage production. A graduate of Shelby County High School, Patrick furthered his education at the University of Kentucky, earning a degree in Agriculture. In addition to his responsibilities at the farm, he is also a skilled auctioneer and realtor with H. Barry Smith Co/Williard Auction, showcasing his diverse talents and commitment to the local community. Patrickâs dedication to both agriculture and real estate reflects his passion for supporting and enhancing the economy of Shelby County. Blake Shelton McDaniel Insurance 921 Main Street Shelbyville, KY 40065 502.909.0920 http://www.McDanielins.com Blake is a graduate of Transylvania University, where he earned his degree before beginning his professional career as a claims adjuster in July 2020. In March 2023, he joined the McDaniels team as an adviser, bringing valuable experience and expertise to the role. Originally from Shelbyville, Blake graduated from Martha Layne Collins High School in 2016. A lifelong soccer player, he has a deep passion for sports and enjoys staying active in various athletic pursuits. Mason Warren ShelbyKY Tourism 219 7th Street Shelbyville, KY 40065 (502) 633-6388 http://www.VisitShelbyKy.com Mason Warren, a lifelong Shelby County resident, is the director of marketing and public relations at ShelbyKY Tourism, where he has helped double visitor spending to over $91 million. A University of Louisville graduate (â23) and former Martha Layne Collins High School student (â18), he lives in Shelbyville with his dog, Parker. In 2022, he founded Parker Creative, a boutique marketing agency for local clients, and holds several industry certifications, including Travel Marketing Professional and Professional in Destination Management. Mason is also a Certified Kentucky Tourism Professional and serves on the Board of Directors for the Shelby County Community Theatre, where he chairs the season selection committee. In his free time, he enjoys reading, exploring coffee shops, and traveling. Marcy Mudd Stock Yards Bank 422 Main Street Shelbyville, KY 40065 (502) 232-7001 https://www.syb.com/ The majority of Marcyâs 21-year banking career was in relationship management spending 12 years of that in Shelby County as a commercial banker with Stock Yards Bank. He has lived in Shelby County for 29 years with his wife Natalie and their 3 children; Morgan, Noah and Michael. Marcy is involved in several organizations including Southeast Christian Church where he teaches a youth small group and Cornerstone Christian Academy serving as the Board Chair and helping coach basketball. © 2025 Shelby County Chamber of Commerce | Site by GrowthZone Home Join Us Member Login Contact Shelby County Chamber of Commerce 502.633.1636 (Office) 502.633.7501 (Fax) The Cardwell House 316 Main Street, Suite 2,Â Shelbyville, KY 40065 info@shelbycountykychamber.com Â© Shelby County Chamber of Commerce. Â All Rights Reserved. Site by GrowthZone Scroll To Top"
    }
  ]
}