{
  "fuentes": [
    {
      "url": "https://www.nola.com/entertainment_life/eat-drink/article_48bc3982-3d43-11ea-80cc-eb73e0f1d660.html",
      "email": "imcnulty@theadvocate.com"
    },
    {
      "url": "https://www.nola.com/entertainment_life/eat-drink/article_48bc3982-3d43-11ea-80cc-eb73e0f1d660.html",
      "email": "nolanewstips@theadvocate.com"
    },
    {
      "url": "https://www.nola.com/entertainment_life/eat-drink/article_48bc3982-3d43-11ea-80cc-eb73e0f1d660.html",
      "email": "subscriberservices@theadvocate.com"
    },
    {
      "url": "https://dixietech.edu/contact/",
      "email": "info@dixietech.edu"
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "email": "info@dixiebrands.com"
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "email": "media@dixiebrands.com"
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "email": "sales@dixiebrands.com"
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "email": "info@bellrockbrands.com"
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "email": "info@dixiebrands.com"
    }
  ],
  "mails": [
    "imcnulty@theadvocate.com",
    "info@bellrockbrands.com",
    "info@dixiebrands.com",
    "info@dixietech.edu",
    "media@dixiebrands.com",
    "nolanewstips@theadvocate.com",
    "sales@dixiebrands.com",
    "subscriberservices@theadvocate.com"
  ],
  "nombre_sitio": "dixiegrillandbrewery.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.nola.com/entertainment_life/eat-drink/article_48bc3982-3d43-11ea-80cc-eb73e0f1d660.html",
      "text": "Dixie Beer is back: Take a peek inside new brewery opening Saturday in New Orleans | Where NOLA Eats | nola.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Baton Rouge New Orleans Acadiana Shreveport Lake Charles Gambit Log in Subscribe Log out Site search Search News Business Crime/Police Courts Education Environment Gulf Coast Jefferson Parish St. Tammany Local Politics State Politics Hurricane Center Weather/Traffic Meet Investigative Team Weekly Editions Sports Rod Walker Betting Saints LSU Pelicans Tulane UNO High School Sports Horse Racing Jeff Duncan Colleges Entertainment Arts Books Calendar Comics Curious Louisiana Festivals Forward 64 Games Louisiana Health Home/Garden Ian McNulty Keith Spera Louisiana Inspired Mardi Gras Arthur Hardy - Mardi Gras Guide Movies/TV Music Society Where NOLA Eats Your Best Life Games Opinions Clancy DuBos Stephanie Grace Ron Faucheux Walt Handelsman Quin Hillyer Faimon Roberts Will Sutton Our Columnists Our Views Guest Columns Letters Obits Jobs Homes Store Public Notices Jefferson Parish E-Edition Newsletters Log out Log in Subscribe My account 79° E-Edition Newsletters News Business Crime/Police Courts Education Environment Gulf Coast Jefferson Parish St. Tammany Local Politics Local Elections State Politics Statewide Elections Hurricane Center Weather/Traffic Meet Investigative Team Weekly Editions Crescent City East Jefferson St. Tammany West Bank Sports Rod Walker Betting Saints LSU Pelicans Tulane UNO High School Sports Horse Racing Jeff Duncan Colleges Entertainment Arts Books Calendar Comics Curious Louisiana Festivals Forward 64 Games Louisiana Health Home/Garden Ian McNulty Keith Spera Louisiana Inspired Mardi Gras Arthur Hardy - Mardi Gras Guide Movies/TV Music Society Where NOLA Eats Your Best Life Games Opinions Clancy DuBos Stephanie Grace Ron Faucheux Walt Handelsman Quin Hillyer Faimon Roberts Will Sutton Our Columnists Our Views Guest Columns Letters Obits Jobs Homes Store Public Notices Jefferson Parish Dixie Beer is back: Take a peek inside new brewery opening Saturday in New Orleans Share this Facebook Twitter WhatsApp SMS Email Print Copy article link Save Close Dixie Beer is back: Take a peek inside new brewery opening Saturday in New Orleans BY IAN MCNULTY | Staff writer Ian McNulty Author email Jan 22, 2020 Jan 22, 2020 6 min to read Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save New Orleans knows Dixie Beer. Steeped in more than a century of local life, its name is lettered on weathered bar signs, visible in the hands of dads and aunts in old family photos, and part of stories repeated wherever pitchers are filled and cans are drained. Today, though, Dixie itself has a new story to tell. Dixie Brewery Where: 3501 Jourdan Rd., New Orleans When: Opens Jan. 25 Regular hours, Mon.-Sat., 11 a.m.-7 p.m., Sun. 11 a.m.-6 p.m. Details: Guided tours are $5, which includes beer samples. Self-guided tours and museum access are free. Open to all ages. Dixie is being brewed in New Orleans again for the first time since Hurricane Katrina, at a facility designed to connect a brand with deep local resonance to the pace and tastes of a rapidly changing beer business. On Saturday, the company will officially open its new brewery in New Orleans East, fulfilling a pledge that Saints and Pelicans owner Tom Benson made in 2017 and that his widow Gayle Benson has kept since taking the reins of his business empire. +30 Photos, video: A look inside the new Dixie Brewery in New Orleans East The new Dixie Brewery which features a 85,000 square foot brew house will open this coming Saturday (Jan. 25). The signature tower that stood … With a clutch of new beers, including hoppy IPAs and a tart raspberry ale, the company is diversifying its brews, alongside its familiar labels — the flagship Dixie Lager, Dixie Light and its Blackened Voodoo dark lager. http://www.nola.com Dixie Brewing Co.'s general manager, Jim Birch, said it’s all geared to give Dixie drinkers of yore a reason to come back and introduce the brand to the next generation. “This brand is such an incredibly lucky thing to have,” said Birch. “Most brands fade into oblivion. But this one has held on. That’s why the idea was: Let’s not just bring it back, let’s bring it back to what it was in its heyday.” The long road home The new Dixie Brewery in New Orleans East on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER The name \"Dixie Beer\" is emblazoned in tall green letters over the brewery’s new home, visible from the interstate on a brick tower modeled after the one at the company’s original facility on Tulane Avenue in Mid-City. What’s now happening under the Dixie name, however, is anything but a replica of what the company had before. Behind the scenes, this 85,000-square-foot brewery was designed for consistency and efficiency. Modern computerized controls cover each step of production, from the filtered water coming in, to the flow of cans and bottles on the way out. “We can do things here that Dixie never could in the past,” Birch said. “I can say honestly that Dixie has never had a facility like this.” The new Dixie Brewery in New Orleans East on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER Still, it’s the history of Dixie going back to its earliest days that helps inspire today’s reboot. When Dixie opened in 1907, its Tulane Avenue brewery was considered state-of-the-art. A Times-Picayune story that year hailed it as “one of the most modern and sanitary brew plants in the United States,” with systems to sterilize barrels and even keep a tidy horse stable (necessary for hauling kegs). An image of the Dixie Brewery on Tulane Avenue, published in The Daily Picayune on Nov. 1, 1907, with a story about the brewery's opening. Image from the Times-Picayune archive But eventually Dixie started to fade. The American beer industry grew increasingly concentrated in successively larger companies, the revival of local brewing was a long way off, and Dixie was a holdout that could barely hold on. As its facility devolved into a jumble of archaic cypress fermenting tanks and pieced-together replacement parts, the quality and consistency of its beer were the subject of frequent griping. For a time, even some of those who drank it regularly were prone to discuss their Dixie loyalty as a penance, like rooting for the Saints in the bad old days. Historic memorablila at the new Dixie Brewery in New Orleans East. STAFF PHOTO BY CHRIS GRANGER Flooding and subsequent looting after Hurricane Katrina spelled the end for the original brewery, which was later acquired by the state; its façade was folded into the new Veteran Affairs medical complex. The beer got back in circulation in 2006, produced under contract in Covington for a time and later in Minnesota until the Bensons stepped in. They acquired a majority stake in the company from the Bruno family for an undisclosed amount. Kendra Bruno remains a co-owner. New era, a new Dixie A fresh pour of the Dixie Voodoo Queen at the new Dixie Brewery in New Orleans East on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER Today, what was once the last New Orleans beer brand standing is part of a market that features many small local breweries and vastly broader access to beer brands from elsewhere. Dixie is bringing more to the table too. The new taproom will open with eight different beers available. By early February the company will begin shipping some of these beers to stores and bars, including its two new IPAs — a robust one called Voodoo Queen and a somewhat lighter version called Voodoo Doll. There also are a raspberry white ale dubbed Crimson Voodoo and stout called Midnight Voodoo. Jim Birch, the general manager of the new Dixie Brewery in New Orleans East, grabs a can from a stack in the warehouse on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER Still, Birch said, Dixie’s focus is on its older flagship brews, and its niche is what’s known in the business as the domestic premium market, one still dominated by the global beer brands. “New Orleans is a culinary city with its own style, its own flavors,” he said. “We think people will pick the local name if they have the option.” +26 See historic photos of Dixie Beer through the years Dixie Beer has a long history in New Orleans, going back to 1907 when its original brewery opened on Tulane Avenue in Mid-City. Stephen Borutto, director of brewing operations for Dixie, moved to New Orleans for the job after working across the brewing spectrum, including the giant MillerCoors in Colorado and the cult favorite Stone Brewing Co. in California. While he oversees an array of beer styles now, he’s most excited about showing off Dixie Lager, the oldest of old school brews on the company’s roster. “The community in New Orleans is so evident from the day you arrive here,” Borutto said. “You hear so many stories about Dixie, so it feels part of that community. Helping to bring that back home is exciting.” Heading to New Orleans East The bar inside the new Dixie Brewery in New Orleans East on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER The brewery’s New Orleans East location, once part of the old MacFrugals distribution center, has rail access for grain and sits adjacent to Dixie’s distributor, Crescent Crown. It is also off the beaten path for visitors. But Maureen Clary, who oversaw site selection and construction for the Benson family, said other factors steered the decision. They were determined to build in Orleans Parish to contribute to the city’s economy, she said, and picked New Orleans East as an area where the investment could make the biggest impact. Since plans were announced, city leaders and nearby business owners have hailed the brewery as a potential catalyst for a part of town with few attractions. The company has an events coordinator working to keep the private events bar upstairs booked with corporate meetings and parties, and to keep people coming out to the grounds and taproom. For those who visit, Dixie is out to put on a show. The beer museum is a time capsule of local memorabilia, with old local commercials on a loop. Brewery tours follow walkways above the tanks, capable of producing 1.37 million cases of beer annually, and the canning lines, which spin out 167 cans per minute. The taproom has its own eatery, a counter-service kitchen run by New Orleans caterer and food truck operator Fete au Fete . Chef and founder Micah Martello has designed a menu offering his takes on Southern comfort food (pork rinds with pimento cheese), New Orleans staples (pressed muffulettas) and tavern fare (crab boil cheese fries with crawfish and fried cheese curds). The kitchen area at the new Dixie Brewery in New Orleans East on Tuesday, January 21, 2020. STAFF PHOTO BY CHRIS GRANGER “We expect half of the people coming in here will be locals, and half will be visitors, so we want to have something for all of them,” said Martello, who also added a kid’s menu to his taproom offerings. A fire pit and outdoor seating area at the new Dixie Brewery in New Orleans East. STAFF PHOTO BY CHRIS GRANGER While production is only now getting up to full steam, Birch said the company’s history helps inform a long view of Dixie’s goals. “I think 20 years from now, it will feel like Dixie has always been part of New Orleans, with that interim where it had to be made out of state after Katrina,” he said. Dixie Brewery Where: 3501 Jourdan Road, New Orleans When: Opens Saturday, 11 a.m.-7 p.m. Regular hours: Wed.-Sat., 11 a.m.-7 p.m.; Sun., 11 a.m.-6 p.m. Details: Guided tours are $5, which includes beer samples. Self-guided tours and museum access are free. Open to all ages. +37 Thirsty? A guide to New Orleans craft brewery taprooms These are heady times for beer lovers in New Orleans. The growing ranks of craft breweries mean there’s always something new to try, from one … +21 Sazerac House opens its doors, and a new portal for New Orleans cocktail culture Wine aficionados can pursue their passion at vineyards and tasting rooms around the world. Breweries will draw beer hounds wherever they set up shop. Love New Orleans food? Pull up a seat at the table. Join Where NOLA Eats, the hub for food and dining coverage in New Orleans. Follow Where NOLA Eats on Instagram at @wherenolaeats , join the Where NOLA Eats Facebook group and subscribe to the free Where NOLA Eats biweekly newsletter here . Email Ian McNulty at imcnulty@theadvocate.com . Facebook Twitter WhatsApp SMS Email Print Copy article link Save More information +7 Bruno’s Tavern, longtime New Orleans college bar, changes hands but not its ways Bruno’s Tavern has seen a lot since first opening Uptown in 1934, including a few changes to its address and even its name. This month it also… +16 Think you know Dixie beer? Check out new brews, see what's next at the taproom The new Dixie brewery in New Orleans East is filled with pieces of the company’s past, from the old neon signs over the production floor to vi… +4 Ian McNulty: Why return of Dixie Beer, Hubig’s Pies is a trend New Orleans needs now Hubig’s Pies and Dixie Beer, together again soon? +16 Dixie Beer, the oldest brewery in New Orleans, will change its name New Orleans has been hoisting Dixie beer for more than a century. Soon, that beer -- and the company behind it -- will have a new name. +5 Will Sutton: It's the right call to ditch Dixie Beer name. Thank you, Gayle Benson. THIS could be something that makes more of us cheer. Ian McNulty Author email Follow Ian McNulty Sections Home News Opinion Sports Entertainment/Life Newsletters Games Services Classifieds Search Subscribe Digital Advertising Help/Contact Us RSS Feeds Media Kit eEdition Careers News in Education Reviewing the Record Manage your Donation Our Sites Obituaries Jobs Celebrations NIE Classifieds Homes Pets Archives Store Contact Information nola.com 840 St. Charles Avenue New Orleans, LA 70130 Phone: 504-529-0522 News Tips: nolanewstips@theadvocate.com Other questions: subscriberservices@theadvocate.com Need help? Report a delivery issue Create a temporary stop Sign up for recurring payments Pay your bill Update your billing info × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 NOLA.com 840 St. Charles Avenue, New Orleans, LA | Terms of Use | Privacy Policy"
    },
    {
      "url": "https://dixietech.edu/contact/",
      "text": "Contact Us | Dixie Technical College (435) 674-8400 info@dixietech.edu Facebook X Instagram Facebook X Instagram Programs Students All Student Resources Calendar Canvas Login Forgot Password Student Portal Testing Center Wellness Center Graduation Transcript Request Housing Job Board Admissions Apply Continue Application Programs Schedule Tour Meet with an Advisor Financial Aid Accuplacer High School Scholarships Articulation Veterans Community Short-Term Training American Heart Custom Fit Donations Industry Partners Post a Job Staff Branding Guide Calendar Employee Resources About Us Accreditation Board of Trustees College News Contact Us Map & Parking President’s Message APPLY Select Page Contact Us Contact information for Dixie Tech Contact Dixie Tech We welcome any and all questions, feedback or other comments. Please use the form below or any of the other contact information to get in touch with us and we will respond within a business day. View Campus Maps  Phone 435-674-8400  Email info@dixietech.edu  Address 610 S Tech Ridge Dr, St. George, UT 84770 Email Send a Note Reach out with questions, feedback, suggestions, and whatever else you might have on your mind. CONTACT Generic contact form for website \" * \" indicates required fields Name * First Last Email * Phone * Message * By submitting this form, I am providing my digital signature agreeing that Dixie Technical College may email me regarding educational services utilizing automated technology at the email provided above. Messaging frequency may vary. I understand this consent is not a condition to attend Dixie Technical College or to purchase any other goods or services. You can unsubscribe/opt-out at any time. See Privacy Policy and SMS Terms. * By checking this box I agree to receive marketing, and Higher Education related sms messages from Dixie Technical College. Message frequency may vary. Standard Message and Data Rates may apply. Reply STOP to opt out. Reply Help for help or visit our website at dixietech.edu. Privacy Policy and SMS Terms . By submitting this form, I am providing my digital signature agreeing that Dixie Technical College may email me regarding educational services utilizing automated technology at the email provided above. Messaging frequency may vary. I understand this consent is not a condition to attend Dixie Technical College or to purchase any other goods or services. You can unsubscribe/opt-out at any time. See Privacy Policy and SMS Terms . LinkedIn This field is for validation purposes and should be left unchanged. Quick Links Employee Resources Calendar Blog Financial Aid Employment Opportunities Community Job Board Schedule Tour Testing Center Transcript Requests Campus & Community Career Enhancement Campus Map & Parking Donate FAQ High School Students Mission Media Staff Directory Supporting Partner Legal Disclosures Policies and Plans Consumer Information Title IX Nondiscrimination Privacy Policy Dixie Technical College 610 S Tech Ridge Dr St. George, UT 84770 (435) 674-8400 info@dixietech.edu Hours: M–F, 8am–5pm Facebook X Instagram Copyright © 2025 by Dixie Technical College. All rights reserved."
    },
    {
      "url": "https://dixieelixirs.com/board-and-management/",
      "text": "IR Board of Directors and Management « Dixie Elixirs PRODUCTS Elixirs MINI ELIXIR SIGNATURE ELIXIRS Close Chocolates SYNERGY Gummies SIGNATURE SYNERGY FAST-ACTING PEAK LIMITED TIME OFFERINGS Close Mints Bursts Tarts Close EDUCATION Delivery Systems Marijuana 101 Elixir Mocktail Recipes SYNERGY Gummy Family Close ABOUT About Dixie FAQ’s Close BLOG BUY Store Locator Close INVEST Investor Dashboard Financial Information Press Releases Investor Contacts Stock Information Detailed Stock Chart Close TEST RESULTS ELIXIRS CHOCOLATES SYNERGY GUMMIES MINTS BURSTS TOPICALS Tarts IR Board of Directors and Management Management Charles Smith // Director, President and Chief Executive Officer Charles “Chuck” Smith is the President and Chief Executive Officer for USA Inc., the parent company of the Dixie Elixirs & Edibles brand, as well as Therabis, and Aceso Wellness, two of the leading hemp supplement brands. As one of two original founders of USA Inc., Chuck helped the company grow from a “garage operation” to a 27,000 square foot state-of-the-art, vertically integrated manufacturing facility that was the first-of-its-kind for the marijuana industry. Prior to building USA Inc. and the Dixie brand, Chuck was President of Bella Terra Realty Holdings where he oversaw all aspects of the Bella Terra Resort Development Company. He was also President of Sagebrush Realty Development and responsible for developing, selling and managing residential condominium projects valued at over $85 million in revenues. Chuck has over twenty-five (25) years of experience in a variety of industries. He has a strong financial background, holding the position of Chief Financial Officer for a mid-sized retail apparel chain and has built and managed sales and marketing teams for private and publicly traded technology companies. Chuck has a Bachelor’s degree in Accounting from the University of Maryland and an MBA from the Owen Graduate School at Vanderbilt University. Mr. Smith is married and lives in Denver, Colorado. He actively participates in a wide variety of philanthropic organizations and is an avid golfer. CJ Chapman // General Counsel, Secretary C. J. Chapman joined Dixie as its General Counsel on June 18, 2018. C. J. received his A.B. in politics from Princeton University and his J.D. from the University of Denver Sturm College of Law. Prior to joining Dixie, he directed a single-family office based in New York with respect to structure, operations and legal issues. C. J. spent his entire private practice at Brownstein Hyatt Farber & Schreck, LLP in the real estate and corporate departments. He practiced at Brownstein from 2006 through 2017 and was a partner from 2013 through 2017. His practice focused on the acquisition, disposition, financing, leasing and development of various commercial real estate assets, including apartment and office buildings, sports complexes, hotels, shopping centers, and vacant land. In addition, C.J. advised various companies on corporate matters, including partnership agreements, formation of entities and general corporate governance. C.J. served as outside general counsel to one of the nation’s largest cattle feed manufacturers advising them on all corporate matters, including partnership agreements and corporate finance. Andrew Floor // Vice President of Marketing, Dixie Brands Andrew Floor leads the branding, marketing and portfolio expansion of the regulated THC product company. This includes all Dixie-branded products, the sub-brands Synergy, Mindset and Dr. Stash, as well as all new brands to be built and acquired under the THC umbrella. Mr. Floor has extensive experience in the regulated alcohol industry, building leading brands through digital and consumer marketing. Most recently he was VP Brand and Digital Marketing at Treasury Wine Estates where he led integrated campaigns that spanned traditional and eCommerce channels. Previously he was VP Marketing at Campari America’s Dark Spirits division, where he was instrumental in accelerating sales growth and consumer awareness of the Wild Turkey franchise. Mr. Floor also gained international experience through 10 years of sales and marketing roles in the United Kingdom and Australia. Ari Cohen // VP of Operations, Dixie Brands Ari leads operations for Dixie’s regulated portfolio of THC products. He is responsible for insuring scalable manufacturing processes across all markets and brands. Through leading best-in-class manufacturing, product innovation, and quality assurance, Ari works with Dixie’s affiliate partners to launch and scale operations in both medical and adult-use markets with a strong focus on continuous improvement and operational efficiencies. Prior to joining Dixie in 2017, Ari spent 10 years as the Corporate Chef for Le Pain Quotidien, a NYC-based global chain of organic bakeries.  During his time at Le Pain, Ari grew the company from 8 locations to over 200 throughout 19 countries. In his most recent role, Ari was the Chief Operating Officer of New York’s By the Way Bakery.  Ari has held leadership roles at Danny Meyer’s Union Square Café, Mangia and OTG Management. Additionally, he has worked as an operations consultant for Max Brenner, Fig & Olive and Magnolia Bakery among other global brands establishing 6 production commissaries in the US, Asia, Europe and the Middle East. Hilal Tabsh // Vice President of Marketing & Distribution, Aceso Wellness Hilal Tabsh leads the branding, marketing, portfolio expansion and development of global distribution channels for Aceso Wellness, Dixie’s leading hemp-derived cannabidiol (CBD) human dietary supplement company. The CBD wellness industry is expected to continue to experience rapid growth, enhanced by the legalization of hemp under the 2018 Farm Bill. Mr. Tabsh is a CPG sales and marketing executive with significant experience in the U.S. and globally. As EVP at Limitless Beverage, he helped establish the sales and marketing functions for the start-up company focused on unique drink platforms such as cold brewed coffee, matcha green tea and lightly caffeinated sparkling water. Mr. Tabsh previously spent more than 15 years at Red Bull, initially based in Dubai, U.A.E. with management roles spanning the Middle East, Africa and Pacific regions. He was subsequently head of sales and marketing at Red Bull North America, where he managed and grew a broad distribution network across 16 states and led a team of more than 50 professionals. Board of Directors Charles Smith // Director Charles “Chuck” Smith is the President and Chief Executive Officer for USA Inc., the parent company of the Dixie Elixirs & Edibles brand, as well as Therabis, and Aceso Wellness, two of the leading hemp supplement brands. As one of two original founders of USA Inc., Chuck helped the company grow from a “garage operation” to a 27,000 square foot state-of-the-art, vertically integrated manufacturing facility that was the first-of-its-kind for the marijuana industry. Prior to building USA Inc. and the Dixie brand, Chuck was President of Bella Terra Realty Holdings where he oversaw all aspects of the Bella Terra Resort Development Company. He was also President of Sagebrush Realty Development and responsible for developing, selling and managing residential condominium projects valued at over $85 million in revenues. Chuck has over twenty-five (25) years of experience in a variety of industries. He has a strong financial background, holding the position of Chief Financial Officer for a mid-sized retail apparel chain and has built and managed sales and marketing teams for private and publicly traded technology companies. Chuck has a Bachelor’s degree in Accounting from the University of Maryland and an MBA from the Owen Graduate School at Vanderbilt University. Mr. Smith is married and lives in Denver, Colorado. He actively participates in a wide variety of philanthropic organizations and is an avid golfer. Devin Binford // Director Mr. Binford is a Managing Member of Acreage Holdings. Mr. Binford is a seasoned finance executive with extensive financing and transaction experience. He has been involved with the legal cannabis industry since 2011, focusing primarily on sourcing, evaluating and investing in licensed dispensaries, cultivation centers, processing facilities, edibles manufacturers, alternative dosage forms companies and real estate. Prior to his role at Acreage Holdings, Mr. Binford worked as a Director in the Investment Banking Division at Tandem Global Partners where he was responsible for analyzing principal and debt investments as well as portfolio management. Before attending Columbia, Mr. Binford was a Manager in the Corporate Finance Group at The Blackstone Group. Presently, Mr. Binford serves on the Board of Directors of USA Inc. Mr. Binford graduated from Columbia University with an MSc in Real Estate Development and concentration in Real Estate Finance; he earned a B.B.A. in Finance and Computer Information Systems from James Madison University. Brian Graham // Director Brian Graham served as Chief Executive Officer and Board Member of NIOXIN Research Laboratories, Inc., a global leader in the manufacturing of hair care products. During his tenure from 2003 to 2010, Graham transitioned the company from a privately held regional consumer products business to a dominant global company recently acquired by Procter & Gamble. Under Brian’s leadership, the company’s revenues doubled and its EBITDA increased from US$1M to US$17M. Brian led the company through a rapid profitable growth phase expanding both the company’s product portfolio as well as its geographical reach. After NIOXIN’s acquisition by Procter and Gamble, Brian became a member of the P&G Salon Professional Lead Team. He continued to lead the business and the integration efforts as NIOXIN’s CEO, exceeding acquisition economics by over $20 million and led several key initiatives for the business. As result, Graham received the Platinum Power of You Award from the Division President. In 2010, Graham began investing in a variety of business across many industries. These include, big data, technology, real estate, business services, a multi-family office (Pathstone) and Fleetwood’s on Front Street (Maui) with Mick Fleetwood. In addition, Graham founded Blue Ridge Spirits and served as President of Asheville Distilling Company. In 2014, Graham founded Rise Investments International, a company focused on providing growth equity, debt financing and management resources for closely held businesses ranging from start-ups to mid-cap enterprises. Recent transactions include Hawaii Sea Spirits, PlaySight, USA Inc., Tennis Media Company, and Gozio Inc. In 1992, Graham received his Bachelor of Science degree from Georgia Southern University. He has also attended Executive Programs at the University of Michigan and in 2002 completed the Program for Management Development at Harvard University. Vincent 'Tripp' Keber, III // Director As one of two original founders of the Dixie Elixirs and Edibles company, Colorado’s premiere licensed marijuana infused Products manufacturer (MIPS), Tripp Keber is widely hailed as one of the cannabis industry’s indispensable leaders. He presently serves as a consultant to USA Inc. He is also a founding member and current board director of the National Cannabis Industry Association. Additionally since 2013, he has served as a Board Member of the Marijuana Policy Project as well as an Advisory Board member of the Medical Marijuana Industry Group in Colorado. Prior to building USA Inc. into a leader in the cannabis industry, Tripp served as Chief Operating Officer for Bella Terra Resort Development Company, and EVP of Business Development for Sagebrush Realty Development. He has a B.S. in Political Science from Villanova University and currently resides in both Aspen and Denver with his family. While he is involved in several charitable organizations located within his community, his greatest philanthropic passion is assisting in the research and development of cannabis support for veterans suffering from PTSD. Melvin Yellin // Director Mr. Yellin is a Founder of Acreage Holdings, a vertically integrated cannabis company licensed in 12 states. He is also currently a director of USA Inc., having previously been a partner at Tandem Global Partners, which was a globally focused money manager that offered investment services to sophisticated institutions and individuals, focusing primarily on alternative investment strategies. Prior to joining Tandem. Mr. Yellin spent the bulk of his career at Bankers Trust Company and was a Partner, Executive Vice President and General Counsel when it merged with Deutsche Bank. He had global responsibility for over 350 professionals and served on the Bank’s Risk Committee, New Business Committee and its Investment Banking Management Committee, which included the significant Venture Capital business. Mr. Yellin was a member of the Symbol Technologies, Inc. (NYSE) Board of Directors (Audit, Compensation and Governance Committees) as well as a director of numerous privately held companies and not-for-profits. Symbol was the world’s premier developer of bar code and RFID software and hardware. Symbol was later successfully sold to Motorola. During his career, Mr. Yellin has acted as chairman, speaker and author for numerous business organization programs including those run by the Conference Board, the NACD, Columbia Business School (ODX) and the Wisconsin School of Business. Mr. Yellin served as the President of the New York Chapter of the National Association of Corporate Directors and a member of the New York Clearing House GC Committee. He was selected for “Who’s Who in American Law,” The International “Who’s Who of Contemporary Achievement” and the “International Directory of Distinguished Leadership”. [wd_hustle id=”cision-sign-up” type=”embedded”] Dixie creates joy through delicious cannabis experiences. We are proud to provide our customers with products infused with triple lab tested and CO2 extracted THC. From balms and bath soaks to tinctures and truffles, each of our products offers premium, consistent and reliable results you can trust. information PRODUCTS Elixirs MINI ELIXIR SIGNATURE ELIXIRS Chocolates SYNERGY Gummies SIGNATURE SYNERGY FAST-ACTING PEAK LIMITED TIME OFFERINGS Mints Bursts Tarts EDUCATION Delivery Systems Marijuana 101 Elixir Mocktail Recipes SYNERGY Gummy Family ABOUT About Dixie FAQ’s BLOG BUY Store Locator INVEST Investor Dashboard Financial Information Press Releases Investor Contacts Stock Information Detailed Stock Chart TEST RESULTS get in touch Phone Email Location About Legal Wholesale INFORMATION PRODUCTS Elixirs MINI ELIXIR SIGNATURE ELIXIRS Chocolates SYNERGY Gummies SIGNATURE SYNERGY FAST-ACTING PEAK LIMITED TIME OFFERINGS Mints Bursts Tarts EDUCATION Delivery Systems Marijuana 101 Elixir Mocktail Recipes SYNERGY Gummy Family ABOUT About Dixie FAQ’s BLOG BUY Store Locator INVEST Investor Dashboard Financial Information Press Releases Investor Contacts Stock Information Detailed Stock Chart TEST RESULTS GET IN TOUCH 855-420-6334 Info@DixieBrands.com Media@DixieBrands.com Sales@DixieBrands.com © 2025 All rights reserved. Dixie Brands TOP"
    }
  ]
}