{
  "fuentes": [
    {
      "url": "https://spot-sample-10241.spotapps.co/",
      "email": "info@docfords.com"
    },
    {
      "url": "https://www.fortmyersbeach.org/member/doc-fords-rum-bar-grille/",
      "email": "info@fmbchamber.com"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/doc-fords-rum-bar-grille-sanibel-island/39704",
      "email": "dfsanibel@docfords.com"
    }
  ],
  "mails": [
    "dfsanibel@docfords.com",
    "info@docfords.com",
    "info@fmbchamber.com"
  ],
  "nombre_sitio": "docfords.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://spot-sample-10241.spotapps.co/",
      "text": "Doc Ford's Rum Bar & Grille-Sanibel - Sanibel, FL Skip to Main Content Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials Events Locations the video sound on or off Our story It’s more than just a place to eat. No trip to the islands is complete without a stop by Doc Ford’s, just ask the locals. Read more about us Our Menu We take pride in providing our customers with only the freshest seafood and ingredients available, and where all of our dishes are prepared fresh in-house every day. We proudly offer daily specials for lunch and dinner, a full menu from open to close, signature cocktails, and an extensive Premium Rum Selection. Come see us at Doc Ford's! View Menu Reservations Make Some Memories We recommend making a reservation ahead of time. Book your table today! Book Now a table Online Store & Gift Cards Shop Our Limited Supply Shop Now our products Yucatan Shrimp The Freshest Seafood And Ingredients Available View Menu Welcome to Doc Ford's We Offer Live Music At Doc Ford's Events Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing We're growing & hiring! If You're In This Business, You Want To Work With Us. We're looking for talented and hungry people both front and back of house that share our same vision of hospitality and success. We pride ourselves on providing exceptional food, service and hospitality to our guests and are always looking for people who share our vision. Apply Now for a job Events National Drink Beer Day Sunday September 28th Join us for National Drink Beer Day on Sept 28th and try one of our many craft brews! National Taco Day Saturday October 4th As if we needed an excuse... join us for National Taco Day October 4th! Stop events carousel Play events carousel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Doc Ford's Rum Bar & Grille-Sanibel Reviews Review by - Yelp Melissa L: I really enjoyed lunch today. I had the  Yucatan Shrimp with a Doc's Mojito. My husband had the Grouper Sandwich which he enjoyed. My nephew had the Cuban. The food and drinks were prepared and presented well... Review by - Yelp Annie N: Another year and another FANTASTIC meal at Doc Fords! This is probably our most favorite restaurant on the island, so much we visit twice during the week... Review by - Yelp D.K. M: Always delicious food and excellent, friendly service. The Yucatan Shrimp is a favorite for us - a must try if you haven't!... Review by - Yelp Travis Z: Best Restaurant On Sanibel Island. I love the owners, the employees, the service, the bartenders in particular, and everything on the menu is delicious. Review by - Yelp Crystal F: This place is so so good lobster roll was legit...right out of New England. Shri or tacos were filled with tasty shrimp and the drinks are so delicious. We will come back here every time. Amazing STAFF!! Stop reviews carousel Play reviews carousel Newsletter Location 2500 Island Inn Road Sanibel, FL 33957 708 Fishermans Wharf Ft Myers Beach FL 33931 610 2nd Ave NE St. Pete FL 33701 8790 Bay Pines Blvd. St. Pete FL 33709 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 10:00 PM Find us on... Facebook page Instagram page Yelp page Contact us (239)-472-8311 info@docfords.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter"
    },
    {
      "url": "https://www.fortmyersbeach.org/member/doc-fords-rum-bar-grille/",
      "text": "Doc Ford's Rum Bar & Grille - Fort Myers Beach Chamber EXPLORE Search Search Plan Your Trip Request Free Vacation Information Stay Play Dine Shop Fort Myers Beach Map Day Passes For Local Resorts Real Estate Weddings Deals Events Full Event Calendar Find Live Music Find Happy Hours Island Hopper Songwriter Fest American Sand Sculpting Championship Bayside Park Concert Series List of Major Events Service Businesses Hurricane Preparedness Resources General Info Blog Job Postings Beach And Water Conditions Beach Web Cams Getting To Fort Myers Beach Fort Myers Beach Map Trolley & Tram Parking And Mooring Beach Wheelchair Rentals View Our Free Visitor’s Guide South Florida Water Management District Recreational Guide Rainy Day Activities Tides & Fishing Information The Pets Of FMB Lee County Florida Elected Officials Check Availability Sign Up For Our Newsletter Chamber Information Chamber Location FMB Chamber Board of Directors and Staff Directory Fort Myers Beach Chamber Water Foundation For Businesses Networking Events Business Events & Webinars FGCU Career Recruiting Events FGCU Resource List Join The Chamber Advertise With Us Chamber Chatter Archive Open Businesses Menu Menu Follow Us facebook twitter instagram Join the Chamber Member Login (239) 454-7500 Plan Your Trip Request Free Vacation Information Stay Play Dine Shop Fort Myers Beach Map Day Passes For Local Resorts Real Estate Weddings Deals Events Full Event Calendar Find Live Music Find Happy Hours Island Hopper Songwriter Fest American Sand Sculpting Championship Bayside Park Concert Series List of Major Events Service Businesses Hurricane Preparedness Resources General Info Blog Job Postings Beach And Water Conditions Beach Web Cams Getting To Fort Myers Beach Fort Myers Beach Map Trolley & Tram Parking And Mooring Beach Wheelchair Rentals View Our Free Visitor’s Guide South Florida Water Management District Recreational Guide Rainy Day Activities Tides & Fishing Information The Pets Of FMB Lee County Florida Elected Officials Check Availability Sign Up For Our Newsletter Chamber Information Chamber Location FMB Chamber Board of Directors and Staff Directory Fort Myers Beach Chamber Water Foundation For Businesses Networking Events Business Events & Webinars FGCU Career Recruiting Events FGCU Resource List Join The Chamber Advertise With Us Chamber Chatter Archive Open Businesses Search Home // Members // Dine // Waterfront & Outdoor Dining // Doc Ford’s Rum Bar & Grille Doc Ford’s Rum Bar & Grille 708 Fisherman's Wharf Ft. Myers Beach, FL 33931 call Doc Ford’s Rum Bar & Grille at (239) 765-9660 Visit Website for Doc Ford’s Rum Bar & Grille facebook twitter instagram About Us Dine at Doc Ford's, the #1 restaurant for \"Everyday Eats\" in the country on TripAdvisor in 2021! Come by boat or by car for great waterfront dining on Fort Myers Beach. You can dine outdoors or cool off in  the A/C, but either way you can enjoy great food and live music with a view of the back bay. You can also catch your favorite game! And if you've got an event we can provide the perfect venue! Nearby Places Play Dine 1 Nautical Tiki Cruises 0.24 miles away 2 Adventures In Paradise Fort Myers Beach 0.24 miles away 3 Adventures in Paradise Fort Myers Beach 0.24 miles away 4 Moss Marina 0.28 miles away 5 Cruisin Tikis Fort Myers Beach 0.28 miles away Doc Ford’s Rum Bar & Grille 1 Doc Ford’s Rum Bar & Grille 0.02 miles away 2 Dixie Fish Co. 0.06 miles away 3 Dixie Fish Co. 0.06 miles away 4 Nervous Nellie’s 0.23 miles away 5 Snug Harbor Waterfront Restaurant 0.24 miles away Doc Ford’s Rum Bar & Grille We're making waves! Sign up and receive exclusive offers, updates and more! ADA Compliance is in the works. Your patience is appreciated. SIGN UP FOR OUR E-NEWSLETTER Links Home Contact Us Play Stay Dine Shop (239) 454-7500 100 Lover's Lane Fort Myers Beach 33931, FL Follow Us facebook twitter instagram Make Your Business Stand Out Take the opportunity to work with the Fort Myers Beach Chamber of Commerce to create a unique advertising experience for your business. Learn More >>> Web Support & Maintenance by Island IT Pros Contact This Member ×"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/doc-fords-rum-bar-grille-sanibel-island/39704",
      "text": "Doc Ford's Rum Bar & Grille - Sanibel Island | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 76° Now 76° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Amenities Amenities Share Share Visit Website Doc Ford's Rum Bar & Grille - Sanibel Island Doc Ford’s Sanibel “Home of the Island Mojito” is our flagship location. Just off Island Inn Road across from Bailey’s Shopping Center .  If you’re hoping to run into Randy Wayne White, then this is the place to do it as he can be found writing here on many nights. With 2 dining rooms and an outdoor patio, where you decide to enjoy the ambiance is up to you!  A trip to Sanibel isn’t complete without lunch or... Load More Doc Ford’s Sanibel “Home of the Island Mojito” is our flagship location. Just off Island Inn Road across from Bailey’s Shopping Center .  If you’re hoping to run into Randy Wayne White, then this is the place to do it as he can be found writing here on many nights. With 2 dining rooms and an outdoor patio, where you decide to enjoy the ambiance is up to you!  A trip to Sanibel isn’t complete without lunch or dinner with us at Doc Ford’s! So welcome to Doc Ford’s Sanibel Island This beautiful new restaurant’s namesake, the fictional Doc Ford, was conceived in desperation just down the road at Tarpon Bay Marina where the owner, Mack, employed a small quirky cast of characters, one of whom wanted to be a writer. That was 30-years and 3,000 charters ago, near the end of my career as a fishing guide. Thank karma, or fate, or blind blessed luck, but I love the symmetry suggested by Doc’s return to Tarpon Bay Road. The symmetry didn’t seem so blessed at the time. In 1988, the federal government informed our little marina family that the bay would soon close to powerboat traffic. We fishing guides were out of a job. Aside from a license to drive big boats, I wasn’t qualified to do anything useful, but I did own a typewriter. Eighteen months later, my first novel, Sanibel Flats , was published. It introduced a few (very few) readers to marine biologist Doc (Marion D.) Ford, and his unrepentant hipster pal, Tomlinson. They were hard core tropic travels; decent men with senses of humor, each devoted, in his way, to the obligations of friendship, family and their respective moral compass. Both attracted trouble. Both men lived secret lives. Sanibel Flats did nothing to threaten their anonymity — sales were minuscule. National reviews, however, were enthusiastic, so I continued to chronicle the adventures of Doc, Tomlinson, and my marina pals, all of whom orbited freely around a semi-fictional “Dinkins Bay.” Now, twenty-four novels later, it is an honor, and just plain fun, to return as a member of the Doc Ford’s restaurant family — and we are a family, top to bottom, same as the same quirky, excellence-driven characters who populate my novels. By virtue of being here, you are a member, too. My partners, Marty and Brenda Harrity, and Mark Marinello, would agree, and here’s why: these islands have a gift for attracting people of kindred sensibilities. Some are famous, most are not, and it doesn’t matter. You are here. These islands have chosen you. Why argue? — Randy Wayne White Load Less 26.434537, -82.080727 (239) 472-8311 2500 Island Inn Rd. Sanibel Island , FL 33957 United States dfsanibel@docfords.com View Website Key Features Where to Eat Restaurants Seafood Bars, Lounges & Clubs Gallery Amenities Cuisine Served Seafood Meals Served Dinner, Lunch Restaurant Features Full Bar 26.434537, -82.080727 (239) 472-8311 2500 Island Inn Rd. Sanibel Island , FL 33957 United States dfsanibel@docfords.com View Website Key Features Where to Eat Restaurants Seafood Bars, Lounges & Clubs What's Nearby Casa Ybel Resort Make your special moments into lasting memories at Sanibel Island’s most idyllic retreat. Unwind at the historic Casa... Bailey-Matthews National Shell Museum & Aquarium T he Bailey-Matthews National Shell Museum connects people to the natural world through their love of shells and the... Rachel Pierce Art Gallery Rachel Pierce paints modern, fantastical, original art in oil and acrylic reflecting the natural beauty and abundant... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    }
  ]
}