{
  "fuentes": [
    {
      "url": "https://www.dogstreetpub.com/contact",
      "email": "contact@dogstreetpub.com"
    },
    {
      "url": "https://www.blackdogpubcompany.co.uk/",
      "email": "bookings@threestagspub.com"
    },
    {
      "url": "https://www.goodnewsnetwork.org/pub-owner-adopts-dog-after-it-dashed-into-bar-when-owner-died-in-car-crash/",
      "email": "credit-@cousinhomer-screengrab-e1757320051549-100x70.jpg"
    },
    {
      "url": "https://www.goodnewsnetwork.org/pub-owner-adopts-dog-after-it-dashed-into-bar-when-owner-died-in-car-crash/",
      "email": "credit-@cousinhomer-screengrab-e1757320051549-218x150.jpg"
    },
    {
      "url": "https://www.doganddoubletsandon.co.uk/contact",
      "email": "info@thelewispartnership.co.uk"
    },
    {
      "url": "https://royalexchangelindford.co.uk/contactus/",
      "email": "bookings@royalexchangelindford.co.uk"
    },
    {
      "url": "https://loveyourpub.co.uk/contact-us/",
      "email": "info@loveyourpub.co.uk"
    },
    {
      "url": "https://www.swananddog.co.uk/contact-us",
      "email": "swananddog@shepherd-neame.co.uk"
    },
    {
      "url": "https://www.swananddog.co.uk/contact-us",
      "email": "swananddog@villagegreenrestaurants.com"
    },
    {
      "url": "https://pubdogcolorado.com/about-us/",
      "email": "info@pubdogcolorado.com"
    }
  ],
  "mails": [
    "bookings@royalexchangelindford.co.uk",
    "bookings@threestagspub.com",
    "contact@dogstreetpub.com",
    "credit-@cousinhomer-screengrab-e1757320051549-100x70.jpg",
    "credit-@cousinhomer-screengrab-e1757320051549-218x150.jpg",
    "info@loveyourpub.co.uk",
    "info@pubdogcolorado.com",
    "info@thelewispartnership.co.uk",
    "swananddog@shepherd-neame.co.uk",
    "swananddog@villagegreenrestaurants.com"
  ],
  "nombre_sitio": "dogpubsocial.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dogstreetpub.com/contact",
      "text": "Contact — DoG Street Pub 0 Skip to Content Menus Private Dining About Shop Running Club Place To-Go Order Open Menu Close Menu Place To-Go Order Menus Private Dining About Shop Running Club Open Menu Close Menu Menus Private Dining About Shop Running Club Place To-Go Order Contact us If you have any questions or comments, please contact us via email or phone, or send us a message using the contact form. Email email@example.com Phone (555) 555-5555 A DAVID EVERETT RESTAURANT Connect with Us Sign up for our newsletter to receive the latest news and updates Email Address SUBSCRIBE Thank you! Merchants Square 401 W. Duke of Gloucester St. Williamsburg, VA 23185 757.293.6478 contact@dogstreetpub.com Sunday, Monday, & Thursday 11:30 - 3:00 / 4:00 - 8:00 Friday & Saturday 11:30 - 3:00 / 4:00 - 9:00 Closed Tuesday & Wednesday BLUE TALON BISTRO DOG STREET PUB"
    },
    {
      "url": "https://www.blackdogpubcompany.co.uk/",
      "text": "Black Dog Pub Co. - The Black Dog Pub Company 0 Skip to Content Black Dog Pub Co. Home The Black Dog Say Hello Open Menu Close Menu Black Dog Pub Co. Home The Black Dog Say Hello Open Menu Close Menu Home The Black Dog Say Hello The Black Dog Pub Company was founded by Paul Graham in 2013. The independent group owns and runs four venues in London: The Mayflower Pub in Rotherhithe, The Prince of Wales Pub in Kennington, the George & Dragon, Thames Ditton and The Three Stags Pub in Kennington. With so many pubs across the capital at threat from property developers, Paul and his team are committed to protecting the heritage of some of London’s oldest independent pubs. Since 2001, London has lost an average of 81 pubs a year, and with that the social and cultural value they bring. By preserving the characteristics and rich history of these old pubs, the Black Dog Pub Company is ensuring some of London’s most unique pubs can continue to be enjoyed by their local communities and visitors from around the world. The company name is inspired by Ringo, Paul’s gorgeous black haired Airedoodle. When he’s not posing for social media photos for fans you can find Ringo hanging out with our locals or making mischief in the local park with his friends and Mayflower regulars “The Salty Seadogs”. The Mayflower, Rotherhithe Having taken over The Mayflower in 2010, Paul and his team have turned the much loved local into one of London’s best pubs. A traditional English pub surrounded by cobbled streets, The Mayflower is a hidden gem in the heart of Rotherhithe. The outside decked jetty and cosy candlelit restaurant have stunning river views and you can spot the original 1620 mooring point of the Pilgrim Father’s Mayflower ship, warm yourself by the open fire and imagine who may have been sitting in your seat 400 years ago! The Mayflower kitchen offers consistently delicious food and people return again and again. Visit The Mayflower website here . The Prince of Wales, Kennington The Black Dog Pub Company took over The Prince of Wales in 2019, giving this long-established local pub a beautiful interior renovation and with a new chef at the helm we’ve overhauled the food, beer and wine served. With a small seating area outside, you can relax with a first-class pint or a glass of wine. Visit The Prince of Wales website here . George&Dragon, Thames Ditton A much loved local in the heart of Thames Ditton and tucked away off the high street, the George & Dragon is a wonderful traditional English pub with a large, open garden space, perfect for summer evenings. The venue has just undergone a beautiful interior renovation which is both welcoming, comfortable and cosy with some wonderful eclectic artwork. Three open fires make it a cosy place to enjoy the company of fabulous food and drink. The menu has been revamped and offers delicious, classic home cooked British dishes using local and fresh ingredients and is complemented by a great range of well-kept traditional ales, craft beers, local gins and fine wines. There is a large outside space which is beautifully lit and has heated lamps for those cooler evenings. Live sport is shown on various screens both inside and out. Visit the George & Dragon website here. The Three Stags Pub, Kennington The Black Dog Pub Company took over The Three Stags in 2023. Built in 1891 the pub sits opposite the Imperial War Museum in Kennington and is an excellent example of an old London pub with many original features. It boasts a Chaplin’s Corner where the famous Charlie Chaplins father used to drink and where Charlie saw his dad for the very last time. Enclosed with dark wood and frosted windows it makes for a great space for a private drink and dine. The Three Stags serves a fabulous All Day Menu, Craft Beers & Sundays Roasts plus there’s also a private room on the first floor available for dining and events. Visit the Three Stags Website website here . With over 30 years experience in the hospitality industry in the UK, Australia and New Zealand, Paul is passionate about finding unique pubs and restaurants in London and working with his team to bring out the individuality of each space. Whether that’s enjoying a pint at The Prince of Wales while watching a petanque match unfold in the beautiful Georgian square, or a roast dinner by candlelight at The Mayflower on a Sunday, our team are committed to making sure your experience of our pubs is like none other in London. We’re really proud that most of our team, from Pub Managers and bar staff to Head Chefs and sous chefs, have been with us since we launched in 2010. We know the difference this sense of family makes to our staff, our regulars and to our guests and we encourage any new faces in our venues to ask us about the history of our pubs from our knowledgeable team. If you have an enquiry about any of our venues or would like to discover more about The Black Dog Pub Company please email us here . Thank-you The Black Dog Pub Company 117 Rotherhithe Street Rotherhithe London SE16 4NF E: hello@blackdogpubcompany.co.uk The Mayflower Pub 117 Rotherhithe Street Rotherhithe London SE16 4NF T: 020 7237 4088 E: mayflowerrotherhithe@gmail.com The Prince of Wales Cleaver Square Kennington, London, SE11 4EA T: 0207 735 9916 E: hello@princeofwaleskennington.co.uk The George & Dragon High Street, Thames Ditton, Surrey, KT7 0RY E: hello@thegeorgeanddragonpub.com Three Stags Pub 67-69 Kennington Rd London, SE1 7PZ T: 020 7928 5974 E: bookings@threestagspub.com"
    },
    {
      "url": "https://www.goodnewsnetwork.org/pub-owner-adopts-dog-after-it-dashed-into-bar-when-owner-died-in-car-crash/",
      "text": "Pub Owner Adopts Dog After it Dashed into Bar When Owner Died in Car Crash–Now He’s a Local Favorite Sign in Join Good News Horoscopes USA World Inspiring Animals Laughs Good Earth Heroes Kids Self-Help Founders Blog Science Health Arts & Leisure Celebrities Sports Religion Reviews At Home Business Top Videos Good Talks Good Gardening Good Life Good Business Good Health GNN Podcast Good Gifts Get Involved Members Become a Member Submit Your Own Good News Submit a News Link or Photo Gift Memberships GNN Merch About Us About Us New Book Good News App Founder’s Blog Contact Press RSS Feeds Legal Español Sign in Welcome! Log into your account your username your password Forgot your password? Sign up Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email Search Sign in / Join Cart Sign in Welcome! Log into your account your username your password Forgot your password? Get help Create a Free Account Create a Free Account and join the GNN community! your email your username A password will be e-mailed to you. Password recovery Recover your password your email A password will be e-mailed to you. Good News Network Good News All Horoscopes USA World Inspiring Animals Laughs Good Earth Heroes Kids Self-Help Founders Blog Science Health Arts & Leisure Celebrities Sports Religion Reviews At Home Business Top Videos USA Chicago River Follows the Seine to Become Biodynamic and Swimmable Once Again World This Year’s Nice Rice Price Marks an 18-year Low Amid a Doubling of Per-Acre Yield World Brazil Records 65 Percent Drop in Amazon Area Burned by Fire, Lowest Since Monitoring Began Inspiring Police Find Lost Plushie While Teaching Boy a Valuable Lesson: ‘There are great people in this world’ Good Talks All Good Gardening Good Life Good Business Good Health GNN Podcast Good Life The Science of How Your Brain Forms Habits (and How to Take Control) Good Life How To Love Yourself: 5 Ways to Let Go of the River Bank and Go With the Flow Good Gardening Good Gardening Week 15: All About Spring Flowers—Plus Last Week’s Early Growing Images Good Talks GNN Founder Talks With BBC World Service About Positive News in the Media Landscape (Listen) Good Gifts Affiliates All Your Nutrition in a Daily Drink That Also Feeds Hungry Kids Affiliates GNN Paperback Book: “And Now, The Good News” Affiliates Holistic Patches Relieve Anxiety, Cramps, or Nausea – Without Drugs Affiliates The Heartwarming Feel-Good Book We All Need Affiliates ‘Within Good’ – Reminder Bracelet Get Involved Members Become a Member Submit Your Own Good News Submit a News Link or Photo Gift Memberships GNN Merch About Us About Us New Book Good News App Founder’s Blog Contact Press RSS Feeds Legal Español Español Un Mapa te Permite Ver Como tu Hogar se ha Movido por el Continente en estos 750 Millones de Años Español Las Playas han Visto un Incremento Enorme en Anidación de Tortugas Laúd Después de las Restricciones a los Turistas en Tailandia y Florida Español Mira Mil Millones de Años de Movimiento de Placas Tectónicas Formando Nuestros Continentes en 40 Segundos Español Un Pingüino Salta en un Bote para Evitar ser Comido por una Ballena Asesina – MIRA el Video Español El Diseñador de Nueva Zelanda Crea un Ingenioso Tragaluz con Energía Solar que Desaliniza el Agua para Beber Good News Good Talks Good Gifts Home All News Inspiring Pub Owner Adopts Dog After it Dashed into Bar When Owner Died... All News Inspiring Animals Pub Owner Adopts Dog After it Dashed into Bar When Owner Died in Car Crash–Now He’s a Local Favorite By Good News Network - Jan 25, 2025 Shih Tzu dog named Rex adopts English pub as new home –SWNS An adorable dog was adopted by a kind-hearted pub manager after the pooch’s owner died in a car crash. The two-year-old Shih Tzu named Rex dashed into the busy bar after surviving the tragic car accident. Regulars at The Leaping Wolf in Wolverhampton, England, were left startled when the lost pooch ran into the pub during a football match. Manager Dan Morris caught the runaway pup and took him to the veterinarian to see if he was OK and inquire about where he could have come from. But, Dan was shocked to learn that Rex’s owner had passed away. That’s how the frisky pup came to be a new regular at the pub—and a real hit with locals. “It was last year’s Liverpool versus Wolves match, it was crammed inside and outside the bar,” said the 33-year-old barkeep. “Everyone said there was a dog running around and we had no idea where he came from.” Dan Morris with Shih Tzu dog adopted by his pub – SWNS “He has been great, all the customers love him and they even buy him presents. “He loves attention, he loves treats… He’s so spoiled: if we have takeaway, he has takeaway, if we have roast dinner he has roast dinner. “When we first took him, there was a period where it was difficult. When you’re trying to run a business and a new dog is running around the place it can be tough. But now he just likes to sit down and chill—its like he’s found his home now. “He’s well trained and we’re so thrilled to have him with us.” He also now acts ‘like a bouncer’ for The Leaping Wolf with his uncanny ability to sniff out troublemakers. He’s been known to bark at visitors who tend to be the ones that end up causing trouble in the pub. Shih Tzu Rex at The Leaping Wolf pub, his new home – SWNS “He sits and waits for people to come in and inspects them. We don’t know how he knows which guests are up to no good, but he’s usually right,” Dan told SWNS news. ANOTHER HAPPY ENDING : Saddest Dog in Town Spent Over 2 Years at a Shelter But Finally Gets a Home for Christmas “He’s a really well behaved dog—but I think he needs a girlfriend.” PUT A SMILE ON SOMEONE’S FACE: Share the Pub Dog’s Good Fortune On Social Media… Want A Morning Jolt of Good News? Sign Me Up TAGS Fate Pets Fun Dogs Surprise England Cute Accidents Leave a Reply Cancel reply You must be logged in to post a comment. Choose Your News Choose Your News Select Category Good Talks Good Gardening Good Life Good Business Good Health GNN Podcast All News Horoscopes USA World Inspiring Animals Laughs Good Earth Heroes Kids Self-Help Founders Blog Science Health Arts & Leisure Celebrities Sports Religion Reviews At Home Business Top Videos Español Good Bites This Day In History Quote of the Day Want A Morning Jolt of Good News? Sign Me Up Good Talks Shop About Support GNN App Contact Privacy Policy Privacy Tools © Copyright 1997–2025 GNN, LLC"
    },
    {
      "url": "https://www.doganddoubletsandon.co.uk/contact",
      "text": "Contact Us | Pub in Staffordshire | Dog and Doublet Menu Home Eat Breakfast Menu Main Food Menu Afternoon Tea Burger Night Grill Night Sunday Lunch Sleep Bedrooms Wedding Accommodation Offers & Breaks Out & About Dog Friendly Breaks Christmas & New Year Gift Vouchers Contact Directions Blog FAQs Eat Breakfast Menu Main Food Menu Afternoon Tea Burger Night Grill Night Sunday Lunch Sleep Bedrooms Wedding Accommodation Offers & Breaks Out & About Dog Friendly Breaks Christmas & New Year Gift Vouchers Contact Directions Blog FAQs Book a Table Book a room Contact Us Get in Touch We are always delighted to receive your enquiry. If you would like to make a booking or have any questions, please do get in touch. Email: info@thelewispartnership.co.uk Phone: +44 (0)1889 508331 Postal General Enquiries: Dog & Doublet Inn, Sandon, Stafford, ST18 0DJ. Treat someone special Gift Vouchers Take a Look Join our email newsletter Sign me up! LOADING... There was a problem adding you to the subscriber list. Please try again. Thanks for subscribing. Please check your inbox for a welcome email. Subscribe We never sell on data or contact details. Please view our privacy policy for more information Terms & Conditions Privacy Policy Sitemap Recruitment Where to find us Twitter Facebook Instagram © 2021 Content Copyright The Lewis Partnership  |  Website by Clockwork Marketing Our Cookie Policy We use cookies on our website. Read More Accept Cookies"
    },
    {
      "url": "https://royalexchangelindford.co.uk/contactus/",
      "text": "Contact Us | The Royal Exchange | Dog Friendly Pubs Hampshire Skip to content Call us on 01420 488118 Menu Book Menus Offers What’s On Private Dining The Local Area Gallery Contact Menu Book Menus Offers What’s On Private Dining The Local Area Gallery Contact Contact us Dog friendly Car charging Access Baby changing Onsite parking Free WiFi Outside seating Bookings bookings@royalexchangelindford.co.uk 01420 488118 Find us The Royal Exchange Liphook Road Lindford Bordon GU35 0NX ///buns.loafing.detergent Please see map below to view our location. Name Please enter your name. Email Address Please enter a valid email address. Subscribe to our Mailing List! Thanks for subscribing! Keep an eye out for our future Newsletters where you can find offers and events. Something went wrong. Please check your entries and try again. Access Statement View our Access Statement here Name Please enter your name. Email Address Please enter a valid email address. Subscribe to our Mailing List! Thanks for subscribing! Keep an eye out for our future Newsletters to keep upto date with offers and events. Something went wrong. Please check your entries and try again. 01420 488118 The Royal Exchange Liphook Road, Lindford, Bordon Hampshire GU35 0NX Opening hours: Mon to Thurs: 12:00 - 22:00 Fri to Sat: 12:00 - 23:00 Sun: 12:00 - 21:00 Bank Holiday Monday: 12:00-21:00 Kitchen hours: Mon to Thurs: 12:00 - 14:30 | 17:30 - 20:30 Fri to Sat: 12:00 - 14:30 | 17:30 - 21:00 Sun: 12:00 - 16:00 Bank Holiday Hours are the Same Term's and Condition's Scroll To Top"
    },
    {
      "url": "https://loveyourpub.co.uk/contact-us/",
      "text": "Contact Us Love Your Pub Group for great pubs across Hampshire Skip to content Subscribe Venue Guide Pubs on the Market Venue News Pub Jobs Pub Support Brand & Trade Suppliers About LYP About us Meet the team Follow Pierre Our services Contact us Venue Guide Pubs on the Market Venue News Pub Jobs Pub Support Brand & Trade Suppliers About LYP About us Meet the team Follow Pierre Our services Contact us Contact Love Your Pub today JOIN THE LOVE YOUR PUB GROUP Do you run your own premises, offer premium services to pub owners or are you a supply or brand owner? Get in touch with our friendly team today to find out how could become part of “The Love Your Pub Group” community, be showcased on our site and across our social media groups. Phone: 02393 880220 Email: ku.oc.bupruoyevol obfsctd-911f37 @ofni Please fill in the form below and our team will be in touch shortly. Contact Form Name Pub Name Address City Postcode Telephone Email What services are you interested in? Pubs on the Market Pub Jobs Social Media Management Venue Guide Other Are you a Greene King Customer? Yes No Message I consent to have this website store my submitted information so they can respond to my enquiry. Submit The Love Your Pub Group & its subsidiaries are a trading name of Hardys Consultancy Ltd Units 1-2 Warrior Court, 9-11 Mumby Road, Gosport, Hampshire, United Kingdom, PO12 1BS Company number: 09604785 working in partnership with Happy clients The Love Your Pub group has been a pleasure to work with, they truly understand the local element of a business and execute this so well. The marketing campaigns, photography and videos tutorials of the venues, are of such high quality and are to a consistent standard (you would expect to spend a fortune to receive the end product you’re left with). Great first year working with LYPG and we will continue the partnership moving forward! Karl Bradford Prospect Account Manager Molson Coors From the minute I met Dave and he introduced me to his business love your pub I knew I was in great hands. Straight away the reach to the public had a positive impact. If ever I had an issue in any area of my business that I wanted some advice or just to chat through Dave was the person I would instantly turn to. Promoting my business and even providing the most amazing photos of our food and venue are no longer a worry as love your pub look after this for me. The love your pub group offer outstanding value for all the work they have done with my business. Thank you Dave for all the support. Simon Smith Managing Director Skylark Golf & Country Club Love Your Pub has been very helpful for us as a new business just starting out, providing us with extra support and helping us to get our brand and name out there. Personally I love the design of the website as its very easy to search for bars and see the main features of each venue. Dave is always there for any advice and new ideas always keeping in contact and prompting me to publish and advertise more which I find a “Godsend” as I sometimes find myself consumed in other tasks. The company have also taken some fantastic photos of our bar and dishes for the menus. We are very glad to be part of The Love Your Pub Group” Danny O’Brien Owner The Grapes “Working with Love Your Pub has proved to be an effective collaboration for Booker at a regional level. It enables us as a business to provide a solution to our clients in the world of marketing that we didn’t have before. We have a solid relationship now with The Love Your Pub team & look forward to continuing that relationship moving forward.” Martin Bigwood Catering Development Manager Booker Portsmouth “The Love Your Pub Group gives us the opportunity to get the word out about what’s going on within our Pub the way we want to. Love Your Pub can communicate about what’s happening in REAL time within our kitchens to a wider audience specifically in the city that we trade in which in turn enables customers to come visit us and try something new and exciting from our menus. Its been fantastic to have bookings as a result of The Love Your Pub Group particularly over the Christmas period.” Jack Preston, Patisserie Owner , Sweet Science Patisserie “The Love Your Pub Group’ is a fantastic way for people to find a place that is exactly right for their needs. Whether its Cask Ale or a dog friendly pub you are looking for, ‘The Love Your Pub Group’ will give you the best results from the local area.  Since joining with ‘The Love Your Pub Group’ we have been able to utilise their range throughout, including social media and the main website to reach out more especially to those looking for what we are offering in REAL time. A cracking idea!” Matt Chapman, The Marmion Bar & Kitchen Facebook Vimeo Instagram Love Your Pub is a multi service hospitality platform which includes a social media agency, pub recruitment channel, guide and much more. Listing your pub with Love your pub on the guide and taking advantage of our social media management service will boost your visibility as Love Your Pub is the biggest online hospitality guide there is. Alongside our guide and social media package we offer a range of pub support, pubs on the market and much more. about us meet the team venue news pub support brand & trade hospitality jobs pubs on market follow Pierre contact us our services SUBSCRIBE disclaimer terms & conditions The Love Your Pub Group ®, “Pierre The Pug” ® & Follow Pierre ® are licensed trademarks of Hardys Consultancy Ltd. All written content and imagery appearing on this website & third party social media pages which we provide services for remain the intellectual property of Hardys Consultancy Ltd both during & after any services we have provided to our clients. If you wish to use any of our material from this site and our archives, please contact us to obtain both permissions & rate cards for external use. Love Your Pub © All Rights Reserved 2025 | Website Designed & Developed by Capture Design Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Venue News, Popup - Newsletter sign up First Last Email Terms & Conditions I confirm that I am over the age of 18 I Agree with Terms & Conditions Subscribe"
    },
    {
      "url": "https://www.swananddog.co.uk/contact-us",
      "text": "The Swan & Dog Ashford - Get in touch Swan and Dog Ashford Menus History Local area Contact us Contact us Book a table Follow us on Facebook Tripadvisor Instagram Thinking about a gift Buy a loved one a voucher Join our club Sign up to our newsletter Careers with Shepherd Neame Careers with Shepherd Neame Ways to get in touch General enquiries Looking to dine in or searching for the perfect location for your upcoming special occasion? You can speak to one of our team on 01233 643222 or alternatively send us an email using the link below. Send an email Feedback & comments If you've been to the Swan & Dog and have any feedback for us please click below to complete our short feedback form. SEND FEEDBACK Opening times Opening times Monday - Thursday 12:00 - 22:00 Friday & Saturday 12:00 - 23:00 Sunday 12:00 - 22:00 Food serving times Monday - Saturday 12:00 - 21:00 Sunday 12:00 - 20:00 Contact us You can find us here The Street, Ashford,  \n  TN23 3AN 01233 643222 Join our Birthday Club Receive a free meal on your birthday, every year! Sign Up Opening times Food serving times Helpful links How to find us © Shepherd Neame is dedicated to brewing great beer and running the best pubs"
    },
    {
      "url": "https://pubdogcolorado.com/about-us/",
      "text": "About Us | Pub Dog Colorado Home Menu About Us Gift Cards & Loyalty Events Rules/FAQs Careers Shop ORDER TAKEOUT Follow Follow Follow ABOUT US PUB DOG CORE VALUES Dogs & Fun Safety & Cleanliness Community & Family OUR STORY The idea of Pub Dog began on a trip to Europe in 2013. Tara and her mom were out to dinner at a fairly nice restaurant and about an hour into the dinner, the most beautiful Newfoundland came out from underneath the table next to them. They were shocked that this beautiful dog had been allowed in the restaurant. Tara came home from the trip and told her dad, who had always been business minded, about this experience and they both questioned why they couldn’t do something like this in the States. She spent months researching and found that allowing dogs in restaurants didn’t really exist anywhere and thus, Pub Dog was born. Tara and her dad spent 3 1/2 years working through the health department, the city, the county, the state and financing before being able to break ground in the fall of 2016. Pub Dog opened its doors in April of 2017. Since then, the building and experience has become a destination that people travel from all over the country to visit! OUR TEAM TARA - Owner Tara was born and raised here in the Pikes Peak region. After going through school to become an engineer, she quickly learned that she wasn’t cut out for that type of work. She then spent 12 years working in a local restaurant before embarking on opening Pub Dog. When she isn’t working, Tara can be found spending time with her pup, Riley, watching sports, going to concerts, traveling with her fiance and being an auntie to her favorite kiddos in the world. CHEYENNE - General Manager Hi Pub Dog Pack! I’m Cheyenne, the proud heart behind Pub Dog Colorado. My journey began in the veterinary and animal shelter world, where I spent years caring for our furry friends and advocating for their well-being. That deep love for animals naturally led me to be a part of a space where dogs and their humans could come together, relax, and enjoy life’s simple pleasures. Alongside my passion for animals, I’ve been pouring drinks and sharing smiles behind the bar for over half my life. Bartending isn’t just a job for me, it’s a way to connect, celebrate community, and craft memorable experiences. At Pub Dog Colorado, I get to blend my love for hospitality with my devotion to dogs, creating a welcoming haven for everyone who walks through our doors. When I’m not at the pub, you’ll find me exploring the breathtaking Colorado mountains with my dogs by my side or tending to my ever-growing collection of plants. These moments recharge me and inspire the warm, vibrant atmosphere we cherish here at Pub Dog. Thanks for stopping by and can’t wait to meet you and your furry companions soon! BRITTANY - Assistant General Manager Hi friends! I’m Brittany — the Assistant General Manager here at Pub Dog Colorado. My journey in hospitality began 16 years ago, driven by a love for creating spaces where people (and pups!) feel at home. From bartending in fast-paced venues to planning unforgettable events, I’ve always thrived in roles where connection, creativity, and community come first. When I joined Pub Dog, it felt like the perfect fit and a place where my passion for great service and my love for dogs could finally collide I started behind the bar shaking cocktails and planning themed nights, and quickly found myself diving headfirst into all things Pub Dog from helping grow our event calendar, to collaborating on new drinks and menu ideas. I thrive on creating an atmosphere where people feel welcome, pups feel safe, and everyone’s having a genuinely great time. When I’m not at the pub, you’ll find me exploring Colorado with my two dogs, Leyah and Pongo, paddleboarding, road tripping, or checking out new food spots around town. They’re my adventure buddies and constant reminder of why a place like Pub Dog matters so much. I can’t wait to make you and your pups day a little better! Hours Monday - CLOSED Tuesday - CLOSED Wednesday - 12 pm - 9 pm Thursday - 12 pm - 9 pm Friday - 12 pm - 9 pm Saturday - 10:30 am - 9 pm Sunday - 10:30 am - 8 pm VIEW THE MENU Contact 2207 Bott Ave. Colorado Springs 80904 (719) 375-0771 info@pubdogcolorado.com Follow Follow Follow Links Careers Privacy Notice Terms & Conditions Return Policy Accessibility Statement Media Kit"
    }
  ]
}