{
  "fuentes": [
    {
      "url": "https://www.tcpalm.com/story/opinion/columnists/blake-fontenay/2024/11/24/dolphin-bar-has-a-fantastic-menu-but-doesnt-serve-actual-dolphins/75091942007/",
      "email": "bfontenay@gannett.com"
    },
    {
      "url": "https://www.tcpalm.com/story/opinion/columnists/blake-fontenay/2024/11/24/dolphin-bar-has-a-fantastic-menu-but-doesnt-serve-actual-dolphins/75091942007/",
      "email": "blake.fontenay@tcpalm.com"
    },
    {
      "url": "https://activerain.com/blogsview/1949629/movie-start-legend-lives-on-at-dolphin-bar-jensen-beach-florida",
      "email": "admin@activerain.com"
    },
    {
      "url": "https://treasurecoastfoodie.com/dolphin-bar-restaurant-review-jensen-beach-florida/",
      "email": "thomas@savourus.com"
    }
  ],
  "mails": [
    "admin@activerain.com",
    "bfontenay@gannett.com",
    "blake.fontenay@tcpalm.com",
    "thomas@savourus.com"
  ],
  "nombre_sitio": "dolphinbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tcpalm.com/story/opinion/columnists/blake-fontenay/2024/11/24/dolphin-bar-has-a-fantastic-menu-but-doesnt-serve-actual-dolphins/75091942007/",
      "text": "Dolphin Bar has a fantastic menu, but doesn't serve actual dolphins. News Indian River Martin St. Lucie Sports Advertise Obits eNewspaper Legals BLAKE FONTENAY Staff pick: Columnist Blake Fontenay recommends Dolphin Bar and Shrimp House in Jensen Blake Fontenay Treasure Coast Newspapers One of the first places I visited after moving to the Treasure Coast three years ago was the Dolphin Bar and Shrimp House in Jensen Beach. I keep going back there because it's well-suited to your dining (or drinking) needs. Want to enjoy a nice lunch with a spectacular view of the Indian River Lagoon? Check. A nice dinner with out-of-town guests? Yes. A Sunday brunch with breakfast and lunch items available? Dolphin Bar has that, too. A place to have a drink after a long day on the water? With the huge bay windows in the bar area, you'll feel like you're still on the water . More: Here are some of the best seafood restaurants on the Treasure Coast Q. What makes the Dolphin Bar and Shrimp House so great? In addition to being versatile for a lot of dining and entertainment situations, it's loaded with history. The building was once owned and operated by Frances Langford, an actress and singer known during the World War II era as \"America's sweetheart.\" Back then, it was known as The Frances Langford Outrigger Resort. Some of that history is on display in the foyer at the front of the restaurant. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Q. OK, so it's historic. But is the food any good? Review: Waterfront seafood restaurant is like taking a trip to the Polynesian Islands Darned straight, it is! If you're interested in a main dish from the dinner menu, I'm going to recommend the Dolphin Ala Dolphin, especially for first-time visitors. I know, you're probably squeamish about eating a mammal that might be smarter than some of our local political leaders. But the truth is, when it says \"dolphin\" on the menu, what they actually mean is \"dolphinfish,\" which is more commonly known by the name \"Mahi-mahi.\" So clear your conscience and dig into this delicacy with herb Parmesan egg wash and lemon butter caper sauce. Q. Isn't ordering \"dolphin\" at the Dolphin Bar a little on the nose? What else do they have? Everything I've tried there is good. On Sundays, the brunch buffet is everything you would expect it to be. If you want something a bit unusual, as a Southerner, I recommend the fried green tomatoes off the appetizer menu, which come topped with Pimento cheese and sweet onion bacon jam. Food doesn't get more southern than that. The seared Ahi tuna, also on the appetizer menu, is another favorite. Order the Ahi tuna and the fried green tomatoes instead of a regular menu item and you won't go away hungry. Q. Is that it? No! We haven't even talked about the view yet. There are a few waterfront restaurants around, but the angle you'll get sitting in the Dolphin Bar, looking through its enormous picture windows, gives you the sensation of almost being out on the water yourself. For kicks, head to the Dolphin Bar and watch a thunderstorm roll across the Indian River Lagoon. Dolphin Bar and Shrimp House Cuisine : Mostly seafood, but you can get other stuff there, too Address : 1401 NE Indian River Drive, Jensen Beach Phone : 772-781-5136 Hours : 11:30 a.m. to 11 p.m. Monday through Saturday, 10 a.m. to 11 p.m. on Sundays Alcohol : Full Bar Online : www.dolphinbar.com This column reflects the opinion of Blake Fontenay . Contact him via email at bfontenay@gannett.com or at 772-232-5424 . Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Promote your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Advertise Your Business Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tcpalm.com. All rights reserved."
    },
    {
      "url": "https://activerain.com/blogsview/1949629/movie-start-legend-lives-on-at-dolphin-bar-jensen-beach-florida",
      "text": "Movie Start Legend lives on at Dolphin Bar Jensen Beach Florida Admin search close Blogs Q & A Products Groups Log In menu search close Blogs Q & A Products Groups Log In Join now Home > Blogs > Susan Gaieski > Blogging with Susan bookmark_border Movie Start Legend lives on at Dolphin Bar Jensen Beach Florida By Susan Gaieski Real Estate Agent with Water Pointe Realty Group 3143754 November 06, 2010 07:22 AM Movie Star Legend lives on at Dolphin Bar & Shrimp House Jensen Beach Florida - Treasure Coast A move star legend, Frances Langford , lives on in history surrounding panoramic water views, Polynesian flair, exquisite food, and fine spirits.  Frances was an American singer and entertainer popular during the golden age of radio.  She entertained soldiers during World War II, including Lt. Ayres Jr. of the US Navy Sub Chaser, who was the father of Fred Ayres, founder of the Dolphin Bar and Shrimp House. It was with the help of Frances that the building, which had once been the exotic Outrigger, was refurbished and restored to the site it is today.  Many celebrities visited Frances at this site, among them, Bob Hope. The Dolphin Bar , located on NE Indian River Drive in Jensen Beach Florida between the Stuart and Jensen Beach Causeways on the Treasure Coast is nestled in a Polynesian setting on the river's edge offering spectacular panoramic views.  Captivated by the views is only one pleasure.  The Dolphin offers an assortment of tasteful dishes, including \"Dolphin a la Dolphin\", one of their \"signature\" dishes.  This dish is prepared choosing a fresh slice of Dolphin dipped in seasoned Parmesan cheese, flavored with dry white wine, butter and lemon capers.   The Dolphin Bar & Shrimp House uses only the finest and freshest ingredients pleasing to the palate.  The Potatoes Dolphinaise is to die for - just melts in your mouth.  Additionally, on the premise is a gift shop offering tropical elegance, home accents, contemporary resort clothing, artworks, fine wines, gift baskets. So if you are visiting the Treasure Coast during the holiday season, the Dolphin Car & Shrimp House is a stop you must make.  For more information visit the Dolphin Bar & Shrimp House website .  You will be pleasantly surprised and quite content as you sit back and enjoy the tropical atmosphere and fine dining. As for Greg Mullin, the friendly restaurant manager. You can also follow 365 things to do in Martin County on Facebook for all exciting things to do in Martin County, Stuart, FL. Or 365 things to do on the Treasure Coast on Facebook.  For more information regarding your Real Estate needs, visit www.treasurecoastcommunities.com . Pictures provided by Dolphin Bar & Shrimp House's with permission. Posted by Like favorite_border favorite_border 0 Re-Blog repeat 0 Share: bookmark_border Short link: https://activerain.com/droplet/bjlC Copy Topic: ActiveRain Community Location: Florida Martin County Jensen Beach Groups: Active Rain Newbies BananaTUDES Florida Rain Makers Hyper-Local Posts to Localism Tags: treasure coast communities treasurecoastbreakingnews dolphin bar jensen beach treasure coast Comments (1) Comment Email * Submit Show All Comments Sort: Oldest to newest Newest to oldest Most Popular Rebecca Gaujot, Realtor® Lewisburg, WV Lewisburg WV, the go to agent for all real estate Susan, the Dolphin Bar at Jensen Beach, FL, is on my list of places to visit. I will be going to Vero Beach this winter, not sure how far jensen beach is from there. Nov 08, 2010 03:10 PM Like chevron_left Older Post Back to Top Newer Post chevron_right Rainer 113,776 Susan Gaieski Director for Social Media & Technology Water Pointe Realty Group 393 Tequesta Drive Tequesta , FL Follow Profile Blog local_phone 561-747-3377 smartphone (772) 631-9231 Contact The Author Full Name Email Address Phone Number Subject Message Service Areas Jupiter, FL Tequesta, FL Stuart, FL Willoughby Golf Club, Stuart Martin County, FL Real Estate Resources What's going on in the Jupi... Waterfront Lifestyles in Ju... All Your Treasure Coast Inf... Treasure Coast Breaking New... Treasure Coast Breaking New... 365 Things To Do In Martin ... 365 Things to do on the Tre... Recent Posts almost 12 years ago bookmark_border Top Ten Reasons We Hope You Love the New ActiveRain Profiles Susan Gaieski favorite_border 0 1 View more Recent Posts arrow_forwards Additional Information Mortgage Rate Trends courtsey of: real estate mash Mortgage Calculator Mortgage Calculator Widget (function(){function async_load(){var s=document.createElement('script');s.type='text/javascript';s.async=true;s.src='http://twittercounter.com/remote/?v=2&username_owner=TreasureCstNews&users_id=11498978&width=240&nr_show=6&hr_color=709cb2&a_color=709cb2&bg_color=ffffff';x=document.getElementById('tcws_133021418'); x.parentNode.insertBefore(s,x);}if(window.attachEvent){window.attachEvent('onload',async_load);}else{window.addEventListener('load',async_load,false);}})(); What's the reason you're reporting this blog entry? Spam Not original content Violates community guidelines Are you sure you want to report this blog entry as spam? Real Estate Information Home Buying Home Selling Home Improvement Real Estate General Information Real Estate Market Trends Lending / Financial Local News and Events Listings Blogs For Professionals ActiveRain Community Real Estate Best Practices Real Estate Industry Real Estate Sales and Marketing Real Estate Technology & Tools Mortgage / Finance Just for Fun Explore ActiveRain Real Estate Blogs Real Estate Q&A Product Reviews Referral Network Local Real Estate Info Real Estate Blog Index Real Estate Q&A Index Contests Inspiration Products Education & Training Sales & Marketing Services Technology Products Other Business Products Important Links ActiveRain Ambassadors Leaderboard Membership Roster First Blog Posts Getting Started on AR Recent Blog Posts Referral Network Groups Community Guidelines About Site map Terms of Service Privacy Advertise Help/FAQ Join ActiveRain Find FL real estate agents and Jupiter real estate on ActiveRain. Disclaimer: ActiveRain, Inc. does not necessarily endorse the real estate agents, loan officers and brokers listed on this site.\n These real estate profiles, blogs and blog entries are provided here as a courtesy to our visitors to help them\n make an informed decision when buying or selling a house. ActiveRain, Inc. takes no responsibility for the content in these profiles,\n that are written by the members of this community. © 2025 ActiveRain, Inc.  All Rights Reserved :) home Fair Housing: Fair Housing and Equal Opportunity"
    },
    {
      "url": "https://treasurecoastfoodie.com/dolphin-bar-restaurant-review-jensen-beach-florida/",
      "text": "Dolphin Bar & Shrimp House Restaurant Review - Jensen Beach Florida Menu Search for Log In View your shopping cart Your cart is currently empty. Go to the shop Home Blog Posts Melbourne & Palm Bay Sebastian | Vero | Fort Pierce PSL | Jensen Beach | Stuart Hobe Sound | Jupiter | Palm Beach Videos Holy Grail Eats YouTube Videos Savor Club How it Works Frequently Asked Questions Restaurant Discounts Member Dashboard Change Password Events & Tours Event Tickets Foodie Meetups The Golden Fork Awards The Treasure Coast MASTERCHEF Competition Food Tours Shop All Gift Cards Digital e-Gift Cards e-Gift Card Balance Affiliate Links Cart My Account Contact Us About Us Subscribe Mobile App Password Reset Follow Facebook X Pinterest YouTube Instagram TikTok Login View your shopping cart Your cart is currently empty. Go to the shop Switch skin Search for Home / Restaurant Review / Dolphin Bar & Shrimp House Restaurant Review – Jensen Beach Florida Restaurant Review PSL | Jensen Beach | Stuart Dolphin Bar & Shrimp House Restaurant Review – Jensen Beach Florida Thomas Miller Send an email 4,028 4 minutes read Facebook X LinkedIn Pinterest Reddit Messenger Messenger WhatsApp Share via Email Print Perched elegantly on the river’s edge in the picturesque town of Jensen Beach, Florida, The Dolphin Bar & Shrimp House isn’t just a restaurant—it’s a part of local legend, bearing the distinctive touch of Hollywood movie star Frances Langford. Its strategic location gifts visitors with unparalleled panoramic views, stretching gracefully from the Stuart Causeway right to the horizon-touching Jensen Beach Causeway Bridge. The interior is a tribute to rustic elegance with imposing wooden beams and rich hardwood floors setting the stage. Here, their signature dish, The Dolphin ala Dolphin (see picture below), truly stands out: a meticulously prepared filet of the freshest locally caught Dolphin, expertly sautéed and seasoned with a harmonious blend of wine, butter, and fragrant herbs. Each bite, especially when enjoyed against the backdrop of a serene riverfront, transforms the dining experience into a sublime affair. Front Entrance Inside Dining Room Further enhancing the allure of this establishment is its proud association with the renowned Conchy Joe’s and Stringers Tavern & Oyster Bar family ( click here to read Stringer’s review ), signifying a commitment to culinary excellence. An unexpected highlight during my visit was reconnecting with Chef Dave Gould. I last ran into him at my review of Cobb’s Landing in Fort Pierce a little over 4 years ago. Recognized for his culinary prowess, and learning that he was recently promoted to the Executive Chef position overseeing all three venues brought a sense of anticipation and delight. Outdoor Dining Patio Banquet Room With three well-appointed bars, a salad bar with over 40 different items, an expansive outdoor seating area offering breathtaking river views, a private banquet room that seats up to 100 guests, and a menu that promises both visual and gastronomic delights, The Dolphin Bar & Shrimp House confidently asserts itself as one of Jensen Beach’s premier dining destinations. A VERY LIMITED QUANTITY Gift Card deal is available at the bottom of this article. They usually sell out within hours of when this article is published, so don’t wait to purchase quickly if you want one! Now let’s dive right in and see what this place has to offer and what I had to eat! Our meal kicked off with the Seared Ahi Tuna , an inviting dish with as much flavor as it had visual appeal. The Ahi filet, delicately encrusted with sesame seeds, was seared to perfection, revealing a rare middle. Its pencil-thick slices were fanned out, showcasing the beautiful gradient of its sear. This fresh and flavorful dish made for an impeccable start to the meal. The Pineapple Pina Colada Shrimp immediately stood out with its unique presentation. The shrimp were fried to crispy perfection, and their golden crunch paired seamlessly with the wonderful pina colada dipping sauce. This sauce, a blend of pureed pineapple and topped with a creamy coconut sauce, added a delightful tropical twist, making each bite a flavorful treat! The restaurant’s pièce de résistance, the Dolphin Ala Dolphin , lived up to its reputation. Fresh Dolphin, dipped in an herb Parmesan egg wash and sautéed, emerged flawlessly flaky and moist. A tangy Lemon Butter Caper sauce elevated the fish’s inherent flavors, while the side of green beans added a fresh, contrasting touch. Particularly nostalgic was the side of Dolphinaise potatoes, reminiscent of the creamy escalloped potatoes from mid-century dining. This combination of classic and contemporary flavors made the dish an undeniably memorable experience. The New York Strip Steak with Dijon Cream Sauce was another standout. This 12oz. Choice Cut was grilled with precision—its exterior boasted a flawless crust and distinct grill marks, while the interior revealed a beautifully pink medium rare, seasoned just right. Paired with this was a side of mashed potatoes so smooth they seemed almost silken. The Dijon cream sauce was a delightful addition, creamy and flavorful without overshadowing the natural taste of the meat. Accompanied by the familiar grilled asparagus, this dish balanced robust flavors with elegant preparation. To cap off an exquisite meal, I was treated to two of the restaurant’s top dessert selections. First up was the Mango Key Lime Pie , a tropical delight that was every bit as creamy as it was refreshing. Its velvety texture and subtle fruitiness made it an instant palate pleaser. Sharing the spotlight was the day’s Crème Brûlée , a chocolate variant that left me impressed. A true test of any Crème Brûlée lies in the brittle sugar crust on top, and this one excelled. A gentle tap shattered the caramelized layer, revealing a lusciously smooth and subtly chocolate-infused custard beneath. Dolphin Bar and Shrimp House Address : 1401 NE Indian River Dr, Jensen Beach, FL 34957 Phone : (772) 781-5136 https://dolphinbar.com/ Did you miss out on this Gift Card deal? It sold out in a few hours!!! My email subscribers and my mobile app users are the first to know about these deals, so be sure to subscribe and download our free mobile app so you don’t miss out next time! This article is a paid advertisement for the restaurant featured in this blog post. All opinions expressed in this post are based on our own personal experience with the business and its products. keywords: Dolphin Bar & Shrimp House Stuart FL, Best shrimp in Stuart at Dolphin Bar, Waterfront dining at Dolphin Bar Stuart, Dolphin Bar seafood Stuart Florida, Dolphin Bar menu Stuart FL, Restaurants with a view Stuart – Dolphin Bar, Dolphin Bar Stuart reviews, Stuart’s premier seafood restaurant Dolphin Bar, Dolphin Bar & Shrimp House reservations, Stuart FL Dolphin Bar specials, Dolphin-themed restaurant in Stuart, Fresh shrimp dishes at Dolphin Bar Stuart, Family dining at Dolphin Bar & Shrimp House, Dolphin Bar events Stuart FL, Waterfront seafood restaurant in Stuart, Dolphin Bar live music nights, Romantic seafood dining at Dolphin Bar, Dolphin Bar happy hour specials Stuart, Seafood platters Dolphin Bar Stuart, Best waterfront views Dolphin Bar & Shrimp House, Seafood grill in Stuart – Dolphin Bar, Dolphin Bar & Shrimp House Stuart location, Top-rated seafood in Stuart at Dolphin Bar, Dolphin Bar Stuart seafood combo, Local catch at Dolphin Bar & Shrimp House, Dolphin Bar & Shrimp House outdoor seating, Waterfront events at Dolphin Bar Stuart, Family-friendly seafood restaurant Stuart, Sunset dining at Dolphin Bar Stuart FL, Dolphin Bar seafood and drinks specials. Thomas Miller Send an email 4,028 4 minutes read Facebook X LinkedIn Pinterest Reddit Messenger Messenger WhatsApp Share via Email Print Share Facebook X LinkedIn Pinterest Reddit WhatsApp Share via Email Print Thomas Miller Thomas Miller, known as “The Treasure Coast Foodie” and “The Foodie Guy,” is a celebrated food blogger, owner, and Editor in Chief of The Treasure Coast Foodie Blog, as well as the host and producer of Holy Grail Eats, where he spotlights one-of-a-kind restaurants and exceptional “Holy Grail” dishes. With ten years of experience, he has reviewed over 300 local restaurants, and his food photography captures the appetites of tens of thousands of followers each month. As the Official Foodie Insider for Visit Indian River County, Thomas champions local dining culture, sharing his insights with a loyal following of over 125,000. His expertise has also been featured in the luxe publication Coastal Drive Magazine. A Google Maps Level 8 Local Guide, Thomas has shared more than 4,000 photos, viewed over 100 million times, and his Foodie dining events rank among the Treasure Coast’s top culinary experiences. Best Places to Get a Cocktail in Indian River County - Part 2 Best Places to Get a Cocktail in Indian River County - Part 2 Riverwalk Cafe and Oyster Bar Restaurant Review - Stuart, FL Riverwalk Cafe and Oyster Bar Restaurant Review - Stuart, FL Related Articles Surf Subs Vero Beach: Italian Sandwiches | Restaurant Review 15 hours ago Morel’s Bar & Grill Palm Bay, FL | Restaurant Review 1 week ago Colab Kitchen – Stuart, FL – Farm-to-Table Restaurant Review 3 weeks ago Big Boyz Jamaican Restaurant Review – Melbourne, FL 4 weeks ago Follow Us on Social Media Facebook X Pinterest YouTube Instagram TikTok YOUR #1 Source for what and where people are dining out on the Treasure Coast! © Copyright 2025 All Rights Reserved Savourus LLC, dba The Treasure Coast Foodie Home Blog Posts Videos Savor Club Events Food Tours Shop Holy Grail Eats Advertising & Services Careers Terms of Use Privacy Policy About Us Contact Us Facebook X Pinterest YouTube Instagram TikTok Facebook X Pinterest Messenger Messenger WhatsApp Back to top button Close Search for: Facebook X Pinterest YouTube Instagram TikTok Close Search for Close Log In Forget? Remember me Log In"
    }
  ]
}