{
  "fuentes": [
    {
      "url": "https://www.dolphinsplus.com/dolphins-plus-connect-share/contact-dolphins-plus",
      "email": "info@dolphinsplus.com"
    },
    {
      "url": "https://dolphins.org/",
      "email": "drc@dolphins.org"
    },
    {
      "url": "https://dolphins.org/",
      "email": "exception.request@dolphins.org"
    },
    {
      "url": "https://www.afd.org.au/contact-afd/",
      "email": "info@afd.org.au"
    },
    {
      "url": "https://www.afd.org.au/contact-afd/",
      "email": "media@afd.org.au"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://member.dolphins.com/Contactus",
      "email": "finclub@dolphins.com"
    },
    {
      "url": "https://www.cetabase.org/phinventory/dolphins-plus-bayside",
      "email": "contribute@cetabase.org"
    },
    {
      "url": "https://www.cetabase.org/phinventory/dolphins-plus-bayside",
      "email": "shannon@cetabase.org"
    }
  ],
  "mails": [
    "contribute@cetabase.org",
    "drc@dolphins.org",
    "exception.request@dolphins.org",
    "finclub@dolphins.com",
    "info@afd.org.au",
    "info@dolphinsplus.com",
    "info@reception-plus.de",
    "media@afd.org.au",
    "shannon@cetabase.org"
  ],
  "nombre_sitio": "dolphinsplus.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dolphinsplus.com/dolphins-plus-connect-share/contact-dolphins-plus",
      "text": "Contact Dolphins Plus in Key Largo | Dolphins Plus Dolphin Encounters Signature Swim Shallow Water Dolphin Encounter Paint With a Dolphin Dolphin Dockside Exclusive Family Encounter Shadow A Trainer For A Day Touch Tank Oma's Dolphin Swim Program Golden Tide 55+ Experiences Meet Our Dolphins Community Events Research & Education Independent Research Animal Care Internship Dolphin Facts Field Trips Animal Advocate Research Articles Summer Camp 305-451-1993 Gift Shop Specials Book Now Contact Us Do you have any questions?  Comments?  Concerns?  We want to hear from you!  Give us a call, send us an email, or connect with us on social media.  We’re ready and waiting. Receive Special Offers Location Dolphins Plus Bayside, Inc. 101900 Overseas Highway Key Largo, FL 33037 Contact Us 305-451-1993 info@dolphinsplus.com phone Dolphins Plus Bayside 101900 Overseas HwyKey Largo, FL 33037 Located at MM 102 Bayside Call: 305-451-1993 Our Charities Dolphins Plus Marine Mammal Responder Follow Us About Us Dolphin Wellbeing Meet Our Team Certifications Accommodations & Attractions Booking Policies Swim Programs Meet Our Dolphins Frequently Asked Questions Swim With Dolphins Guide Connect & Share Video Gallery Photo Gallery Reviews/Testimonials News/Press Blog Contact Us Careers Monterrey Bay Aquarium Seafood Watch Program Research & Education Independent Research Animal Care Internship Dolphin Facts School Groups Animal Advocate Research Articles ©2025 Dolphins Plus. All rights reserved.  | Privacy Policy"
    },
    {
      "url": "https://dolphins.org/",
      "text": "Dolphin Research Center - Dolphin Research Center Skip to main content Home | Book a Program | Webcam | Help DRC | Donate Now Gift Memberships Membership Donations and Special Appeals Major Giving Bucket of Fish Volunteer & Internship Photos | Gift Shop | Member Only Access | Member Access Search Providing Sanctuary and a Forever Home since 1984. A not-for-profit 501(c)3 marine mammal education and research facility for more than 35 years. Providing Sanctuary and a Forever Home since 1984. A not-for-profit 501(c)3 marine mammal education and research facility for more than 35 years. VISIT General Admission & Progam Reservations Dolphin Sunset Celebration Plan Your Day » What is There to Do? General Admission Includes Hours & Pricing Map & Directions Web Cams Veterans Garden Sprayground Anchors Cafe Photography Group Visits Visitor FAQs Animal Family Special Needs » Public Dolphin Interactive Program Assistance Pathways Program Make A Wish Wounded Warrior Project Events & Celebrations Dolphin Camp & DolphinLab SUPPORT Membership Donate Animal Care Wish List Donations, Special Appeals & Wish Lists Major Giving Bucket of Fish Volunteer ABOUT Our History Our Mission Animal Family Care Facts Manatee Rescue » Report a Manatee in Distress Manatees of the Florida Keys DRC’s Role in Manatee Assistance Support DRC’s Manatee Rescue Efforts Tips For Protecting Manatees Manatees and the Law Media Room » Media Contact Images News to Share Senior Management Contact Us RESEARCH Areas of Study Why It's Important Research Spotlight References & Abstracts Conference Presentations Get Involved Research Internship Proposal Submission LEARN DolphinCamp DolphinLab » DolphinLab Teen » Basic Course Intermediate Course Marine Mammal Care & Basic Training Course DolphinLab Adult » All About Dolphins DolphinLab Advanced DolphinLab Camps Locals' Dolphin Day Camp Onsite Programs for Groups » DolphinLab Field Trips Distance Learning Outreach Programs Free Curriculum for Teachers Resource Library Conservation » Tips » The 3 R's & an S Toxins & Ocean Dumping The Dolphin/Tuna Problem Don't Feed Wild Dolphins The Fisheries Want To Do More? Threats to Dolphins & Whales » The Challenge The Pollution Problem Personal Choices Direct Threats Indirect Threats You Can Help References and Sightings Endangered Species » Overview River Dolphins Vaquita Northern Right Whale Bowhead Whales How to Help Marine Mammal Laws » Enforcement Agencies Relevant Legislation Government Permits and Licenses Alliance Accreditation Manatee Rescue Permits Marine Mammal Info » Dolphin Info » Acoustics Anatomy Culture Communication Maternity Natural History Physiology Sea Lion Info Manatee Info » Conservation Fact Sheet Training » Careers At DRC Strandings » Case Studies Resources Training Institute Dolphin Academy Program Prof. Animal Trainer Certificate Program Careers Career Opportunities Working at DRC » Profile of Dolphin Research Center DRC Environment DRC Staff Profile Educational Requirements Salary and Benefits Working in the Field » Facilities & Organizations Research Careers Schools & Universities Training Careers Volunteer Internships Book Now Donate Now Visit DRC Learn More Sunset Celebration Step behind the scenes for a rare after-hours adventure where you'll become part of the dolphins’ enrichment—feeding them specially prepared jello treats and witnessing their individual dolphinalities up close. Anchors Cafe is Closed Sorry for any inconvenience Why Research is Important Research Rocks! Dolphin Research Center is a nonprofit research and education facility in the Florida Keys. During your visit you may see DRC working on various cognition and behavior studies. Questions encouraged! Learn more about these amazing animals. Support Our Manatee Rescue Team Manatee Rescue Team You support and generosity helps to enable our Manatee Rescue Team! Book Now! Swim with Dolphins in the fabulous Florida Keys - The Ultimate Vacation Thrill! Get to know a dolphin while you do a variety of fun behaviors together including the exciting dorsal pull! Book Today! Our Animal Family Looks Forward to Seeing You in the Florida Keys! See dolphins and sea lions, birds, and even a tortoise! Fun-filled, interesting behavior sessions and education presentations offered all day. Book Now Spend the Day with a Dolphin in the Florida Keys! Make a new dolphin friend in Ultimate Trainer for a Day. Do you have what it takes to be a marine mammal trainer? Donate Now. Thank you! The Promise of a Forever Home in the Florida Keys We rely on guest visits, participation in our programs, and donations to care for our animals, learn more in research, educate about conservation, help injured manatees and more. Thank you for your support. Book a Program X Dolphin Research Center offers many ways, including swimming with dolphins, where you can interact with dolphins and sea lions. Use the slider below to see the programs and click on the photo to learn more or make a reservation. General Admission Dolphin Sunset Celebration Memory Maker Meet Dolphin Encounter Dolphin Splash Ultimate Trainer for the Day VIP Experience Researcher Experience Meet a Dolphin Exclusive Private Dolphin Encounter Paint with a Dolphin < BACK View Program Details Reserve General Admission HOURS: Open 7 days a week September 2, 2025-December 14, 2025 9:00am to 3:30 p.m. Last admissions at 3:00 p.m. December 15, 2025-September 7, 2026 9:00am to 4:30 p.m. Last admissions at 4:00 p.m. Closed on Memorial Day, Labor Day, Thanksgiving Day, and Christmas Day ADMISSION PRICE: Adults: $36.00 Children ages 4-12: $25.00 Children ages 3 and under: FREE General Admission US Military/Veteran Discount: $16 OFF (Discounted Price: $20.00) Must present US Military ID. Discounts/Coupons cannot be combined. All guests under the age of 18 must be accompanied by a paying adult. Prices are per person. Please note: General Admission does not include hands-on contact with any marine mammals.  Interactive programs are be purchased separately. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Get our most competitive General Admission rates by purchasing your tickets on-line! Purchase a General Admission and spend some time observing the dolphins and sea lions in training sessions or interacting with each other during their private time. Watch your friends and family participate in public programs from one of our general access areas. < BACK View Program Details Reserve Dolphin Sunset Celebration Price: $249 per person Member Price: $199 per person Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: 5 Yrs and Up. A paying participating adult (18+Yrs) must accompany a child 5-7 years old. For safety and liability reasons, pregnant women are unable to participate in this program. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: 1.5 Hours Total Join us for an unforgettable evening at Dolphin Research Center with our BRAND NEW, once-a-month exclusive event! When Dolphin Research Center closes to the public, the magic begins. Step behind the scenes for a rare after-hours adventure where you'll become part of the dolphins’ enrichment—feeding them specially prepared jello treats and witnessing their individual dolphinalities up close. You’ll also have the chance to engage in fascinating conversations with our marine mammal experts, gaining insight into dolphin research, behavior, training, care, and more. As the sun dips below the horizon, raise a glass of champagne and toast to another perfect day in paradise—surrounded by the sounds of nature, the beauty of the Florida Keys, and the joyful energy of our dolphin family. Limited availability – offered just once a month! Reserve your spot today for this intimate, unforgettable experience. If your desired program is sold out, please check back on the morning of to see if there are any openings. < BACK View Program Details Reserve Memory Maker Meet Price: $105 per person (includes all-day general admission). Price does not include reservation fee. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates DRC Members , to book Memory Maker Meet in advance, please email memberservice@dolphins.org. Ages: 1 yr and Up. Children ages 1-7 years must be assisted in the program by an adult (Age 18+). Adult must pay General Admission. If you are pregnant, please call us before booking this program at 305-289-0002 or contact us via email at exception.request@dolphins.org. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Approximately 15 mins < BACK View Program Details Reserve Dolphin Encounter Price: $249 per person (includes all-day general admission). Price does not include reservation fee. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: 5 Yrs and Up. A paying participating adult (18+Yrs) must accompany a child 5-7 years old. For safety and liability reasons, pregnant women are unable to participate in this program. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Your in-water experience will last 20-25 minutes. Enjoy watching the dolphins, a theater presentation, our Sprayground, or a snack at the food cart until your program begins. Our most popular dolphin program! Includes a dorsal pull. If your desired program is sold out, please check back on the morning of to see if there are any openings. Exclusive Private Dolphin Encounter: $2189-$2689 for one to six people in a private group. Includes a digital photo package of all members of your group, all-day general admission, and a one-year membership to DRC for each guest! Your special swim experience will occur at one of our docks designated specifically for you and your party. Call 305-289-0002 for details and to reserve or email exception.request@dolphins.org. Individuals and families/groups of up to 10 people can reserve online for Dolphin Encounter . For groups larger than 10, please call 305.289.0002 or email exception.request@dolphins.org for assistance. Thank you. < BACK View Program Details Reserve Dolphin Splash Note: Individuals and families/groups of up to 10 people can reserve online for Dolphin Splash . For groups larger than 10, please call 305.289.0002 or email exception.request@dolphins.org for assistance. Thank you. Price: $149 per person ages 4 years and up(includes all-day general admission). Price does not include reservation fee. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: Great for all ages! Open to individuals, couples, and families.  A paying, participating adult (18+ Yrs) can hold one child 3 years old and under on hip during program for no additional cost. A paying participating adult (18+ Yrs) must accompany children 4-7 years old. For safety and liability reasons, pregnant ladies are unable to participate in this program Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Approximately 20-25 mins in-water on a submerged platform. The ideal program for families with young children! If your desired program is soldout, please check back the morning of to see if there are any openings. < BACK View Program Details Reserve Ultimate Trainer for the Day Price: $745 per person . Includes all-day admission for participant. Includes one(1) additional all-day general admission for a parent/guardian or observer. Price does not include On-line Reservation Fee Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: 10 Yrs and Up For Safety and liability reasons, pregnant ladies are unable to participate in this program Participants must be 16 years or older to be left on a Dolphin Research Center property without supervision. If under the age of 16 one (1) adult must be present for the duration of the program. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Full Day THE ULTIMATE TRAINER EXPERIENCE .  Accompany trainers all day during this intensive interactive adventure! If your desired program is sold out, please check back the morning of to see if there are any openings. To reserve more than four people for our Ultimate Trainer For a Day program, please call 305-289-0002 or email exception.request@dolphins.org for assistance. Thank you. < BACK View Program Details Reserve VIP Experience Price: $475 per person. Includes all-day admission for participant. Includes one(1) additional all-day general admission for a parent/guardian or observer. Price does not include On-line Reservation Fee Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: 5 Yrs and Up.  A paying participating adult (18+ Yrs) must accompany children 5-9 Yrs Participants must be 16 years or older to be left on a Dolphin Research Center property without supervision. If under the age of 16 one (1) adult must be present for the duration of the program. For safety and liability reasons, pregnant ladies are unable to participate in this program Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Half Day (approximately 4 hrs) Spend a fun-filled half-day close-up with our dolphin and sea lion family! If your desired program is sold out, please check back the morning of to see if there are any openings. To reserve more than four people for our VIP program, please call 305-289-0002 or email exception.request@dolphins.org for assistance. Thank you. < BACK View Program Details Reserve Researcher Experience Price: $475 per person . Includes all-day admission for participant. Includes one(1) additional all-day general admission for a parent/guardian or observer. Price does not include On-line Reservation Fee Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates Ages: 10 Yrs and Up Participants must be 16 years or older to be left on a Dolphin Research Center property without supervision. If under the age of 16 one (1) adult must be present for the duration of the program. For safety and liability reasons, pregnant ladies are unable to participate in this program Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Half Day (approximately 4 hrs) Spend half a day with our Research Team!  Observe dolphins and sea lions and help with research related activities. If your desired program is sold out, please check back the morning of to see if there are any openings. To reserve more than four people for our Researcher Experience program, please call 305-289-0002 or email exception.request@dolphins.org for assistance. Thank you. < BACK View Program Details Reserve Meet a Dolphin Price: $70 per person (includes all-day general admission). Price does not include reservation fee. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates DRC Members: to book Meet the Dolphin in advance, please email memberservice@dolphins.org. Ages: 1 Yr and Up. A paying participating adult (18+ Yrs) must accompany children 1-7 Yrs. If you are pregnant, please call us before booking this program at 305-289-0002 or contact us via email at exception.request@dolphins.org. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Approximately 5 mins If you've craved the chance to touch a dolphin, this is for you! If your desired program is soldout, please check back the morning of to see if there are any openings. < BACK View Program Details Call to Reserve Exclusive Private Dolphin Encounter Immerse yourself in the Exclusive Private Dolphin Encounter experience of your dreams! Get ready for a fun-filled, exciting time. You and your group of up to six people will be the only guests at your dock. Your trainer greets you prior to your program to discuss your goals and special requests. Enjoy more connection time with the dolphin(s) with individualized attention. Price: $2189-$2689 (depending on date) for one to six people in a private group. Includes a digital photo package of all members of your group; all-day admission; and a one-year membership to DRC for each guest! Ages: All ages, but children younger than 8 must be accompanied by a participating adult. For safety and liability reasons, pregnant women are unable to participate in this program. Guests with Special Needs: Do you or one of your group have a physical or cognitive limitation? Please let us know prior to booking so we can connect you with our Coordinator about what assistance might be needed. Duration: Your in-water experience lasts approximately 20-25 minutes. Availability & Questions: This exclusive opportunity is offered only once a day and cannot be directly booked online. To check availability or to reserve, please call 305-289-0002 or email exception.request@dolphins.org. Thank you! < BACK View Program Details Reserve Paint with a Dolphin Price: $95 per person (includes all-day general admission). Price does not include reservation fee. Gift Certificates: For details visit: http://www.dolphins.org/giftcertificates DRC Members, to book Paint with a Dolphin in advance, please email us at memberservice@dolphins.org. Ages: 1 yr and Up. Children ages 1-7 years must be assisted in the program by an adult (Age 18+). Adult must pay General Admission. If you are pregnant, please call us before booking this program at 305-289-0002 or contact us via email at exception.request@dolphins.org. Guests with Disabilities: Do you or one of your group have a physical or cognitive limitation? Please contact our Coordinator prior to booking Duration: Approximately 10 mins on the dock Work with our gray artists and create a one-of-a-kind masterpiece! If your desired program is sold out, please check back the morning of to see if there are any openings. Membership X Being a Dolphin Research Center Member includes free annual admission, newsletters, online access to our Members Only website, special event invitations, discounts at our onsite and online Gift Shops, and other benefits depending on membership level. Membership is great way that you or, as a gift, someone special can support DRC by becoming a member of our extended family. Join Our Family Research X Research Spotlight < BACK Research Spotlight Details Research Spotlight DRC's staff and dolphins are currently working on a number of cognitive and behavioral research projects that relate to their overarching goal of mapping the dolphin mind and understanding how dolphins think and learn. Check here to see what's in the research spotlight, publication announcements and details of DRC findings. This information is also featured in a bi-monthly newsletter for members. Education X Dolphin Research Center Training Institute DolphinLabs for You Group DolphinLab For Teachers Marine Mammal Info < BACK Dolphin Research Center Training Institute Details Dolphin Research Center Training Institute The DRC Training Institute offers an Professional Animal Trainer program for continuing eduation purposes and the Dolphin Academy program for those looking to pursue a career in animal training. < BACK DolphinLabs for You Details DolphinLabs for You Our DolphinLab programs offer a combination of educational seminars, workshops, demonstrations, in water and hands-on learning activities with our dolphins, sea lions and staff family. Three DolphinLab programs, DolphinLab Adult, DolphinLab Teen and DolphinLab Group, are available and suited for any learning level. Some DolphinLab programs also offer the unique opportunity for participants to earn college credit while swimming with dolphins. < BACK Group DolphinLab Details Group DolphinLab Our DolphinLab programs offer a combination of educational seminars, workshops, demonstrations, in water and hands-on learning activities with our dolphins, sea lions and staff family. Three DolphinLab programs, DolphinLab Adult, DolphinLab Teen and DolphinLab Group, are available and suited for any learning level. Some DolphinLab programs also offer the unique opportunity for participants to earn college credit while swimming with dolphins. < BACK For Teachers Details For Teachers Dolphin Research Center offers many educational opportunities for teachers, including in-classroom curriculum with detailed lesson plans and opportunities for group visits and field trips. Discovering Dolphins, a CD-ROM for grades K through 8, includes curriculum, hand-outs, photographs, sound recordings and more. Explore DRC's resource library for teachers as well as information on outreach and distance learning. < BACK Marine Mammal Info Details Marine Mammal Info Explore detailed marine mammal information including guides on dolphins, sea lions, manatees, training marine mammals and strandings. Learn about dolphin acoustics, anatomy, culture, communciation, maternity, natural history and physiology and discover what sea lions and manatees eat, where they live and all about their senses. Book a Program Membership Research Education Our Mission -\n    Through education, research and rescue, Dolphin Research Center promotes peaceful coexistence,\n    cooperation and communication between marine mammals, humans and the environment we share with\n    the well being of DRC's animals taking precedence. e-Newsletter Sign-up Follow Us Home | Book a Program | Webcam | Help DRC | Photos | Gift Shop | Member Only Access About DRC | Visit DRC | Memberships & Donations | Privacy Policy Dolphin Research Center • 58901 Overseas Highway | Grassy Key, FL 33050-6019 USA Program Reservations Phone: +1 (305) 289-0002 | Office Phone: +1 (305) 289-1121 (office) General Information Email: drc@dolphins.org | Membership: +1 (305) 289-1121 Ext 229 | Fax: +1 (305) 289-8902 Registered 501(c)(3). EIN: 59-2072869 ©2025, Dolphin Research Center"
    },
    {
      "url": "https://www.afd.org.au/contact-afd/",
      "text": "Contact Us | Action for Dolphins Our focus About us End the Taiji dolphin drive hunts Protect the ocean Break cycle of captivity Remove shark nets Stop feeding dolphin programs Take action Stop the Taiji dolphin hunts Pledge not to visit dolphins marine parks Secure stronger nature laws Help ratify the High Seas Treaty Remove shark nets End the QLD shark control program Traveloka: don’t sell cruelty Help the Monkey Mia dolphins Get involved Donate now Leave a gift in your will Volunteer Contact us Resources News Reports Dolphin facts Whale watching Donate Our focus About us End the Taiji dolphin drive hunts Protect the ocean Break cycle of captivity Remove shark nets Stop feeding dolphin programs Take action Stop the Taiji dolphin hunts Pledge not to visit dolphins marine parks Secure stronger nature laws Help ratify the High Seas Treaty Remove shark nets End the QLD shark control program Traveloka: don’t sell cruelty Help the Monkey Mia dolphins Get involved Donate now Leave a gift in your will Volunteer Contact us Resources News Reports Dolphin facts Whale watching Donate Contact Us We'd love to hear from you Source Redders48 via Getty Images General enquiries Anyone, including our dolphin defenders, can reach us using the form below. Got a question about your donations, want to change your ongoing donations, or need an end of financial year donations receipt? Contact us anytime, and we’ll get back to you as soon as possible Media enquiries Members of the media community can reach us by email at media@afd.org.au Give us a call or send us a text via mobile or Whatsapp + 61 427 399 056 Send us mail Australia for Dolphins Level 17/31 Queen St, Melbourne VIC 3000 Australia. 📷 Neil Mewes Unsplash Our focus End the Taiji dolphin drive hunts Break cycle of captivity Protect the ocean Whale watching guide Remove shark nets Stop feeding dolphin programs Take action Stop the Taiji dolphin hunts Pledge not to visit dolphins marine parks Secure stronger nature laws Help ratify the High Seas Treaty Remove shark nets End the QLD shark control program Traveloka: don’t sell cruelty Help the Monkey Mia dolphins Get involved Donate now Contact us About us News Leave a gift in your will Volunteer © Action for Dolphins 2025 Privacy Policy Consent Preferences and Cookie Policy Website Terms of Use ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Surname Datenschutz First Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://member.dolphins.com/Contactus",
      "text": "Dolphins Loyalty > Contactus Contact Us Whom To Contact Contact Us For questions and comments, you can reach us by phone at (305) 943-8000 or via mail at: Miami Dolphins, Sun Life Stadium, 347 Don Shula Drive, Miami Gardens, Fla., 33056. Players, Cheerleaders & Mascot Please note that our staff, players and cheerleaders handle their own fan mail and autograph requests. We urge fans not to send items of value for autographs as items can get lost in the mail. The Miami Dolphins organization is not responsible for unanswered autograph requests or unreturned items. Mail can be sent to: Miami Dolphins, ATTN: Staff, Player or Cheerleader Name, 7500 SW 30th Street, Davie, Florida, 33314. Fan Packs and Pocket Schedules equests for Dol-Fan Packs, team photos and pocket schedules must be made in writing to the Miami Dolphins. E-mails and faxes are not accepted. Requests can be mailed to: Miami Dolphins Community Relations, Sun Life Stadium, 347 Don Shula Drive, Miami Gardens, Fla., 33056. Full-Time Employment Currently, the Dolphins are at full staff and have no employment opportunities available at this time. Resumes can be sent in and will be kept on file should we have employment openings in the future. Resumes can be mailed to: Miami Dolphins Human Resources, Sun Life Stadium, 347 Don Shula Drive, Miami Gardens, Fla., 33056. Proshop Customer Service is available via the Internet at Proshop Customer Service , or by phone at (866) FIN-8490. Questions about our merchandise? Need help placing an order? Checking on the status of your order? Need return information? We are here to answer all these questions and more. Please feel free to contact us by phone or email with any questions or comments. Fin Club Questions and Concerns For any questions relating to the Fin Club, please first review the FAQ section . If you still can't find an answer to your question, contact our support center at finclub@dolphins.com . FAQ Contact Us Terms and Conditions Privacy Policy © 2013-2014  Miami Dolphins. All rights reserved."
    },
    {
      "url": "https://www.cetabase.org/phinventory/dolphins-plus-bayside",
      "text": "Dolphins Plus Bayside · Dolphins (Current Holder) – Ceta-Base | Captive Dolphin & Whale Database Skip to content Inventories Expand Luga’logue (Belugas) Expand Belugas – Current Holders Belugas – Historical Holders Or’census (Orcas) Expand Orcas – Current Holders Orcas – Historical Holders Phin’ventory (Dolphins) Expand Dolphins – Current Holders Dolphins – Historical Holders Resources Expand Maternity Ward Timeline Expand 2020s Expand 2025 2024 2023 2022 2021 2020 Drive Hunt Expand Drive Hunt Results • Taiji Site Expand About Us Materials & Methods Contact Search Toggle Menu Dolphins Plus Bayside · Dolphins (Current Holder) By cetabase November 12, 2024 November 12, 2024 Home / Phin'ventory / Dolphins Plus Bayside · Dolphins (Current Holder) Dolphins Plus Bayside formerly Dolphin Cove 101900 Overseas Highway · Key Largo, Florida · USA Operating: 1980 – present Living The information in the table below represents the living or current population of dolphins & porpoises held at this facility (excluding killer whales). If you’re having trouble finding a specific animal, check the tabs above, they may have transferred or died. Italics indicate a deceased individual. Note : If you have a correction or would like to submit information please contribute@cetabase.org or use our contact form! Last Updated : September 9, 2025 6:09 pm Image Species Scientific ID #'s Name Sex Born Origin Origin Date Origin-Sort Captured / Born at: Mother Father Transfers Current / Last Facility: Status Status Date Stat Sort-Ref Cause of Death Notes Keyword column (invisible) Bottlenose Tursiops truncatus NOA0001912, AZA 0314 Samantha F 1983-Jan-01 (E) 42.7 years old Capt 1987-Apr-07 19870407 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (07-Apr-1987) to Dolphins Plus Bayside (21-Mar-2010) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0001929, 1929, AZA 0508 Alfonz M 1993-Jul-25 (A) 32.1 years old Born 1993-Jul-25 19930725 Dolphins Plus MMR Genie Fonzie Dolphins Plus Oceanside to Dolphins Plus Bayside (11-Jan-1998) to Dolphins Plus  (~ Apr 2016)  to Dolphins Plus Bayside (2023-Sep-09) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0001932, AZA 0542 Bob M 1994-Jul-28 (A) 31.1 years old Born 1994-Jul-28 19940728 Dolphins Plus MMR Jessica Little Bit Dolphins Plus Oceanside to Dolphins Plus Bayside (2023-Sep-09) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0006151, AZA 0877 Leo M 2003-Jul-29 (A) 22.1 years old Born 2003-Jul-29 20030729 Dolphins Plus Bayside Nicky Alfonz Dolphins Plus Bayside to Dolphins Plus Oceanside (02-Jul-2013) to Dolphins Plus Bayside (??-???-????) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0010495 Luna F 2015-Jul-14 (A) 10.2 years old Born 2015-Jul-14 20150714 Dolphins Plus Bayside Samantha Kimbit - Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0010496 Nyla F 2015-Jul-24 (A) 10.1 years old Born 2015-Jul-24 20150724 Dolphins Plus Bayside Nica Alfonz - Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Dead The information in the table below represents the deceased population of dolphins & porpoises held at this facility (excluding killer whales). If you’re having trouble finding a specific animal, check the tabs above, they may have been transferred or lost to follow up. Italics indicate a deceased individual. Note : If you have a correction or would like to submit information please contribute@cetabase.org or use our contact form! September 9, 2025 6:09 pm Image Species Scientific ID #'s Name Sex Born Origin Origin Date Origin-Sort Captured / Born at: Mother Father Transfers Current / Last Facility: Status Status Date Stat Sort-Ref Cause of Death Notes Keyword column (invisible) Bottlenose Tursiops truncatus NOA0001904, 1904, AZA 0203 Genie F 1978-Jan-01 (E) 31.1 years old Capt 1981-Mar-04 19810304 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (04-Mar-1981) to Dolphins Plus Bayside (11-Jan-1998) Dolphins Plus Bayside Died 2009-Jan-28 20090128 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001908, 1908, AZA 0266 Spunky F 1981-Jan-01 (E) 27.7 years old Capt 1985-Apr-29 19850429 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (29-Apr-1985) to Dolphins Plus Bayside (25-Jan-1998) Dolphins Plus Bayside Died 2008-Sep-26 20080926 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001913, 1913, AZA 0315 Dreamer F - (U) ?? years old Capt 1987-Apr-26 19870426 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (26-Apr-1987) to Dolphins Plus Bayside (01-Feb-1999) Dolphins Plus Bayside Died 2002-Oct-31 20021031 Hepatic fibrosis - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001931, AZA 0541 Duke M 1994-Jul-23 (A) 14.1 years old Born 1994-Jul-23 19940723 Dolphins Plus MMR Spunky ??? Dolphins Plus Oceanside to Dolphins Plus Bayside (23-Jan-1998) Dolphins Plus Bayside Died 2008-Aug-28 20080828 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0006184, AZA 0915 Nica F 2004-Jun-02 (A) 19.5 years old Born 2004-Jun-02 20040602 Dolphins Plus MMR Jessica Kimbit Dolphins Plus Oceanside to Dolphins Plus Bayside (20-Oct-2011) Dolphins Plus Bayside Euthanized 2023-Dec-06 20231206 Intestinal torsion - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0010050 Nica's Calf M 2013-Jun-03 (A) 0.0 years old Born 2013-Jun-03 20130603 Dolphins Plus Bayside Nica ??? - Dolphins Plus Bayside Died 2013-Jun-05 20130605 Twisted gut - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0010758 Luna's Calf M 2022-Sep-06 (A) 0.0 years old Born 2022-Sep-06 20220906 Dolphins Plus Bayside Luna ??? - Dolphins Plus Bayside Died 2022-Sep-06 20220906 - - public display, dplusbay, died, dolphin Historical The information in the table below represents the historical population of dolphins & porpoises held at this facility (excluding killer whales). If you’re having trouble finding a specific animal, check the tabs above, they may have been transferred or lost to follow up. Italics indicate a deceased individual. This list includes both public display animals and rescue rehab cases. To exclude them, type either “public display” or “rehab” in the Filter box. Note: If you have a correction or would like to submit information please contribute@cetabase.org or use our contact form! Last Updated : Last Updated: September 9, 2025 6:09 pm Image Species Scientific ID #'s Name Sex Born Origin Origin Date Origin-Sort Captured / Born at: Mother Father Transfers Current / Last Facility: Status Status Date Stat Sort-Ref Cause of Death Notes Keyword column (invisible) Bottlenose Tursiops truncatus NOA0001904, 1904, AZA 0203 Genie F 1978-Jan-01 (E) 31.1 years old Capt 1981-Mar-04 19810304 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (04-Mar-1981) to Dolphins Plus Bayside (11-Jan-1998) Dolphins Plus Bayside Died 2009-Jan-28 20090128 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001908, 1908, AZA 0266 Spunky F 1981-Jan-01 (E) 27.7 years old Capt 1985-Apr-29 19850429 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (29-Apr-1985) to Dolphins Plus Bayside (25-Jan-1998) Dolphins Plus Bayside Died 2008-Sep-26 20080926 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001912, AZA 0314 Samantha F 1983-Jan-01 (E) 42.7 years old Capt 1987-Apr-07 19870407 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (07-Apr-1987) to Dolphins Plus Bayside (21-Mar-2010) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0001913, 1913, AZA 0315 Dreamer F - (U) ?? years old Capt 1987-Apr-26 19870426 Florida Keys Wild Wild Florida Keys to Dolphins Plus Oceanside (26-Apr-1987) to Dolphins Plus Bayside (01-Feb-1999) Dolphins Plus Bayside Died 2002-Oct-31 20021031 Hepatic fibrosis - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001929, 1929, AZA 0508 Alfonz M 1993-Jul-25 (A) 32.1 years old Born 1993-Jul-25 19930725 Dolphins Plus MMR Genie Fonzie Dolphins Plus Oceanside to Dolphins Plus Bayside (11-Jan-1998) to Dolphins Plus  (~ Apr 2016)  to Dolphins Plus Bayside (2023-Sep-09) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0001931, AZA 0541 Duke M 1994-Jul-23 (A) 14.1 years old Born 1994-Jul-23 19940723 Dolphins Plus MMR Spunky ??? Dolphins Plus Oceanside to Dolphins Plus Bayside (23-Jan-1998) Dolphins Plus Bayside Died 2008-Aug-28 20080828 - - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0001932, AZA 0542 Bob M 1994-Jul-28 (A) 31.1 years old Born 1994-Jul-28 19940728 Dolphins Plus MMR Jessica Little Bit Dolphins Plus Oceanside to Dolphins Plus Bayside (2023-Sep-09) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0006151, AZA 0877 Leo M 2003-Jul-29 (A) 22.1 years old Born 2003-Jul-29 20030729 Dolphins Plus Bayside Nicky Alfonz Dolphins Plus Bayside to Dolphins Plus Oceanside (02-Jul-2013) to Dolphins Plus Bayside (??-???-????) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0006184, AZA 0915 Nica F 2004-Jun-02 (A) 19.5 years old Born 2004-Jun-02 20040602 Dolphins Plus MMR Jessica Kimbit Dolphins Plus Oceanside to Dolphins Plus Bayside (20-Oct-2011) Dolphins Plus Bayside Euthanized 2023-Dec-06 20231206 Intestinal torsion - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0010050 Nica's Calf M 2013-Jun-03 (A) 0.0 years old Born 2013-Jun-03 20130603 Dolphins Plus Bayside Nica ??? - Dolphins Plus Bayside Died 2013-Jun-05 20130605 Twisted gut - public display, dplusbay, died, dolphin Bottlenose Tursiops truncatus NOA0010495 Luna F 2015-Jul-14 (A) 10.2 years old Born 2015-Jul-14 20150714 Dolphins Plus Bayside Samantha Kimbit - Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0010496 Nyla F 2015-Jul-24 (A) 10.1 years old Born 2015-Jul-24 20150724 Dolphins Plus Bayside Nica Alfonz - Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0010758 Luna's Calf M 2022-Sep-06 (A) 0.0 years old Born 2022-Sep-06 20220906 Dolphins Plus Bayside Luna ??? - Dolphins Plus Bayside Died 2022-Sep-06 20220906 - - public display, dplusbay, died, dolphin Rehab The information in the table below represents the rescue/rehab population of dolphins & porpoises held at this facility.  These animals are held off exhibit in quarantine or hospital pools.  The rescue/rehab inventory will include all historical rescues in addition to current patients (if any). If you’re having trouble finding a specific dolphin, check the tabs above, they may have moved or died. Italics indicate a deceased individual. There are no rescue cases held at this facility.  All rehab cases will be held under their sister park – SeaWorld Orlando. Transfers The information in the table below represents animals that have transferred out of this facility with the date of transfer and the location where they moved to.  This entry only represents the most recent transfer date of of this particular location.  If a dolphin has transferred back and forth multiple times, only the latest transfer is listed, however, the complete transfer history can be viewed by expanding the row. Image Species Scientific ID #'s Name Sex Born Origin Origin Date Origin-Sort Captured / Born at: Mother Father Transfer From: Transfer To: Transfer Date: Transfers (All) Current / Last Facility: Status Status Date Stat Sort-Ref Cause of Death Notes Keyword column (invisible) Bottlenose Tursiops truncatus NOA0001914, , , , AZA 316 Nikki F - (-) - years old Capt 1987-Apr-26 19870426 Florida Keys Wild Wild Dolphins Plus Bayside Theater of the Sea 2008-May-15 Florida Keys to Dolphins Plus (26-Apr-1987) to Dolphins Plus Bayside (01-Feb-1999) to Theater of the Sea (15-May-2008) to Dolphin Research Center (??-Nov-2012) to Theater of the Sea (2013?) Theater of the Sea - - - - Name was originally spelled \"Nicky\" public display, tots, living, dolphin Bottlenose Tursiops truncatus NOA0001929, 1929, AZA 508 Alfonz M 1993-Jul-25 (A) 31.3 years old Born 1993-Jul-25 19930725 Dolphins Plus MMR Genie Fonzie Dolphins Plus Bayside Dolphins Plus Oceanside ~Apr2016 Dolphins Plus Oceanside to Dolphins Plus Bayside (11-Jan-1998) to Dolphins Plus Oceanside (~ Apr 2016) Dolphins Plus MMR - - - - - public display, dplus, living, dolphin Bottlenose Tursiops truncatus NOA0001928, , , , - Kimbit M 1993-Aug-27 (A) 31.2 years old Born 1993-Aug-27 19930827 Dolphins Plus MMR Dinghy L.B. Dolphins Plus Bayside Theater of the Sea 2014-Oct-29 Dolphins Plus to Prospect Reef Resort (03-Sep-2001) to Dolphin Resort, Dominica (02-Oct-2002) to Dolphins Plus Bayside (17-May-2003) to Theater of the Sea (29-Oct-2014) Theater of the Sea - - - - - public display, tots, living, dolphin Bottlenose Tursiops truncatus NOA0006151, , , , AZA 877 Leo M 2003-Jul-29 (A) 21.3 years old Born 2003-Jul-29 20030729 Dolphins Plus Bayside Nicky Alfonz Dolphins Plus Bayside Dolphins Plus Oceanside 2013-Jul-02 Dolphins Plus Bayside to Dolphins Plus Oceanside (02-Jul-2013) to Dolphins Plus Bayside (??-???-????) Dolphins Plus Bayside - - - - - public display, dplusbay, living, dolphin Bottlenose Tursiops truncatus NOA0006241, TT1582, AZA 956 Elvis M 2004-Aug-05 (A) 10.9 years old Born 2004-Aug-05 20040805 Dolphins Plus MMR Spunky Alfonz Dolphins Plus Bayside Dolphins Plus Oceanside 2007-Dec-12 Dolphins Plus Bayside to Dolphins Plus Oceanside (12-Dec-2007) to Dolphins Plus Bayside (20-Oct-2011) to Dolphins Plus Oceanside (26-Jun-2013) Dolphins Plus MMR Died 2015-Jun-20 20150620 Possible sepsis, pneumonia - public display, dplus, died, dolphin Bottlenose Tursiops truncatus NOA0006241, TT1582, AZA 956 Elvis M 2004-Aug-05 (A) 10.9 years old Born 2004-Aug-05 20040805 Dolphins Plus MMR Spunky Alfonz Dolphins Plus Bayside Dolphins Plus Oceanside 2013-Jun-26 Dolphins Plus Bayside to Dolphins Plus Oceanside (12-Dec-2007) to Dolphins Plus Bayside (20-Oct-2011) to Dolphins Plus Oceanside (26-Jun-2013) Dolphins Plus MMR Died 2015-Jun-20 20150620 Possible sepsis, pneumonia - public display, dplus, died, dolphin Bottlenose Tursiops truncatus NOA0006483, , , , AZA ???? Julie F 2007-Aug-19 (A) 17.2 years old Born 2007-Aug-19 20070819 Dolphins Plus MMR Dinghy Little Bit Dolphins Plus Bayside Theater of the Sea 2020-Jan-20 Dolphins Plus Oceanside to Dolphins Plus Bayside (2011-Oct-20) to Theater of the Sea (2020-Jan-20) Theater of the Sea - - - - - public display, tots, living, dolphin Bottlenose Tursiops truncatus NOA0006426, SWF-TT-0708, 57034, AZA 1197 Ige M 2007-Sep-06 (A) 17.1 years old Born 2007-Sep-06 20070906 Discovery Cove Natalie Akai Dolphins Plus Bayside SeaWorld Orlando 2018-Jun-11 Discovery Cove Orlando to Dolphins Plus Bayside (19-Nov-2014) to SeaWorld Orlando (11-Jun-2018) SeaWorld Orlando - - - - - public display, swf, seaworldllc, living, dolphin Bottlenose Tursiops truncatus NOA0006536, SWF-TT-0903, 64263, AZA 1281 Brigg M 2009-Jun-06 (A) 15.4 years old Born 2009-Jun-06 20090606 Discovery Cove Clipper Capricorn Dolphins Plus Bayside SeaWorld Orlando 2018-Jun-11 Discovery Cove Orlando to Dolphins Plus Bayside (19-Nov-2014) to SeaWorld Orlando (11-Jun-2018) to Discovery Cove (??-???-????) Discovery Cove - - - - - public display, disco, seaworldllc, living, dolphin Bottlenose Tursiops truncatus NOA0006628, SWF-TT-1001, 64720, AZA 1396 Hurlee M 2010-Apr-20 (A) 14.5 years old Born 2010-Apr-20 20100420 Discovery Cove Thelma Akai Dolphins Plus Bayside SeaWorld Orlando 2018-Jun-11 Discovery Cove Orlando to Dolphins Plus Bayside (19-Nov-2014) to SeaWorld Orlando (11-Jun-2018) SeaWorld Orlando - - - - - public display, swf, seaworldllc, living, dolphin Bottlenose Tursiops truncatus NOA0006648, SWF-TT-1003, 64789, MAM20008, AZA 1398 Axl M 2010-May-16 (A) 14.5 years old Born 2010-May-16 20100516 Discovery Cove Rose Hutch Dolphins Plus Bayside SeaWorld Orlando 2018-Jun-11 Discovery Cove Orlando to Dolphins Plus Bayside (2014-Nov-19) to SeaWorld Orlando (2018-Jun-11) to Mississippi Aquarium (2020-Dec-03) Mississippi Aquarium - - - - - public display, msaq, living, dolphin Bottlenose Tursiops truncatus NOA0006744, , , , AZA ???? Isaac M 2011-Jun-01 (A) 13.4 years old Born 2011-Jun-01 20110601 Dolphins Plus Bayside Samantha Kimbit Dolphins Plus Bayside Dolphins Plus Oceanside ??-???-???? Dolphins Plus Bayside to Dolphins Plus Oceanside (??-???-????) to Theater of the Sea (2018-Oct-09) Theater of the Sea - - - - - public display, tots, living, dolphin REFERENCES : DISCLAIMER : The information on this page has been obtained from numerous sources believed to be reliable and is as up to date as possible. Please keep in mind that the very nature of this data is dynamic – animals are moved, give birth and die. We cannot guarantee the accuracy or completeness of any information contained on this site. Please be patient with any mistakes. If you would like to submit information or pictures please contact us . Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. © Ceta-Base 2006 - 2025 ~ dive into information, surface with knowledge ~ Facebook X Instagram Ceta-Base is a registered 501(c)(3) non-profit organization dedicated to compiling the most extensive global record of whales, dolphins, porpoises and other marine mammals under human care.  It is our goal to provide current and historical documentation on captive marine mammals while maintaining this data in an easily accessible format for the general public, scientists, advocacy groups and interested individuals. Inventories Toggle child menu Expand Luga’logue (Belugas) Toggle child menu Expand Belugas – Current Holders Belugas – Historical Holders Or’census (Orcas) Toggle child menu Expand Orcas – Current Holders Orcas – Historical Holders Phin’ventory (Dolphins) Toggle child menu Expand Dolphins – Current Holders Dolphins – Historical Holders Resources Toggle child menu Expand Maternity Ward Timeline Toggle child menu Expand 2020s Toggle child menu Expand 2025 2024 2023 2022 2021 2020 Drive Hunt Toggle child menu Expand Drive Hunt Results • Taiji Site Toggle child menu Expand About Us Materials & Methods Contact Toggle Menu Close Search for: Search"
    }
  ]
}