{
  "query": "dolphinsgrill.com email",
  "fuentes": [
    {
      "url": "https://www.floridatoday.com/story/entertainment/dining/2022/04/05/new-merritt-island-restaurant-boasts-water-views-polynesian-flair/7235635001/",
      "email": "sleonard@floridatoday.com"
    }
  ],
  "mails": [
    "mcannata@pfn365.com",
    "info@pfn365.com",
    "sleonard@floridatoday.com"
  ],
  "nombre_sitio": "dolphinsgrill.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.floridatoday.com/story/entertainment/dining/2022/04/05/new-merritt-island-restaurant-boasts-water-views-polynesian-flair/7235635001/",
      "text": "New Merritt Island restaurant boasts water views, Polynesian flair One person killed after vehicle struck by Brightline train in Rockledge News Space Sports Opinions Restaurants Advertise Obituaries eNewspaper Legals DINING New restaurant: Arrive at Merritt Island bar and grill by boat; enjoy Polynesian flair Suzy Fleming Leonard Florida Today Support local journalism: Find offers for new subscribers here: Special Offers — FLORIDA TODAY . Want to read our e-Edition? Here are some tips for getting the best experience. Dolphins Waterfront Bar & Grill on Merritt Island should come with a warning label: Having lunch there on a work day could negatively impact your desire to return to the office. That's not to say you shouldn't try it — for lunch or any other time. The giant tiki bar on the barge canal at Cape Crossing Resort & Marina opened March 12, with a Polynesian vibe and waterfront views. The spacious open-air restaurant seats 200 under a thatched roof that soars to 65 feet. A 40-foot floating dock provides space for boats. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Cheryl McPhillips, who owns the restaurant and marina with her husband Michael, said they started the project pre-pandemic. Google Earth still shows the site as patches of dirt. COVID-19 shut down construction in 2020. \"We thought the pandemic would be over in two weeks,\" McPhillips said. Work on the project didn't resume until 2021. For the past three weeks, word has spread about Dolphins, which is just off the Beachline, tucked into the Cape Crossing Resort & Marina. Michael McPhillips was the builder for Cape Crossing, which has townhomes and condos for vacation rental. \"He's a builder, I'm a NASA engineer,\" McPhillips said. The original plan was to turn the restaurant over to someone else once it was finished. After the pandemic, they decided to keep it in the family. New restaurant alert: 'We want to be the happening spot.' Titusville-Kennedy Space Center hotel readies for launch Restaurant news: Restaurant or night club? Marino's owner wants Cocoa restaurant to be known for its food \"Our main customer target is the resort and the Space Center,\" McPhillips said. But she's also hoping Brevard locals will discover Dolphins, especially by boat. They hired Brian Ahern, who previously worked at The Mansion in Melbourne, as general manager and Joe Knudsen, who has worked for Disney, The Mansion and at the Cocoa Beach Pier, as executive chef. Knudsen wants the menu to stay true to Polynesian and Florida cuisine. Pork sandwiches are served with grilled pineapple. Chicken sandwiches can be blackened, grilled or coconut and macadamia-crusted. The chef loves the fresh, tropical influences of island cuisine. Polynesian flavors are influenced by cuisines such as Japanese, French and Thai, he said, which means he can go in lots of directions. \"But we will focus on what is local and what is fresh,\" he said. Ahern agreed. The freezer, he said, is used for ice cream. Knudsen plans to change the menu seasonally. Among the appetizers are ceviche, the preparation of which changes daily, and chips served with guacamole and pineapple salsa. The kitchen goes through several quarts of smoked fish dip in a couple of hours. \"I think smoked fish dip should be Florida's state appetizer,\" Knudsen said. There are salad options, protein bowls and soups, including seafood chowder. The Tingley Burger pays tribute to the Tingley RV Park and Marina, which occupied the site for half a century and was known for its burgers. Knudsen said he tried 12 different bacons before settling on the cherrywood smoked variety featured on Beth's BLT. The entrees include a fish of the day, yellowfin tuna and Aloha Curry, loaded with shrimp, mussels, clams and fresh fish. Guests rave about the Key lime pie and pineapple upside down cake. And there's a kids menu, too, with dishes such as chicken tenders and macaroni and cheese. Knudsen also has included vegetarian and vegan options. He wants people with dietary limitations and diverse eating styles to enjoy Dolphins as much as omnivores. The vegetables, he said, are truly vegetarian, not cooked with ham or meat stock. He joked around with McPhillips about the eventual inclusion of Spam, that most Hawaiian of canned meats, in one of his dishes. She wrinkled her nose, but he persisted. \"There will be Spam on the menu,\" he said, \"but it will be house-made Spam.\" McPhillips said they haven't advertised the restaurant, hoping to start out slowly and break in the new staff and equipment. Word has spread fast, though. On weekends, the lunch crowd starts arriving around 11:30 a.m., and business is steady until at least 8:30 p.m. They're there to enjoy the breeze off the water and the occasional barge or sailboat cruising through the canal. They're there for pineapple salsa and smoked fish dip. They're there to play hooky from work. But don't tell the boss. Dolphins Waterfront Bar & Grill is at 310 Lagoon Way, Merritt Island. Hours are 11 a.m.-10 p.m. Wednesday-Saturday, 11 a.m.-9 p.m. Sunday. Eventually the restaurant also will be open Monday and Tuesday. Call 321-338-2220 or visit dolphinsgrill.com . Suzy Fleming Leonard is a features journalist with more than three decades of experience. Reach her at sleonard@floridatoday.com . Find on Facebook: @SuzyFlemingLeonard or on Instagram: @SuzyLeonard Support local journalism: Find offers for new subscribers here: Special Offers — USATodayNetwork . About Us Corrections Staff Directory Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.floridatoday.com. All rights reserved."
    }
  ]
}