{
  "fuentes": [
    {
      "url": "https://downtownmelbourne.com/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are/executive-leadership-team",
      "email": "aboriginal-flag@3x.png"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are/executive-leadership-team",
      "email": "torres-strait-islanders-flag@3x.png"
    },
    {
      "url": "https://downtownmelbourne.com/melbourne-main-street-receives-three-awards-at-the-2023-florida-main-street-secretary-of-state-awards/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/melbourne-main-street-receives-three-awards-at-the-2023-florida-main-street-secretary-of-state-awards/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://ebpackaging.com.au/pages/ebpak-contact-us",
      "email": "ebpak_simplified_130x@2x.png"
    },
    {
      "url": "https://ebpackaging.com.au/pages/ebpak-contact-us",
      "email": "info@ebpackaging.com.au"
    },
    {
      "url": "https://www.linkedin.com/company/melbournemainstreet",
      "email": "chase.tramont@flhouse.gov"
    },
    {
      "url": "https://www.linkedin.com/company/melbournemainstreet",
      "email": "james.buchanan@flhouse.gov"
    },
    {
      "url": "https://downtownmelbourne.com/about/leadership/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/about/leadership/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://www.yahoo.com/news/man-20-shot-death-during-143155689.html",
      "email": "app-store-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/man-20-shot-death-during-143155689.html",
      "email": "google-play-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/man-20-shot-death-during-143155689.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://downtownmelbourne.com/business-ties-build-strong-downtown-melbourne/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/business-ties-build-strong-downtown-melbourne/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://downtownmelbourne.com/events/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/events/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://www.floridatoday.com/story/news/local/2022/05/30/chumleys-depot-founder-dies-florida-tech-downtown-melbourne-legacy/9804154002/",
      "email": "rneale@floridatoday.com"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/",
      "email": "fw-banner-pattern-transparent@2x-1024x576.png"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/",
      "email": "events@downtownmelbourne.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/arts-culture/downtown-melbourne/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "city.media@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "cityhospitality@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "citypartnerships@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "community@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "info@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "membership@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "membership@melbournecityfc.com.auphone"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "officialshop@melbournecityfc.com.au"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "email": "safeatcity@melbournecityfc.com.au"
    },
    {
      "url": "https://downtownmelbourne.com/contact/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/contact/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://downtownmelbourne.com/about/melbourne-main-street/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/about/melbourne-main-street/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are",
      "email": "aboriginal-flag@3x.png"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are",
      "email": "torres-strait-islanders-flag@3x.png"
    },
    {
      "url": "https://www.fox35orlando.com/news/20-year-old-killed-downtown-melbourne-shooting-officials-say",
      "email": "fox35news@fox.com"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/about/",
      "email": "fw-banner-pattern-grey@2x-400x225.jpg"
    },
    {
      "url": "https://downtownmelbourne.com/businesses/melbourne-main-street-inc/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/businesses/melbourne-main-street-inc/",
      "email": "info@downtownmelbourne.com"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/contact/",
      "email": "fw-banner-pattern-grey@2x-400x225.jpg"
    },
    {
      "url": "https://downtownmelbourne.com/plan/",
      "email": "search@2x.png"
    },
    {
      "url": "https://downtownmelbourne.com/plan/",
      "email": "info@downtownmelbourne.com"
    }
  ],
  "mails": [
    "aboriginal-flag@3x.png",
    "app-store-icon@3x.png",
    "chase.tramont@flhouse.gov",
    "chosen-sprite@2x.png",
    "city.media@melbournecityfc.com.au",
    "cityhospitality@melbournecityfc.com.au",
    "citypartnerships@melbournecityfc.com.au",
    "community@melbournecityfc.com.au",
    "ebpak_simplified_130x@2x.png",
    "events@downtownmelbourne.com",
    "fox35news@fox.com",
    "fw-banner-pattern-grey@2x-400x225.jpg",
    "fw-banner-pattern-transparent@2x-1024x576.png",
    "google-play-icon@3x.png",
    "info@downtownmelbourne.com",
    "info@ebpackaging.com.au",
    "info@melbournecityfc.com.au",
    "james.buchanan@flhouse.gov",
    "membership@melbournecityfc.com.au",
    "membership@melbournecityfc.com.auphone",
    "officialshop@melbournecityfc.com.au",
    "rneale@floridatoday.com",
    "safeatcity@melbournecityfc.com.au",
    "search@2x.png",
    "torres-strait-islanders-flag@3x.png",
    "u003ebillhimself@yahoo.com"
  ],
  "nombre_sitio": "downtownmelbourne.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://downtownmelbourne.com/",
      "text": "Visit Historic Downtown Melbourne, Florida Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Enticing experiences await with hundreds of unique venues to shop, dine, play & explore. VISIT Historic Downtown Melbourne. Home 2024-05-15T15:32:40-04:00 Who is Melbourne Main Street? Click below to watch a video that was shown during The Flavor Experience and learn about our community. relax. refresh. reboot. From culture to cuisine and pampering to partying — you’ll find everything you need, want, and wish for in Downtown Melbourne. SHOP From boutiques and antiques to handcrafted skincare and specialty cigars, you can find them here. SHOP IN DTMB DINE With over 40 craft restaurants and bars, indulgence is expected in Downtown Melbourne. DINE IN DTMB PLAY Rent a kayak, take in live theater or rock out in one of many local music venues. Downtown Melbourne is a playground for all ages. PLAY IN DTMB EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB UPCOMING EVENTS Farmer’s Market at Riverview Park September 13, 2025 @ 10:00 am - 2:00 pm Green Gables Historic Home Open House September 13, 2025 @ 10:00 am - 2:00 pm Melbourne Municipal Band Concert: Sway With U … September 17, 2025 @ 7:00 pm - 9:00 pm Melbourne Municipal Band Concert: Sway With U … September 18, 2025 @ 7:00 pm - 9:00 pm View All Events Plan Your Visit Are you planning a trip to Downtown Melbourne? Find trip planning tips, parking information, places to stay and more. Start Planning Recent News & Stories Categories: Community , July 22, 2023 Melbourne Main Street receives Three Awards a … more Categories: Events , June 22, 2023 New Location for 2023 DTMB Food and Wine Fest … more Categories: Community , May 17, 2023 Melbourne Main Street Welcomes New Board Memb … more Categories: Economic Development , February 2, 2022 The Road to Economic Development Runs Through … more Categories: Community , November 15, 2021 Business Ties Build Strong Downtown Melbourne more Categories: Events , November 1, 2021 Space Coast Daily Interviews Kim Agee About F … more Categories: Events , October 14, 2021 Melbourne Main Street to Host Downtown Melbou … more Categories: Events , October 12, 2021 Melbourne Regional Chamber Interviews Kim Age … more Categories: Construction , July 1, 2021 Brightline Construction to Shut Down Melbourn … more Categories: Community , January 22, 2021 Downtown Melbourne Thrives Pandemic, Or No more Categories: Community , January 15, 2021 321 Lift Off Interviews Kim Agee more View All News #DT MB Tag your Downtown Melbourne experience. VIEW ALL PHOTOS Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE About Melbourne Main Street Melbourne Main Street is a 501(c)(3) non-profit organization dedicated to revitalizing and enhancing the economic growth of Historic Downtown Melbourne. Learn More CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are/executive-leadership-team",
      "text": "Executive leadership team | Melbourne Water Skip to main content Toggle navigation Melbourne Water Mega nav Water and environment Water and environment Close navigation Water management Water management Rainfall and river levels Sewerage Water quality Water storage levels Rivers and creeks Allocating Melbourne's water resources Water storage reservoirs Drop down content end Saving water Saving water Let’s talk water Permanent water-saving rules and Target 150 Raingardens Tips for saving water Drop down content end Flooding and drainage Flooding and drainage Flooding and its impacts Managing flood risk together Prepare for flooding Drainage system Greater Melbourne Flood Information Program Maribyrnong River flood Drop down content end Climate change Climate change How we are taking action Tackling climate change Enhancing liveability: our commitment Our water supply challenges Our path to net zero North -South pipeline Urban cooling Drop down content end Energy Energy Biogas Biosolids Hydropower Solar farms Integrated water management Drop down content end Land and catchments Land and catchments Catchments and conservation Climate smart agriculture Feral Cat Free French Island Grow West Living Links Yarra4Life Drop down content end Waterway diversions Waterway diversions Restriction and ban status Stream flow management Water use compliance Drop down content end Learning resources Today's water storages Today's rainfall levels View the Dam Cam Drop down content end Services Services Close navigation Projects and maintenance works Maintenance Maintenance Grass cutting maintenance Revegetation and weed control works Desilting creeks, wetlands and drains Drop down content end Building and works Building and works Apply to build and develop Building and home renovation Flooding information and advice Work or build near our assets or easements Amendments list Developer guides and resources Stormwater management Supporting the delivery of housing across Greater Melbourne Drop down content end Grants Grants Liveable Communities, Liveable Waterways Program Victorian Landcare Grants Drop down content end Licences and permits Licences and permits About diversion licences Birdwatching access Dam safety, licences and registration Diversion pricing, forms and guidelines Metering, pump and offtake guidelines Pay online Water trading and licence transfers Drop down content end Use our land Prices and charges Prices and charges Price Submission Bulk water and sewerage Waterways and Drainage Charge Construction, works and connections Flood level information Hydrologic data Clearwater Drop down content end Local water company contacts Pay online Apply to build or develop What's happening near me? Find drainage schemes and rates Drop down content end Education Education Close navigation Community resources Community resources Public tours Citizen science Water knowledge Drop down content end School resources School resources Excursions Teacher Toolbox Melbourne's World of Water Drop down content end Stay in touch How water is supplied to you Saving water How we generate energy Our history Drop down content end Things to do Things to do Close navigation Events Walking tracks and bike paths Barbecue locations Birdwatching Birdwatching Bird species at the Western Treatment Plant Drop down content end Fishing Become a volunteer Western Treatment Plant Drip Trip: the game Build a raingarden Drop down content end About us About us Close navigation Who we are Who we are Board of Directors Executive leadership team Traditional Owner partners History and heritage Drop down content end What we do What we do News Annual report Publications Policies Legislation Research and innovation Our customers Drop down content end Careers Careers Apply for a job Create a job alert Existing applicant login Training and approval to work on a Melbourne Water site Drop down content end Contact us Contact us Online enquiry Complaints Drop down content end Apply for a job Contractor training, induction and site access Read our annual report Read our news Drop down content end Toggle search Fulltext search Search Close navigation Home Close navigation Mobile navigation Home About us Who we are Executive leadership team Left navigation Left navigation About us Who we are Board of Directors Executive leadership team Traditional Owner partners Who is Melbourne Water? History and heritage What we do Careers Contact us Left nav - about us Executive leadership team Our Managing Director oversees six organisational portfolios with a broad range of responsiblities: Service Futures Service and Asset Lifecycle Service Delivery Customer, Community and External Affairs People and Transformation Corporate Services. Organisational Structure Click to enlarge image Executive leadership team ​Leadership team Title and responsibilities​ ​ ​ Dr Nerina Di Lorenzo Managing Director Dr Nerina Di Lorenzo was appointed Managing Director on 1 December 2021 , after having spent two years as Melbourne Water’s Executive General Manager of Service Delivery . She has had over 21 years of experience in senior leadership roles, including almost five years as CEO of Moreland City Council. Her roles have spanned the areas of Asset Management, Infrastructure Operations, Project Delivery and Business Improvement. Prior to this, she held roles in the oil industry working on the oil rigs in Bass Strait. Nerina has a Bachelor of Engineering, a Bachelor of Business and a PhD centering on the topic of organisational change management. Chris Brace Executive General Manager, Service Futures Chris Brace is responsible for the Service Futures portfolio, which holds the medium- to long-term planning horizon and how our business adapts to coming challenges. Service Futures encompasses enterprise strategy, evaluation, monitoring and reporting functions, as well as modelling and research. In addition, the portfolio manages the end-to-end delivery of urban planning functions, strategic goals and our approach to critical adaptation issues. ​ Craig Dixon Executive General Manager, Service and Asset Lifecycle Craig Dixon is responsible for the Services and Asset Lifecycle portfolio, including the medium-term planning horizon (1-5 years) and translating our strategies into programs and capital development plans. The portfolio holds both growth and renewals planning, and develops and delivers capital built and natural infrastructure programs and manages assets. Sue Jackman Executive General Manager, Service Delivery Sue Jackman is responsible for the Service Delivery portfolio, which holds the short-term planning horizon to support reliable provision of day-to-day services. This includes delivering our core operational services in water supply, sewerage, waterways, flooding, drainage and land management that are essential to our customers and community, as well as all maintenance, planning, scheduling and execution to support them. Vivien Allimonos Executive General Manager, Customer, Community and External Affairs Vivien Allimonos is responsible for the Customer, Community and External Affairs portfolio, which holds all public-facing activity including our whole-of-business communications, marketing and media functions. The portfolio also holds customer insights and experience as well as frontline customer service activities, public engagement, Traditional Owner relationships and internal communications. Paula Jeffs Executive General Manager, People and Transformation Paula Jeffs is responsible for the People and Transformation portfolio.  This portfolio works to provide the right workplace environment to support our people to do their best work. It includes Capability, People Experiences, Business Transformation, Organisational Effectiveness, Health and Safety, Environment and Quality, and People Services. Fiona Schutt Executive General Manager, Corporate Services Fiona Schutt is responsible for the Corporate Services portfolio, which manages key enablement systems and functions including finance, procurement, audit, risk and legal, and information technology services. How useful was this information? 1 out of 5 stars 2 out of 5 stars 3 out of 5 stars 4 out of 5 stars 5 out of 5 stars What could we improve? We use reCAPTCHA to protect our website from spam, for more information about the data we collect see our privacy website statement . Last updated: 15 July 2024 Footer menu Careers About us Services Water data environment Melbourne Water respectfully acknowledges the Bunurong, Gunaikurnai, Taungurung, Wadawurrung and Wurundjeri Woi-wurrung peoples as the Traditional Owners and Custodians of the land and water on which we rely and operate. We pay our deepest respects to their Elders past, present and emerging. Call 131 722 Footer privacy menu Translating services Accessibility Disclaimer Privacy Back to top"
    },
    {
      "url": "https://downtownmelbourne.com/melbourne-main-street-receives-three-awards-at-the-2023-florida-main-street-secretary-of-state-awards/",
      "text": "Melbourne Main Street receives Three Awards at the 2023 Florida Main Street Secretary of State Awards - Downtown Melbourne Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Home » Melbourne Main Street receives Three Awards a … Home » About » News & Stories » Melbourne Main Street receives Three Awards a … Melbourne Main Street receives Three Awards a … July 22, 2023 Melbourne Main Street is proud to have received three Secretary of State awards at the 38th Annual Preservation on Main Street conference Thursday, July 20, 2023. Secretary Cord Boyd presented the 2023 Florida Main Street Awards at the Reilly Arts Center in Ocala, FL. Secretary Boyd annually recognizes outstanding Main Street organizations for innovative projects, impactful people, organizations, and businesses throughout Florida’s 57 Main Street communities. Secretary Boyd states, “These awards highlight not only inventive projects and processes but also individuals who help distinguish their communities.” Melbourne Main Street and representatives earned the following awards: Local Leader of the Year, Board Member of the Year, and Telling Your Story. Like many non-profit organizations, Melbourne Main Street relies heavily on volunteers, board members, community leaders, and businesses to promote our district as a premiere destination. Two of the awards recognize individuals working tirelessly to improve Downtown Melbourne for residents, business owners, visitors, and the community. Local Leader of the Year – Paul Alfrey In every community, it takes a leader to move the community forward, to lead with strength and grace, and to have the ability to see all sides before making decisions. In Downtown Melbourne, that is Mayor Paul Alfrey. Mayor Alfrey is one of Downtown Melbourne’s biggest supporters. As a Melbourne native, he has a personal connection with the area and wants to see it reach its full potential. He is respectful of history while working to catapult it into the next generation. He is always at the forefront of advocacy for new developments and residential density while maintaining the unique balance we all desire. He doesn’t shy away from complex and difficult situations and always works to ensure a balanced approach to solutions. Melbourne Main Street began its partnership with Mayor Alfrey in 2021 during the pandemic. During the last year, he has been working in tandem with us, listening, guiding, solving complicated issues, supporting us with personal funds, volunteering, and advocating for the important work we do for our community. He is a leader who has a vision and understands how public policy, public safety, and city finances work. He keeps an open mind, ensures constitutional rights are protected, and makes good decisions for our community. Since taking office two years ago, Mayor Alfrey has had the most impact on his leadership as it relates to the homeless in our community. He has been a huge advocate for homeless issues in the area, allocating $2.5 million from American Rescue Funds from the city’s budget toward a new comprehensive facility. He works alongside city staff, Melbourne Main Street, Daily Bread, and local property owners to find compassionate solutions to solve this extremely complex situation. Mayor Alfrey clearly understands how vital economic development is to our community and downtown and embraces new ideas while understanding and educating himself. He works to negotiate and work with others to enable our community to thrive. Meeting with property owners, developers, and critical partners – all to find the best opportunities and projects for Downtown Melbourne. He regularly attends the Melbourne Main Street board and business owner meetings, listening and speaking on current issues in Downtown. He is a centerpiece at our annual Candlelight Shopping & Tree Lighting Ceremony as well as the Best Bite presenter at our annual Downtown Melbourne Food and Wine Festival. Mayor Alfrey is a huge proponent of Melbourne Main Street’s work to enhance our community by creating and enhancing our unique location. He is always present, keeps us informed and connected, and is willing to hear new ideas and keep things moving forward. Board Member of the Year – Corey Runte Melbourne Main Street nominates Mr. Corey Runte as Board Member of the Year for his outstanding service to our organization. Mr. Runte, whose office is in Downtown Melbourne, has been involved in Melbourne Main Street for more than 12 years in various capacities. He has executed the Four Points through his service on Economic Vitality, Promotions, Organization, and Design committees and consistently makes a positive impact on the organization. In the fall of 2020, facing the fallout of the pandemic and during a tumultuous time in the 0rganization’s history, Corey volunteered to take the critically important role of Board Chair when the organization and leadership were in crisis. Facing resignations from officers and other board members, he took the reins and got to work. He served for 2.5 years guiding our Board through a full organizational transformation and finished his term in December of 2022. He was instrumental in the restructuring of the Board of Directors, updating bylaws, recreating our chart of accounts, enhancing technology, and organizing the first-ever Board retreat. In 2022, he also tackled launching a complete rebranding and a new, comprehensive website. In addition, he led with determination and grace, while welcoming business and community leaders from a wide representation of our community who are committed to the revitalization of Downtown Melbourne. His infectious energy and vision are palatable. His steadfast vision for a better downtown was supported through thousands of hours dedicated to building relationships with the board and committee members, businesses, and property owners while enhancing relationships with members of the City Council and City staff. Since April of 2022, Mr. Runte personally raised more than $15,000 for our mission, which surpasses all other volunteers. During his unending devotion to our organization, he has never faltered. Even when welcoming twin boys, moving twice, running for reelection, and building a house! During the last year, we realized record revenue increases through events and private sector contributions, revitalized events with successful customer satisfaction, repaired relationships, and had more fun than we could capture. Corey has a special way about him as a person and a leader, strengthening relationships, our mission and reputation and never losing sight of our primary goal of revitalization. Melbourne Main Street and Downtown Melbourne would not be what it is today without him, and we are eternally grateful for his service and his continued impact. Corey Runte is incredibly deserving. Telling Your Story (Category B) Melbourne Main Street is a 501(c)3 non-profit organization committed to positioning Historic Downtown Melbourne as the center of the community and the preferred destination for authentic economic activity. The mission is to revitalize and enhance the economic growth of Historic Downtown Melbourne by strengthening and showcasing the community’s positive unique characteristics. After many years of a stale and outdated brand, the Melbourne Main Street Board of Directors invested in a rebranding of all assets to further propel the mission for the community and our organization. A brighter, more vibrant logo and a comprehensive website were a top priority and a considerable investment. With a strategic partnership from a local advertising and marketing company MTN Advertising, which also has a passion and desire for the improvement of Downtown Melbourne, the organization was able to produce a stunning new brand to propel the community forward. The beginning phases of the discussion circled around the name identity of the organization and the district. During the rebranding, the shift was made to identify this area as DTMB with Melbourne Main Street also included. The syllable-based acronym was developed for simplifying communication in digital conversations. When people talk about visiting our community and posting about their experiences, most refer to it as Downtown Melbourne, which we now term DTMB. This new clarity has helped better market the mission of Melbourne Main Street for revitalization. Downtown Melbourne and better connect to the community and visitors about our mission, allowing for a fun and memorable way to describe our area. The identity was crafted with bold block letters symbolizing timeless revitalization and economic growth, while the simplistic sail, crane, and wave carved within the negative space help preserve the unique characteristics of the Historic Downtown Melbourne waterfront location. This refreshing new logo is prominent up and down New Haven Avenue on signage and street poles and helps identify this quaint, yet vibrant community of DTMB. All new publications, marketing, and assets now showcase the DTMB logo which can be seen on billboards, the website, rack cards, the Visitor Guide, letterhead, folders, promotional materials, membership program brochure, and throughout the district. Related News Categories: Community , July 22, 2023 Melbourne Main Street receives Three Awards a … more Categories: Events , June 22, 2023 New Location for 2023 DTMB Food and Wine Fest … more Categories: Community , May 17, 2023 Melbourne Main Street Welcomes New Board Memb … more Categories: Economic Development , February 2, 2022 The Road to Economic Development Runs Through … more Categories: Community , November 15, 2021 Business Ties Build Strong Downtown Melbourne more Categories: Events , November 1, 2021 Space Coast Daily Interviews Kim Agee About F … more Categories: Events , October 14, 2021 Melbourne Main Street to Host Downtown Melbou … more Categories: Events , October 12, 2021 Melbourne Regional Chamber Interviews Kim Age … more Categories: Construction , July 1, 2021 Brightline Construction to Shut Down Melbourn … more Categories: Community , January 22, 2021 Downtown Melbourne Thrives Pandemic, Or No more Categories: Community , January 15, 2021 321 Lift Off Interviews Kim Agee more KEEP EXPLORING! MAIN STREET Melbourne Main Street is a 501(c)(3) non-profit organization that works to cultivate partnerships to revitalize Historic Downtown Melbourne. Learn More LEADERSHIP From the Melbourne Main Street Board of Directors to the Downtown Melbourne team, get to know our leadership. MEET LEADERSHIP HISTORY Downtown Melbourne is one of the most charming parts of Melbourne, with a history that dates back to the 1800s. Explore History WORK Many space, defense, and technology companies call Downtown Melbourne home, allowing easy access to premium lunch spots and waterfront parks. WORK IN DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://ebpackaging.com.au/pages/ebpak-contact-us",
      "text": "eBPak Contact US Skip to content Free Delivery for Pickup Special Products (Sydney Melbourne Only) Over $500. Protective Packaging Consumables Box & Carton Envelopes Courier Bags Labels EcoFriendly Wholesale Contact US Need help? Call us 02-8750 5347 info@ebpackaging.com.au Back Protective Packaging All Items New Products Top Buy Bubble Wrap Foil Wrap Foam Wrap Bubble Pouch Wrapping Paper Tissue Paper Packing Peanuts Back Consumables Printer Cartridges Ziplock Bag Amazon FBA Bags Pouch Packaging Food Packaging Strapping Stretch Film Document Enclosed Packaging Tape Back Box & Carton All Boxes & Cartons By Colour By Size Boxes for Prepaid Satchels Top Selling Diecut Boxes Popular Box Collections Regular Cartons Medium & Large Cartons Diecut Boxes Heavy Duty Cartons Superflat Boxes Tuck Front Boxes Self Seal eCommerce Boxes Self Seal Book Wrap Long Tube Boxes Candle Boxes Wine Boxes Back Envelopes Honeycomb Padded Mailers Standard Bubble Envelopes White Poly Bubble Mailers Black Poly Bubble Mailers Pink Poly Bubble Mailers Premium Metallic Bubble Mailers 110gsm Business Envelopes 300gsm Card Mailers 700gsm Rigid Mailers eFlute Rigid Mailers LP Vinyl Mailers Back Courier Bags White Poly Mailer Black Poly Mailer Hot Pink Poly Mailer Rose Pink Poly Mailer FBA Poly Jackets Compostable Mailer Back Labels Thermal Labels By Size A4 Labels for Inkjet & Laser Printers Printer Catridges Direct Thermal Label Printers Back EcoFriendly Mailing Box Book Wrap Envelope Honeycomb padded mailer Compostable Courier Bags Protective Packaging Packing Material Back Wholesale Bubble Mailer Bubble Wrap Mailing Box Shipping Carton Mailing Satchel Tape & Stretch Film Back Contact US General Inquiry Custom Packaging Quote Loyalty page Made in Australia Season Special Customer Reviews Back Ziplock Bag 80x110mm 100x140mm 100x190mm 140x185mm 140x190mm 150x205mm 160x225mm 180x240mm 200x280mm 230x310mm 240x340mm 260x360mm 290x375mm 360x425mm Back Amazon FBA Bags 127x254mm 152x203mm 152x229mm 203x254mm 229x305mm 254x305mm 254x330mm 254x381mm 279x356mm 305x381mm 305x432mm 356x508mm 420x495mm 457x610mm 483x610mm Back Pouch Packaging Matte Stand Up Bags Foil Stand Up Pouches Zipper Garment Bag Vacuum Bags Back By Colour White boxes Brown Boxes Black Boxes Rose Pink Boxes Hot Pink Boxes Blue Boxes Mint Blue Boxes Green Boxes Light Green Boxes Purple Boxes Lavender Boxes Red Boxes Orange Boxes Grey Boxes Indigo Blue Boxes Back By Size 55x55x80mm 65x65x450mm 65x65x610mm 80x80x100mm 80x80x200mm 80x80x268mm 80x80x430mm 80x80x610mm 80x80x660mm 80x80x800mm 80x80x1200mm 85x85x340mm 100x75x50mm 100x75x75mm 100x90x55mm 100x100x100mm 100x100x200mm 100x100x250mm 100x100x400mm 100x100x610mm 100x100x800mm 100x100x985mm 100x100x1000mm 105x105x115mm 120x120x120mm 120x120x170mm 120x120x220mm 125x100x75mm 128x97x37mm 128x97x60mm 130x115x75mm 130x130x40mm 132x100x75mm 135x135x135mm 140x80x16mm 140x135x175mm 140x140x90mm 140x140x115mm 145x120x50mm 150x100x75mm 150x100x100mm 150x120x90mm 150x150x75mm 150x150x150mm 150x150x600mm 150x150x800mm 152x127x95mm 152x132x16mm 155x115x45mm 165x135x80mm 165x165x165mm 174x128x53mm 175x100x100mm 175x128x75mm 176x135x95mm 178x140x76mm 180x100x16mm 180x100x30mm 180x150x80mm 180x180x36mm 180x180x105mm 180x180x180mm 192x125x16mm 196x148x16mm 200x165x35mm 200x180x50mm 200x200x200mm 205x125x125mm 205x155x130mm 205x175x95mm 210x110x45mm 210x140x60mm 210x205x55mm 215x215x110mm 220x110x80mm 220x110x95mm 220x120x100mm 220x130x95mm 220x145x35mm 220x160x16mm 220x160x77mm 220x160x90mm 220x160x100mm 220x160x120mm 220x170x40mm 220x180x120mm 230x150x50mm 230x150x80mm 230x180x130mm 230x230x230mm 240x110x95mm 240x125x75mm 240x125x95mm 240x140x140mm 240x150x60mm 240x150x80mm 240x190x120mm 241x171x82mm 245x145x45mm 245x148x190mm 250x100x60mm 250x145x139mm 250x150x52mm 250x150x90mm 250x155x100mm 250x158x50mm 250x190x90mm 250x250x250mm 260x260x110mm 265x265x150mm 270x200x55mm 270x160x120mm 270x200x95mm 280x180x80mm 280x192x16mm 280x212x90mm 285x195x75mm 290x110x95mm 292x150x185mm 295x145x55mm 295x200x120mm 300x130x120mm 300x250x250mm 300x300x100mm 300x300x200mm 300x300x300mm 310x230x52mm 310x200x300mm 310x220x16mm 310x220x70mm 310x210x90mm 310x230x105mm 310x225x120mm 310x250x50mm 310x250x150mm 310x310x110mm 310x310x120mm 320x220x50mm 320x240x160mm 320x240x190mm 335x335x16mm 350x250x15mm 350x350x350mm 355x280x100mm 360x250x20mm 360x310x80mm 365x280x95mm 390x280x140mm 400x135x175mm 400x200x180mm 400x280x180mm 400x300x430mm 410x300x80mm 430x307x50mm 430x275x95mm 430x305x140mm 430x305x255mm 430x305x310mm 440x277x168mm 440x320x20mm 455x320x155mm 485x385x265mm 500x210x210mm 500x440x350mm 560x480x400mm Back Boxes for Prepaid Satchels For Small Prepaid Bags For Medium Prepaid Bags For Large Prepaid Bags For Extra Large Prepaid Bags Back Honeycomb Padded Mailers E0 125x160mm E1 150x225mm E2 215x280mm E4 240x340mm E5 265x380mm E6 300x405mm E7 360x480mm Back Standard Bubble Envelopes #00 100x180mm #0B 120x180mm #01 160x230mm #DM 172x220mm #02 215x280mm #03 230x330mm #04 235x350mm #05 260x380mm #06 300x400mm #07 360x480mm Back White Poly Bubble Mailers G0B 120x180mm G01 160x230mm G02 215x280mm G04 235x350mm G05 260x380mm G06 300x400mm G07 360x480mm G09 560x410mm Back Black Poly Bubble Mailers G00 100x180mm G01 160x230mm G02 215x280mm G04 235x350mm G05 260x380mm G06 300x400mm G07 360x480mm Back Pink Poly Bubble Mailers #00 100x180mm #01 160x230mm #02 215x280mm #04 235x350mm #05 260x380mm #07 360x480mm Back Premium Metallic Bubble Mailers #00 130x130mm #01 160x230mm #02 210x290mm #05 260x380mm Back White Poly Mailer #00 160x230mm #01 190x260mm #2W 200x350mm #2S 225x355mm #02 255x330mm #3S 280x380mm #3W 280x420mm #03 310x405mm #4S 340x440mm #04 350x480mm #5S 420x450mm #05 400x500mm #5V 400x550mm #5W 430x545mm #6S 490x550mm #06 500x650mm #07 600x650mm #08 650x750mm #09 750x900mm Back Black Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm #06 500x650mm #07 600x650mm #08 650x750mm #09 750x900mm Back Hot Pink Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm #07 600x650mm Back Rose Pink Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm Back FBA Poly Jackets 127x254mm 152x203mm 152x229mm 203x254mm 229x305mm 254x305mm 254x330mm 254x381mm 279x356mm 305x381mm 305x432mm 356x508mm 420x594mm 457x610mm 483x610mm Back Thermal Labels By Size 30x20mm 40x20mm 40x30mm 50x30mm 50x40mm 50x50mm 60x30mm 60x40mm 60x50mm 70x30mm 70x40mm 70x50mm 80x40mm 80x60mm 80x80mm 100x20mm 100x27mm 100x50mm 100x60mm 100x70mm 100x80mm 100x100mm 100x120mm 100x150mm 100x175mm 100x187mm 100x200mm eBPak Clear All categories All categories A4 Labels Big Regular Mailing Box Big Tuck Front Gift Box Book Wrap Bubble Liner Bubble Padded Envelope Bubble Wrap Business Envelope Candle Box Card Envelope Cartridge corner protector Courier Bag Diecut Mailing Box doucment pouch eFlute Rigid Mailer Envelopes Heavy Duty Mailing Box Honeycomb padded mailer Labels Long Tube Mailing Box Mailing Box Metallic Bubble Mailer Packaging Pouch Packing Materials Packing Tape Paper Bubble Mailer Poly Bubble Mailer Poly Mailer Regular Mailing Box Rigid Mailer Samples Self Seal Mailing Box Stretch Film Sugarcane Products Superflat Mailing Box Tape Dispenser tissue paper Tube Carton Tuck Front Mailing Box Wholesale Wine Box Ziplock Bag Close Login / Signup My account 0 Cart Your cart is empty Shop our products Protective Packaging All Items New Products Top Buy Bubble Wrap Foil Wrap Foam Wrap Bubble Pouch Wrapping Paper Tissue Paper Packing Peanuts Consumables Printer Cartridges Ziplock Bag 80x110mm 100x140mm 100x190mm 140x185mm 140x190mm 150x205mm 160x225mm 180x240mm 200x280mm 230x310mm 240x340mm 260x360mm 290x375mm 360x425mm Amazon FBA Bags 127x254mm 152x203mm 152x229mm 203x254mm 229x305mm 254x305mm 254x330mm 254x381mm 279x356mm 305x381mm 305x432mm 356x508mm 420x495mm 457x610mm 483x610mm Pouch Packaging Matte Stand Up Bags Foil Stand Up Pouches Zipper Garment Bag Vacuum Bags Food Packaging Strapping Stretch Film Document Enclosed Packaging Tape Box & Carton All Boxes & Cartons By Colour White boxes Brown Boxes Black Boxes Rose Pink Boxes Hot Pink Boxes Blue Boxes Mint Blue Boxes Green Boxes Light Green Boxes Purple Boxes Lavender Boxes Red Boxes Orange Boxes Grey Boxes Indigo Blue Boxes By Size 55x55x80mm 65x65x450mm 65x65x610mm 80x80x100mm 80x80x200mm 80x80x268mm 80x80x430mm 80x80x610mm 80x80x660mm 80x80x800mm 80x80x1200mm 85x85x340mm 100x75x50mm 100x75x75mm 100x90x55mm 100x100x100mm 100x100x200mm 100x100x250mm 100x100x400mm 100x100x610mm 100x100x800mm 100x100x985mm 100x100x1000mm 105x105x115mm 120x120x120mm 120x120x170mm 120x120x220mm 125x100x75mm 128x97x37mm 128x97x60mm 130x115x75mm 130x130x40mm 132x100x75mm 135x135x135mm 140x80x16mm 140x135x175mm 140x140x90mm 140x140x115mm 145x120x50mm 150x100x75mm 150x100x100mm 150x120x90mm 150x150x75mm 150x150x150mm 150x150x600mm 150x150x800mm 152x127x95mm 152x132x16mm 155x115x45mm 165x135x80mm 165x165x165mm 174x128x53mm 175x100x100mm 175x128x75mm 176x135x95mm 178x140x76mm 180x100x16mm 180x100x30mm 180x150x80mm 180x180x36mm 180x180x105mm 180x180x180mm 192x125x16mm 196x148x16mm 200x165x35mm 200x180x50mm 200x200x200mm 205x125x125mm 205x155x130mm 205x175x95mm 210x110x45mm 210x140x60mm 210x205x55mm 215x215x110mm 220x110x80mm 220x110x95mm 220x120x100mm 220x130x95mm 220x145x35mm 220x160x16mm 220x160x77mm 220x160x90mm 220x160x100mm 220x160x120mm 220x170x40mm 220x180x120mm 230x150x50mm 230x150x80mm 230x180x130mm 230x230x230mm 240x110x95mm 240x125x75mm 240x125x95mm 240x140x140mm 240x150x60mm 240x150x80mm 240x190x120mm 241x171x82mm 245x145x45mm 245x148x190mm 250x100x60mm 250x145x139mm 250x150x52mm 250x150x90mm 250x155x100mm 250x158x50mm 250x190x90mm 250x250x250mm 260x260x110mm 265x265x150mm 270x200x55mm 270x160x120mm 270x200x95mm 280x180x80mm 280x192x16mm 280x212x90mm 285x195x75mm 290x110x95mm 292x150x185mm 295x145x55mm 295x200x120mm 300x130x120mm 300x250x250mm 300x300x100mm 300x300x200mm 300x300x300mm 310x230x52mm 310x200x300mm 310x220x16mm 310x220x70mm 310x210x90mm 310x230x105mm 310x225x120mm 310x250x50mm 310x250x150mm 310x310x110mm 310x310x120mm 320x220x50mm 320x240x160mm 320x240x190mm 335x335x16mm 350x250x15mm 350x350x350mm 355x280x100mm 360x250x20mm 360x310x80mm 365x280x95mm 390x280x140mm 400x135x175mm 400x200x180mm 400x280x180mm 400x300x430mm 410x300x80mm 430x307x50mm 430x275x95mm 430x305x140mm 430x305x255mm 430x305x310mm 440x277x168mm 440x320x20mm 455x320x155mm 485x385x265mm 500x210x210mm 500x440x350mm 560x480x400mm Boxes for Prepaid Satchels For Small Prepaid Bags For Medium Prepaid Bags For Large Prepaid Bags For Extra Large Prepaid Bags Top Selling Diecut Boxes Popular Box Collections Regular Cartons Medium & Large Cartons Diecut Boxes Heavy Duty Cartons Superflat Boxes Tuck Front Boxes Self Seal eCommerce Boxes Self Seal Book Wrap Long Tube Boxes Candle Boxes Wine Boxes Envelopes Honeycomb Padded Mailers E0 125x160mm E1 150x225mm E2 215x280mm E4 240x340mm E5 265x380mm E6 300x405mm E7 360x480mm Standard Bubble Envelopes #00 100x180mm #0B 120x180mm #01 160x230mm #DM 172x220mm #02 215x280mm #03 230x330mm #04 235x350mm #05 260x380mm #06 300x400mm #07 360x480mm White Poly Bubble Mailers G0B 120x180mm G01 160x230mm G02 215x280mm G04 235x350mm G05 260x380mm G06 300x400mm G07 360x480mm G09 560x410mm Black Poly Bubble Mailers G00 100x180mm G01 160x230mm G02 215x280mm G04 235x350mm G05 260x380mm G06 300x400mm G07 360x480mm Pink Poly Bubble Mailers #00 100x180mm #01 160x230mm #02 215x280mm #04 235x350mm #05 260x380mm #07 360x480mm Premium Metallic Bubble Mailers #00 130x130mm #01 160x230mm #02 210x290mm #05 260x380mm 110gsm Business Envelopes 300gsm Card Mailers 700gsm Rigid Mailers eFlute Rigid Mailers LP Vinyl Mailers Courier Bags White Poly Mailer #00 160x230mm #01 190x260mm #2W 200x350mm #2S 225x355mm #02 255x330mm #3S 280x380mm #3W 280x420mm #03 310x405mm #4S 340x440mm #04 350x480mm #5S 420x450mm #05 400x500mm #5V 400x550mm #5W 430x545mm #6S 490x550mm #06 500x650mm #07 600x650mm #08 650x750mm #09 750x900mm Black Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm #06 500x650mm #07 600x650mm #08 650x750mm #09 750x900mm Hot Pink Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm #07 600x650mm Rose Pink Poly Mailer #01 190x260mm #02 255x330mm #03 310x405mm #04 350x480mm #5W 430x545mm FBA Poly Jackets 127x254mm 152x203mm 152x229mm 203x254mm 229x305mm 254x305mm 254x330mm 254x381mm 279x356mm 305x381mm 305x432mm 356x508mm 420x594mm 457x610mm 483x610mm Compostable Mailer Labels Thermal Labels By Size 30x20mm 40x20mm 40x30mm 50x30mm 50x40mm 50x50mm 60x30mm 60x40mm 60x50mm 70x30mm 70x40mm 70x50mm 80x40mm 80x60mm 80x80mm 100x20mm 100x27mm 100x50mm 100x60mm 100x70mm 100x80mm 100x100mm 100x120mm 100x150mm 100x175mm 100x187mm 100x200mm A4 Labels for Inkjet & Laser Printers Printer Catridges Direct Thermal Label Printers EcoFriendly Mailing Box Book Wrap Envelope Honeycomb padded mailer Compostable Courier Bags Protective Packaging Packing Material Wholesale Bubble Mailer Bubble Wrap Mailing Box Shipping Carton Mailing Satchel Tape & Stretch Film Contact US General Inquiry Custom Packaging Quote Loyalty page Made in Australia Season Special Customer Reviews Use this bar to show information about your cookie policy. Accept Decline Contact us We'd love to hear from you. Don't hesitate to reach out with any questions, comments, or ideas. First name* Last name * Email * Phone number Your message Price Match Send message Warehouse Pickup - Welcome! Need the packaging urgently for your project? We can get your products ready for pickup usually in 15~30 minutes. Sydney Unit 2, 1 Swaffham Road Minto NSW 2566 Melbourne 21-23 Endeavour Way Braeside VIC 3195 Email Our team is here and ready to help. info@ebpackaging.com.au Call Us Need an answer quick? Tel: 02 8750 5347 Opening Hours Online Customer Service & Warehouse Pickup Monday - Friday: 8:30am – 4pm Saturday & Sunday: closed Top Picks of the Month Exclusive Offers and Save Up to 20% SHOP COLLECTION Invalid Password Enter Why US? Founded in 2009, eBPak has been a leader in the mailing packaging industry, providing high-quality mailing products to fast-growing online businesses. Our commitment to customer satisfaction drives us to develop packaging solutions that meet the unique needs of our clients. By sourcing directly from original factories, we are able to offer superior quality products at competitive prices. We pride ourselves on our fast delivery to Sydney and Melbourne, as well as the convenience of in-person pick-up at our warehouse locations in Braeside (VIC) and Minto (NSW). At eBPak, we stand behind our products with a 100% satisfaction guarantee and the assurance of the best price in the market. Email: info@ebpackaging.com.au Tel: 02 8750 5347 Footer menu Bubble Wrap Bubble Mailers Boxes and Cartons Mailing Satchels Search Terms of Service Help Newsletter Sign up for our Great Deal updates. Your email Subscribe © 2025 eBPak Follow Us © 2025 eBPak Opens in a new window."
    },
    {
      "url": "https://www.linkedin.com/company/melbournemainstreet",
      "text": "Melbourne Main Street | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Melbourne Main Street Civic and Social Organizations Melbourne, Florida 564 followers Melbourne Main Street works to help promote Downtown Melbourne, FL as a destination to shop, dine, play, live & explore. Follow Discover all 9 employees Report this company About us Melbourne Main Street is a 501(c)3 non-profit organization that works to build public and private partnerships to revitalize Historic Downtown Melbourne, Florida. An accredited Main Street part of the National Trust for Historic Preservation, our mission is to fuel economic growth by capitalizing on the community’s assets and paying particular attention to the physical, cultural, and social identity of Downtown Melbourne. Melbourne Main street works to help promote Downtown Melbourne as a destination to eat, shop, and play. We host events throughout the year and help our downtown businesses promote theirs. Website https://downtownmelbourne.com/ External link for Melbourne Main Street Industry Civic and Social Organizations Company size 2-10 employees Headquarters Melbourne, Florida Type Nonprofit Founded 2004 Specialties shopping, dining, special events, historic preservation, downtown, space coast, and community Locations Primary 2004 Vernon Pl Melbourne, Florida 32901, US Get directions Employees at Melbourne Main Street Kimberly Agee Executive Director at Melbourne Main Street Cassandra Hartford CRE Brokerage | Expert Witness | Standup Comedian Kimmie Stone-Caputo Owner at The Edu-Cater, LLC Tara Weigner -- See all employees Updates Melbourne Main Street 564 followers 2w Report this post Great news from our friends and neighbors at Florida Institute of Technology ! https://lnkd.in/eeUCUAyk John Nicklow President at Florida Institute of Technology 4w Florida Tech on the move! https://lnkd.in/eTurabjW Florida Tech plans expansion amid enrollment surge - Orlando Business Journal bizjournals.com 2 Like Comment Share Melbourne Main Street 564 followers 2mo Report this post Thank you Brevard Business News, for highlighting The Flavor Experience - our next big event in Downtown Melbourne! Sponsorships and Tickets are on sale now. https://lnkd.in/dmuFfKHA 3 Like Comment Share Melbourne Main Street 564 followers 4mo Report this post Please share your opposition before the 1pm meeting tomorrow! We need our CRA’s to revitalize our communities. Anne Conroy-Baiter President & CEO, Melbourne Regional Chamber of Florida's Space Coast 4mo Edited Act Now: Call or Email Before 1 PM tomorrow! Florida House Bill 991, targeting Community Redevelopment Agencies (CRAs), will be heard tomorrow at 1:00 PM before the House Commerce Committee. This legislation poses a significant threat to CRAs across the state—including successful and impactful agencies right here in Brevard County—by proposing sweeping measures that would phase out all CRAs. Contact your local House Representative, Commerce Committee Chair James Buchanan ( James.Buchanan@flhouse.gov or 850-717-5074 ), and Ranking Member Chase Tramont ( Chase.Tramont@flhouse.gov or 850-717-5030) to voice your opposition to HB 991 as currently written. Like Comment Share Melbourne Main Street 564 followers 8mo Report this post Cannot wait for Taco Dive to open in Downtown Melbourne!\n\nCheck out this article from Florida Today:\n\nAnticipation is growing! Expected new restaurants from Titusville to Melbourne coming soon https://lnkd.in/evtNqeG3 Anticipation is growing! Expected new restaurants from Titusville to Melbourne coming soon floridatoday.com Like Comment Share Melbourne Main Street 564 followers 9mo Report this post So excited about the reinvestments and expansions that are occurring in Downtown Melbourne! Mel Thomas Space Coast Client & Community Relations Executive at Hedrick Brothers Construction 9mo Last week's City of Melbourne Historical Architecture Review Board (HARB) meeting highlighted some exciting developments for downtown! \nThree restaurants were on the agenda:\n• A new business seeking approval for a vibrant mural\n• An existing restaurant planning renovations and enhancements\n• A long-standing brewery expanding its iconic space \nIt’s wonderful to see positive growth and investment in an area that’s been facing challenges. These projects reflect a bright future for our downtown community! Downtown Melbourne Melbourne Main Street Hell 'n Blazes Brewing Company Ember & Oak Taco Dive Bar 3 Like Comment Share Melbourne Main Street 564 followers 11mo Report this post Congratulations to one of our esteemed and very talented Board Members, Matthew Flores, AIA ! BRPH 10,672 followers 11mo Congratulations to Cristi Moore  ASID IIDA and Matthew Flores, AIA , BRPH's Chief Design and Creative Leaders, for earning LUMA certification as practitioners of human-centered design.\n \nThe discipline of developing solutions in the service of people, LUMA's human-centered design program provides an activities-based approach to creative problem solving that focuses on people above other factors. As LUMA practitioners, Cristi and Matthew can use what they've learned throughout the certification process to grow their teams' human-centered design skills in new ways and foster innovation and collaboration across work groups. #designthinking #lumacertification #humancentereddesign Like Comment Share Melbourne Main Street 564 followers 11mo Report this post We are delighted to announce the 8th Annual Downtown Melbourne Food and Wine Festival, presented by Sysco, set for Saturday, November 9, 2024, from 5:30 to 9:30 PM. This year’s event will once again be held on the picturesque waterfront of Melbourne Avenue and Crane Creek, but with an expanded footprint and offering a fully enclosed, gated space for an enhanced festival experience.\n\nWith a single-inclusive ticket, guests can savor a wide variety of cuisines, wines, craft beers, and spirits. The festival will feature culinary masterpieces from over 20 Space Coast restaurants alongside live entertainment, art displays, three live bands, and more.\n\n“We are proud to have Kelly Ford of Melbourne, Blinds of All Kinds, and MTN, Inc. as our leading sponsors this year. Along with Sysco, these businesses are dedicated to supporting the revitalization of Downtown Melbourne through the 501c3 non-profit organization Melbourne Main Street while celebrating our vibrant culinary community. Don’t miss your chance to indulge in the finest culinary offerings the Space Coast has to offer,” said Kim Agee, Executive Director of Melbourne Main Street. Tickets are on sale now for $125. \n\nSponsorships and vendor spaces are now available. For more information, contact foodandwine@downtownmelbourne.com or visit our website at https://lnkd.in/dqNAQmGs .\n\nProceeds from this year’s festival will support the ongoing revitalization of Downtown Melbourne through transformational projects focused on Economic Vitality, Design, Promotion, and Organization. These efforts aim to ensure Downtown Melbourne remains a premier destination for unique experiences, dining, and shopping. 5 Like Comment Share Join now to see what you are missing Find people you know at Melbourne Main Street Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Reach Commercial Real Estate Real Estate Melbourne, Florida Tunguyi Industries LLC Restaurants Atlanta, Georgia Nelson & Co. Marketing Services Mangrove Title & Legal, PLLC Law Practice Rockledge, Florida Moon River Cafe Restaurants Melbourne, Florida Waterman Real Estate Real Estate Melbourne, Florida Atlas Consultive Professional Training and Coaching Miami, Florida RW Events Events Services Winter Springs, Florida Robert G. Campbell & Associates, L.P. Civil Engineering Argus Self Storage Advisors Real Estate Aurora, Colorado Show more similar pages Show fewer similar pages LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Melbourne Main Street Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://downtownmelbourne.com/about/leadership/",
      "text": "Melbourne Main Street Leadership | Historic Downtown Melbourne, Florida Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Leadership 2025-02-03T14:59:22-05:00 LEADERSHIP IN DOWNTOWN MELBOURNE Leadership and decision-making for Downtown Melbourne governs as Melbourne Main Street , a 501(c)(3) non-profit organization dedicated to revitalizing and enhancing the economic growth of the district. Get to know the Melbourne Main Street Board of Directors and committed team. MELBOURNE MAIN STREET BOARD OF DIRECTORS OFFICERS Cassandra Hartford BOARD CHAIR, 2024-PRESENT, DIRECTOR, 2021-PRESENT BIO Cassandra Hartford is a distinguished professional with years of experience in real estate and client relations. Currently, Cassandra occupies many roles that allow her to utilize her exceptional skill set to its fullest potential. As a Real Estate Advisor, Cassandra aims to be a beacon of knowledge and guidance for all of her clients. Cassandra specializes in a variety of asset classes; anything from residential real estate, to commercial real estate, investment portfolios, and development. She is well-known for her dedication and unwavering commitment to each individual. Over the years, Cassandra has developed an ever-expanding network and continues to build lasting relationships with many loyal clients. As a passionate professional, Cassandra takes pride in staying up-to-date with current market trends. Her natural interest in real estate and innate desire to help others can be directly attributed to her stellar reputation and track record. In her free time, Cassandra loves spending time with her family, tending to her Koi Fish, or catching a local music or comedy show. She also enjoys Improv Acting and giving back to her community. Mike Hill VICE-CHAIR 2025-PRESENT, DIRECTOR, 2024-PRESENT BIO Michael Hill is a small business owner, he and his wife co-manage Tuckaway Shores Resort in Indialantic, FL. He truly understands how important volunteering and community involvement is to the local community. That is evidenced by his active participation in local government and engagement in multiple organizations including Melbourne Main Street and the Melbourne Chamber of Commerce; organizations that promote and make a measurable impact to the local economy. His passion is contributing his time and efforts to the continued growth and revitalization of our local community, including historic downtown Melbourne. Michael’s career began in the United States Army where he served for over 20 years with distinction and retired in 2004. He held numerous positions during his career from an Airborne Artilleryman to the Director of Training Development where he was responsible for the daily operations and management of the US Army Recruiting School. During his career he was stationed at Ft. Bragg, NC, Vicenza, Italy, Ft. Jackson, SC, and multiple assignments with the US Army Recruiting Command in the Northeast. Upon retirement from the US Army, Michael held multiple positions with both non-profit and for-profit companies in sales and operations roles. In those organizations he held local, regional, and V-level roles providing him exceptional experience that he leveraged to grow those organizations. Michael loves spending time with his wife Pam, daughters Brandi and Kristi and his grandchildren Carolina and Caleb. He is very active and enjoys outdoor activities such as paddleboarding, biking, one-wheeling, downhill skiing, and paramotoring. Lory Milton TREASURER 2024-PRESENT, DIRECTOR, 2023-PRESENT BIO Lory Milton is the current Vice President, Commercial Loan Officer at Marine Bank and Trust. She works closely with many small–business owners in the region building relationships to help business owners achieve their dreams. Lory is a University of Central Florida graduate with a Bachelor’s in Criminal Justice, and a longtime resident of the Space Coast. Growing up in Melbourne, Lory has enjoyed watching and being a part of the Space Coast’s growth and is excited for what the future holds for Downtown Melbourne. Lory serves as PTO Vice President at her son’s school, is a Board Member of The Gift Angel Society, and enjoys volunteering with the Brevard Children’s Hunger Project. Jordan Williams SECRETARY 2024-PRESENT, DIRECTOR, 2023-PRESENT BIO Jordan Williams owns Downtown Divas in Downtown Melbourne as well as Tangled Rose, in Downtown Melbourne and Cocoa Village.  She has a special affinity for downtowns and will be bringing her fresh perspective and vision for social media marketing, content development, and event planning to the Board of Directors. Jordan is looking forward to marketing DTMB as a destination for shopping, playing, and exploring while making deeper connections with the other businesses in Downtown Melbourne. DIRECTORS Kat Butler DIRECTOR, 2024-PRESENT BIO Kat Butler, North American Properties David Cable DIRECTOR, 2020-PRESENT BIO David Cable is a multi-million dollar, full-service, realtor with RE/MAX Elite. Working with his team of trusted local business partners, he’s able to successfully fulfill his clients’ every need, from start to finish and beyond. In addition to supporting Brevard public schools,  he is involved in several charities that are largely focused on funding women, children and animals. He is also actively involved in the community as an Executive Board member of the Melbourne Chamber of Commerce and an active member of the Palm Bay Chamber of Commerce. David and his wife, Wendy, live beachside in Indialantic. Bernard (Bernie) Clevens DIRECTOR, 2025-PRESENT BIO Bernard S. Clevens is the Founder and Principal of Thematic Capital Group (“TCG”), a real estate investment firm in Melbourne, Florida. As of December 2024, the company manages approximately $28M in assets. The company focuses on value-add industrial real estate investments in the southeast. Raised in Melbourne, Florida, Mr. Clevens believes that Downtown Melbourne is well positioned to benefit from a great location, a storied history and charming downtown streets. He joined the Board to drive further economic growth to Downtown Melbourne. The TCG portfolio includes a property in Downtown Melbourne, so his firm has a direct interest in the success of the local business community. He and his wife are both from Brevard County and are proud to raise their two children in Melbourne. Mr. Clevens earned his bachelor’s degree from Bowdoin College and holds an MBA from Emory University’s Goizueta Business School. Matthew Flores DIRECTOR, 2024-PRESENT BIO Matthew Flores, BRPH Don Hemmenway DIRECTOR, 2024-PRESENT BIO Don Hemmenway retired as a Senior Engineering Manager from Renesas Electronics in Palm Bay (formerly Harris Semiconductor) after a 40-year career in microelectronics design and manufacturing.  He was awarded 25 US and European patents, published numerous technical papers, and directly contributed to the implementation of multiple generations of tactical and strategic national defense programs. Don and his wife, Cathy, raised four children in Brevard County and are extremely proud of their many accomplishments (including six grandchildren!).  In 2019 they moved to a permanent residence on Crane Creek in Downtown Melbourne. Since retirement in 2023, they enjoy daily walks down New Haven Avenue to the harbor, as well as partaking in the diverse dining, shopping, and entertainment opportunities downtown. Don is passionate about applying his time and talents to improve both Downtown Melbourne and his local Crane Creek Landing community.  He is particularly inspired by the rich history of Downtown Melbourne and would like to improve how that story is delivered to enhance the visitor experience. Corey Runte IMMEDIATE PAST CHAIR, 2023; DIRECTOR, 2019-PRESENT BIO Corey serves as Vice President at Certified General Contractors, Inc., located in Historic Downtown Melbourne, bringing a wealth of experience and a deep commitment to community to the Board. A resident of Melbourne Beach with his wife, Krista, and their three young sons, Corey actively engages in local initiatives. He serves as a member of the Economic Development Commission of the Space Coast and has previously chaired the boards of both Melbourne Main Street (MMS) and the City of Melbourne’s Historic & Architectural Review Board. His involvement in Main Street organizations spans over a decade, with a dedicated eight-year tenure at MMS. Corey is passionate about revitalizing Downtown Melbourne and offers the Board a unique and energetic perspective informed by his professional experience in construction and his long-standing commitment to community development. Toni McGovern DIRECTOR, 2025-PRESENT BIO Toni McGovern is the Director of Sales of Hotel Melby with an impressive 15-year tenure in the dynamic world of hospitality management. With a vibrant energy and an unwavering passion for creating memorable experiences, Toni has significantly increased Occupancy and Revenue at Hotel Melby since taking on her role in 2021. Having been enchanted by the charm of Melbourne since her first visit in the 2000s, she finally made Brevard County her home in 2016. This city, known for its vibrant arts scene and culinary delights, has captured her heart in a way that fuels her ambition: to position Downtown Melbourne as the ultimate destination for curious travelers seeking unique adventures. Toni is deeply committed to her community, embodying the spirit of compassion by supporting local initiatives and advocating for rescue animals. When she’s not busy promoting Downtown Melbourne as a travel hotspot, you’ll likely find her exploring new corners of the city with her rescue dachshund Allie Mae or planning her next getaway, always with the aim of discovering and sharing hidden gems. Erin Trauger DIRECTOR, 2022-PRESENT BIO Erin is President of Trauger Consulting Engineers, Inc a Melbourne-based Civil Engineering design firm.  She has nearly 20 years of local experience in Civil Engineering including due diligence, conceptual efforts, design/permitting, and construction administration of development. Erin and her husband, Jim Trauger, work together at their consulting firm located in Downtown Melbourne.  Their company project list includes commercial facilities, residential communities, industrial developments, and institutional improvements but additionally, Erin works on redevelopment projects for new updates and new life in Melbourne and other existing communities.  Erin views these redevelopment projects as wildly beneficial for developed areas and enjoys being part of the community improvements.  In the past, she served on the City of Melbourne Planning and Zoning board for six years and is excited to now be a small part of a great team that includes the Melbourne Main Street Board.  Her hopes are to serve and help further successes in an already thriving Downtown Melbourne. Jason Williams DIRECTOR, 2021-PRESENT BIO Jason Williams is the Chief Executive Officer and a Co-Founder of Cromulence LLC. Cromulence is a growing high technology business with primary offices located in Downtown Melbourne, Florida that specializes in cybersecurity capabilities and services for national defense. Jason, a Melbourne native, is inspired by the potential to vitalize and enhance the Downtown Melbourne area and attract high tech industry and technology startups. He has seen firsthand the growth of Melbourne and the Space Coast as a hub for high tech industry, aerospace, and defense and wants to see the downtown area lead as a mixed-use area for employers, restaurants, and retail businesses. Cindy Dittmer 2025-PRESENT, EX-OFFICIO BIO Kim Agee EXECUTIVE DIRECTOR, 2020-PRESENT, EX-OFFICIO BIO Kim Agee is a highly skilled community and economic development strategist and the current Executive Director of Melbourne Main Street. She is an experienced connector of ideas and people and is passionate about developing relationships within the business community that achieve success. Kim is a Past Board Chair of the Melbourne Regional Chamber of Commerce and currently serves on the Board of Directors and Governance Committee, a member of CivMil, LEAD Brevard, the Junior League of South Brevard, and the City of Melbourne’s Homeless Stakeholders committee. Born and raised in Melbourne with deep family ties, Agee’s passion is her community. She loves putting her energy, dedication, and experience to work building Melbourne Main Street’s mission to strengthen the businesses in Downtown Melbourne. When she’s not working, Kim can be found boating on the Intracoastal, traveling, hugging her family and puppy, cheering on the USF Bulls, and hosting some of the best events in town. TEAM Kim Agee EXECUTIVE DIRECTOR, 2020-PRESENT BIO Kim Agee is a highly skilled community and economic development strategist and the current Executive Director of Melbourne Main Street. She is an experienced connector of ideas and people and is passionate about developing relationships within the business community that achieve success. Kim is a Past Board Chair of the Melbourne Regional Chamber of Commerce and currently serves on the Board of Directors and Governance Committee, a member of CivMil, LEAD Brevard, the Junior League of South Brevard, and the City of Melbourne’s Homeless Stakeholders committee. Born and raised in Melbourne with deep family ties, Agee’s passion is her community. She loves putting her energy, dedication, and experience to work building Melbourne Main Street’s mission to strengthen the businesses in Downtown Melbourne. When she’s not working, Kim can be found boating on the Intracoastal, traveling, hugging her family and puppy, cheering on the USF Bulls, and hosting some of the best events in town. Tara Weigner INTERIM MANAGER, EVENTS AND MARKETING BIO Tara Weigner has called Melbourne home for nearly six years and has a deep love for Downtown. As a former business owner in the district, she understands the importance of a thriving local community and is passionate about its continued growth. Tara is a proud mom of three and she enjoys being part of the dynamic spirit that makes Downtown Melbourne special. She looks forward to helping the area flourish and supporting the businesses that make it unique. CONTINUE EXPLORING ABOUT DTMB Located along the Indian River Lagoon and Crane Creek waterfronts, DTMB is an unforgettable destination for locals and visitors alike. Learn More MAIN STREET Melbourne Main Street is a 501(c)(3) non-profit organization that works to cultivate partnerships to revitalize Historic Downtown Melbourne. Learn More HISTORY Downtown Melbourne is one of the most charming parts of Melbourne, with a history that dates back to the 1800s. Explore History EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://www.yahoo.com/news/man-20-shot-death-during-143155689.html",
      "text": "Palm Bay football standout, 19, shot to death in Downtown Melbourne argument Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Top Stories: Charlie Kirk fatally shot Who was Charlie Kirk? Ellison surpasses Musk Pandemic pups Trump on N.C. train stabbing Harris on Biden's decision to run Trump barred from firing Lisa Cook Trump: Epstein note a 'dead issue' 2 Americans fly to Tunisia by mistake 'Phillies Karen' viral drama Florida Today Palm Bay football standout, 19, shot to death in Downtown Melbourne argument J.D. Gallop, Florida Today Sun, May 11, 2025 at 2:31 PM UTC 2 min read MELBOURNE — A 19-year-old college football player visiting home for Mother's Day weekend was shot to death early May 11 in Downtown Melbourne following an argument outside a popular nightspot, police said. Melbourne police named the dead man as Nathaniel Bernard Jennings of Palm Bay, who played football for the University of Northwestern in Roseville, Minn. He had signed with the college last year out of Heritage High School. Nathaniel Bernard Jennings, as he appears on the University of Northwestern football roster. The suspected shooter, Stephan Dieujuste, 24, also of Palm Bay, who briefly played basketball as a point guard for Eastern Florida State College, was first questioned by detectives about the shooting after making a claim of self-defense, Melbourne police say. Dieujuste was later charged with manslaughter and taken into custody at the Brevard County Jail Complex in Sharpes. He will go before a judge Monday on a bond hearing. Advertisement Advertisement Advertisement Advertisement It was not known how the two men — who graduated years apart from Bayside High School and Heritage High School in Palm Bay — knew each other. Melbourne police wrap crime scene tape outside the Neon Rodeo at 829 E. New Haven Ave. in Downtown Melbourne on May 11 after a fatal shooting near the bar. The downtown area, filled with restaurants and nightclubs, was open at the time of the shooting. Police remained at the site overnight as detectives worked to sort through the statements of the shooter and other witnesses. The shooting happened about 1:51 a.m. May 11 in the area of Vernon Place and New Haven Avenue. The incident was also captured on newly installed downtown surveillance cameras several feet away, city officials said. Officers responded to the scene after receiving reports of gunfire near the recently refurbished Neon Rodeo bar and other nightspots. Officers found Jennings unresponsive. He was later pronounced dead. Advertisement Advertisement Advertisement Advertisement “It is an active investigation,” said Lt. Bradley Blount, a spokesperson for the Melbourne Police Department. The state attorney's office, contacted by detectives, provided guidance on the self-defense claims made in the case. The site where the shooting took place was cleared of crime scene tape later May 11. A crimson stain remained on the sidewalk where Jennings was found along the western wall of the Neon Rodeo bar. Stephan Dieujuste Police were talking with potential witnesses in the area and contacting Jennings' family in Palm Bay. It was not immediately known what caused the conflict between the two men. “It’s an unfortunate situation,” said Melbourne Mayor Paul Alfrey. Advertisement Advertisement Advertisement Advertisement Jennings had joined nearly 10 other football players in February 2024 for National Signing Day at Heritage High, in which young athletes sign letters of intent to go to certain colleges or universities to play on the gridiron. Jennings, a defensive lineman, signed with the University of Northwestern and was listed as a freshman player. At left, Nathaniel Jennings of Heritage High School signs with the University of Northwestern to play football during National Signing Day on Feb. 7, 2024. Jennings, 19, was shot to death early on Mother's Day in downtown Melbourne, police say. The shooting is Melbourne's first reported homicide of the year. It is also the second homicide to take place in Downtown Melbourne in two years. J.D. Gallop is a criminal justice/breaking news reporter at FLORIDA TODAY. Contact Gallop at 321-917-4641 or jgallop@floridatoday.com. X, or Twitter: @JDGallop This article originally appeared on Florida Today: Palm Bay football standout visiting home slain in Downtown Melbourne Advertisement About Our Ads Advertisement Advertisement Advertisement Yahoo! US Politics 2024 Election World Health Science The 360 Contact Us Originals Help Share Your Feedback About Us About Our Ads Site Map Follow us on Download our app © 2025 Yahoo. All rights reserved."
    },
    {
      "url": "https://downtownmelbourne.com/business-ties-build-strong-downtown-melbourne/",
      "text": "Business Ties Build Strong Downtown Melbourne - Downtown Melbourne Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Home » Business Ties Build Strong Downtown Melbourne Home » About » News & Stories » Business Ties Build Strong Downtown Melbourne Business Ties Build Strong Downtown Melbourne by Kim Agee Executive Director, Melbourne Main Street November 15, 2021 Melbourne Main Street It’s no secret that Downtown Melbourne is in the midst of exciting, big changes and a new injection of energy as we emerge from the pandemic. If you live in Brevard County, how could you miss it? Pandemic aside, we were already watching Downtown transition from a protected harbor with a cozy history into a vibrant, next-generation business and entertainment hub with a youthful future. From our standpoint at Melbourne Main Street, it’s rewarding to see that journey continue in a way that does not abandon one for the other. But like most downtown areas across the country, Melbourne has much to offer while still facing great challenges. Thankfully, our downtown continues to thrive because it is loved and supported by the local community – a community that fought to not only protect local jobs and businesses early in the pandemic, but to also keep focus on the ongoing transformation that will make even our great grandchildren proud. Melbourne may date back to the late 1800’s, but Downtown was not actually designated as a distinct redevelopment area by the City of Melbourne until 1982. In 2002, it became a Main Street America™ accredited program, and part of the Florida Main Street community. The Melbourne Main Street organization, existing in its current form as a result of 17 years of board members, directors, staff, and volunteers, has been primarily focused on promoting the area’s offerings as well as laying the groundwork for growth. Having that structure and experience in place during the pandemic restrictions and now during a huge shift in consumer behavior, has been instrumental for keeping things on course. Melbourne Main Street has been, and continues to be, a trusted source of information on a number of important issues for property and business owners, as well as potential investors. Working in tandem with the downtown community to help weather economic storms, apply for grants, brainstorm marketing ideas, find new tenants, and navigate regulatory requirements are just some of the ways our organization serves. As a whole, strong connections and partnerships between Downtown Melbourne and the City of Melbourne, as well as other public entities, remain key to successful recovery and growth. We must always maintain a “seat at the table” with policy makers because what our area provides to community-wide quality of life, job availability, tax revenue, and destination tourism, is irreplaceable. Many great things are happening in Downtown. Some are related to the pandemic and a change in consumer behavior, but most are the result of years of planning and effort by the local community. Good things are yet to come. Kim Agee, Melbourne Main Street Kim Agee is a skilled community and economic development strategist and executive director of Melbourne Main Street. She drives projects and individuals to success through professional savvy and a genuine passion for the local business community. Experienced in leadership, relationship and project management, and government affairs, Kim is often the “go-to” person to activate complicated agendas and achieve organizational goals. View Article Source » Related News Categories: Community , July 22, 2023 Melbourne Main Street receives Three Awards a … more Categories: Events , June 22, 2023 New Location for 2023 DTMB Food and Wine Fest … more Categories: Community , May 17, 2023 Melbourne Main Street Welcomes New Board Memb … more Categories: Economic Development , February 2, 2022 The Road to Economic Development Runs Through … more Categories: Community , November 15, 2021 Business Ties Build Strong Downtown Melbourne more Categories: Events , November 1, 2021 Space Coast Daily Interviews Kim Agee About F … more Categories: Events , October 14, 2021 Melbourne Main Street to Host Downtown Melbou … more Categories: Events , October 12, 2021 Melbourne Regional Chamber Interviews Kim Age … more Categories: Construction , July 1, 2021 Brightline Construction to Shut Down Melbourn … more Categories: Community , January 22, 2021 Downtown Melbourne Thrives Pandemic, Or No more Categories: Community , January 15, 2021 321 Lift Off Interviews Kim Agee more KEEP EXPLORING! MAIN STREET Melbourne Main Street is a 501(c)(3) non-profit organization that works to cultivate partnerships to revitalize Historic Downtown Melbourne. Learn More LEADERSHIP From the Melbourne Main Street Board of Directors to the Downtown Melbourne team, get to know our leadership. MEET LEADERSHIP HISTORY Downtown Melbourne is one of the most charming parts of Melbourne, with a history that dates back to the 1800s. Explore History WORK Many space, defense, and technology companies call Downtown Melbourne home, allowing easy access to premium lunch spots and waterfront parks. WORK IN DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://downtownmelbourne.com/events/",
      "text": "Events in Historic Downtown Melbourne Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Events 2025-09-04T14:29:57-04:00 ATTEND EVENTS IN DOWNTOWN MELBOURNE Downtown Melbourne is where culture and community meet. Home to a variety of food and music festivals, weekly farmers markets, seasonal street parties, and holiday affairs, look forward to the spectacular events on the calendar in Downtown Melbourne. View Melbourne Main Street Events View Additional Upcoming Events MELBOURNE MAIN STREET EVENTS You won’t want to miss any of the high quality events hosted throughout the year by Melbourne Main Street . Click on an event logo to see what they’re all about, then save the date and purchase tickets. Saturday, February 8, 2025 Saturday, April 5, 2025 Saturday, April 12, 2025 Saturday, July 12, 2025 Friday, August 15, 2025 Saturday, October 25, 2025 Each Saturday evening between Thanksgiving and Christmas Food & Wine Festival UPCOMING EVENTS View our event calendar to discover fun and exciting events on the horizon in Downtown Melbourne (…then rally your family and friends). Farmer’s Market at Riverview Park September 13, 2025 @ 10:00 am - 2:00 pm Green Gables Historic Home Open House September 13, 2025 @ 10:00 am - 2:00 pm Melbourne Municipal Band Concert: Sway With U … September 17, 2025 @ 7:00 pm - 9:00 pm Melbourne Municipal Band Concert: Sway With U … September 18, 2025 @ 7:00 pm - 9:00 pm Melbourne Municipal Band Concert: Sway With U … September 18, 2025 @ 7:00 pm - 9:00 pm Pirate Social September 19, 2025 @ 4:00 pm - 11:30 pm Green Gables Harvest Festival September 20, 2025 @ 9:00 am - 3:00 pm Farmer’s Market at Riverview Park September 20, 2025 @ 10:00 am - 2:00 pm 1 2 Next View Past Events Share Your Events If you’re a business in Downtown Melbourne and are planning a public event, please tell us about it! Submit Event SHOP From boutiques and antiques to handcrafted skincare and specialty cigars, you can find them here. SHOP IN DTMB DINE With over 40 craft restaurants and bars, indulgence is expected in Downtown Melbourne. DINE IN DTMB PLAY Rent a kayak, take in live theater or rock out in one of many local music venues. Downtown Melbourne is a playground for all ages. PLAY IN DTMB EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://www.floridatoday.com/story/news/local/2022/05/30/chumleys-depot-founder-dies-florida-tech-downtown-melbourne-legacy/9804154002/",
      "text": "Chumley's Depot founder dies Florida Tech downtown Melbourne legacy Prepare yourself for the opening of Brevard's first Trader Joe's. Here are some of the grocer's most popular products. News Space Sports Opinions Restaurants Advertise Obituaries eNewspaper Legals LOCAL Chumley's Depot founder dies, leaving legacy at Florida Tech and in downtown Melbourne Rick Neale Florida Today Support local journalism. Unlock unlimited digital access to floridatoday.com Click here and subscribe today. Mike \"Chumley\" Gaines and Marcus Darnell met in 1995 while they were attending the Florida Institute of Technology. Both spent their college years hanging out at long-defunct Melbourne watering holes like Panther Pit, College Campus Café and Big Al's Lounge. Gaines earned a bachelor's degree in aviation management with flight. But instead of working at airports, his local legacy took flight when he founded Chumley's — Florida Tech's off-campus tavern — in 1999 at University Plaza on Babcock Street. The bar-restaurant moved to downtown Melbourne in 2014 as Chumley's Depot. Darnell, co-owner and manager, credits his friend with continuing to cultivate a judgment-free atmosphere after the move — \"we don't care if the jukebox is playing Drake or Johnny Cash, as long as the music's playing.” Gaines died unexpectedly on May 10 at his Melbourne home. He was 50. His namesake bar closed for a week while its small staff grieved. More: From Mediterranean food to a speakeasy, here are 5 new restaurants to try in downtown Melbourne More: 7 Brew Coffee plans to open 165 Florida drive-thrus, with first in downtown Melbourne “I want the legacy to continue. There's no chance that I'm changing the name on that wall,\" Darnell said, sitting at a tavern table and gesturing toward the Chumley's Depot exterior sign. \"This will be Chumley’s forever. And what he started, and what we worked together for, I will continue,\" Darnell said. “Twenty-five years of friendship, man. And way too many stories — we’d be here a week,\" he said. A celebration of life will take place from 1 to 8 p.m. June 19 at Broken Barrel Tavern in Palm Bay. Billy Chapman, The Sawgrass Band and Positive Chaos will perform, Darnell said. The original Chumley's opened its doors on June 19, 1999, at 3150 Babcock St. Two years later, Florida Tech officials opened the Clemente Center next door, directly behind the plaza. \"Michael 'Chumley' Gaines was a true Florida Tech Panther who became a local business and bar owner catering to students and alumni alike,\" Fin Bonset, president of the Florida Tech Alumni Association, said in an email. \"He was a second father, brother and family member to many of our Panther family and had a heart of gold. He helped many alumni and community members in providing a safe haven and employment opportunities at his bar/restaurant, and he always provided a shoulder to lean on simply because he was a true, genuine humanitarian who cared about everyone he ever met,\" Bonset said. \"He will be missed as a friend, fervent community influencer, and exemplary Florida Tech alumnus,\" he said. More: 'I want to make my bottle proud': Message in a bottle helps Cuban singer chase American dream More: Florida Tech aviation grad to fly aboard Navy A-18G Growler during Space Coast Air Show Florida Tech Magazine featured Chumley's Depot in its fall 2019 cover story showcasing Melbourne-area alumni-owned bars. The list also included Hemingway's Tavern, Broken Barrel Tavern, Meg O'Malley's Restaurant and Irish Pub, Long Doggers and the now-defunct Lost Shirt Brewing Co. and Quarters Brewing Co. A native of Newburyport, Massachusetts, Gaines was a lifelong New England Patriots and Boston Red Sox fan — and his sports memorabilia remains on display on the tavern walls. So do images of Gaines pouring pints at Guinness Storehouse in Dublin, Ireland; standing alongside patrons and employees in a poster-sized 2013 photo from the last karaoke night at the Babcock Street location; and posing with various victorious darts league teams. Chaunette Small was introduced to Gaines through mutual friends at the bar in 2006, shortly after she moved from Gainesville to Palm Bay to pursue a master's degree in industrial organizational psychology at Florida Tech. They dated for about five years, then remained close friends afterward. She recalled one of his hobbies: writing stories that he hoped to develop into movie scripts. \"He was an amazing 'Uncle Chum' that would give his extended-family nieces and nephews huge tosses into the air, and catch them and cover them with cuddles,\" Small said. \"You could find him enjoying a lobster roll or a good game of trivia while throwing in his favorite words like 'facetious,' 'plethora,' and 'copious,' \" she said. Darnell earned a bachelor's degree in aerospace engineering from Florida Tech. But like Gaines, he was destined to operate the popular off-campus tavern. “The history of Chumley's: It all came from Chumley. He was working at the Mighty Mushroom, and he told us one day, ‘Yeah, I'm just going to buy a bar,’ \" Darnell recalled. \"We all thought he was crazy. And then we didn't see him for like a year. And then in June of '99 after Gargoyles shut down, he bought the place and put 'Chumley's' up on the wall,\" he said. Darnell started working at Chumley's as a manager the following month, in July 1999. Chumley's operated at University Plaza for the next 14 years until Florida Tech officials bought the plaza and did not renew the tavern's lease, Darnell said. By that point, he said, \"we were a Florida Tech bar when we started — but so many of our friends had graduated, we had become a locals bar.\" Chumley's moved downtown into a building near the railroad tracks on Depot Drive, between New Haven and Strawbridge avenues. Since 2000, the building had been occupied by Toy Depot, Olympia Café, Depot Café and Billy Joe's Restaurant. Darnell obtained an ownership stake in Chumley's Depot, and they spent 10 months gutting and remodeling the aging building. The tavern reopened in January 2014. \"We became a successful establishment in downtown Melbourne. From a cave-like little bar in a strip mall next to Florida Tech that nobody thought would last six months,\" Darnell said. “We are a merry band of misfits. And if there was any bar that felt like it was home, it was this one, whether it was the old location to this location. And it's where we come and we feel safe. It's just a family. Many of our friends who are married met here,” he said. \"Chumley was a large man with a larger heart. He would give you the shirt off his back.\" 89-year-old burlesque dancer on 'America's Got Talent': It's a yes from Cowell, Klum, Mandel, Vergara L3Harris, partner company land special operations military plane contract worth up to $3B Florida set to host two back-to-back ULA and SpaceX launches on same day this week Former Brevard County Attorney Knox violated the county's lobbying rules he signed off on Charlie Crist visits Brevard for meet-and-greet, blasts 'Rotten Ron' in campaign swing Rick Neale is the South Brevard Watchdog Reporter at FLORIDA TODAY (for more of his stories, click here .) Contact Neale at 321-242-3638 or rneale@floridatoday.com . Twitter: @RickNeale1 Support local journalism. Subscribe today. About Us Corrections Staff Directory Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.floridatoday.com. All rights reserved."
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/",
      "text": "DTMB Food and Wine Festival Skip to content For details on culinary exhibiting and sponsorship opportunities, please email events@downtownmelbourne .com Downtown Melbourne Food and Wine Festival Home Chris Fynan 2025-09-04T13:15:33-04:00 In order to accommodate construction projects in Downtown Melbourne in November, the 2025 Food and Wine Festival will be rescheduled for early 2026. We’ll share the date and ticket on-sale information as soon as possible. Thank you for your patience and support. We can’t wait to celebrate with you soon! EXHIBITORS, VENDORS & SPONSORS For details on exhibiting (food, wine, spirits & beer), or sponsorship opportunities for the 2026 festival, please email events@downtownmelbourne.com Close product quick view × MELBOURNE MAIN STREET A non-profit 501(c)3 organization 2004 Vernon Place Melbourne, FL 32901 321-724-1741 foodandwine@downtownmelbourne.com Follow Us Visit Downtown Melbourne © Copyright 2024 Downtown Melbourne | Melbourne Main Street Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/arts-culture/downtown-melbourne/",
      "text": "Downtown Melbourne - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Downtown Melbourne Add to Wishlist Downtown Melbourne Historic Downtown Melbourne is a vibrant shopping and entertainment destination on Florida’s Space Coast. Home to unique stores like Downtown Divas, The Flop Shop, The Irish Shop, Indian River Soap, and many more, you’ll be able to find one-of-a-kind items and gifts to take home with you. And while you’re down there, enjoy a meal at one of the 20 places to choose from. Monthly events are hosted to foster a sense of community and culture and are usually free to the general public. Add to Trip Visit Website Direction New Haven Avenue Melbourne, FL 32901 Contact 321-724-1741 Discover More nearMelbourne and the Beaches All Hotels Restaurants Events Add to Wishlist Drews Brews and Grille Melbourne and the Beaches We have just update our menu and want to promote our “Burger of the Month” along with our new menu that includes TONS of homemade foodie items! We are now hosting NFL Game nights and have special pricing and happy offerings to go along with that. Add to Trip Add to Wishlist Longboards Oceanfront Grille Melbourne and the Beaches Celebrate the tastes of the season with every ocean breeze and sizzling sunset! This fall, Longboards Oceanfront Grille invites food lovers to indulge in our newest dinner menu—and earn a complimentary treat to share. When you purchase two entrees from the new dinner lineup, choose from a free appetizer or… Add to Trip Add to Wishlist Hell ’n Blazes Brewing Company Melbourne and the Beaches Hell ’n Blazes is known for our smoked meats, juicy burgers, and elevated entrées—plus award-winning craft brews that earned us Best Medium Brewery in Florida. Our Ringer Burger, a fan-favorite 75/25 steak burger $21, is a must-try, and you’ll want to pair it with our decadent Brownie Skillet (shareable for… Add to Trip Add to Wishlist Jacqueline’s Bakery Melbourne and the Beaches Jacqueline’s Bakery brings the flavors of France to Melbourne, FL. Founded by Jacqueline & Christophe, Paris-trained chefs, the bakery is known for authentic croissants, éclairs, macarons, quiches, and baguette sandwiches. With locations in Historic Downtown Melbourne (906 E New Haven Ave, 32901 – (7:30am-8:30pm) & Suntree (6977 N. Wickham Rd,… Add to Trip Add to Wishlist Bistro Melbourne and the Beaches Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera Melbourne and the Beaches A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your… Add to Trip Add to Wishlist Rustic (Hilton Melbourne) Melbourne and the Beaches Celebrate the flavors of fall with a $49 prix fixe feast. Begin with comforting bites. For the main event, enjoy hearty seasonal dishes that balance savory richness with autumn’s warm, comforting notes. End on a sweet note with decadent chocolate cake or warm apple crumb cobbler à la mode. Each… Add to Trip Add to Wishlist Meg O’Malley’s Irish Pub & Restaurant Melbourne and the Beaches Lovely Beginning: SCOTCH EGG – Soft-boiled egg wrapped in ground sausage, breaded, fried, served with Dubliner cheese, pickled red onions, and Irish mustard horseradish sauce. Main: SMOKED SALMON & DUMPLINGS – Tender potato dumplings tossed in an Irish smoked salmon, rasher, bacon, and spinach cream sauce. Topped with imported parmesan… Add to Trip Add to Wishlist Osuki Sushi Melbourne and the Beaches Mon-Fri Lunch: $22.95 Dinner and Saturday,Sunday: $31.95 For All You Can Eat! Add to Trip Add to Wishlist The Mansion Melbourne and the Beaches At The Mansion, guests are invited to enjoy an unforgettable dining experience in one of Melbourne’s most unique and historic venues. For a limited time, we are offering a prix fixe menu that showcases some of our most popular items. Begin with your choice of a Mansion classic  Tavern Salad or… Add to Trip Add to Wishlist Hemingway’s Tavern Melbourne and the Beaches 3 for $50. No substitutions. Smoked Tavern Wings: Chicken wings seasoned, smoked, fried crispy, and tossed in your choice of guava BBQ, hot honey, buffalo jerk, Tuscan parmesan, or pineapple cilantro chili. Snapper Hemingway: Pan-fried panko-crusted snapper fillet topped with lump crab meat beurre blanc and served with rice caribe… Add to Trip Add to Wishlist Cedars Cafe Melbourne and the Beaches At Cedars Cafe, you can always expect the unexpected. Stop in this fall for a revolving Prix Fixe menu prepared from scratch with fresh, seasonal, local foods. Enjoy a new, artful 3-course menu for $45 that changes bi-weekly. Check out our Facebook page for updated menu offerings! Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist The Glitz & Glam of Art Melbourne and the Beaches The Glitz & Glam of Art is a new glitter paint studio located in Melbourne Florida off US1. We offer glitter canvas painting, wine glass painting workshops & rock painting. These services are offered to families & customers of all ages. No Experience necessary as there will be a guided… Add to Trip Add to Wishlist Aves’ Place Melbourne and the Beaches Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Name This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://melbournecityfc.com.au/about/contact-us/",
      "text": "Contact Us - Melbourne City Loading... News Videos Teams Mens Matches Ladder Squad Womens Matches Ladder Squad Youth Youth Team – VPL1 Seniors Development Squad – VPL1 U23’s Under 17’s Under 16’s Under 15’s Under 14’s Football School Our Partners Contact Us / More Info Contact Us Education Melbourne City Institute of Sport & Business About About Us Player Sponsorship Our Partners Privacy Policy Competitions Promotion and Competition Winners Fan Representative Group Safeguarding Careers at Melbourne City Volunteer at City Community Macca’s® City Clubs In School Program – City Futures School Immersion Days City in the Community GOAL! Young Leaders Creating Respectful Relationships Twinning project Healthy Goals Powerchair Football Donations Match Day AAMI Parking City Square Parking Members FAQ’s Public Transport Spectator Code of Behaviour A-Leagues Terms of Admission AAMI Park Conditions of Entry News Videos Teams Mens Matches Ladder Squad Womens Matches Ladder Squad Youth Youth Team – VPL1 Seniors Development Squad – VPL1 U23’s Under 17’s Under 16’s Under 15’s Under 14’s Football School Our Partners Contact Us / More Info Contact Us Education Melbourne City Institute of Sport & Business About About Us Player Sponsorship Our Partners Privacy Policy Competitions Promotion and Competition Winners Fan Representative Group Safeguarding Careers at Melbourne City Volunteer at City Community Macca’s® City Clubs In School Program – City Futures School Immersion Days City in the Community GOAL! Young Leaders Creating Respectful Relationships Twinning project Healthy Goals Powerchair Football Donations Match Day AAMI Parking City Square Parking Members FAQ’s Public Transport Spectator Code of Behaviour A-Leagues Terms of Admission AAMI Park Conditions of Entry Aleagues Tickets Shop Membership Subscribe Matches Close Football School Membership Shop Close Contact Us Street Address 369 Casey Fields Blvd Cranbourne East, VIC 3977 Postal Address PO Box 4016 Narre Warren South, Victoria, 3805 Social Media Facebook | Instagram | Twitter | YouTube | TikTok General Enquiries Email: info@melbournecityfc.com.au Membership and Ticket Support Email: membership@melbournecityfc.com.au Phone: 1300 255 432 Chairman’s Club & Corporate Hospitality Email: cityhospitality@melbournecityfc.com.au Merchandise Email: officialshop@melbournecityfc.com.au Melbourne City Football School Email: footballschool@melbournecityfc.com.au Phone: (03) 9457 1765 Corporate and Sponsorship Email: citypartnerships@melbournecityfc.com.au Media Enquiries Email: city.media@melbournecityfc.com.au Community Email: community@melbournecityfc.com.au Donations Email: community@melbournecityfc.com.au MPIO Email: safeatcity@melbournecityfc.com.au × Principal Partner Major Partners ALL PARTNERS logo-svg Club News Videos Squads Matches Ladders About About Us Contact Us Subscribe Community Melbourne City Football School Our Partners Privacy Policy Terms & Conditions © 2025 Australian Professional Leagues Company Pty Ltd. *Live odds displayed are subject to change. 369 Casey Fields Blvd Cranbourne East, VIC, 3977 +61 (3) 9457 1765 Close There's more to the story Sign in to unlock the best FREE football news exclusive to KEEPUP Sign up today to unlock it and access more exclusive content: In-game, A-Leagues Match Highlights Access to local and global football news Packed with opinions from our expert panel including Tom Smithies and more Register now Sign in"
    },
    {
      "url": "https://downtownmelbourne.com/contact/",
      "text": "Contact Melbourne Main Street | Historic Downtown Melbourne, Florida Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Contact 2022-03-21T16:11:12-04:00 CONTACT DOWNTOWN MELBOURNE Thank you for contacting Melbourne Main Street, the non-profit organization dedicated to revitalizing and enhancing Historic Downtown Melbourne. We’d love to connect with you. Please reach out to us via your preferred method of contact, and we look forward to getting in touch with you.what makes Downtown Melbourne an unforgettable shopping destination. No matter your taste, you’ll love it. MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com EXPLORE DOWNTOWN MELBOURNE Residing along the Indian River Lagoon and Crane Creek waterfronts, Historic Downtown Melbourne is a playground for all ages. View Directory & Map UPCOMING EVENTS Farmer’s Market at Riverview Park September 13, 2025 @ 10:00 am - 2:00 pm Green Gables Historic Home Open House September 13, 2025 @ 10:00 am - 2:00 pm Melbourne Municipal Band Concert: Sway With U … September 17, 2025 @ 7:00 pm - 9:00 pm Melbourne Municipal Band Concert: Sway With U … September 18, 2025 @ 7:00 pm - 9:00 pm View All Events KEEP EXPLORING! SHOP From boutiques and antiques to handcrafted skincare and specialty cigars, you can find them here. SHOP IN DTMB DINE With over 40 craft restaurants and bars, indulgence is expected in Downtown Melbourne. DINE IN DTMB PLAY Rent a kayak, take in live theater or rock out in one of many local music venues. Downtown Melbourne is a playground for all ages. PLAY IN DTMB EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://downtownmelbourne.com/about/melbourne-main-street/",
      "text": "About Melbourne Main Street | Historic Downtown Melbourne, Florida Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Melbourne Main Street 2025-02-18T15:40:57-05:00 ABOUT MELBOURNE MAIN STREET A Florida Main Street Community MISSION At Melbourne Main Street, we are committed to fostering dynamic partnerships that drive the evolution of Historic Downtown Melbourne into an unparalleled hub for genuine economic activity. Our mission is to elevate and enrich the economic landscape of Historic Downtown Melbourne by amplifying and showcasing the community’s distinctive positive characteristics. Through collaborative efforts, we strive to create an environment where the unique spirit of our historic downtown thrives, attracting visitors and fostering sustainable economic growth for the benefit of our entire community. VISION At Melbourne Main Street, we envision a thriving and dynamic heart at the center of our community, where the pulse of Downtown Melbourne beats with vitality and prosperity. Our commitment as a local non-profit organization is to lead the charge in revitalizing our beloved city center, creating a destination that inspires connection, innovation, and economic growth. In our vision for Melbourne Main Street, we see a downtown that transcends its historical charm to become a modern and inclusive hub—a place where residents and visitors alike experience the rich tapestry of our community’s heritage while embracing the promise of a vibrant future. MELBOURNE MAIN STREET APPROACH Melbourne Main Street utilizes a time-tested framework for impactful, cost-effective, and community-driven revitalization for Historic Downtown Melbourne. Community transformation framework strategies and key areas of focus are outlined below: ECONOMIC VITALITY Melbourne Main Street drives the Downtown economy with tools to assist businesses, catalyze property development, and create a supportive environment for entrepreneurs and innovators. Focus Areas: Communicate the interests of the public to the City of Melbourne for support and prioritization Work with property owners to ensure a healthy and diverse Downtown Melbourne marketplace DESIGN Melbourne Main Street supports the transformation of Downtown by enhancing the physical and visual assets that set the community apart and create a safe, friendly, and inviting atmosphere. Focus Areas Façade Grant Improvement Program Beautification Projects Maintain Historical Character ORGANIZATION Melbourne Main Street creates a strong foundation for a sustainable revitalization effort, including cultivating partnerships, community involvement, and resources for Downtown. Focus Areas Board of Directors comprised of individuals with diverse talents, connections and thought Development of strategic partnerships Effective placemaking and branding Robust digital Assets PROMOTION Melbourne Main Street positions Downtown as the center of the community and hub of economic activity, while creating a positive image that showcases the community’s unique characteristics. Focus Areas Downtown Melbourne Putta Palooza Trash Bash (Part of a county wide initiative) Downtown Melbourne Botanical Fest Downtown Melbourne Flower Walk Downtown Melbourne Sidewalk Sale Downtown Melbourne Trick or Treat Downtown Melbourne Food & Wine Festival Downtown Melbourne Tree Lighting Ceremony & Candlelight Shopping MAIN STREET AMERICA – 2023 ACCREDITED As a Main Street America Accredited Main Street, Melbourne Main Street is part of a national network of more than 1,200 neighborhoods and communities that share both a commitment to creating high-quality places and to building stronger communities through preservation-based economic development. JOIN MELBOURNE MAIN STREET By partnering with Melbourne Main Street, you’re investing in the revitalization, economic vitality, visual transformation, and promotion of Historic Downtown Melbourne. BECOME A MEMBER CONTINUE EXPLORING ABOUT DTMB Located along the Indian River Lagoon and Crane Creek waterfronts, DTMB is an unforgettable destination for locals and visitors alike. Learn More LEADERSHIP From the Melbourne Main Street Board of Directors to the Downtown Melbourne team, get to know our leadership. MEET LEADERSHIP HISTORY Downtown Melbourne is one of the most charming parts of Melbourne, with a history that dates back to the 1800s. Explore History EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://www.melbournewater.com.au/about/who-we-are",
      "text": "Who we are | Melbourne Water Skip to main content Toggle navigation Melbourne Water Mega nav Water and environment Water and environment Close navigation Water management Water management Rainfall and river levels Sewerage Water quality Water storage levels Rivers and creeks Allocating Melbourne's water resources Water storage reservoirs Drop down content end Saving water Saving water Let’s talk water Permanent water-saving rules and Target 150 Raingardens Tips for saving water Drop down content end Flooding and drainage Flooding and drainage Flooding and its impacts Managing flood risk together Prepare for flooding Drainage system Greater Melbourne Flood Information Program Maribyrnong River flood Drop down content end Climate change Climate change How we are taking action Tackling climate change Enhancing liveability: our commitment Our water supply challenges Our path to net zero North -South pipeline Urban cooling Drop down content end Energy Energy Biogas Biosolids Hydropower Solar farms Integrated water management Drop down content end Land and catchments Land and catchments Catchments and conservation Climate smart agriculture Feral Cat Free French Island Grow West Living Links Yarra4Life Drop down content end Waterway diversions Waterway diversions Restriction and ban status Stream flow management Water use compliance Drop down content end Learning resources Today's water storages Today's rainfall levels View the Dam Cam Drop down content end Services Services Close navigation Projects and maintenance works Maintenance Maintenance Grass cutting maintenance Revegetation and weed control works Desilting creeks, wetlands and drains Drop down content end Building and works Building and works Apply to build and develop Building and home renovation Flooding information and advice Work or build near our assets or easements Amendments list Developer guides and resources Stormwater management Supporting the delivery of housing across Greater Melbourne Drop down content end Grants Grants Liveable Communities, Liveable Waterways Program Victorian Landcare Grants Drop down content end Licences and permits Licences and permits About diversion licences Birdwatching access Dam safety, licences and registration Diversion pricing, forms and guidelines Metering, pump and offtake guidelines Pay online Water trading and licence transfers Drop down content end Use our land Prices and charges Prices and charges Price Submission Bulk water and sewerage Waterways and Drainage Charge Construction, works and connections Flood level information Hydrologic data Clearwater Drop down content end Local water company contacts Pay online Apply to build or develop What's happening near me? Find drainage schemes and rates Drop down content end Education Education Close navigation Community resources Community resources Public tours Citizen science Water knowledge Drop down content end School resources School resources Excursions Teacher Toolbox Melbourne's World of Water Drop down content end Stay in touch How water is supplied to you Saving water How we generate energy Our history Drop down content end Things to do Things to do Close navigation Events Walking tracks and bike paths Barbecue locations Birdwatching Birdwatching Bird species at the Western Treatment Plant Drop down content end Fishing Become a volunteer Western Treatment Plant Drip Trip: the game Build a raingarden Drop down content end About us About us Close navigation Who we are Who we are Board of Directors Executive leadership team Traditional Owner partners History and heritage Drop down content end What we do What we do News Annual report Publications Policies Legislation Research and innovation Our customers Drop down content end Careers Careers Apply for a job Create a job alert Existing applicant login Training and approval to work on a Melbourne Water site Drop down content end Contact us Contact us Online enquiry Complaints Drop down content end Apply for a job Contractor training, induction and site access Read our annual report Read our news Drop down content end Toggle search Fulltext search Search Close navigation Home Close navigation Mobile navigation Home About us Who we are Left navigation Left navigation About us Who we are Board of Directors Executive leadership team Traditional Owner partners Who is Melbourne Water? History and heritage What we do Careers Contact us Left nav - about us Who we are In Melbourne, water is essential to our way of life. That’s why together with government, businesses and communities , we plan for and manage all elements of the water cycle for today, tomorrow and generations to come. From: providing clean drinking water treating sewage planning flood prevention monitoring maintaining all 25,000km of Melbourne’s rivers, creeks and catchments. Taking action in the decade that matters With increasingly unpredictable weather and more people wanting to call our region home, by 2030 nearly 6 million people will need water every day. We are in the decade that matters when the actions we take now will define our future. Our acknowledgement Through all that we do, we recognise that the Traditional Owners of the region have connections to and hold ancient knowledge of the land and water that are inseparable from their lives. In tending to all the rivers, creeks and surrounding land of our greatest backyard, we work as partners, we listen, and we tell the truth with Traditional Owners throughout our region. Our vision We are committed to enhancing life and liveability for the greater Melbourne region. Water is essential to our way of life and so is the work we do to enhance the natural environment we live in and the communities we are part of. Our values As caretakers for Melbourne’s water cycle, we care for water, life and land throughout Melbourne: both its people and its biodiversity. Our three core values are integral to the way we do that work. Make it count: We set clear expectations, prioritise fiercely and take calculated risks to achieve our goals. Dive in: We choose curiosity, lean into tough conversations and celebrate diverse perspectives. Do what’s right: We deeply care about Melbourne, our customers, and each other. We take personal responsibility for our business's performance and future The Minister for Water, in consultation with the Treasurer, appoints our Board of Directors. How useful was this information? 1 out of 5 stars 2 out of 5 stars 3 out of 5 stars 4 out of 5 stars 5 out of 5 stars What could we improve? We use reCAPTCHA to protect our website from spam, for more information about the data we collect see our privacy website statement . Last updated: 16 July 2025 Footer menu Careers About us Services Water data environment Melbourne Water respectfully acknowledges the Bunurong, Gunaikurnai, Taungurung, Wadawurrung and Wurundjeri Woi-wurrung peoples as the Traditional Owners and Custodians of the land and water on which we rely and operate. We pay our deepest respects to their Elders past, present and emerging. Call 131 722 Footer privacy menu Translating services Accessibility Disclaimer Privacy Back to top"
    },
    {
      "url": "https://www.fox35orlando.com/news/20-year-old-killed-downtown-melbourne-shooting-officials-say",
      "text": "19-year-old killed in Downtown Melbourne shooting, suspect in custody, officials say | FOX 35 Orlando Live News Weather Good Day We Love Florida Contests More Watch Live Expand / Collapse search ☰ Search site News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests River Flood Warning is in effect, Lake County, Volusia County 3 Rip Current Statement until FRI 5:00 AM EDT, Coastal Flagler County Rip Current Statement until SAT 4:00 AM EDT, Coastal Volusia County 19-year-old killed in Downtown Melbourne shooting, suspect in custody, officials say By Abigail Lafferty and Juan Rodriguez Published May 11, 2025 9:19am EDT News FOX 35 Orlando Share Copy Link Email Facebook Twitter LinkedIn Reddit College football player home for summer break killed in downtown Melbourne shooting A 19-year-old man is dead and another has been charged with manslaughter following a shooting early Sunday morning in downtown Melbourne, police said. The victim, Nathaniel Bernard Jennings, who was attending the University of Northwestern - St. Paul, a Christian university located in Minnesota, was home in Palm Bay for summer break. He was a defensive lineman on the schools football team. FOX 35's Caroline Coles spoke with Jennings mother. The Brief Officers responded to the scene at approximately 1:51 a.m. following reports of a shooting. Upon arrival, they located a male victim who had sustained gunshot wounds. The individual was immediately transported to a local hospital, where he was later pronounced deceased. Police have one individual in custody in connection with the incident. This individual is currently claiming self-defense. BREVARD COUNTY, Fla. - A 19-year-old man is dead and another has been charged with manslaughter following a shooting early Sunday morning in downtown Melbourne, police said. 19-year-old killed in Downtown Melbourne shooting, suspect in custody, officials say A 19-year-old man is dead and another has been charged with manslaughter following a shooting early Sunday morning in downtown Melbourne, police said. Victim and suspect identified What we know: Officers responded around 1:51 a.m. to the area of Vernon Place and East New Haven Avenue after receiving reports of gunfire. Upon arrival, they found a male victim suffering from gunshot wounds. He was transported to a local hospital where he later died. The victim was identified as Nathaniel Bernard Jennings, 19, of Palm Bay. According to city officials, Jennings was visiting from out of state and had family in the area. Jennings was attending the University of Northwestern - St. Paul, a Christian university located in Minnesota. He was a defensive lineman on the schools football team. Victim - Nate Jennings | Credit: UNW athletics website Preliminary findings indicate that Jennings and the suspect were involved in a verbal altercation prior to the shooting. Melbourne police said one individual was taken into custody at the scene and initially claimed self-defense. Following further investigation, detectives identified the suspect as Stephan Dieujuste and developed probable cause for his arrest. Dieujuste was formally charged with manslaughter and booked into the Brevard County Jail Complex. Suspect - Stephan Dieujuste Authorities said the city’s surveillance camera system captured portions of the incident, aiding in the investigation. The University of Northwestern responds What they're saying: The head football coach at the University of Northwestern released a statement regarding the death of Nate Jennings: \"Nate was a treasured member of our football team, being honored with all-conference accolades following his first year of collegiate competition. For as talented as Nate was on the football field, he was an even better person off of it. His contagious energy and positivity will be missed. We are praying for Nate’s mother Autumn, brother Isaiah, and other members of his extended family during this difficult time\", UNW Head Football Coach Matt Moore said. Judge sets no bond What's next: On Monday, during Dieujuste's first appearance, the judge set no bond. His next court date is scheduled for June 5. Police continue to interview witnesses and urge anyone with additional information to contact the Melbourne Police Department. STAY CONNECTED WITH FOX 35 ORLANDO: Download the FOX Local app for breaking news alerts, the latest news headlines Download the FOX 35 Storm Team Weather app for weather alerts & radar Sign up for FOX 35's daily newsletter for the latest morning headlines FOX Local: Stream FOX 35 newscasts, FOX 35 News+, Central Florida Eats on your smart TV The Source: This information came from a Melbourne Police Department press release and a statement provided by Melbourne Mayor Paul Alfrey on May 11, 2025. News Crime and Public Safety Latest News Teen killed, 5 men hurt in shooting at Tampa apartment complex Live Now WATCH: 9/11 remembrance ceremony, annual reading of names Live Now Remembering 9/11: Reading of the names, Tribute in Light and NYC street closures September 11, 2001 timeline of attacks and events Dallas beheading: Victim identified, suspect charged with capital murder Trending Volusia County mom charged after children found in roach-infested, unsafe home: Deputies Substitute teacher banned from Orange County schools after making threats to students, district says Man shot while driving in Orlando; police searching for 2 suspects National Hurricane Center: Tropical wave in Atlantic eyed for potential development 18-year-old woman found shot and killed after Orange County crash, deputies say Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . FOX LOCAL Stream FOX 35 Orlando for free with FOX LOCAL Watch local news, weather, and live events on Roku, Fire TV, and more — just search “FOX LOCAL” News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/about/",
      "text": "About the Festival and Host - DTMB Food and Wine Festival Skip to content For details on culinary exhibiting and sponsorship opportunities, please email events@downtownmelbourne .com About the Festival and Host Chris Fynan 2024-08-27T12:00:42-04:00 About the Festival The 2024 Downtown Melbourne Food and Wine Festival is set to be an exciting event on Saturday, November 9th, from 5:30 pm to 9:30 pm, presented by Sysco. The festival will feature an expanded venue along Melbourne Avenue at Crane Creek, offering double the space for attendees to enjoy a variety of food, wine, spirits, and beer. There will be live music and other entertainment, providing a vibrant atmosphere in Historic Downtown Melbourne, Florida. This year, the event is completely enclosed, ensuring that only those with valid tickets can join the fun. To ensure a smooth experience, there will be ONE designated entrance off New Haven Avenue. Parking is limited and attendees are encouraged to use rideshare services or book a stay at one of the partner hotels offering special rates. For those interested in participating as a vendor or sponsor, you can reach out via email at foodandwine@downtownmelbourne.com. Host & Charity Melbourne Main Street is a 501(c)3 non-profit organization that works to build public and private partnerships to revitalize Historic Downtown Melbourne and create a 24/7 economy. An accredited Main Street, part of the National Trust for Historic Preservation, our mission is to fuel economic growth by capitalizing on the community’s assets and paying particular attention to the physical, cultural, and social identity of Downtown Melbourne. The Melbourne Main Street program was designed to enhance economic growth in the community through cultural events and social activities. We strive to promote the community identity as the “preferred destination” for quality shopping, dining, and entertainment. More About Melbourne Main Street » Close product quick view × MELBOURNE MAIN STREET A non-profit 501(c)3 organization 2004 Vernon Place Melbourne, FL 32901 321-724-1741 foodandwine@downtownmelbourne.com Follow Us Visit Downtown Melbourne © Copyright 2024 Downtown Melbourne | Melbourne Main Street Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://downtownmelbourne.com/businesses/melbourne-main-street-inc/",
      "text": "Melbourne Main Street, Inc - Downtown Melbourne Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Home / DIRECTORY & MAP / Melbourne Main Street, Inc DOWNTOWN MELBOURNE DIRECTORY & MAP Melbourne Main Street, Inc Melbourne Main Street is a 501(c)(3) non-profit organization dedicated to revitalizing and enhancing the economic growth of Historic Downtown Melbourne. SHARE THIS PAGE DETAILS Melbourne Main Street, Inc 2004 Vernon Place , Melbourne, FL, 32901 Phone 321-724-1741 Website downtownmelbourne.com KEEP EXPLORING! PLAN Downtown Melbourne has so much to offer, all within a walkable footprint. Park for the day, or stay for the weekend. Plan Your Visit DINE With over 40 craft restaurants and bars, indulgence is expected in Downtown Melbourne. DINE IN DTMB PLAY Rent a kayak, take in live theater or rock out in one of many local music venues. Downtown Melbourne is a playground for all ages. PLAY IN DTMB EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://foodandwine.downtownmelbourne.com/contact/",
      "text": "Contact - DTMB Food and Wine Festival Skip to content For details on culinary exhibiting and sponsorship opportunities, please email events@downtownmelbourne .com Contact Chris Fynan 2024-08-01T17:23:17-04:00 Contact PHONE 321.724.1741 EMAIL foodandwine@downtownmelbourne.com ADDRESS Melbourne Main Street 2004 Vernon Place Melbourne, FL 32901 This event is hosted by Melbourne Main Street, a 501c3 organization committed to the revitalization of Downtown Melbourne. We are located on Vernon Place in Historic Downtown Melbourne, Florida. Proceeds from the Melbourne Main Street events are used to advocate for the revitalization of Downtown Melbourne including items such as enhanced lighting, safety, parking, and beautification projects. In addition, funds will be invested in our efforts to continue hosting special events and to market and promote Downtown Melbourne as the premier destination for dining, celebrations, shopping, interactive experiences, services, and more. Questions? Visit our FAQs page. FAQs » Close product quick view × MELBOURNE MAIN STREET A non-profit 501(c)3 organization 2004 Vernon Place Melbourne, FL 32901 321-724-1741 foodandwine@downtownmelbourne.com Follow Us Visit Downtown Melbourne © Copyright 2024 Downtown Melbourne | Melbourne Main Street Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    },
    {
      "url": "https://downtownmelbourne.com/plan/",
      "text": "Plan Your Visit To Historic Downtown Melbourne, Florida Skip to content Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU 74° Directory Events Search Home Events The Flavor Experience landing page Shop Dine Play Explore Parks Murals STAY LIVE WORK PLAN STAY LIVE WORK Directory & Map About Downtown Melbourne Melbourne Main Street Membership Leadership History News & Stories Membership Visitors Guide Contact MENU Events Directory Search × Search for: Close Plan 2023-06-01T10:28:33-04:00 PLAN YOUR VISIT TO DOWNTOWN MELBOURNE Downtown Melbourne has so much to offer, all within a walkable footprint making it an attractive place to shop, dine, play, and explore. Come settle in for a day, an event, a weekend, or who knows? You just might feel so inclined to stick around Downtown Melbourne for good! View Directory & Map DOWNTOWN MELBOURNE – GETTING HERE Are you planning a trip to Downtown Melbourne? Find trip planning tips, instructions for getting around, transportation information, and more below. Plan your visit to Downtown Melbourne today! PARKING Free on-street parking is available along New Haven Avenue, on intersecting side streets, and on the streets around Melbourne City Hall within Downtown Melbourne. Plus, there are over 750 convenient, off-street public parking options including: City Hall Parking Garage (316 Spaces), Rosseter Lot (90 Spaces), Melbourne Avenue Lot (100 Spaces), Vernon Place Lot (45 Spaces), Hotel Melby (30 Spaces), Henegar Center (175 Spaces). BUS STOPS Are you traveling by bus? Hop on the 321 Transit (Space Coast Area Transit) and search routes serving the Downtown Melbourne area. Click here to find your route , see maps and schedules, buy bus passes, and more. PUBLIC TRANSPORT Beyond your arrival and departure from Downtown Melbourne, continuing to use a car service for the duration of your stay can be a wise and proactive way to ensure safe riding and avoid drinking and driving. Transportation via Uber, Lyft, and Taxi are some public transport options available in the Melbourne area. MELBOURNE ORLANDO INT’L AIRPORT Melbourne Orlando International Airport (MLB) is the gateway airport to Florida’s Space Coast. It is conveniently located 1.5 miles northwest (and a 10-minute drive) of Downtown Melbourne. Located in the aerospace, defense, and manufacturer neighborhood, this airport is proving primarily instrumental for those traveling to Melbourne on business, and by the same token, companies operating out of Downtown Melbourne. STAY Stay in Downtown Melbourne. Whether you’re looking for upscale, boutique hotels, or a quaint bed and breakfast, Downtown Melbourne is here to accommodate. EXPLORE ACCOMMODATIONS PLAN YOUR VISIT TO DOWNTOWN MELBOURNE View Directory & Map KEEP EXPLORING! SHOP From boutiques and antiques to handcrafted skincare and specialty cigars, you can find them here. SHOP IN DTMB DINE With over 40 craft restaurants and bars, indulgence is expected in Downtown Melbourne. DINE IN DTMB PLAY Rent a kayak, take in live theater or rock out in one of many local music venues. Downtown Melbourne is a playground for all ages. PLAY IN DTMB EXPLORE Explore Downtown Melbourne’s pedestrian-friendly side by visiting its waterfront parks and vibrant wall murals. EXPLORE DTMB Get The Latest Subscribe to receive the latest on events, promos and openings in Downtown Melbourne. Email SIGN UP View Our Visitors Guide View our quarterly visitors guide. Printed guides are available throughout Downtown Melbourne. VIEW GUIDE CORPORATE PARTNERS MELBOURNE MAIN STREET 2004 Vernon Place Melbourne, FL 32901 321.724.1741 info@downtownmelbourne.com FOLLOW US © Copyright Historic Downtown Melbourne | Melbourne Main Street Accessibility Statement | Privacy Policy | Terms of Use | Contact | Member Login Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Go to Top"
    }
  ]
}