{
  "fuentes": [
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "chloe.johnson@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "edavidson@wgpd.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "efischer@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "jgainza@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "jrees@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "jwilliams@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "mhutchinson@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "email": "sgraham@cwgdn.com"
    },
    {
      "url": "https://downtownwg.com/arts-in-april/",
      "email": "emckinney@wgart.org"
    },
    {
      "url": "https://www.wintergardenvc.com/contact-us",
      "email": "info@wintergardenvc.com"
    },
    {
      "url": "https://www.cwgdn.com/322/Winter-Garden-Farmers-Market",
      "email": "farmersmarket@downtownwg.com"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "email": "enquiries@greengarden.sg"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "email": "shadow@2x.png"
    },
    {
      "url": "https://downtownwg.com/winter-garden-heritage-music-festival/",
      "email": "karenart@yahoo.com"
    },
    {
      "url": "https://issuu.com/wotimes/docs/lm_20220714/s/16336989",
      "email": "kelly@kelsellsorlando.com"
    },
    {
      "url": "https://www.cwgdn.com/175/City-Manager",
      "email": "jwilliams@cwgdn.com"
    },
    {
      "url": "https://www.wintergardencra.com/637/Downtown",
      "email": "efischer@cwgdn.com"
    },
    {
      "url": "https://www.wintergardencra.com/637/Downtown",
      "email": "mhutchinson@cwgdn.com"
    },
    {
      "url": "https://www.cwgdn.com/317/Customer-Service",
      "email": "customerservice@cwgdn.com"
    },
    {
      "url": "https://downtownwinnipegbiz.com/join-us/",
      "email": "info@downtownwinnipegbiz.com"
    }
  ],
  "mails": [
    "chloe.johnson@cwgdn.com",
    "customerservice@cwgdn.com",
    "edavidson@wgpd.com",
    "efischer@cwgdn.com",
    "emckinney@wgart.org",
    "enquiries@greengarden.sg",
    "farmersmarket@downtownwg.com",
    "info@downtownwinnipegbiz.com",
    "info@wintergardenvc.com",
    "jgainza@cwgdn.com",
    "jrees@cwgdn.com",
    "jwilliams@cwgdn.com",
    "karenart@yahoo.com",
    "kelly@kelsellsorlando.com",
    "mhutchinson@cwgdn.com",
    "sgraham@cwgdn.com",
    "shadow@2x.png"
  ],
  "nombre_sitio": "downtownwg.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cwgdn.com/661/City-Contacts",
      "text": "City Contacts | Winter Garden, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents About Neighborhood Economic Development Housing City Home Home Business Community Redevelopment Agency East Winter Garden About Resources & Services City Contacts City Contacts The Mayor of Winter Garden oversees District 5 which encompasses all districts within the City of Winter Garden. John Rees, Mayor – District 5-Citywide 407-656-7372 jrees@cwgdn.com District 5 Map - (Citywide) John Rees, Mayor Historic East Winter Garden Neighborhood resides within District 3 of City of Winter Garden. Commissioner Johnson, a resident of East Winter Garden, began a four-year term in April 2024. Chloe Johnson, District 3 Commissioner 407-877-5132 chloe.johnson@cwgdn.com District 3 Map - Chloe Johnson, Commissioner Jon C. Williams has been with the City of Winter Garden since early 2018, becoming its City Manager in 2021 after serving as Assistant City Manager of Public Services. Jon Williams, City Manager 407-656-4111 ext. 2267 jwilliams@cwgdn.com City representative for Historic East Winter Garden Neighborhood Marc O. Hutchinson, Economic Development Director 407-656-4111 ext. 2306 mhutchinson@cwgdn.com Jose P. Gainza, Jr., Fire Chief 407-877-5175 jgainza@cwgdn.com Steve Graham, Police Chief 407-656-3636 (Police Nonemergency) sgraham@cwgdn.com Onsite at Community Resource Center by appointment. Call or send email to make an appointment. Evonie S. Harris, Community Outreach Coordinator 407-656-3636 ext. 4661 edavidson@wgpd.com Central Florida Resources City Communication Tools City Contacts City Citizen Programs (Free) City of Winter Garden Nonprofit Grant Program Community Resource Center How to Get Involved Local Nonprofit Resources Neighborhood Facilities One Winter Garden WHERE GOOD THINGS GROW Contact Us Marc O. Hutchinson Economic Development Director 407-656-4111 ext. 2306 Email Eric Fischer Economic Development & Downtown Manager 407-656-4111 ext. 2266 Email 300 W Plant Street Winter Garden, Florida 34787 Quick Links Annual Reports Board and Meeting Information Budget and Financial Documents History Important Maps Planning Documents Projects & Programs /QuickLinks.aspx Helpful Links Home Site Map Emergency & After Hours Contacts Accessibility Copyright Notices Terms of Use Memo for City Hall, Police, and Off-Site Records Requests /QuickLinks.aspx Stay Connected Agenda's & Minutes Customer Service Jobs Pay Utility Resources & Services CRA Downtown Winter Garden Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://downtownwg.com/arts-in-april/",
      "text": "Arts in April - Downtown Winter Garden Skip to content Downtown Events 81°F Your Official Guide to Downtown Winter Garden. Explore Shopping Dining & Drinks Arts & Entertainment History & Museums Salons & Spas Winter Garden Farmers Market West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Events News Learn More Parking, Maps & Resources History Explore Shopping Dining & Drinks Arts & Entertainment History & Museums Salons & Spas Winter Garden Farmers Market West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Events News Learn More Parking, Maps & Resources History Activities in April Call to Artists April 17th Community Celebration Art Night VIP Children's Activities Sponsors Support the Arts Downloadable Event Map and Guide Arts in April Arts in April is a community celebration to showcase and support the local arts. There will be activities and special exhibits throughout April. Arts in April partners include the Winter Garden Art Association and the City of Winter Garden as presenting partners, along with the Winter Garden Heritage Foundation, Crealde School of Art, Garden Theatre and Bloom and Grow Garden Society. On April 17th, there will be a day-long celebration with kids’ art, sidewalk chalk art contest, En Plein Air Event , and more. In the evening, there will be a fundraising event to support the arts called Art Night VIP . Downtown will be aglow in purple, blue, and gold and art will bring life to the streets. To purchase a ticket, please click here . Plan on loving your local art community on April 17th. All day and evening activities on April 17 will be held rain or shine. All day activities are free. Arts in April exhibits and activities continue all month including art exhibitions at SOBO Art Gallery, Winter Garden History Center, and City Hall. Look for “Look Art Inside” window signs at 20 downtown shops and restaurants for local art available for purchase. Stroll the downtown streets to admire the storefront window art displays throughout. You won’t want to miss the live stage performance of Godspell . More information about the exhibits, activities, as well as art classes can be found on “Activities in April” tab. The City of Winter Garden is actively monitoring the incidence of COVID-19 in our region and is following guidance from local health departments and the Centers for Disease Control and Prevention (CDC) regarding gatherings. The City reserves the right to institute necessary changes to these activities to ensure the public health, safety, and welfare of our citizens. Activities in April Beautiful Sights Children’s Art Exhibit Where: 8 N. Highland Avenue (across from City Hall on corner of Plant St. & Highland Ave.) When: Saturday, April 17,  10am-3 pm Description: A whimsical and glow-in-the-dark experience where you walk through this world of neon colors solely lit by black light to see the world through a child’s eyes. The last room has a blackboard and neon chalk to add your own glow-in-the-dark creation for all to see! The World Outside Exhibit Where : SoBo Art Gallery 127 S. Boyd St. When : Tuesday through Saturday, 10am – 6pm Description : 2D & 3D Works Related to getting outside again in life, thinking outside the box, or other fun interpretations of the “outside” theme. Springtime in Winter Garden Exhibit Where : City Hall Gallery, 300 W. Plant St. When : Monday – Friday, 8am – 5pm: and Saturday, April 17, from 10am-3pm. Description : See your city through the eyes of local artists as they depict the spring landscape. An Artistic Legacy Exhibit Where : Heller Hall at Winter Garden History Center, 21 E. Plant St. When : Exhibit Opening is on Saturday, April 17th (10am-3pm), then every Thursdays and Fridays, 11am – 3pm Description : Come along with us as we embark on an artistic journey… Travel from the past to the present as you view work created by artists who teach, share, and practice their love of art and history.  A wide range of subjects in various media and styles on exhibit in the Downtown Historic District showcases the diversity of the artists and photographers who fostered and continue to create a vibrant record of life in West Orange County.  Work by earlier artists such as Joe Burch and Dorothy Kannon display talent that was appreciated by generations of residents, and interviews with art instructor Rod Reeves, photographer Peter Schreyer, and painter Catherine Hempel chronicle the ongoing process that keeps the legacy alive. Find Your Way Home Where : Winter Garden Heritage Museum 21 E. Plant St. When : Thursday & Friday, 11am – 3pm, Description : Explore West Orange County’s iconic Cartographic History and view examples of rare maps from the Heritage Archive that date back to the West Orange settlement in the 19th century. Downtown Merchants Showcasing Local Art Businesses will have local art that can be purchased in 20 different locations. Look for this display in the window for participating businesses.  Business hours vary. Crooked Can Brewing Company/Plant Street Market The Deli Downtown Doxology Driftwood Market Garden Theatre Garden Music School Melts on Main Pammie’s Sammies Pilars Loft Plantation Jewelers Rosallie Le French Cafe Rita’s Italian Ice & Frozen Custard Ruby and Rust – artist showcase:  Caron Loveless @caronlovelessstudio and Olivia McGarvey The Sacred Olive Shoo Shoo Baby Boutique Sweet Dee’s Cupcakery The Whole Enchilada Writer’s Block Bookstore Urban Flats Winter Garden Wheel Works Participating Businesses Just Outside of Downtown Betty J’s Florist at 403 S. Dillard St. will be showcasing works from artist Bruce Collins on Saturday, April 17 from 10 am until 4 pm Kids Art at the Farmers Market Free kids art classes for ages 4-12 at the Farmers Market on April 3 & 10 from 10 am-12 pm. Children will be asked to create an object for the Beautiful Sights Exhibit that will be displayed in the Highland Building on April 17. (Artwork can be picked up at City Hall from April 26-30, 2021.) On April 17th, a special kids art activity is planned – Grow Your Own Art and Art Rocks! for ages 4 -12 at the Farmers Market from 10 am-12 pm.  Paint your own flower pot and paint a rock to take home.  Presented by Paint Life Panache Events and sponsored by Healthy West Orange and Lowe’s Winter Garden. Farmers Market Art Sessions: Downtown Pavilion, 104 S. Lakeview Ave. Saturdays, April 3, 10, and 17, 10:00 am – 12:00 pm Community Classes Offered in April Where: Winter Garden Arts Association, 127 S. Boyd St. When: Every Wednesday from 6 to 9 pm Description: Enjoy weekly doses of art and creativity right here in Downtown Winter Garden for adults. Visit Website Where: Jesse Brock Community Center, 310 N. Dillard St. When: Weekdays Description: Enjoy weekly classes offered by Crealde’ School of Art.  Learn about classes by clicking on the link below or visiting Visit Website Godspell at the Garden Theatre In Stephen Schwartz’s lively and enlightening hit musical, Godspell , Jesus, and his followers gather to share parables from the Book of Matthew, celebrating unity, spirituality, and community. With an eclectic rock score including the international hit “Day by Day,” Godspell is certain to entertain and inspire all who experience its message of acceptance, hope, and love. Both matinee and evening performances are available during its run from April 22 through May 23, 2021, at the historic Garden Theatre, 180 W. Plant St. Safety protocols, including physically distant seating, are adhered to provide guests a safe and enjoyable experience. Purchase Tickets Call to Artists The Winter Garden Art Association is currently collecting art submissions for a variety of exhibitions that will be showcased for “Arts in April,” a month-long celebration of local artists: *The World Outside at SOBO Art Gallery: 2D and 3D works related to getting outside again in life, thinking outside the box, or other fun interpretations of the outside theme. Submission deadline is March 8: https://wgart.org/artists/call-to-artists/ *The World Outside Outdoor Art and Sculpture to be displayed in April and beyond. Looking for creative outdoor art, sculptures, installations, interactive art, etc. for multiple venues around the City and at SOBO Art Gallery for public display. To be featured in April, submit by March 17: https://wgart.org/artists/call-to-artists/ *Live Performance Art on April 17. Calling all live performing artists, including visual display arts, live music, immersive and experiential artists, to participate in Celebrating the World Outside on April 17. Submission deadline is March 8: https://wgart.org/artists/call-to-artists/ *Chalkin’ It Up Sidewalk Art Contest on April 17. Open to individual and group adults, middle & high school students, and families, participants will have a 6×6 square to depict the theme, “Garden Walk-Bright Colorful Flowers.” Judging at 4:00 pm, prizes awarded. Space is limited; applications must be received by April 5: Chalkin-It-Up-Application-2021 .  For more information, click Chalkin’ It Up-Arts in April Flyer or contact Brenda Knowles at brendaknowles1257@gmail.com or 407-496-3428. Volunteers are needed to serve as exhibit docents, gallery/business guides, art ambassadors, photographers, and registration assistants for day and evening shifts at the community celebration on April 17. If interested, please send email by March 30 to tgerhartz@cwgdn.com. If you or someone you know is a talented artist that has some incredible art they would like to display, please check out this blog below to learn how to get in touch. Artist Information and Registration April 17th Community Celebration Our community will celebrate “The World Outside” and World Art Day on Saturday, April 17th. Please plan on coming downtown to celebrate and support the local arts. This celebration is part of the LOVE LOCAL campaign and April is Love Local Arts Month. On April 17th, there will be a day-long celebration with kids’ art, a community canvas experience, sidewalk chalk art, Plein air, and more. All activities are FREE. Click here to download the April 17 th Event Map and Guide Art Activities during the Day: Chalkin It Up Sidewalk Chalk Art Contest– “Garden Walk-Bright, Colorful Flowers” will take place in front of City Hall presented by the Bloom and Grow Garden Society. To participate or learn more, Chalkin’ It Up-Arts in April Flyer and Chalkin-It-Up-Application-2021 . En Plein Air Event throughout Downtown – The Winter Garden Art Association will have a Plein Air Event going on during the day. Stay tuned for more information. Kids Art at the Farmers Market – Free kids art classes for ages 4-12 at the Farmers Market on April 3 & 10 from 10 am-12 pm. The kids’ artwork to be featured in the Highland Building the evening of April 17. On April 17th, a special kids art activity is planned – Grow Your Own Art and Art Rocks! for ages 4 -12 at the Farmers Market from 10 am-12 pm.  Paint your own flower pot and paint a rock.  Presented by Paint Life Panache Events and sponsored by Healthy West Orange and Lowe’s Winter Garden. Scavenger Hunt – sponsored by the Winter Garden Art Association. Pick-up form at Hospitality & Information tent at the Parking Garage from 10 am-3 pm and start collecting your clues! “The Rock Lab” Kids Band at the Farmers Market — Rock with the Garden Music School students’ band from 10 am-12 pm. All four MAIN EXHIBITS will be open and free during the day from 10 am – 3 pm: The World Outside Exhibit Where : SoBo Art Gallery 127 S. Boyd St. Description : 2D & 3D Works Related to getting outside again in life, thinking outside the box, or other fun interpretations of the “outside” theme. Springtime in Winter Garden Exhibit Where : City Hall Gallery, 300 W. Plant St. Description : See your city through the eyes of local artists as they depict the spring landscape. Beautiful Sights Children’s Art Exhibit Where: 8 N. Highland Avenue Description: A whimsical and glow-in-the-dark experience where you walk through this world of neon colors solely lit by black light to see the world through a child’s eyes. The last room has a blackboard and neon chalk to add your own glow-in-the-dark creation for all to see! An Artistic Legacy Exhibit Where : Heller Hall at Winter Garden Heritage Foundation, 21 E. Plant St. Description : Come along with us as we embark on an artistic journey… Travel from the past to the present as you view work created by artists who teach, share, and practice their love of art and history.  A wide range of subjects in various media and styles on exhibit in the Downtown Historic District showcases the diversity of the artists and photographers who fostered and continue to create a vibrant record of life in West Orange County.  Work by earlier artists such as Joe Burch and Dorothy Kannon display talent that was appreciated by generations of residents, and interviews with art instructor Rod Reeves, photographer Peter Schreyer, and painter Catherine Hempel chronicle the ongoing process that keeps the legacy alive. As a bonus, visit the Find Your Way Home Exhibit Where : Winter Garden Heritage Foundation – 21 E. Plant St. Description : Explore West Orange County’s iconic Cartographic History and view examples of rare maps from the Heritage Archive that date back to the West Orange settlement in the 19th century. Downtown Merchants Showcasing Local Art Businesses will have local art that can be purchased in 20 different locations.  Look for this display in the window for participating businesses. Business hours vary. Crooked Can Brewing Company/Plant Street Market The Deli Downtown Doxology Driftwood Market Garden Theatre Garden Music School Melts on Main Pammie’s Sammies Pilars Loft Plantation Jewelers Rosallie Le French Cafe Rita’s Italian Ice & Frozen Custard Ruby and Rust – artist showcase:  Caron Loveless @caronlovelessstudio and Olivia McGarvey The Sacred Olive Shoo Shoo Baby Boutique Sweet Dee’s Cupcakery The Whole Enchilada Writer’s Block Bookstore Urban Flats Winter Garden Wheel Works Participating Businesses Just Outside of Downtown Betty J’s Florist at 403 S. Dillard St. will be showcasing works from artist Bruce Collins on Saturday, April 17 from 10 am until 4 pm Art Activities at Night: Art Night VIP In the evening, Downtown will be aglow with color and pop up art on the streets bringing life and creativity to our Downtown. Don’t miss the first-ever “Art Night VIP” Fundraising event to help support the arts. “Behind The Velvet Rope” VIP Access to Curated Immersive Art Experiences in several small COVID-safe boutique settings around historic Downtown Winter Garden. Additional information can be found at the “Art Night VIP” tab. Space is limited so secure your spot today. To purchase a ticket, please click here . Art Night VIP In the evening, downtown will be aglow with color and art with the first-ever “Art Night VIP” fundraising event to help support the arts. “Behind The Velvet Rope” VIP Access to Curated Immersive Art Experiences in several small COVID-safe boutique settings around historic Downtown Winter Garden.  There will be pop-up art on the streets bringing life and creativity to our Downtown. Tickets are limited so secure your spot below: VIP Tickets VIP Curated Immersive Art Experiences SOBO Art Gallery – 127 S Boyd Street “Behind The Velvet Rope” VIP Access to Curated Immersive Art Experiences with entertainment, silent auction, and a special presentation. City Hall Gallery and Plaza – 300 W Plant Street An illuminated and immersive garden will lead you into the Springtime in Winter Garden exhibit in the City Hall Gallery.  See your city through the eyes of local artists as they depict the spring landscape. Highland Building – 8 N Highland Avenue A whimsical and vibrant experience entitled “Beautiful Sights.” Walkthrough this world of color and contrast and see the world through a child’s eyes. Pilars Loft – 146 W Plant Street Experience live art with special music by the Pilars Trio and drinks in the loft above Pilars. An Artistic Legacy Exhibit at Heller Hall – 21 E Plant Street Come along with us as we embark on an artistic journey… Travel from the past to the present as you view work created by artists who teach, share, and practice their love of art and history.  A wide range of subjects in various media and styles on exhibit in the Downtown Historic District showcases the diversity of the artists and photographers who fostered and continue to create a vibrant record of life in West Orange County.  Work by earlier artists such as Joe Burch and Dorothy Kannon display talent that was appreciated by generations of residents, and interviews with art instructor Rod Reeves, photographer Peter Schreyer, and painter Catherine Hempel chronicle the ongoing process that  keeps the legacy alive. Crooked Can Brewing Company and Plant Street Market – 426 W Plant Street Join us in a thoroughly curated experience with the best in local music from Layla Brisbois, award-winning local brews from one of the top breweries in Florida, and curated local art under the beautiful oak canopy. Garden Music School – 36 S Main Street Experience the fusion of art and music in an intimate setting with music teachers and students from the Garden Music School with curated local art.  Get ready to discover a hidden gem and stage in Downtown Winter Garden at Garden Music . This one-way Immersive Art Experience will feature a live SOBO Life Drawing Class and model, artistic stage lighting, award-winning artists painting on easels while enjoying a glass of wine and listening to the sounds of a Jazz Trio featuring world-class musician and Garden Music owner Jorge Cid. Art Night VIP Map Children's Activities Beautiful Sights Children’s Art Exhibit Where: 8 N. Highland Avenue (across from City Hall on corner of Plant St. & Highland Ave.) When: SATURDAY, April 17, 10am-3 pm Description: A whimsical and glow-in-the-dark experience where you walk through this world of neon colors solely lit by black light to see the world through a child’s eyes. The last room has a blackboard and neon chalk to add your own glow-in-the-dark creation for all to see! Kids Art Sessions at Winter Garden Farmers Market & Beautiful Sights Children’s Art Exhibit Complimentary Kids Art sessions will be held for children between the ages of 4 and 12 years old on April 3 & 10 at the Farmers Market from 10:00 am until 12:00 pm. No pre-registration is needed. Children will be asked to create an object for the Beautiful Sights Exhibit. The bright neon artwork from the sessions will be displayed under black lights creating a beautiful world through the eyes of children for the community to see.* If your students would like to participate as a group in the exhibit, please email Elizabeth McKinney, emckinney@wgart.org , at the Winter Garden Art Association. On April 17th, a special kids activity will be offered for children between the ages of 4 and 12 years old from 10 am until 12 pm entitled Grow Your Own Art and Art Rocks.  Paint your own flower pot and paint a rock.  Presented by Paint Life Panache Events and sponsored by Healthy West Orange and Lowe’s Winter Garden. *The artwork will be kept and displayed at the “Beautiful Sights Children’s Art Exhibit” on April 17 at 8 N. Highland Ave. (Artwork can be picked up at City Hall from April 26-30 , 2021). Farmers Market Art Sessions: Downtown Pavilion, 104 S. Lakeview Ave. Saturdays, April 3, 10, and 17, 10:00 am – 12:00 pm CHALKIN’ IT UP Sidewalk Chart Art Contest For Middle & High School Art Students, Families & Adults Titled “ Garden Walk with Bright, Colorful Flowers,” individual and group categories available to win prize money. Participants will have a 6×6 square to show off creative talent. Chalk is not provided. Hosted by the Bloom and Grow Garden Society, space is limited and applications must be submitted by April 5, 2021.  for more information, see Chalkin’ It Up-Arts in April Flyer . Application: Chalkin-It-Up-Application-2021 For more information, please contact Brenda Knowles with the Bloom and Grow Garden Society at brendaknowles1257@gmail.com or 407-496-3428. “The Rock Lab” Kids Band at the Farmers Market — Rock with the Garden Music School students’ band from 10 am-12 pm. Sponsors Partners Founder Sponsors Builder Sponsors Director Sponsors Hospitality Sponsors Support the Arts How can I show support year-round to the Local Arts? Winter Garden has many organizations dedicated to arts and culture.  Here are seven ways to support local art in your community. 1. Donate to a local arts organization WG Art Association WG Heritage Foundation Garden Theatre Crealde School of Art – Winter Garden Programming Bloom and Grow Garden Society Monarch Butterfly Project 2. Become a member of a local arts organization 3. Attend local art events and take classes 4. Buy local art 5. Support local art programs and schools 6. Plan on attending one of the arts activities during the month of April 7. Buy a ticket to the Fundraiser Art Night VIP – Celebrating The World Outside on April 17. You will receive an annual membership to the Winter Garden Art Association with your ticket purchase. Additional Ways to Support Local Arts: Buy a ticket to see GodSpell at the Garden Theatre.  Purchase tickets here Purchase an engraved brick at SOBO Sign up for Volunteer opportunities Become a Member of the Winter Garden Arts Association Follow on Social Media: Facebook Instagram Sign up to receive SOBO newsletter Downloadable Event Map and Guide Please follow us on social media to be the first to hear the official news, travel ideas, new local experiences, and special offers Downtown! Explore Events Shopping Dining & Drinks Arts & Entertainment Farmers Market History & Museums Salons & Spas West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Learn More Downtown Winter Garden News Parking, Maps & Resources City of Winter Garden Economic Development Terms of Use Sitemap Contact Us City of Winter Garden 300 West Plant Street (407) 656-4111 Stay Connected City of Winter Garden © 2023. All Rights Reserved. All other marks belong to their respective owners. Site by Alarie Design Subscribe * indicates required First Name Email Address * I am a.... Resident Local Business Owner Visitor"
    },
    {
      "url": "https://www.wintergardenvc.com/contact-us",
      "text": "Contact Winter Garden Volleyball Club | Get in Touch skip navigation Winter Garden Volleyball Club Search Search Contact Winter Garden Volleyball Club | Get in Touch Contacts Us! We'd love to hear from you! Get in Touch with Us! Whether you have questions about our programs, need more information, or want to get involved, our team is here to assist you. Reach out to us through any of the following methods, and we'll respond as soon as possible. Winter Garden Volleyball Club Address: 110 Athletes Row, Apopka, FL 32703 Phone: 317.457.6482 Email: wintergardenvc@gmail.com Training Hours Mon, Tue & Thur: 5:00 P.M to 9:00 P.M Wednesday: 5:00 P.M to 8:00 P.M Why Contact Us? Program Inquiries: Learn more about our training programs, camps, and events. Registration Assistance: Get help with signing up for our programs. Sponsorship Opportunities: Find out how you can support our club. General Questions: Ask us anything about the club, our facilities, or how to get involved. Feedback: Your feedback is invaluable to us. If you have any suggestions or comments, please don't hesitate to share. We're always looking to improve and provide the best experience for our athletes and community. Thank you for your interest in Winter Garden Volleyball Club. We look forward to connecting with you and helping you reach your volleyball goals! Contact Us Winter Garden Volleyball Club Address: 110 Athletes Row, Apopka, FL 32703 Phone: 317.457.6482 Email: wintergardenvc@gmail.com Resource Links Home Registration About Us Club Calendar Our Coaches Contact Us Our Facilities In the News Winter Garden Volleyball Club provides top-tier volleyball training and a supportive community for young athletes to develop their skills and passion for the sport. This website is powered by SportsEngine's Sports Relationship Management (SRM) software, but is owned by and subject to the  Winter Garden Volleyball Club privacy policy. ©2025 SportsEngine, Inc. Privacy Policy Page Search"
    },
    {
      "url": "https://www.cwgdn.com/322/Winter-Garden-Farmers-Market",
      "text": "Winter Garden Farmers Market | Winter Garden, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Departments Residents Business Things to Do Home Residents Special Events Winter Garden Farmers Market Winter Garden Farmers Market Every Saturday: 8:00 am – 1:00 pm Downtown Pavilion, 104 S. Lakeview Avenue Leashed Dogs & Cats Welcome The award-winning WINTER GARDEN FARMERS MARKET takes place EVERY SATURDAY year-round from 8:00 am to 1:00 pm. The market is held at the Downtown Pavilion, 104 S. Lakeview Avenue. More than 100 vendors participate weekly at the Winter Garden Farmers Market selling a wide variety of items such as: Since launching in 2008, the Winter Garden Farmers Market serves as a convenient weekly option to shop locally and sustainability, while providing a communal meeting place to gather. More than 3,500 visitors attend the market weekly. American Farmland Trust has repeatedly voted the Winter Garden Farmers Market as the Best Farmers Market in the State of Florida and in the USA! Interested in becoming a vendor? Scroll to bottom of page. Operating Hours Day of Week: EVERY Saturday year-found Hours: 8:00 am - 1:00 pm Location: Downtown Pavilion, 104 S. Lakeview Avenue Please note that the market is open every Saturday in December -- a great place to buy gifts and food items to make your holiday celebrations special! PARKING – Always Free A convenient three-level parking garage (160 S. Boyd Street) is located adjacent to the Winter Garden Farmers Market, with market booths welcoming visitors as soon as they walk out of the garage. Parking is also available in designated spots along West Plant Street and at the City’s 117-space parking lot at 37 N. Boyd Street. Parking is always FREE in downtown Winter Garden! EBT/SNAP Benefits Accepted at the Market The Winter Garden Farmers Market accepts EBT/SNAP for eligible items at the market, helping to provide nutrition benefits to supplement the food budgets of those in need. In addition, the Farmacy produce vendor accepts Fresh Access Bucks . Visit the EBT/SNAP tent at the entrance of the Pavilion before shopping for details and to redeem benefits. LIVE MUSIC & ENTERTAINMENT Each week, live music (9:00 am - 1:00 pm) fills the market air! Sing along to or dance to the live performance in the center of the market – it is a fun atmosphere for all. UPCOMING SPECIAL EVENTS AT THE MARKET (FREE), 9:00 am - 12:00 pm: Special event activities are provided at no charge. On select dates throughout the year, the Winter Garden Farmers Market hosts FREE special event programming. On these dates, visitors can enjoy fun activities such as kids arts and crafts station at Parking Garage Plaza (160 S, Boyd St.), themed events, and more! See what is coming up (all events are 9:00 am - 12:00 pm): 2025 February 8:                Valentine's Day Celebration (Kids' Holiday Craft) March 8:                     Farm Day at the Market / Petting Zoo March 15:                   St. Patrick's Day Celebration (Kids' Holiday Craft) April 12 & 19:             Arts in April Kids' Crafts April 19:                      Earth Day Reusable Tote Bag Giveaway May 10:                       Mother's Day Cards Kids' Craft June 7: Farmers Market 17th Birthday Party - Kids' Activities with DJ, Face Painting, FREE Snow Cones (while supplies last) , & Crafts (located on Lawn Area adjacent to Pavilion) June 14:                      Father's Day Cards Kids' Craft July 5:                         Independence Day Celebration - Kids' Holiday Craft; FREE Red, White & Blue Snow Cones (while                                              supplies last) , Uncle Sam Stilt Walker Photo Op, $1.00 Nathan's Hot Dogs ( while supplies last) ; &                                              more! (located on Lawn Area adjacent to Pavilion) August 9:                    National Farmers Market Week (Kids' Craft Station) Stay tuned for more 2025 special events to be announced! FOLLOW ON SOCIAL MEDIA Follow @WinterGardenFarmersMarket on Facebook and Instagram for timely announcements and updates. PET POLICY Well-behaved dogs and cats are welcome at the Winter Garden Farmers Market and must be leashed* AT ALL TIMES . *leash must be no longer than eight feet- (Ord. No. 12-23, § 1, 5-24-12). Pet Policy LOTS TO DO IN HISTORIC DOWNTOWN – Make a Day of It! With all there is to do in historic downtown Winter Garden, extend your outing beyond the Farmers Market to enjoy the quant boutiques, shops, restaurants, bakeries, coffee cafes, museums, and an art gallery that surround the market. Right next to the market, kids will enjoy splashing in the Downtown Interactive Fountain and bring a blanket for a picnic at the adjacent Butterfly Sculpture Park to snack on your market treats. Click here to see all there is to do in historic downtown Winter Garden. VENDOR APPLICATIONS Due to the market's popularity, vendor space is extremely limited. Click here for Vendor Information and Application. Questions, send email to farmersmarket@downtownwg.com . Visit the Winter Garden Farmers Market Website Fridays on the Plaza Winter Garden Farmers Market Downtown Summer Sidewalk Sale & Live Music 2025 - August 2 Back to School Bash 2025- August 2 #CityHallSelfie Day 2025 - August 12 National Night Out 2025 - October 7 Downtown Halloween Activities 2025 Halloween Flix at the Garden 2025 Annual Free Shredding Event 2025 - November 8 Craft Affair 2025 - November 8 Small Business Saturday Sidewalk Sale 2025 - November 29 WHERE GOOD THINGS GROW Contact Us City of Winter Garden 300 W Plant Street Winter Garden, FL 34787 407-656-4111 Quick Links FAQs Resource Directory Staff Directory Community Redevelopment Agency Downtown Winter Garden /QuickLinks.aspx Helpful Links Home Site Map Emergency & After Hours Contacts Accessibility Copyright Notices Terms of Use Memo for City Hall, Police, and Off-Site Records Requests /QuickLinks.aspx Stay Connected Pay Utility Jobs Customer Service Agendas & Minutes Facilities & Rentals Forms CRA Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "text": "Contact Green Garden Group - Landscape company Singapore Skip to content Home Cleaning Services Commercial Cleaning Condominium Cleaning Janitorial Cleaning Services Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services Recruitment Blog Contact Us Home > Contact Us Contact Us Contact Details Main Office: +65 6747 5301 Phone: +65 9880 3799 Phone: +65 8488 5000 EMAIL US enquiries@greengarden.sg Address 2 Sims Close, Gemini@Sims, #06-10, Singapore 387298 Operating hours Monday to Friday: 9am to 5:30pm (office) Monday to Saturday: 8am to 6pm (operations) Sunday and Public Holidays: Closed About us 2 Sims Close, Gemini@Sims, #06-10, Singapore 387298 Operating hours Monday to Friday: 9am to 5:30pm (office) Monday to Saturday: 8am to 6pm (operations) Sunday and Public Holidays: Closed CALL US Main Office: +65 6747 5301 Phone: +65 9880 3799 Phone: +65 8488 5000 EMAIL US enquiries@greengarden.sg Services Janitorial Cleaning Services Commercial Cleaning Condominium Cleaning Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services 2025 © Copyright - Green Garden | All Rights Reserved  | Developed by: Rezolva Pte Ltd Home Cleaning Services Commercial Cleaning Condominium Cleaning Janitorial Cleaning Services Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services Recruitment Blog Contact Us"
    },
    {
      "url": "https://downtownwg.com/winter-garden-heritage-music-festival/",
      "text": "Winter Garden Heritage & Music Festival - Downtown Winter Garden Skip to content Downtown Events 80°F Your Official Guide to Downtown Winter Garden. Explore Shopping Dining & Drinks Arts & Entertainment History & Museums Salons & Spas Winter Garden Farmers Market West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Events News Learn More Parking, Maps & Resources History Explore Shopping Dining & Drinks Arts & Entertainment History & Museums Salons & Spas Winter Garden Farmers Market West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Events News Learn More Parking, Maps & Resources History Activities throughout the Day Music Schedule Downtown Businesses Celebrate our History Heritage Activities Children's Activities Sponsors & Partners Support Arts & Culture Winter Garden Heritage & Music Festival Saturday, November 6 8:00 am – 10:00 pm Downtown Winter Garden & Surrounding Parks In celebration of Winter Garden’s founding 118 years ago, the City of Winter Garden and the Winter Garden Heritage Foundation will host a daylong celebration of the community’s historic roots with old-fashioned family fun. Exhibits and activities will provide an opportunity to learn about the City’s history, play family-friendly games, listen to live music (three stages), enjoy special treats, and watch some baseball. Learn how agriculture along with the railroad, Lake Apopka, and baseball were a big part of Winter Garden’s history. Take a trip back in time and learn about a community that came together to be known as Winter Garden. Discover the city’s history as you take a trip back in time and learn about the community through presentations, interactive programs and displays presented by the Winter Garden Heritage Foundation. In addition to learning about the history of our City, the celebration features numerous activities in the downtown Historic District throughout the day, including five (5) stages featuring high caliber musicians. In addition to the main stage locations, there will be many of our restaurants and businesses featuring entertainment throughout the day and evening. Beyond the main downtown corridor, there will be family fun day activities (adult and youth) at our Sam Walker Little League and Walker Field Complexes and Veterans Park, including baseball, softball, football, volleyball, soccer, pickle ball, field games, and other children’s activities. Come and enjoy a full day of family oriented activities. Stay tuned for details on how to participate, as well as, a complete schedule of activities and entertainment. A concert will be presented for all to enjoy at the end of the day’s activities. Brought to you by the City of Winter Garden and the Winter Garden Heritage Foundation and other generous partners. Plan on spending the day celebrating and enjoying all the festivities. All day and evening activities on Saturday, November 6, will be held rain or shine. All activities are family-friendly and most are free. The City of Winter Garden is actively monitoring the incidence of COVID-19 in our region and is following guidance from local health departments and the Centers for Disease Control and Prevention (CDC) regarding gatherings. The City reserves the right to institute necessary changes to these activities to ensure the public health, safety, and welfare of our citizens. Activities throughout the Day Heritage Tree Tour – brought to you by the Bloom and Grow Garden Society and the Winter Garden Heritage Foundation When: Meet at Winter Garden Heritage Museum at 8:30am on November 6 with good walking shoes.  This will be a 2-mile walking tour that will end at City Hall around 10:30 am. Where: Throughout Downtown The Bloom & Grow Garden Society working with the City of Winter Garden launched the Winter Garden Heritage Tree Project in 2021.  From a list of over 100 trees throughout Winter Garden and with the support of Healthy West Orange and the Winter Garden Heritage Foundation, the “Winter Garden Heritage Tree Walking Tour” was created in the historic district.  This will be a guided walk of 2 miles and 56 trees starting at the Winter Garden Heritage Museum and ending at City Hall on Plant Street.  Labels have been placed on many of the trees with a QR code that allows you to access information about the tree as well as historic information about Winter Garden and its people.  A self-guided Heritage Tree Walking Tour brochure will be given to each attendee.  We encourage you to join our tour and meet some of the grand old trees of Winter Garden. Contact – Jim Crescitelli, Winter Garden Heritage Foundation- 407-656-3244 Good Old Fashioned Family Fun for all Ages Where :  Sam Walker Sports Complex and Veterans Park When :  Festivities begin at 8:00 am and end at 4:00 pm Description : Baseball, softball, field games, children’s activities, live music and food for the family Family Concert with Hello Sister starts at 5 pm at the Senior Field 2021 Donut Dash 5K hosted by WGPAL When: Saturday, November 6, 8:00 am Where:  T his year’s Donut Dash 5K will take place in historic Winter Garden as you start and finish at Lake Apopka. Description: We will have music, kids fun run, t-shirts, medals, Krispy Kreme Donuts, and best donut costume prize. For more information, visit us at Sommer Sports:  www.runsignup.com or please call 407-656-3636 ex. 5416 Bag giveaways by Healthy West Orange Fall Festival and the Arts – Presented by the Winter Garden Masonic Lodge, Benefiting Local Charities The Annual Fall Festival is back! The Winter Garden Masonic Lodge is hosting the festivities for families with kids of all ages. There will be face painting, games, art, food and lots of family fun! Don’t forget to take a hay ride with your family or make some fun memories by taking photos in our seasonal photo booth. There will also be a silent auction to benefit the local charities here in Winter Garden. When – Saturday, November 6, 11:00 am to 4:00 pm Where – The Winter Garden Masonic Lodge, 230 W. Bay Street, Winter Garden Contact – Karen McGowan by email karenart@yahoo.com Health & Harvest Festival brought to you by Healthy West Orange Where: Winter Garden Farmers Market When: Saturday, November 6, 8:00 am – 1:00 pm Description: Enjoy family fun games, fall themed activities, fitness and cooking classes and much more at the annual Health and Harvest Festival brought to you by Healthy West Orange.  There will be complimentary health screenings, music and more! Lawn Games at the Farmers Market Large family games will be played on the lawn at the Pavilion. Downtown Pavilion, 104 S. Lakeview Ave. Saturday, November 6, 10:00 am – 12:00 pm Music Schedule There will be five main stages along with small venues throughout Downtown.  There will be music from all genres starting at 1 pm and ending at 10 pm. Headliners include Selwyn Birchwood, Michael Andrew & Swingerhead, Spazmatics, Marlow Rasado and Paint it Black Quartet. Please check back for the full music schedule. Downtown Businesses Celebrate our History Downtown Merchants Celebrate Local History Businesses will have live music, local art and historic photos on display. Business hours vary. Crooked Can Brewing Company/Plant Street Market – live music throughout the day The Deli Downtown Doxology Driftwood Market Garden Theatre Garden Music School Melts on Main Pilars Loft Plantation Jewelers Rosallie Le French Cafe Rita’s Italian Ice & Frozen Custard Ruby and Rust The Sacred Olive Shoo Shoo Baby Boutique Sweet Dee’s Cupcakery The Whole Enchilada Writer’s Block Bookstore Urban Flats Winter Garden Wheel Works Heritage Activities Heritage Tree Tour – brought to you by the Bloom and Grow Garden Society and the Winter Garden Heritage Foundation When: Meet at Winter Garden Heritage Museum at 8:30am Nov 6 with good walking shoes.  This will be a 2 mile walking tour that will end at City Hall around 10:30am. Where: Throughout Downtown The Bloom & Grow Garden Society working with the City of Winter Garden launched the Winter Garden Heritage Tree Project in 2021.  From a list of over 100 trees throughout Winter Garden and with the support of Healthy West Orange and the Winter Garden Heritage Foundation, the “Winter Garden Heritage Tree Walking Tour” was created in the historic district.  This will be a guided walk of 2 miles and 56 trees starting at the Winter Garden Heritage Museum and ending at City Hall on Plant Street.  Labels have been placed on many of the trees with a QR code that allows you to access information about the tree as well as historic information about Winter Garden and its people.  A self guided Heritage Tree Walking Tour brochure will be given to each attendee.  We encourage you to join our tour and meet some of the grand old trees of Winter Garden. Contact – Jim Crescitelli, Winter Garden Heritage Foundation- 407-656-3244 Children's Activities Lawn Games at the Farmers Market Large family games will be played on the lawn at the Pavilion. Downtown Pavilion, 104 S. Lakeview Ave. Saturday, November 6 from 10:00 am – 12:00 pm Good Old Fashioned Family Fun for all Ages Where :  Sam Walker Sports Complex and Veterans Park When :  Festivities begin at 8 am to 5 pm Description : Baseball, softball, field games, children’s activities, live music and food for the family Fall Festival and the Arts – Presented by the Winter Garden Masonic Lodge The Annual Fall Festival is back! The Winter Garden Masonic Lodge is hosting the festivities for families with kids of all ages. There will be face painting, games, art, food and lots of family fun! Don’t forget to take a hay ride with your family or make some fun memories by taking photos in our seasonal photo booth. Health & Harvest Festival brought to you by Healthy West Orange Where: Winter Garden Farmers Market When: Saturday, November 6, 8 am – 1 pm Description: Enjoy family fun games, fall themed activities, fitness and cooking classes and much more at the annual Health and Harvest Festival brought to you by Healthy West Orange.  There will be complimentary health screenings, music and more! Sponsors & Partners Presenters Partners Support Arts & Culture How can I show support year-round to the Local Arts? Winter Garden has many organizations dedicated to arts and culture.  Here are seven ways to support local art in your community.  A good first start to learn about these organizations.    Click on the organizations below to learn more. 1. Donate to a local arts organization WG Heritage Foundation Garden Theatre WG Art Association Crealde School of Art – Winter Garden Programming Bloom and Grow Garden Society Monarch Butterfly Project 2. Become a member of a local cultural arts organization 3. Attend the array of local events hosted by these organizations 4. Buy local art 5. Support local programs and schools 6. Plan on attending the November 6th celebration – Winter Garden Heritage & Music Festival 7.Become a volunteer for one of these organizations. Additional Ways to Support Local Arts: Buy a ticket for Big, the Musical November 19 – December 19, 2021 Matinee and Evening Performances Tickets start at $25.  Purchase tickets here Purchase an engraved brick to support Winter Garden Heritage Foundation Purchase an engraved brick at SOBO Sign up for Volunteer opportunities Become a Member of the Winter Garden Arts Association Follow on Social Media: Facebook Instagram Sign up to receive Winter Garden Heritage Foundation newsletter Sign up to receive SOBO newsletter Please follow us on social media to be the first to hear the official news, travel ideas, new local experiences, and special offers Downtown! Explore Events Shopping Dining & Drinks Arts & Entertainment Farmers Market History & Museums Salons & Spas West Orange Trail Parks & Recreation Places to Stay Beyond Downtown Learn More Downtown Winter Garden News Parking, Maps & Resources City of Winter Garden Economic Development Terms of Use Sitemap Contact Us City of Winter Garden 300 West Plant Street (407) 656-4111 Stay Connected City of Winter Garden © 2023. All Rights Reserved. All other marks belong to their respective owners. Site by Alarie Design Subscribe * indicates required First Name Email Address * I am a.... Resident Local Business Owner Visitor"
    },
    {
      "url": "https://issuu.com/wotimes/docs/lm_20220714/s/16336989",
      "text": "WINTER GARDEN - Issuu Issuu Search Show submenu for \"Read\" section Read Articles Browse short-form content that's perfect for a quick read Issuu Store Purchase your next favourite publication Categories Arts and Entertainment Religion and Spirituality Business Science Education Society Family and Parenting Sports Food and Drink Style and Fashion Health and Fitness Technology Hobbies Travel Home and Garden Vehicles Pets All Categories Show submenu for \"Features\" section Features Flipbooks Transform any piece of content into a page-turning experience. Fullscreen Sharing Deliver a distraction-free reading experience with a simple link. Embed Host your publication on your website or blog with just a few clicks. Articles Get discovered by sharing your best content as bite-sized articles. Statistics Make data-driven decisions to drive reader engagement, subscriptions, and campaigns. Teams Enable groups of users to work together to streamline your digital publishing. Social Posts Create on-brand social posts and Articles in minutes. GIFs Highlight your latest work via email or social media with custom GIFs. Add Links Send readers directly to specific items or pages with shopping and web links. Video Say more by seamlessly including video within your publication. Digital Sales Sell your publications commission-free as single issues or ongoing subscriptions. QR Codes Generate QR Codes for your digital content. More Features Integrations Canva Create professional content with Canva, including presentations, catalogs, and more. HubSpot Embed, gate, and track Issuu content in HubSpot marketing campaigns. Adobe Express Go from Adobe Express creation to Issuu publication. Adobe InDesign Design pixel-perfect content like flyers, magazines and more with Adobe InDesign. Show submenu for \"Use Cases\" section Use Cases Industry Art, Architecture, and Design Education Internal Communications Marketing and PR Nonprofits Publishing Real Estate Retail and Wholesale Travel and Tourism More Industries Role Content Marketers Designers Publishers Salespeople Social Media Managers Teams Content Type Flipbook Portfolio Digital Magazine Digital Flipbook PDF to Flipbook Newspaper Digital Book Digital Lookbook More Content Types Show submenu for \"Learn\" section Learn Blog Welcome to Issuu’s blog: home to product news, tips, resources, interviews (and more) related to content marketing and publishing. Help Center Here you'll find an answer to your question. Webinars Free Live Webinars and Workshops. Resources Dive into our extensive resources on the topic that interests you. It's like a masterclass to be explored at your own pace. Pricing Log in Sign up 7 minute read WINTER GARDEN from Local Motion 2022 by Orange Observer Next Article DR. PHILLIPS Charm Blooms from City’s Citrus History The city with a 'juicy past' blends historic heritage and modern living. Attracted by the fertile muck land that bordered Lake Apopka, settlers began arriving in the Winter Garden area by the 1850s. Newcomers engaged in citrus and vegetable farming, and lived in small settlements situated along the lake’s south shore. By the end of the 19th century, Winter Garden’s business district had grown alongside the two railroad lines that ran through the city. The commercial buildings were rebuilt with brick after two fires destroyed the wooden buildings and packinghouses that stood along Plant and Main streets. Winter Garden was established in 1903 and incorporated as a city in 1908. The population of Winter Garden had grown to more than 1,000 people by 1920, and the city quickly became the center of commerce and agriculture in West Orange County. Lake Apopka’s emergence as “the large-mouth bass capital” attracted tourists, and the Edgewater Hotel opened in 1927 to accommodate these visitors. Early residents either owned or worked in the groves. As the citrus industry grew in importance and acreage, the commercial district continued to expand. Winter Garden’s rapid development slowed considerably in the late 1960s. Lake Apopka had become severely polluted, and the construction of major highways in the area drew businesses away from downtown. Despite the challenges, Winter Garden’s architectural heritage remained intact.The establishment of the West Orange Trail attracted thousands of visitors eager to patronize the new shops and restaurants that moved into the old buildings. Today, Winter Garden’s Historic District serves as a successful example of historic preservation. Infill development, redevelopment, repurposed buildings, preservation, housing and businesses all converge to create a thriving downtown that draws people from around the world. WINTER GARDEN SUMMER All-American Kids Parade. A family favorite, this patriotic parade encourages children to decorate their bikes, scooters and wagons in red, white and blue for a spirited stroll through downtown Winter Garden. Winter Garden Fireworks Display. End the Fourth of July holiday with a bang by taking in a fireworks display on Lake Apopka. Families bring chairs and blankets to take in the sparkling spectacle. FALL Halloweenfest. The city of Winter Garden’s Halloweenfest offers children a chance to trick or treat down Plant Street, and features live entertainment, local vendors and family activities. WINTER Christmas Golf Cart Parade. To celebrate the holidays, residents deck out their golf carts in true Christmas spirit and travel along golf cart-approved streets to spread cheer in downtown Winter Garden. City of Winter Garden Christmas Parade. Kick off the holiday season with a jolly parade through Winter Garden. Local organizations, clubs, bands and businesses come together for some spirited fun. Route may vary. Light Up Winter Garden. One of the hallmark events of the holiday season, thousands head over to Plant Street each year to take in the lighting of the city’s Christmas tree and enjoy the festivities. n A.B. Newton published the city’s first newspaper, The Ricochet, and was the first mayor, postmaster and storekeeper. He owned the only imposing brick building in town, and his general store carried most every kind of merchandise. He also operated a packinghouse and sold crate material and fertilizer to growers. n William S. and Juanita Maxey were longtime teachers dedicated to the education of children in east Winter Garden. n Henry Bradley Plant was the founder and president of the Plant System of railways, steamship lines and hotels. He developed and promoted the west coast and central sections of Florida. Plant Street in downtown Winter Garden is named for him. n The Luther Fuller Tilden family and descendants had a great impact on West Orange County. Several streets, an elementary school and a small community are named for the Tildens. Generations of the family were involved in the lucrative citrus business, and many of them lived in the Tildenville area. n The King family story began in Winter Garden in the 1920s, when Jimmy King’s cousin moved to the area and owned a restaurant and boardinghouse on 10th Street. Charles Alexander King was hired in 1967 as the first black officer with the city’s police department. Jimmy and Eddie Mae King established roots here, and many of their descendants continue to break barriers. n William Lasenby Story Sr. arrived in the 1880s and lived one mile south of Winter Garden. He was publisher of the West Orange News and owned extensive citrus groves. Story Road is named after him. Let my 30 years of experience assist you in selling or buying your Home. REALTOR ® kelly@kelsellsorlando.com • 407-970-6298 326 S Dillard St., Winter Garden 407-970-6298 380618-1 WINTER GARDEN Mayor John Rees Rees has served as mayor of Winter Garden for 14 years and was a city commissioner for 12 years prior. He also has served on boards of the city’s Planning & Zoning Board, as well as the West Orange Chamber of Commerce, Little League, YMCA, Health Central, Lake Apopka Natural Gas and the Winter Garden Heritage Foundation. The lifelong resident of Winter Garden graduated from Lakeview High School in 1967. District 1 Commissioner Lisa Bennett Bennett is a lifelong resident of Winter Garden. She graduated in 1981 from Calvary High School and attended Valencia Community College. She has been a real-estate broker for 25 years and co-owner/broker of Windsor Realty Group Inc., Winter Garden, for 18 years. Bennett has served District 1 for five years and formerly served on the city’s Architectural Review Board. District 2 Commissioner Ron Mueller Mueller is a graduate of Florida State College in Jacksonville, majoring in business, and served eight years in the U.S. Navy on both Fast Attack and Trident II nuclear submarines. An Indiana native, he served two terms as alderman in the St. Louis area before returning to Florida. He is currently employed at Walt Disney World as chief of staff for corporate, where he oversees architecture and standards across the company. District 3 Commissioner Mark A. Maciel Maciel came to Winter Garden in 1998 from Rhode Island with his wife, Justine, and two children. His third child was born in Winter Garden. In Rhode Island, he served as a law-enforcement officer with the Department of the Air Force and worked in a family business. Having been a paratrooper and then an Air Force Reservist, he served 32 years in the military and was activated multiple times after the events of 9/11. District 4 Commissioner/ Mayor Pro-Tem Colin Sharman Sharman served the citizens of Winter Garden as commissioner since 2006. He is an account manager for Trane US Inc. and a certified mechanical contractor. He was on the city’s Planning & Zoning Board from 200506 and is a past board director of Florida League of Cities, Roper YMCA Indian Guides, Florida Health Care Association and Advent Health Winter Garden Advisory Council. City Manager Jon C. Williams Williams has been with the city of Winter Garden since early 2018. He became city manager in 2021 after serving as assistant city manager of public services. Previously, Williams was the city manager of Longwood and had served as its finance director. He also served as both city manager and finance director for Edgewater. Williams is a graduate of the University of Central Florida, from which he earned a bachelor's degree in business administration. WELCOME TO WINTER GARDEN Welcome to the city of Winter Garden! The city’s unique combination of small-town charm, combined with family-friendly amenities, makes it an ideal location to live and work. Its appeal and desirability is recognized nationally, including being named one of the “Best Places to Live in America” by Money magazine. Winter Garden embodies a wealth of historical, cultural and natural assets that provide a high quality of life. Its brick-lined, walkable downtown provides a mix of restaurants, retail shops, museums, an art gallery, a theater and landmarks, as well as an interactive fountain and recreational parks. The award-winning West Orange Trail winds through the heart of our downtown, and, every Saturday, an award-winning Farmers Market provides a community hub. The city is committed to delivering top-notch customer service to our more than 49,000 residents and 2,000 businesses. In fact, we are a proud recipient of the 2020 National Voice of the People Award given to the top 10 jurisdictions nationwide for achieving excellence. Once again, welcome and enjoy Winter Garden, where good things grow. — Mayor John Rees SERVICE WITH A SMILE n Winter Garden City Hall: 300 W. Plant St., (407) 656-4111 n Cable/internet: Spectrum, (407) 291-2500; DIRECTV, (866) 906-2621; DISH, (844) 306-7067; AT&T, (866) 817-0776; CenturyLink, (877) 862-9343; EarthLink, (844) 903-3107 n Power/electric: Duke Energy, (800) 700-8744 n Fire: Winter Garden Fire Rescue Department, (407) 877-5175 n Police: Winter Garden Police Department, (407) 656-3636 n Solid waste: City of Winter Garden, (407) 656-4111, Ext. 2009 n Utilities (water, sewer) Winter Garden Water Department, (407) 656-4100 More articles from this publication: DR. PHILLIPS 5min pages 24-26 OCOEE 7min pages 16-17 SCHOOLS 21min pages 42-55 HEALTH CARE 3min page 41 LOCAL FLAVOR 2min pages 56-57 WINDERMERE 7min pages 20-21 GOTHA 3min pages 18-19 TEN TO ATTEND 3min pages 30-31 HORIZON WEST 6min pages 14-15 Show more This article is from: Local Motion 2022 Issuu Issuu Inc. Create once, share everywhere. Issuu turns PDFs and other files into interactive flipbooks and engaging content for every channel. English Deutsch Company About us Careers Plans & Pricing Press Blog Contact Issuu Platform Content Types Features Flipbook Industries Resources Developers Publisher Directory Redeem Code Terms Privacy Report Content DMCA DSA Accessibility Cookie Settings"
    },
    {
      "url": "https://www.cwgdn.com/175/City-Manager",
      "text": "City Manager | Winter Garden, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Departments Residents Business Things to Do Home Departments Administration City Manager City Manager Jon C. Williams City Manager Email Phone: 407-656-4111, ext. 2267 Jon C. Williams has been with the City of Winter Garden since early 2018, becoming its City Manager in 2021 after serving as Assistant City Manager of Public Services. As head of the Public Services Department, Williams oversaw garbage and recycling, utilities, engineering, streets, storm water and water conservation programs, capital improvements, and the city’s cemetery. Under his tenure, a number of capital improvements have been made including the construction of a new water storage and pumping facility, an expansion of a wastewater reclamation facility, road improvements throughout the city, as well as the planning of the reconstruction of Dillard Street that serves as the entry point to the city’s historic downtown. Williams previously served twice as a city manager before coming to Winter Garden. He was the city manager of Longwood from 2011-2018 after being their finance director for three years. Prior to that, he was the city manager of Edgewater from 2006-2007 after serving as their finance director for nearly five years. He also possesses extensive experience in the public and private sector and is well versed in a variety of city government positions having worked in the past as a code compliance officer, a wastewater plant operator, and as a utility service worker. Williams is a graduate of the University of Central Florida where he earned a Bachelor of Science in Business Administration. Contact Us City Manager Physical Address 300 W Plant Street Winter Garden , FL 34787 Phone: 407-656-4111 Directory City Manager Communications & Marketing Human Resources Fleet Facilities Fiscal Management Information Technology WHERE GOOD THINGS GROW Contact Us City of Winter Garden 300 W Plant Street Winter Garden, FL 34787 407-656-4111 Quick Links FAQs Resource Directory Staff Directory Community Redevelopment Agency Downtown Winter Garden /QuickLinks.aspx Helpful Links Home Site Map Emergency & After Hours Contacts Accessibility Copyright Notices Terms of Use Memo for City Hall, Police, and Off-Site Records Requests /QuickLinks.aspx Stay Connected Pay Utility Jobs Customer Service Agendas & Minutes Facilities & Rentals Forms CRA Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.wintergardencra.com/637/Downtown",
      "text": "Downtown | Winter Garden, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents About Projects & Programs Downtown East Winter Garden City Home Home Business Community Redevelopment Agency Downtown Downtown Downtown Winter Garden is well-known for its quaint, historic charm and is designated on the National Registry of Historic Places. The railroad tracks that once ran right through the center of the city have made way for a linear park and bike trail that breathes life into a revitalized downtown, bringing 1.4 million visitors every year. Downtown features a vast array of small boutique shops and restaurants, heritage and art museums, and the award-winning Garden Theatre. In addition to complimentary recreational and cultural amenities, breathtaking picturesque downtown is embellished with colorful flowers and landscaping, brick-lined streets, and a streetscape that tells a story about a community’s history and character. To learn more about downtown’s small-town charm and all that downtown has to offer, please visit the City-managed Official Downtown Winter Garden website, www.downtownwg.com . To see the calendar of events, please click here . The City manages a social media presence for historic downtown and downtown’s weekly award-winning Winter Garden Farmers Market to provide timely news and announcements: @OfficialDowntownWinterGarden on Facebook and Instagram @WinterGardenFarmersMarket on Facebook and Instagram Click below to see what is happening LIVE in Downtown Winter Garden: About Projects & Programs Downtown East Winter Garden City Home WHERE GOOD THINGS GROW Contact Us Marc O. Hutchinson Economic Development Director 407-656-4111 ext. 2306 Email Eric Fischer Economic Development & Downtown Manager 407-656-4111 ext. 2266 Email 300 W Plant Street Winter Garden, Florida 34787 Quick Links Annual Reports Board and Meeting Information Budget and Financial Documents History Important Maps Planning Documents Projects & Programs /QuickLinks.aspx Helpful Links Home Site Map Emergency & After Hours Contacts Accessibility Copyright Notices Terms of Use Memo for City Hall, Police, and Off-Site Records Requests /QuickLinks.aspx Stay Connected Pay Utility Jobs Customer Service Agendas & Minutes Facilities & Rentals Forms Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.cwgdn.com/317/Customer-Service",
      "text": "Customer Service  | Winter Garden, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Departments Residents Business Things to Do Home Residents Customer Service Customer Service Emergency Contacts For After-Hours and Weekend Utility Emergencies (Water Leaks, Sewer Back-Ups, Broken Water or Sewer Pipes, Flooding and No Water Service), call 321-436-4559 During Hours of Operation, call 407-656-2256 Police Department Non-emergencies call 407-656-3636 . Contact Us Do you need to make a request? There are many ways to reach us! Submit a question or request online below Call 407.656.4111 Visit the Staff Directory Hours of operation: Monday through Friday, 8:00 am to 5:00 pm, excluding holidays. Service Work Requests · Potholes     ·Leaky Hydrant     ·Damaged Street Signs     ·Broken Street Lights T wo ways to report a service concern and receive prompt assistance: 1. Submit a service work request/question online by clicking the link below or to check on the status of ongoing request. Join the community today! 2. Download our Mobile Citizen App to your personal device for an even more convenient and connected experience to address your service needs. In 3 easy steps, you are a fingertip away from making a real impact in our community: Identify service need Describe location Take a photo Download Your Mobile Citizen App Today! Download Instructions and Use * As of July 1st, 2021, Florida law prohibits code inspectors from starting an investigation for potential codes or ordinance violations based on an anonymous complaint. The law now requires persons reporting potential violations to provide contact information before an investigation can begin.  Please be sure to provide your name and address when filing a complaint with Code Compliance. Contact Us Community Relations Physical Address 300 W Plant Street Winter Garden , FL 34787 Phone: 407-656-4111 Directory Utility Billing Physical Address 300 W Plant Street Winter Garden , FL 34787 Phone: 407-656-4100 Emergency Phone: (After Hours/Weekends) 321-436-4559 Hours Monday - Friday 7:30 a.m. - 5:30 p.m. Customerservice@cwgdn.com Phone Payments 407-656-5437 Utility Emergencies Monday - Friday after 5:00 pm and Weekends 321-436-4559 Directory Alerts City Citizen Programs (Free) Communications & Marketing City Contacts Reference Card Customer Service Waste Collection Golf Cart Information Parks & Recreation Pay Utility Bill Resource Directory Special Events Updates & News Utility Billing WHERE GOOD THINGS GROW Contact Us City of Winter Garden 300 W Plant Street Winter Garden, FL 34787 407-656-4111 Quick Links FAQs Resource Directory Staff Directory Community Redevelopment Agency Downtown Winter Garden /QuickLinks.aspx Helpful Links Home Site Map Emergency & After Hours Contacts Accessibility Copyright Notices Terms of Use Memo for City Hall, Police, and Off-Site Records Requests /QuickLinks.aspx Stay Connected Pay Utility Jobs Customer Service Agendas & Minutes Facilities & Rentals Forms CRA Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://downtownwinnipegbiz.com/join-us/",
      "text": "Join Our Team | Downtown Winnipeg BIZ Skip to content Join Our Team Media Centre Contact Us Search Search for: Find It Downtown Getting Around What’s Happening For Business Who We Are What We Do Find It Downtown Getting Around What’s Happening For Business Who We Are What We Do Join Our Team Media Centre Contact Us Search Search for: Downtown Winnipeg BIZ Events Community Events News Join Our Team Are you passionate about creating a vibrant and inclusive downtown? Join our team and be a part of the exciting changes happening in downtown Winnipeg. CAREER OPPORTUNITIES VOLUNTEER OPPORTUNITIES Whether we’re helping keep downtown clean and safe or putting on events that attract thousands to our city’s core, we’re united by the same mission: promoting, caring and advocating for a vibrant and inclusive downtown where business thrives and people are drawn to live, shop and explore. The Downtown Winnipeg BIZ is committed to offering competitive non-profit sector salaries and an innovative and collaborative work environment in an organization that cares about meeting the needs of our members and downtown community. DIVERSITY AND INCLUSION We welcome candidates of all backgrounds and strive to attract an inclusive and diverse board of directors, staff and volunteer team. We believe that the work we do in downtown Winnipeg starts with a workplace that reflects the community that we serve and where everyone feels welcome and safe. Career Opportunities Manager, Policy and Economic Development Volunteer Opportunities Downtown Winnipeg BIZ Board position Stay In Touch SIGN UP FOR UPDATES FROM DOWNTOWN WINNIPEG BIZ Email: * First Name: Last Name: 2 days ago 5 days ago 6 days ago 7 days ago Follow us on Social Media FIND US 204.958.4640 info@downtownwinnipegbiz.com 426 Portage Avenue Winnipeg Manitoba Canada R3C 0C9 Office Hours Monday – Friday 8:30 a.m. – 4:30 p.m. LINKS Find It Downtown Getting Around What We Do Who We Are INFORMATION Media Centre For Business Join Our Team Accessibility © Downtown Winnipeg BIZ Copyright 2025 • Privacy Policy Our downtown is on Treaty No. 1 territory and the National Homeland of the Red River Métis. BIZ Members by Category Note: A Downtown Winnipeg BIZ member is a for-profit business located within the Downtown Winnipeg Business Improvement Zone. Membership is automatic upon starting operations in the zone and includes access to our programs, services, and advocacy efforts. As a result, the following categories are exclusive to for-profit organizations within the Downtown Winnipeg BIZ zone. Not-for-profit organizations, Crown Corporations, and Government Institutions that offer services within these categories are not included. × BIZ Neighbourhoods on Maps The Downtown Winnipeg BIZ is divided into seven zones each with its own unique characteristics. 1 – North Main 2 – Chinatown 3 – North of Portage 4 – Downtown East /The Forks 5 – University of Winnipeg Area 6 – The SHED (Sports, Hospitality, Entertainment District) 7 – Broadway – Assiniboine × Business Activity - Year-to-Date Year-to-date data represents the cumulative total from January of the current year up to the present date. The enclosed data is subject to change as additional business openings or closures may still be captured in the coming weeks or months. Business activity is tracked by our Downtown Winnipeg BIZ Ambassadors who capture business openings, closures, and moves during their routine member check-ins. × Business Activity - Monthly Monthly business activity data is updated in the first week of each month and reports on the previous month’s activity. The enclosed data is subject to change as additional business openings or closures may still be captured in the coming weeks or months. Business activity is tracked by our Downtown Winnipeg BIZ Ambassadors who capture business openings, closures, and moves during their routine member check-ins. × Visitation Data Visitation is tracked using cellular network data from individuals who enter the zone. This data reflects visits specifically to the Downtown Winnipeg BIZ area and does not represent all of downtown Winnipeg. × Example Additional Information Ea ut quo quibusdam sequi reprehenderit aut nemo. Quas dolor molestiae cumque et. Minus doloribus qui eligendi. Ut quibusdam dolor quibusdam non sit neque. Learn More ×"
    }
  ]
}