{
  "fuentes": [
    {
      "url": "https://fourshellskava.co.nz/pages/about",
      "email": "info@fourshellskava.co.nz"
    },
    {
      "url": "https://kavadigitalmarketing.com/contact-us/",
      "email": "david@kavadigitalmarketing.com"
    },
    {
      "url": "https://kavadigitalmarketing.com/contact-us/",
      "email": "info@starianconsulting.com"
    },
    {
      "url": "https://downtownkava.com/contact-us",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://kava.com/contact-us/",
      "email": "shop@kava.com"
    },
    {
      "url": "https://kavacoffee.com/contact/",
      "email": "sales@kavacoffee.com"
    },
    {
      "url": "https://kavahana.com/",
      "email": "orders@kavahana.com"
    },
    {
      "url": "https://kavahana.com/",
      "email": "orders@kavahana.com"
    },
    {
      "url": "https://downtownkava.com/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://ekava.com/pages/contact",
      "email": "sales@lamikava.com.fj"
    },
    {
      "url": "https://ekava.com/pages/contact",
      "email": "sales@lamikava.com.fjtelephone"
    },
    {
      "url": "https://downtownkava.com/events-page",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://downtownkava.com/faq",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://kava-agency.com/about-us/",
      "email": "join@kava-agency.com"
    },
    {
      "url": "https://www.kavaindavie.com/about-us/",
      "email": "sales@ilccreative.com"
    }
  ],
  "mails": [
    "david@kavadigitalmarketing.com",
    "info@fourshellskava.co.nz",
    "info@starianconsulting.com",
    "join@kava-agency.com",
    "orders@kavahana.com",
    "sales@ilccreative.com",
    "sales@kavacoffee.com",
    "sales@lamikava.com.fj",
    "sales@lamikava.com.fjtelephone",
    "shop@kava.com",
    "team@latofonts.com"
  ],
  "nombre_sitio": "downtownkava.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fourshellskava.co.nz/pages/about",
      "text": "Four Shells Kava Lounge – Opening Soon Opening Soon We're updating our website - a fresh new look, a bigger range, and more resources coming your way soon! If you would like to stay in the loop, sign up to our newsletter below. • Enter store using password • Join Our Community Spread the Word © 2025\n          Four Shells Kava Lounge. Website Design by Rhea DM - Ecommerce Development . This shop will be powered by Shopify Password Are you the store owner? Log in here or change your password settings Join The Community Sign up to our emails for all the latest workshops, product drops and news."
    },
    {
      "url": "https://kavadigitalmarketing.com/contact-us/",
      "text": "Contact Us - Kava Digital Marketing Home Contact Us Menu Home Contact Us contact us Ready to take your business to the next level? Get in touch for a complimentary review and consultation Inquiry Form Full Name Email Company Name Phone Number How can we help your business? Submit david@kavadigitalmarketing.com 847-772-4326 Get In Touch Email:  david@kavadigitalmarketing.com Phone: 847-772-4326 Subscribe to our newsletter for business insights & tips Email Subscribe Follow us Facebook Copyright 2024 Kava Digital Marketing"
    },
    {
      "url": "https://downtownkava.com/contact-us",
      "text": "Downtown Kava Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? More Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Contact Us OPEN NOW! We'd love to meet you! Come check us out! Downtown Kava 1009 Taylor Road, Punta Gorda, Florida 33950, United States Bar Line: (941) 505-0562 Manager/Events: Sarah Desrosiers (941) 203-9046 -Call or Text DowntownKavaPG@gmail.com Drop us a line! Drop us a line! Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Get directions FOLLOW US FOR FOOD TRUCK AND EVENTS SCHEDULE Downtown Kava-1009 Taylor Road, Punta Gorda, Florida 33950, United States 941-505-0562 Copyright © 2025 Downtown Kava - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://kava.com/contact-us/",
      "text": "The Many Ways to Contact Kava.com | Kava.com Skip to content Shop My Account Orders Shop My Account Orders $ 0.00 0 Cart Search Products... Home Shop Now Categories KAVA ROOT POWDER Accessories Blends by Effect Instant Kava Drinks Kava Blends Kava Capsules Kava Extracts Kava Tinctures Kava Tea Kavalactone Paste Kona Coffee Sampler Packs Wholesale Kava Brands Florascience Happy Kava Brand Kava Dot Com Kona Kava Farm Kava Supplies Yogi Tea Kava Library FAQ’s Contact Us Menu Home Shop Now Categories KAVA ROOT POWDER Accessories Blends by Effect Instant Kava Drinks Kava Blends Kava Capsules Kava Extracts Kava Tinctures Kava Tea Kavalactone Paste Kona Coffee Sampler Packs Wholesale Kava Brands Florascience Happy Kava Brand Kava Dot Com Kona Kava Farm Kava Supplies Yogi Tea Kava Library FAQ’s Contact Us Call or TEXT us at (716) 989-5577 | WHOLESALE KAVA INFO We love to talk Kava, so feel free to contact us by the various methods on the right or through our Contact Form below.  We wouldn’t be here if it weren’t for you, so let us help fill your Kava needs and answer all your Kava questions! Key Info You can check order status 24/7 through YOUR ACCOUNT . Specialists are also available to answer product inquiries, place orders, and look up account information Monday through Friday, 8:00AM – 3:30PM Pacific time. You can also call us at (716) 989-5577 or Email Us using the form above. TEXT/SMS: (716) 989-5577 Phone: (716) 989-5577 Email: [email protected] Mood: Feeling groovy! Product Returns You are happily covered by our 100% Satisfaction Guarantee.  Return any product you’ve purchased here to our California Fulfillment Center (conditions applying): KV Naturals, Inc. 10 Center Rd, Ste 1 West Seneca, NY 14224 Contact Us Name * First Last Email * Enter Email Confirm Email Phone Preferred Contact Method Email Phone Questions / Comments / Suggestions * Phone This field is for validation purposes and should be left unchanged. Δ PLEASE REMEMBER: We truly are here for you and can resolve ANY issue you might have far more satisfactorily than starting a Dispute on PayPal or calling your credit card company to file a chargeback.  Email me directly at [email protected] , and I will respond within 24 hours or less.  Or, call me directly at (716) 989-5577 anytime.  I check voice mails 18 hours a day, so even if we’re closed, I’ll still get your email or voice mail. Subscribe To Our Newsletter Join our mailing list to receive the latest news and updates from our team. Mailing List EMMA First Name (Required) Last Name (Required) Email (Required) Δ Everyone says they don’t share your data, but we really don’t. We’re also online shoppers, and I can’t stand when a catalog appears with products similar to what I just purchased at another store. So, we respect your privacy as we respect our own, and thank you for signing up! KAVA.COM – WE ARE KAVA We are often adding and updating our information in an effort to be your most complete source of kava information available. We have a more complete history of Kava than anyone else we’ve seen, and hope to continue adding more information as we travel the world in search of it. If you’re interested in more than just the history of Kava, you can click on our “Where to Buy Kava” link to see our personal opinions on this important question. Yes, our opinions change, but it’s only because we are so passionate about this ancient plant with so many pleasurable uses, from reducing inhibitions, to helping with sleep or back pain, to reducing anxiety, to helping create a general sense of well-being, safely and effectively.* If you have useful articles you would like to contribute to this website, please send us an e-mail with a link or the article itself, and we will publish it with your name or the authors name on it, and give you 2 free pounds of our favorite powdered kava root as a thank you. Kava Dot Com is owned by: KV Naturals, Inc. d.b.a. KavaDotCom d.b.a. KonaKavaFarm 10 Center Rd, Ste 1 West Seneca, NY 14224 WHAT ABOUT WHOLESALE? We sure do and we love being the best Kava Wholesaler you’ll ever find! Wholesale products include both Kona Kava Farm and Kava.com products.  You can find wholesale products in the WHOLESALE KAVA category of our store. We have special accounts and pricing for Kava Bars as well. Our Do You Wholesale? page may answer all your wholesale questions as well. Or, if you’re excited to get started or like interacting with an actual human, please contact us at (716) 989-5577 or use the form above. *These statements have not been evaluated by the Food and Drug Administration.  These products are not intended to diagnose, prevent, or cure any disease. Shop Kava.com Cart Shop Free Kava Fridays Kava Catalog Request Cart Shop Free Kava Fridays Kava Catalog Request Store Policies & Info Shipping Kava Returns Privacy Policies Security | Terms of Service Shipping Kava Returns Privacy Policies Security | Terms of Service Helpful Links About Kava.com Contact / (716) 989-5577 Kava Beginner’s Guide Where to Buy Kava Kava About Kava.com Contact / (716) 989-5577 Kava Beginner’s Guide Where to Buy Kava Kava Payment Options Kava Library – Kava Articles History of Kava Shop for Kava Kava Contact Us Kava Library – Kava Articles History of Kava Shop for Kava Kava Contact Us Facebook Twitter Youtube"
    },
    {
      "url": "https://kavacoffee.com/contact/",
      "text": "Contact Us | Kava® Coffee | The Original Low Acid Coffee™ | Since 1962 Skip to content FREE SHIPPING OVER $50 *Conditions Apply MY ACCOUNT SHOP ABOUT USAGE TIPS FAQ CONTACT SHOP ABOUT USAGE TIPS FAQ CONTACT SHOP CART FAQ USAGE TIPS ABOUT CONTACT MY ACCOUNT CONTACT US We want to hear from you! Send us an email using this form and we will get back to you as soon as possible! Name Email Message Send Please allow 1-3 business days for our team to reach out to you. We appreciate your understanding. Email Us support@kavacoffee.com or by using the contact form above Wholesale inquiry? Contact us at sales@kavacoffee.com Call Us 888-480-KAVA (5282) customer service hours – 9am – 5pm EST M-F If you are prompted to leave a voicemail, leave your name and number and we’ll give you a call back as soon as possible. SUPPORT We're here for you. We’ll ensure your experience with Kava® is as smooth as possible. Frequently Asked Questions You may find the answer to your question on our FAQ page. Click here to view answers to our commonly asked questions. Order Support For all inquiries related to orders and order fulfillment, please contact us using the form at the top of this page, or by emailing us at support@kavacoffee.com . We will be in touch as soon as possible. You may also call us at 888-480-KAVA (5282) . Our customer service hours are Monday through Friday, 9am – 5pm Eastern. Shipping Info Our standard shipping hours are Monday – Friday, 9 am – 5 pm (EST). Your order will typically ship via FedEx, UPS, or USPS. We are working around the clock to ensure your coffee gets to you as fast as possible, and we greatly appreciate your patience and understanding. Join Club Kava® Stay up to date with product updates & promotions! Email Join Us About Our History Usage Tips Recipes Help FAQ Contact Store Locator Other Account Terms Privacy Facebook-f Twitter Instagram © 2025 Kava Coffee Company - All Rights Reserved Continue Shopping → Item added to cart. 0 items - $ 0.00 Checkout"
    },
    {
      "url": "https://kavahana.com/",
      "text": "Kavahana: Kava Nectar Bar and Hawaiian Coffee Shop in Los Angeles, California Skip to content What is Kava Nectar? Locations Menu Events Articles What is Kava Nectar? Locations Menu Events Articles What is Kava Nectar? Locations Menu Events Articles What is Kava Nectar? Locations Menu Events Articles SHOP NOW Search Home What is Kava Nectar? Locations/Directions Menu Events Order for Pickup (Doordash) Order Pickup/Delivery (ChowNow) Shop Kava Nectar Wholesale Kava Nectar Host an event at Kavahana Tuesday Open Mic Sign Up About Us Articles Contact Us Home What is Kava Nectar? Locations/Directions Menu Events Order for Pickup (Doordash) Order Pickup/Delivery (ChowNow) Shop Kava Nectar Wholesale Kava Nectar Host an event at Kavahana Tuesday Open Mic Sign Up About Us Articles Contact Us la's first kava nectar bar serving tingly kava nectar drinks for smiles , relaxation & socializing + ceremonial matcha and kona coffee from hawaii directions & hours SHOP KAVA NECTAR * drink * live * drink * live * drink * live * drink * live * drink * live * drink * live * drink * live * nectar * tingly * kavahana * tingly * nectar * tingly * nectar * tingly * kavahana * tingly * nectar * tingly * kavahana * tingly WHAT IS KAVA NECTAR? A drink made from a root grown in the South Pacific islands that you can actually feel LEARN MORE what is kava nectar? made of plants 🌱 Kava Nectar is a powder crafted through the cold pressing of freshly harvested kava roots, yielding a pure, fresh kava juice. This juice is then meticulously dried and transformed into a fine powder using a proprietary process. Made exclusively from 100% natural kava root juice, Kava Nectar contains no fillers, additives, or preservatives, ensuring a lovely experience. ☀️ comes from halfway across the world ✈️ Kava Nectar is made from the roots of kava plants. The kava plants are organically grown and cultivated for several years on the rich, volcanic islands of Vanuatu. These islands provide the ideal environment for growing high-quality kava nectar. 🏝️ tastes earthy (like a stronger matcha) 🍵 Kava Nectar is naturally earthy because it is made from the roots of plants. It tastes like a strong matcha, with hints of lemongrass, pepper, and cashew – earthy and smooth 🌎 like coffee's sister for relaxation 🛁 Kava Nectar promotes feelings of happiness and sociability while keeping your mind continuously calm. We liken the effects of natural kava root to coffee, but with the opposite effect—promoting relaxation instead. Natural kava root has been enjoyed socially and ceremonially for its calming properties for centuries in the South Pacific and Hawaii. tingles your tongue 👅 Don’t be alarmed, you’re not having an allergic reaction! Kava nectar delightfully tingles your tongue while you’re drinking it, because the kava plants – which make kava nectar – are related to the peppercorn plant. TRY THE TINGLE SHOP KAVA NECTAR explore our menu Our menu offers specialty kava nectar cocktails, traditional kava nectar, and 100% Hawaiian Kona coffee, along with ceremonial matcha (Kona coffee & ceremonial matcha available until 6 PM daily). Food options include freshly steamed dim sum and other island snacks available day and night. VIEW MENU about us Learn more about our mission, kava nectar, and the welcoming community we’ve built in Los Angeles and beyond. ABOUT US SHOP Kava Nectar KAVA NECTAR SHIPS TO ALL 50 STATES & CANADA. SHOP ALL Learn more about Kava Nectar and Kava Plants Explore our articles covering everything from the history of Kava Nectar to health benefits, pharmacology, and recipes. ARTICLES Get in touch Get in touch using our general contact form, or complete one of the following forms if your request is specific. FOR ONLINE ORDERS, PLEASE USE ORDERS@KAVAHANA.COM FOR THE QUICKEST SERVICE. Wholesale Kava Nectar Account Our wholesale program is reserved for non alcoholic lounges, cafes, coffee shops, gyms, kava bars, smoothie bars, and wellness/grocery retailers at this time. WHOLESALE APPLICATION FORM Host an event at Kavahana (Santa Monica) We host a variety of events, including concerts/live music, paint and sip, art classes, book releases, company events, birthday parties, fundraisers, and private parties, among others. EVENT FORM Full Name Phone Number Email Address Subject General Question Collaboration Request Suggestion/Feedback Bookings Online Orders (for fastest service, email orders@kavahana.com) Something Else Message SUBMIT Tiktok Logo Linkedin Youtube Yelp hello@kavahana.com Kavahana Santa Monica (306 Pico Blvd, Santa Monica, CA 90405) Smorgasburg LA (777 S Alameda St, Los Angeles, CA 90021) +1-310-310-8970 SOCIALS Linktree Instagram Facebook TikTok Pinterest Linkedin Medium Kavahana locations Shop Kava Nectar Host an event Post Event (partners only) doordash About Us Contact Us Smorgasburg LA Kavahana Articles Eventbrite learn What is Kava Nectar? Kava Facts International Kava Organization (IKO) Kava Forums Articles r/Kava DELIVERY DOORDASH UBER EATS GRUBHUB CHOWNOW POSTMATES Online orders Shop Kava nectar your orders Manage subscription order support (live chat) © 2025 Kavahana LLC. All rights reserved​ All health-related statements on this website have not been evaluated by the FDA. Individual results with Kava Nectar may vary. Our products are not intended to diagnose, treat, cure, or prevent any disease. All content on this site is for educational and entertainment purposes only and should not be considered medical advice. Please consult your physician before using our products, especially if you are pregnant, nursing, taking medications, or have any medical condition. We value your privacy To provide the best experience, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://downtownkava.com/",
      "text": "Downtown Kava - Kava, Cafe, Coffee Shop Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? More Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Southwest Florida's Best Coffeehouse and Kava Bar! Hours Sunday 8am-8pm Monday-Thurs 7am-10pm Friday & Saturday 7am-Midnight Southwest Florida's Best Coffeehouse and Kava Bar! Hours Sunday 8am-8pm Monday-Thurs 7am-10pm Friday & Saturday 7am-Midnight WELCOME TO DOWNTOWN KAVA! Welcome Located  in the heart of Punta Gorda in the Historic Punta Gorda Train Depot, one of the most iconic historic buildings in Southwest Florida, we proudly bring to you Downtown Kava! Voted Charlotte County's BEST Cafe and Coffee for 2023 and 2024! Offering a place to meet friends new and old, work and socialize in a welcoming and comfortable space while enjoying coffee, tea, kava and botanical drinks from around the World!  Be immersed in the historic ambiance of a time gone by inside our expansive interior space or enjoy the beautiful Florida weather year round on our huge covered patio and boardwalk area. You may even be lucky enough to watch the train go by while you're here! You'll definitely make a new friend or two while you're here! Come see us! Downtown Kava has a seat for you! Dedicated to Quality We pride ourselves in offering the finest options of coffee, teas, Kava, Kratom, CBD products and more! Quality is important to us and we only serve the best to our patrons. We take pride in brewing our Kratom tea and Kava selections in house to ensure safety while offering the best taste and effect! We also utilize local coffee roasters for dynamic coffee offerings. More than Drinks Try something new and socialize with a purpose! Our  menu offers exciting options utilizing coffee, tea, Kava, Kratom, & CBD  without the intoxication! At Downtown Kava we have re-imagined the \"bar scene\" by providing a warm, welcoming and fun place to meet, work and socialize while enjoying exciting drinks without the alcohol.  Walk in a stranger and leave as a friend! FOLLOW US FOR FOOD TRUCK AND EVENTS SCHEDULE Downtown Kava-1009 Taylor Road, Punta Gorda, Florida 33950, United States 941-505-0562 Copyright © 2025 Downtown Kava - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://ekava.com/pages/contact",
      "text": "Contact\n – eKAVA Skip to content Contact us directly for bulk & wholesale orders Shop About Us FAQs News Contact Log in Twitter Facebook Pinterest Instagram Shop About Us FAQs News Contact Search Log in Cart Item added to your cart View my cart Check out Continue shopping Contact Need to get in touch? Drop us a line using this contact form or call us: Office hours (Fiji Times): Monday to Friday, 8am – 5pm Email: sales@lamikava.com.fj Telephone: +679.336.1409 Export/Wholesale: +679.891.4113 Lami Kava HQ: 5 Qaraniki, Veisari, Fiji P.O.Box 3350, Lami, Fiji Contact form Name Email * Phone number Comment Send eKAVA by Lami Kava Lami Kava, Fiji sets the pace for production of premium quality kava . For over 35 years we have served local and international markets for Fiji’s renowned herbal beverage, kava, made from the root of the Piper Methysticum plant. QUICK LINKS Shipping & Returns Refund Policy Terms of Service Privacy Policy CONTACT US Office hours (Fiji Times): Monday to Friday, 8am – 5pm Email: sales@lamikava.com.fj Telephone: +679.336.1409 Export/Wholesale: +679.891.4113 Lami Kava HQ: 5 Qaraniki, Veisari, Fiji P.O.Box 3350, Lami, Fiji Subscribe to our emails Email Facebook Instagram Twitter Pinterest Country/region Afghanistan (USD $) Åland Islands (USD $) Albania (USD $) Algeria (USD $) Andorra (USD $) Angola (USD $) Anguilla (USD $) Antigua & Barbuda (USD $) Argentina (USD $) Armenia (USD $) Aruba (USD $) Ascension Island (USD $) Austria (USD $) Azerbaijan (USD $) Bahamas (USD $) Bahrain (USD $) Bangladesh (USD $) Barbados (USD $) Belarus (USD $) Belgium (USD $) Belize (USD $) Benin (USD $) Bermuda (USD $) Bhutan (USD $) Bolivia (USD $) Bosnia & Herzegovina (USD $) Botswana (USD $) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (USD $) Bulgaria (USD $) Burkina Faso (USD $) Burundi (USD $) Cambodia (USD $) Cameroon (USD $) Canada (USD $) Cape Verde (USD $) Caribbean Netherlands (USD $) Cayman Islands (USD $) Central African Republic (USD $) Chad (USD $) Chile (USD $) China (USD $) Christmas Island (USD $) Cocos (Keeling) Islands (USD $) Colombia (USD $) Comoros (USD $) Congo - Brazzaville (USD $) Congo - Kinshasa (USD $) Cook Islands (USD $) Costa Rica (USD $) Côte d’Ivoire (USD $) Croatia (USD $) Curaçao (USD $) Cyprus (USD $) Czechia (USD $) Denmark (USD $) Djibouti (USD $) Dominica (USD $) Dominican Republic (USD $) Ecuador (USD $) Egypt (USD $) El Salvador (USD $) Equatorial Guinea (USD $) Eritrea (USD $) Estonia (USD $) Eswatini (USD $) Ethiopia (USD $) Falkland Islands (USD $) Faroe Islands (USD $) Fiji (USD $) Finland (USD $) France (USD $) French Guiana (USD $) French Polynesia (USD $) Gabon (USD $) Gambia (USD $) Georgia (USD $) Ghana (USD $) Gibraltar (USD $) Greece (USD $) Greenland (USD $) Grenada (USD $) Guadeloupe (USD $) Guatemala (USD $) Guernsey (USD $) Guinea (USD $) Guinea-Bissau (USD $) Guyana (USD $) Haiti (USD $) Honduras (USD $) Hong Kong SAR (USD $) Hungary (USD $) Iceland (USD $) India (USD $) Indonesia (USD $) Iraq (USD $) Ireland (USD $) Isle of Man (USD $) Israel (USD $) Italy (USD $) Jamaica (USD $) Japan (USD $) Jersey (USD $) Jordan (USD $) Kazakhstan (USD $) Kenya (USD $) Kiribati (USD $) Kosovo (USD $) Kuwait (USD $) Kyrgyzstan (USD $) Laos (USD $) Latvia (USD $) Lebanon (USD $) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (USD $) Lithuania (USD $) Luxembourg (USD $) Macao SAR (USD $) Madagascar (USD $) Malawi (USD $) Malaysia (USD $) Maldives (USD $) Mali (USD $) Malta (USD $) Martinique (USD $) Mauritania (USD $) Mauritius (USD $) Mayotte (USD $) Mexico (USD $) Moldova (USD $) Monaco (USD $) Mongolia (USD $) Montenegro (USD $) Montserrat (USD $) Morocco (USD $) Mozambique (USD $) Myanmar (Burma) (USD $) Namibia (USD $) Nauru (USD $) Nepal (USD $) Netherlands (USD $) New Caledonia (USD $) New Zealand (USD $) Nicaragua (USD $) Niger (USD $) Nigeria (USD $) Niue (USD $) Norfolk Island (USD $) North Macedonia (USD $) Norway (USD $) Oman (USD $) Pakistan (USD $) Palestinian Territories (USD $) Panama (USD $) Papua New Guinea (USD $) Paraguay (USD $) Peru (USD $) Philippines (USD $) Pitcairn Islands (USD $) Poland (USD $) Portugal (USD $) Qatar (USD $) Réunion (USD $) Romania (USD $) Russia (USD $) Rwanda (USD $) Samoa (USD $) San Marino (USD $) São Tomé & Príncipe (USD $) Saudi Arabia (USD $) Senegal (USD $) Serbia (USD $) Seychelles (USD $) Sierra Leone (USD $) Singapore (USD $) Sint Maarten (USD $) Slovakia (USD $) Slovenia (USD $) Solomon Islands (USD $) Somalia (USD $) South Africa (USD $) South Korea (USD $) South Sudan (USD $) Spain (USD $) Sri Lanka (USD $) St. Barthélemy (USD $) St. Helena (USD $) St. Kitts & Nevis (USD $) St. Lucia (USD $) St. Martin (USD $) St. Pierre & Miquelon (USD $) St. Vincent & Grenadines (USD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (USD $) Switzerland (USD $) Taiwan (USD $) Tajikistan (USD $) Tanzania (USD $) Thailand (USD $) Timor-Leste (USD $) Togo (USD $) Tokelau (USD $) Tonga (USD $) Trinidad & Tobago (USD $) Tristan da Cunha (USD $) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (USD $) U.S. Outlying Islands (USD $) Uganda (USD $) Ukraine (USD $) United Arab Emirates (USD $) United Kingdom (USD $) United States (USD $) Uruguay (USD $) Uzbekistan (USD $) Vanuatu (USD $) Vatican City (USD $) Venezuela (USD $) Vietnam (USD $) Wallis & Futuna (USD $) Western Sahara (USD $) Yemen (USD $) Zambia (USD $) Zimbabwe (USD $) Update country/region Country/region United States (USD $) Afghanistan (USD $) Åland Islands (USD $) Albania (USD $) Algeria (USD $) Andorra (USD $) Angola (USD $) Anguilla (USD $) Antigua & Barbuda (USD $) Argentina (USD $) Armenia (USD $) Aruba (USD $) Ascension Island (USD $) Austria (USD $) Azerbaijan (USD $) Bahamas (USD $) Bahrain (USD $) Bangladesh (USD $) Barbados (USD $) Belarus (USD $) Belgium (USD $) Belize (USD $) Benin (USD $) Bermuda (USD $) Bhutan (USD $) Bolivia (USD $) Bosnia & Herzegovina (USD $) Botswana (USD $) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (USD $) Bulgaria (USD $) Burkina Faso (USD $) Burundi (USD $) Cambodia (USD $) Cameroon (USD $) Canada (USD $) Cape Verde (USD $) Caribbean Netherlands (USD $) Cayman Islands (USD $) Central African Republic (USD $) Chad (USD $) Chile (USD $) China (USD $) Christmas Island (USD $) Cocos (Keeling) Islands (USD $) Colombia (USD $) Comoros (USD $) Congo - Brazzaville (USD $) Congo - Kinshasa (USD $) Cook Islands (USD $) Costa Rica (USD $) Côte d’Ivoire (USD $) Croatia (USD $) Curaçao (USD $) Cyprus (USD $) Czechia (USD $) Denmark (USD $) Djibouti (USD $) Dominica (USD $) Dominican Republic (USD $) Ecuador (USD $) Egypt (USD $) El Salvador (USD $) Equatorial Guinea (USD $) Eritrea (USD $) Estonia (USD $) Eswatini (USD $) Ethiopia (USD $) Falkland Islands (USD $) Faroe Islands (USD $) Fiji (USD $) Finland (USD $) France (USD $) French Guiana (USD $) French Polynesia (USD $) Gabon (USD $) Gambia (USD $) Georgia (USD $) Ghana (USD $) Gibraltar (USD $) Greece (USD $) Greenland (USD $) Grenada (USD $) Guadeloupe (USD $) Guatemala (USD $) Guernsey (USD $) Guinea (USD $) Guinea-Bissau (USD $) Guyana (USD $) Haiti (USD $) Honduras (USD $) Hong Kong SAR (USD $) Hungary (USD $) Iceland (USD $) India (USD $) Indonesia (USD $) Iraq (USD $) Ireland (USD $) Isle of Man (USD $) Israel (USD $) Italy (USD $) Jamaica (USD $) Japan (USD $) Jersey (USD $) Jordan (USD $) Kazakhstan (USD $) Kenya (USD $) Kiribati (USD $) Kosovo (USD $) Kuwait (USD $) Kyrgyzstan (USD $) Laos (USD $) Latvia (USD $) Lebanon (USD $) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (USD $) Lithuania (USD $) Luxembourg (USD $) Macao SAR (USD $) Madagascar (USD $) Malawi (USD $) Malaysia (USD $) Maldives (USD $) Mali (USD $) Malta (USD $) Martinique (USD $) Mauritania (USD $) Mauritius (USD $) Mayotte (USD $) Mexico (USD $) Moldova (USD $) Monaco (USD $) Mongolia (USD $) Montenegro (USD $) Montserrat (USD $) Morocco (USD $) Mozambique (USD $) Myanmar (Burma) (USD $) Namibia (USD $) Nauru (USD $) Nepal (USD $) Netherlands (USD $) New Caledonia (USD $) New Zealand (USD $) Nicaragua (USD $) Niger (USD $) Nigeria (USD $) Niue (USD $) Norfolk Island (USD $) North Macedonia (USD $) Norway (USD $) Oman (USD $) Pakistan (USD $) Palestinian Territories (USD $) Panama (USD $) Papua New Guinea (USD $) Paraguay (USD $) Peru (USD $) Philippines (USD $) Pitcairn Islands (USD $) Poland (USD $) Portugal (USD $) Qatar (USD $) Réunion (USD $) Romania (USD $) Russia (USD $) Rwanda (USD $) Samoa (USD $) San Marino (USD $) São Tomé & Príncipe (USD $) Saudi Arabia (USD $) Senegal (USD $) Serbia (USD $) Seychelles (USD $) Sierra Leone (USD $) Singapore (USD $) Sint Maarten (USD $) Slovakia (USD $) Slovenia (USD $) Solomon Islands (USD $) Somalia (USD $) South Africa (USD $) South Korea (USD $) South Sudan (USD $) Spain (USD $) Sri Lanka (USD $) St. Barthélemy (USD $) St. Helena (USD $) St. Kitts & Nevis (USD $) St. Lucia (USD $) St. Martin (USD $) St. Pierre & Miquelon (USD $) St. Vincent & Grenadines (USD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (USD $) Switzerland (USD $) Taiwan (USD $) Tajikistan (USD $) Tanzania (USD $) Thailand (USD $) Timor-Leste (USD $) Togo (USD $) Tokelau (USD $) Tonga (USD $) Trinidad & Tobago (USD $) Tristan da Cunha (USD $) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (USD $) U.S. Outlying Islands (USD $) Uganda (USD $) Ukraine (USD $) United Arab Emirates (USD $) United Kingdom (USD $) United States (USD $) Uruguay (USD $) Uzbekistan (USD $) Vanuatu (USD $) Vatican City (USD $) Venezuela (USD $) Vietnam (USD $) Wallis & Futuna (USD $) Western Sahara (USD $) Yemen (USD $) Zambia (USD $) Zimbabwe (USD $) Payment methods © 2025, eKAVA Refund policy Privacy policy Terms of service Shipping policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://downtownkava.com/events-page",
      "text": "Events Page Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? More Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? REOCCURRING WEEKLY Events Events and Specials Change Weekly-Follow us on Facebook and Instagram for up-to-date Information Events and Specials Change Weekly-Follow us on Facebook and Instagram for up-to-date Information Every Tuesday Trivia Tuesday-General Knowledge 7pm - 9pm Event Details Every Tuesday Trivia Tuesday-General Knowledge Hosted by Zimco Entertainment! Free entry and a chance to win prizes! Come by yourself or bring a team! 7pm - 9pm Every Other Friday Open Mic Night 7pm - 9pm Event Details Every Other Friday Open Mic Night Follow us on FB and Instagram for details and schedule. 7pm - 9pm Every Other Saturday KARAOKE NIGHT 8pm - 11pm Event Details Every Other Saturday KARAOKE NIGHT Follow us on FB and Instagram for details and schedule. 8pm - 11pm Every other Thursday BINGO with Aaron! 7pm - 10pm Estuary Park Event Details Every other Thursday BINGO with Aaron! Follow us on Facebook and Instagram for details and schedule. 7pm - 10pm Estuary Park FOLLOW US FOR FOOD TRUCK AND EVENTS SCHEDULE Downtown Kava-1009 Taylor Road, Punta Gorda, Florida 33950, United States 941-505-0562 Copyright © 2025 Downtown Kava - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://downtownkava.com/faq",
      "text": "FAQ Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? More Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Home Menu Contact Us FAQ Events Page What is Kava & Kratom? Frequently Asked Questions Is There an Age Limit to Enjoy Downtown Kava? Although we do not allow minors after 9pm, throughout the day all ages are welcome at Downtown Kava and we have may drink options for everyone. Our Kratom, CBD options  Delta 8 and  Delta 9 products are 21 and up to enjoy.  Kava is not regulated for a specific age at the moment, however we will only serve  Kava drinks to patrons 18 and up. We do ID.  Any child visiting Downtown Kava must be supervised by their parent or guardian at all times. Are Pets Allowed at Downtown Kava? We love all fuzzy buddies however due to the age and condition of the original 100 year old floors, we cannot have pets inside the building. We do have a huge 40'x40' covered porch and Boardwalk with ample seating to accommodate you and your pal that many of our customers with pets enjoy year round! You are allowed to come inside with your pet to place your order at the bar. All dogs must be on a leash and controlled by their owner at all times. Private Events/Meetings/Parties at Downtown Kava All events, parties and meetings to be held here at Downtown Kava regardless of size, need to be approved and confirmed by ownership. Please email Sarah and Ryan with all inquires at: Downtownkavapg@gmail.com Do You Serve Food at Downtown Kava? We serve pre-packaged snacks and have rotating pastries daily. We also schedule food trucks time to time and will post on social media our scheduled trucks weekly.  We also recommend and encourage bringing or ordering in take out if you need a snack, breakfast, lunch or dinner. We don't mind! What the Hours at Downtown Kava? 7am-10pm Monday through Thursday 7am-Midnight Friday and Saturday 8am-8pm Sunday These hours are subject to change. FOLLOW US FOR FOOD TRUCK AND EVENTS SCHEDULE Downtown Kava-1009 Taylor Road, Punta Gorda, Florida 33950, United States 941-505-0562 Copyright © 2025 Downtown Kava - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Decline Accept"
    },
    {
      "url": "https://kava-agency.com/about-us/",
      "text": "About us - Kava Skip to content What we do Our work About us Insights Get in touch At the heart of Kava is our team, and its dedication and focus on our clients and their business goals. About us As an Employee Ownership Trust (EOT) we strive to be a sustainable and ethical company to work for and do business with. Our core team, strategic partners and network of freelancers are committed and driven because they have a vested interest in our success. We aim to help businesses not just grow, but thrive. We achieve this through creative, thoughtful, honest, and transparent methods. At Kava, you won’t encounter industry jargon or empty promises – only clear, expert advice and skilfully executed marketing and communication campaigns. Claire Marshall Director Jamie Sutton Head of Design Corrie Lee Director Tom Dean Head of Development Molly Stevens Account Manager Kate Kemmett Office Manager Daisy Burgun Account Manager Serena Holdsworth Finance Manager Rich Bearpark Videographer Melanie Williams PR and Marcomms Specialist Vaughan O’Grady Technical Copywriter Richard Kennedy Brand Consultant (EOT Trustee) Mike Cartwright Financial Consultant (EOT Trustee) Kava Employee Ownership Trust Board Board Directors: Richard Kennedy, Mike Cartwright, Kate Kemmett Employee Representative: Tom Dean Join our team Kava is a great place to work. As an EOT benefits include: Inclusive culture Excellent working environment Flexible working hours Hybrid working A say in how the business is run Share in the company’s profit If you’re interesting in joining Kava please send your details to join@kava-agency.com Doing our bit We are proud of our commitments to charities, community projects, and providing work experience for those just starting out. We avoid wasting natural resources and we use 100% green web hosting. As we work towards B Corp certification , we continue our commitment to work ethically, with accountability and transparency. Insights Kava joins the Employee Ownership Association Why in-person events are thriving in a digital era What’s that new look? The Kava brand evolution Find out how we can help your business thrive today hello@kava-agency.com +44 1453 706648 What we do Our work About us Insights LinkedIn Bluesky © Kava Media Ltd, Sheephouse Farm, Uley Road, Dursley, Gloucestershire GL11 5AD Modern slavery statement Privacy policy"
    },
    {
      "url": "https://www.kavaindavie.com/about-us/",
      "text": "About Us - KAVA IN DAVIE Skip to content Home About Us Menu Contact 1 954-693-6422 1 954-693-6422 Main Menu About Us Contact Home Menu Kava in Davie At our kava shop, we believe that relaxation and good vibes are essential to a happy and healthy life. About Kava in Davie About Our Kava Shop Our Kava Shop is a one-of-a-kind kava and kratom bar located in Hollywood, Florida. We have been serving the community since 2014 and have quickly become the go-to destination for those looking to relax and unwind. Our newest location in Davie and Weston brings our unique blend of kava, kratom, and good vibes to an even wider audience. Kava Shop Team Looking for the best Kava near Davie? This Kava Shop is the place to be! Our team is made up of experienced and knowledgeable staff who are dedicated to providing our customers with the best possible experience. We are passionate about kava and kratom and are always eager to share our knowledge and experience with others. We are committed to creating a safe and welcoming space for everyone who visits our kava Shop. Visit us today at our newest location in Davie and Weston and experience our Kava Shop difference for yourself. Best Kava Near Davie and Weston At our Kava Shop, our mission is to provide a safe and welcoming space for our customers to unwind and de-stress. We are passionate about the benefits of kava and kratom and are committed to sharing our knowledge and experience with others. We strive to create a community of like-minded individuals who value natural remedies and relaxation. Order Online Or give us a call: +1 954-693-6422 Contact Fill out our contact form, send us an email, or come visit Hollywood, FL 33020 Menu Kava and Mocktails Contact us for the best Kava in Davie! 1 954-693-6422 Copyright © 2025 South FL SEO | Designed by: South FL SEO | Hosted By: CCMS Hosting Scroll to Top Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}