{
  "fuentes": [
    {
      "url": "https://www.carnivalcorp.com/company/boards-of-directors/",
      "email": "chiefcommsoffice@carnival.com"
    },
    {
      "url": "https://www.carnivalcorp.com/company/boards-of-directors/",
      "email": "jventuroni@carnival.com"
    },
    {
      "url": "https://orangeparkmall.com/visit/about-us/",
      "email": "orangeparkmallinfo@cbre.com"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/04/28/owner-of-the-orange-park-mall-expected-to-sell-its-properties-big-changes-coming-for-sears-property/",
      "email": "sjohnson@wjxt.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "ablair@lothinc.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "hannah.laikin@washingtonprime.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "hannah.schaffter@washingtonprime.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "jvoss@lothinc.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "kdaniels@lothinc.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "reid.merritt@washingtonprime.com"
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "email": "sarah.petereit@washingtonprime.com"
    },
    {
      "url": "https://orangeparkmall.com/events/3rd-annual-autism-carnival/",
      "email": "orangeparkmallinfo@cbre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "catharine.wells@cbre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "david.conn@cbre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "orangeparkmallinfo@cbre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "randy.bowman@cbre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "reid.merritt@cbre.com"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "email": "rob.ruzza@cbre.com"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/02/04/celebrating-50-years-of-the-orange-park-mall-a-look-back-at-the-longtime-community-hub/",
      "email": "tsalameh@wjxt.com"
    }
  ],
  "mails": [
    "ablair@lothinc.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "catharine.wells@cbre.com",
    "cdungca@diamondheadtheatre.com",
    "chiefcommsoffice@carnival.com",
    "david.conn@cbre.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "hannah.laikin@washingtonprime.com",
    "hannah.schaffter@washingtonprime.com",
    "jmartin@diamondheadtheatre.com",
    "jventuroni@carnival.com",
    "jvoss@lothinc.com",
    "kdaniels@lothinc.com",
    "kmatsuno@diamondheadtheatre.com",
    "orangeparkmallinfo@cbre.com",
    "productions@diamondheadtheatre.com",
    "randy.bowman@cbre.com",
    "reid.merritt@cbre.com",
    "reid.merritt@washingtonprime.com",
    "rob.ruzza@cbre.com",
    "rtandal@diamondheadtheatre.com",
    "sarah.petereit@washingtonprime.com",
    "sjohnson@wjxt.com",
    "tsalameh@wjxt.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "dreamlandamusements.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.carnivalcorp.com/company/boards-of-directors/",
      "text": "Boards of Directors – Carnival Corporation & plc Skip to content Our Company Our Purpose Our Brands Our History Leadership Boards of Directors Media Center News Releases In The News Feature Stories Snapshots Resources Media Library Media Contacts Investors Financial Information Stock Performance Shareholder Information Analyst Information Investor Services Impact Sustainability Community Relations Good Health, Inclusion & Belonging Governance Governance Guidelines Committee Details Business Conduct & Ethics Legal Notices company information Boards of Directors Micky is Chair of the Board of Directors of Carnival Corporation and Carnival plc, the largest global cruise company with a diversified portfolio of world-class cruise line brands that serve virtually every market segment from contemporary to ultra-luxury, as well as leading port destinations and land operations in Alaska and the Yukon. Micky brings to the role decades of leadership experience with Carnival Corporation & plc, including in-depth knowledge of the business, history and the cruise industry overall. Read Bio Micky Arison Chair of the Boards Carnival Corporation & plc Sir Jonathon has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2010. In this role, he serves as chair of the company’s Health, Environmental, Safety & Security Committees and is also a member of the Nominating & Governance Committees and the Compliance Committees. Read Bio Sir Jonathon Band Independent Director Carnival Corporation & plc Jason has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2017. He also currently serves as a member of the Audit Committees and Compensation Committees. Read Bio Jason Glen Cahilly Independent Director Carnival Corporation & plc Nelda has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2024. In this role, she serves as a member of the Health, Environmental, Safety & Security Committees. Read Bio Nelda J. Connors Independent Director Carnival Corporation & plc Helen has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2016. In this role, she serves on the Compensation Committees and Health, Environmental, Safety & Security Committees. Read Bio Helen Deeble Independent Director Carnival Corporation & plc Jeff has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2020. In this role, he serves as chair of the Compliance Committees and member of the Audit Committees. Read Bio Jeffrey J. Gearhart Independent Director Carnival Corporation & plc Katie has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2019. In this role, she serves as a member of the Nominating & Governance Committees and Health, Environmental, Safety & Security Committees. Read Bio Katie Lahey Independent Director Carnival Corporation & plc Stu has served on the Board of Directors of Carnival Corporation since 1987 and on the Board of Directors of Carnival plc since 2003. In this role, he serves as chair of the Nominating & Governance Committees, as well as a member of the Audit Committees and Compliance Committees. Read Bio Stuart Subotnick Independent Director Carnival Corporation & plc Laura has served on the Boards of Directors of Carnival Corporation and Carnival plc since 2007. In this role, she serves as chair of the Audit Committees and member of the Compensation Committees and Compliance Committees. Read Bio Laura Weil Independent Director Carnival Corporation & plc Josh is Chief Executive Officer of Carnival Corporation & plc and leads one of the world’s largest leisure travel companies that boasts a portfolio of world-class cruise line brands including AIDA Cruises, Carnival Cruise Line, Costa Cruises, Cunard, Holland America Line, P&O Cruises, Princess Cruises and Seabourn. Read Bio Josh Weinstein Chief Executive Officer Carnival Corporation & plc Mr. Weisenburger’s qualifications to serve on the Boards include his broad leadership and operational skills gained as a senior executive of a large multi-national corporation and his extensive financial and accounting skills acquired as an investment banker and senior financial operating executive. He also has broad experience in corporate governance, having served as a director, past and present, of a number of other publicly-traded companies. Read Bio Randy J. Weisenburger Director Carnival Corporation & plc Our Cruise Lines Learn More about Our Cruise Lines. Learn More about Our Cruise Lines. Quick Links Our Company Media Center Investor Relations Sustainability Governance Vendors/Suppliers Careers Media Inquiries For Carnival Corporation media inquiries and editorial photo requests, please contact: Jody Venturoni, Chief Communications Officer, Carnival Corporation & plc. Email: ChiefCommsOffice@carnival.com © 2025 Carnival Corporation & plc | Privacy Notice | Consumer Health Data Privacy Notice | Your Privacy Rights | Your Privacy Choices Manage Cookie Settings Our Company Our Purpose Our Brands Our History Leadership Boards of Directors Media Center News Releases In The News Feature Stories Snapshots Resources Media Library Media Contacts Investors Financial Information Stock Performance Shareholder Information Analyst Information Investor Services Impact Sustainability Community Relations Good Health, Inclusion & Belonging Governance Governance Guidelines Committee Details Business Conduct & Ethics Legal Notices Search Search"
    },
    {
      "url": "https://orangeparkmall.com/visit/about-us/",
      "text": "About Us - Orange Park Skip to content Orange Park Mall will be open from 11AM to 6PM on Friday, July 4, so our team can enjoy the Independence Day holiday. Please note: Theater and restaurant hours may vary. Please contact them directly to confirm. today's hours: 11:00 AM to 8:00 PM map partner with us Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security about us Orange Park Mall is Clay County’s premier shopping destination offering national brands and locally-owned specialty shops to residents and tourists alike. Orange Park Mall also hosts more than 30 events a year including, a monthly KidX Club event, car shows and and Photos with the Easter Bunny and Santa. Connect with us on Facebook & Instagram and sign up to receive Orange Park Mall’s emails for the latest news and happenings! photo gallery PARKING & ACCESSIBILITY bicycle parking Bike racks are located at the Food Court entrance and the Old Navy entrance. HANDICAP ACCESSIBLE Our property offers accessibility for guests needing additional assistance. Handicap parking and accessible entrances are located at all Mall entrances. Accessible restrooms are located in the food court and near Van's. WHEELCHAIRS If you are in need of a wheelchair during your visit, please visit the mall office, located at the food court entrance, near Champ's.  Wheelchairs are complementary but require a valid driver's license upon pick up.  \n\nThe mall office is open Monday through Friday from 8:30am to 5pm (closed from 12noon - 1pm for lunch).  If you wish to use a wheelchair outside of the mall office hours, please call Security at 904.269.1662. Family FAMILY RESTROOMS For your convenience, you’ll find family restrooms located next to the Food Court. KIDDIE RIDES Enjoy a fun and unique experience by riding one of Animal Rides rental. Located at the top of the Food Court, purchase tickets at the kiosk.  Must be under 275 pounds.  Children 5 years old and under must have an adult ride with them. KIDX CLUB Orange Park Mall offers a KidX club program with monthly events, exclusive discounts and more! NURSING LOUNGE For your convenience, we offer private nursing mother’s lounge located near the Women's restroom in the food court.\n\nSponsored by HCA Orange Park. PLAY AREA Take a break from shopping and let your little one enjoy some fun at the HCA Orange Park Play Area. Open to all children 42\" and under.\n\nLocated near Rack Room Shoes. STROLLERS Push your little one around with ease in our of our strollers. Located at the Food Court and Old Navy entrance.  Rental rate is $6 for a single stroller. BABY CHANGING STATIONS For your convenience, baby changing stations are located in the family and women's restrooms. SAFETY & SECURITY FIRST AID First-aid assistance can be provided at the mall office.  In the event of an emergency please dial 911, or locate the nearest Security Officer.  AED devices are located in all Security mobile vehicles. LOST & FOUND If you misplace an item, please call Security at (904) 269-1662. SECURITY Shop with peace of mind knowing our Security is here to ensure a safe and enjoyable experience. If you need to contact Security at any time during your visit, please call 904-269-1662. other amenities ATMS ATM machines are located at the Food Court, by Books-A-Million and by the AMC Entrance. FIRE PIT Enjoy the firepit, located on the patio, outside the food court. VENDING MACHINES Grab a cold drink from one of the Coca-Cola vending machines located throughout the property. MALL WALKING Orange Park Mall opens all entrances at 8:30am Monday - Saturday for anyone who would like to walk the mall.   On Sundays, entrances are open at 10am. CELL PHONE CHARGING STATION For your convenience, we offer recharging stations fit for most devices, located at Center Court, near Dillard's. WIFI Stay connected on-the-go by using complimentary Wi-Fi services throughout the mall. about wpg At wpg our vision is to create a world-class retail real estate operating platform. With value creation at the core of everything we do, we combine a diverse national portfolio with expertise across the entire shopping center sector to provide the strategy, support and space needed for retailers to thrive. learn more 1910 Wells Road, Orange Park, Florida 32073 © 2013-2025 wpg • terms & policies jobs events jobs blog events leasing & advertising our suppliers our retailers leasing & advertising our suppliers our retailers get the latest news: Sign up to receive the latest news. Sign Up managed and leased by: connect with us contact us 904-269-2422 orangeparkmallinfo@cbre.com follow us: © 2013-2023 wpg • terms & policies jobs blog jobs blog managed and leased by: get the latest news: Sign up to receive the latest news. Your Email Submit Polaris Fashion Place 1500 Polaris Parkway\nColumbus, Ohio 43240 contact us (614) 846-1500 first.last@wpgus.com follow us: © 2013-2024 wpg • terms & policies"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/04/28/owner-of-the-orange-park-mall-expected-to-sell-its-properties-big-changes-coming-for-sears-property/",
      "text": "Owner of the Orange Park Mall expected to sell its properties; big changes coming for Sears property Skip to main content Open Main Menu Navigation Open Search Partly Cloudy icon 81 º Go to the WJXT homepage Join Insider Sign In Open the WJXT News4JAX Help Desk Search News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition NEXTGEN TV TV Listings Florida Justice Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics Features News4JAX Insider JAXBest Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live News4JAX+ Look Local Travel Voices of the 904 Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting Branded Content River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping SnapJAX SnapJAX Stories Breaking News Photos Weather Photos Newsletters Sign Up For Newsletters WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us CW17 CW Program Guide Bounce News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 LIVE BREAKING NEWS BREAKING NEWS DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor Select breaking news story 1 of 3 Select breaking news story 2 of 3 Select breaking news story 3 of 3 Show Breaking News Bar Close Local News Scott Johnson , Reporter/weekend anchor Published: April 28, 2025 at 11:52 AM Updated: April 28, 2025 at 6:14 PM Tags: Orange Park , Orange Park Mall , Clay County Sign up for our Newsletters Sign Up LATEST NEWS No description available 1 hour ago DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor Read full article: DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor . 2 hours ago A potential tropical system is something to pay attention to Read full article: A potential tropical system is something to pay attention to 9/11 remembrance ceremony at Mayport 3 hours ago 24 years later: Remembering 9/11 across Northeast Florida Read full article: 24 years later: Remembering 9/11 across Northeast Florida FILE - Young people take part in a protest calling for the government to take immediate action against climate change in Cape Town, South Africa, Sept. 24, 2022. The climate change generation is saying officials are talking too much, listening too little and acting even less. And they are fed up. (AP Photo/Nardus Engelbrecht, File) 6 hours ago Generation on Edge: The toll of ‘emotional inflammation’ Read full article: Generation on Edge: The toll of ‘emotional inflammation’ Recommended Videos Local News Owner of the Orange Park Mall expected to sell its properties; big changes coming for Sears property The former home of Sears, which is separately owned, could see big changes, including big-box stores Scott Johnson , Reporter/weekend anchor Published: April 28, 2025 at 11:52 AM Updated: April 28, 2025 at 6:14 PM Tags: Orange Park , Orange Park Mall , Clay County ORANGE PARK, Fla. – Orange Park Mall owner Washington Prime Group has, or is near, putting its entire portfolio of 50 shopping centers up for sale as it lays off employees at its corporate headquarters, Jacksonville Daily Record reported . The property purge includes 10 malls and shopping centers in Florida, including the Orange Park Mall. In an email to News4JAX on Monday, a WPG spokesperson confirmed the company is selling off the assets in its portfolio writing that “about half of WPG’s properties sold in the past year, while the remainder of the portfolio is or will soon be on the market.” The spokesperson says the strategy is “part of WPG’s multi-year journey” but did not give further details. The 950,000-square-foot Orange Park Mall, which isn’t yet sold, sits on 77 acres at 1910 Wells Road. The center, which is turning 50 this year, is operating at 97% leasing capacity, according to mall management. It has more than 100 stores. There could also be big changes coming for the Sears building at the mall, which is separately owned. RELATED | Celebrating 50 years of the Orange Park Mall: A look back at the longtime community hub The store closed in 2020, and its 189,796-square-foot shell and associated parking are being marketed as a multitenant building along with five outparcels by commercial real estate services firm The Shopping Center Group. A rendering shows big-box stores replacing the closed Sears at the Orange Park Mall. The rest of the mall would remain the same. Sears, which closed in 2020, has different ownership than the mall. (Transformcoproperties.com) (Jacksonville Daily Record) Possible redevelopment plan at Orange Park Mall. (Copyright 2025 by WJXT News4JAX - All rights reserved.) Sears was among the original stores when the mall opened Sept. 24, 1975. “This is going to change our front. Right now, it’s empty,” mall General Manager Randy Bowman said.‘Bowman confirmed the Sears store and its former auto service center will be demolished. Called Orange Park Plaza, a TSCG marketing flyer shows on a conceptual design that the defunct department store’s shell could be divided into four spaces from 10,000 to about 24,000 square feet along Blanding Boulevard. TSCG’s plan also shows five outparcels, showing stores from 3,000 to 6,000 square feet, including two quick-service restaurants. Read more on JaxDailyRecord.com . Copyright 2025 by WJXT News4JAX - All rights reserved. About the Author Scott Johnson headshot Scott Johnson Scott is a multi-Emmy Award Winning Anchor and Reporter, who also hosts the “Going Ringside With The Local Station” Podcast.  Scott has been a journalist for 25 years, covering stories including six presidential elections, multiple space shuttle launches and dozens of high-profile murder trials. email facebook twitter Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us Careers at WJXT / WCWJ Closed Captioning / Audio Description WJXT Public File WJXT EEO Report WCWJ Public File WCWJ EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (904) 393-9801 At WJXT, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 News4JAX.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://www.lothinc.com/wpg-resource-hub/fl-opm-outdoor/",
      "text": "Orange Park Mall - outdoor Skip to content Contact Us Phone number: 513.554.4900 Locations Search Submit Search Digital Catalog Industries We Serve Solutions Success Stories Services Lookbooks Our Story Steelcase Authorized Dealer Menu Phone number: 513.554.4900 Orange Park Mall - Outdoor Orange Park Mall - Outdoor Project Details LOTH Contacts WPG Contacts Warranty Info Cleaning Guides Project Details Project Details Design Package project location: 1910 Wells Rd Orange Park, FL 32073 quote number: 19629 order number: 7646 project site contact: Reid Merritt – Operations Director e: reid.merritt@washingtonprime.com c: 321.223.5913 o: 904.269.9413 LOTH Contacts LOTH Contacts Julie Voss Leader, Emerging Workplaces c. 614-582-2997 e. jvoss@lothinc.com Amber Blair Workplace Advisor c. 419-236-9879 e. ablair@lothinc.com Kia Daniels Service Coordinator p. 614.487.4040 e. kdaniels@lothinc.com Submit a service request LOTH Grandview Work Studio 855 Grandview Ave. Columbus, OH 43215 WPG Contacts Washington Prime Group Contacts Hannah Schaffter Manager, Special Projects c. 614.887.5896 e. hannah.schaffter@washingtonprime.com Sarah Petereit Director, Special Projects c. 614.312.9320 e. sarah.petereit@washingtonprime.com Washington Prime Group, OH 180 E Broad St. Columbus, OH 43215 Hannah Laikin Director, Special Projects c. 317.552.8270 e. hannah.laikin@washingtonprime.com Washington Prime Group, IN 111 Monument Circle, Suite 3500 Indianapolis, IN 43204 Warranty Info Steelcase A Carpenter’s Son Bolia BluDot Carl Hansen & Son Coalesse Emu Extremis Florida Seating KFI OFS Special T Sunbrella West Elm Cleaning Guides See Care Guide Return to Hub Return to WPG Hub Contact Us Privacy Terms of Use Service Request Accessibility Statement Follow us on Twitter Follow us on Facebook Follow us on LinkedIn Follow us on YouTube Follow us on Pinterest Follow us on Instagram © 2025 LOTH, Inc. We would love to hear from you! Please fill out this form and we will get in touch with you shortly. Phone number: 513.554.4900 Contact Us"
    },
    {
      "url": "https://orangeparkmall.com/events/3rd-annual-autism-carnival/",
      "text": "3rd annual autism carnival - Orange Park Skip to content Orange Park Mall will be open from 11AM to 6PM on Friday, July 4, so our team can enjoy the Independence Day holiday. Please note: Theater and restaurant hours may vary. Please contact them directly to confirm. today's hours: 11:00 AM to 8:00 PM map partner with us Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security events event categories All Kids Fashion Retailer Events Arts, Culture and Music Seasonal All Kids Fashion Retailer Events Arts, Culture and Music Seasonal sign up to receive event emails. Sign up to receive the latest events. Sign Up « All Events This event has passed. 3rd annual autism carnival April 27, 2024 | 11:00 am – 7:00 pm « Earth Day Artventure:  Mural Magic Mommy & Me Tea » Join us for a unique event catered to individuals across the autism spectrum! All ages are welcome! Enjoy a variety of activities including a foam pit (non-toxic) with towels available for purchase, bounce houses, water slide, jumbo Connect 4, dunk tank, jumbo Jenga, 360 booth, and much more.  Food trucks and vendors will be onsite for your convenience. Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: April 27, 2024 Time: 11:00 am – 7:00 pm Event Categories: Arts, Culture and Music , Community Event Tags: featured Venue JCPenney Parking Lot « Earth Day Artventure:  Mural Magic Mommy & Me Tea » 1910 Wells Road, Orange Park, Florida 32073 © 2013-2025 wpg • terms & policies jobs events jobs blog events leasing & advertising our suppliers our retailers leasing & advertising our suppliers our retailers get the latest news: Sign up to receive the latest news. Sign Up managed and leased by: connect with us contact us 904-269-2422 orangeparkmallinfo@cbre.com follow us: © 2013-2023 wpg • terms & policies jobs blog jobs blog managed and leased by: get the latest news: Sign up to receive the latest news. Your Email Submit Polaris Fashion Place 1500 Polaris Parkway\nColumbus, Ohio 43240 contact us (614) 846-1500 first.last@wpgus.com follow us: © 2013-2024 wpg • terms & policies"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://orangeparkmall.com/contact-us/",
      "text": "Contact Us - Orange Park Skip to content Orange Park Mall will be open from 11AM to 6PM on Friday, July 4, so our team can enjoy the Independence Day holiday. Please note: Theater and restaurant hours may vary. Please contact them directly to confirm. today's hours: 11:00 AM to 8:00 PM map partner with us Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security Shop Dine Experience Visit Hours Map Things to Do About Us Code of Conduct/Security Contact Us let’s connect We are here to help. Please submit the let’s connect form and a member of our team will connect with you shortly. let’s connect Contact Reason: Please select... General Inquiry Business / Advertising Comments / Suggestions Lost & Found Media Inquiry Tourism First Name Last Name Email Comments: I understand my information will be used to contact me. My personal information will not be shared. reCAPTCHA helps prevent automated form spam. The submit button will be disabled until you complete the CAPTCHA. Contact Reason: Please select... General Inquiry Business / Advertising Comments / Suggestions Lost & Found Media Inquiry Tourism First Name Last Name Email Comments: I understand my information will be used to contact me. My personal inforamtion will not be shared. first name What is Your Type of Business or Company? Select business type last name What Would You Like to Learn More About? Select topic email address Which Property(s) Are of Interest? Select property name(s) phone number submit first name last name email address phone number What is Your Type of Business or Co...? What Would You Like to Learn Mor...?* Which Property(s) Are of Interest? submit General Manager randy bowman randy.bowman@cbre.com 904.269.2422 operations Director reid merritt reid.merritt@cbre.com 904.269.2422 Marketing Director catharine wells catharine.wells@cbre.com 904.269.2422 specialty leasing & sponsorship ron ruzza rob.ruzza@cbre.com 410.991.5328 permanent leasing dave conn david.conn@cbre.com 813.505.2242 Phone 904.269.2442 security 904.269.1662 1910 Wells Road, Orange Park, Florida 32073 © 2013-2025 wpg • terms & policies jobs events jobs blog events leasing & advertising our suppliers our retailers leasing & advertising our suppliers our retailers get the latest news: Sign up to receive the latest news. Sign Up managed and leased by: connect with us contact us 904-269-2422 orangeparkmallinfo@cbre.com follow us: © 2013-2023 wpg • terms & policies jobs blog jobs blog managed and leased by: get the latest news: Sign up to receive the latest news. Your Email Submit Polaris Fashion Place 1500 Polaris Parkway\nColumbus, Ohio 43240 contact us (614) 846-1500 first.last@wpgus.com follow us: © 2013-2024 wpg • terms & policies"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/02/04/celebrating-50-years-of-the-orange-park-mall-a-look-back-at-the-longtime-community-hub/",
      "text": "Celebrating 50 years of the Orange Park Mall: A look back at the longtime community hub Skip to main content Open Main Menu Navigation Open Search Partly Cloudy icon 81 º Go to the WJXT homepage Join Insider Sign In Open the WJXT News4JAX Help Desk Search News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition NEXTGEN TV TV Listings Florida Justice Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics Features News4JAX Insider JAXBest Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live News4JAX+ Look Local Travel Voices of the 904 Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting Branded Content River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping SnapJAX SnapJAX Stories Breaking News Photos Weather Photos Newsletters Sign Up For Newsletters WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us CW17 CW Program Guide Bounce News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 LIVE BREAKING NEWS BREAKING NEWS DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor Select breaking news story 1 of 3 Select breaking news story 2 of 3 Select breaking news story 3 of 3 Show Breaking News Bar Close Local News Tiffany Salameh , News4JAX Consumer Investigative Reporter , Jacksonville Published: February 4, 2025 at 11:00 AM Updated: February 5, 2025 at 7:05 AM Tags: Orange Park , Orange Park Mall , 4 Your Neighborhood , Clay County Sign up for our Newsletters Sign Up LATEST NEWS No description available 1 hour ago DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor Read full article: DeSantis honors 9/11 heroes, stresses importance of education, unity during ceremony in Palm Harbor . 2 hours ago A potential tropical system is something to pay attention to Read full article: A potential tropical system is something to pay attention to 9/11 remembrance ceremony at Mayport 4 minutes ago 24 years later: Remembering 9/11 across Northeast Florida Read full article: 24 years later: Remembering 9/11 across Northeast Florida FILE - Young people take part in a protest calling for the government to take immediate action against climate change in Cape Town, South Africa, Sept. 24, 2022. The climate change generation is saying officials are talking too much, listening too little and acting even less. And they are fed up. (AP Photo/Nardus Engelbrecht, File) 6 hours ago Generation on Edge: The toll of ‘emotional inflammation’ Read full article: Generation on Edge: The toll of ‘emotional inflammation’ Recommended Videos Local News Celebrating 50 years of the Orange Park Mall: A look back at the longtime community hub While many shops have come and gone, two stores have remained in the same location since the mall first opened in 1975 Tiffany Salameh , News4JAX Consumer Investigative Reporter , Jacksonville Published: February 4, 2025 at 11:00 AM Updated: February 5, 2025 at 7:05 AM Tags: Orange Park , Orange Park Mall , 4 Your Neighborhood , Clay County Nov. 22, 1994; Orange Park, FL, USA; Aerial photo of Orange Park Mall; Mandatory credit: John Pemberton-USA TODAY NETWORK (John Pemberton,  USA TODAY NETWORK) ORANGE PARK, Fla. – The Orange Park Mall is celebrating its 50th anniversary this year, marking five decades as a staple in the community, employing over 3,000 people and housing 80 small businesses. While many shops have come and gone, two stores — Zales and Spencer’s — have remained in the same location since the mall first opened in 1975. The Orange Park Mall first opened its doors shortly after the Buckman Bridge connected Jacksonville’s Southside to Clay County. But here’s a fun fact: despite its name, the mall is technically outside the official Town of Orange Park, something people enjoyed pointing out to News4JAX while we were completing our research for the story. Randy Bowman, the mall’s general manager, explained the distinction: “The town of Orange Park splits off from the county version of Orange Park. The actual dividing line is the railway track. Everything to the right of the track is the town of Orange Park, everything else belongs to the county. The mall is in the part of the county with the Orange Park ZIP code, which is where the name comes from.” Photo inside the Orange Park Mall in 2025. (Copyright 2025 by WJXT News4JAX - All rights reserved.) The mall has evolved over the years but remains a go-to shopping destination. Bath & Body Works Store Manager Cortney McCarter credits strong customer relationships for keeping businesses alive. “We have a lot of loyal people who keep coming back to the Orange Park Mall,” McCarter said. “I think it partly has to do with our interactions with the customers. We make a great connection, not just in my store, but also with the community in the mall.” With 187 places to shop, the mall is home to a mix of national chains and local businesses. One of those locally owned stores is Fashion Dollz Boutique, owned by Stephanie Hoyte, who started her business in her garage before opening a storefront inside the mall. News4JAX talks with Stephanie Hoyte, the owner of Fashion Dollz Boutique, which can be found in the Orange Park Mall. (Copyright 2025 by WJXT News4JAX - All rights reserved.) “I took a leap of faith, and I came to the mall and had my own boutique, Fashion Dollz Boutique,” Hoyte said. “You want your customers to feel special when they walk in. From the designs of the clothing to the smell of the store to the look of the store — it’s everything.” Hoyte emphasized the importance of supporting local businesses. “In the mall, there’s diversity. I’m young, I’m a Black business owner, but there are also other business owners in the mall with all different types of businesses,” Hoyte said. “We have to come together more and support each other locally. We travel and buy expensive things, but why can’t we shop with our locals the same way?” While the mall has been a community hub for decades, it has also seen its share of security concerns, including fights, gunfire incidents, and even evacuations in recent years. General Manager Randy Bowman says safety remains a top priority. The original press release for the opening of the Orange Park Mall in 1975. (WJXT) “We want to protect our tenants, our guests, and the individuals who shop with us,” Bowman said. “We want the over 3,000 employees who work here to feel like, ‘Hey, I’m safe. I can come to work, enjoy it, and leave with no issues.’ We’ve put a lot of resources into making sure people do feel safe.” A Clay County Sheriff’s officer is stationed outside the mall daily to help maintain security. The official 50-year milestone for the Orange Park Mall falls on Sept. 24, and the community is invited to celebrate. The Orange Park High School marching band — which performed when the mall first opened in 1975 — will once again march through the mall to commemorate the occasion. Additional fun activities are planned for shoppers and families. The Orange Park High School band marching through the center square on September 24, 1975. (WJXT) Copyright 2025 by WJXT News4JAX - All rights reserved. About the Author Tiffany Salameh headshot Tiffany Salameh Tiffany comes home to Jacksonville, FL from WBND in South Bend, Indiana.  She went to Mandarin High School and UNF. Tiffany is a former WJXT intern, and joined the team in 2023 as Consumer Investigative Reporter and member of the I-TEAM. email facebook twitter Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us Careers at WJXT / WCWJ Closed Captioning / Audio Description WJXT Public File WJXT EEO Report WCWJ Public File WCWJ EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (904) 393-9801 At WJXT, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 News4JAX.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    }
  ]
}