{
  "fuentes": [
    {
      "url": "https://blog.salesflare.com/interview-david-cancel-drift",
      "email": "jeroen@salesflare.com"
    },
    {
      "url": "https://www.salmonriverdrifters.com/meet-the-crew",
      "email": "info@salmonriverdrifters.com"
    },
    {
      "url": "https://www.ami-canada.com/contactus.html",
      "email": "info@ami-canada.com"
    },
    {
      "url": "https://driftkings.com/contact/",
      "email": "john@mtx.com"
    },
    {
      "url": "https://driftkings.com/contact/",
      "email": "office@driftkings.com"
    },
    {
      "url": "https://driftmediasolutions.com/about/",
      "email": "marketing@driftmediasolutions.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "apratt@amigrp.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "cpoizat@amigrp.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "dan@amigrp.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "jbennett@amigrp.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "mkahlow@amigrp.com"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "email": "rthornhill@amigrp.com"
    },
    {
      "url": "https://martechseries.com/analytics/b2b-data/drift-appoints-enterprise-software-veteran-steve-lucas-to-board-of-directors/",
      "email": "psen@martechseries.com"
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/drift-in-ami/",
      "email": "lindsey@annamarialifevacationrentals.com"
    },
    {
      "url": "https://www.islander.org/2025/03/bb-oks-temp-permit-for-drift-in/",
      "email": "info@islander.org"
    },
    {
      "url": "https://storychief.io/blog/drift-content-marketing-strategy",
      "email": "hey@storychief.io"
    }
  ],
  "mails": [
    "apratt@amigrp.com",
    "cpoizat@amigrp.com",
    "dan@amigrp.com",
    "hey@storychief.io",
    "info@ami-canada.com",
    "info@islander.org",
    "info@salmonriverdrifters.com",
    "jbennett@amigrp.com",
    "jeroen@salesflare.com",
    "john@mtx.com",
    "lindsey@annamarialifevacationrentals.com",
    "marketing@driftmediasolutions.com",
    "mkahlow@amigrp.com",
    "office@driftkings.com",
    "psen@martechseries.com",
    "rthornhill@amigrp.com"
  ],
  "nombre_sitio": "driftinami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://blog.salesflare.com/interview-david-cancel-drift",
      "text": "Interview with Drift Founder & CEO, David Cancel Product Pricing Blog 🌐 English Spanish Portuguese French German Italian Dutch Swedish Polish Chinese Japanese Free CRM Trial Search In this article Written by: Jeroen Corthout Free CRM Trial Don't start from scratch with your CRM. Teams love Salesflare because it fills out itself. Try it for free for up to 30 days. David Cancel of Drift Founder Coffee episode 014 I’m Jeroen from Salesflare and this is Founder Coffee. Every two weeks I have coffee with a different founder. We discuss life, passions, learnings, … in an intimate talk, getting to know the person behind the company. For this fourteenth episode, I talked to David Cancel, Founder & CEO of Drift, a leading conversational marketing & sales platform. Drift is not David’s first baby, nor his first success story. He was previously Chief Product Officer at HubSpot after his company, Performable, was acquired. Before that he also launched and sold Ghostery, Lookery and Compete. We talk about his backstory, how he likes to build both startups and flowers, why he is still involved in every single hire… and why he doesn’t believe in development sprints. — Prefer listening? You can find this episode on: iTunes / Apple Podcasts Google Play Soundcloud — Welcome to Founder Coffee. Jeroen: Hi, David. It’s great to have you on Founder Coffee. David: Thanks for having me. Jeroen: Me too. You’re the founder of Drift. We all love Drift. David: Thanks. Jeroen: But for those who don’t love Drift yet, what do you do? David: So Drift is a SaaS app and it helps people. It lives on your website and basically is like taking your best sales rep and making them available 24/7, all 365 days. We do that through conversational marketing and a bot that has conversations with the people that come to your website in real time. Jeroen: Yeah. So when I hear live chats, I hear chat bots somehow. David: Yes. Jeroen: You mentioned sales. So it’s kind of the target market you’re focusing on. Is it like sales, live sales? David: Yeah. It’s sales. Many people had tried to use live chat for sales forum. For at least the last decade or so, they weren’t successful because they weren’t using a support tool in order to do it. What we did was, we’re the first to bring bots to live chat in order to just be able to do sales with real-time qualification, real-time routing, all that kind of stuff. So we define this category as ‘conversational marketing’. But yeah, we do chat. We do email. We do basically everything that has to do with a conversation. So it goes beyond chat. It goes into the email and other places. Jeroen: So it’s also a marketing automation tool and somehow a sales automation tool. David: It’s a sales and marketing automation tool, right? We believe that marketing and sales is coming together. We’ve been trying to do that for a long time. We’re organizing them around two things, conversations and revenue. So we’re a platform that lets them do that. We all know that if you have salespeople on your team, no one’s going to be able to sell anything until they have a conversation. The salespeople and marketing systems and automation and all that stuff, for years, has been focused on putting hurdles between you, the prospect, and the salesperson. What we do is remove those hurdles and create like a fast pass direct line between that prospect and the salesperson. Jeroen: Now, is this a sort of, how can I say, a sort of an issue that grew on you when you were with HubSpot or how did this come about? David: Yes. So as you mentioned, I was the Chief Product Officer at HubSpot before this. So I ran product engineering, all that stuff, CRM, built sales products, built all the marketing products. It didn’t have the idea then. When I left right around the time we went public as a company. I was looking at messaging and the reason I was looking at messaging was that I was fascinated with the way that it was being adopted. It had gone from just geeks like me using messaging to everyone in the world using messaging as the first thing that they wanted to use. So I was fascinated by why that was happening and why that was empowering companies like Slack and other companies to grow so quickly. So I was looking at that and I would say I was obsessed with that. I didn’t know how it was going to build, what kind of products that we were going to build because of that. But I just knew that maybe the time was right to finally do something with messaging and sales for the market. Jeroen: So it’s more like Slack, but done externally. David: Yes. Jeroen: Cool. You mentioned you were at HubSpot before. David: Yes. Jeroen: Is that the first startup you were ever involved in or were there others before? Where did it kind of start? David: Yeah, no. There’s been many. So I started four companies before starting Drift. One of those companies, my fourth company, Performable, was acquired by HubSpot in 2011. That’s how I got to HubSpot. I had sold all the other companies, the three others before that, but I had never gone as part of the acquisition. I had always made it a point to leave and this was the first time that I had gone. So I went into HubSpot when we were around $30 million in ARR and around 200 employees. Then I left when we were over 100 million and going public. We were I think 1,200 employees at that point so we added a thousand people in the time that I was there. Jeroen: Yeah. So can you give us an idea what your first startup was? David: Sure. It was so long ago. I was a part of two startups before I started my own and those were in New York. But the first company I started on my own was in November of 2000. So 18 years ago. Jeroen: Long time. David: Yeah, a long time ago, almost 18 years ago. That company was called Compete. We sold that company in 2007 to WPP which is the world’s largest marketing PR kind of conglomerate based in the UK. What we did at Compete was it was pretty much SaaS but that didn’t exist as a category back then. We called it like eCommerce for business or some crazy dumb idea, because we didn’t have a category. What we did was we sold marketing intelligence onto mostly Fortune 100 companies at that point although we had a freemium offering as well that people could buy. It was just a crazy time because basically, you could use Compete to figure out how you were doing relative to your competitors. So you can use tools like Alexa now and lots of other kinds of competitive intelligence tools. But at the time, none of those existed when we started Compete. Jeroen: Yeah, so it was like a very exclusive thing to see how your website was doing as compared to others. David: Yeah, exactly. We competed with Nielsen and comScore and a couple of companies like that, big companies. Basically, you would buy it to understand not only how much traffic you were getting and traffic sources and all that stuff that you can get on analytics , but to get real insights on why were people making the choices they were. It gave them insights into how and what they could change in the strategy to be able to attract those people. All sorts of stuff like that. In the beginning, it was a freemium type product but no one was buying freemium at that point. You got to remember, in 2000, people were barely buying books from Amazon, right? There was not much happening. Not many people were putting their credit card online if you can believe that, 18 years ago. So we had to pivot the company a little bit and really focus on this Fortune 500, Fortune 100 type of customer. So super expensive. They would pay us on average $350,000 a year per subscription and many of those were a multimillion dollar a year subscriptions. We would sell to all the travel companies you could think or finance companies. Later on, before we got acquired, our biggest customer was Google. We were selling to Google and eBay and Microsoft and all those kind of tech companies you could imagine but before that, it was really travel, automotive – all the car companies, finance and all sorts of verticals like that. Jeroen: Yeah. I guess WPP was selling for you somehow. It was a channel and at some point, they figured out, “We could also buy this.” David: Yeah, WPP was and is, the biggest communication services company in the world. I think that is what they call themselves. But they own PR, they own market research. They own all that kind of stuff. They own hundreds if not thousands of companies. What they wanted was our ability to see what was happening across all of these clients that they had. So we had that competitive intelligence data that no one had and served them kind of an unfair advantage in their client work but also in the strategy work that they were selling to those massive companies. Jeroen: Got it. Now, what was your second startup about then? David: So many. The second startup was called Lookery. That was almost like an accidental startup. I left Compete when we sold it. I wasn’t doing anything. I was just hanging out. Me and a friend kind of accidentally started this company. We weren’t actually trying to start a company. It was during the summer of 2007. This was also the time when Facebook launched their platform. So this was the first time Facebook had launched their platform. They were, if you could believe it, a couple of hundred million people using Facebook at the time, versus where we are now, billions. We had all of these friends that were building products, apps, on top of Facebook. Jeroen: Yeah, I remember. David: Yeah. There was everything from games to horoscopes to everything you could think of. There were a million different things. Later, it just became games. But before that, it was everything you could think of. They just happened to be friends of ours, we knew all those people. Some of those companies later became companies like Ziinga and other companies that went public. But before they did that, they didn’t have a way to make money and so we created this advertising network called Lookery and to help our friends make money, we sold that advertising network to Ad Knowledge. I forgot what year it was, 2008 or 2009. Then I started another thing. I started something called Ghostery. Jeroen: Yeah, I use that. David: Oh, you use it. Yeah, so I started Ghostery around that time, 2009. Then I sold it and now it’s owned by Mozilla in Germany. Then I started Performable which I mentioned earlier. Jeroen: Yeah. That all seems kind of in the marketing sphere somehow. David: Yeah, I’ve been in for 18 years. I’ve been in the marketing, sales and data analytics kind of world. Jeroen: Yeah, but that’s the first time you were in marketing more than sales and actually talking to people. David: Yeah, although you know it’s all related. Like at HubSpot, I built the CRM and built the sales productivity tools, the sales enablement tools – so that was there. But then too, the first startup, I was a part of the founding team, but not the founder. It was called Bolt, B-O-L-T. Bolt was one of the first social networks on the web. Again, we didn’t have the category social network so we called it a video website. We had millions of users which back then was incredible because they all had to dial up through modems to get online. In that case, we were building, we were bridging some of these same things, even though it was a social network. I mean, we built something that was like a thread list so you could create your own clothing. This was a long time ago, in 1997. We built something that kind of looks like Drift but we called it Zap. It was like an instant messenger but it was more than people just talking to each other. We built that back then. We built a lot of this stuff that now seems new but I’ve basically been doing the same thing for a long time. Jeroen: How does that feel? David: It feels like I’m finally figuring it out a little bit. There’s still lots to figure out. Jeroen: Yeah. How did you get into all of this? Like what did you do before getting into the startup space? David: Yeah, how’d I get into? Jeroen: Yeah, you’re an engineer by background if I’m not mistaken. David: Yeah, I was. Yeah, at that first startup, I was the chief software architect and built most of the software there and launched them and everything like that. When I grew up, my parents both worked for themselves. They were immigrants to the United States. So I always grew up wanting to start a business but I didn’t know what business was. I didn’t know why I had this concept in my mind. Because back then, this was before the internet, I didn’t have any role models that did any of this stuff. I didn’t know anyone who owned a business. So for some reason, I had this in my head and I always tell people that before recent history, before Mark Zuckerberg, nobody wanted to be an entrepreneur. This was not a glorious thing, to start a company. Entrepreneur, I didn’t even know that word when I first started. Starting your own business or doing what we do now in terms of a startup, was people would think you were a loser. Like why can’t you get a real job? Why can’t you work at a real company? This is not a thing that people bragged about. It was more of a thing that indicated that something was wrong with you or something was weird. But my wife says that I don’t like being told what to do so that probably had something to do with me wanting to start a company. I had some early mentors, kind of around college age, who were small business owners. I think they had a big impact on me, now looking back and that’s what led me into this world. I have an obsessive personality and I became obsessed with the early internet and it continues to this day. This idea of the kind of connecting everyone around the world, which we used to talk about in 1996 – that was what was happening with the internet. But it’s never as true as it is today. Jeroen: Yeah, I think maybe entrepreneur was not a thing but you could like to build stuff for yourself. David: Yes, that’s what I like. I like making something from nothing and that could be software, companies, whatever. But I just like the act of creating. That really, really drives me. It still does to this day – whether it’s creating flowers or creating companies, I like doing all of it. Jeroen: Flowers? You’ve created flowers? David: Yeah, I like gardening and growing stuff. I like everything. Jeroen: Right. When and what was the first thing you created and you were like, “I’m going to sell it” as well? David: Oh, that I was going to sell it? Jeroen: Yeah. David: I’m trying to think. The first time I created something publicly was really the first website that I worked on. I worked on it while I was at school and that’s what fueled to do all of this. But the first time I tried to sell something was probably at Bolt. We created that and we were trying to sell advertising and all that kind of stuff back then. Jeroen: Your first website, you ended up selling. Was it the GeoCities website or some other? David: That was before GeoCities. Jeroen: Before GeoCities. David: Yeah, I hand coded, before GeoCities started. They were probably starting a little bit after that and then a couple of other competitors of GeoCities were starting that. But back then, you had to hand code it. You had to hand code your own website. Jeroen: Just some HTML code. David: Yeah? Jeroen: That was it. Yeah. David: It’s crazy. Jeroen: So you like building things. You have had a bunch of startups in the marketing space mostly. Were most of these bootstrap or VC funded? David: No. Only one of them was technically bootstrap. That was Ghostery. The rest of them have been VC funded, including Drift. Jeroen: Yeah. Is that each time something you thought about beforehand or it’s something that, you just, at some point you needed money and you- David: The early ones, I think, Compete and a couple. Compete, I definitely thought about it beforehand. Ever since Compete, after we sold Compete, I’ve not thought about it and thought about it as funding it myself including Drift. My intent, in the beginning, was to fund it myself but like I tell people, the way to get investors interested in investing is to tell them you don’t need any money. That’s the truth and that was the truth in all cases. Jeroen: But you didn’t want them to give you money. Why did you end up having them give you money? David: Because, well, it depends on every case. In the case of Drift, which is the most recent, I’ll talk about that, it’s because we knew we were going to try to build an enduring company. We knew that we were building a SaaS company and by now, we had built so many SaaS companies that we knew the economics of SaaS. If we wanted to build a company at the speed that we wanted to build it and at the magnitude of how we wanted, it was going to take capital. It’s easy to get SaaS going now, very easy. But to really get to meaningful sizes, it needs capital because SaaS itself as a model consumes a lot of capital. Jeroen: Yeah. When would you take the capital? When do you decide to like, “My SaaS is ready for the capital?” David: It’s a personal choice for everyone. For me, at Drift, we took that capital day one. Jeroen: Day one. David: Day one. Which is unusual. Jeroen: But they want to have to want to give it to you, day one. David: They did so. Which is not always the case. But they did. Jeroen: What is it that you guys are doing at Drift nowadays. You just said before the talk that you’re very busy. David: Yeah, crazy. I’d say we’re pretty crazy right now. What are we doing? We’re trying to scale the company from a revenue standpoint and from a people standpoint. We started this year, the last year 2017, we started the year with around 20 people. We ended the year at 100 people. We started this year obviously at 100 people. We’re going to end the year with around 240 people. So therein lies a lot of stuff that we’re doing, right? Like a lot of hiring, scaling, training, onboarding and educating, making people effective, all that kind of stuff. Then trying to grow proportionally from a revenue size. We’re trying to 5X our revenues this year. Last year we 20X’ed our revenue. Of course, coming from a small number. But yeah, we’re trying to grow quickly. We’re fortunate in that there’s a lot of headroom in what we’re trying to grow. Jeroen: Yeah. In all of this, where do you fit into the picture? What is your role? David: I do podcasts like this one. Jeroen: Yeah, that’s all? David: That’s all I do! Jeroen: Pretty good. David: Yeah, I wish I just do that. What I do is, I spend most of my time trying to help other people reach their full potential and become effective. That has everything to do from spending time in hiring. I’m involved in every hire that we make, from intern to the highest level. So I’m in the part of that interview. So you can imagine that it takes a lot of time if we’re trying to have 140 people and everyone you talk to is not hired. That takes time. Beyond that, I work with our customers a lot. I spend a lot of time with customers. I spend a lot of time in the market and so I help a lot the between marketing and product. But it’s more on marketing than anything else because my co-founder here is great on products. So he’s taken over some stuff there. But I naturally gravitate towards product and now marketing. So I do our podcasts. I do videos. I do a lot of speaking. So I fly all over the place, all over the world, speaking, spending time with our customers, spending time with prospects. I’m constantly on the move and my days are not the days that an introvert like myself would dream of, right? I love every minute of it but my calendar is packed back to back on most days. But that’s what the business needs, right? It’s not like me doing deep work right now and putting some headphones on and just sitting in front of my computer. It is not going to move the company forward because I’m not helping anybody else, right? I’m not coding anymore. I don’t really have an effect when I do that at this scale. Jeroen: Yeah, so it’s all meetings for you, back to back, the whole day. David: Yeah, meetings or speaking with people or walks or stuff like that. So I hate meetings personally. I don’t have a lot of normal meetings but I do have a lot of one on ones. I believe a lot in investing in that. So we spend a lot of time, mostly walking around. Walking and talking. But in terms of meetings, with process and bureaucrats and all that bureaucratic process, no, we don’t have a lot of that. Jeroen: Yeah. So one on ones are mostly to align on the way of working or it’s mostly to align on what to do or how to do something? David: It depends. The way I think about it is and the way that we frame it is, the one on ones is owned by the person. So whatever our meeting was, it’s up to them to create that agenda. It’s their meeting. I’m just there to help them in whatever it is. So sometimes it might be some of the stuff you mentioned. It might be specific, how do I do something, the how. More often, it’s the ‘why’. Why am I doing something? Why should I feel excited about this? So I spend a lot of my time mostly there on the ‘why’ – making sure they’re excited. Making sure they’re fired up. Making sure they’re focused in the right areas. Less about the ‘how’ because they know the how better than I do. Jeroen: Yeah, I understand that. So it’s mostly one on ones. It’s helping on the marketing side also? David: Marketing, yeah, one on ones. The marketing’s a little different in that. I actually produced some of the marketing. So I’m on the video. I’m on the podcast, so that one, I’m on both sides of it. But from an idea standpoint and from a process standpoint, our marketing head, Dave, runs that. Jeroen: Okay. You’re the on videos, et cetera but you’re not actually the one strategizing for it. David: Yeah. Jeroen: Are you writing stuff? David: No, not really. I talk more than anything else and then maybe I’ll transcribe some of that stuff. Jeroen: You will transcribe it yourself? David: Sometimes. Sometimes, someone else will do it for me. Jeroen: You mentioned that you’re spending your time on hiring now. David: Yeah. Jeroen: You also mentioned that you’re going from 100 to 240. David: Yeah. Jeroen: Do you think you will still be involved in every hire at the end of the year? David: I don’t know. I’m trying to figure that out. Jeroen: Does that sound feasible to you? David: At 240, it does because I did that before. At HubSpot , I grew my team to over 200 and I was involved in most of that. So I do think it’s possible. I do think it’s important. So yeah, this year, I will. Will I be in it next year? I don’t know. I couldn’t tell you at the top of my head what our growth target is for next year in terms of headcount. But it will probably be the same kind of doubling again. Jeroen: Yeah. That’s going to be an enormous amount of work if you want to be involved in everything. David: For sure, for sure. But it is the work. I always say it’s the things that don’t scale that help you scale. Like in terms of recruiting people. The reason that I started kind of being in the process years ago, was that it helps with the recruiting process. Like I have people all the time that I may be recruiting at very junior levels or maybe someone who’s a coop or an intern and they’ll say things like, “Wow, I’ve never worked in a company or I’ve never heard of a company where the CEO will talk to me.” As crazy as that sounds – that sounds crazy to me; like they’ve never worked anywhere where this person would even talk to them. Forget about being in the interview with them. That has a meaningful impact. That helps in the recruiting process and it is the small things like that that people will remember and they will tell other people about. Jeroen: It also sets the culture somehow. It opens up the culture of openness and transparency when you get to talk to the CEO. David: Yeah. Jeroen: You also mentioned you’re walking around. Is this also a way of getting people to open up and bring their issues to you? David: 100%. I always kind of coach people on my team to never have a one on one meeting sitting down in a conference room or in a meeting room or things like that. Because it doesn’t feel like a natural discussion. It feels like an interrogation, right? It feels like you’re being questioned by the police. The worst versions of these are when people sit there with a laptop open, writing everything, typing everything that you’re writing, or a notepad, writing every word that David is saying. It’s insane, right? There’s no way that you’re going to be natural or comfortable if you’re looking at someone writing down every single word that you’re saying. Instead, make it like a normal conversation that you would have with someone. Walk around with them, get a coffee. Just go for a stroll outside and just let them talk. I find that when you do that, people are more comfortable. People are willing to tell you things that they would not normally tell you in the other process. Jeroen: So you’re actually walking around doing one on ones? David: Oh yeah, 100%. I don’t carry any notebooks or anything. I write down nothing. Just focused. I’m just paying attention to them. Jeroen: Yeah, sounds like a cool job. You said as an introvert, it’s not really what you want, what you like to do all day. But walking around sounds good, no? David: Yeah, the walking around part. I’ll say I like that part. I like one on ones. It’s like big group meetings and stuff like that, that is not the best. Jeroen: Like town hall meetings and all. David: Yeah. Jeroen: Do you do those? David: Yeah, we are going to do one tomorrow. So we do one usually the first Tuesday of every month. This one we delayed a week but we do those here. I give a lot of public talks so I do that all the time. Then we onboard new people. We have people start two days a month. There are two Mondays a month that people can start. On those days, we have, myself and my co-founder give like an hour-long kind of onboarding talk to those people. I give like half an hour and he gives the other half hour. So I spend my time there. That’s usually five to, I don’t know, from three to nine people depending on the class. Jeroen: What kind of other rhythms do you have in the business in terms of how long are the sprints set out? David: We don’t believe in sprints. Jeroen: No? David: No. Well, I should say I don’t believe in them. What we do is we let every product team decide their own cadence. We have something called the monthly marketable moment where we release something big from one of the product teams. Every month that is like a stand-alone product, almost. It’s huge. But those teams could work on that for a while. We have lots of teams working in parallel. But otherwise, we work on a daily cadence. We don’t work on this kind of artificial sprint thing. We work on this daily cadence and we have a methodology that we’ve created which is the ‘continuous development methodology’ and I’ve written about it in this book I wrote called ‘Hyper Growth’. It’s free on our website or you can get it on Amazon. It goes into details about it. But our cadence, otherwise, outside of that monthly meeting is that we have a Monday metrics meeting. So this morning we had a meeting. We have that at 9:30 am every Wednesday. It’s a 15-minute meeting. We don’t like to spend too much time in meetings. We just go over the last week’s performance across product, marketing, sales, support, success – every team. It’s really quick. It’s 15 minutes or less. We bookend that and we have all company meeting on Fridays. It’s called ‘show and tell’. It’s at the end of Fridays so it’s Friday afternoon at the end of the day and people have beers and it’s fun. In that, people show what they worked on that week. We started that tradition mostly for the product team so that they can show the customer stuff that they’ve released to the customer that week, and educate the rest of the team. But now everyone, every team in the company, presents something. Again, it’s really fun and quick and laughs over beers, and relaxing. Then that ends the week. So we have the bookends. At the beginning of the week, we’re like, “How did we do?” and at the end of the week, it is, “What did we actually make?” Jeroen: For the how did we do part, if it’s only 15 minutes, how do you actually decide on how to deal with the metrics, like how to improve them or where does that happen? David: That happens. The individual teams work on that all week and how to make it better. We have one person who’s our VP of operations who owns the Monday metrics meeting and puts everything together. He decides on the flow of that meeting and he’s the only one that’s presenting. He’s doing a quick run through all the metrics. Right now, we’ve done it for so long that we have a pretty streamlined and effective method there. But the solution on how to fix things, those solutions don’t come from us, from me or from him or from someone else. They come from the teams. The teams have to decide that. Jeroen: Sounds good. What is it actually as the main skill or as a set of skills that you think you as a founder bring to the business? David: I’m trying to figure this out over the years. What am I actually good at. I’d say I’m good at zooming in, zooming out – that’s my style of management. I’m good at going into whatever the domain is because I’m obsessive about learning. I can learn things really quickly at a fairly good level, not the deepest but pretty deep. So I can go pretty deep because I’m so obsessive about stuff. So I can do that. I can zoom in and then I zoom out a lot and then I work at a very high level. So what that looks like every day is that I’m good at or I’m decent at the high-level stuff and I spend a lot of time there and we talked about some of that stuff. Then I zoom in at a very low level – like having interviews with people, giving product feedback, giving marketing feedback and then I zoom back out. That’s kind of my skill now. I can do that easily. I spend no time in the middle, like how do we solve something and how do we do that. That’s for the teams to handle. I work at the very high level and on the very low level and I care about every single detail like moving to a new office. I care about what do the colors look like, what does the layout look like, what does the experience look like, how will it feel for a new person coming in? Just all sorts of little details that people overlook. I spend a lot of time thinking about those and remain worried about those. Jeroen: Then someone else makes it happen. David: Yes. They decide on how to make it happen. Jeroen: Yeah, got it. If you say you’re obsessive about learning, how do you go about it? How do you usually learn stuff? David: I’m super hands on. So I read a lot. Jeroen: Books or blogs? David: No blogs. Books. Books, videos, audio, that kind of stuff, but usually long form – mostly books and from mentors. So I have a lot of mentors and role models and people. So I spend a bit of my time to just go and meet these people who are ahead of me. Mentors that I have, learning from them. I used to read a lot of blogs and stuff like that but most of that information is not great. It’s not useful, so I stopped doing that. What I look for now are lessons from people who are 10, 20 years ahead of me and have lessons that have stood the test of time. I also look at books that have stood the test of time. So I’m not necessarily reading the newest book but I’m reading the books that have been around for a while and have kind of lasted. So I’m looking for those things that have stood the test of time. I find most blogs and stuff are very low, little detail and very much a fad in how they wrote things and so I don’t actually spend a lot of time doing that anymore. Jeroen: Yeah, so what are some of the books that we have to think of when you say books that stood the test of time and who are your mentors? David: I have so many. Well, I have a number of them. They’re always changing. I have my first three mentors, all had the same first name, Sam. Yeah, one of them was Sam Lee and he was a guy who was a mentor to me from high school to college. He was the first kind of successful multimillionaire person I had ever met in my life. An immigrant from Taiwan. Started a bunch of wholesale businesses in New York where I grew up. Then my second mentor was also named Sam and he was a virtual mentor. I believe in virtual mentors a lot. That Sam is Sam Walton and that was through the book. I’ve everything I can on Sal Walton. He started the company called Walmart and I loved his book, ‘Made in America’, that’s a required reading here at Drift. Then my third Sam is called Sam Zales. He has been a part of many successful companies and a COO of a public company called CarGurus here in Boston and I got to spend time with him. I have other mentors besides those but I’ll start with those three. Jeroen: Cool. What is the latest good book you’ve read and why did you choose to read it? David: Oh my goodness. I’m always reading something. I read so many books that I often have too many to recommend. If you ask me for a book recommendation or what was the last good book I read, I’m always stuck. There are three books that I give to every person at Drift on the management team. Because these are the three books that I think have shaped the way that we think at Drift the most. One of them is, I mentioned already and it’s called ‘Made in America by Sam Walton’, so that’s the story of Walmart. The second book is called the ‘Everything Store’ and it’s about Amazon. Then the third book is called ‘Built from Scratch’. That book is the story of a company called Home Depot, which is a big company here. I didn’t do this on purpose because all the three books are about retail. Jeroen: That’s what I was about to say. David: Yeah, it has nothing to do with what you would think that I do. But they’ve had the biggest impact on the way that I think and that’s why I give those books out and ask everyone to read those. The reason I think so is that lot of what Drift does and the thing that I’m obsessed around is creating this most customer-centric company possible. All of these books, because they are retail, they have to be customer-centric, right? Because they’re dealing, that is the retail business, is just dealing with your customer. So all three of these books are good models in building customer-centric companies and that’s why they’ve had a big impact on me. But I’ve read a million, million, million other books that I can recommend and one that I’ll just shout out, that if you’re looking for trying to be the best version of yourself, it’s a book called Peak Performance and is written by Brad Stulberg, fantastic book. Brad is actually a personal coach of mine, so I’ll disclose that. So he coaches me and we have calls a couple of times a month. Jeroen: Now back to the three books. I’ve read the one on Amazon myself. The one about Walmart is on my list. The one on Home Depot, not yet. I’m seeing that they are very customer-centric and that can inspire you. But what are some lessons you would, for instance, take from the Amazon book that you’ve implemented at Drift? Because that I have a hard time seeing. David: You have a hard time seeing that? Jeroen: Yeah. Like at the top of my head. David: Yeah, Amazon is probably the most formative kind of company in terms of Drift and how we think about things. At the end of the day, because what you see of Drift today is chat, sales – you see that kind of stuff that you mentioned at the beginning. But fundamentally, what we’re trying to do at Drift, kind of our long-term vision is that we’re trying to create the new way that businesses buy from businesses. So because of that, there are a lot of things that are more related to Amazon than you think, at least from the retail side of things. Because Amazon is fundamentally the way we all buy from businesses as consumers. So we’re trying to look at the models that they have and trying to see which ones of those can we take and learn from, which one of those are not applicable and how do we use these. Because of that, there’s a lot that overlaps. It’s like if I just think about the way that we train people inside of Drift on marketing, right? In marketing, we talk a lot about or I talk a lot about cognitive biases, social psychology, how do people make decisions to buy things, etc. The best example or one of the best examples that you could use is to go look at the Amazon product detail page, right? If you’ve been buying from Amazon for as long as I have, since the beginning, since they started actually, you’ll know that the product page has not really changed much. The design has advanced a lot but it hasn’t changed much. One of the reasons I believe that’s true is because it’s like the perfect page from a social psychology standpoint and we’ll use that page as an example for our marketers to teach them about things like scarcity, right? Where do you see that on that page? You see that if you look at the page and it says, “Hey, you get free delivery by Wednesday. If you order within eight hours and 13 minutes, you’ll get this at your house by Wednesday.” Or you’ll see little things that will say something like, “Only three left in stock. Order now. More coming soon.” So that’s scarcity. Then you look at things like social proof , right? It is another way in which we make our decisions. Then you can see the customer reviews on all the product pages. You can see the customer images that people have uploaded, the videos that people have uploaded and all those things are social proof for a product. You can see how high this thing ranks in terms of being the best seller – again, social proof. So I can continue on and on but there are so many cognitive biases that this page can have when we count; can have anywhere from five to ten different cognitive biases all working at once on this page. Why it’s so successful, is an example for us in marketing. Jeroen: Yeah, I can see how it can easily translate to market. Does it also inspire your products or your company? David: Oh, it definitely does. There, we have very similar kind of leadership principles that they have – obviously about being customer-centric. About seeking out the truth about having a bias for action, right? That is important to us. Our speed is incredible. Their speed is incredible. So it translates on that end. In terms of our product, obviously, we’re selling to businesses and people who are salespeople. They can do any of that, but if you just look at it from that point, then you’re like, “Oh, they’re not similar.” But they are similar in the mechanics of how that works because at the end of the day, we are people who are buying on Amazon and whether you sell B2B or not, you’re still a person buying from another person. Jeroen: So Amazon’s recommendation engine and Drift’s, share both or one and the same thing in the end? David: Yes. Jeroen: Cool. Just as the last question, not the easiest one, what’s the best piece of advice you ever got? David: Oh my goodness. That is a good question. No one’s asked me that, I’m surprised. What is the best piece of advice? Probably, the one I’m just coming up with at the top of my head is sleeping on it. Sleep on it. We all want to jump and react and give an answer to something right away. But often, the best answer is just to sleep on it and come back to it. Jeroen: What are some of the things you sleep on? David: Oh, I use the ‘sleep on it’ technique with every hire that we make. So every person that I talk to, I don’t give my opinion on the conversation to the hiring manager until the next day. I let myself sleep on it. That often gives me the right answer, because you can have yourself become very excited during the interview process because they were funny and you talked to them and you need someone in this role and blah, blah, blah, all those things. Then you might end up with the wrong answer. So I sleep on it. If I still feel excited the next day, then that’s the right answer. Jeroen: Cool. Thank you, David, for being on Founder Coffee. David: Thanks so much for having me. This was awesome. — Enjoyed it? Read Founder Coffee interviews with other founders. ☕ — We hope you liked this episode. If you did, review us on iTunes ! — For more hot stuff on startups, growth and sales 👉 subscribe here 👉 follow @salesflare on Twitter or Facebook var _paq = _paq || []; var url = “https://salesflare.storychief.io/interview-david-cancel-drift?id=1553005117&type=2”; const queryDict = {}; location.search.substr(1).split(“&”).forEach(function(item) {queryDict[item.split(“=”)[0]] = item.split(“=”)[1]}); if (‘contact’ in queryDict){ const separator = (url.indexOf(“?”)===-1)?”?”:”&”; url = url + separator + “contact=”+queryDict[‘contact’]; } if (‘list’ in queryDict){ const separator = (url.indexOf(“?”)===-1)?”?”:”&”; url = url + separator + “list=”+queryDict[‘list’]; } _paq.push([‘setDocumentTitle’, ‘David Cancel of Drift’]); _paq.push([‘setCustomUrl’, url]); _paq.push([‘trackPageView’]); _paq.push([‘enableHeartBeatTimer’, 15]); _paq.push([‘enableLinkTracking’]); (function() { var u=”//storychief.piwikpro.com/”; _paq.push([‘addTracker’, u+’piwik.php’, ‘b4bf56dd-9b24-4318-a472-b8522fe85e05’]); var d=document, g=d.createElement(‘script’), s=d.getElementsByTagName(‘script’)[0]; g.type=’text/javascript’; g.async=true; g.defer=true; g.src=u+’piwik.js’; s.parentNode.insertBefore(g,s); })(); Author Recent Posts Jeroen Corthout Co-Founder & CEO at Salesflare I'm Co-Founder & CEO at Salesflare , the intelligent sales CRM for small and medium-sized businesses selling B2B. I've helped thousands of companies streamline their sales and CRM over the past 10+ years. I love automating sales, building beautiful products, and writing about all of these topics. Latest posts by Jeroen Corthout ( see all ) 7 Best Simple CRMs in 2025 - August 27, 2025 7 Top CRM Tools in 2025 - June 19, 2025 Sales Operations in B2B: A Complete Guide - April 24, 2025 You might also like 👇 Prev Main Blog Next © 2025 Salesflare. All rights reserved. setTimeout(function(){ ! function(f,b,e,v,n,t,s) {if(f.fbq)return;n=f.fbq=function(){n.callMethod? n.callMethod.apply(n,arguments):n.queue.push(arguments)}; if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0'; n.queue=[];t=b.createElement(e);t.async=!0; t.src=v;s=b.getElementsByTagName(e)[0]; s.parentNode.insertBefore(t,s)}(window, document,'script', 'https://connect.facebook.net/en_US/fbevents.js'); fbq('init', '845875802114448'); fbq('track', 'PageView'); }, 10000); // made it 10s instead of 3s on 29th of April 2024 in an attempt to not have it affect page speed and only retarget relevant people"
    },
    {
      "url": "https://www.salmonriverdrifters.com/meet-the-crew",
      "text": "About Us — Riggins Idaho Drift Boat Fishing — Salmon River Drifters 0 Skip to Content Steelhead Steelhead Fishing Day Trips Multi Day Steelhead Fishing Steelhead Spey Fishing Chukar Hunting Bass Bass Fishing Day Trips Overnight Bass Fishing Trips Salmon Salmon Fishing Day Trips Chukar Hunting All Fishing Trips All Fishing Trips Steelhead Fishing Smallmouth Bass Fishing Salmon Fishing Chukar Hunting Multi Day Steelhead Fishing Overnight Bass Fishing About Us About Us Photos SRD Blog The Drift Boat Special Packages Multi Day Steelhead Fishing Overnight Bass Fishing The Salmon River Domes Getaway Shuttles Contact Us FAQ Book Online! Open Menu Close Menu Steelhead Steelhead Fishing Day Trips Multi Day Steelhead Fishing Steelhead Spey Fishing Chukar Hunting Bass Bass Fishing Day Trips Overnight Bass Fishing Trips Salmon Salmon Fishing Day Trips Chukar Hunting All Fishing Trips All Fishing Trips Steelhead Fishing Smallmouth Bass Fishing Salmon Fishing Chukar Hunting Multi Day Steelhead Fishing Overnight Bass Fishing About Us About Us Photos SRD Blog The Drift Boat Special Packages Multi Day Steelhead Fishing Overnight Bass Fishing The Salmon River Domes Getaway Shuttles Contact Us FAQ Book Online! Open Menu Close Menu Folder: Steelhead Back Steelhead Fishing Day Trips Multi Day Steelhead Fishing Steelhead Spey Fishing Chukar Hunting Folder: Bass Back Bass Fishing Day Trips Overnight Bass Fishing Trips Folder: Salmon Back Salmon Fishing Day Trips Chukar Hunting Folder: All Fishing Trips Back All Fishing Trips Steelhead Fishing Smallmouth Bass Fishing Salmon Fishing Chukar Hunting Multi Day Steelhead Fishing Overnight Bass Fishing Folder: About Us Back About Us Photos SRD Blog The Drift Boat Folder: Special Packages Back Multi Day Steelhead Fishing Overnight Bass Fishing The Salmon River Domes Getaway Shuttles Contact Us FAQ Book Online! Fred & Lisa Taylor Thanks for checking us out! Welcome to Salmon River Drifters. We are Fred & Lisa Taylor - we are a husband & wife duo, and proud parents of two little anglers, Mackay & Maizie. We are very fortunate to call the Salmon River Canyon our home, and we want to share it with you! Fred was quite literally raised in the Salmon River Canyon. His love for the Salmon River didn’t just come guiding, but is deeply rooted in childhood memories of chasing Steelhead with his grandpa, and spending time on the water with his family. Playing on the river wasn’t just an occasional thing, it was an every day occurrence. Fred’s motivation for sharing his childhood backyard with his guests comes from a very personal level. When Lisa moved to Riggins she knew there was something special about this place and that Riggins where she wanted to stay grounded. One of the first things she did after moving to Idaho as a teenager was go rafting on the Salmon River, and she’s been in love with the canyon ever since! Lisa has been in the outfitting industry coordinating trips and working with guests for over a decade, the experience she brings to our business is unrivaled. Alongside our operation at Salmon River Drifters - Fred is the operations manager for Orange Torpedo Trips Rafting, and the “Community Schools Coordinator” for Salmon River Joint School District. Lisa works as the Preschool teacher & Special Education Director for Riggins Elementary School. Fred is also an Advanced EMT with Salmon River Ambulance District. We are so happy to share our passion with you. Outfitting & Guiding is more than just a business to us. It’s a lifestyle that has shaped who we are as people & how we raise our family. We want you to be a part of our ever-changing story. Meet The guides Fred Taylor Owner, Drift Boat Guide Read Bio Tyler Dixon Drift Boat Guide Read Bio Chase Alford Drift Boat Guide Read Bio Ryan Aronson Drift Boat Fly Fishing Guide Read bio Zak Sears Drift Boat Guide Read Bio Mackay Taylor Drift Boat Guide (In Training) Read Bio About us Steelhead fishing trips CONTACT US Salmon fishing trips SRD Newsletter Signup Bass Fishing Trips RESERVATION POLICY Chukar Hunting PURCHASE SRD MERCH River shuttle services GIFT CARDS Reviews Contact: P.O. Box 1142 Riggins, ID 83549 Call or text: 208-507-8447 Email: info@salmonriverdrifters.com Salmon River Drifters, LLC operates under special use permits issued by the Bureau of Land Management Cottonwood Office. Salmon River Drifters is an equal opportunity recreation service provider. Salmon River Drifters is a fully licensed, bonded, & insured outfitter in the state of Idaho. Outfitter license #24881 Copyright © 2025 Salmon River Drifters, LLC - All rights reserved"
    },
    {
      "url": "https://www.ami-canada.com/contactus.html",
      "text": "AMI Canada - Contact Us Headquarters: Toronto, Canada 855-264-4433 info@ami-canada.com Toggle navigation Home Our Story AMI Canada AMI in Canada AMI (Canada) Mission & Goals AMI Global Membership Become a Member Membership Area Contact Us About Montessori What is Montessori? History Overview of Programs Research Blog Glossary Parents & Families Know Quality Choosing a Montessori School Montessori Quality Assurance Parent Checklist Find a School About My Child Newborn Infant Toddler Child 3- 6 Years Child 6 - 12 Years Adolescent 12 â 18 Years Parent Resources Teachers & Schools Montessori Educators Teachers Assistants Administrators Professional Development Canada North America International Job Opportunities MQA About MQA & AMI Global Accreditation Essential Characteristics for MQA Accreditation Summary Comprehensive Description Guidelines - Detailed Descriptions Infant Community Primary Classes Elementary Classes Consultation & Coaching Find a School Training Montessori Training in Canada Why AMI Training? AMI Global Training Centres AMI (Canada) Unit 13 - 2100 Bloor Street West Toronto, ON M6S 1M7 1-855-AMI-4433/1-855-264-4433 www.ami-canada.com info@ami-canada.com 2017-2024 © All Rights Reserved by AMI Canada."
    },
    {
      "url": "https://driftkings.com/contact/",
      "text": "Contact Us for All Your Inquiries - Drift Kings International Series | Events Around The World Since 2005 Home Shop Register Rules Rankings Media About Us Score Events Qualify Contact US Send Drift Kings International Series 10 Eliezer Kalev\n4000 Plovdiv\nBulgaria +33676663054 office@driftkings.com Newsletter Subscribe Please do not fill in this field. Subscribe Embark on a two-decade legacy of excellence with us.  Join us  for an era-defining drift experience, featuring the best drivers and intense competitions.  Celebrate excellence and passion with Drift Kings! +33676663054 office@driftkings.com Contact © Drift Kings International Series Privacy policy MENU Home Shop Register Rules Rankings Media About Us Score Events Qualify"
    },
    {
      "url": "https://driftmediasolutions.com/about/",
      "text": "About Us | Drift Media Solutions Skip to content Services Traditional Solutions Digital Solutions Website SEO Checker Our Work About Us Outdoor Conservation Case Studies Freddy’s Frozen Custard & Steakburgers Ohm Fitness Tanner Gun Show Rocky Mountain Bridal Show McCune Legal Colorado Gun Collectors Association Dryer Vent Techs Prairie View Outfitters Blog Menu Services Traditional Solutions Digital Solutions Website SEO Checker Our Work About Us Outdoor Conservation Case Studies Freddy’s Frozen Custard & Steakburgers Ohm Fitness Tanner Gun Show Rocky Mountain Bridal Show McCune Legal Colorado Gun Collectors Association Dryer Vent Techs Prairie View Outfitters Blog CONTACT US We Are A Full-Service Marketing Agency Growth is achievable. We are obsessed with our client’s success. Meet Drift Media. Harnessing brilliant strategies so you can achieve your objectives and aspirations. The Drift Way The term “Drift” is a fly fishing reference centered around consistency and patience, knowing that if you put in the time, energy, and effort to do things the right way, the result will come. In terms of fly fishing, it means catching a dream fish in a pristine wilderness environment. We translate this reference slightly differently in terms of marketing but with the same desired result. Drift Media has been servicing marketing clients in all industries since 2019 by providing constant marketing and advertising efforts with no rash decisions or knee-jerk reactions to the marketing landscape, just consistent efforts based on proven results and transparency. If you appreciate our approach and value building a long-term relationship with a marketing agency that cares, please connect with us to see how Drift Media can also help your business. The Dream Team We are ready to elevate your brand and guide you to success. Contact Us Adam Sizemore CEO Linkedin Jay Kuewa-Mokiao Technical Project Architect & Manager Haele Manrique Marketing Coordinator Laura Swink Marketing Coordinator DeAnn Sizemore Marketing & Campaign Director Jacob Thorne Web Developer Cesar Valery Marketing Coordinator Naru Kang Lead Shopify Developer Linkedin Linda Cabral Marketing Coordinator David Mekelburg Marketing Coordinator Rylie Barden Marketing Coordinator Featured Work SEE MORE OF OUR WORK Remarkable Clients I highly recommend working with Adam from Drift media, he's a great problem solver, resourceful, consistent and attentive to our specific needs. Thank you Adam, you're the best! Sadie Klein They've been an excellent partner on local, out-of-home ad campaigns. Adam is professional, easy to work with, and knows the business. If you have the chance to work with Adam and Drift Media, you should take it! Jake Mansfield Drift Media Solutions is a highly professional media company that drives exceptional value for their clients thru savvy strategic plans and negotiation. Highly responsive as well. David Menk Adam is great to work with.  He's a true professional and knows his clients well.  He's always looking for the best way to drive ROI with effective media strategies. Michael Alarcon One of the best things about working with Adam with Drift Media is the consistency of personal attention to our partnership.  Drift Media is super-creative and are always willing to innovate to help the clients we share standout in the marketplace. They have never failed to deliver a customized solution to both our business goals.  Adam is both a pleasure to work with and his customer service is phenomenal! Aimee Grable Previous Next CONTACT US Drift Achievements LEARN MORE ABOUT US Consult With Us Today A 30-minute needs analysis will give you all the details you’ll need to make the decision your company deserves. CONTACT US Solutions Digital Traditional Website SEO Checker About Us Blog Connect marketing@driftmediasolutions.com Contact Us Linkedin-in Privacy Policy | Terms & Conditions ©2019 – 2025  |  All Rights Reserved  |  Powered by Drift Media Services Traditional Solutions Digital Solutions Website SEO Checker Our Work About Us Outdoor Conservation Case Studies Freddy’s Frozen Custard & Steakburgers Ohm Fitness Tanner Gun Show Rocky Mountain Bridal Show McCune Legal Colorado Gun Collectors Association Dryer Vent Techs Prairie View Outfitters Blog Services Traditional Solutions Digital Solutions Website SEO Checker Our Work About Us Outdoor Conservation Case Studies Freddy’s Frozen Custard & Steakburgers Ohm Fitness Tanner Gun Show Rocky Mountain Bridal Show McCune Legal Colorado Gun Collectors Association Dryer Vent Techs Prairie View Outfitters Blog CONTACT US"
    },
    {
      "url": "https://www.amigrp.com/contact",
      "text": "Contact | AMI Group top of page OUR STORY AMI INFLIGHT Your Global Solution Markets Airlines Cruise Lines Caribbean Relief Solutions Food Beverages Innovation Program Management About Our Story Our Team Our Core Values News Contact More Use tab to navigate through the menu items. CONTACT US Get In Touch AMI Headquarters 725 Arizona Ave., Suite 200 Santa Monica, CA 90401 Tel +310-458-1384 Atlanta Office 8800 Roswell Rd., Building A, Suite 265 Atlanta, GA 30350 Tel +770-804-0903 AMI Inflight Americas & Europe Food & Beverages for Airlines Renee Thornhill Tel +1-770-804-0903 rthornhill@amigrp.com AMI Inflight Middle East Food & Beverages for Airlines Marcel Kahlow Tel +971 52 233 9961 For European Inquiries Tel +353-1-853-7813 mkahlow@amigrp.com AMI Wines Wines for Airlines Janine Bennett Tel +1-773-406-9100 jbennett@amigrp.com AMI Duty Free Beverages & Wine for Cruise Lines Caroline Poizat Tel +1-786-840-3640 cpoizat@amigrp.com AMI Caribbean Beverages for Caribbean Markets Caroline Poizat Tel +1-786-840-3640 cpoizat@amigrp.com ARI Relief Food for Relief Organizations Andrea Pratt Tel +1-770-804-0903 apratt@amigrp.com © 2025 AMI Group bottom of page"
    },
    {
      "url": "https://martechseries.com/analytics/b2b-data/drift-appoints-enterprise-software-veteran-steve-lucas-to-board-of-directors/",
      "text": "Drift Appoints Steve Lucas, to Board of Directors Document ABOUT ITECHSERIES Editorial Lead Generation Events SUBSCRIBE NOW TALK TO SALES MarTech Radar A Account Based Marketing Advertising Trends Affiliate Marketing AI/ML Analytics Apps for Business Audience Data Audio advertising Augmented Reality B B2B Data Behavioral Marketing Brand Safety C Content Management Content Marketing Content Syndication Customer Acquisition Customer Data Platforms Customer Experience Management Customer Identity Management D DaaS Data Hygiene Data Management Platforms Data Visualization Digital Asset Management E E-Commerce and Mobile Commerce Email Marketing Entertainment Events Promotion G Guest Authors I Identity Management In App Marketing Influencer Marketing Intelligent Assistants Interactive Content Interviews M Marketing Attribution Marketing Automation Marketing Clouds Marketing Intelligence Martech Budgets MarTech Expert Series MarTech Videos MartechSeries Messaging Mobile Mobile Advertising Mobile Marketing N Native & Programmatic Advertising P People-Based Marketing Predictive & AI Predictive Marketing Privacy and Regulations Programmatic Email R Recommended S Sales & Marketing Sales Analytics Sales Enablement Sales Intelligence Social Commerce Social Media Advertising Social Media Monitoring Social Media Platforms Speech Recognition Staff Writers Social Media Marketing T Technology TV Advertising U Unified Communications V Video Video Advertising Video Interview Video Marketing Video Platforms Voice Search W Whitepapers MarTech Interviews MarTech Interview Series MarTech Insights Guest Authors Staff Writers Resources Ebooks Webchats The SalesStar Podcast The SalesStar Podcast: Episodes 220 Onwards (Year: 2025) The SalesStar Podcast: Episodes 192 Onwards (Year: 2024) The SalesStar Podcast: Episodes 148 to 191 (Year: 2023) The SalesStar Podcast: Episodes 109 to 147 (Year: 2022) menu All Categories All Categories Computers Laptops Cameras Hardware Smartphones MarTech Radar A Account Based Marketing Advertising Trends Affiliate Marketing AI/ML Analytics Apps for Business Audience Data Audio advertising Augmented Reality B B2B Data Behavioral Marketing Brand Safety C Content Management Content Marketing Content Syndication Customer Acquisition Customer Data Platforms Customer Experience Management Customer Identity Management D DaaS Data Hygiene Data Management Platforms Data Visualization Digital Asset Management E E-Commerce and Mobile Commerce Email Marketing Entertainment Events Promotion G Guest Authors I Identity Management In App Marketing Influencer Marketing Intelligent Assistants Interactive Content Interviews M Marketing Attribution Marketing Automation Marketing Clouds Marketing Intelligence Martech Budgets MarTech Expert Series MarTech Videos MartechSeries Messaging Mobile Mobile Advertising Mobile Marketing N Native & Programmatic Advertising P People-Based Marketing Predictive & AI Predictive Marketing Privacy and Regulations Programmatic Email R Recommended S Sales & Marketing Sales Analytics Sales Enablement Sales Intelligence Social Commerce Social Media Advertising Social Media Monitoring Social Media Platforms Speech Recognition Staff Writers Social Media Marketing T Technology TV Advertising U Unified Communications V Video Video Advertising Video Interview Video Marketing Video Platforms Voice Search W Whitepapers MarTech Interviews MarTech Interview Series MarTech Insights Guest Authors Staff Writers Resources Ebooks Webchats The SalesStar Podcast The SalesStar Podcast: Episodes 220 Onwards (Year:2025) The SalesStar Podcast: Episodes 192 Onwards (Year:2024) The SalesStar Podcast: Episodes 148 to 191 (Year:2023) The SalesStar Podcast: Episodes 109 to 147 (Year:2022) About iTech Series SUBSCRIBE NOW TALK TO SALES You Might Also Like Digital Brands Group Expands Partnership with Amaze to Strengthen Domestic Apparel Manufacturing Vosyn Accelerates AI Innovation with Google Cloud Nomix Group Launches to Solve the Modern Challenges of Performance Marketing and the Future of AI Shopping « Previous Next » Drift Appoints Enterprise Software Veteran, Steve Lucas, to Board of Directors MTS Staff Writer February 15, 2022 Share Facebook Twitter Linkedin CEO of iCIMS and Former Marketo CEO Brings Extensive Leadership, Sales Strategy and Technology Expertise Drift , a leader in Conversational Commerce for B2B, announced that Steve Lucas has joined its board of directors. Steve brings extensive global leadership experience in enterprise software to the board and has spent more than 20 years in senior executive leadership roles. Steve is the CEO of iCIMS , a talent cloud company, and was the former CEO of Marketo, where he tripled the value of the company, resulting in the sale of Marketo to Adobe in 2018, the largest acquisition in Adobe’s history. Prior to Marketo, Steve served in senior leadership roles at SAP, Salesforce and Business Objects. Marketing Technology News: MarTech Interview with Francis McMahon, EVP, Canon Solutions America “Steve’s impressive track record of accelerating revenue, increasing efficiency across best-in-class teams and strengthening customer success will be invaluable to us as we scale and innovate to meet the needs of our customers across the globe,” said David Cancel, co-founder and CEO of Drift. “Steve has already proven to be a trusted advisor and we are thrilled to welcome him to the board. I know his unique experience and guidance will help us deliver on our mission to make it easier for businesses to buy from businesses.” Steve was sourced through Vista Equity Partners independent board program. Launched in 2017, the program identifies leading independent board members for Vista portfolio companies and works to create a diverse pipeline of qualified board candidates through programs and partnerships that advance diversity for all boards and drive impact for the corporate world at large. Marketing Technology News: Samba TV and PubMatic Launch Australia Partnership to Deliver Programmatic Omniscreen TV “Drift is addressing an urgent and growing pain in the market to meet buyers at the right place, at the right time with the right conversation in our increasingly digital world,” said Steve. “David and the Drift team are category creators and leaders and I’m honored to join the board at such a pivotal moment in the company’s growth trajectory.” Other members of Drift’s board include Izhar Armony, Shannon Bracken, Roxane Divol, Tom Hogan, Monti Saroya, Elias Torres and David Cancel. Share Facebook Twitter Linkedin Popular Posts Digital Brands Group Expands Partnership with Amaze to Strengthen Domestic Apparel Manufacturing September 9, 2025 Read More » Vosyn Accelerates AI Innovation with Google Cloud September 9, 2025 Read More » Nomix Group Launches to Solve the Modern Challenges of Performance Marketing and the Future of AI Shopping September 9, 2025 Read More » LifeSaver Launches AI Messaging Assistant To Enhance Communication Channels Between Framing Retailers and Their Customers September 9, 2025 Read More » GUEST ARTICLES Disrupt or Be Disrupted: The AI Wake-Up Call for B2B Marketers September 8, 2025 Unlocking Real-Time Marketing: The Shift from Legacy Tools to AI-Driven Strategies September 4, 2025 Time to Start Holiday Marketing is Now September 2, 2025 Customer Journey Mapping Reimagined: Designing Experiences That Matter August 27, 2025 Follow Us Facebook X-twitter Linkedin MTS Staff Writer MarTech Series (MTS) is a business publication dedicated to helping marketers get more from marketing technology through in-depth journalism, expert author blogs and research reports. Prev Previous Wish Unveils New Shoppable Video Feature to Tap Into Growing Demand for Immersive Content Next Rezolve Names Former Adobe Marketing Head Sunder Madakshira CEO of India Operations Next You Might Also Like Digital Brands Group Expands Partnership with Amaze to Strengthen Domestic Apparel Manufacturing Vosyn Accelerates AI Innovation with Google Cloud Nomix Group Launches to Solve the Modern Challenges of Performance Marketing and the Future of AI Shopping « Previous Next » About Us MarTech Series covers marketing technology news, editorial insights and digital marketing trends from around the globe. Updates on modern marketing tech adoption, martech interviews, tech articles and events. Quick Links News Interviews Insights MarTech RADAR Events Contact Us Visit Our Other Sites Follow Us Facebook X-twitter Linkedin Interested in our Customized Editorial Services? Please fill your details and we'll get in touch with you! FILL YOUR DETAILS Brought to you by Copyright © 2025 MarTech Series. All Rights Reserved. Privacy Policy To repurpose or use any of the content or material on this and our sister sites, explicit written permission needs to be sought."
    },
    {
      "url": "https://www.annamarialifevacationrentals.com/drift-in-ami/",
      "text": "Drift In Lounge Homes For Sale Owner Login Blog Home Vacation Rentals All Rentals Newest Properties Anna Maria Vacation Homes Bradenton Beach Vacation Homes Holmes Beach Vacation Homes Search by Amenity Beachfront Rentals Last-Minute Rentals Pet Friendly Rentals Search by View Search by Bedroom View All Availability About Us About The Team FAQ’s Join Our E-Mail List Terms and Conditions Privacy Policy Area Guide Attractions Journeys Beaches Restaurants About The Area Blog Explore Here Getting Here Island History Local Services Supply Rentals Weddings Property Management Property Management Contact 941-567-6253 Properties 5 O'Clock Somewhere - 216 Chilson AMI Boathouse - 520 Loquat AMI Dreaming - 4200 Gulf 105 AMI Lucky - 524 South Dr AMI Retreat - 746 Jacaranda AMI Sand Dollar - 6403 B Holmes AMI Starfish - 6403 A Holmes AMI Swedish Beach House - 306 S. Bay Blvd. A Reel Beauty - 4803 2nd Ave Above It All - 111 81st St Absolute Paradise - 2114 Avenue A Aloha Fern - 702 Fern Anna Banana - 501 N Shore Dr Anna Cabana A - 770 Jacaranda Anna Cabana B - 301 Poinsettia Anna Maria Beach Condo at Bradenton Beach Club - 1706 Gulf Dr. N Anna Maria Grand Beach House- 1604 Gulf Dr. N Arts and Vines - 6836 Pine St. (LBK) BON AMI - 804 N Bay Back To Blue - 850 N Shore Dr Banyan Beach - 104 Beach Ave Barefoot Bungalow - 213 70th St Barefoot Dreams - 201 76th E Bay 2 Bay - 803 South Bay Blvd Bay to Beach - 1407 Gulf 101 Beach Bound - 205 69th St Beach Breezes - 401 80th St. Beach Potato - 3404 Gulf Dr. #5 Beach Walk - 6250 Holmes #31 Beach n It - 410 Bay Palms Beachology - 749 Jacaranda Rd Bean Point Bliss - 820 North Shore Dr Beauty And The Beach - 205 73rd St Bermuda Bay - 213 Magnolia Ave. Bikini's & Martini's Beachfront - 2802 Ave. E Bikini's & Martini's Waterfront Canal - 215 Chilson Ave. Bikini Bottom - 302 Spring Ave Bimini Bay - 312 Hardin Ave. Bimini Sunrise - 515 Loquat Dr. Blissful Bay - 1801 Gulf Dr N #188 Blue Bayou - 201 76th W Blue Egret - 306 61st St, Unit A (East) Blue Osprey - 111 Los Cedros Dr. Blue Palm Paradise - 205 65th Blue Pelican - 306 61st St, Unit B (West) Bradenton Beach Club 301 - 301 17th St. N Buena Vista #2  - 101 67th Street #2 Cabin 1 Spinnakers Cottages - 204 56th 1 Cabin 2 Spinnakers Cottages - 204 56th 2 Canal Place - 238 Chilson Ave Canal Walk - 223 Oak Ave. Captain's Quarters Spinnakers - 202 56th 1 Chiki Tiki West - 303 64th Street Unit A Coco's Island Retreat - 308 2nd 102 Coconut Cottage - 207 67th Street Coconut Hut - 213 Coconut Ave. Coral Reef - 118 Mangrove Ave. Cottage by the Sea - 102 34th St. Crooked Coconut - 12204 45th Avenue Dr W Crows Nest Spinnakers Cottages - 202 56th 2 Da Beach House - 304 66th St Day Dream - 207 77th St. Deja Blu - 208 Palm Ave Dilly Dally By The Sea - 7005 Gulf Dr. Dock Holiday - 235 Chilson Dolce Vita - 848 N Shore Dr. Dolphin Tales - 836 S Bay Dragonfly Harbour - 511 Loquat Dr Dreamscape - 773 Jacaranda Drop Inn - 305 Pine Ave Endless Summer - 210 56th St Endless Summer AMIC 23 - 2600 Gulf 23 Fancy Flamingo - 319 Hardin Ave. Fancy That - 209 77th St. Fins to the Left - 2812 Ave. E, Unit A Fins to the Right - 2812 Ave. E, Unit B Fish Stix - 110 72nd St Glory Days - 206 Archer Way Happy Place - 210 55th St. Hart Of The Gulf - 305 67th St Hav'Anna Daydreamin' - 204 Archer Way Hav'Anna Hideaway - 202 Archer Way Hav'Anna Holiday - 211 Periwinkle Plaza Hawaiian Punch - 125 Crescent Dr Island Breeze - 119 Beach Ave Island Delight - 424 62nd St. Island Getaway - 205 56th Island Hideaway East - 308B 67th St. Island Pineapple - 404 80th St Island Serenity - 6250 Holmes #54 Island Therapy - 103 Gull Island Time - 426 Spring Island Time on Cedar - 110 Cedar Ave. La Coconut - 3610 Gulf Dr La Hacienda - 103 Los Cedros La Ola Verde - 503 71st St LaPlage #1 - 6430 Gulf Dr Lazy Daze - 105 75th St Lazy Lagoon - 220 Chilson Lazy Loggerhead - 3306 4th Ave. Liddie's Place - Sun Plaza West 209 - 5608 Gulf Dr. Unit 209 Mahi Mahi - 213 Elm Ave Manatee Bay - 402 S Bay Blvd. Manatee Lookout - 214 Oak Ave McBean Point - 795 Jacaranda Rd. - Unit A Meant To Be - 804 Jacaranda Rd Mon AMI Beach House - 311 Pine Ave My Grand Floridian - 207 North Harbor Dr. Nautical Tides - 303 Church Ave. Nirvana - 235 Oak Ave No R-Egrets - 127 50th Street Oceanside Oasis - 102 43rd St. Octopus Cottage - 209 69th St. On Point - 811 Jacaranda Rd Once Upon a Tiki - 211 Chilson Ave One Day More - 403 72nd Park n Chill - 117 Park Ave Peace of Paradise - 604 N Bay Blvd. Periwinkle Getaway - 207 Periwinkle Pineapple Cay - 305 74th St Playing Hooky - 513 Loquat Precious Memories - 753 Jacaranda Rd Rainbow Fish - 210 Archer Way Rainbow Reef - 720 Holly Rd. Reel Deal - 505 S Bay Rose Quartz - 308 Magnolia Ave. Royal Palm - 5701 Holmes Blvd Unit A Salt Dreams - 836 North Shore Dr. Sand Dollar - 6604 Holmes Blvd Sapphire Gulf - 117 Peppertree Ln. Sea Creatures Cottage - 112 Mangrove Ave Sea La Vie - 205 55th Seabatical - 209 76th St. Sea for Two - 101 73rd Street Unit #4 - Seashell Oasis - 2313 Avenue B Sentimental Sunset - 755 Jacaranda Serenity Cove - 606 N Shore Dr Unit #5 Ship Watch - 895 North Shore Snail's Pace - 606 N Shore Dr Unit #4 Snook Lookout - 211 Oak Ave Soulshine - 322 Tarpon St Starfish Cottage - 202 64th St Stay Salty - 6906 Holmes Blvd Stuck on 'Cation - 1810 80th St. NW Summer Breeze - 606 N Shore Dr Unit #0 Sunsational - 215 83rd St. Sunset Beach 102 - 2716 Gulf Surf's Up - 214 75th St The Blue Heron - 309 A 63rd St. The Laguna Beach - 212 Willow Ave. The Sweet Spot - 7402 Marina Dr. The Willow Inn - 201 Willow Ave Thrill of the Chase - 325 Hardin Ave Tiki Cottage - 303 64th Street Unit B Tipsy Turtle - 104 43rd St. Toes in the Water - 110 Palm Ave Turtle Cove - 112 72nd St Turtle Tyme - 4601 Gulf Drive Turtle Tyme 2 - 203 73rd St Villa Maria - 307 Spring Ave Villa Marianne - 111 Maple Wade 'N Sea - 104 Gull Dr. Water's Edge - 221 Oak Ave Willow Walk - 110 Willow Ave Yellowbird - 705 N Shore x × Name * First Email * Phone * Message * Instagram This field is for validation purposes and should be left unchanged. Drift-In AMI Best known for its atmosphere, Drift In is the coolest little dive bar on Anna Maria Island. Located on the south end of the island, Drift-In AMI is definitely a place to meet and mingle with the locals and get a taste of island culture. You must be 21 years of age or older to enter. No food and no smoking are allowed inside, but large drinks are served! Meals Served: No Live Entertainment: Yes Delivery: No Visit: 120 Bridge Street, Bradenton Beach, Florida 34217 Contact: 941-778-8565 Connect: TripAdvisor Popular Posts Trolley Stop Locations Bradenton Beach Regulations Bean Point Start Your Vacation Now Browse Rentals Browse Categories About the Island Activities Anna Maria Anna Maria Aquariums, Museums & Zoos Around the Island Arts, Culture & Theatre Audiologists Beaches Boat Rentals | Charters Bradenton Beach Bradenton Beach Chiropractors Day Trips Dental & Medical Dentists Eco-Tours | Tours Equipment Rental Events Fishing & Dolphin Watching Fitness Grooming & Pet Sitting Holidays Holmes Beach Holmes Beach Hospitals Island History Jet Skiing Kayaking Kid Friendly Libraries Local Links Local Services Nature & Wildlife Off-Island Off-Island Optometrists Organizations Paddleboarding Parasailing Pediatricians Pet Friendly Pharmacies Photographers Physicians Podiatrists Property Walkthrough Rainy Day Rental Management Restaurants Rules & Regulations Salons & Spas Shopping Snorkeling Sports & Recreation Spring Vacation Summer Theme Parks Things to Do Transportation Uncategorized Vacation Rentals Veterinarians Water Sports Winter Worship contact us find your rental Our Address Anna Maria Life Vacation Rentals 9908 Gulf Drive Suite A Anna Maria, FL 34216 Our Mailing Address P.O. Box 1178 Anna Maria, FL 34216 Give Us A Call 941-567-6253 Subscribe To Our Mailing List Email * First Name Last Name Quick Links Anna Maria Island Private Pool Homes AMI Pet Friendly Rentals Anna Maria Island Condos AMI 1 Bedroom Rentals AMI 2 Bedroom Rentals AMI 3 Bedroom Rentals AMI 4+ Bedroom Rentals AMI Last Minute Rentals AMI Staycation Rentals Anna Maria Island Weekly Rentals AMI Short Term Rentals AMI Seasonal Rentals AMI Rentals for the Holidays Alphabetical Property List About Us FAQs © 2025 Anna Maria Life Vacation Rentals | Terms & Conditions | Privacy Policy"
    },
    {
      "url": "https://www.islander.org/2025/03/bb-oks-temp-permit-for-drift-in/",
      "text": "BB OKs temp permit for Drift-In - The Anna Maria Islander 33 Body of missing Bean Point swimmer recovered Holmes Beach, county officials discuss paid beach parking Bradenton Beach moves to adopt $5M budget Cortez Marina neighbors push back on public boat ramp plan Toggle navigation E Edition News Latest News Streetlife Real Estate Obituaries Sports Sports Fishing Classifieds This weeks ads Place an AD Contact Us islander Store Submit Subscribe Today! Island news brings us together Subscribe for unlimited digital access to the news that matters to your community. #AMITOGETHER BB OKs temp permit for Drift-In by Robert Anderson | Be the first to comment Facebook Twitter Subscribe Derek Williams, owner of the Drift-In AMI, right, and attorney Mark Barnebey address city commissioners during a March 20 hearing in Bradenton Beach. The Bradenton Beach City Commission voted unanimously March 20 to approve a temporary use permit for the Drift-In AMI, allowing the main bar and a newly constructed tiki bar to open once equipment installations and inspections are completed. The 5-0 vote marked a significant step forward for Derrick Williams’ business, which has been closed since the 2024 hurricane season. There was storm damage and then the bar, 120 Bridge St., faced permitting and construction issues in the recovery drive. The temporary use permit allows the business to reopen while public hearings scheduled for April will address permitting and easement issues related to the construction of a covered outdoor bar. Construction of a tiki hut began after a permit was approved Dec. 6 by former Bradenton Beach building official Darin Cushing, allowing the replacement of a smaller structure with what the application described as a “custom-built authentic chickee hut with a thatched palm roof.” However, following a dispute over the permit between the city and Cushing, he was ousted. Williams has faced hurdles in securing approval for reopening, including code compliance, fire safety inspections, construction changes and new permitting for a major development that required a public hearing. During the March 20 meeting, Williams and his legal counsel, Mark Barnebey of Blalock Walters, P.A., addressed commissioners, confirming that city requirements were met for compliance with the temporary use permit application. “Once I get out of here today, if you say ‘yes’ and Mr. Palmer says ‘yes,’ I have people at the ready. I will complete the installation. I will get the place opened safely,” Williams said. Bradenton Beach building official Bill Palmer, hired Feb. 15, said, “The applicant has submitted all the proper permits that he needs for what he’s doing.” Williams was joined at the meeting by employees and patrons, many of whom spoke to support the business. Mayor John Chappie acknowledged the progress made but emphasized the importance of compliance with city regulations. “We want to get all of our businesses back,” Chappie said. “The Drift is an iconic place. We do want it to get back open. I apologize that we had the wrong information. It should have never happened but we have to go through the process of what our laws say.” Robert Lincoln, acting as city attorney, explained the conditions of the temporary permit. “The motion would be to approve a temporary use of the tiki hut, including but not limited to, the bar and surface area, the outdoor seating, the ice machines and the walk-in cooler as depicted on the site plan submitted by the applicant,” Lincoln said. All the commissioners expressed support, including Jan Vosburgh, who said, “I am for the bar. It doesn’t look to me like there’s a problem.” “There are so many people who have lost so much, and my goal as a commissioner is to get this place (Bradenton Beach) back up and running the way it was before,” Commissioner Ralph Cole said. After brief deliberation, Cole motioned to approve the temporary permit, seconded by Vosburgh. The motion passed unanimously, to applause from those in attendance. Williams and his team announced on Facebook that the Drift would reopen Friday, April 4: “Our family would like to say THANK YOU to the Bradenton Beach Commission today for the support. We are grateful for the opportunity to reopen a business that’s been at the heart of Bradenton Beach for 100 years.” More from The Islander March 25, 2025 Holmes Beach exploring church purchase August 12, 2025 Bradenton Beach CRA focuses on recovery, revitalization July 29, 2025 New shopkeepers fill post-storm void in Holmes Beach July 22, 2025 Anna Maria recovery: Rebuilding right takes time Facebook Twitter Subscribe Post navigation ← Holmes Beach exploring church purchase The Islander Newspaper E-Edition: Wednesday, March 26, 2025 → On your mobile On your tablet Get news alerts Contact us Contact Us The Anna Maria Islander 10303 Spoonbill Road W., Bradenton FL 34209 Phone: (941) 778-7978 Fax: (941) 778-9392 For general information: info@islander.org Site design & maintained by Wayne Ansell Islander News Headlines E Edition Classifieds Place a Classified Ad Fishing Obituaries Real Estate Sports Streetlife Other Links About Us Legislative Contacts Privacy Copyright Archives Island Links Islander Store Web Services Subscribe Newsletter signup Sign up to receive FREE email alerts when we update our site with news and classfieds. Email Please wait... Subscribe Thank you for sign up! Social Media We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://storychief.io/blog/drift-content-marketing-strategy",
      "text": "Drift Content Marketing Strategy: A Teardown of How They Do It storychief.io Try for free en German (de) nl (nl) Home Content Marketing Latest article in Content Marketing Content Marketing 16 min read 15 Best Loomly Alternatives in 2025 Aditya Soni Recent articles I Spent 20+ Hours Learning AI Prompting - Here’s What You Should Know Top 7 SEO Project Management Tools for Organizations Branded Content Strategies: How To Create Them + Examples Mastering the art of content batching for agencies What YouTube Taught Me About SEO: Lessons From 3M+ Views That Apply to B2B Content See all articles SEO Latest article in SEO SEO 11 min read How I Scale New Websites From 0 To 1,000 Daily Visitors Danyon Togia Recent articles Beyond Keywords: How Topical Authority is Redefining SEO in 2025 10 Must-Know GEO Tips for Generative Engine Optimization in 2025 SEO vs AI: Where to Focus Your Efforts in 2025 How I Create Content That Ranks #1 For Competitive Keywords I Spent 20+ Hours Learning AI Prompting - Here’s What You Should Know See all articles Content Collaboration Latest article in Content Collaboration Digital Marketing Agencies Content Collaboration 7 min read Top 7 Agency Management Software for Marketing Teams in 2025 Nandini Sharma Recent articles Top 7 SEO Project Management Tools for Organizations Document Collaboration Tools: How Modern Content Teams Work Smarter 5 Effective Strategies and Best Practices for Optimizing Content Planning Why Your Content Approval Workflow Is Slowing You Down (and How to Fix It) How StoryChief Can Help You Regain Control of Your Agency Projects See all articles Social Media Latest article in Social Media Social Media 5 min read 7 Best SocialPilot Alternatives You Must Try Kalpesh Parmar Recent articles 15 Best Buffer Alternatives for Agencies in 2025 Build a Social Media Content Plan in 10 Minutes Using AI How to Increase Interactions on Social Media 10 Social Media Challenges & How To Fix Them 5 Best Social Media Collaboration Tools in 2025 See all articles Lead Generation Latest article in Lead Generation Lead Generation 9 min read The Ultimate Guide to Mastering Lead Generation in 2025 Joy Dcruz Recent articles What Is BOFU Content? 5 Examples to Help You Close More Deals B2B Lead Generation on LinkedIn: Tips, Tricks, Tools How To Optimize Your Newsletter Strategy For Lead Acquisition (+ 4 Plugins To Try) 9 Ways To Use Social Proof In Content to Increase Conversions What is PPC? The Ultimate Guide for Marketing Agencies See all articles Marketing Automation Latest article in Marketing Automation Content Marketing SEO Marketing Automation 8 min read I Spent 20+ Hours Learning AI Prompting - Here’s What You Should Know Kalpesh Parmar Recent articles 10 Best ChatGPT Alternatives in 2025 (Free & Paid Tools for Writing & Marketing) How to document your marketing operations playbook What High-Performing Content Teams Do Differently What is Generative Engine Optimization (GEO)? How to Create an AI Content Engine That Speaks Like Your Brand See all articles StoryChief Updates Latest article in StoryChief Updates StoryChief Updates 1 min read 🎉 2024 Year in Review: StoryChief Highlights Esther Van den Eynde Recent articles StoryChief's new Google Search Console integration puts SEO data into practice StoryChief Features and Releases You Loved in 2023 Centralizing Your Marketing Plan and Aligning Your Team in 5 Steps StoryChief Teams Up with Contentful to Streamline Content Marketing Efforts How to Schedule and Publish Instagram Stories from Your Desktop [4 Easy Steps] See all articles More Digital Marketing Agencies Analytics & Reporting Content Audit Search Explore more Homepage Free trial Pricing Write for us ✏️ storychief.io en German (de) nl (nl) Follow us written by Dayana Mayfield Teardown: Drift Content Marketing Strategy Content Marketing 11 min read Share: Ready for something a little different? Sweet! Today we're launching a brand new series of content marketing teardowns, and the first company we'll be analyzing is the Drift content marketing strategy. Drift is the conversational marketing platform that (in the B2B sales world at least) has become synonymous with chatbots and the ⚡ emoji. Where there's a lightning emoji, there's a Drift employee. These peeps do employee advocacy like nobody's business. Let's see what else they do right, and discover if there's anything they can improve upon. Table of contents: Content categories used on Drift's blog Why Drift doesn't use lead forms How Drift gets website visitors on their email list How Drift engages with website visitors on high-intent pages How Drift drives traffic to their content Big time branding Drift's overall strategy And even if you're not in B2B, there's still a ton you can learn from this content marketing teardown, because Drift blurs the line between B2B and B2C anyways. Take it from their VP of Marketing: Let's get into the teardown! Content categories used on Drift's blog What does a company like Drift — with over 150,000 customers and $107 million in funding — post on their blog? How do they solidify their authority in a category they created (conversational marketing), while still remaining accessible and humble? These are some big questions. Let's take a look at how the Drift content marketing strategy looks like. Helpful content First off, Drift is definitely posting what we all think of when we think of content marketing using a blog: Tips and tricks Listicles Guides Within this content category, their content most likely has other categories such as sales, growth marketing, etc. What can we learn from Drift? They're posting content that is helpful to their target buyer and they offer tips that are up-to-date. They make sure to never rehash things we've heard a million times before, and always add a fresh take. Employee expertise In addition to posting content written by in-house marketers and seasoned consultants, Drift's blog also hands the proverbial mic over to employees in other roles as well. In this example, a customer success manager offers tips for using video in customer success. This is a smart move from the Drift content marketing strategy playbook. Your in-house team has knowledge that your customers can benefit from, so invite leaders from relevant teams to share their expertise on your blog. Make sure to have someone on the marketing team manage content pitches, ideas, titles, publishing, etc. etc. so that contributing employees feel excited and supported. It shouldn't be a chore for them to help out with content marketing . User interviews The Drift content team also regularly interviews its customers. In this example , they ask the following questions and more: How does Drift fit into your day-to-day workflow? What other tools do you use in conjunction with Drift? What kinds of questions do people on your site usually have? How does a conversation with a visitor on your site typically go? How do you have your bots set up in Drift? Notice how the above questions are not set up for a case study style interview. Rather the purpose of the content is to help others learn how to do conversational marketing right. User thought leadership Drift has another way of bringing users to the forefront of their blog. Aside from interview posts, they also take thought leadership contributions from users. Users can share how they set up Drift, what types of chatbots they have, how they approach live messaging, how they train their teams, and more. You can set up a contributor program for your customers, too. In B2B, marketers and CEOs want high-quality backlinks, so they will most likely be happy to write for you if your domain authority is good (or excellent, in Drift's case). In B2C, you may need to incentivize user-generated content with sweepstakes or giveaways. Product updates Like most top-notch B2B SaaS companies, the Drift content marketing strategy is about releasing new product features often. They post about them right on their main blog, but in order to make it not boring or come off across as too company-centric, they used outcomes-focused messaging in their headlines. \"Get Your Best Leads To Your Sales Team Faster\" is something that just about any B2B sales or marketer can get excited about. Learn from Drift. Don't make product announcements all about you. Figure out how to frame it to be about your customer. And if you can't do that, then most likely you shouldn't have built or created that product in the first place. 😱 Why Drift doesn't use lead forms Did you know that Drift doesn't use lead generation forms anywhere on their website? Yeah, it's kind of their thing. Go ahead and agree or disagree, but Drift's CEO David Cancel believes that people don't want to fill out lead forms . They just want the content. You should give it to them, and make it easy for them to subscribe to your email list if they choose, instead of barring them from your ebooks unless they subscribe. It's this vision that has led to the removal of all lead forms on their site. Instead, they creatively make use of their own product (namely the chatbot) to engage with website visitors who meet certain criteria, such as viewing a certain page or reading a certain number of posts. How Drift gets site visitors on their email list Alright, so if they don't use lead forms, how do they get visitors on their email list? There are at least a couple of ways they do this. Let’s take a look at the Drift content marketing strategy for email acquisition. Subscribe button above and to the left of the posts Drift has a black subscribe button above the title of every post. Also, when you're digesting the meat of the content (eww, that sounded gross, sorry), you can clearly see a subscribe button on the left sidebar too. In terms of sidebar design, the minimalism here is pretty dope. Chatbot prompts for people who have read multiple blog posts In addition, Drift's bot also prompts regular blog visitors to sign up for their email list. From the outside looking in, I'm not sure how many blogs you have to read for this prompt to pop up, but I'd imagine it's at least three. Want inspiration for setting up your own chatbot? We've got you covered. Here's how the conversation went: Chatbot:  Hiya 👋 You're becoming a regular around here... Want to take things to the next level? Me:  Maybe, what does that entail? Chatbot: Im so glad you asked If you like our blog content, you'll LOVE our resource library. It's full of e-books written by members of our team on things like leadership, marketing role models, ABM strategies, and more! Want to check them out? Me:  Absolutely Chatbot: Awesome! We keep all of our books on our site here ! But my personal favorite is This Won't Scale . Let us know how you like it 🤓 Before I forget, did you get a chance to subscribe to our blog yet? If not, I can sign you up now! We send you a roundup of our content and favorite things we've seen on the internet on Sunday nights and, of course, you can opt-out at any time. How Drift engages with website visitors on high-intent pages That's a great chatbot prompt for blog visitors, but what about posts that represent a higher intent? When someone is reading a product update, that shows that they might be interested in your product, not just your content. Here's how the conversation with the Driftbot flowed when I was on a blog post about the product for longer than a minute. Chatbot:   Hey 👋Think you can answer this question on lead response time? Me:  I'll try my best... 😬 Chatbot: I believe in you SO the question: Waiting X amount of minutes in your lead follow up leads to a 10x decrease in conversion? Me:  15 minutes Chatbot: Close! According to Harvard Business Review, having a lead wait 5 minutes or more results in a 10x decrease in connection rate 😱 We know it's tough to make sure that the right rep is connected with the right lead as quickly as possible, so today we're announcing Advanced Routing: The best way to get leads to your sales team, faster. (available on our Enterprise plan) Should I tell you more? How Drift drives traffic to their content Now that we know what kind of blog content Drift creates, and how they communicate with blog readers via chat, let's peek into how they acquire traffic for their blog in the first place. This is instrumental for the Drift content marketing strategy. SEO It's impossible to rank for every blog post, and from the looks of the results in Ubersuggest, Drift isn't getting search traffic for most of their posts. However, they do have rankings for several keyphrases with high amounts of search traffic, including: Featured snippet and position #4 for \"growth marketer\": Featured snippet and position #1 for \"product marketer\": Position #11 for \"chatbots\" : (By the way, this same post ranks #1 for \"sales bots,\" so let this serve as a reminder to include secondary key phrases in your posts!) Fact-checking geeks, search rankings do fluctuate a bit, so keep in mind these rankings are written as of August 2019. Employee advocacy As previously mentioned, Drift totally rocks at employee advocacy. Employee advocacy is when employees share company content, whether they wrote it or not. Drift's employees are constantly showing up in my LinkedIn feed, and the posts get a lot of comments and likes, meaning their getting tons of eyes on their content due to employee shares. Email marketing While Drift doesn't send an email notifying readers of every blog post they publish (so they don't bombard their subscribers), they do use email marketing to get signups for their webinars and other virtual live content. Social media Drift has thousands of followers on Twitter, LinkedIn, and Instagram. They use these channels to drive traffic to their blog posts, and they prominently feature important posts, like product updates. Social media shares Getting other people to share your content is actually a win-win. You get more eyes on your content. The sharer keeps their social media account active and they get more eyes on their name and their profile picture. When you create content that your target audience loves, they will share it without you asking them too. Make sure to study trends. What do people ask about? What do they want to know? Engage in social listening so you know what kind of content will inspire organic shares. Regular readers It's safe to say that because Drift creates fresh, helpful content for sales teams, marketers, and customer success reps, that thousands of customers and potential customers return to their site organically to read up on their latest content. When you create content that solves problems, has a clear brand, and caters to clear target audiences, then you create a content hub that people want to return to. Without a doubt, Drift has achieved this. Big time branding About branding... Drift's brand is very well known in the B2B world. It's bold, loud, clear, fun, and exciting,   without being either silly or overly serious. They use bold fonts, and they combine the color black with really bright, in your face colors in text highlights and other small details. Having a clear style serves them really well. When you see a Drift post on any digital channel, you know it's Drift. Do an audit of your blog, your email newsletter, and your social media profiles. Are they all over the place? Do you have a clear brand? Without a clear brand, it's much harder to establish the sort of authority that will have people returning to your website organically. An enticing, relevant brand helps people connect with your content at a deeper level beyond its educational value. Your brand can create loyalty, not just with your products and services, but with your content too. Key takeaways: the Drift content marketing strategy Wow! There's a lot to learn from Drift's blog, how they engage with blog readers, and how they drive traffic. Here are some of the top takeaways: Highlight customers in your content, not just as case studies but as experts whose insights can help other users and prospects Publish content written by employees who fit your target audience Use chat bot prompts sparingly  —  trigger them based on user behavior Take content branding as seriously as you do product branding Prioritize employee advocacy to get organic traffic Related stories Content Marketing 3 min read StoryChief AI vs. ChatGPT for Content Marketing Esther Van den Eynde Content Marketing 10 min read 10 Evergreen Content Ideas for Long-Term Traffic Dmytro Zaichenko Content Marketing 5 min read How to Boost Sales with Content Marketing: Your Actionable Guide Petra Odak SEO score 93 /100 Share: Published with StoryChief Privacy Policy Terms of service Published with StoryChief"
    }
  ]
}