{
  "fuentes": [
    {
      "url": "https://www.conpac.co.nz/about-us",
      "email": "sales@conpac.co.nz"
    },
    {
      "url": "https://tcltrading.com/contact",
      "email": "contact@tcltrading.com"
    },
    {
      "url": "https://westendholdings.com/about-us/",
      "email": "brolfe@westendholdings.com"
    },
    {
      "url": "https://westendholdings.com/about-us/",
      "email": "lbeasley@westendholdings.com"
    },
    {
      "url": "https://www.westerntrading.co.uk/contact/",
      "email": "enquiries@westerntrading.co.uk"
    },
    {
      "url": "https://drinkatwestend.com/about/",
      "email": "info@floridainternetsolutions.com"
    },
    {
      "url": "https://westendholdings.com/",
      "email": "brolfe@westendholdings.com"
    },
    {
      "url": "https://westendholdings.com/",
      "email": "lbeasley@westendholdings.com"
    },
    {
      "url": "https://drinkatwestend.com/",
      "email": "info@floridainternetsolutions.com"
    },
    {
      "url": "https://www.advance-trading.com/contact-us",
      "email": "info@advance-trading.com"
    },
    {
      "url": "https://drinkatwestend.com/events/",
      "email": "booking@drinkatwestend.com"
    },
    {
      "url": "https://drinkatwestend.com/events/",
      "email": "booking@drinkatwestend.com"
    },
    {
      "url": "https://drinkatwestend.com/events/",
      "email": "info@floridainternetsolutions.com"
    },
    {
      "url": "https://sivron.com/contact-us/",
      "email": "sales@sivron.com"
    },
    {
      "url": "https://drinkatwestend.com/contact/",
      "email": "booking@drinkatwestend.com"
    },
    {
      "url": "https://drinkatwestend.com/contact/",
      "email": "booking@drinkatwestend.com"
    },
    {
      "url": "https://drinkatwestend.com/contact/",
      "email": "info@floridainternetsolutions.com"
    },
    {
      "url": "https://www.westendadvisors.com/our-team/",
      "email": "info@westendadvisors.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "4@3x.png"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "bryse@westendrepartners.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "keith@westendrepartners.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "admin@westendrepartners.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "anthony@westendrepartners.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "ed@westendrepartners.com"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "email": "jeff@westendrepartners.com"
    },
    {
      "url": "https://www.wayoutwesttrading.com/pages/about-us",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://www.wayoutwesttrading.com/pages/about-us",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://www.wayoutwesttrading.com/pages/about-us",
      "email": "sales@wayoutwesttrading.co"
    }
  ],
  "mails": [
    "4@3x.png",
    "admin@westendrepartners.com",
    "anthony@westendrepartners.com",
    "booking@drinkatwestend.com",
    "brolfe@westendholdings.com",
    "bryse@westendrepartners.com",
    "contact@tcltrading.com",
    "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com",
    "ed@westendrepartners.com",
    "enquiries@westerntrading.co.uk",
    "f14faca962674f149161045845b21b35@sentry.zipify.com",
    "info@advance-trading.com",
    "info@floridainternetsolutions.com",
    "info@westendadvisors.com",
    "jeff@westendrepartners.com",
    "keith@westendrepartners.com",
    "lbeasley@westendholdings.com",
    "sales@conpac.co.nz",
    "sales@sivron.com",
    "sales@wayoutwesttrading.co"
  ],
  "nombre_sitio": "drinkatwestend.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.conpac.co.nz/about-us",
      "text": "About Us | Conpac Trading Ltd Skip to the content 09 634 4563 sales@conpac.co.nz Home Shop Board & Paper Boxes & More Bubble Bags Bubble Wrap Cafeteria Products Dividers & Inserts Foam & Polystyrene Gloves & Disposables Hygiene & Cleaning Instore Specials Machines & Tools Office Products Paper Bags Plastic Bags Plastic Tube & Film Postal Products Removal Wrap Safety Products Sheetboard Shipping Products Staples & Knives Tape & Dispensers Board & Paper Boxes & More Bubble Bags Bubble Wrap Cafeteria Products Dividers & Inserts Foam & Polystyrene Gloves & Disposables Hygiene & Cleaning Instore Specials Machines & Tools Office Products Paper Bags Plastic Bags Plastic Tube & Film Postal Products Removal Wrap Safety Products Sheetboard Shipping Products Staples & Knives Tape & Dispensers About Us Customized Boxes Contact New Website Guide Search Sign In Cart Home About Us About Conpac With over 50 years experience in all areas of packaging we give our customers reliable packaging product options & informed application advice and support. Experience We have a huge range of stock & custom print packaging options. We pride ourselves on supplying customers high quality products for all areas of the packaging industry. Services Our goal is to provide excellent customer, application & product support. The customer experience is very important for our company & our staff. Conpac Trading Ltd was established in 2003 & is a New Zealand privately Owned/Operated Company. Conpac Trading Ltd has been supplying packaging products to the market for well over 20 years, both in New Zealand & overseas. Conpac are experts in their fields with a wealth of product knowledge within the Team that work here. Conpac has over 5000 stock lines predominately kept in their Head Office Warehouses, which are based in Onehunga Auckland. Key also to their success is the ability to manufacture custom made product. Corner boards, RSC’s & Die cuts can also be made at their Onehunga site. Conpac are a major importer, with direct mill access in Asia, Australia & Europe, of industrial grade papers & boards, which supply the NZ market. A Key strength is our design & build of custom-made work – ie printed cartons.  We also service the wine industry (and similar) with our range of bottle dividers which are made in our Onehunga Factory. Deliveries serviced by our own fleet of trucks.  Fleet includes three trucks & one van to service the Auckland area.  Courier service also available. We allow collections from our Head Office in Onehunga. Please call to arrange this option. Overseas Sourcing Office – We import products directly from offshore & also have a range of NZ Suppliers. Freight terms from 01/06/2023 - All orders over $500 + GST will be freight free for business to business deliveries within Auckland Metro (Papakura – Albany) All Rural, Residential, Tail Lift, Hand Unload & Any orders outside of Auckland Metro will incur extra charges . All orders under $500 + GST will have freight charges applied to all parcels being delivered based on courier charges. Please contact customer services if you require more info regarding freight charges. Conpac Trading Ltd Tel. +64 09 634 4563 Email. sales@conpac.co.nz facebook linkedin Payment Methods Our website is compatible with many popular payment methods. SSL 100% Secure Transactions. Head Office - Retail Showroom & Warehouse 119H Captain Springs Road Onehunga, Auckland 1061 Operating Hours: Monday to Friday - 7.30am to 4.00pm Manufacturing Plant 119G Captain Springs Road Onehunga, Auckland 1061 Operating Hours: Monday to Thursday - 7.00am to 3.30pm Friday - 7.00am to 2.30pm Conpac Trading Ltd Head Office - Retail Showroom & Warehouse Unit H, 119 Captain Springs Road, Onehunga, Auckland 2013 Hours Monday – Friday  7.30am – 4.00pm Manufacturing Plant 23 Corban Ave Henderson, Auckland 0612 Hours Monday – Thursday 7.00am – 3.30pm / Friday 7.00am – 2.30pm Tel. +64 09 634 4563 Email. sales@conpac.co.nz Quick links Home Terms Of Service Social pages facebook linkedin Copyright 2025 Conpac Trading Ltd. All rights reserved. Home About Us Contact Us Privacy Policy Terms and Conditions Built With 360 Commerce. × Account Login Forgot Password Email Password Remember me Login Forgot Password Email Address Reset Password"
    },
    {
      "url": "https://tcltrading.com/contact",
      "text": "Contact TCL Trading LLC for Global Trading Solutions | TCL TRADING Home About Contact Home About Contact Contact Us Your First Name Your Email Address* Your Message* Submit Your Inquiry Get in touch with TCL Trading LLC for inquiries about our commodities and global trading services. Our Location Visit us at our global headquarters to discuss your trading needs and explore our diverse range of commodities. Address 4405 Jager Dr NE Ste C4-4182 Rio Rancho, NM (New Mexico) 87144 Hours Mon-Fri 9am Contact TCL Trading LLC - Global Commodity Specialists. LLC number : 7906455 ADDRESS Contact contact@tcltrading.com 4405 Jager Dr NE Ste C4-4182 Rio Rancho, NM 87144 Your Email Address Submit Your Inquiry Â© 2024. All rights reserved."
    },
    {
      "url": "https://westendholdings.com/about-us/",
      "text": "About Us | West End Holdings Home About Us Holdings News Select Page Our Foundation Integrity | Discipline | Partnership WHO WE ARE We are experienced executives that thrive on solving complex business challenges.  We are not financial engineers and we are not “start-up” guys.  Rather, we are operating partners with complementary strengths who can rapidly assess opportunity, and when it fits us, act rapidly.  We work with companies we are confident we can improve through our dedicated focus on revenue growth, operational efficiency, cost containment, technology enhancement, and continual investment in the team. WHAT WE DO We solve problems for owners by acquiring their non-strategic, under-performing businesses.  By selling assets to us that require more management attention and financial commitment than is currently available, sellers can improve their overall financial success by returning 100% of their focus back to their core business. We are currently seeking under-performing businesses with revenues between $5 million and $50 million that are “EBITDA-challenged” across a wide range of industries. We are in position to close transactions quickly.  We welcome all conversations and we provide immediate feedback on whether or not we can solve a problem for a current owner.  If we are not a good fit, we do our best to refer opportunities to other teams we know that might be a better fit.  If you know of an asset that might fit us, please give us a call. OUR STRENGTHS As hands-on investors, we accept operational responsibility, enabling us to engage deeply and contribute our wealth of experience in areas including: Operational Excellence | Our companies benefit from the best practices and lessons learned from our management experience and relationships with other successful business leaders. Capital Structure & Financing | Our extensive experience in capital markets and our relationships with capital partners allow us to implement capital structures that propel growth. Business Growth Strategies | Our Managing Partners assist in developing, analyzing, and implementing strategies to drive meaningful revenue growth and organizational efficiency. Mergers & Acquisitions | Our strategy often includes identifying, negotiating, and consummating follow-on acquisitions to round out service offerings, enhance existing technologies, and expand geographic footprints. Human Capital Development | We develop high-performance teams and work hard to attract talent to appropriately equip each team for success. In addition, we focus on recruiting effective board members and advisors for each of our businesses. Exit Planning | We invest and operate assuming we will own our companies forever. We do, however, position and prepare our holdings for an eventual transition to new ownership. We have a proven track record of attracting ideal exit partners and negotiating arrangements that are win/win for all stakeholders. MANAGING PARTNERS Lyle Beasley | Co-Founder & Managing Partner Prior to co-founding West End Holdings Lyle Beasley served in entrepreneurial sales, finance and operating roles before acquiring IXT Solutions, which he successfully repositioned and sold to Change Healthcare.  He has since served numerous other for profit Boards including Medical Reimbursements of America, nSight, WPC Healthcare, AHP Media, Revecore, and Courseflow, often taking leadership  roles in the businesses as well.  He has also served several not for profit Boards including the Nashville Symphony, Vanderbilt Public Policy Institute, St Thomas Hospital, Harding Academy, Friends of Warner Parks and the Community Foundation of Middle TN, where he currently serves as Board Chair. He received his executive M.B.A from the Owen Graduate School at Vanderbilt and his engineering degree from Vanderbilt University.  He and his wife Lisa have been married for more than 30 years and have two adult children. Bob Rolfe | Co-Founder & Managing Partner Bob Rolfe has returned to West End Holdings after serving as the Commissioner for Tennessee Economic and Community Development for both Governors Bill Haslam and Bill Lee, where his leadership led to record-breaking job growth and capital investment in the state of Tennessee. Prior to being appointed to TNECD, he held the position of CEO of Medical Reimbursements of America, Inc., a West End Holdings portfolio company. Prior to MRA, Rolfe led numerous turnarounds for acquired and recapitalized businesses.  He spent the first 18 years of his career as an investment banker at J.C. Bradford and Co. He received his executive M.B.A. from the Owen Graduate School of Management at Vanderbilt University and his B.S. from the University of Alabama’s School of Commerce and Business Administration. He and his wife Kathy have been married for nearly 40 years and have three adult children and two grandchildren. He is a member of First Presbyterian Church in Nashville, where he has served as an elder for two decades. West End Holdings 633 Belle Park Circle Nashville, TN 37205 615-294-9940 lbeasley@westendholdings.com brolfe@westendholdings.com"
    },
    {
      "url": "https://www.westerntrading.co.uk/contact/",
      "text": "Contact – Western Trading Group Portfolio Residential Commercial Requirements Clients About News Contact Menu Menu COMMERCIAL PROPERTY DEVELOPMENT & INVESTMENT SINCE 1985 Contact Home 1 / Contact Get in touch with us We welcome any questions or queries you may have. Use the contact form to send us the details of your enquiry and we will be sure to get back to you at the next available opportunity. Tel: 0121 200 3377 Email: enquiries@westerntrading.co.uk Follow us: Your name* Your email* Subject* Your message Telephone: 0121 200 3377 Fax: 0121 200 3393 Email: enquiries@westerntrading.co.uk Portfolio Commercial Residential Navigation Portfolio Requirements Clients About News Contact © Copyright 2025 Western Trading Group We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://drinkatwestend.com/about/",
      "text": "About West End Trading Co. | Sanford's Best Bar & Live Music Venue Skip to content Facebook Instagram about ABOUT A Local Legend Since 2006 From its opening on Sanford’s birthday, September 29, 2006, West End Trading Co. has been a cornerstone of the Historic Downtown Sanford community. Starting as a cozy dive bar, we've evolved into a bustling venue that features some of the best live music and entertainment in Central Florida.\n\nOver the years, we've hosted iconic events like the Hurricane Party Concert, built the legendary Fishbowl Stage, and created our signature drink, the Sunshine State Bomb, enjoyed by over a million guests. Unrivaled Entertainment From live bands and DJs to karaoke nights, there’s always a reason to come back. A Local Touch We proudly represent Sanford, offering a warm, hometown vibe. Top-Notch Service Our team is passionate about making your experience memorable. Unbeatable Happy Hour Enjoy our famous Happy Hour every day of the week—because good times should never break the bank! Live Music Experience Catch incredible performances from local, regional, and national acts at West End Live, our professional music venue. Delicious Bites From Cosmic Wings to classic bar bites, The Joint serves up mouthwatering flavors that are the perfect companion to any night out. Community Connection West End is more than a bar—it’s a hub for local events, a supporter of community causes, and a place where everyone feels like family. Rooted in Sanford West End Trading Co. is more than a bar—it’s a gathering place where Sanford comes together to celebrate, connect, and thrive. Community Where It Began From humble beginnings to hosting legendary events, West End’s history is woven into the fabric of Historic Downtown Sanford. History Green initiatives Committed to a Sustainable Future At West End Trading Co., we believe in doing our part to protect the planet. With solar panels now up and running, we're reducing our carbon footprint and harnessing clean energy. We also prioritize recycling, ensuring that cardboard, cans, and plastics are properly disposed of. Our next step? We're looking into composting as part of our ongoing efforts to create a greener, more sustainable Earth for future generations. Come in for 1 stay till 2(am) Address : 202 S Sanford Ave, Sanford, FL 32771 Facebook Instagram Contact : (407) 322-7475 Copyright © 2025West End Trading Co. Privacy Policy Designed By Social Brew Media Home About Community History Menu Events Contact Home About Community History Menu Events Contact"
    },
    {
      "url": "https://westendholdings.com/",
      "text": "West End Holdings | Home About Us Holdings News Select Page Renovating Business CORPORATE DIVESTITURES | MANAGEMENT BUYOUTS | SPECIAL SITUATIONS | RECAPITALIZATIONS Do you own a business that needs new capital and leadership? Let us recapitalize your business and create a successful exit for you. West End Holdings is a private equity partnership focused on acquiring “special situation” businesses seeking new ownership.  We creatively structure transactions that provide the capital, leadership, and non-financial resources required for businesses to reach their potential. Established in 2012, West End Holdings has recapitalized and provided new leadership to multiple businesses in the technology, healthcare services, and business services arena. Our founders, Lyle Beasley and Bob Rolfe, are seasoned executives with successful track records tackling tough business challenges.  Our complementary strengths and exceptionally deep networks deliver the talent, energy, and experience necessary to drive positive change. We consistently deliver successful outcomes for our stakeholders including employees, management teams, customers, and previous owners. West End Holdings managing partner, Bob Rolfe, returns to the company after five years serving as commissioner of Tennessee Economic & Community Development. The leadership skills he has demonstrated over his career positioned him to achieve great success for the state. We are happy to have him back to help pursue new opportunities and bring his unique set of operating talents to our partnership. Bob Rolfe | Managing Partner Former Commissioner, Tennessee Economic & Community Development Bob Rolfe was sworn in by Governor Bill Haslam on Feb 16, 2017 and resworn in by Governor Bill Lee on January 19, 2019 as Commissioner of the Tennessee Department of Economic and Community Development, where he was responsible for recruiting new businesses and industry to the state, supporting existing companies, expanding economic opportunities across rural Tennessee and boosting the state’s overall economic prosperity. Under Rolfe’s leadership, Tennessee secured a record-breaking number of wins, landing approximately 600 projects representing more than 103,500 job commitments and $30.5 billion in capital investment from notable companies such as Ford Motor Company, Amazon, Alliance Bernstein, Oracle and many others. West End Holdings 633 Belle Park Circle Nashville, TN 37205 615-294-9940 lbeasley@westendholdings.com brolfe@westendholdings.com"
    },
    {
      "url": "https://drinkatwestend.com/",
      "text": "West End Trading Co. | Sanford's Dive Bar & Music Venue Skip to content Facebook Instagram Welcome to West End Trading Co. Historic Downtown Sanford’s Iconic Dive Bar & Premier Live Music Venue Nestled in the heart of Historic Downtown Sanford, West End Trading Co. is your go-to destination for unforgettable nights out. Whether you're here to enjoy our famous Happy Hour on weekdays, catch electrifying live performances at our professional music venue, or indulge in delicious eats from The Joint, we've got something for everyone. Buy tickets Visit Us Now On Sale 18th Annual Hurricane Party The 18th Annual Hurricane Party is officially STACKED with 20+ bands across 5 stages, including ska staples Mad Caddies, high-energy heroes Big D and the Kids Table, and hometown legends The Supervillains! Buy Tickets ABOUT A Local Legend Since 2006 West End Trading Co. opened its doors on the City of Sanford’s birthday, September 29, 2006, and has been a cornerstone of this vibrant community ever since. From our roots as a cozy local dive bar to becoming the home of Sanford’s premier live music venue, West End Live, we’ve grown alongside Historic Downtown Sanford. History Rooted in Sanford since 2006, West End has grown from a dive bar into a live music hotspot and event pioneer. Community From fundraisers to festivals, we’re proud to support and celebrate our Sanford community. Learn More Menu Drinks, Eats & Everything You Crave At West End Trading Co., we’ve got all the essentials for a great time. From refreshing drinks to delicious bites from The Joint at West End, there’s something to satisfy every craving. Find out more West End Live West End Live – The Heart of Sanford’s Music Scene Step into West End Live, our professional live music venue that has hosted legendary local, regional, and national acts. Equipped with a state-of-the-art sound system and a dedicated sound engineer, we’re the go-to spot for live entertainment in Sanford. view all events J&W PROMOTIONS PRESENTS:ZACK & MORGAN'S TILL DEATH DO US PART with CATCHER IN THE RYE , PHANTOM LIMBS , INSTIGATOR , HITMAKER , NOCTUS Sep 13 @ 07:30 PM $12.50 21 and up Tickets DIY PAINT AND SIP FALL-ING FOR YOU with SIP AND PAINT Sep 17 @ 06:30 PM $35.75 21 and up Tickets Subliminal Doubt with Control This! Effit and The Palmeranians with Subliminal Doubt: A Tribute to No Doubt , Control This , Effit , The Palmeranians Sep 19 @ 07:00 PM $18.65 21 and up Tickets VITAL PAIN with VITAL PAIN , Sonic Conversations , HIGHER GROUND , 12 GAUGE CONFESSIONAL , SEVERED RESISTENCE Sep 20 @ 07:00 PM $9.26 21 and up Tickets BRING YO VINYL HOSTED BY DJ ANGEL FROM THE MONSTERS IN THE MORNING with DJ Angel Sep 20 @ 09:00 PM $0.00 21 and up Tickets WEST END LIVE PRESENTS THAT 1 GUY with That 1 Guy Sep 25 @ 07:00 PM $24.15 18 and up Tickets J&W PRESENTS:BURN ABSOLUTE AND FRIENDS with BURN ABSOLUTE , FOR FEAR ITSELF , LIVES LOST , WHAT WE SEEK , BIANCA DOROTHE Sep 26 @ 07:30 PM $12.50 21 and up Tickets GLORYDAYSPRESENTS GARY PEYTON'S COUPLES THERAPY with JESSE PEYTON Sep 27 @ 06:00 PM $31.33 21 and up Tickets BAY STREET with BOZO, DEGENERATES,NONSENSE and RETURN TO SENDER with Bay street , Bozo , NONSENSE , RETURN TO SENDER Oct 3 @ 07:00 PM $12.50 21 and up Tickets BABE HAVEN WITH SPECIAL GUESTS with Babe Haven Oct 16 @ 08:00 PM $18.65 18 and up Tickets DIAL DRIVE ALBUM RELEASE SHOW FEATURING THE BASTARD SUNS AND THE LONGEST HALL with dial drive , The Bastard Suns , The Longest Hall Oct 17 @ 08:00 PM $18.65 21 and up Tickets TRIBUTE TO KORN – KORN AGAIN & TRIBUTE TO MARILYN MANSON – SPOUKY KIDS with Korn Again , Spouky Kids: Marilyn Manson Tribute Oct 18 @ 07:00 PM $29.43 21 and up Tickets J&W Presents Psycho Sideshow 2025 with Green Jello and Special guests with Green Jello , 96 Bitter Beings , The Convalescence , Indorphine , THE BUNNY THE BEAR , Ignominious , Goonlord , DALE EARNHARDT Oct 20 @ 05:00 PM $24.15 21 and up Tickets HANS GRUBER AND THE DIE HARDS WITH CHILLED MONKEY BRAINS, PANGOLIN AND THE COLORBLIND DINOSAURS with HANS GRUBER AND THE DIE HARDS , Chilled Monkey Brains , pangolin , Colorblind Dinosaurs Oct 22 @ 08:00 PM $18.65 21 and up Tickets Comedian BO JOHNSON with BO JOHNSON Oct 30 @ 07:00 PM All Ages Tickets THE SUB HERBS WITH THE GOODIES AND FLORIDAZE with sub herbs , THE GOODIES , FLORIDAZE Oct 30 @ 09:30 PM $12.50 21 and up Tickets WJRR 101.1 PRESENTS AFTERWEEN WITH THE HAUNT WITH GARGAMEL! AND SPECIAL GUESTS with The Haunt , Gargamel! Nov 1 @ 08:00 PM $12.62 21 and up Tickets COMEDIAN TARA CANNISTRACI with TARA CANNISTRACI Nov 6 @ 07:00 PM $38.93 21 and up Tickets The Palmer Squares with The Palmer Squares , The White Moms Nov 6 @ 09:00 PM $18.65 21 and up Tickets PEARL WITH SPECIAL GUESTS with Pearl Nov 9 @ 07:00 PM $18.65 21 and up Tickets 1 2 Next » Weekly Events Your Week, Your Vibe There’s always something happening at West End Trading Co.! From live music to karaoke and unbeatable drink specials, we’ve got your week covered. wednesday Wing Special Craving something delicious? Grab a plate of 8 Cosmic Wings for just $10 from 4 PM to 11 PM , and pair it with your favorite drink for a midweek treat. thursday Throwback Jams Travel back in time with DJ Dom spinning all your favorite throwback hits. The party kicks off at 10 PM , so get ready to dance the night away! Friday Rock n’ Hiphop End your workweek on a high note with a blend of rock and hip-hop beats brought to you by DJ Dom , starting at 10 PM . saturday The BEst Hits & Mixes Turn up your Saturday night with the electrifying sounds of DJ Zouain . The music starts at 10 PM , so bring your energy and hit the dance floor! sunday Karaoke Night Close out the weekend by taking the stage! Karaoke Night starts at 9 PM , giving you the chance to show off your skills (or just have some fun with friends). Your next unforgettable night starts here. Visit Us Buy tickets Come in for 1 stay till 2(am) Address : 202 S Sanford Ave, Sanford, FL 32771 Facebook Instagram Contact : (407) 322-7475 Copyright © 2025West End Trading Co. Privacy Policy Designed By Social Brew Media Home About Community History Menu Events Contact Home About Community History Menu Events Contact"
    },
    {
      "url": "https://www.advance-trading.com/contact-us",
      "text": "Get In Touch With Advance Trading | Contact Us Who We Are About ATI Our Brokerage Team Our Staff Our Partners ATI Agency - LRP Insurance FAQ What We Do Farm Marketing Services Commercial Grain Marketing Producer Risk Management Hedging Consultation Who We Serve Commercial Merchandising and Risk Created by potrace 1.16, written by Peter Selinger 2001-2019 Producer Grain Marketing Created by potrace 1.16, written by Peter Selinger 2001-2019 End User Input Price Protection Created by potrace 1.16, written by Peter Selinger 2001-2019 Technology My ATI Login ATI's Hedge Management System News & Media Weekly Market Outlook Market Information News & Publications ATI ProMedia Locations Advance Trading in Colorado Advance Trading in Illinois Advance Trading in Iowa Advance Trading in Kansas Advance Trading in Minnesota Advance Trading in Michigan Advance Trading in Missouri Advance Trading in Ohio Advance Trading in South Dakota Advance Trading in Tennessee Advance Trading in Texas Advance Trading in Wisconsin Contact Us Contact Us Send A Message Get In Touch Talk to Our Team Full Name Email Address Telephone Message Send Message mailing address P.O. Box 1027 Bloomington IL 61702-1027 direct 309.664.2300 fax 309.663.2375 email info@advance-trading.com Advance Trading, ATI, and ATI ProMedia are DBAs of CIH Trading, LLC, a CFTC registered Introducing Broker and NFA Member. The risk of trading futures and options can be substantial.  All information, publications, and material used and distributed by Advance Trading shall be construed as a solicitation. ATI does not maintain an independent research department as defined in CFTC Regulation 1.71. Information obtained from third-party sources is believed to be reliable, but its accuracy is not guaranteed by Advance Trading. Past performance is not necessarily indicative of future results. Careers | Privacy Policy CYBERNAUTIC WEB DESIGN "
    },
    {
      "url": "https://drinkatwestend.com/events/",
      "text": "Events - West End Trading Co. Skip to content Facebook Instagram events West End Events West End Events: Live Shows & Weekly Fun Discover the heart of Downtown Sanford's nightlife at West End Trading Co. and West End Live! From live music and DJ sets that light up the stage to our crowd-favorite weekly events, there’s always something happening. Whether you’re here for karaoke, poker, or a killer live performance, you’ll find good times, great drinks, and even better company. Check out what’s coming up and join the party! Contact if you're a band or live entertainment: BOOKING@DRINKATWESTEND.COM J&W PROMOTIONS PRESENTS:ZACK & MORGAN'S TILL DEATH DO US PART with CATCHER IN THE RYE , PHANTOM LIMBS , INSTIGATOR , HITMAKER , NOCTUS Sep 13 @ 07:30 PM $12.50 21 and up Tickets DIY PAINT AND SIP FALL-ING FOR YOU with SIP AND PAINT Sep 17 @ 06:30 PM $35.75 21 and up Tickets Subliminal Doubt with Control This! Effit and The Palmeranians with Subliminal Doubt: A Tribute to No Doubt , Control This , Effit , The Palmeranians Sep 19 @ 07:00 PM $18.65 21 and up Tickets VITAL PAIN with VITAL PAIN , Sonic Conversations , HIGHER GROUND , 12 GAUGE CONFESSIONAL , SEVERED RESISTENCE Sep 20 @ 07:00 PM $9.26 21 and up Tickets BRING YO VINYL HOSTED BY DJ ANGEL FROM THE MONSTERS IN THE MORNING with DJ Angel Sep 20 @ 09:00 PM $0.00 21 and up Tickets WEST END LIVE PRESENTS THAT 1 GUY with That 1 Guy Sep 25 @ 07:00 PM $24.15 18 and up Tickets J&W PRESENTS:BURN ABSOLUTE AND FRIENDS with BURN ABSOLUTE , FOR FEAR ITSELF , LIVES LOST , WHAT WE SEEK , BIANCA DOROTHE Sep 26 @ 07:30 PM $12.50 21 and up Tickets GLORYDAYSPRESENTS GARY PEYTON'S COUPLES THERAPY with JESSE PEYTON Sep 27 @ 06:00 PM $31.33 21 and up Tickets BAY STREET with BOZO, DEGENERATES,NONSENSE and RETURN TO SENDER with Bay street , Bozo , NONSENSE , RETURN TO SENDER Oct 3 @ 07:00 PM $12.50 21 and up Tickets BABE HAVEN WITH SPECIAL GUESTS with Babe Haven Oct 16 @ 08:00 PM $18.65 18 and up Tickets DIAL DRIVE ALBUM RELEASE SHOW FEATURING THE BASTARD SUNS AND THE LONGEST HALL with dial drive , The Bastard Suns , The Longest Hall Oct 17 @ 08:00 PM $18.65 21 and up Tickets TRIBUTE TO KORN – KORN AGAIN & TRIBUTE TO MARILYN MANSON – SPOUKY KIDS with Korn Again , Spouky Kids: Marilyn Manson Tribute Oct 18 @ 07:00 PM $29.43 21 and up Tickets J&W Presents Psycho Sideshow 2025 with Green Jello and Special guests with Green Jello , 96 Bitter Beings , The Convalescence , Indorphine , THE BUNNY THE BEAR , Ignominious , Goonlord , DALE EARNHARDT Oct 20 @ 05:00 PM $24.15 21 and up Tickets HANS GRUBER AND THE DIE HARDS WITH CHILLED MONKEY BRAINS, PANGOLIN AND THE COLORBLIND DINOSAURS with HANS GRUBER AND THE DIE HARDS , Chilled Monkey Brains , pangolin , Colorblind Dinosaurs Oct 22 @ 08:00 PM $18.65 21 and up Tickets Comedian BO JOHNSON with BO JOHNSON Oct 30 @ 07:00 PM All Ages Tickets THE SUB HERBS WITH THE GOODIES AND FLORIDAZE with sub herbs , THE GOODIES , FLORIDAZE Oct 30 @ 09:30 PM $12.50 21 and up Tickets WJRR 101.1 PRESENTS AFTERWEEN WITH THE HAUNT WITH GARGAMEL! AND SPECIAL GUESTS with The Haunt , Gargamel! Nov 1 @ 08:00 PM $12.62 21 and up Tickets COMEDIAN TARA CANNISTRACI with TARA CANNISTRACI Nov 6 @ 07:00 PM $38.93 21 and up Tickets The Palmer Squares with The Palmer Squares , The White Moms Nov 6 @ 09:00 PM $18.65 21 and up Tickets PEARL WITH SPECIAL GUESTS with Pearl Nov 9 @ 07:00 PM $18.65 21 and up Tickets 1 2 Next » Come in for 1 stay till 2(am) Address : 202 S Sanford Ave, Sanford, FL 32771 Facebook Instagram Contact : (407) 322-7475 Copyright © 2025West End Trading Co. Privacy Policy Designed By Social Brew Media Home About Community History Menu Events Contact Home About Community History Menu Events Contact"
    },
    {
      "url": "https://sivron.com/contact-us/",
      "text": ""
    },
    {
      "url": "https://drinkatwestend.com/contact/",
      "text": "Contact West End Trading Co. | Reach Out to Sanford’s Favorite Bar Skip to content Facebook Instagram contact Send contact us We’d Love to Hear From You! Whether you have a question, want to book an event, or simply want to drop by for a drink, we’re here to help! At West End Trading Co., we value our customers and are always happy to connect with the Sanford community. Reach out to us using the contact details below, and we'll make sure to get back to you as soon as possible. Contact if you're a band or live entertainment: BOOKING@DRINKATWESTEND.COM Get Tickets Come in for 1 stay till 2(am) Address : 202 S Sanford Ave, Sanford, FL 32771 Facebook Instagram Contact : (407) 322-7475 Copyright © 2025West End Trading Co. Privacy Policy Designed By Social Brew Media Home About Community History Menu Events Contact Home About Community History Menu Events Contact"
    },
    {
      "url": "https://www.westendadvisors.com/our-team/",
      "text": "WestEnd Advisors » Our Team Home Approach Strategies U.S. Sector U.S. Balanced Global Equity Global Balanced Global Conservative Multi-Asset Large-Cap Core Equity Insights Our Team Contact Strategies U.S. Sector U.S. Balanced Global Equity Global Balanced Global Conservative Multi-Asset Large-Cap Core Equity Our Team Our greatest resource is our people and the focused wisdom and deep experience they bring to their work. Since 2004, we have grown to 29 employees. Investment Management Fritz Porter, CFA Co-Chief Investment Officer, Portfolio Manager Fritz Porter, CFA Co-Chief Investment Officer, Portfolio Manager Fritz Porter is Co-Chief Investment Officer and a Portfolio Manager for the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. In addition to his portfolio management responsibilities, Fritz helps oversee the firm’s research team and investment process, and conducts macroeconomic, sector, and security analysis. Fritz entered the financial services industry in 1999 and joined WestEnd Advisors in 2008. Prior to joining WestEnd, he held asset management and investment banking positions at Wachovia Securities, U.S. Trust, and State Street Global Advisors. Fritz holds the Chartered Financial Analyst (CFA ® ) designation. He is a graduate of Davidson College, where he received his B.A. degree, and he earned his MBA from Duke University’s Fuqua School of Business. Ty Peebles, CFA Co-Chief Investment Officer, Portfolio Manager Ty Peebles, CFA Co-Chief Investment Officer, Portfolio Manager Ty Peebles is Co-Chief Investment Officer and a Portfolio Manager for the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. In addition to his portfolio management responsibilities, Ty helps direct the firm’s research efforts and investment process, manages investment team resources, and conducts macroeconomic research and market analysis across various regions, asset classes, and securities. Ty entered the financial services industry in 2010 and joined WestEnd Advisors in 2014. Prior to WestEnd, he worked at Global Endowment Management, an Outsourced Chief Investment Officer (OCIO) service to endowments and foundations, and as a Certified Public Accountant (CPA) with Ernst & Young LLP. Ty holds the Chartered Financial Analyst (CFA ® ) designation. He is a graduate of the University of North Carolina at Chapel Hill, where he received his B.A. in Economics, and he earned his Master of Accounting degree from UNC’s Kenan-Flagler Business School. Ned Durden Chief Investment Strategist, Portfolio Manager Ned Durden Chief Investment Strategist, Portfolio Manager Ned Durden is Chief Investment Strategist (CIS) and a Portfolio Manager for the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. In addition to his portfolio management responsibilities, as CIS, Ned is responsible for distilling the Investment Team’s outlook and research to ensure clear, accurate, and effective communication of the firm’s investment views and portfolio positioning. He also conducts sector and security analysis along with macroeconomic research used to guide decisions across the firm’s investment strategies. Ned entered the financial services industry in 1997 and joined WestEnd Advisors in 2006. Before joining WestEnd, he was a founding member and Senior Analyst at Cambium Capital, a long/short equity hedge fund. Prior to that, Ned was a Director at the MONY Group, a diversified financial services firm. Ned is a graduate of the University of Virginia, where he received his B.A. degree. He also received his MBA from the University of Virginia, Darden School of Business and his law degree from the University of Virginia School of Law (JD/MBA). Jacob Buchanan, CFA Portfolio Manager Jacob Buchanan, CFA Portfolio Manager Jacob Buchanan is a Portfolio Manager for the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise.  In addition to his portfolio management responsibilities, Jacob conducts macroeconomic and security research and analysis to support the management of all the firm’s investment strategies.  Jacob entered the financial services industry in 2016 and joined WestEnd Advisors in 2018. Prior to joining WestEnd, he worked at Credit Suisse supporting the CFO of the firm’s securitized products division where he was responsible for internal financial analysis and forecasting. Prior to that role, he served as an analyst supporting Credit Suisse’s Global Markets trading division, conducting expense and cost savings analysis. Jacob holds the Chartered Financial Analyst (CFA ® ) designation. He is a graduate of the University of North Carolina at Chapel Hill, where he received his B.A. in Economics and studied Statistics and Operations Research. Roger Regelbrugge, CFA Senior Investment Analyst Roger Regelbrugge, CFA Senior Investment Analyst Roger Regelbrugge is a Senior Investment Analyst and conducts research and analysis to support the management of the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. Roger entered the financial services industry in 2014 and joined WestEnd Advisors in 2019. Prior to joining WestEnd, he worked as a credit risk analyst with UBS AG, where he was responsible for assessing hedge fund counterparty risk across a range of trading strategies and products. Prior to that role, he served as an equity research analyst for Avondale Partners, a boutique investment bank headquartered in Nashville, TN. Roger holds the Chartered Financial Analyst (CFA ® ), Financial Risk Manager (FRM), and Chartered Market Technician (CMT) designations, and is a graduate of Belmont University in Nashville, TN, where he received his B.B.A. in Economics. Zach Hollister, CFA Investment Analyst Zach Hollister, CFA Investment Analyst Zach Hollister is an Investment Analyst and conducts research and analysis to support the management of the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. Zach entered the financial services industry in 2018 and joined WestEnd Advisors in 2021. Before joining WestEnd, he worked at Wells Fargo Asset Management supporting institutional portfolio management teams through quantitative analysis of market and economic factors, detailed analysis of asset allocation and asset managers, and by assisting in the development of an SMA portfolio transition platform. Prior to that role, he held internships including with Wells Fargo Advisors, where he assisted in research on individual stocks and analysis of financial advisor practice management initiatives. Zach holds the Chartered Financial Analyst (CFA ® ) designation.  He is a graduate of the University of North Carolina at Chapel Hill, where he received his B.A. in Economics and Media & Journalism. Matt Franken, CFA Investment Analyst Matt Franken, CFA Investment Analyst Matt Franken is an Investment Analyst and conducts research and analysis to support the management of the investment strategies at WestEnd Advisors, a Victory Capital Investment Franchise. Matt entered the financial services industry in 2017 and joined WestEnd Advisors in 2022. Before joining WestEnd, he served as an Investment Analyst in Truist Bank’s Investment Group where he performed economic and market analysis, provided commentary, and developed portfolio models for institutional and high-net worth individuals.  Before that, he held analyst and investment positions involved in portfolio construction and implementation with an OCIO firm and fund company. Matt holds the Chartered Financial Analyst (CFA ® ) designation.  He is a graduate of Messiah University in Mechanicsburg, PA, where he received his B.S. in Finance. Lewis Stocks, CFA Portfolio Specialist Lewis Stocks, CFA Portfolio Specialist Lewis Stocks joined WestEnd Advisors, a Victory Capital Investment Franchise in 2019. As a Portfolio Specialist, he is a participant on the Investment Committee and has responsibility for helping communicate the firm’s investment views to clients.  Before joining WestEnd, Lewis worked as a management consultant with Dixon Hughes Goodman, LLP’s Risk Advisory practice, where he implemented business process improvements for a major money-center banking client. Prior to that role, he served as an operations manager for A2 Access, a financial services technology company focused on data-driven solutions for institutional investors to better evaluate their sell-side partnerships.  Lewis holds the Chartered Financial Analyst (CFA ® ) designation. He received a B.S. in Business Administration with a concentration in Finance from North Carolina State University’s Poole College of Management. Business Development and Client Service Jason Leibowitz Managing Partner Jason Leibowitz Managing Partner Jason Leibowitz is a Managing Partner of WestEnd Advisors, a Victory Capital Investment Franchise. Jason oversees WestEnd’s business development and client-facing endeavors and helps lead business strategy for the firm. Jason entered the financial services industry in 2003 and joined WestEnd Advisors in 2015. He began his career as an investment advisor at Merrill Lynch and has held various roles at Morgan Stanley and Smith Barney including as a consulting group analyst and in advisory management positions. Most recently, Jason spent five years in the alternative investment management industry as the Director of National Accounts at Central Park Group and as the Director, Head of Private Client Group at HarbourVest Partners where he was focused on the global strategy and distribution of alternative investment solutions to high-net-worth clients and the intermediary channels that advise them. Jason received a B.S. in Finance from Rider University in 2003. Charles R. Thies Head of Marketing Charles R. Thies Head of Marketing Charles Thies joined WestEnd Advisors, a Victory Capital Investment Franchise in 2016. As Head of Marketing, he leads the development and implementation of WestEnd’s marketing and communications efforts, and he assists in the compilation and dissemination of the firm’s investment views. Charles entered the financial services industry in 1995. Prior to joining WestEnd Advisors, he founded Pergola Capital, LLC in 2014, serving as portfolio manager for a risk parity-based hedge fund. From 2002 to 2013, he held various investment research and communications roles with Fisher Investments, most recently as a Senior Capital Markets Analyst performing a range of economic and market research supporting the firm’s top-down investment process. Prior to that, he performed equity research for Salomon Smith Barney, from 2000 to 2001, and for a boutique investment management firm in Atlanta from 1996 to 1999. Charles is a graduate of the University of Virginia, where he received his B.S. in Commerce (Finance) from the McIntire School of Commerce and a B.A. in Philosophy. John Carlson Executive Director John Carlson Executive Director John Carlson joined WestEnd Advisors, a Victory Capital Investment Franchise, in 2018.  John plays a pivotal role in advancing WestEnd’s strategic initiatives.  He is also responsible for sales and marketing efforts including business development and managing relationships with key partners. John entered the financial services industry in 2012 as an associate with State Street Global Advisors’ SPDR exchange traded funds (ETF) group. He progressed into additional responsibilities, most recently as a Vice President and Regional Consultant. In these roles, John provided ongoing education and consultative support for financial advisors, helping them develop portfolio construction, wealth management, and practice management solutions utilizing ETFs. John received a B.A. in Economics Management from Ohio Wesleyan University in 2012. Seth Knight Executive Director Seth Knight Executive Director Seth Knight joined WestEnd Advisors, a Victory Capital Investment Franchise in 2016.  Seth helps lead a range of firm initiatives, including training and ongoing professional development of sales personnel, as well as management of internal sales personnel.  He also has responsibilities in sales and marketing including business development and relationship management with key partners. Seth entered the financial services and investment advisory industries in 2013. Prior to WestEnd Advisors, he worked at Raymond James & Associates as a Financial Advisor for three years, running a comprehensive financial planning and wealth management practice for individual investors and families. Seth is a graduate of Wofford College with a B.A degree in Finance. Townsend Porter, CIMA® Executive Director Townsend Porter, CIMA® Executive Director Townsend Porter joined WestEnd Advisors, a Victory Capital Investment Franchise in 2019.  Townsend helps drive a range of strategic initiatives for the firm, and he has sales and marketing responsibilities including business development and relationship management for national platform partners and key clients.  Townsend entered the financial services industry in 2015 as an Internal Sales Consultant with Invesco before progressing to a Senior Regional Sales Consultant role in the company’s wire house division covering exchange traded funds, mutual funds, separately managed accounts, and unit investment trusts. Prior to Invesco, he served as a Strategic Account Manager for Cardinal Health’s Acute Care division.  Townsend received his B.A. in International Business from the College of Charleston in 2010. Hunter Rome Director Hunter Rome Director Hunter Rome joined WestEnd Advisors, a Victory Capital Investment Franchise in 2018 and has responsibilities in sales and marketing including business development and relationship management. Hunter entered the financial services industry in 2016. Prior to WestEnd Advisors, he worked at Dimensional Fund Advisors focusing on business development and relationship management with independent financial advisors to high net-worth individuals and institutions. Prior to that role, he was a Legislative Aide for a United States Senator, advising on monetary, economic, and financial services policy. Hunter is a graduate of the University of North Carolina at Chapel Hill with a B.A. in Political Science and Communications. Peter Tortorici, CIMA® Director Peter Tortorici, CIMA® Director Peter Tortorici joined WestEnd Advisors, a Victory Capital Investment Franchise in 2022 and has responsibilities in sales and marketing including business development and relationship management. Peter entered the financial services industry in 2000. Prior to joining WestEnd, he served as a Vice President and Director of High Net Worth Consulting at Janney Montgomery Scott, LLC, where he partnered with the firm’s financial advisors to coordinate and deliver solutions for their largest clients.  Prior to that role, his experience includes a variety of wealth management, advisory, and business development positions with major brokerage and asset management firms. Peter received his Certified Investment Management Analyst (CIMA ® ) designation through The Investments & Wealth Institute and the Wharton School of Business.  He is a graduate of Fairfield University in Fairfield, CT where he earned his B.S. in Information Systems. Luke Rutledge, CAIA, CIMA® Director Luke Rutledge, CAIA, CIMA® Director Luke Rutledge joined WestEnd Advisors, a Victory Capital Investment Franchise in 2022 and has sales and marketing responsibilities including business development and relationship management. Luke entered the financial services industry in 2016. Prior to joining WestEnd, he served as an Assistant Vice President at Morgan Stanley Private Wealth Management, where he was responsible for relationship management, investment manager research, and portfolio construction for high-net-worth clients. His experience also includes business development roles with two major asset management firms.  Luke holds the Chartered Alternative Investment Analyst (CAIA) and Certified Investment Management Analyst (CIMA®) designations. He is a graduate of Clemson University with a B.S. in Financial Management. Brian Bzik Director Brian Bzik Director Brian Bzik joined WestEnd Advisors, a Victory Capital Investment Franchise in 2019 and has sales and marketing responsibilities including business development and relationship management. Brian entered the financial services industry in 2015 with State Street Corporation. Prior to joining WestEnd, he served as a Principal and Internal Consultant for State Street Global Advisors, where he conducted business development and relationship management with independent financial advisors in support of the company’s SPDR ETF products. Brian is a graduate of St. Lawrence University with a B.A. in Economics and Spanish. Annie Ninemire Senior Associate Director Annie Ninemire Senior Associate Director Annie Ninemire joined WestEnd Advisors, a Victory Capital Investment Franchise in 2019 and has sales and marketing responsibilities including business development, relationship management, and enhancing WestEnd’s sales and client relationship capabilities. Annie entered the financial services industry in 2013 with Gerson Lehrman Group, where she performed various roles including managing research relationships with large, multi-strategy asset management clients. Prior to joining WestEnd, she served as an Institutional Sales Associate with Dimensional Fund Advisors. Annie is a graduate of Vanderbilt University with a B.A. in Medicine, Health and Society. Emily Agnew National Account Manager & Marketing Strategist Emily Agnew National Account Manager & Marketing Strategist Emily Agnew joined WestEnd Advisors, a Victory Capital Investment Franchise in 2021.  Emily has responsibilities across the firm’s sales and marketing efforts, including developing and managing national relationships with key intermediary and RIA platform partners, as well as coordinating marketing initiatives and follow-up across platforms.  Emily’s experience includes a decade in the investment industry, with additional experience in the non-profit sector.  She most recently served as an Institutional Retirement Associate with Dimensional Fund Advisors.  Prior to that, her industry experience includes providing sales and client service support for the wealth management arm of a major money center bank.  Emily is a graduate of the University of North Carolina at Wilmington with a B.S. in Business Administration & Marketing, and a B.A. in Communication Studies. Cade Vela Associate Director Cade Vela Associate Director Cade Vela joined WestEnd Advisors, a Victory Capital Investment Franchise in 2023 and has sales and marketing responsibilities including business development and relationship management. Cade entered the financial services industry in 2022 through the analyst program at Ally Financial.  His experience includes capital markets analysis, corporate FP&A analysis, and serving as a Financial Analyst for the bank’s funding desk.  Cade is a graduate of Davidson College where he earned his Bachelor of Economics and captained the NCAA Division I football team. Nate Monastra Associate Director Nate Monastra Associate Director Nate Monastra joined WestEnd Advisors, a Victory Capital Investment Franchise in 2023 and has sales and marketing responsibilities including business development and relationship management. Nate entered the financial services industry in 2021.  Prior to WestEnd, he served as an Investment Analyst with Opus Capital Management, LLC, where he conducted a range of investment and macroeconomic research, directed trading, and provided economic and portfolio updates to clients. Nate is a graduate of Xavier University in Cincinnati, OH, where he earned a B.S. in Finance and an MBA from the Williams College of Business and was a First-Team All-Big East Catcher on the NCAA Division I baseball team. Jesse Boles Associate Director Jesse Boles Associate Director Jesse Boles joined WestEnd Advisors, a Victory Capital Investment Franchise in 2025 and has sales and marketing responsibilities including business development and relationship management. Jesse entered the financial services industry in 2008.  Prior to WestEnd, he led the internal sales desk as Director and Investment Strategist with Equitable 1290 Funds.  Before that, his experience includes serving as a structured products analyst at Bank of America, N.A., as a Regional Private Banker with Wells Fargo, N.A. and Client Associate for UBS Financial Services. Jesse is a graduate of St. Francis College in Brooklyn, NY, where he earned a B.A. in Economics, was a team captain for the Division 1 baseball team, and earned a position on the 2003 NEC Baseball Second Team All-Conference roster. Compliance and Business Management Graham Hunt Managing Partner Graham Hunt Managing Partner Graham Hunt is a Managing Partner of WestEnd Advisors, a Victory Capital Franchise. Graham entered the financial services industry in 2007 and joined WestEnd Advisors in 2015. He oversees WestEnd’s business functions and helps lead business strategy for the firm. Graham previously served as Chief Financial Officer of WestEnd. Prior to joining WestEnd, he was a Finance Manager at Ally Financial, Inc. where he was responsible for corporate financial planning and analysis. Before joining Ally, he worked as a Certified Public Accountant (CPA) in the Assurance practice at PricewaterhouseCoopers, LLP. Graham is a graduate of North Carolina State University with a B.S. in Accounting with a concentration in Financial Analysis. He also received his Master of Accounting degree from North Carolina State’s Poole College of Management. Jim Cox Chief Compliance Officer Jim Cox Chief Compliance Officer Jim Cox joined WestEnd Advisors, a Victory Capital Investment Franchise in 2020, and manages the compliance program. Jim entered the financial services industry in 1998 as a Compliance Officer with Interstate Johnson Lane, where he oversaw compliance with industry regulations for over 100 bank and brokerage branches. He continued in various compliance and management roles through several mergers, from Wachovia Securities to Wells Fargo Advisors. Prior to joining WestEnd, he most recently served as First Vice President/ Market Administration Manager, where his duties included leading and managing compliance policy decisions for the Charlotte market and assisting in the management oversight of over 130 Financial Advisors and Client Associates. Jim is a graduate of James Madison University with a B.A. in Business Management and holds the Investment Adviser Certified Compliance Professional (IACCP) designation and FINRA Series 7, 9, 10, 24, and 65 licenses. Cathy Lowe Director of Operations Cathy Lowe Director of Operations Cathy Lowe joined WestEnd Advisors, a Victory Capital Investment Franchise in 2009. Cathy manages the overall operations and administrative functions. In addition, Cathy performs operational duties including performance reporting and manages internal and external reporting. Prior to joining WestEnd, Cathy worked five years as senior manager in financial planning and analysis for Unisource Worldwide. In addition, she brings thirteen years of experience in capital markets including energy and equity trading, reporting, analysis and asset management for Mirant Corporation and Robinson-Humphrey. Cathy began her career in 1991 as a registered sales assistant for PaineWebber. Cathy is a graduate of the University of Georgia. Tricia Tauzin Director of Business Management Tricia Tauzin Director of Business Management Tricia Tauzin rejoined WestEnd Advisors, a Victory Capital Investment Franchise in 2021 and has responsibilities that that include overseeing certain day-to-day operations of the firm. Tricia has a decade of prior operations experience at WestEnd. Before rejoining WestEnd, Tricia worked at Buckhorn Investment Advisors. Prior to WestEnd, she worked for three years at Sterling Capital Management, including as Controller, and at Akre Capital Management as Operations Manager. Tricia is a graduate of Virginia Polytechnic Institute. Anna Brown Business Management Senior Analyst Anna Brown Business Management Senior Analyst Anna Brown joined WestEnd Advisors, a Victory Capital Investment Franchise in 2008 and has responsibilities that support day-to-day operations, including data management and analysis and ad hoc reporting. Anna previously managed the firm’s trading desk and relationships with external trading partners.  Prior to joining WestEnd, Anna worked for UBS Financial Services for over nine years as an Operations Manager and a Senior Registered Client Service Associate. Anna is a graduate of the University of North Carolina at Chapel Hill. Julie Feuerstein Accounting and Finance Analyst Julie Feuerstein Accounting and Finance Analyst Julie Feuerstein joined WestEnd Advisors, a Victory Capital Investment Franchise in 2020 and has accounting and finance responsibilities that support day-to-day management, including accounting, financial forecasting and analysis, and ad hoc internal reporting. Julie brings over a decade of managerial finance and accounting experience. Prior to joining WestEnd, Julie served as controller for hotels in Charlotte and Chicago, where she was responsible for financial analysis, forecasting and budgeting, and general accounting. Before that, she worked as an accounting manager in various locations for Prospera Hospitality, a hotel development and management company. Julie also has experience in employee management and customer service. Julie is a graduate of Mercyhurst University. Leigh Young Administration Leigh Young Administration Leigh Young joined WestEnd Advisors, a Victory Capital Investment Franchise in 2022 to provide administrative support for WestEnd’s clients and staff.  Leigh’s experience across a range of industries includes project and organizational management, marketing and communications, and corporate finance.  Leigh is a graduate of the Florida State University. Connect with us To learn more about how our proprietary sector-based approach can help you in meeting your investment objectives, please call us at 888.500.9025 , or email us at info@westendadvisors.com . WestEnd Advisors, LLC (“WestEnd”), an SEC-registered investment adviser, operates as an autonomous Victory Capital® Investment Franchise. WestEnd’s active principals are responsible for managing the firm and its day-to-day operations. Registration of an investment adviser does not imply any level of skill or training. WestEnd manages equity securities for individual, institutional and wrap clients. Customer Relationship Summary Proxy Voting Privacy Policy Form ADV Disclaimer 1001 Morehead Square Drive, Suite 600 | Charlotte, North Carolina 28203 © Copyright 2025, WestEnd Advisors"
    },
    {
      "url": "https://www.westendrepartners.com/west-end-team",
      "text": "Our Team - Real Estate Partners - Valued Investors and Entrepreneurs 0 Skip to Content About Properties Active Sold Our Team Contact Investor Login Open Menu Close Menu About Properties Active Sold Our Team Contact Investor Login Open Menu Close Menu About Folder: Properties Back Active Sold Our Team Contact Investor Login Our Team Jeffrey Katz Co-Founder & Managing Partner Jeff has more than 21 years of professional real estate experience, including property acquisitions, dispositions, finance and asset management.  Prior to co-founding West End Real Estate Partners, Jeff was a co-founder and Managing Principal of Highgate Capital Group, a national multifamily private equity firm with a focus on workforce housing in secondary and tertiary markets. Before starting Highgate, Jeff was a co-founder and Vice President of Acquisitions and Dispositions at Trilogy Real Estate Group, leading the investment strategy for its national multifamily investment fund.  Prior to Trilogy, Jeff was a Senior Vice President at DTZ Rockwood with responsibilities that included the disposition and advisory of more than $2.5 billion worth of real estate assets.  Jeff began his career in the acquisition group at LaSalle Investment Management. Jeff received a Bachelor’s in Real Estate-Finance from Indiana University in 1999. Email Jeff Jeff's LinkedIn Ed Jinn Co-Founder & Managing Partner Ed brings more than 25 years of experience in the real estate and financial services sectors, having served as a principal or adviser in more than $5 billion of real estate asset and operating company transactions.   Prior to co-founding West End Real Estate Partners, Ed was the CFO of a large New York family office, that specialized in acquisition and development of commercial real estate assets in the Tri-State area.  Ed's real estate experience spans multiple property types, including, multifamily, retail, office, hotel, industrial, mixed-use and land. He is experienced in acquisitions, financing, asset management, repositioning and leasing, development and construction, and dispositions. Prior to working for the family office, Ed worked for private equity and debt funds, a national multifamily development company, Big Four Accounting firm and commercial real estate investment banking firm. Ed is a graduate of George Mason University where he received an MS in Accounting and of Longwood University where he received a BS degree in Business Administration. Email Ed Ed’s linkedin Bryse Toothaker Principal Bryse’s experience spans more than two decades in the multi-family sector, providing accretive value to his clients and partners through business development, investor sourcing, capital markets, operational planning and deal execution. Prior to West End, as Managing Director for Capstone Companies, he helped to scale their multi-family business across the Carolinas and Georgia, while designing, building and bringing to market their Equity & Structured Finance business. Bryse’s roots are in the Midwest where he served as Vice President and Partner of Bradley Company, leading their multi-housing investment advisory business and capital markets group. Concurrently, as a Director with Great Lakes Capital, he was responsible for multi-housing acquisition, asset management and development for a portfolio encompassing the entire spectrum of asset classes from LIHTC to luxury. Bryse graduated from The University of Notre Dame in 2000 with a BA in history and a minor in computer sciences. Email Bryse Bryse's LinkedIN Keith Walker Principal, Head of Asset Management Keith Walker is Principal and Head of Asset Management at West End with more than 30 years experience, specializing in asset and portfolio management.  Mr. Walker specializes in a hands-on approach to creating value on a daily basis for both performing and under- performing assets, as well developing extensive work out strategies. Mr. Walker has developed strategic comprehensive business plans to turn around and create value in portfolios of real estate across 38 states. Mr. Walker’s previous positions included: Owner of Walker Asset Management Advisory Services; Brixmor Property Group-Vice President, Head of Asset Management; The Witkoff Group-Vice President Head of Asset Management; DTZ Rockwood-Senior Vice President; and Newmark & Company-Asset Manager.  He has worked with various asset types including Multi-Family, Retail Office, Industrial, Hotel and Development. Mr. Walker was a political science major and graduated from Emory University in 1988 and received his Masters in Real Estate Development and Investment from New York University in 1992. Email Keith Keith’s Linkedin Anthony Caranci Associate Anthony brings years of experience in real estate and finance to the team. Prior to joining West End Real Estate Partners, Anthony was an Investment Analyst at Peregrade Ventures, an entrepreneurial and highly collaborative family office that invests across a wide array of asset classes. Anthony was responsible for managing Peregrade’s real estate assets across multiple geographies and property types, including, single family, multifamily, retail, office, industrial, hospitality, mixed-use and land. Prior to joining Peregrade, Anthony was a Residential Debt Analyst at Man Group, a global hedge fund with more than $140 billion under management. During his time there, Anthony was involved in the underwriting and asset management of over $3 billion in residential loans. Anthony received his Bachelor’s in Finance and Information Systems from Loyola University Chicago in 2019. Email Anthony Anthony’s Linkedin West End has a strategic partnership with a New York family office that serves as a strategic advisor and capital partner to West End Real Estate Partners. Value Creation Investing See our properties Value Creation Investing About Properties Our Team Contact Investors ©2025 West End Real Estate Partners, LLC. All Rights Reserved."
    },
    {
      "url": "https://www.wayoutwesttrading.com/pages/about-us",
      "text": "About Us — Western Clothing - Way Out West Trading Co Skip to content **FALL ROUNDUP SALE** 30% OFF Entire Collection | 10% OFF First Orders with Code COWBOYUP **FALL ROUNDUP SALE** 30% OFF Entire Collection | 10% OFF First Orders with Code COWBOYUP Menu Cancel In God We Trust Login View cart MEN VIEW ALL MEN COWBOY BOOTS & SHOES COWBOY BOOTS SQUARE TOE BOOTS ROUND TOE BOOTS SNIP TOE BOOTS OSTRICH BOOTS ALLIGATOR BOOTS EXOTIC BOOTS WORK BOOTS ROPER BOOTS CASUAL SHOES CLOTHING JEANS & PANTS SHIRTS BIG & TALL JACKETS & VESTS HATS & BELTS HATS ACCESSORIES WALLETS TRAVEL BAGS & BRIEFCASES PISTOL & RIFLE CASES SUNGLASSES CASES SHAVE KITS BIBLE COVERS WOMEN VIEW ALL WOMEN COWGIRL BOOTS & SHOES VIEW ALL COWGIRL BOOTS & SHOES SQUARE TOE BOOTS ROUND TOE BOOTS SNIP TOE BOOTS EXOTIC BOOTS TALL BOOTS BOOTIES CASUAL SHOES SANDALS CLOTHING JEANS & BOTTOMS TOPS DRESSES & SKIRTS JACKETS & VESTS HOODIES HATS ACCESSORIES WESTERN PURSES WESTERN WALLETS TOTES & LUGGAGE COSMETIC & JEWELRY BAGS BIBLE COVERS KIDS VIEW ALL KIDS BOOTS & SHOES LITTLE KIDS BOOTS BIG KIDS BOOTS CASUAL SHOES TODDLER BOOTS & SHOES INFANT BOOTS & SHOES BOYS' CLOTHING SHIRTS VESTS JACKETS GIRLS' CLOTHING SHIRTS JACKETS & VESTS BOOTS VIEW ALL BOOTS COWBOY BOOTS MENS COWBOY BOOTS WOMENS COWBOY BOOTS WOMENS BOOTIES KIDS COWBOY BOOTS INFANT BOOTS & SHOES SQUARE TOE BOOTS SNIP TOE BOOTS ROUND TOE BOOTS WORK BOOTS EXOTIC BOOTS CASUAL SHOES MENS CASUAL SHOES WOMENS CASUAL SHOES KIDS' CASUAL SHOES CLOTHING SHIRTS & TOPS SOLID SHIRTS BIG & TALL MENS SHIRTS WOMENS SHIRTS & TOPS BOYS SHIRTS GIRLS SHIRTS & TOPS JEANS & BOTTOMS MENS JEANS WOMENS JEANS & BOTTOMS WESTERN DRESSES JACKETS & OUTERWEAR MENS JACKETS & VESTS WOMENS JACKETS & OUTERWEAR BEST SELLERS BRANDS DAN POST BOOTS DINGO BOOTS JUSTIN BOOTS LAREDO BOOTS ROPER BOOTS & APPAREL STETSON BOOTS & APPAREL STS RANCHWEAR TIN HAUL BOOTS & APPAREL ACCESSORIES WESTERN WALLETS WESTERN PURSES WESTERN TOTE BAGS LUGGAGE & BRIEFCASES COSMETIC & JEWELRY BAGS SHAVE KITS BIBLE COVERS SUNGLASSES CASES PISTOL & RIFLE CASES CLEARANCE SALE SIZE CHARTS REVIEWS ABOUT US Login Close MEN MEN VIEW ALL MEN COWBOY BOOTS & SHOES COWBOY BOOTS & SHOES COWBOY BOOTS SQUARE TOE BOOTS ROUND TOE BOOTS SNIP TOE BOOTS OSTRICH BOOTS ALLIGATOR BOOTS EXOTIC BOOTS WORK BOOTS ROPER BOOTS CASUAL SHOES CLOTHING CLOTHING JEANS & PANTS SHIRTS BIG & TALL JACKETS & VESTS HATS & BELTS HATS ACCESSORIES ACCESSORIES WALLETS TRAVEL BAGS & BRIEFCASES PISTOL & RIFLE CASES SUNGLASSES CASES SHAVE KITS BIBLE COVERS WOMEN WOMEN VIEW ALL WOMEN COWGIRL BOOTS & SHOES COWGIRL BOOTS & SHOES VIEW ALL COWGIRL BOOTS & SHOES SQUARE TOE BOOTS ROUND TOE BOOTS SNIP TOE BOOTS EXOTIC BOOTS TALL BOOTS BOOTIES CASUAL SHOES SANDALS CLOTHING CLOTHING JEANS & BOTTOMS TOPS DRESSES & SKIRTS JACKETS & VESTS HOODIES HATS ACCESSORIES ACCESSORIES WESTERN PURSES WESTERN WALLETS TOTES & LUGGAGE COSMETIC & JEWELRY BAGS BIBLE COVERS KIDS KIDS VIEW ALL KIDS BOOTS & SHOES BOOTS & SHOES LITTLE KIDS BOOTS BIG KIDS BOOTS CASUAL SHOES TODDLER BOOTS & SHOES INFANT BOOTS & SHOES BOYS' CLOTHING BOYS' CLOTHING SHIRTS VESTS JACKETS GIRLS' CLOTHING GIRLS' CLOTHING SHIRTS JACKETS & VESTS BOOTS BOOTS VIEW ALL BOOTS COWBOY BOOTS COWBOY BOOTS MENS COWBOY BOOTS WOMENS COWBOY BOOTS WOMENS BOOTIES KIDS COWBOY BOOTS INFANT BOOTS & SHOES SQUARE TOE BOOTS SNIP TOE BOOTS ROUND TOE BOOTS WORK BOOTS EXOTIC BOOTS CASUAL SHOES CASUAL SHOES MENS CASUAL SHOES WOMENS CASUAL SHOES KIDS' CASUAL SHOES CLOTHING CLOTHING SHIRTS & TOPS SHIRTS & TOPS SOLID SHIRTS BIG & TALL MENS SHIRTS WOMENS SHIRTS & TOPS BOYS SHIRTS GIRLS SHIRTS & TOPS JEANS & BOTTOMS JEANS & BOTTOMS MENS JEANS WOMENS JEANS & BOTTOMS WESTERN DRESSES JACKETS & OUTERWEAR JACKETS & OUTERWEAR MENS JACKETS & VESTS WOMENS JACKETS & OUTERWEAR BEST SELLERS BRANDS BRANDS DAN POST BOOTS DINGO BOOTS JUSTIN BOOTS LAREDO BOOTS ROPER BOOTS & APPAREL STETSON BOOTS & APPAREL STS RANCHWEAR TIN HAUL BOOTS & APPAREL ACCESSORIES ACCESSORIES WESTERN WALLETS WESTERN PURSES WESTERN TOTE BAGS LUGGAGE & BRIEFCASES COSMETIC & JEWELRY BAGS SHAVE KITS BIBLE COVERS SUNGLASSES CASES PISTOL & RIFLE CASES CLEARANCE SALE SIZE CHARTS REVIEWS ABOUT US About Us The opportunity in the West was real for the Way Out West Trading Co family and they take great pride in this family-owned and operated business. Understanding that each customer is just as special as the next, they do their best to bring a helpful and personal touch every time someone decides to shop with them. We’re dedicated to building a business founded on integrity and personal customer service. More importantly, we as a family lean on God and each other day by day. When you shop with us you can always find the quality brands you trust and know there is someone on the other side who truly cares about your needs. We’re always happy to see you, so drop by or call anytime! IN GOD WE TRUST 970-761-3151 sales@wayoutwesttrading.co 449 Yampa Ave Craig CO, 81625 Division of Expedition Investments LLC Customer Service Contact Us Shipping & Returns Size Charts Events Returns & Exchange Portal Collaborate With Way Out West Trading Follow us Email Way Out West Trading Co Find us on Facebook Find us on Instagram Newsletter Sign up for our newsletter for current sales and events. Email address Sign up Terms & Conditions Privacy Policy Copyright © 2025 Way Out West Trading Co. Powered by Shopify American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Added to your cart: ** total_quantity ** | ** unit_price ** / ** unit_measure ** (- ) Cart subtotal View cart ( ) Checkout One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted."
    }
  ]
}