{
  "fuentes": [
    {
      "url": "https://dtp.org.au/contact/",
      "email": "info@dtp.org.au"
    },
    {
      "url": "https://dtpleadership.com/",
      "email": "info@dtp-leadership.com"
    },
    {
      "url": "https://dtpleadership.com/",
      "email": "info@dtpleadership.com"
    },
    {
      "url": "https://dtplv.com/contact/",
      "email": "events@downtownproject.com"
    },
    {
      "url": "https://dtplv.com/contact/",
      "email": "events@dtplv.com"
    },
    {
      "url": "https://dtplv.com/contact/",
      "email": "hi@dtplv.com"
    },
    {
      "url": "https://dtplv.com/contact/",
      "email": "media@dtplv.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.dtp.net.id/en/about-us",
      "email": "sales@dtp.net.id"
    }
  ],
  "mails": [
    "events@downtownproject.com",
    "events@dtplv.com",
    "hi@dtplv.com",
    "info@dtp-leadership.com",
    "info@dtp.org.au",
    "info@dtpleadership.com",
    "info@reception-plus.de",
    "media@dtplv.com",
    "sales@dtp.net.id"
  ],
  "nombre_sitio": "dtpfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://dtp.org.au/contact/",
      "text": "Contact  |  Diplomacy Training Program Skip to content About Us Governance Secretariat Our History Policies Annual Reports Community Alumni Trainers Partners Funders Training Human Rights and Peoples’ Diplomacy Children’s Rights Diaspora Communities Human Rights, Business and Climate Change Indigenous Peoples – Asia Pacific Indigenous Peoples – Australia International Human Rights Mechanisms Rights of Migrant Workers Other Programs Impact Resources Human Rights Defenders Guidelines Child Rights Convention Webinar Series DTP-STARTTS Human Rights Webinar Series UNDRIP Webinar Series Human Rights & Climate Change UDHR @ 75 News Newsletter Archive About Us Governance Secretariat Our History Policies Annual Reports Community Alumni Trainers Partners Funders Training Human Rights and Peoples’ Diplomacy Children’s Rights Diaspora Communities Human Rights, Business and Climate Change Indigenous Peoples – Asia Pacific Indigenous Peoples – Australia International Human Rights Mechanisms Rights of Migrant Workers Other Programs Impact Resources Human Rights Defenders Guidelines Child Rights Convention Webinar Series DTP-STARTTS Human Rights Webinar Series UNDRIP Webinar Series Human Rights & Climate Change UDHR @ 75 News Newsletter Archive donate Contact Us Get in touch Have questions? Ask away. Your Name (Required) Email (Required) Enter email address Confirm email address Phone Subject (Required) General enquiry or comment Suggesting a training program Interested in becoming a trainer for DTP Interested in partnering with DTP Interested in volunteering or internships Interested in funding or sponsoring DTP Making a complaint Message (Required) Subscribe? Yes, please add me to your mailing list for regular news and updates No thanks By subscribing to our newsletter you are agreeing to be kept informed of news, updates and fundraising activities. You can unsubscribe at any time. Facebook This field is for validation purposes and should be left unchanged. Diplomacy Training Program Faculty of Law & Justice, UNSW Sydney, NSW 2052, Australia Tel. + (61 2) 9385 3549 Email [email protected] Key contacts Patrick Earle Executive Director + (61 2) 9385 2277 Clare Sidoti Communications and Office Coordinator + (61 2) 9385 3549 Latest News and Activity Bablu Chakma DTP eNews Issue #225 Pacific human rights and climate change advocates participate in regional capacity building program Asian Indigenous advocates participate in 2025 Indigenous Peoples, Human Rights and Business training program DTP 2024 Annual Report Sign up to our newsletter for Asia-Pacific human rights updates, DTP news and community stories. First Name (Required) Last Name (Required) Email (Required) reCAPTCHA Phone This field is for validation purposes and should be left unchanged. DTP acknowledges the traditional custodians of the land on which we work, the Bedegal people of the Eora Nation. We recognise their lands were never ceded, and we acknowledge their struggles for recognition and rights and pay our respects to the Elders – past, present – and the youth who are working towards a brighter tomorrow.  This continent always was and always will be Aboriginal land. Aboriginal and Torres Strait Islander peoples should be aware that this website contains images or names of people who have passed away. What we do About Training Impact Information News Resources Contact Us Facebook Twitter Youtube Linkedin We are a proud partner of UNSW Law & Justice What we do About Impact Training Information News Resources Contact Us Facebook Twitter Youtube Linkedin DTP acknowledges the traditional custodians of the land on which we work, the Bedegal people of the Eora Nation. We recognise their lands were never ceded, and we acknowledge their struggles for recognition and rights and pay our respects to the Elders – past, present – and the youth who are working towards a brighter tomorrow.  This continent always was and always will be Aboriginal land. Aboriginal and Torres Strait Islander peoples should be aware that this website contains images or names of people who have passed away. We are a proud partner of UNSW Law & Justice Privacy Policy | Terms of Use | Disclaimer | Policies © 2022 Diplomacy Training Program | ABN 31 003 925 148 | Web Design by Studio Clvr This website uses cookies to optimise your online experience. Click to view Privacy Policy. got it"
    },
    {
      "url": "https://dtpleadership.com/",
      "text": "Home - DTP Leadership Group Skip to content Home About Us Services List of Services Emotional Connection Habitual Patterns Leadership Building Relationships Through Appreciating Differences Executive Coaching Visionary Dream Coaching DTP Business Strategies Organizational Development Consulting Five Practices of High Impact Leadership Assessments Habitual Behavior Patterns Assessment LPI Online Blog Podcast Schedule Appointment Contact Us Home About Us Services List of Services Emotional Connection Habitual Patterns Leadership Building Relationships Through Appreciating Differences Executive Coaching Visionary Dream Coaching DTP Business Strategies Organizational Development Consulting Five Practices of High Impact Leadership Assessments Habitual Behavior Patterns Assessment LPI Online Blog Podcast Schedule Appointment Contact Us Home Unlock your Full Potential with Visionary Dream Coaching Embark on a transformative journey with us. From Emotional Connection to Organizational Development, we comprehensively address your needs. Break free from limitations, unleash potential, and achieve profound change. Our mission is guiding you towards unmatched success by addressing your unique pain points. Your transformation begins now. Join Now Book a Meeting Hot Topic Bold Talk Podcasts Tired of misleading headlines? Don’t have time to search for answers? Join Dr. Jackalyn as she boldly shares facts, history, articles and solutions to controversial topics. She is a friendly and engaging host who creates a comfortable environment for participating in conversations. Join her on the third Thursday of the month at 7 pm CST. Listen Now Dr.Rainosek named a top 50 female entrepreneur by LA style. DTP-Leadership co-founders Jackalyn Rainosek, Ph.D. and Liz Cloud has years of experience helping individuals and organizations. The duo and their associates have identified the elements for successful personal and organizational growth and transformation. Join Now Book a Meeting Thank You for Attending Our Recent Event with Barry Posner! Let’s relive the incredible moments from the Barry Posner event . Here are some highlights captured during the event. Watch the Event Unleash Your Potential Take Yourself to the Next Level Unlock the keys to your limitless potential Attend to Course ABOUT US Welcome Welcome to our DTP Leadership website! We are delighted to have you here as we embark on a collective journey to explore the art of effective leadership. As passionate and experienced leaders, we believe in the transformative power of inspiring others, fostering collaboration, and driving positive change. This platform serves as a gateway into our world of leadership, where we aim to share insights, strategies, and experiences that can empower individuals and organizations to reach their full potential. Join us as we delve into the realm of leadership philosophy, practical tips, and thought-provoking discussions. Together, let’s unlock the key to exceptional leadership and make a lasting impact in the world. Read More About Us OUR PROGRAMS What You Will Learn From Us Emotional Connection Our foundational program guides you in identifying emotional triggers, processing feelings, and making informed decisions. Led by our experienced team, DTP offers systematic practice and creative exercises, empowering you to enhance your emotional quotient. Learn more on how to create a journey towards stronger relationships and profound self-discovery! Learn More About this → Habitual Patterns Explore your habits with DTP's unique assessment, pinpointing 17 key patterns. Tired of fleeting changes? Our assessment provides personalized insights, empowering lasting transformations in your behavior and interactions. Dive into profound emotional experiences and effective leadership! Learn More About this → Leadership Embrace the transformative power of our leadership program, where genuine leadership begins: within yourself. Explore your leadership potential with the Leadership Practices Inventory® (LPI) and our Habitual Patterns Assessment. Start your journey to authentic leadership today! Learn More About this → Building Relationships Through Appreciating Differences Join DTP Leadership Group’s transformative journey in Building Relationships Through Appreciating Differences. With 50 years of expertise, we empower organizations with transformative programs focused on leveraging different perspectives. Our assessments and emotional connection training break barriers. Let us guide your organization to thrive and build relationships through appreciating differences. Experience the future of work with DTP Leadership! Learn More About this → Executive Coaching Ready to break barriers and reach new heights? DTP's Executive Coaching is your ticket to personal and professional growth. Our experienced coaches, Dr. Jackalyn Rainosek and Liz Cloud, empower you to overcome challenges, enhance skills, and achieve your goals. Discover a confidential space for transformation. Your journey to success starts here. Dive in today! Learn More About this → Visionary Dream Coaching Embark on a transformative journey with DTP's Visionary Dream Coaching. Discover your purpose, overcome barriers, and manifest your dreams. Our certified coaches offer personalized sessions, exercises, and journaling, creating a safe space for your growth. Embrace a richer, more meaningful life. Start your visionary journey now! Learn More About this → DTP Business Strategies Elevate your business with DTP Business Strategies! Led by Dr. Jackalyn Rainosek, our team offers tailored solutions for revenue and profit growth. Unlock your business's potential and dominate your market. Ready to thrive and secure your success? Learn More About this → Organizational Development Consulting Transform your organization with DTP Leadership Group. We guide you through change, refining purpose, vision, and interactions for success in today's dynamic world. Our experts enhance leadership skills, foster clear communication, and build equitable workplaces. Experience improved productivity and collaboration. Elevate your business today! Learn More About this → EXPERIENCED MENTORS Meet Our Team Dr. Jackalyn Rainosek Captain Allan Post Sahira J. Abdool, MPA, MHA, MHR Jowell Lydon Linda Snook Robert C. Hernandez Lori Walters Liz Cloud Meet DTP Leadership Group, LLC TESTIMONIALS What Our Clients Say About Us “I owe so much to Dr Jackalyn she’s helped give me confidence she helped me navigate through the transition from middle management to Executive leadership.” Lori Walters “Your program has really helped me hone and develop where I need to be, where I need to go, and how to go there.” Bob Hernandez “I love that this is a very systematic way to get clear on your core beliefs, vision, and values so that you can create 10 specific dreams you know like a personal dream, professional dream, Finance dream, family dream, and more.” Joanna Clark “I know where i want to go, I know how to to get there and I know I am making progress. It is an entirely different world that I look out upon today, much more positive, much more certain.” Rob Moss See more successful stories BLOG Read Our Latest Articles Dr. Jackalyn Rainosek September 11, 2025 Cheating To Win: Gerrymandering And The Fight For Fair Representation Read More Dr. Jackalyn Rainosek September 4, 2025 Lines Of Power: Redistricting, Civil Rights, And The Courts Read More Dr. Jackalyn Rainosek June 25, 2025 One Big, Brutal Betrayal: The Truth Behind Trump’s Budget Bill Read More Read More Articles Subscribe to Our Newsletter to Get Latest Updates! Enter Your Email Address and Subscribe Now to Receive More Information About Our Programs Name (Required) First Name Last Name Email Address (Required) Our Vision Our vision is to empower businesses and individuals to achieve omnipresence in the digital world – to be visible and influential across all relevant channels and touchpoints. Pages Home About Us Programs Blog Contact Us Home About Us Programs Blog Contact Us Help & Support Contact Us Site Privacy Contact Us Site Privacy Follow Us Facebook Instagram YouTube TikTok LinkedIn Facebook Instagram YouTube TikTok LinkedIn Contact Us info@dtpleadership.com (+1) 713-202-6884 © 2023 – 2025 DTP Leadership All right reserved. Solution by Chamsites.com Book a Meeting"
    },
    {
      "url": "https://dtplv.com/contact/",
      "text": "Contact Us - DTP Companies Home About Us Remembering Tony Hsieh Mission & Culture Managed Assets Hospitality Real Estate Small Business DTLV LIVE Work Explore DTLV Conventions & Events Art Murals Media Press Careers Contact Us Home About Us Remembering Tony Hsieh Mission & Culture Managed Assets Hospitality Real Estate Small Business DTLV LIVE Work Explore DTLV Conventions & Events Art Murals Media Press Careers Contact Us Contact Us Get In Touch General Inquiries For general inquiries: hi@dtplv.com Media Media or PR inquiries: media@dtplv.com Events For booking events: events@dtplv.com Careers Interested in a career with us? Apply Here Quick Links Home About Us Awards Contact Us Careers Visit one of our many Downtown Las Vegas Properties. Copyright 2025, DTP Companies, All Rights Reserved. Privacy Policy We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information . Cookie Settings Accept Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name First name E-Mail Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.dtp.net.id/en/about-us",
      "text": "About Us – DTP ABOUT US Who We Are Care Team History VSAT Ku-Band BuanterSat BuanterSat Maritime C-Band ID NET Broadband VSAT ID NET Dedicated VSAT Coverage Area Value Added Service CONNECTS SUPPORT Customer Care FAQ FAQ – Internet Services FAQ – Data Center Service FAQ – VSAT Service My Dtp English Bahasa Indonesia English Who We Are Who We Are Hello and Thank You for taking the time to visit DTP Here at DTP we know that Business Continuity is the utmost importance to you. We continually improve ourselves in making sure we deliver the utmost best in order for you to do your business smoothly. Connectivity is our expertise. Let Connecting be our job and Doing Business is your Only job. Trusting your business connectivity to us will give you peace of mind. Our Mission is to become the Best Internet, Datacenter and VSAT provider in Indonesia. Our hunger and determination to strive for perfection would give us a strong foundation to be able to deliver the best service with care to you.We strongly believe in service with Care is the only way in ensuring Customer satisfaction. We truly believe that we are the best provider for you. Please come and talk to us for any enquiries you may have. We will be truly happy to have the chance to be able to serve and to care for you. DTP is all about serving and caring. Connecting Business with Care. Our Path Discipline is Our Nature Consistency to reach objective, achievement obtained in timely manner. Being organized and committed towards work accomplishment. Creativity Stimulates Our Success Room for being creative is everyone`s privilege. A working environment that enables people to grow. Ideas applied in smart work are positively supported. Eastern Attitude Shapes Our Culture Modernization takes us further in our intelligence, but we never forget our Eastern root. We behave as the way we are, Indonesian with Eastern behavior. Our Mission Contribute to Develop ICT Information & Communications Technology (ICT) are our focus. We contribute to Indonesia`s ICT development for a better future. Striving for Perfection The Best Internet, Datacenter and VSAT service provider in Indonesia. Continual improvement striving for perfection. Customer satisfaction is absolute. Caring for Client's Needs Clients are our family and their needs are our priority. We provide the best service. We are focused to proactively assist them 24/7/365. HEAD OFFICE Jl. Embong Tanjung No.40, Surabaya 60271 +62 31 5344861 OPERATION CENTER Menara Tendean 27th Floor | Jl. Kapten Tendean No.20C, Kuningan Barat, Jakarta 12710 +62 21 27096900 / +62 21 27097535 NEWSLETTER Email CUSTOMER SERVICE +62 21 28681258 (24 Hours) +62 822-9999-9387 (Whatsapp) Care DTP SALES INQUIRIES sales@dtp.net.id © 2021 dtp. All rights reserved ABOUT US Who We Are Care Team History VSAT Ku-Band BuanterSat BuanterSat Maritime C-Band ID NET Broadband VSAT ID NET Dedicated VSAT Coverage Area Value Added Service CONNECTS SUPPORT Customer Care FAQ FAQ – Internet Services FAQ – Data Center Service FAQ – VSAT Service My Dtp English Bahasa Indonesia English INQUIRIES We love to hear from you. Use the form below to contact us. We are here to answer any questions you may have about our services and products. Reach out to us and we’ll respond as soon as we can. Name Company Email Phone Number Product/Service --- DTP Internet Transit Buanter Prime Internet Buanter Smart Internet Global Internet Fiber Optic Access Wireless Access GSD Colocation Server GSD Dedicated Server GSD Rack Solution GSD Private Room GSD Suite Room GSD Alpha GSD C1 GSD C2 GSD T1 GSD T2 VSAT Service Coverage Area Value Added Service Lainnya Subject Message ×"
    }
  ]
}