{
  "fuentes": [
    {
      "url": "https://cm.dunedinfl.com/members/member/dunedin-golf-club-1141",
      "email": "info@dunedinfl.com"
    },
    {
      "url": "https://www.ontheteemagazine.com/editorial_florida/shotmakers-Dunedin%20Golf%20Club.html",
      "email": "enews@ontheteemagazine.com"
    },
    {
      "url": "https://thegolfwire.com/dunedin-golf-club-renovation-award",
      "email": "carl@kevinfrischpr.com"
    },
    {
      "url": "https://thegolfwire.com/dunedin-golf-club-renovation-award",
      "email": "kevin@kevinfrischpr.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2025-06-04/dunedin-golf-club-awarded-renovation-of-the-year-by-golf-inc",
      "email": "carl@kevinfrischpr.com"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2025-06-04/dunedin-golf-club-awarded-renovation-of-the-year-by-golf-inc",
      "email": "kevin@kevinfrischpr.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "fbmgr@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "bryan.ewart@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "info@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "matt.vincent@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "ryan.dunkley@golfosoyoos.com"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "email": "info@clubcaddie.com"
    },
    {
      "url": "https://www.golfcoursetrades.com/dunedin-golf-club-post-hurricane-update-winterizing/",
      "email": "adrep@thetrades.com"
    },
    {
      "url": "https://www.golfcoursetrades.com/dunedin-golf-club-post-hurricane-update-winterizing/",
      "email": "fairgreens@seanet.com"
    },
    {
      "url": "https://www.golfcoursetrades.com/dunedin-golf-club-post-hurricane-update-winterizing/",
      "email": "membership.help@gcsaa.org"
    },
    {
      "url": "https://www.denbighgolfclub.co.uk/contactus/",
      "email": "professional@denbighgolfclub.co.uk"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-1024x1024.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-300x300.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-600x600.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-768x768.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1.jpg"
    },
    {
      "url": "https://www.stclairgolf.co.nz/contact-details?ComeFromCat=1688",
      "email": "admin@stclairgolf.co.nz"
    },
    {
      "url": "https://www.stclairgolf.co.nz/contact-details?ComeFromCat=1688",
      "email": "manager@stclairgolf.co.nz"
    },
    {
      "url": "https://www.stclairgolf.co.nz/contact-details?ComeFromCat=1688",
      "email": "pro@stclairgolf.co.nz"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "email": "hcc@unitelc.com"
    }
  ],
  "mails": [
    "admin@stclairgolf.co.nz",
    "adrep@thetrades.com",
    "allan-@-the-masters-1-1024x1024.jpg",
    "allan-@-the-masters-1-300x300.jpg",
    "allan-@-the-masters-1-600x600.jpg",
    "allan-@-the-masters-1-768x768.jpg",
    "allan-@-the-masters-1.jpg",
    "bryan.ewart@golfosoyoos.com",
    "carl@kevinfrischpr.com",
    "enews@ontheteemagazine.com",
    "fairgreens@seanet.com",
    "fbmgr@golfosoyoos.com",
    "hcc@unitelc.com",
    "info@belfairsgolfclub.co.uk",
    "info@clubcaddie.com",
    "info@dunedinfl.com",
    "info@golfosoyoos.com",
    "kevin@kevinfrischpr.com",
    "manager@stclairgolf.co.nz",
    "matt.vincent@golfosoyoos.com",
    "membership.help@gcsaa.org",
    "pro@stclairgolf.co.nz",
    "professional@denbighgolfclub.co.uk",
    "ryan.dunkley@golfosoyoos.com"
  ],
  "nombre_sitio": "dunedingolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://cm.dunedinfl.com/members/member/dunedin-golf-club-1141",
      "text": "Dunedin Golf Club | Sports - Golfing Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login/Sign-Up info@dunedinfl.com 301 Main Street, Dunedin, FL 34698 Facebook Ovaicon-instagram Youtube Yelp Linkedin Menu Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login / Sign-Up Dunedin Golf Club Home Dunedin Golf Club Categories Sports - Golfing 1050 Palm Blvd. Dunedin FL 34698 (727) 250-1053 (727) 734-0189 Visit Website Rep/Contact Info Blair Kline × Close Blair Kline Phone: (727) 250-1050 Send an Email 1050 Palm Blvd. Dunedin FL 34698-2697 Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Email us info@dunedinfl.com Make a call (727) 733 – 3197 About The Dunedin Chamber of Commerce supports initiatives that make our community a better place to live in and do business. Become a Member Facebook-f Instagram Youtube Linkedin Explore About Us Our Team Latest News Contact Request Ribbon Cutting Request Member Spotlight Upcoming Events Video Credit: Maas Media Photo Credit: Dorky Daisy Photography Website Design/Development: Mirror Marketing © Copyright 2024 – Dunedin Chamber of Commerce"
    },
    {
      "url": "https://www.ontheteemagazine.com/editorial_florida/shotmakers-Dunedin%20Golf%20Club.html",
      "text": "Dunedin Golf Club: On The Tee magazine On The Tee Magazine | Directories | Travel | Course Reviews | Junior Golf | About Us | Contact Us Dunedin   Golf Club: History Abounds at This Donald Ross Design. So many Canadians associate Dunedin Florida with a spring pilgrimage filled with anticipation for a successful season for our beloved Blue Jays. Home to Toronto’s spring training campus and their Class “A” farm team since their inaugural year in 1977, this northern Tampa suburb has a strong connection to Canadian Snowbirds looking to get a head start on their baseball fix. One of the oldest towns in Florida, settled by Scottish immigrants and given the Gaelic name for Edinburgh, Dunedin has embraced its old world roots for decades. Long before the Jays staked claim to this charming seaside city, legendary Scotsman Donald Ross built one of his over 300 designs on a rolling piece of land a block from the Gulf Coast. This historic club has roots dating back to 1927 as the Dunedin Isles Golf Club. Built to attract residents to the area, the Club eventually became the first home to the PGA of America in 1945. From 1945 to 1962 these historic links played host to the Senior PGA Championship, as well as being home to the original PGA Merchandise Show in 1954. Now returned to its origins as Dunedin Golf Club, this local area favorite is both a living historic tribute to the game and superb challenge for those attempting to conquer an original Ross design. Course Stats: Par 72 Yardage Rating/Slope-M Rating/Slope-F Blue 6625 71.3 / 131 - White 6245 69.7 / 125 - Combo 5708 66.8 / 114 - Red 5370 - 70.1 / 116 Silver 5267 64.8 / 110 69.7 / 115 Gold 4710 - 67.9 / 111 Access : Public daily fee. Location: Dunedin, Florida Currently listed on the National Registry of Historic Places, Dunedin Golf Club has recently undergone an extensive renovation focussing on returning the greens and bunkers back to Ross’ original specifications. The course is proud of its roots and presents a true Ross challenge. Typical to the style of the era Dunedin features raised greens protected by deep soft sand bunkers waiting to punish anything slightly off target. Filled with doglegs, elevation changes and strategic use of the Curlew Creek, the design gives you room off the tee but places demands on your approaches to the tricky sloped greens. Feature Holes Descriptions: The routing is split by Palm Boulevard, with the front side playing east away from the Gulf. The opening four holes of this historic course might be considered one of the most difficult stretches in the state. From the tips, playing 424, 466, 185 and 433 to a par of 15, only the most skilled players will have a chance to approach par. Donât let the downhill tee shots fool you with a  sense of extra distance off the tee. Huge live oaks cloaked in moss hinder the sightlines  requiring shaped approach shots into well protected raised greens. Woods or  hybrids will be the club of choice if the centers of the fairways are not found  on these devilish doglegs. The back side begins in the shadows of the golf shop heading towards the surf. The par 3 11th is the first hole that brings water into play. Both Curlew Creek and a large pond left make the long iron shot that much more testing. Playing back to the clubhouse terrace on the uphill 13th par 4, you need to take an extra club to overcome the elevation. The second of the water holes is a downhill candycane-like dogleg left wrapped around a pond. It tempts you to pull the driver and swing for the fences, but the best play it to hit to the corner and finesse a mid iron into the tight green. The par 5 15th is a risk reward beauty making you think about how to overcome the “Curlew Crossing.” The round finishes with the #2 handicap hole a straight away uphill par 4 climbing all the way to the clubhouse with trees left and OB down the right forcing 2 mighty strikes to get home. The course is quite playable with lots of space surrounding the fairways and green sites. The huge oaks separating the course from the surrounding homes come into play when you are a little astray. The raised  Ross greens will force an extra club on your approaches but be careful of distance control for fear of the fall aways into those nasty Ross bunkers. Steeped in history and proud of its heritage, it is no wonder Dunedin has been included as one of the 50 facilities in the newly created Florida’s Historic Golf Trail . Whether in town to enjoy a spring get-a-way or to cheer on the boys of summer, a side trip to the Dunedin Country Club is an absolute must for the golfing enthusiast. Contact: Dunedin  Golf Club 1050 Palm Boulevard, Dunedin, Florida, 34698 727-733-7836 [website]â Facebook Twitter sign up for ENEWS about us | contact us | archives | advertise | privacy policy ©2012 On The Tee, all rights reserved. Website designed by Bateman Design Group."
    },
    {
      "url": "https://thegolfwire.com/dunedin-golf-club-renovation-award",
      "text": "DUNEDIN GOLF CLUB AWARDED RENOVATION OF THE YEAR BY GOLF INC. - The Golf Wire Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Advertise â¢ Subscribe â¢ Contact The Golf Wire Covering the business of golf! MENU MENU Apparel Business Courses Equipment People Podcasts Jobs Search Close DUNEDIN GOLF CLUB AWARDED RENOVATION OF THE YEAR BY GOLF INC. June 4, 2025 Twitter Facebook Pinterest Email Iconic Central Florida Muni design gets recognized as the top public course renovation Dunedin, FL â Dunedin Golf Club, the historic Donald Ross-designed course owned by the City of Dunedin (just north of Tampa), has been awarded âRenovation of the Yearâ by Golf Inc . in the public course category. Through the guidance of golf course architect Kris Spence, a leading Donald Ross expert, and a $6 million course restoration, the course has been restored to its roots of the Golden Age of Architecture. âBeing recognized by Golf Inc . as the top public golf course renovation is very exciting, especially for a municipal course,â said Blair Kline, General Manager of Golf Operations. âThis recognition is a testament to the support we have received from the City of Dunedin, which had the vision of how a restoration of this magnitude can impact the local community, along with the work that Kris Spence did in bringing back the greens and bunker complexes that Donald Ross originally intended.â Dunedin Golf Club was built in 1926 and opened for play on January 1, 1927, under the name Dunedin Isles Golf Club. At the time, Ross referred to it as âhis masterpieceâ and attributed it to its ideal combination of rolling hills, waterways, and other natural hazards that made it possible to achieve his idea of course perfection. In 1939, the City of Dunedin took ownership of the course, and in 2024, it took over the management operations. Over the years, several renovations took the course further away from what Ross had created. This included the green complexes shrinking 35-to-50 percent, taking away from the strategy Ross intended. In 2014, it was listed on the National Register of Historic Places. Now, thanks to this latest and meticulous restoration of the green complexes, bunkers, fairways, and tees, every golfer can experience the course as Ross intended â right down to the actual greens Ross originally created. default âAt Dunedin, the most pleasant surprise was that I could see the old green extending out beneath those renovations and was able to measure them and compare them to his original plans and notes, and I quickly realized that the original greens had never been destroyed,â says Spence. âThey were just buried under this material, so the opportunity to remove the material, excavate and expose the original greens, and restore them was possible.â In 1944, the PGA of America moved its headquarters to Dunedin from Chicago and renamed the course PGA National Golf Club â leasing it from the city. Eventually, the PGA moved out, but the site hosted 18 consecutive Senior PGA Championships â as well as the original PGA Merchandise Show in 1954. Dunedin Golf Club is now widely considered one of Floridaâs top municipal courses, along with the Winter Park Golf Course in Orlando and The Park at West Palm Beach. Rates for 18 holes range from $85 to $130, depending on the season, and there are discounted green fees for local residents. Golf Inc . annually recognizes the Best New Golf Course Developments and Renovations. This yearâs winners focused on restoring original designs and making old things new again. âSometimes the theme of a particular crop of competition winners is difficult to pinpoint, but this yearâs is a no-brainer: Whatâs old is new again,â said Golf Inc . âThe common thread was the desire to go back to how things used to be. Obviously, any golf course renovation is trying to change things up, but this year, most of the winning venues also sought out the original designs of their courses and followed them as closely as possible. Sometimes the old ways really are better.â About Dunedin Golf Club Designed by world-renowned golf course architect Donald Ross, and owned by the City of Dunedin, located just north of Tampa, Florida, the Dunedin Golf Club opened on January 1, 1927. In 1939, the city of Dunedin first took ownership of the golf course. From 1945 through 1962, it was the home to the PGA of America. During that time, the club hosted 18 Senior Tour Championships, marking the beginning of the Senior PGA Tour. Back then, the PGA and PGA Tour of today were the same corporation. It was also where the PGA Merchandise Show started in 1954. Many golf legends have visited Dunedin Golf Club, including Bobby Jones, Gene Sarazan, Ben Hogan, Sam Snead, Louise Suggs, Babe Didrikson, and Byron Nelson. In 2024, the facility underwent a complete restoration by architect Kris Spence to return the course to its original Donald Ross design. It has been restored to nearly the same as when Ross first drew it up. Today, Dunedin Golf Club is one of the top clubs in the Tampa area. Media Contacts: Kevin Frisch PR Kevin Frisch (989) 614-0241 kevin@kevinfrischpr.com Carl Mickelson (512) 797-2673 carl@kevinfrischpr.com Tweet Share Pin Related Posts SRIXON CELEBRATES KEEGAN BRADLEYâS CAPTAINCY WITH SIGNATU... SUPERSTROKE RELEASES LIMITED-EDITION PAC-MAN PUTTER GRIP ... INRANGE EXPANDS INTO BENELUX Primary Sidebar Search Footer THE GOLF WIRE Facebook Instagram Twitter FAQ | Privacy Policy |   Turnstile Media Group Â© 2025, All rights reserved. Sign Up For Free Notice: JavaScript is required for this content. Join us to receive the Wire with the latest golf industry Â news, product announcements, media interactions, golf travel deals and fashion releases. ×"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2025-06-04/dunedin-golf-club-awarded-renovation-of-the-year-by-golf-inc",
      "text": "Dunedin GC: Receives Golf Inc.'s Renovation of the Year award Skip to main content News GOLF INDUSTRY TFC / PR NEWSWIRE Industry AGM Business Links Living NGCOA VORTEX RAIN CHECK CAREERS Calendar Features COLUMNS DESIGN NOTES TFC INBOX LIFESTYLE EPSON TOUR THE FRIARS GOLF CLUB POLLS Podcasts Content Clubhouse Cookie Jar Golf Driver$ Golf Innerview ModGolf Videos Content Clubhouse Coach Mo Golf Show Up River Film Co. Events Archives Show Search Search Query Submit Search Industry News Dunedin Golf Club awarded Renovation of the Year by Golf Inc. Iconic Central Florida muni design gets recognized as the top public course renovation Jun 04, 2025 LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print Dunedin, FL – Dunedin Golf Club , the historic Donald Ross-designed course owned by the City of Dunedin (just north of Tampa), has been awarded “Renovation of the Year” by Golf Inc . in the public course category. Through the guidance of golf course architect Kris Spence, a leading Donald Ross expert, and a $6 million course restoration, the course has been restored to its roots of the Golden Age of Architecture. “Being recognized by Golf Inc . as the top public golf course renovation is very exciting, especially for a municipal course,” said Blair Kline, General Manager of Golf Operations. default “This recognition is a testament to the support we have received from the City of Dunedin, which had the vision of how a restoration of this magnitude can impact the local community, along with the work that Kris Spence did in bringing back the greens and bunker complexes that Donald Ross originally intended.” Dunedin Golf Club was built in 1926 and opened for play on January 1, 1927, under the name Dunedin Isles Golf Club. At the time, Ross referred to it as “his masterpiece” and attributed it to its ideal combination of rolling hills, waterways, and other natural hazards that made it possible to achieve his idea of course perfection. In 1939, the City of Dunedin took ownership of the course, and in 2024, it took over the management operations. Over the years, several renovations took the course further away from what Ross had created. This included the green complexes shrinking 35-to-50 percent, taking away from the strategy Ross intended. In 2014, it was listed on the National Register of Historic Places. Now, thanks to this latest and meticulous restoration of the green complexes, bunkers, fairways, and tees, every golfer can experience the course as Ross intended – right down to the actual greens Ross originally created. default “At Dunedin, the most pleasant surprise was that I could see the old green extending out beneath those renovations and was able to measure them and compare them to his original plans and notes, and I quickly realized that the original greens had never been destroyed,” says Spence. “They were just buried under this material, so the opportunity to remove the material, excavate and expose the original greens, and restore them was possible.” In 1944, the PGA of America moved its headquarters to Dunedin from Chicago and renamed the course PGA National Golf Club – leasing it from the city. Eventually, the PGA moved out, but the site hosted 18 consecutive Senior PGA Championships – as well as the original PGA Merchandise Show in 1954. Dunedin Golf Club is now widely considered one of Florida’s top municipal courses, along with the Winter Park Golf Course in Orlando and The Park at West Palm Beach. Rates for 18 holes range from $85 to $130, depending on the season, and there are discounted green fees for local residents. Golf Inc . annually recognizes the Best New Golf Course Developments and Renovations. This year’s winners focused on restoring original designs and making old things new again. “Sometimes the theme of a particular crop of competition winners is difficult to pinpoint, but this year’s is a no-brainer: What’s old is new again,” said Golf Inc . “The common thread was the desire to go back to how things used to be. Obviously, any golf course renovation is trying to change things up, but this year, most of the winning venues also sought out the original designs of their courses and followed them as closely as possible. Sometimes the old ways really are better.” About Dunedin Golf Club Designed by world-renowned golf course architect Donald Ross, and owned by the City of Dunedin, located just north of Tampa, Florida, the Dunedin Golf Club opened on January 1, 1927. In 1939, the city of Dunedin first took ownership of the golf course. From 1945 through 1962, it was the home to the PGA of America. During that time, the club hosted 18 Senior Tour Championships, marking the beginning of the Senior PGA Tour. Back then, the PGA and PGA Tour of today were the same corporation. It was also where the PGA Merchandise Show started in 1954. Many golf legends have visited Dunedin Golf Club, including Bobby Jones, Gene Sarazan, Ben Hogan, Sam Snead, Louise Suggs, Babe Didrikson, and Byron Nelson. In 2024, the facility underwent a complete restoration by architect Kris Spence to return the course to its original Donald Ross design. It has been restored to nearly the same as when Ross first drew it up. Today, Dunedin Golf Club is one of the top clubs in the Tampa area. Media Contacts: Kevin Frisch PR Kevin Frisch (989) 614-0241 kevin@kevinfrischpr.com Carl Mickelson (512) 797-2673 carl@kevinfrischpr.com Industry News LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print 960 Morrison Drive, Suite 300, Charleston, South Carolina 29403 Copyright © 2025, The First Call, a division of Buffalo Groupe , LLC. All rights reserved. Who We Are About Us Media Kit Press Release Program Archives Support Subscribe Privacy Policy Terms of Use"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "text": "Contact - Osoyoos Golf Club Skip to main content Skip to footer Book A Tee Time Member Ballot Desert Gold Park Meadows Golf Rates Lessons Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Dine & Events Our Club Contact Book A Tee Time Contact Us Let’s Talk Staff directory and contact information. Contact Information Location Osoyoos Golf Club 12300 Golf Course Drive Osoyoos, British Columbia Canada V0H 1V4 Phone (250) 495-7003 1-800-481-6665 Office Hours Monday – Friday: 8 AM – 4 PM Saturday, Sunday & Stat Holidays: Closed Staff Directory General Manager Bryan Ewart, NGCOA BC Chapter President General Manager T: 250-495-7003 Ext. 213 Golf Operations Matthew Vincent, PGA of Canada Member Head Golf Professional T: 250-495-7003  Ext. 212 Administration Susan Henry Finance Manager T: 250-495-7003 Ext. 215 Emilio Martinez Membership & Office Administration Coordinator T: 250-495-7003 Ext. 214 Course Maintenance Ryan Dunkley Course Superintendent T: 250-495-2323 Food & Beverage Alana Egli Food & Beverages Manager T: 250-495-7003 Ext. 221 Herman Subaru Executive Chef T: 250-495-7003 Ext. 216 Contact Us Complete our inquiry form and we’ll be in touch. Join Our Team We’re always looking for friendly, dedicated individuals who want to be part of a welcoming environment and help create unforgettable experiences for our members and guests. Please see the current job postings below: Finance & Human Resources Manager Apply Now Perched above Lake Osoyoos and sculpted into the desert bench, Osoyoos Golf Club offers a one-of-a-kind golf experience in an unforgettable setting. Every round is a postcard in the making. Subscribe to our Newsletter © 2025 Osoyoos Golf Club. All rights reserved. Privacy Policy. Website designed by Par Six Golf Media Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Apply Now Temporary Online Booking Outage Please note that our online booking system will be unavailable from July 9 to July 11, 2025 as we transition to a new booking and point of sale system. To book/request a tee time during this period, please call the Pro Shop directly at 250-495-7003 or 1-800-481-6665 extension #1. Our team will be available daily from dawn to dusk to assist with your reservation. Thank you for your patience and understanding! Home Golf Lessons Rates Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Member Ballot Desert Gold Park Meadows Book a Tee Time"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "text": "Contact Club Caddie: Get In Touch for Support & Demos Skip to content About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT WITH US REQUEST A DEMO About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT REQUEST A DEMO contact We are available by chat, 24 hours a day, 7 days a week. Just click on the chat message icon in the lower corner of your screen or at the top of the menu and we can answer any question, get you login credentials, provide support, or even give you a full demo of our software. Full Name Email Phone Course or Organization Name Which Best Describes Your Role? -Select- Owner General Manager Director of Golf Head Golf Professional Other Golf Staff Food and Beverage Director Message SUBMIT testimonials What Our Clients Say see more testimonials Start Growing Revenue with Club Caddie Golf Course Solutions Today With tools to streamline every aspect of your golf facility’s operation and a 24/7 support team excited to help you out, improving your course, club or golf business management software has never been easier. Golf operations software is our forte. GET STARTED today Don’t have time right now? Send us a message and we’ll get back to you right away. send us a message Award Winning, All-In-One, Golf Facility Management Software. Menu About Features Contact Privacy Policy Terms & Conditions About Features Contact Privacy Policy Terms & Conditions Resources Services Mission Testimonials About Contact Services Mission Testimonials About Contact Support Knowledge Base Submit Tickets Chat With Us Club Caddie Holdings, Inc. info@clubcaddie.com 18720 Mack Ave, Suite 210, Grosse Pointe, MI 48236 Copyright © 2025 by Club Caddie Holdings, Inc, Powered by Club Caddie Privacy Policy Terms and Conditions Facebook Footer [main Template] Linkedin Scroll to Top We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. I agree"
    },
    {
      "url": "https://www.golfcoursetrades.com/dunedin-golf-club-post-hurricane-update-winterizing/",
      "text": "Dunedin GC Hurricane Update & Winterizing a PNW Golf Course Newsletter News Articles Jeff Shelley Articles Making the Rounds Linda Parker Articles Jay Flemma Articles Inventory and Used Equip Supplier Directory Accessories Carts Chemicals Equipment Garage and Maintenance Irrigation Mowers Plants Ponds Professionals Structures Learning Center Events Golf Course Trades Newsletter News Articles Jeff Shelley Articles Making the Rounds Linda Parker Articles Jay Flemma Articles Inventory and Used Equip Supplier Directory Accessories Carts Chemicals Equipment Garage and Maintenance Irrigation Mowers Plants Ponds Professionals Structures Learning Center Events Articles Dunedin GC Post-Hurricane Update & Winterizing a PNW Golf Course: Making the Rounds – Installment 34 By Jeff Shelley Posted on October 30, 2024 Share Tweet Share Share Email Comments This column features recollections of the author’s 37 years as a golf writer. These installments stem from his many travels and experiences, which led to a gradual understanding that the game has many intriguing components, especially its people. Instead of gearing up for another busy season in the Southeast, many superintendents are struggling to overcome the rampant damage wrought by two major hurricanes, Helene and Milton. These back-to-back disasters started with Category 4 Helene in late September. It walloped the region – especially inland – with over 20 inches of rain, massive flooding, and sustained winds over 140 mph. Milton’s Powerful Winds Knocked this Large Tree Down at Dunedin GC Two weeks later, Milton barreled across the Gulf of Mexico toward Florida’s west-central coast as a Category 4 storm. It brought sustained winds of 155 mph, just 1 mph below a Category 5 hurricane. But that’s splitting hairs as the National Weather Service in Tampa Bay described Milton as “a historic storm for the west coast of Florida and possibly the worst to hit the area in over a century.” Perhaps lost in these numbers is the powerfully damaging coastal storm surges wrought by both hurricanes. Helene’s surges were upwards of 10 feet, killing 12 people in the Tampa area. Before Milton reached land, a former director of FEMA noted ominously, “This isn’t water that rises slowly. This is fast-moving water with waves. It’s like a battering ram,” Craig Fugate of Florida said. “You just don’t want to be in that area. That’s how we lost a lot of lives in all those surge areas where people didn’t get out. They either drowned or were crushed by their houses collapsing on them.” The hurricanes heralded a challenging golf season for many course superintendents in this part of the U.S., not to mention threatening millions of residents. In addition, courses midway through remodeling projects now must cope with significant upheavals in their schedules. Among these is the restoration of the Donald Ross-designed Dunedin Golf Club in the Tampa area. It was covered in June 2024 in a two-part series of “Making the Rounds” columns: The Rebirth of Dunedin Golf Club (Part 1): Making the Rounds – Installment 31 and The Rebirth of Dunedin Golf Club (Part 2): Making the Rounds – Installment 32 . Originally slated for a grand opening in mid-October 2024, the dual hurricanes shoved that date tentatively to December. I followed up with my old friend, Blair Kline, General Manager of Golf Operations for the City of Dunedin, for course updates after Helene and Milton struck the area. Here are Blair’s honest – and sometimes wry – reports back to this writer in Washington State. By the looks of things, Dunedin GC’s superintendent Dennis Swander and his crew have their hands full. September 30 – after Helene landed: “Not great timing for us but at least we hadn’t just sprigged! Just across the street many homes were totaled from the storm surge. We got 80-mph gusts (lots of smaller limbs down) but only 1.75 inches of rain. “The storm surge was considerable, with damage along the coast and Barrier Islands in the Tampa area. We had water covering holes 12, 13, 14, 17 from the storm surge. Additionally, 11 and 14 greens had water on them and 15, 17 were submerged. “We immediately vented/flushed the greens and applied Verde-Cal K Plus, so hopefully we get some color and growth back. Too early to tell but might have to push our grand opening to a ribbon-cutting on November 9. We fared much better than homes in the area that were totaled. “Hope all is well in sunny Seattle!” October 1 – after a closer assessment of Helene’s toll: “The peak of the storm surge was 11 pm. (Photographer Walt Kozikowski] is about 6 feet tall and the water would have been around his neck, so no pictures – it wouldn’t have been safe to be outside. By daylight the water had gone down quite a bit. Pretty much every community along the coast from St. Petersburg to landfall up by Tallahassee was affected. “Still power outages here and the cleanup starts. Lots of Gulf-side restaurants will probably never rebuild.” October 7 – on the eve of Milton’s arrival … … and its potentially stronger punch to greater Tampa than Helene. Kline shows his trademark humor with a reference to an old comic (Milton Berle), which this fellow septuagenarian appreciates. “Uncle Miltie! Looks bad if as forecasted, might be lucky to open November 15 th . “You can freeze in Washington, but no hurricanes!” October 9 – Dire Warnings Mayor Jane Castor warned residents of Tampa (which, incredibly, had not been directly bit by a major hurricane in 103 years) about 15-feet storm surges possibly swallowing an entire house: “So if you’re in it, basically that’s the coffin that you’re in,” she said. Dunedin Suffered Significant Tree Loss & Water Damage from Hurricane Milton October 16 – Post-Milton Update Blair described the damage after the second straight severe hurricane swept across Dunedin. “These pics are after Milton,” Kline said of the accompanying photos in this story. “Milton is the one that caused us the most wind damage. “I talked with [veteran Virginia-based public relations’ rep] Dan Shepherd, and he said Mississippi was a client of his when Beau Rivage opened Fallen Oak in late August 2005. That $33 million course opened August 31 when Hurricane Katrina hit. They spent another $17 million to get it to how they wanted before reopening. We will beat this [cost] and open one month later than expected, unless we get any more severe weather. “We have had buzzard’s luck so far. Started construction in a drought when water was scarce. It felt like a desert with blowing wind and sand. But then it started raining, which slowed down construction. “So instead of opening the course at the end of October 2024, it was going to open November 1 because of Helene. Now thanks to ‘Uncle Miltie’ that date will probably be pushed to December 1. “This involves not only more money being spent, but a month of revenue not realized. Thanks, Blair.” Disaster Relief Golf operators and superintendents should be aware of the GCSAA Disaster Relief Fund to assist GCSAA members who suffer personal loss from natural disasters. It was established in 2006 in response to Katrina. The fund is a resource for members who face tragedy caused by natural disasters. Those who are affected and may be eligible for financial assistance and resources from the fund can contact 800-472-7878 or email membership.help@gcsaa.org . [Special thanks again to Walt Kozikowski for the above post-hurricane photos. To watch videos of this project’s timeline and evolution, with Blair Kline as the presenter, search “DGC Restoration” on YouTube.] Blane Hezel & the Author Meanwhile, on the Opposite Side of the Continent is the Usual Winter Prep Out in the comparatively benign Pacific Northwest, golf course superintendent Blane Hezel is prepping Useless Bay Golf & Country Club on Whidbey Island for another winter. This rite of autumn is being pursued by superintendents entering their typical off-season. The conditions here are nowhere near as wet and wild as Florida. Despite Kline’s comment, western Washington’s moderate climate doesn’t produce much snowfall and, when it does come, usually melts quickly. But with colder temperatures always a possibility, the fall months are mainly a period of prepping for possible catastrophes like freeze-caused broken irrigation and drainage lines, falling trees, turf issues, and the invasions of vermin and plant diseases. But it’s nothing compared to the wholesale damage inflicted by tropical cyclones dumping over 2 feet of rain, uncontrollable storm surges, winds exceeding 150 mph, and many deaths. Blane Digging a Mainline Break on 16th hole Approach Below is a sampling of items on Hezel’s fall 2024 punch list. This year he’ll be juggling normal crew tasks with preparations for the installation of an all-new, member-approved irrigation system in spring 2025. Repair collar dams on 17, 18, 5 Install drainage – driving range, 16, 15, 6-R, 9, RIGHT of 10 (delay because of irrigation system?) Incorporate walk-offs from the tees Increase more native areas – control weeds Repair cart paths Develop as-built program for underground infrastructure Program to spray weeds throughout the golf course Paint restrooms Flail-mow ditch lines Re-align tee complexes Paint kiosks at #1 and #10 tee complex Prep new “Green” [front] tees to be playable next year Clean/organize Maintenance Facility Tree removal right of 14 green and left of #4 rough ditches Continue to implement UBGCC Improvement Plan. Hezel will try to accomplish these – and many other tasks – with a limited crew on a rural island. Let’s hope he won’t have to face any unforeseen natural calamities, though those are always a possibility for a golf course superintendent anywhere on this planet. When Not Working at UBGCC, Blane Hezel Goes Salmon Fishing Jeff Shelley has written and published 10 books as well as numerous articles for print and online media since 1987. Among his titles are three editions of the book, “ Golf Courses of the Pacific Northwest .” The Whidbey Island resident was editorial director of Cybergolf.com from 2000-15, co-founder of the Northwest Golf Media Association and president of the nonprofit First Green ( https://www.thefirstgreen.org/ ). To contact Jeff: fairgreens@seanet.com . Post Views: 538 Related Items: Dunedin Golf Club , featured , Jeff Shelley , Useless Bay Golf & Country Club Share Tweet Share Share Email Recommended for you Road Trips: Making the Rounds – Installment 40 Dunedin Golf Club Holds Grand Opening Q&A with the Legendary Turf Professor, Tom Cook – Part 2: Making the Rounds – Installment 36 Most Popular 45.2K Equipment and Maintenance Stihl Announces Outgoing President Fred Whyte To Remain Chairman Of The Board 21.1K News Prime Sources announces registration of herbicide 10.9K Golf Course Toro Enters Long-Term Agreement with City of San Diego, Torrey Pines Golf Course 9.3K Golf Course Country Club of Bristol holds emergency meeting to discuss future 8.5K Articles A Must-Read for Golf Course Superintendents 7.5K Articles Bobby Weed Restoration has Experts Calling Culver Academies “The Finest 9 Hole Course in North America” 7.5K Articles The Art of Golf Course Tee Box Design 6.9K Articles How to Build a Principal’s Nose Bunker 6.8K Carts, Utility Vehicles and Garage First of its Kind Air Conditioner for the Yamaha Drive and Drive2 6.6K Articles The Floating Golf Green at Coeur D’Alene – Still a Wonder of the Golf World Forecast 2025: A Welcome Economic Rebound Inside the Greens: Scott Mauldin, CGCS – Leading Golf Course Operations at Bayville Golf Club Golf Course Trades is produced by Golf Trades LLC and is a golf course superintendent niche digital marketing specialist. Golf Course Trades utilizes the 30 years of b2b relationships to help companies target golf courses utilizing our website, newsletter, and online turf directory. Please contact Golf Course Trades at adrep@thetrades.com or call (931) 484-8819 to request a full media kit. Advertise with us! MEDIA KIT PDF About us Distribution Deadlines Directory Listing Email Marketing Banner Online Sponsored Content Sign up below for our eNewsletter and to receive the same great Golf Course Trades content in your email box. First Name Last Name Email (required) * City State Select list(s) to subscribe to Join Form on site Yes, I would like to receive emails from Golf Course Trades. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. By submitting this form, you are consenting to receive marketing emails from: . You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact Subscribe to Email Newsletter Magazine Archives Advertise The Team Contact Us Copyright © 2016-2022 The Golf Course Trades To Top Never Miss A Headline Get our Weekly recap with the latest news, articles, and resources. Email Subscribe"
    },
    {
      "url": "https://www.denbighgolfclub.co.uk/contactus/",
      "text": "Contact Us - Denbigh Golf Club Skip to primary navigation Skip to main content Denbigh Golf Club Home Tee Times Golf About Us Handicap Tables Scorecard Restaurant Course Photos & Video Useful Links Who’s Who History Professional Denbigh Golf Club Members Area Visitors Visitors Society Packages Open Competitions Open Competitions Results Memberships Events Contact Contact Us Contact Form Please enable JavaScript in your browser to complete this form. Subject: Name: Email: Message: Phone Submit Contact Us Please use the contact form on the right: Alternative contact information: Professional : Ben Brierley   01745 816669 (Option 1) Email: professional@denbighgolfclub.co.uk Caterer : Hannah Griffiths   01745 816669 (Option 2) Email:griffiths.hannah.louise@gmail.com Denbigh Golf Club Henllan Road, Denbigh, Denbighshire, LL16 5AA Page Footer Contact Us Address : Henllan Road, Denbigh Denbighshire LL16 5AA Email : professional@denbighgolfclub.co.uk Phone : 01745816669 Follow Us Instagram Tripadvisor Twitter Denbigh Golf Club | Henllan Road, Denbigh |  Denbighshire LL16 5AA | 01745 816669 Copyright © 2025 Denbigh Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "text": "About Us | Premier Golf Click to call 866 260 4409 Call 866 260 4409 ( Mon-Fri 8:30-5:30pm ET ) Contact us Email Search Perform Search 0 $ 0 No products in the cart. Search Perform Search Contact us Click to call 866 260 4409 866 260 4409 Mon-Fri 8:30-5:30pm ET Toggle Menu USA Column Florida Orlando Tour TPC Sawgrass Ritz-Carlton Naples PGA National Innisbrook Bay Hill Trump Doral Alabama Robert Trent Jones Trail Column California Monterey Tour Pebble Beach Torrey Pines La Quinta Silverado Resort Oregon Bandon Dunes Sunriver Resort Juniper Preserve Arizona Scottsdale Column South Carolina Charleston Tour Kiawah Island Hilton Head Island Palmetto Dunes Wild Dunes Georgia Reynolds Lake Oconee Sea Island Utah St. George Column Wisconsin Wisconsin Golf Triangle Kohler Wisconsin SentryWorld Geneva National Resort Sand Valley Michigan Boyne Golf Pennsylvania Nemacolin Column Texas Texas Hill Country Tour PGA Frisco JW Marriott San Antonio Resort Horseshoe Bay Hawaii Kapalua Wailea Mauna Kea Mauna Lani UK&I Column Scotland St Andrews Carnoustie Kingsbarns Dumbarnie Ayrshire Tour Dundonald Prestwick Royal Troon Turnberry Column Edinburgh & East Lothian Tour Muirfield North Berwick Gullane Highlands Tour Cabot Highlands Royal Dornoch Aberdeen Tour Royal Aberdeen Trump International Column Ireland Northern Ireland Tour Royal County Down Royal Portrush Portstewart Castlerock Ardglass Dublin & The East Tour Portmarnock Royal Dublin The European Club Jameson Golf Links The Island Column South West Tour Ballybunion Adare Manor Lahinch Old Head Tralee Waterville North West Tour Enniscrone Rosapenna Ballyliffin Donegal Carne Column England England’s Golf Coast Tour Royal Birkdale Royal Lytham & St Annes Royal Liverpool Hillside Formby London & South East Royal St George’s Princes Royal Cinque Ports Sunningdale Swinley Forest Walton Heath The Berkshire St Georges Hill Europe Column Portugal Lisbon Tour Terras da Comporta Oitavos Dunes Penha Longa Praia D’El Rey Royal Óbidos West Cliffs Column Algarve Tour Monte Rei Quinta do Lago Ombria Vale do Lobo Vilamoura Ultimate Portugal Tour Column Spain Sotogrande & Andalucia Tour Valderrama Finca Cortesín La Hacienda Links La Reserva Real Sotogrande San Roque Camiral Catalunya Column Greece Athens & Costa Navarino Tour Costa Navarino France France Golf & Wine Tour 2026 Italy World Column Caribbean Dominican Republic Dominican Republic Tour Casa de Campo Puntacana Resort Eden Roc St. Regis Cap Cana Barbados Barbados Golf Tour Apes Hill Sandy Lane Column Mexico Cancún Tour Fairmont Mayakoba Pueblo Bonito Los Cabos Solmar Golf Links Diamante Cabo San Lucas Column Canada Canadian Rockies Tour Banff Springs Jasper Park Kananaskis Stewart Creek Silvertip Column Australia Australia Golf Tour Royal Melbourne Victoria Kingston Heath New South Wales Cape Wickham Barnbougle New Zealand New Zealand Golf Tour Cape Kidnappers Kauri Cliffs Te Arai Paraparaumu Column South Africa South Africa Golf Safari Arabella Fancourt Leopard Creek Pearl Valley St Francis Links Tournaments Augusta The Open The Ryder Cup The Solheim Cup WM Phoenix Open Pebble Beach & Super Bowl Vacations Column Hosted tours Canadian Rockies 2026 France Golf & Wine Tour 2026 Costa Navarino Odyssey Pro-Am 2026 South Africa Golf Safari Column Golf Packages Golf Vacation Packages Stay and Play Golf Packages About Blog Insights Careers Contact Home > About Us About Us Premier Golf – Delivering custom golf vacations since 1988 Headquartered in Alpharetta, Georgia, Premier Golf provides a tailored service to golfers looking to combine their passion for the game with their love of travel. We are experienced in providing tailored international and domestic golf vacation packages to various iconic locations around the world. Our experts share the same enthusiasm for golf as you, and we are committed to providing the best itineraries to suit your needs, saving you time and hassle when it comes to choosing your next golf vacation. Meet our team > Get in touch > Trusted team of golf enthusiasts Offering international golf vacations Years of experience planning tailored trips and packages Providing specialist advice to create your dream trip Offices and representatives located around the world Working in partnership with the PGA Premier Golf has worked in partnership with the PGA for more than ten years, serving as the PGA Magazine Ambassador Program’s official travel company. This is a program that provides exposure to some of the world’s greatest golfing destinations. Upon visiting, staying and playing, they will return to their home clubs with the experience and knowledge to create a return trip with their members. As the dedicated travel provider, we have served hundreds of PGA professionals and their members over the years. “We want you to know how much we enjoyed our Ryder Cup tour. We would highly recommend you to our friends.” A.P, California “The trip was absolutely fabulous! The personal service you provided gave it a special touch. You are at the top of our list when we consider any future trips” D.V, Arizona “I just wanted to say a huge thank you for helping us have such a wonderful trip. It really went smoothly and my members were happy which is my ultimate goal. Really, I am so in awe of the great care you take of your clients.” A.J. Brewster, MA Meet our team Our team is committed to providing excellent customer service and helpful information. Our specialists are experts in global golf destinations and can help you with any queries you may have, or information you require. We are friendly yet professional, giving you confidence that you will receive the best expertise, from booking to boarding and during your trip. We have dedicated teams at various destinations to assist you upon your arrival and to ensure you have a seamless golfing experience. Ann Mabry Managing Director Managing Director of Premier Golf, with over 30 years of experience in the Golf Travel industry. Ann’s wealth of knowledge in luxury travel is incorporated into each unique Premier Golf itinerary, ensuring our clients enjoy and experience the best each destination has to offer. Born in Scotland and raised in Ireland, many people love to call us just to hear her talk. Ann lives in Suwanee, Georgia with her husband David and son Douglas. Suzie Cusentino Director of Operations After several years in accounting and finance positions, Suzie joined Premier Golf in 2010 as our Accounting Specialist and now serves as our Director of Operations. A key factor in the seamless operations of Premier Golf, Suzie also oversees our accounting, sales reporting, technology and golf reservations system. Suzie lives in Atlanta, Georgia. Bill Hogan Business Development Manager Bill Hogan is based in Austin, TX and has over 30 years of experience in the luxury golf travel industry. He has played golf in 57 different countries to date, is a long-time panelist for GOLF Magazine World & USA Top 100 courses, and on the ranking panel for Platinum Clubs of the World. Tim Stolz Sales Manager Having worked in the golf industry and management for over 20 years, Tim joined Premier Golf in May 2023 to provide leadership and experience to the sales team. Living in Marietta, GA with his wife Sasha and 3 dogs, Tim is the father of two daughters who have adopted his passion for sports and travel. An avid golfer with a 4 handicap, he cites his round at the Old Course as the greatest golf experience of his life. A native of Ohio, Tim is a passionate fan of the Buckeyes, Reds and Bengals. Mike Eaton Marketing Director Having worked in agency-side marketing for over a decade, Mike joined Premier Golf in 2022 as Marketing Manager. With a passion for sports and travel and a background in premium branding and marketing, Mike is combining his expertize and experience across the marketing spectrum and passions, to develop Premier Golf’s marketing activity moving forward. Originally from the UK, Mike is now based in Michigan and is regularly at HQ in Alpharetta. Kara Guthrie Senior Golf Travel Specialist Kara joined Premier Golf in 2021 as a Domestic Golf Travel Specialist, providing expertise to our clients who wish to travel across the US. Now a Senior Golf Travel Specialist, Kara provides her expert knowledge to create the ideal bespoke trips to Premier Golf clients for Ireland, Spain, and Portugal. With a passion to travel, having traveled all across Europe, and the US, Kara loves to help others create travel memories of their own and live out their dreams. Kara is also a keen golfer, having played from a young age with friends and family. Connor Vogel Golf Travel Specialist Connor has an extensive travel background including the US, Mexico & Europe, and has been fortunate enough to attended each of the 4 major championships. He brings this wealth of knowledge and expertise to his role, ensuring Premier Golf clients enjoy the best possible golf travel experience. With a background in supply chain & logistics, Connor’s thorough planning and attention to detail lends itself to creating seamless golf experiences. Having worked in the golf industry for a number of years, including as an Assistant Pro and Caddie, Connor is able to bring a deep understanding of the game to his role. In addition to Golf, Connor is a passionate fan of UGA Football and the English Premier League (Come on Arsenal!). He lives in Atlanta, GA with his wife Anna. Carlee Talty Marketing Executive Carlee is a recent graduate from the University of South Carolina, where she found her passion for working in sports. She has versatile experience in the sports world, from working for a professional sports agency all the way to being on the sideline at Carolina football games. These opportunities help Carlee support Premier Golf’s brand as a whole. In her free time, Carlee enjoys playing pickleball and has picked up golfing. Stacey Mabry Administrative Assistant With over 16 years in customer service, Stacey is a pivotal part of the Premier Golf client experience. Heavily involved in communications from booking, until they return, she ensures a seamless process for all. Based in Atlanta, Georgia, she is one of many Bulldogs fans on the Premier Golf team, she is also an avid tennis player. At home, Stacey enjoys life with her two boys, husband, dog and cat. Tim Willerton Senior Golf Travel Specialist Tim has been a golf tour operator and caddied on the PGA and LPGA Tours. A devoted and passionate golfer, he’s well traveled with special expertise on Scotland and Ireland. Topping his bucket list is playing golf in South Africa. Euan Findlay Head of DMC Operations Euan has been with Premier Golf since 1999, managing all Scotland activities. Born and raised in Glasgow, Euan studied at University in Edinburgh before continuing his studies on a golf scholarship in Kansas. A Course Rater for Golf Digest, Euan has worked in the travel industry for Sheraton in Steamboat Springs, Colorado and Seabourn Cruise Line both onboard the ships and in London. Hugely popular with our clients, Euan now lives near St Andrews with his wife Hilary and three sons, Callum, Hamish and Corey. Allan O’Connor Ireland Operations Manager Our Ireland office in Killarney is managed by Allan O’Connor, who joined the Premier Golf Team in May 2021. Allan has a background in hospitality that stretches back almost 30 years. Out of college in 1993 he became Operations Manager at Kerry Coaches, one of Ireland’s largest private motorcoach operators and pioneers of golf tourism. Prior to taking up his current position he spent 7 years as Director of Sales at The Killarney Park, one of Ireland’s top 5-star hotels, where he spent 9 – 10 weeks a year in the US selling the hotel as perfect destination for all types of guests, but especially golfers. Billy Dunham Product Manager Growing up just miles from the Augusta National Golf Club, Billy’s exposure to golf came early in life when The Masters took over the city each year, and he still carries a (barely) single-digit handicap today. Billy recently completed bucket-list golf trips to Scotland and New Zealand, with golf including The Old Course, Muirfield and Tara Iti. A former airline employee and an avid traveler, he has a passion for aviation and touring the world. His logistics background lends itself to helping plan thoughtfully-created trips. He lives in Northeast Atlanta with his wife Jena and their cats, Gabby and Hazel. Connor Dorton Golf Travel Specialist Originally from Macon, Georgia, Connor moved to the Atlanta area in 2005. A keen golfer since the age of 8, he began working in the golf industry at 16, resulting in a deep and thorough knowledge of the game. Connor has traveled throughout United States to play and caddie at courses including Valhalla and Congressional, a recent highlight was working at the LPGA Drive-On Championship at Reynolds Lake Oconee in 2020. Connor now lives in Woodstock, he regularly caddies at the prestigious Peachtree Golf Club in Atlanta, and is an Atlanta Braves Fan. Chris Gurney Senior Golf Travel Specialist Chris Gurney makes his home in Belleair Florida and has been with Premier Golf since 2009.  Chris grew the company’s PGA Professional business as Director of Business Development and now works as a Golf Travel Specialist. Another of our staff who has traveled extensively, Chris specializes in highly customized group and club travel and escorts trips for our clients on a regular basis. Chris and his wife Daneen share a passion for the opportunity the global golf community offers to meet new people and share in their experiences. Graeme Fish Golf Travel Specialist Originally from North England, Graeme is now based in the Premier Golf St Andrews office. A member of the PGA of GB&I since 1994, Graeme now carries the advanced, accredited status of PGA Fellow Professional. Playing, Teaching, Coaching, Custom Fitting and organizing Golf Holidays are just some of the areas of expertise. With over 30 years in golf, Graeme has worked and played in several countries but specializes in Scotland, Ireland. Ben Baggett Operations Administrator Ben brings vast experience in the golf industry to the Premier Golf Team. He enjoyed over 20 years as a PGA Professional at clubs including; Atlanta National Golf Club, Druid Hills Golf Club, and Houston Lake Country Club. His awards during this time include the 1999 Georgia Section Assistant Professional of the Year. Ben has an Accounting Degree from Kennesaw State University and a Marketing Degree from Georgia College. With over 10 years in accounting roles, Ben now supports Premier Golf operations administration. Father of two, Ben now lives in Acworth and is often found enjoying music, his other great passion. Lucas Worth Sales Administrator Lucas is originally from Pittsburgh, PA, and brings over 12 years of customer service experience to the team. A graduate of West Virginia University, he has called Atlanta home for the past 9 years. Lucas is dedicated to providing exceptional service and building strong, lasting relationships with clients. Outside of work, he enjoys playing golf, spending time outdoors, and relaxing with his wife. He’s also a big Buffalo Bills fan! Jeff DeAngelus Golf Travel Specialist Originally from Rome, Georgia, Jeff has been in the Atlanta area for 25 years, since graduating from Georgia Tech. He brings over 25 years of sales/customer service experience to the team. When not working (or playing golf), he enjoys traveling or camping during any free weekends.  Born and raised to support Atlanta sports! Golf Tournament Experiences > Contact Us > Inquire now Please fill out the form and we’ll be in touch to help you. \" * \" indicates required fields First Name * Last Name * Phone Number * Email * Destination * Please select one USA UK&I Europe RoW Event Location * Location * Please select one Bandon Dunes Bay Hill Boyne Golf Charleston Geneva National Resort Hawaii Hilton Head Horseshoe Bay Innisbrook Juniper Preserve JW Marriott San Antonio Resort Kapalua Kiawah Island Kohler La Quinta Mauna Kea Mauna Lani Monterey Nemacolin Orlando Omni PGA Frisco Resort Palmetto Dunes Pebble Beach PGA National Lake Oconee Ritz-Carlton Naples RTJ Trail Texas Hill Country Torrey Pines Sawgrass Resort Trump Doral Scottsdale Sea Island Resort Sand Valley SentryWorld Sunriver Resort Wailea Wild Dunes Wisconsin Location * Please select one Scotland – Ayrshire Scotland – Edinburgh & East Lothian Scotland – Highlands Scotland – Aberdeen Scotland – St Andrews Northern Ireland Ireland – South West Ireland – North & West Coast Ireland – Dublin & The East England – North West Coast England – London & South East Location * Please select one Spain – Marbella & Sotogrande Spain – Catalunya Portugal – Lisbon & Area Portugal – Algarve Greece Italy France Location * Please select one Australia New Zealand South Africa Canada Dominican Republic Mexico Package * Please select one The Open 25 The Solheim Cup The Ryder Cup The Masters WM Phoenix Open How can we help you Contact Consent * I acknowledge and give my permission to be contacted by Premier Golf with regards to my request. * Newsletter consent Sign me up to receive the newsletter and latest news. This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Agent This field is hidden when viewing the form VT Destination This field is hidden when viewing the form Created When Comments This field is for validation purposes and should be left unchanged. Submit You need to be 100% focused on your game to play a great round of golf by avoiding countless hazards on and off the course. That is why TravelSafe created a product specifically for the modern golfer – GolfSafe Travel Protection. Find out more > At Ship Sticks, we make getting your golf clubs to and from your destination easier than it’s ever been – allowing you to enjoy a hassle-free travel experience to anywhere in the world. Find out more > About Premier Golf Blog FAQ Contact Us Careers Terms & Conditions Privacy Policy Site Map International Destinations Australia Canada Caribbean England Greece France Ireland Italy Mexico Portugal Scotland South Africa Spain New Zealand USA Destinations Arizona Alabama California Florida Georgia Hawaii Michigan Oregon Pennsylvania South Carolina Texas Utah Wisconsin Tournaments The Open Augusta The Ryder Cup The Solheim Cup Stay connected with us: Go to Facebook Go to Instagram Go to Twitter Go to Youtube © 2025 Premier Golf. All rights reserved. Product Details × Loading product details..."
    },
    {
      "url": "https://www.stclairgolf.co.nz/contact-details?ComeFromCat=1688",
      "text": "Contact details - St Clair Golf Club Toggle navigation Join Now Facebook Login Home The Club The Course Members Member Login Tee Booking Event Calendar Reciprocal Clubs Course Clean Up Visitors Green Fees Membership Types Member Signup Accommodation Pro Shop Functions Functions Functions Enquiry Sponsors Contact Us Member Rewards Program Contact Details Location Address 20 Isadore Road Dunedin Mailing Address P O Box 2149 Dunedin Email Address Admin@stclairgolf.co.nz Telephone Number 03 4877076 Pro Shop Patrick Moore Phone: (+64 3) 487 9201 Fax: (+64 3) 487 7076 Email: pro@stclairgolf.co.nz St Clair Golf Club Functions & Hospitality Ruth Cross Phone: (+64 3) 487 7076 Mobile: 021 1438 636 Email: admin@ stclairgolf.co.nz Please feel free to contact the club if you have any questions or comments. Enquiry Form Name Phone Email Address Country Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua And Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia And Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Chinese Taipei Christmas Island Cocos (keeling) Islands Colombia Comoros Congo Congo, The Democratic Republic Of The Cook Islands Costa Rica Côte D'ivoire Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador England Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-bissau Guyana Haiti Heard Island And Mcdonald Islands Holy See (vatican City State) Honduras Hong Kong, China Hungary Iceland India Indonesia Iran, Islamic Republic Of Iraq Ireland Isle Of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic Of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States Of Moldova, Republic Of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea Northen Ireland Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthélemy Saint Helena Saint Kitts And Nevis Saint Lucia Saint Martin Saint Pierre And Miquelon Saint Vincent And The Grenadines Samoa San Marino Sao Tome And Principe Saudi Arabia Scotland Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia And The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard And Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Tahiti Tajikistan Tanzania, United Republic Of Thailand Timor-leste Togo Tokelau Tonga Trinidad And Tobago Tunisia Turkey Turkmenistan Turks And Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.s. Wales Wallis And Futuna Western Sahara Yemen Zambia Zimbabwe Region Select one Aorangi Auckland Australian Capital Territory Bay of Plenty Canterbury Hawkes Bay Manawatu/Wanganui Marlborough New South Wales North Harbour Northern Territory Northland Otago Queensland South Australia Southland Tairawhiti Taranaki Tasman Tasmania Victoria Waikato Wellington Western Australia Subject Message Contact ADDRESS: 20 Isadore Road, St Clair, Dunedin, New Zealand PHONE: +64 (3) 487 7076 EMAIL: manager@stclairgolf.co.nz Course Status Weather Metservice Quick Links Tee Booking Green Fees Events Login Website by DotGolf yes yes yes"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "text": "Contact Us - Headwaters Golf Club Skip to main content Skip to footer Headwaters Golf Club Park Rapids, MN Home Tee Times Tee Times Member Tee Times Rates Membership Club Info Lessons Scorecard Driving Range Pro Shop E-Club Sign Up Headwaters Code of Conduct Outdoor Patio Events Upcoming Events Mens League Women’s League Junior Golf Gallery Flyover Contact Us Apply Contact Us Headwaters Golf Club P.O. Box 9 20018 County Road 1 Park Rapids, MN 56470 Telephone: 218-732-4832 Toll free: 866-250-4224 Maintenance: 218-732-3153 Email: hcc@unitelc.com View Larger Map Contact Form Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Comment Submit Footer Copyright © 2025 Headwaters Golf Club All Rights Reserved. Powered by"
    }
  ]
}