{
  "fuentes": [
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "email": "feedbacket@wbff.org"
    },
    {
      "url": "https://dunedinfilmfestival.org/about-us",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/about-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/about-us",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://www.filmfestivals.com/events_facts/contact_details?page=67&destination=taxonomy/term/32991?page%3D23",
      "email": "bruno@filmfestivals.com"
    },
    {
      "url": "https://www.filmfestivals.com/events_facts/contact_details?page=67&destination=taxonomy/term/32991?page%3D23",
      "email": "info@filmfestivals.com"
    },
    {
      "url": "https://www.filmfestivals.com/events_facts/contact_details?page=67&destination=taxonomy/term/32991?page%3D23",
      "email": "promote@filmfestivals.com"
    },
    {
      "url": "https://www.filmfestivals.com/events_facts/contact_details?page=67&destination=taxonomy/term/32991?page%3D23",
      "email": "team@filmfestivals.com"
    },
    {
      "url": "https://www.thesiff.com/contact-us/",
      "email": "film@thesiff.com"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "feedback@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "info@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "kelly@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "marketing@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "scarlett@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "feedback@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "info@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "marketing@psfilmfest.org"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "email": "programming@psfilmfest.org"
    },
    {
      "url": "https://cm.dunedinfl.com/members/member/dunedin-international-film-festival-5132",
      "email": "info@dunedinfl.com"
    },
    {
      "url": "https://filmfestivalalliance.org/about-us/staff-board",
      "email": "info@filmfestivalalliance.org"
    },
    {
      "url": "https://filmfestivalalliance.org/about/staff-and-board",
      "email": "info@filmfestivalalliance.org"
    },
    {
      "url": "https://dunedinfilmfestival.org/award-winners",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/award-winners",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/award-winners",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "antonio@vaughanfilmfest.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "antonio@vaughanfilmfestival.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "filmmaker@vaughanfilmfest.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "filmmaker@vaughanfilmfestival.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "info@vaughanfilmfest.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "info@vaughanfilmfestival.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "marketing@vaughanfilmfest.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "media@vaughanfilmfestival.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "volunteers@vaughanfilmfest.com"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "email": "volunteers@vaughanfilmfestival.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/film-schedule-2025",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/film-schedule-2025",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/film-schedule-2025",
      "email": "info@indiantypefoundry.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/tickets",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/tickets",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://dunedinfilmfestival.org/tickets",
      "email": "info@indiantypefoundry.com"
    }
  ],
  "mails": [
    "antonio@vaughanfilmfest.com",
    "antonio@vaughanfilmfestival.com",
    "bruno@filmfestivals.com",
    "dave@lab6.com",
    "feedback@psfilmfest.org",
    "feedbacket@wbff.org",
    "filler@godaddy.com",
    "film@thesiff.com",
    "filmmaker@vaughanfilmfest.com",
    "filmmaker@vaughanfilmfestival.com",
    "info@dunedinfl.com",
    "info@filmfestivalalliance.org",
    "info@filmfestivals.com",
    "info@indiantypefoundry.com",
    "info@psfilmfest.org",
    "info@vaughanfilmfest.com",
    "info@vaughanfilmfestival.com",
    "kelly@psfilmfest.org",
    "marketing@psfilmfest.org",
    "marketing@vaughanfilmfest.com",
    "media@vaughanfilmfestival.com",
    "programming@psfilmfest.org",
    "promote@filmfestivals.com",
    "scarlett@psfilmfest.org",
    "team@filmfestivals.com",
    "volunteers@vaughanfilmfest.com",
    "volunteers@vaughanfilmfestival.com"
  ],
  "nombre_sitio": "dunedinfilmfestival.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.brooklynfilmfestival.org/contact-us",
      "text": "Contact Us @ Brooklyn Film Festival Brooklyn Film Festival Films Winners Press Sponsors Shop Search Contact Socials Staff About CONTACT THE FESTIVAL GENERAL QUESTIONS If you have any other questions about the current edition of the festival, you can get in touch with us by email at festival AT wbff.org or info AT wbff.org. By phone you can reach us at + 1 (718) 388 4306 FILM SUBMISSION INQUIRIES If you have a question that is not answered in our FILM SUBMISSION FREQUENTLY ASKED QUESTIONS Send an email to submit AT wbff.org or call us at + 1 (718) 388 4306 OFFICE & SHIPPING ADDRESS Brooklyn Film Festival 180 South 4th Street, Suite 2 S, Brooklyn, NY 11211, United States GOOGLE MAP & DIRECTIONS (note: Building entrance on South 5 Place) Phone: +1 (718) 388 4306 PRESS INQUIRIES & REGISTRATION Media representatives can register for the upcoming edition using the PRESS REGISTRATION FORM To contact the Press Office call +1 (718) 388 4306 or send an email to pr AT wbff.org SPONSORSHIP OPPORTUNITIES To learn how to join our family of sponsors, check out our current SPONSORSHIP OPPORTUNITIES or send an email to sponsor AT wbff.org VOLUNTEERING If you are interested in learning how to put a festival together while working in a creative and stimulating atmosphere, part time and full time volunteering positions are currently available. Send your resume to volunteer AT wbff.org OPEN VOLUNTEER POSITIONS FESTIVAL DIRECTORS Looking to contact one of the festival’s directors? CONTACT FESTIVAL DIRECTORS Submit a Film faq latest news press press releases coverage winners 2025 film lineup design awards & prizes festival sponsors photos about BFF 2025 staff film society film festival judges exchange archive festival themes film library films by year films by premiere films by edition films by category films by country films a to z donate contact follow BFF ABOUT CONTACT FOLLOW US NEWS sending... I agree 2025 Brooklyn Film Festival is a 501(c)(3) non-profit organization"
    },
    {
      "url": "https://dunedinfilmfestival.org/about-us",
      "text": "Dunedin Film Festival Inc. 8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026 Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School More Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Account My Account Sign out Sign In My Account Founded in 2018, the Dunedin International Film Festival (DIFF) is dedicated to celebrating the art of filmmaking and fostering a vibrant cultural exchange in the heart of Dunedin, Florida. Bringing together filmmakers, artists, and film enthusiasts from across the globe, DIFF showcases diverse, thought-provoking films that inspire conversation, creativity, and community connection. Our festival is a platform for independent filmmakers to share their unique voices, while also creating opportunities for local talent to shine. The festival is fueled by a passionate team of industry professionals, including production experts, directors, and artists, who are committed to growing the film industry in Dunedin and the surrounding areas. From the support of community-driven volunteers to the leadership of seasoned filmmakers and creative directors, DIFF is a hub for innovation, collaboration, and artistic expression. Whether you're a filmmaker, an enthusiast, or simply a lover of great stories, the Dunedin International Film Festival invites you to experience the magic of cinema in a welcoming and inspiring environment. Board of Directors Monique McLaughlin Monique McLaughlin Monique McLaughlin Monique McLaughlin , a seasoned makeup and hair veteran, brings a wealth of experience to the Dunedin Film Festival board. Her impressive portfolio spans print, television, commercial, and film, showcasing her talent across diverse platforms. Known for her versatility and ability to work with all skin tones and hair textures, Monique excels on set, often completing and transitioning looks with remarkable speed. Her expertise and creativity make her a valuable asset to the festival and the film community. Stef Simach Monique McLaughlin Monique McLaughlin Stef Simach is the host of the Dunedin Film Festival Podcast and a board member of the Dunedin Film Festival. With over 10 years of experience in business strategy and culture coaching, Stef helps organizations align people and profits through purposeful, transformative change. Stef developed the concept of “Change Experience,” a method focused on growth through self-discovery and evolution. By fostering inclusive, resilient cultures, Stef empowers individuals and teams to break through limitations and make lasting, impactful change. Vicky Van Winkle Monique McLaughlin Vicky Van Winkle Vicky Van Winkle is a versatile artist and live model, contributing to the fine arts community through her work and offering her form as inspiration for other artists. Her passion for creative expression extends into cinema, where she is both an avid film lover and a knowledgeable critic. As a board member of the Dunedin International Film Festival, Vicky plays an active role in supporting international cinema and bringing unique film experiences to her local community. Her involvement with the festival highlights her commitment to the arts and her dedication to fostering a love for independent and foreign films. David Brownlow Avi Feddergreen Vicky Van Winkle David Brownlow is an Amerian sound engineer. He has experience in all forms of production sound recording for film and television having worked for major studios, cable networks, TV news, independent production companies, and on commercials. At the 47th Primetime Emmy Awards in 1995 Brownlow was awarded with the Emmy for Outstanding Sound Mixing for a Drama Miniseries or a Special for their work on \"Buffalo Girls\". He has worked on such films as Hoosiers (1986), What's Eating Gilbert Grape (1993), and In the Valley of Elah (2007). Brownlow and his fellow sound engineers Andy Koyama and Beau Borders are nominated for an Academy Award for Best Sound for the 2013 film Lone Survivor . Jaime Witt Avi Feddergreen Avi Feddergreen Jaime Witt, Treasurer of the Dunedin International Film Festival, brings more than 20 years of expertise in Accounting and Business, with the last decade dedicated to running her own firm specializing in tax, nonprofit, and small business accounting. She earned her bachelor’s degree in Accounting and Business Administration from the University of South Florida and holds a PHR certification in Human Resources, blending financial insight with organizational leadership. Alongside her professional accomplishments, Jaime has a deep appreciation for filmmaking and the power of storytelling. She is inspired by the way ideas evolve into unique works of art and is committed to helping DIFF grow its local and international presence while highlighting the creativity of new and emerging filmmakers. Avi Feddergreen Avi Feddergreen Avi Feddergreen Avi Federgreen has over thirty years of experience in the Canadian film industry, producing more than seventy films, including Home Free , One Week , and Clapboard Jungle . He created the Indiecan10K & Indiecan20K First Feature Initiatives, helping produce eight first features in Canada. Federgreen has also directed a short film, Red Balloon , two MOWs, and two network TV episodes, with his feature Home Free now submitted to festivals. In 2011, Federgreen founded Indiecan Entertainment and later launched Red Water Entertainment in 2022, focusing on genre films. In 2024, he introduced Pride Pictures, dedicated to LGBTQ2S+ films. With over 200 films released in Canada and 100 in the U.S., his companies continue to thrive, and Indiecan Entertainment International now handles international sales. Julie Chalhoub Janette Donoghue Janette Donoghue Julie Chalhoub is an accomplished broadcast television editor and award-winning documentary editor. She has worked across various genres, known for her ability to craft compelling, emotionally resonant stories. Julie is also a board member for the Sunscreen Film Festival and the Dunedin International Film Festival, supporting independent filmmakers and promoting the arts. Passionate about animals, especially dogs, Julie actively supports local rescue organizations through donations and advocacy. Her dedication to both her career and community reflects her commitment to making a positive impact. Janette Donoghue Janette Donoghue Janette Donoghue Janette Donoghue is a dedicated philanthropist and community member actively involved with the Dunedin Film Festival and the Dunedin Chamber of Commerce. As an events coordinator, she focuses on initiatives that promote arts and culture, enriching the local community. Her passion for non-profit organizations drives her commitment to fostering creative projects that benefit Dunedin. Janette's efforts not only support the festival but also strengthen the cultural fabric of the community she loves. Angela Kennedy Janette Donoghue Angela Kennedy Angela Kennedy is a board member of the Dunedin Film Festival, bringing a diverse background in human resources to her role. She currently serves as an HR Consultant at MammothHR and HRAnswerLink, and has experience as an HR Generalist at Kass Shuler Law Firm and as a Recruiting Specialist at HSN. Angela holds a B.A. in English Literature and Criminology from the University of South Florida, where she graduated in 2004. Originally from Tampa, Florida, she is passionate about supporting the arts and community through her involvement in the festival. Board of Directors Cameron Ilan Jesika Freeman Jesika Freeman Cameron Ilan is the President & Director of Programming for the Dunedin Film Festival. Cameron’s passion for filmmaking began at a young age, growing up on film sets in Orlando, Florida, during the 1980s and 1990s. With a rich foundation in the world of cinema, she went on to serve on the board of directors for the Downtown Los Angeles Film Festival while also working in luxury brand advertising in Hollywood, CA. Today, Cameron is the President and Director of Programming for the Dunedin Film Festival, where she continues to share her extensive expertise and love for film with audiences and filmmakers alike. Jesika Freeman Jesika Freeman Jesika Freeman Jesika Freeman is the Chair of the Board for the Dunedin Film Festival. She is a proud resident of Dunedin for over a decade, Jesika Freeman brings her deep passion for community service to the Dunedin Film Festival as the Chair of the Board. With a warm and welcoming presence, she plays a key role at the Box Office, where she greets filmmakers, visitors, and locals alike, creating an inviting atmosphere for all who experience the festival. Beyond her work with the film festival, Jesika serves on the Auxiliary Board of VFW Post 2550, where she actively supports veterans and their families, further demonstrating her dedication to service and her beloved community of Dunedin. Paul Cook Jesika Freeman Katie Ducharme Processi Paul Cook , also known as DJ BackBone, is a prominent figure in Pinellas County's music scene, hosting specialty music nights and running MultiPlayer Agency, where he specializes in creating Instant Parties and enhancing private and corporate events. In addition to his event work, Paul teaches music theory to aspiring DJs at local schools. He also serves as the Treasurer of the Dunedin Film Festival, where he brings his expertise in organization and passion for the arts to the table. Katie Ducharme Processi Katie Ducharme Processi Katie Ducharme Processi Katie Ducharme Processi has been performing professionally since the age of six, with a career spanning both singing and acting. In addition to her work as an actor, she is a licensed realtor. Katie is also an active member of the Architectural Review Committee for the City of Dunedin and has proudly served as the official National Anthem singer for the Toronto Blue Jays Spring Training since 2014, where she performs both the Canadian and American Anthems. Dina Smeltz Katie Ducharme Processi Blair Barnette Dina Smeltz serves as the Secretary of the Dunedin Film Festival. A public opinion polling expert, she is the Vice President of Public Opinion and Foreign Policy at the Chicago Council on Global Affairs. A proud Dunedin resident, Dina studied Russian and East European politics and history at the University of Michigan, where she developed a deep appreciation for the power of impactful films. Blair Barnette Katie Ducharme Processi Blair Barnette London-based Production Designer Blair Barnette has designed and art directed major film and television productions across the UK, USA, and Europe. Currently, she serves as the Chair of the British Film Designers Guild, a committee member of Artscenico, and is also a member of Women in Film and TV, contributing her expertise and passion to the industry on an international scale. Yhali Ilan Justin Catacchio Seth Walker Yhali Ilan is the creative art director of the Dunedin Film Festival and is widely recognized for his caricature and mural work in Downtown Dunedin, Florida. As the founder of the Dunedin Art Cave, Yhali is a leading figure in the city’s art scene, driving creative projects and art initiatives throughout Dunedin. His vibrant murals can be seen at locations such as Blur Nightclub, the Pinellas Art Cave, and Bon Appétit, contributing to the city's dynamic artistic landscape. Seth Walker Justin Catacchio Seth Walker Seth Walker is a content creator for Dunedin and Dunedin TV, and a lifelong resident dedicated to supporting the growing film industry in his hometown. Seth produces, writes, and directs Florida local films, bringing his passion for storytelling and his commitment to the local film community to every project he undertakes. Justin Catacchio Justin Catacchio Justin Catacchio Justin Catacchio is a television, stage, and motion picture production professional based in Dunedin, Florida. He hosted and produced Good Morning Dunedin for DunedinTV and has nurtured a lifelong love for cinema, which has fueled his enthusiasm for the Dunedin International Film Festival since its inception. Kim Kenda Austen Van Der Bleek Justin Catacchio Kim Kenda brings a strong background in multimedia communications, making her an invaluable asset to the Dunedin International Film Festival. Her passion for cinema drives her dedication to showcasing diverse films, and she believes in the power of film to foster community connections and inspire meaningful dialogue. Austen Van Der Bleek Austen Van Der Bleek Austen Van Der Bleek Austen van der Bleek is the Creative Director of Open House Conspiracy, with a deep dedication to his craft that earned him the title of 'Best Club DJ' in the 2019 Best of the Bay awards. Austen has performed at renowned events such as SXSW, Detroit’s Movement Electronic Music Festival, Hulaween, and Okeechobee Music & Arts Festival, establishing himself as a prominent figure in the electronic music scene. Iris Reyes Austen Van Der Bleek Austen Van Der Bleek Iris Reyes is a filmmaker based in Pinellas County and a member of WIFT-Tampa Bay. With career experience as a director, 1st AD, and script supervisor, Iris brings a wealth of knowledge to the film industry. Passionate about strengthening the film community in Florida, she volunteers her time to support local projects. Her expertise lies in production coordination, production management, and locations. Iris is also the president of the Tampa Bay Latin International Film Festival, where she leads efforts to highlight diverse voices in cinema. Brought to you by Dunedin Film Festival Dunedin, Florida - Home of the Toronto Blue Jays Spring Training Copyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.filmfestivals.com/events_facts/contact_details?page=67&destination=taxonomy/term/32991?page%3D23",
      "text": "Contact Details | Filmfestivals.com The Film Festivals portal Pro Tools > Create account •Register a festival or a film • Submit film to festivals Promote for free or with Promo Packages FILMFESTIVALS | 24/7 world wide coverage Welcome ! Enjoy the best of both worlds: Film & Festival News, exploring the best of the film festivals community. Launched in 1995, relentlessly connecting films to festivals, documenting and promoting festivals worldwide. Working on an upgrade soon. For collaboration, editorial contributions, or publicity, please send us an email here . User login Username: * Password: * Create new account Request new password |FRENCH VERSION| RSS Feeds Martin Scorsese Masterclass in Cannes Active Members Mostra Inter SanSebastian Lalit Rao Alice Kanter Editor Palm Springs Vanessa McMa Newsletter Pierre Yves MarlaLewinGF The Robin Me Locarno Dail American Fil Sunscreen Fi Siraj Syed indieenterta More blogs > Your site > Search 4,000 festival directory Forums Members directory New films directory Pix Galleries Videos Awards Festivals Ambiance Fest. circuit Red carpet Travel & acc. Call for entry Film Animation Documentary Hollywood Independent Promo showcase Shorts Student Videos People Fest directors Honors Interviews Pros D cinema Markets News Home >> Contact Details Contact Details Alma Director : José Javier Pérez. Login or register to post comments Ketch Producciones's videoblog 5413 reads 2012 Boomtown Film and Music Festival - Call for Entries Last year, our festival screened scores of films from all over the world and BoomFest is now accepting entries to play in the 2012 lineup and be judged in competition. Head over to our film submission page if you have a movie you'd like to enter in any category: Narrative feature, short, documentary, experimental or music video. Student films are welcome and one will even be selected to receive a special award. The Boomtown Film & Music Festival is proud to once again charge no entry fe... 03.10.2011  | Boomfest's blog The Deep End Director : Tom Gargonne. Login or register to post comments Tom Gargonne's videoblog 2485 reads Something For Everyone At NY Film Festival The 49th edition of the New York Film Festival, a sure sign of the Fall season, is underway, and in its substantially expanded format, there is literally something for everyone at this year’s event. The Festival, which has prided itself on being a boutique as opposed to the bazaar offered at such events in Toronto, Cannes and Berlin (and at New York’s own Tribeca Film Festival) still offers the cream of the crop from those other festival celebrations, with a sprinkling of highbrow c... 03.10.2011  | FilmNewYork's blog Northern Wave Film Festival 2012 The Northern Wave International Film Festival will be celebrated from the 2th to the 4th of March 2012 in Grundarfjörður, Iceland. The philosophy of the festival, upon which \r\nits name is based, is Nouvelle Vague, or New Wave. Like Nouvelle Vague, \r\nNorthern Wave attempts to revive the recognition of film making as an \r\nart form and the director as artist/author. An important goal of the \r\nfestival is to develop relationships between experienced filmmakers and \r\nemerging filmmakers in Iceland and other countries. We are a  visionary \r\nfestival that celebrates artistic and ground braking films by filmmakers\r\nwho dare to take risks. northernwave's videoblog 5349 reads Countdown to VFF11: T-Minus 40 Days...Short Films From A to Z The short films we'll be showing at the VFF in November:\r\n\r\n\r\n http://valleyfilmfest.blogspot.com/2011/10/countdown-to-vff11-t-minus-40-daysshort.html\r\n\r\n... 03.10.2011  | ValleyFilmFest's blog Marc Dorcel unveils glassfree 3D \"adult\" content at MIPCOM MARC DORCEL had already created the buzz when the company had unveiled the first 3D full HD videos at MIPTV 2010: a world premiere. The European leader in adult entertainment keeps innovating and invites MIPCOM delegates to discover glasses free 3D, also called auto stereoscopy, on itsbooth 15.18 from October 3 to 5.. \r\n\r\nBy offering MIPCOM delegates the opportunity to taste auto stereoscopic 3D and its impressive effects of depth and of images literally coming out of the screen to float in the ... 03.10.2011  | Editor's blog ÉCU poster in Tbilisi! With ÉCU in Georgia now just days away, the final touches are being made in Tbilisi. Check out this big poster in the town centre of Tbilisi! (For full details of ÉCU in Georgia, go to http://www.ecufilmfestival.com/en/ecu-in-georgia/)\r\n\r\n\r\n \r\n\r\n\r\nÉCU en Géorgie commencera en seulement quelques jours, donc on fait les derniers préparatifs en ce moment. Regardez la grande affiche au centre ville de Tbiliss 03.10.2011  | ÉCU-The European Independent Film Festival's blog |  4569 reads Film Africa Heralds a New Dawn for the Best of African Cinema http://www.filmafrica.org.uk/\r\n\r\n\r\n\r\n\r\n\r\nShowcasing more than 50 of Africa's best films and 15 UK premieres, Film Africa 2011 presents an exciting programme of screenings, Q&As, panel discussions and live performances from the 3rd - 13th November 2011.\r\n\r\n\r\n \r\n\r\n\r\nFilm Africa will open with the multi-award winning film Microphone, featuring a special presentation by the Egyptian actor, director and human rights activist Khaled Abol Naga and a live performance by Dele Sosimi and D... 03.10.2011  | Editor's blog Paul Hertzberg, President and CEO, CineTel Films, Inc., has been elected Chairman IFTA IFTA Also Announces Election Results For New Executive Committee and Board of Directors\r\n\r\n\r\n \r\n\r\n\r\nIndependent Film & Television Alliance (IFTA), the trade association representing independent producers and distributors worldwide, today announced election results for its Executive Committee, as well as 10 members and two alternates for its Board of Directors. The elections were held as part of IFTA's Annual Members Meeting at the Beverly Hills Hotel in Los Angeles and conc... 03.10.2011  | Editor's blog Award Honorees for LA Femme Film Fest LA Femme Film Festival’s Founder Leslie LaPage announced today the Award Honorees for the 7th Annual LA Femme International Film Festival 2011, October 13-16, 2011. “Each year we have an amazing celebration of female Entertainment leaders and this year is especially close to my heart.” said Leslie LaPage Founder/Director of the premiere Festival which empowers women Producers, Writers, Directors and Actors in the entertainment industry. “We have finally broken through the glass ceiling i... 03.10.2011  | Editor's blog Zurich Film Festival Awards were revealed Competition winners at the 7th The Zurich Film Festival were revealed tonight at a packed awards ceremony held at Zurich's famed Opera House.\r\n\r\n \r\n\r\n\r\nCompetition winners were announced by their respective\r\njuries. ZFF 2011 winners are:\r\n\r\n\r\n \r\n\r\n\r\nGerman\r\nLanguage Feature Film                                 \r\n\r\n\r\n\"Atmen\" (Director: Karl Markovics / Austria)\r\n\r\n\r\n  \r\n\r\n\r\nInternational\r\nFeature Film\r\n\r\n\r\n\"Take Shelter\" (Director: J... 02.10.2011  | L Editeur's blog \"A.L.I.C.E.\" an Award Nominee in Armenia! \"A.L.I.C.E.\" has been selected to compete and is nominated for an \r\naward in the KIN International Film Festival in Yerevan, Armenia from \r\nDec. 1-5, 2011. \r\n\r\n\r\n\"We are pleased to inform you that your film \r\n'A.L.I.C.E.' was recognized among the best ones within the framework of \r\nCompetition Program,\" wrote Varduhi Hayrapetyan of the film festival \r\nstaff to director/producer Dawn Westlake. \r\n\r\n\r\nThis is the 28th festival acceptance for \"A.L.I.C.E.\". \r\n\r\n\r\nFor ... 01.10.2011  | Dawn Westlake's blog Madeira Film Festival, Reid's Palace, Funchal, Madeira, Portugal. Accommodation provided for exhibiting filmmakers during the festival on the magical island of Madeira, Portugal. http://www.madeirafilmfestival.com\r\n... 01.10.2011  | Madeira Film Festival's blog Call For Entries Accommodation provided for exhibiting filmmakers during the festival on the magical island of Madeira, Portugal. http://www.madeirafilmfestival.com\r\n... 01.10.2011  | Madeira Film Festival's blog LA Irish Film Festival 2011 LOS ANGELES IRISH FILM FESTIVAL 2011  PROGRAM AND TRIBUTE TO FIONNULA FLANAGAN \r\n\r\n\r\nTHE STEVE BRENNAN TRIBUTE AWARD TO FIONNULA FLANAGAN \r\n\r\n\r\nLos Angeles Irish Film Festival 2011 Program \r\n\r\n\r\nOPENING NIGHT \r\nThursday, September 29, 2011 at 7pm\r\nTRIBUTE TO FIONNULA FLANAGAN\r\nPERFORMANCE BY JUDITH MOK \r\n\r\n\r\nSPECIAL SCREENING OF \"THE GUARD\"\r\nDirector: John Michael McDonagh\r\nProducers: Chris Clark, Flora Fernandez Marengo, Ed Guiney, Andrew Lowe\r\nWriter: John Michael McDonagh\r\nCast... 01.10.2011  | Ron Gilbert's blog The Mill and the Cross\" an extraordinary artistic achievement By Ron Gilbert\r\n\r\n\r\n \r\n\r\n\r\nDirector, Lech Majewski does a brilliant orchestration in this film which is like watching an artist visually show how his painting is created and all of his inspirations.\r\n\r\n\r\nOpening this complex painting via a combination of actors and horses with blue screen effects and 2D backdrops with historical, religious, contemporary and symbolic figures, with biblical travails depicted alongside sufferings of Flemish citizens persecuted by representati... 01.10.2011  | Ron Gilbert's blog WSFF in its Fourth Year Winter Shorts Film Festival is now in its fourth year. Photo of past festivals can be found on the Festival's Facebook page at https://www.facebook.com/pages/Winter-Shorts-Film-Festival/233437633360055?sk=wall \"Like\" this page to receive regular updates. We are looking fro submissions from a variety of Independent filmmakers as well as Teen filmmakers. \r\n... 30.09.2011  | Autumn Shorts Film Festival's blog Oregon Independent FIlm Festival Oregon Independent Film Festival's videoblog 2150 reads SHORT FILM SUBMISSION DEADLINE SEPT 30 for Love Your Shorts Film Festival REGULAR SUBMISSION DEADLINE SEPTEMBER 30! \r\n\r\n\r\nThe Love Your Shorts Film Festival announces its call for short film entries with a \"Florida Flavor\" category specifically for Florida filmmakers and films made in the state.  Submission details and entry form are available at www.LoveYourShorts.com.\r\n\r\n\r\nThe 2012 Love Your Shorts Film Festival (LYSFF) will be held February 10-12 at the Wayne Densch Performing Arts Center in downtown Sanford, Florida.\r\n\r\n\r\nThe LYSFF screens only short ... 29.09.2011  | LoveYourShorts's blog Watch 50/50 Online Free This movie is distributed by Summit Entertainment, and we have got the exclusive rights to allow you to watch 50/50 online free.\n\n\nhttp://movie-quake.com/watch-5050-online-free 29.09.2011  | markthode's blog |  18040 reads Line up of Picasso Jaipur Animation Festival completed In the first edition, JIAFF received 229 films from 21 countries 58 films nominated for screening\r\n\r\n\r\n \r\n\r\n\r\nThe first \"PICASSO JAIPUR INTERNATIONAL ANIMATION FILM FESTIVA-JIAFF-2011\" presented by PICASSO ANIMATION COLLEGE, Jaipur. In its opening year, JIAFF received an overwhelming response till last date with over 229 animation films from 21 countries (including India, Russia, Canada, U.K., Australia, Portugal, Spain, Switzerland etc.) across the globe. Out of the films ... 29.09.2011  | Editor's blog Denver Underground Film Festival A yearly showcase of independent filmmakers from Colroado and beyond since 1997. Denver Underground Film Festival DUFF's videoblog 4568 reads Submit to SCC's Winter Shorts Winter Shorts Film Festival complete information and registration forms on our web site at http://www.somerset.kctcs.edu/Student_Life/SCC_Theatre/Digital_Video_Productions\r\n\r\n\r\n \r\n\r\n\r\n \r\n\r\n... 29.09.2011  | Autumn Shorts Film Festival's blog The world's largest online short film competition is now open for submission! The Göteborg International Film Festival's short film competition Dragon Award New Talent is now open for submission. For the winner of last year's Dragon Award New Talent, the Spanish film Los Gritones, the competition opened the door to the world's festivals, the film has been awarded in no less than 19 festivals around the world. Here's what the producer to Los Gritones, last years winner, Eduardo Moi Es Escribano Solera, says about The Dragon Award New Talent:\"Being part of the Dragon Award... 29.09.2011  | Editor's blog « first ‹ previous … 64 65 66 67 68 69 70 71 72 … next › last » Links The Bulletin Board > The Bulletin Board Blog > Partner festivals calling now > Call for Entry Channel > Film Showcase > The Best for Fests > Meet our Fest Partners Following News Interview with IFTA Chairman (AFM) Interview with Cannes Marche du Film Director Filmfestivals.com dailies live coverage from > Live from India > Live from LA > Beyond Borders > Locarno > Toronto > Venice > San Sebastian > AFM > Tallinn Black Nights > Red Sea International Film Festival > Palm Springs Film Festival > Kustendorf > Rotterdam > Sundance > Santa Barbara Film Festival SBIFF > Berlin / EFM > Fantasporto > Amdocs > Houston WorldFest > Julien Dubuque International Film Festival > Cannes / Marche du Film Useful links for the indies: > Big files transfer > Celebrities / Headlines / News / Gossip > Clients References > Crowd Funding > Deals > Festivals Trailers Park > Film Commissions > Film Schools > Financing > Independent Filmmaking > Motion Picture Companies and Studios > Movie Sites > Movie Theatre Programs > Music/Soundtracks > Posters and Collectibles > Professional Resources > Screenwriting > Search Engines > Self Distribution > Search sites – Entertainment > Short film > Streaming Solutions > Submit to festivals > Videos, DVDs > Web Magazines and TV > Other resources + SUBSCRIBE to the weekly Newsletter + Connecting film to fest: Marketing & Promotion + Special offers and discounts + Festival Waiver service Deals + Special offers and discounts from filmfestivals.com + Festival Waiver service + One month festival promotion + The Bulletin Board service + Become a festival partner Selected fun offers JUST FOR FUN > Bonus Casino > casasapuestasdeportivas.es > Casinoonlineespaña.es > Casinos online > Festival offers > Rahapelit The Editor + Get the Editor's picks and news + Promote your line up during AFM - Cannes - Berlin + The editorial  festivals and markets partners + Contact the Editor + The Editor's pick 'BEST FOR FESTS ' Poll Dear filmfestivals.com Visitor:  can you please tell us which is your profession? Thanks I am filmmaker 41% A festival organizer 19% A journalist 5% A film professionnal (neither filmmaker, nor festival staff or media) 7% A film student 12% Just a film fan 16% Total votes: 3979 22 comments Editor's videoblog 80248 reads Older polls Recent blog posts Promote your line up during AFM VIDEO A house of dynamite red carpet in Venice VIDEO Red carpet and photocall of the awards ceremony Biennale82 Juries at the 73rd San Sebastian Film Festival San Sebastian´s 73rd edition presentation ‘‘Sandesham’’ (1991): is a classic political satire rooted in Kerala’s middle-class life © by film critic Lalit Rao (FIPRESCI) VIDEO Interview with Jim Jarmusch for his Golden Lion for “Father Mother Sister Brother” — Venice 2025 Mostra del Cinema di Venezia 2025: Interview with xin zhi lei 辛芷蕾采访 Pure magic from 82th Mostra Internazionale d'Arte Cinematografica Venice independent collateral awards and events more About | Advertise | Contact | Add to your bookmarks | Subscribe to the weekly newsletter | Copyright (c)  contributing members - 2025 gersbach.net"
    },
    {
      "url": "https://www.thesiff.com/contact-us/",
      "text": "Contact Us | Swedish International Film Festival Home About Who we are History Testimonial Rules and Regulations FAQ Contact us Festival Festival Winners Winner 2021 Winners December – December , 2021 Winners November – November , 2021 Winners October – October , 2021 Winners September – September , 2021 Winners August – August , 2021 Winners July – July ,2021 Winners May – June, 2021 Winner 2022 DECEMBER – DECEMBER 2022 NOVEMBER – NOVEMBER 2022 OCTOBER – OCTOBER 2022 SEPTEMBER – SEPTEMBER 2022 WINNERS AUGUST – AUGUST 2022 WINNERS JULY – JULY 2022 WINNERS JUNE – JUNE 2022 WINNERS MAY – MAY 2022 WINNERS APRIL – APRIL 2022 WINNERS MARCH – MARCH 2022 Winners February – February , 2022 Winners January – January 2022 Winner 2023 December – December 2023 NOVEMBER – NOVEMBER 2023 OCTOBER – OCTOBER 2023 SEPTEMBER – SEPTEMBER 2023 August – August 2023 JULY – JULY 2023 JUNE – JUNE 2023 MAY – MAY 2023 APRIL – APRIL 2023 MARCH – MARCH 2023 FEBRUARY – FEBRUARY 2023 JANUARY – JANUARY 2023 Winner 2024 DECEMBER – DECEMBER  2024 NOVEMBER – NOVEMBER 2024 OCTOBER – OCTOBER 2024 SEPTEMBER – SEPTEMBER 2024 AUGUST – AUGUST 2024 JULY – JULY 2024 JUNE – JUNE 2024 MAY – MAY 2024 APRIL – APRIL 2024 MARCH – MARCH 2024 FEBRUARY – FEBRUARY 2024 January – January 2024 Winner 2025 JUNE – JUNE 2025 MAY – MAY 2025 APRIL – APRIL  2025 MARCH – MARCH 2025 FEBRUARY – FEBRUARY  2025 JANUARY – JANUARY  2025 Awards Venue Submit your film Screening Screening schedule Movies Playing Trophy THE SIFF Magazine OCTOBER 17 - OCTOBER 18, 2025 Enter via FilmFreeway Home About Who we are History Testimonial Rules and Regulations FAQ Contact us Festival Festival Winners Winner 2021 Winners December – December , 2021 Winners November – November , 2021 Winners October – October , 2021 Winners September – September , 2021 Winners August – August , 2021 Winners July – July ,2021 Winners May – June, 2021 Winner 2022 DECEMBER – DECEMBER 2022 NOVEMBER – NOVEMBER 2022 OCTOBER – OCTOBER 2022 SEPTEMBER – SEPTEMBER 2022 WINNERS AUGUST – AUGUST 2022 WINNERS JULY – JULY 2022 WINNERS JUNE – JUNE 2022 WINNERS MAY – MAY 2022 WINNERS APRIL – APRIL 2022 WINNERS MARCH – MARCH 2022 Winners February – February , 2022 Winners January – January 2022 Winner 2023 December – December 2023 NOVEMBER – NOVEMBER 2023 OCTOBER – OCTOBER 2023 SEPTEMBER – SEPTEMBER 2023 August – August 2023 JULY – JULY 2023 JUNE – JUNE 2023 MAY – MAY 2023 APRIL – APRIL 2023 MARCH – MARCH 2023 FEBRUARY – FEBRUARY 2023 JANUARY – JANUARY 2023 Winner 2024 DECEMBER – DECEMBER  2024 NOVEMBER – NOVEMBER 2024 OCTOBER – OCTOBER 2024 SEPTEMBER – SEPTEMBER 2024 AUGUST – AUGUST 2024 JULY – JULY 2024 JUNE – JUNE 2024 MAY – MAY 2024 APRIL – APRIL 2024 MARCH – MARCH 2024 FEBRUARY – FEBRUARY 2024 January – January 2024 Winner 2025 JUNE – JUNE 2025 MAY – MAY 2025 APRIL – APRIL  2025 MARCH – MARCH 2025 FEBRUARY – FEBRUARY  2025 JANUARY – JANUARY  2025 Awards Venue Submit your film Screening Screening schedule Movies Playing Trophy THE SIFF Magazine CONTACT AND LOCATION Want to show your film to a bunch of enthusiastic cinephiles? You’re at the right place. Still have some questions? Get in touch. We will help you. Mail: film@thesiff.com We are here to answer any questions you may have! Please contact us by filling the form bellow. Name Email Phone Number Add a message Δ Quick Link Home Screening schedule Awards Venue Blog Contact us About Who we are History Testimonial Rules and Regulations FAQ Festival Winners Winners December – December , 2021 Winners January – January 2022 Winners February – February , 2022 ©2025 by Swedish International Film Festival"
    },
    {
      "url": "https://www.psfilmfest.org/about/contact-us",
      "text": "Contact Us | Palm Springs International Film Festival Become a member today! Click here for more information Palm Springs International Film Society Festivals Ps Intl Film Festival About Passes Tickets Film Awards Family Day Where To... Advertisement Opportunities Submissions ShortFest Browse Films Programs by Day Explore Schedule How to Attend Passes & Tickets Forum About Fest Merch Membership Levels & Benefits Member Screenings Member Resources Member Recognition Education Filmmaker in the Classroom Internships Youth Juries Student Screening Day Programs Film Awards Community Events Local Juries Member Screenings Film Awards Film Awards Seats & Tables Event Details Parking & Arrivals Security & Vehicle Credentials Honorees 2025 Highlights About Mission/Vision History Board of Directors Staff Work With Us News The Venues Terms and Conditions Contact Us Frequently Asked Questions Support Us Sponsorship Donate Volunteer Cart Sign In Account Cart Sign Out Home › About › Contact Us About Us Contact Us 303 N Indian Canyon Way, 3rd Floor | Palm Springs, CA 92262 | USA Telephone: 760-322-2930 | Toll Free (USA): 800-898-7256 | Fax: 760-322-4087 Box Office, Tickets & Passes: 760-778-8979 Email Us: info@psfilmfest.org GENERAL INQUIRIES Info@psfilmfest.org Festival Feedback Feedback@psfilmfest.org Film Awards Gala 760.969.7533 | email Marketing & Media Requests Marketing Team | Marketing@psfilmfest.org SPONSORS & DONATIONS Kelly Rogers Ph.D. | Development & Corporate Sponsorship Manager | email MEMBERSHIP Info@psfilmfest.org PROGRAMMING | SUBMISSIONS Jennifer Van Camp | Programming & Education Manager | email Privacy Policy - No mobile information will be shared with third parties/affiliates for marketing/promotional purposes. All the above categories exclude text messaging originator opt-in data and consent; this information will not be shared with any third parties. Palm Springs International Film Society INTERNATIONAL FILM FESTIVAL FILM AWARDS SHORTFEST COMMUNITY EVENTS ABOUT US CONTACT WORK WITH US BOARD OF DIRECTORS EDUCATION PROGRAMS MEMBERSHIP SPONSORSHIP VOLUNTEER TERMS & CONDITIONS FESTIVAL ARCHIVES Sign Up For E-Newsletter Palm Springs International Film Society 303 North Indian Canyon Drive, 3rd Floor Palm Springs CA 92262 USA Telephone: 1.760.322.2930 Toll Free (USA): 1.800.898.7256 info@psfilmfest.org © Copyright 2025 Palm Springs International Film Society. All rights reserved. Privacy Policy Ps Intl Film Festival About Passes Tickets Film Awards Family Day Where To... Advertisement Opportunities Submissions ShortFest Browse Films Programs by Day Explore Schedule How to Attend Passes & Tickets Forum About Fest Merch Membership Levels & Benefits Member Screenings Member Resources Member Recognition Education Filmmaker in the Classroom Internships Youth Juries Student Screening Day Programs Film Awards Community Events Local Juries Member Screenings Film Awards Film Awards Seats & Tables Event Details Parking & Arrivals Security & Vehicle Credentials Honorees 2025 Highlights About Mission/Vision History Board of Directors Staff Work With Us News The Venues Terms and Conditions Contact Us Frequently Asked Questions Support Us Sponsorship Donate Volunteer Log In Cart About Us X"
    },
    {
      "url": "https://cm.dunedinfl.com/members/member/dunedin-international-film-festival-5132",
      "text": "Dunedin International Film Festival | Entertainment Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login/Sign-Up info@dunedinfl.com 301 Main Street, Dunedin, FL 34698 Facebook Ovaicon-instagram Youtube Yelp Linkedin Menu Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login / Sign-Up Dunedin International Film Festival Home Dunedin International Film Festival Categories Entertainment 373 Colonial Ct. Dunedin Florida 34698 (407) 491-7576 Visit Website Hours: Announced seasonally based on event schedule Driving Directions: Located just minutes from Downtown Dunedin. Accessible from Main St. and Keene Rd., with public parking available nearby. About Us The Dunedin International Film Festival is a platform for filmmakers to share their original content with the Florida filmmaking community. Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Email us info@dunedinfl.com Make a call (727) 733 – 3197 About The Dunedin Chamber of Commerce supports initiatives that make our community a better place to live in and do business. Become a Member Facebook-f Instagram Youtube Linkedin Explore About Us Our Team Latest News Contact Request Ribbon Cutting Request Member Spotlight Upcoming Events Video Credit: Maas Media Photo Credit: Dorky Daisy Photography Website Design/Development: Mirror Marketing © Copyright 2024 – Dunedin Chamber of Commerce"
    },
    {
      "url": "https://filmfestivalalliance.org/about-us/staff-board",
      "text": "Meet the Film Festival Alliance Staff & Board - Film Festival Alliance Skip main navigation (Press Enter). Log in Toggle navigation Log in About Us Who We Are Staff & Board Upcoming Events News & Announcements Accessibility Newsletter Sign-Up Contact Us Membership Join Now Our Members Partner Discounts Education Independent Film Exhibition Conference Film Festival Resources Virtual Workshops Advocacy Industry Surveys & Reports Accessibility Scorecard Accessibility Office Hours Film Festival Best Practices Community About Our Community Job Board Filmmakers Start Here Filmmaker Sustainability Report Film Festival Directory Meet the Film Festival Alliance Staff & Board × Film Festival Alliance Staff Barbara Twist Executive Director (She/Her) An L.A.-based filmmaker and exhibition consultant, Barbara has been involved in the independent exhibition sector for over a decade. She previously worked with Art House Convergence as Managing Director until 2017, and in recent years has consulted for organizations including Europa Cinemas, Europa International, and IndieCollect. From 2020 - 2023, Barbara helped to re-open Vidiots at the Eagle Theatre, a non-profit Los Angeles-based movie theater + video store. Barbara holds an MFA in Creative Producing from Columbia University and has produced several award-winning short films. She is a member of the Producers Guild of America. Contact Barbara here. Gray Rodriguez Director of Communications (She/HER) Gray is a film festival organizer and enthusiast with an affinity for operations and marketing. She has spent three years volunteering with the Sundance Film Festival in the Artist Relations Department and has previously served as a Marketing Consultant for the Bentonville Film Festival. Gray began her career in the festival industry as a volunteer in 2010, evolving into the role of volunteer director for the Tallgrass Film Association before ultimately going full-time, where she was the Director of Marketing for three years. Her marketing experience includes both corporate and agency roles. Ceci Leon Membership Coordinator (She/HeR) Born and raised in Atlanta, Ga., Ceci has always been eager to merge her love of people and the creative arts in her hometown. After graduating from college, she worked for several non-profit organizations aimed to support Atlanta’s film industry. As a producer, she is passionate about producing creative content and events that put a lens on unique narratives. Currently, Ceci also serves as the Operations Manager for the Atlanta Film Society which annually hosts the Atlanta Film Festival. She is proud to be a connector for the film/tv production + exhibition space. Board of Directors Karen Cardarelli BOARD President (She/Her) FACETS Film Forum Executive Director of Facets Film Forum since 2020, Karen led the organization’s transition through the passing of its founder Milos Stehlik followed shortly by the Covid pandemic.  During Karen ’s tenure a building remodel was completed, the new Chicago Alliance of Film Festivals was launched, a first-ever strategic planning process completed, and programming was expanded to include six new monthly film series and regular family programming.  These changes led to a tripling of audiences since 2019. Karen ’s past experience includes serving as Interim Program Director with Illinois Arts Council, and Executive Director of Emerald City Theatre.   She has served on the Board for the League of Chicago Theatres and the Commissioner’s Planning Committee for the Year of Chicago Theater.  Currently she is Board President of the Film Festival Alliance and sits on the iHeart Media Local Advisory Board. Kathryn Spitz Cohan Vice President (She/Her) FESTIVAL CONSULTANT Kathryn Spitz Cohan is the Founder and former Executive Director of Film Pittsburgh, where, from 2001-2025, she oversaw programs including Three Rivers Film Festival, Pittsburgh Shorts and Script Competition, JFilm Festival, ReelAbilities Pittsburgh, Teen Screen, and the Robinson Short Film Competition. Previously, Ms. Spitz Cohan served as Artistic and Education Director of Shakespeare-in-the-Schools at the University of Pittsburgh, where she also taught classes for the Katz School of Business, Film Studies Program, and Department of Theatre Arts. Ms. Spitz Cohan was named one of the city's top 50 cultural forces by the Pittsburgh Post-Gazette and received an Opal Award from Women in Film and Media–Pittsburgh for exemplary professional achievement and contributions to the economic and cultural development of the region. Kathryn is a graduate of Northwestern University. Albert Chow Secretary (He/Him) URBANWORLD FILM FESTIVAL Albert Chow started from the ground up – as a Production PA; and has since straddled front of house, production and technical side of events. Besides his three most recent festivals (NY Film Festival, Tribeca Film Festival, Seattle Intl Film Festival), he has also worked at Sundance, Mill Valley, SXSW, Doc NYC, NewFest, Woodstock, Rooftop Films and Hamptons International Film Festival. Jamie Webb Treasurer (HE/HIM) FULL FRAME DOCUMENTARY FILM FESTIVAL Since volunteering at the Sundance London Film Festival in 2014, I have built a career working for a number of FFA member festivals all over the US. Small roles at Ann Arbor, Tribeca, and Hell's Half Mile, led to larger seasonal roles at Sundance, Full Frame, and Cucalorus, and finally as a year-round Festival Manager at Milwaukee Film. I spent an additional two years in the exhibition sector as General Manager at the Coolidge Corner Theatre and currently am the Film Sales Manager at Together Films, handling all non-theatrical screenings for all of our titles with a large emphasis on festival runs for our sales titles (In Camera, TISH, Your Fat Friend, and more). Additionally, I participated in the inaugural FFA Leadership Lab in 2020 and served on the programming team for the first FilmEx virtual conference. Carley Callahan MEMBER AT LARGE (She/Her) SIFF Carley Callahan is the Festival Producer at SIFF. Responsible for the planning and execution of SIFF’s festival programs, you can find her running around with a radio on at SIFF’s annual DocFest, Cinema Italian Style, Noir City, and flagship event - the Seattle International Film Festival. Before joining SIFF in 2017, Carley started out as a production assistant at the Telluride Film Festival in 2014, and quickly became part of the film festival industry, working at film festivals such as Sundance, Tribeca, Mill Valley, SFFILM, and Provincetown Film Festival. She studied in the Studio for Interrelated Media program at the Massachusetts College of Arts and Design. Carley lives in Wallingford, Seattle with her partner, and when not film festival-ing, she's sewing her own handmade clothes. Jessica Chriesman Member At Large (She/Here) SIDEWALK FILM Jessica Chriesman is an award-winning filmmaker based in Birmingham, Alabama. She has worked as a director, producer, researcher, and/or cinematographer on projects for Twin Cities Public TV, Southern Foodways Alliance, Vox Creative, Alabama Public Television, Dirty Robber and local indie film productions. As the Director of Education and Outreach at Sidewalk Film Center and Cinema / Sidewalk Film Festival, she plans learning opportunities through the lens of film and media for filmmakers and film lovers of all ages. She has served as a grant reviewer for the National Endowment for the Arts and the Alabama State Council on the Arts and as a juror, programmer, and panelist for film festivals across the South. She teaches Visual Media Production at the University of Alabama at Birmingham and has led storytelling and filmmaking classes and workshops at UAB, Georgetown University, and the University of Florida, and for the Jane Goodall Institute Africa Programs staff in Kigoma, Tanzania. Her films have screened across the United States and internationally. Sarah Escalante Member-at-Large (She/Her) Sarah Escalante (she/her/hers) joined the New Orleans Film Society (NOFS) team in July 2022 as Executive Director. Prior to NOFS, Sarah worked with the Michigan Theater Foundation as their Director of Programming and Communications and the Festival Director of the Cinetopia Film Festival in Ann Arbor, Michigan; and ran the gamut of festival roles at genre to regional and major festivals across the U.S. Originally from California, Sarah was an academic lawyer until her lifelong love of film and movie theaters led her to the impactful conversations and experiences found working within the film festival and art house communities. Bears Rebecca Fonté Member-at-Large (She/Her) All Genders, Lifestyles and Identities Film Festival (AGLIFF) Bears Rebecca Fonté founded Other Worlds in 2014 after two years as the Director of Programming for AUSTIN FILM FESTIVAL. In 2020 Other Worlds was named one of the World’s 50 Best Genre Fest by MovieMaker Magazine. Her SciFi shorts ROADSIDE ASSISTANCE, PRENATAL, and THE SECRET KEEPER have played 150+ festivals including Fantasia, SciFi London, Boston SciFi, FilmQuest, Austin Film Festival, and Dances With Films. Her LGBTQ Horror short CONVERSION THERAPIST made its world premiere at Inside Out in Toronto and US Premiere at aGLIFF. Her feature thriller iCRIME, which she wrote and directed, was released on DVD, VOD, and streaming by Breaking Glass/Vicious Circle Films in 2011. Bears Rebecca also was one of the producers on the Sundance Jury-Award Winning short THE PROCEDURE. Prior to arriving in Austin, she self-produced two web-series that were seen by a combined ten million viewers, wrote coverage for independent producers and coverage services in LA. She has served on the aGLIFF (the All Genders, Lifestyles, and Identities Film Festival) for four years, taught for their Queer Youth Media Project, and in 2020, helped guide the virtual pivot as Technical Director. She also represents Northwest Austin on the City of Austin Arts Commission. Timothy Gordon Member-at-Large (HE/HIM) LightReel Film Festival Film Critic, Association President, Cinema Historian, Radio Host & Producer, Film Festival and Award Show Founder, Brand Creator, and lover of ALL things film, Tim Gordon remains a cinematic force. Gordon has turned his passion for film into his life’s work, seeking to educate future generations and alter the perspective of African-Americans on screen as well as in the executive suites of Hollywood. NK Gutiérrez Member-at-Large (SHE/HER) Midwest Film Festival From HBO Latino to The Oprah Winfrey Show, classically trained dancer, vocalist, actor and filmmaker Nicole Kristine Gutiérrez has excelled in nearly every facet of entertainment. Most recently booking recurring roles in Showtime’s The Ch i, NBC’s Chicago Fire and her 4th run of the hit show, La Gringa , at the 2022 Puerto Rican International Theater Festival in San Juan. Gutiérrez made her filmmaking debut with the short film, The Last New Year , in which she wrote, produced and starred. Latina Magazine called it \"A hilarious and relatable story of sexual liberation, self-care and empowerment, with women of color at the center.\" NK is in the business of consciously creating equitable and just community through the lens of heart centered living. She puts her BA in Psychology, Mental Health First Aid and Consent certifications to use as an Intimacy Coordinator on film & TV sets as well as teaching mindful employee care practices in the corporate and nonprofit space. Gutiérrez currently serves as the Operational Director of Midwest Film Festival, co-chair of the Black Harvest Film Festival at the Gene Siskel Film Center, Head of Programming for the XL Festival and Lead of the Film Club at Soho House Chicago. Kristen C. Heller Member-at-Large (SHE/HER) MILWAUKEE FILM Kristen C. Heller is the Managing Director of Milwaukee Film, overseeing the areas of Ticketing, Customer Service, IT/Technical, Cinema Operations, Festival Operations, Events, Volunteers, and Human Resources. After receiving an MBA from the University of Massachusetts-Amherst, Kristen began work in this field through a number seasonal positions for film festivals including the Sundance Film Festival, the Provincetown International Film Festival, the San Francisco International Film Festival, and eventually finding her way to the Milwaukee Film Festival in 2011. Since 2013, she has overseen the Operations department of Milwaukee Film, which operates the Oriental and Downer Theatres on Milwaukee’s East Side, and produces the Milwaukee Film Festival and Dialogues Documentary Festival. Larry Laboe Member-at-Large (He/Him) NewFilmmakers Los Angeles (NFMLA) Larry Laboe is Co-Founder and Executive Director of NewFilmmakers Los Angeles (NFMLA), an organization committed to highlighting and connecting emerging filmmakers and storytellers worldwide. Larry is a member of the Producers Guild of America and has been a Faculty Member at the San Francisco Art Institute (SFAI) and L Art University in Shanghai and Beijing. He is a Board Member of the BRIC Foundation, a Committee Member of SAGindie and the Co-Chair of the Hollywood Chamber of Commerce Entertainment, Arts and Media Committee. Larry has produced scripted and unscripted streaming series and commercials, directed by talent such as Joseph Gordon Levitt, for some of the world’s leading brands, networks and studios, including Disney, NBC, CBS, VEVO, Dailymotion, MTV, DEFY Media, Comedy Central, Verizon go90, Amazon, Complex Media, IKEA, Mountain Dew, Samsung, Coca-Cola, Verizon and Smuckers. Justice Obiaya Member-at-Large (HE/HIM) OUT ON FILM Justice Obiaya, an Atlanta native, holds a BFA in Media Arts from the Art Institute of Atlanta and an MA from the Savannah College of Art & Design. He began his art nonprofit career as Marketing and Business Manager for ASIFA-South, quickly advancing to Associate Director, where he established the first ASIFAC animation festival. In 2017, he joined the Atlanta Film Society (ATLFS) as Education Program Coordinator, later becoming Marketing & Community Relations Director. Justice has led various committees with Out On Film, Atlanta’s Oscar-Qualifying LGBTQ+ film festival, ranked #1 in the nation by 10Best and USA Today in 2023, and Top 100 Best Reviewed with FilmFreeway. With an 8-year tenure at Out on Film, he held roles as a volunteer, Festival Coordinator, and Marketing Committee Chair. In January 2024, Justice assumed the role of Executive Director, making history as the first person in the organization's 37-year history to hold this position. Christopher Racster Member-at-Large (HE/HIM) OUTFEST For 25 years, Christopher has made an impact as a filmmaker and advocate, employing media to shape public perception and acceptance of the queer community. Currently, Christopher serves as Executive Director of Outfest, returning this year to the role he previously held until 2019. During his tenure, Christopher increased Outfest’s role in addressing the systemic issues faced by LGBTQ people in entertainment, investing in filmmaker education, connecting filmmakers to the industry, and advocating for more inclusion at all levels. Prior to Outfest, Christopher was a producer focused on queer storytelling. During this time, he produced five award-winning, internationally distributed feature films with premieres at festivals such as Sundance, Tribeca and BFI London. In 2008, Christopher was invited to become a founding Patron of the Iris Prize Festival in Wales and a Trustee of the Iris Prize Foundation, focused on launching the the careers of new queer filmmakers worldwide. Leslie Raymond Member-at-Large (She/THEY) Ann Arbor Film Festival Media artist and educator Leslie Raymond joined the Ann Arbor Film Festival as its executive director in August 2013. Before that, she founded a New Media Program at the University of Texas at San Antonio and served as assistant professor of art in digital video and new media art at Oakland University, where she was recognized with an Innovations in Teaching award. Raymond excels at organizing special projects that bring together practitioners to advance the conversation around contemporary cinema practice. Crickett Rumley Member-at-Large (SHE/HER) New York Film Academy, Los Angeles Crickett Rumley received her MFA in Film at Columbia University and is the founder and senior director of the Film Festival Department at the New York Film Academy in Los Angeles. With diversity, equity, and inclusion at the center of her work, she develops educational programs for a diverse, international student body. She has guided filmmakers to official selections at esteemed festivals ranging from Sundance to Bronzelens and to nomination and shortlisting for the BAFTA Student Film Awards, the Student Academy Awards, and the College Television Awards. A regular at the Tallgrass Film Festival, Crickett served first as a juror and now is their Panels Director. She also judges the Forum on Life, Culture, and Society’s International Short Film Competition and hosted the Winter Film Awards International Film Festival’s Education Day on the NYFA campus in New York, where she collaborated with her colleagues on workshops about Social Media for Creatives and How to Craft the Low Budget Screen Story. She is a member of the Film Festival Alliance. Beth Seymour Member-at-Large (She/HER) ACT Human Rights Film Festival Beth Seymour (she/her) joined Colorado State University's ACT Human Rights Film Festival as Managing Director in 2018. Beth brings extensive experience in nonprofit fundraising and event management. Beth formerly sat on the board of directors of the Rocky Mountain Women’s Film and chaired the board of Imagination Celebration, both located in Colorado Springs. Since 2020 she has served as a board member of the Human Rights Film Network, based in Amsterdam. Beth has been a festival jury member for Movies that Matter in The Hague, Netherlands and for Nepal Human Rights International Film Festival in Kathmandu, Nepal. Beth has a B.A. in Spanish from Whitman College and an M.A. in Latin American Studies from Tulane University. Melissa Simpson Member-at-Large (She/HER) Atlanta Film Society Melissa Simpson is the Executive Director of Film Impact Georgia, a nonprofit dedicated to amplifying the voices of independent filmmakers in Georgia. Born and raised just north of Atlanta, she holds a BS in Film & Digital Media from the University of North Georgia. Melissa's passion for film is reflected in her experience in the industry. She has volunteered for and worked 24 film festivals across 6 different organizations. Additionally, she spent two years at Eventive, a ticketing and virtual streaming platform, where she collaborated with filmmakers and festivals worldwide. Currently, Melissa is the Education Director at the Atlanta Film Society and remains active in the Georgia filmmaking community. She has produced projects such as Come Correct, Wokman, and Christmas with Jerks. She was recently named one of the 200 Most Influential of Georgia’s Creative Industries by Georgia Entertainment and honored at the Women in Film and Television 50th Anniversary Gala. tt stern-enzi Member-at-Large (He/Him) Over-the-Rhine International Film Festival Having spent 20 years as a freelance writer and film critic in the Greater Cincinnati region (covering the film industry & film festivals with the alt-weekly Cincinnati CityBeat and television affiliate Fox19, while earning distinction as an accredited critic on Rotten Tomatoes and membership in the Critics Choice Association), tt stern-enzi began curating film programs at the Mini Microcinema and other regional venues, serving on the advisory board for the University of Cincinnati Center for Film & Media Studies, and developing an educational curriculum for his WatchWriteNow initiative. These efforts have paved the way for tt to step into the role of lead programmer/curator for the rebranded Over-the-Rhine International Film Festival during its first two years before settling into the position of Artistic Director for the 2021 edition. Ben Stilp Member-at-Large (He/Him) Sundance Institute Ben Stilp serves as Chief Financial Officer of the Sundance Institute, overseeing the $45M annual budget, $43M endowment, tax, audit, and treasury. Ben is a seasoned executive with 20 years of C- Suite experience overseeing all aspects of nonprofit organizations&#39; finance and operations, board management, and strategic planning. Before Sundance, Ben served as the CFO/COO for the LA Cleantech Incubator, a small venture capital and debt fund that incubates cleantech start-ups with an emphasis on social equity. He served five years the Treasurer on the Board of Directors of Outfest, the LGBTQ film festival. His other prior experience spans nonprofit service in the arts, education, healthcare, HIV/AIDS services, LGBT advocacy, and economic and workforce development. Ben earned his MBA from the Anderson Graduate School of Business at UCLA, and he splits his time between homes in LA and San Francisco where he partner lives. Staff & Board Membership Education Donate Contact Us © 2024 Film Festival Alliance | Terms of Use | Privacy Policy Powered by Higher Logic Copyright 2024. All rights reserved. Powered by Higher Logic"
    },
    {
      "url": "https://filmfestivalalliance.org/about/staff-and-board",
      "text": "- Film Festival Alliance Skip main navigation (Press Enter). Log in Toggle navigation Log in About Us Who We Are Staff & Board Upcoming Events News & Announcements Accessibility Newsletter Sign-Up Contact Us Membership Join Now Our Members Partner Discounts Education Independent Film Exhibition Conference Film Festival Resources Virtual Workshops Advocacy Industry Surveys & Reports Accessibility Scorecard Accessibility Office Hours Film Festival Best Practices Community About Our Community Job Board Filmmakers Start Here Filmmaker Sustainability Report Film Festival Directory Page Not Found Sorry! The page you requested was not found. Staff & Board Membership Education Donate Contact Us © 2024 Film Festival Alliance | Terms of Use | Privacy Policy Powered by Higher Logic Copyright 2024. All rights reserved. Powered by Higher Logic"
    },
    {
      "url": "https://dunedinfilmfestival.org/award-winners",
      "text": "Award Winners 8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026 Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School More Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Account My Account Sign out Sign In My Account Award Winners 2025 Best Film Home Free Best Short Film The Talent Best Director Finola Hughes, Darling Best Female Performance Brid Brennan, Room Taken Best Male Performance Julio Gabay, Wake Best Documentary A Splash of Color Best Cinematography Antarctic Voyage Best Score Together Forever Best Editing Wake Best Screenplay Together Forever Best Production Deisgn The Talent Best Animation Shakespeare for the Ages Arts and Culture Award Katie Ducharme Procissi Film Florida Award Lisa Dozios The Audience Award The Charming Mr. Bookins 2025 - Celtic Heritage Award Winners 2024 Best Film Join or Die Best Short Film Voice Activated Best Director Stephen Wallis, The Martini Shot Best Female Performance Tour Alaoui, The Glass of Friendship Best Male Performance Cem Yiğit Üzümoğlu, RSVP Please Respond Best Documentary Join or Die Best Cinematography Entre 2 Eaux Best Score Wild Connection Best Editing Join or Die Best Screenplay The Stupid Boy Best Production Deisgn All the Wrong Ingredients Best Animation 4 Souls of Coyote Arts and Culture Award Gregory Brady Film Florida Award Susan Gallagher The Key to the City of Dunedin Martin Kove 2024 - The Year of the Dragon Award Winners 2023 Best Film Blue Brazil (Brazil) Best Short Film Le Petit Prodige (Belgium) Best Director Sally Rubin, Mama has a Mustache (United States) Best Female Performance Lea Koenig, A Fast of Longing (Israel) Best Male Performance Nicolas Lacroix, Le Petit Prodige  (Belgium) Best Documentary Surviving Pulse: Life after a Mass Shooting (United States) Best Cinematography Water Colour (United Kingdom) Best Score Mila (United States) Best Editing Mama Has a Mustache (United States) Best Screenplay Le Petit Prodige (Belgium) Peace and Love Award Sheree Johnson Arts and Culture Award Jackie Nigro Film Florida Award Eugenie Bondurant Peace, Love and Cinema Award Winners 2022 Best Film ON THE EDGE Best Short Film A Unicorn in Tel Aviv Best Director Hani Gal-ed, ZOHAR Best Female Performance Svetlana Khodchenkova, ON THE EDGE Best Male Performance Carlos Montilla, SAMLAND Best Documentary #KIDSONTECH Best Cinematography Tochiki Death Best Score Alles hat Grenzen NUR DER MONDFISCH NICHT Best Editing Galapagos: Secrets if the Ocean Best Screenplay Alles hat Grenzen NUR DER MONDFISCH NICHT Best Animation Chompin' Stompin' Arts and Culture Award Vinnie Luisi Film Florida Award Victoria Jorgensen Picture This Brought to you by Dunedin Film Festival Dunedin, Florida - Home of the Toronto Blue Jays Spring Training Copyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.vaughanfilmfestival.com/contact",
      "text": "Contact | VFF top of page Home About Us Who We Are Testimonials In The Media Volunteer Become A Sponsor Contact Festival 2025 Int'l Judging Panel 2025 EIPMA Judging Panel Award Winners Independent Leaders Sandra Piccolo Trailblazers Films Previous Years' Lineups Education Workshops, Seminars & Webinars Student Film Competition 2025 EIPMA Judging Panel Submissions International Submissions Student Submissions Gallery Blog Contact Us Ask us anything! info@vaughanfilmfest.com Looking to volunteer? Brittany Vargas - Manager of Volunteers volunteers@vaughanfilmfest.com Want to cover vff? marketing@vaughanfilmfest.com Submitting a film? filmmaker@vaughanfilmfest.com Want to sponsor? Antonio Ienco - Director of Sponsorship & Events antonio@vaughanfilmfest.com Our Location: 7675 Hwy #27, Unit 22B Vaughan, ON, L4L 4M5 T: 905-264-0833 July 6-9, 2026 Contact Us Privacy Policy About VFF Volunteer Sponsor Blog Subscribe to VFF VFF is a registered non-profit organization based in Vaughan, Ontario, dedicated to supporting emerging filmmakers and showcasing global talent through the power of short film. #staycreativewithvff © V aughan International Film Festival 2 0 25 bottom of page"
    },
    {
      "url": "https://dunedinfilmfestival.org/",
      "text": "Dunedin Film Festival Inc. 8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026 Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School More Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Account My Account Sign out Sign In My Account click to submit your film Celebrating Arts and Culture in Dunedin The City of Dunedin is deeply committed to fostering a thriving arts and culture community. Through public programs, community initiatives, and support for local artists, the City works to make the arts accessible, sustainable, and integral to daily life. By investing in cultural events, creative spaces, and arts education, Dunedin ensures that creativity con Show More The Film Incentive The Screen Industry Incentive Program: Our Screen Industry Incentive Program offers a 15% cash rebate on total qualified local expenditures made within Pinellas County and its 24 municipalities. This rebate applies to both above- and below-the-line expenses, including but not limited to location fees, accommodations, food, construction materials, props, and vehicle rentals. Book Your Room at the Fenway Hotel Autograph Collection Film Festival Discounted Rate Available Until 12/22/25 CLICK HERE TO BOOK YOUR ROOM Show More Stay in Touch Sign up to hear from us about specials, sales, and events. Email Address Sign up Brought to you by Dunedin Film Festival Dunedin, Florida - Home of the Toronto Blue Jays Spring Training Copyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://dunedinfilmfestival.org/film-schedule-2025",
      "text": "Film Schedule 2025 8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026 Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School More Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Account My Account Sign out Sign In My Account 2025 FILM GUIDE AND SCHEDULE Click for Film Guide CLICK FOR FILM SCHEDULE Brought to you by Dunedin Film Festival Dunedin, Florida - Home of the Toronto Blue Jays Spring Training Copyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://dunedinfilmfestival.org/tickets",
      "text": "Tickets 8th Annual Dunedin International Film Festival - January 22nd - 25th, 2026 Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School More Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home About Us Become a Member Sponsor Tickets Accommodations Contact Us Award Winners Volunteer Dunedin Youth FIlm School Account My Account Sign out Sign In My Account Become a member and save 10% on passes. Tickets Now Available! All Access - $100 VIP All Access - $250 Industry Pass - $500 Click For Passes Brought to you by Dunedin Film Festival Dunedin, Florida - Home of the Toronto Blue Jays Spring Training Copyright © 2026 Dunedin Film Festival Inc. - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}