{
  "fuentes": [
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "achristensen@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "adrehmel@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "afarrell@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "ahilger@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "akojetin@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "amorley@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "andiaye@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "apeters@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "awoychick@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "ayoder@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "bcook@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "bgraves@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "cjunnila@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "csloan@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "ctsang@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "dnauman@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "efunk@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "esherry@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "gerickson@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "jbyers@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "jdwyer@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "jhendrix@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "jmunyer@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "kbuetow@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "kklein@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "kschaff@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "lbordelon@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "ldalbacka@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "lgaffron@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "lschothorst@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "lstein@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mbenson@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mbohm@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mhannasch@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mnewlander@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mnordby@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "mpartch@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "nthompson@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "rmurphy@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "sburgess@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "serickson@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "soneil@mnchamber.com"
    },
    {
      "url": "https://www.mnchamber.com/staff",
      "email": "wharvey@mnchamber.com"
    },
    {
      "url": "https://www.chronicleonline.com/lifestyle/entertainment/boomtown-days-celebrating-50-years/article_11d9dd1b-bcce-5c46-ad9c-1c0167ce08b3.html",
      "email": "subscription@chronicleonline.com"
    },
    {
      "url": "https://www.chronicleonline.com/lifestyle/entertainment/boomtown-days-celebrating-50-years/article_11d9dd1b-bcce-5c46-ad9c-1c0167ce08b3.html",
      "email": "webadmin@chronicleonline.com"
    },
    {
      "url": "https://www.ocala.com/story/entertainment/local/2018/04/11/boomtown-days-pies-blues-and-bandits/12729704007/",
      "email": "dave.schlenker@ocala.com"
    },
    {
      "url": "https://www.ocala.com/story/news/2004/04/16/dunnellon-boomtown-days/31137077007/",
      "email": "monica.bryant@starbanner.com"
    }
  ],
  "mails": [
    "achristensen@mnchamber.com",
    "adrehmel@mnchamber.com",
    "afarrell@mnchamber.com",
    "ahilger@mnchamber.com",
    "akojetin@mnchamber.com",
    "amorley@mnchamber.com",
    "andiaye@mnchamber.com",
    "apeters@mnchamber.com",
    "awoychick@mnchamber.com",
    "ayoder@mnchamber.com",
    "bcook@mnchamber.com",
    "bgraves@mnchamber.com",
    "cjunnila@mnchamber.com",
    "csloan@mnchamber.com",
    "ctsang@mnchamber.com",
    "dave.schlenker@ocala.com",
    "dnauman@mnchamber.com",
    "efunk@mnchamber.com",
    "esherry@mnchamber.com",
    "gerickson@mnchamber.com",
    "jbyers@mnchamber.com",
    "jdwyer@mnchamber.com",
    "jhendrix@mnchamber.com",
    "jmunyer@mnchamber.com",
    "kbuetow@mnchamber.com",
    "kklein@mnchamber.com",
    "kschaff@mnchamber.com",
    "lbordelon@mnchamber.com",
    "ldalbacka@mnchamber.com",
    "lgaffron@mnchamber.com",
    "lschothorst@mnchamber.com",
    "lstein@mnchamber.com",
    "mbenson@mnchamber.com",
    "mbohm@mnchamber.com",
    "mhannasch@mnchamber.com",
    "mnewlander@mnchamber.com",
    "mnordby@mnchamber.com",
    "monica.bryant@starbanner.com",
    "mpartch@mnchamber.com",
    "nthompson@mnchamber.com",
    "rmurphy@mnchamber.com",
    "sburgess@mnchamber.com",
    "serickson@mnchamber.com",
    "soneil@mnchamber.com",
    "subscription@chronicleonline.com",
    "webadmin@chronicleonline.com",
    "wharvey@mnchamber.com"
  ],
  "nombre_sitio": "dunnellonchamber.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mnchamber.com/staff",
      "text": "Staff | Minnesota Chamber of Commerce Skip to main content Search Main navigation Your Voice at the Capitol Your Voice at the Capitol Paid Family and Medical Leave (PFML) Key issues Get involved Coalitions Elections Your Connection to Business Your Connection to Business Coolest Thing Made in Minnesota Events Sponsorship Leadership programs Your Opportunity to Grow Your Opportunity To Grow ChamberHealth Business services Grow Minnesota! Waste Wise Energy Smart Your Resource on the Economy Your Resource on the Economy Foundation Investing in the Foundation Economic research Workforce Workforce inclusion Business Education Network About Us About Us Members Staff Careers Podcast Minnsights Minnsights Join Us Header Menu Explore Membership User account menu Log In Top Bar Phone mail@mnchamber.com Blog Staff We're here to help you Our staff is committed to helping your business grow. Whether it be through advocating for a better business climate at the Capitol, to adding to your bottom line with waste and energy savings, to planning an event with your company, we're here for you and your business. Staff Leadership Doug Loon President and CEO Minnesota Chamber of Commerce 651.292.4650 Biography Laura Bordelon Senior Vice President, Advocacy Minnesota Chamber of Commerce lbordelon@mnchamber.com 651.292.4650 Biography Annette Kojetin Senior Vice President, Chief Financial Officer Minnesota Chamber of Commerce akojetin@mnchamber.com 651.292.4650 Biography Jenny Munyer Vice President, Member Development and Engagement Minnesota Chamber of Commerce jmunyer@mnchamber.com 651.292.4650 Biography Business Assistance Kristyn Buetow Senior Sustainability Specialist Minnesota Chamber of Commerce kbuetow@mnchamber.com 612.682.7827 Biography Summer Burgess Senior Sustainability Specialist Minnesota Chamber of Commerce sburgess@mnchamber.com 651.292.3901 Biography Alex Christensen Energy Smart Program Manager Minnesota Chamber of Commerce achristensen@mnchamber.com 651.292.3935 Biography Lani Dalbacka Energy Efficiency Specialist Minnesota Chamber of Commerce ldalbacka@mnchamber.com 612.682.7828 Biography Abby Drehmel Sustainability Specialist Minnesota Chamber of Commerce adrehmel@mnchamber.com 651.292.4675 Biography Sarah Erickson Economic Development Coordinator Minnesota Chamber of Commerce serickson@mnchamber.com 612.682.7824 Biography Emma Funk Sustainability Specialist Minnesota Chamber of Commerce efunk@mnchamber.com 651.227.6631 Biography Lauren Gaffron Sustainability Specialist Minnesota Chamber of Commerce lgaffron@mnchamber.com 651.292.3934 Biography Jessie Hendrix Waste Wise and Energy Smart Outreach Coordinator Minnesota Chamber of Commerce jhendrix@mnchamber.com 651.292.3936 Biography Meg Hannasch Senior Sustainability Specialist Minnesota Chamber of Commerce mhannasch@mnchamber.com 651.292.4653 Biography Andrew Hilger Waste Wise Program Manager Minnesota Chamber of Commerce ahilger@mnchamber.com 651.292.4650 Biography Ryan Murphy Senior Energy Efficiency Specialist Minnesota Chamber of Commerce rmurphy@mnchamber.com 651.292.4652 Biography Alboury Ndiaye Waste Wise Program Coordinator Minnesota Chamber of Commerce andiaye@mnchamber.com 651.292.3932 Biography Morgan Nordby Energy Smart Program Coordinator Minnesota Chamber of Commerce mnordby@mnchamber.com 651.292.4677 Biography Sean O'Neil Senior Director of Economic Development and Research Minnesota Chamber of Commerce soneil@mnchamber.com 651.292.4674 Biography Madeleine Partch Waste Wise Program Coordinator Minnesota Chamber of Commerce mpartch@mnchamber.com 612.682.7823 Biography Ally Peters Senior Energy Efficiency Specialist Minnesota Chamber of Commerce apeters@mnchamber.com 651.292.4692 Biography Chelsey Sloan Sustainability Specialist Minnesota Chamber of Commerce csloan@mnchamber.com 651.292.4662 Biography Nicole Thompson Sustainability Specialist Minnesota Chamber of Commerce nthompson@mnchamber.com 651.292.3904 Biography Audrey Woychick Sustainability Specialist Minnesota Chamber of Commerce awoychick@mnchamber.com 651.364.9671 Biography Communications and Marketing Anne Mason Yoder Senior Director, Communications and Marketing Minnesota Chamber of Commerce ayoder@mnchamber.com 651.292.4688 Biography Grant Erickson Senior Communications Manager Minnesota Chamber of Commerce gerickson@mnchamber.com 651.292.4699 Biography Matt Bohm Public Relations Associate Minnesota Chamber of Commerce mbohm@mnchamber.com 651.292.4656 Biography Events Megan Newlander Event Manager Minnesota Chamber of Commerce mnewlander@mnchamber.com 651.292.4651 Biography Elizabeth Sherry Director of Development and Strategic Partnerships Minnesota Chamber of Commerce esherry@mnchamber.com 651.292.4689 Biography Foundation Jennifer Byers Vice President, Grassroots and Chamber Relations | Executive Director, Minnesota Chamber Foundation Minnesota Chamber of Commerce jbyers@mnchamber.com 651.292.4650 Biography Whitney Harvey Senior Director of Workforce Solutions Minnesota Chamber of Commerce wharvey@mnchamber.com 651.292.4650 Biography Internal Operations Annette Kojetin Senior Vice President, Chief Financial Officer Minnesota Chamber of Commerce akojetin@mnchamber.com 651.292.4650 Biography Amanda Farrell Finance Manager Minnesota Chamber of Commerce afarrell@mnchamber.com 651.292.4679 Biography Katie Klein Director, Human Resources and Office Administration Minnesota Chamber of Commerce kklein@mnchamber.com 651.292.4680 Biography Laura Stein Office Assistant Minnesota Chamber of Commerce lstein@mnchamber.com 651.292.4650 Biography Membership and Membership Programs Jenny Munyer Vice President, Member Development and Engagement Minnesota Chamber of Commerce jmunyer@mnchamber.com 651.292.4650 Biography Jack Dwyer Director, Membership Development Minnesota Chamber of Commerce jdwyer@mnchamber.com 651.292.4683 Biography Christine Junnila Member Relations Manager Minnesota Chamber of Commerce cjunnila@mnchamber.com 651.292.4676 Biography Derek Nauman Membership Account Executive Minnesota Chamber of Commerce dnauman@mnchamber.com 651.292.3905 Biography Kathi Schaff Senior Account Executive Minnesota Chamber of Commerce kschaff@mnchamber.com 651.292.4667 Biography Clare Tsang Events, Membership and Technology Assistant Minnesota Chamber of Commerce ctsang@mnchamber.com 651.292.4695 Biography Public Policy Laura Bordelon Senior Vice President, Advocacy Minnesota Chamber of Commerce lbordelon@mnchamber.com 651.292.4650 Biography Michelle Benson Director, Commerce and Utilities Policy Minnesota Chamber of Commerce mbenson@mnchamber.com 651.292.4678 Biography Jennifer Byers Vice President, Grassroots and Chamber Relations | Executive Director, Minnesota Chamber Foundation Minnesota Chamber of Commerce jbyers@mnchamber.com 651.292.4650 Biography Brian Cook Director, Tax, Fiscal and Elections Policy Minnesota Chamber of Commerce bcook@mnchamber.com 651.292.4650 Biography Bentley Graves Director, Health Care and Transportation Policy Minnesota Chamber of Commerce bgraves@mnchamber.com 651.292.4650 Biography Andrew Morley Director, Environmental Policy Minnesota Chamber of Commerce amorley@mnchamber.com 651.292.4668 Biography Lauryn Schothorst Director, Workplace Management and Workforce Development Policy Minnesota Chamber of Commerce lschothorst@mnchamber.com 651.292.4650 Biography Interested in working for the Minnesota Chamber of Commerce? View our current openings Join Us! Invest in the Minnesota Chamber of Commerce and reap the dividends for your company and your clients. Your membership opens the door to a full-service policy staff, a statewide network of companies of all types and sizes, and a range of resources to grow your business. Membership Application OR Have Questions? Fill out the form below to learn more! Your Name Your Email Subject Message CONTACT US 651.292.4650 mail@mnchamber.com 380 St. Peter St., Suite 1050 St. Paul, MN 55102 CONNECT WITH US footer legal Privacy Policy Copyright Minnesota Chamber of Commerce. All Rights Reserved. Powered by Irish Titan"
    },
    {
      "url": "https://www.chronicleonline.com/lifestyle/entertainment/boomtown-days-celebrating-50-years/article_11d9dd1b-bcce-5c46-ad9c-1c0167ce08b3.html",
      "text": "Boomtown Days celebrating 50 years | Entertainment in Citrus County | chronicleonline.com Skip to main content You have permission to edit this article. Edit Close Home Subscribe Advertise Submit Your News About Contact Who We Are Sign Up for Email Updates e-Edition Special Editions Log-In Search e-Paper News Elections Local News Business Crime & Courts e-Edition Education Hurricane Guide Nation & World State News News Notes Obituaries Pet Tributes Sports Local Sports College Sports Pro Sports Tampa Bay Buccaneers Tampa Bay Lightning Tampa Bay Rays Opinion Columns Editorials Letters to the Editor Sound Offs Lifestyle Community Discover Citrus County Food Health Home and Garden Religion Entertainment Veterans Events Event Calendar Customer Appreciation Home & Garden Show Healthy Living Show Nature Coast Outdoor Recreation Expo Healthcare Heroes Nurses Appreciation Student Athletic Recognition Promote Your Event History-125 Years of the Chronicle Shop Employment Classifieds Top Agent Attorney Spotlight Business Directory Best of the Best Place a Classified Contests Public Notice Weekly papers Levy Citizen Marion Citizen Riverland News Wakulla News Fun & Games Comics Puzzles Site search Search Facebook Twitter YouTube Subscribe Facebook Twitter YouTube 74° Menu Log In My Account My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out Subscribe Manage Service Search Site search Search Log In My Account My Account Dashboard Profile Saved Items Subscribe Manage Service Log Out Subscribe Manage Service Home Subscribe Advertise Submit Your News About Contact Who We Are Sign Up for Email Updates e-Edition Special Editions Log-In Search e-Paper News Elections Local News Business Crime & Courts e-Edition Education Hurricane Guide Nation & World State News News Notes Obituaries Pet Tributes Sports Local Sports College Sports Pro Sports MLB NASCAR & Racing NBA NFL NHL Soccer Tampa Bay Buccaneers Tampa Bay Lightning Tampa Bay Rays Opinion Columns Editorials Letters to the Editor Sound Offs Lifestyle Community Discover Citrus County Food Health Home and Garden Religion Entertainment Veterans Events Event Calendar Customer Appreciation Home & Garden Show Healthy Living Show Nature Coast Outdoor Recreation Expo Healthcare Heroes Nurses Appreciation Student Athletic Recognition Promote Your Event History-125 Years of the Chronicle Shop Employment Classifieds Top Agent Attorney Spotlight Business Directory Best of the Best Place a Classified Contests Public Notice Weekly papers Levy Citizen Marion Citizen Riverland News Wakulla News Fun & Games Comics Puzzles Share This Facebook Twitter WhatsApp SMS Email Boomtown Days celebrating 50 years SPECIAL TO THE CHRONICLE Apr 12, 2023 Apr 12, 2023 0 1 min to read Facebook Twitter WhatsApp SMS Email Two cowboys argue during Kidd Carson’s Wild West Show during Boomtown Days 2022. The cowboys performed four shows for the crowds during the festival. Chronicle file photo Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save There will be plenty to see and do in Dunnellon on Saturday from 9 a.m to 5 p.m. at the annual Boomtown celebration. Antique cars, classic cars, crafters, cowboys and festival foods, including beer and wine, are all part of the fun lined up for the festival. The festival is organized by the Dunnellon Chamber and Business Association. Judy Terwilliger, executive director for the DCBA, said she was expecting to have more than 100 craft booths and 15 food trucks set up along West Pennsylvania Avenue in Dunnellon’s Historic District. Cowboy shows will be staged throughout the late morning and early afternoon behind the Rainbow Springs Art in Dunnellon building. Music is always a big part of the festivities, and this year is no exception. Jake White starts the lineup at 10:30 a.m., followed by R-Style at 12:30 p.m. and the Keith Caton Blues Band at 2:30. Thirty-six contestants are vying for seven different titles in pageants throughout the day. Those selected will include Boomtown Baby, Tiny Miss Dunnellon, Little Miss Dunnellon, Duchess of Dunnellon, Junior Princess of the Rainbow and Queen of the Rainbow. Pageants start at 9 a.m. and continue till 12:40 p.m. for the Queen of the Rainbow contest. Boomtown is a celebration of the discovery of phosphate in Dunnellon and the subsequent “boom” that followed as those seeking to get rich flocked to the area. This year’s event is the 50th anniversary of Boomtown. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Recommended for you × Post a comment as anonymous Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Thank you for reading! Please log in, or sign up for a new account and purchase a subscription to read or post comments. Sign Up Log In Log In Purchase a Subscription Latest e-Edition Citrus County Chronicle To view our latest e-Edition click the image on the left. Sign up for our Email Newsletter For Email Marketing you can trust Most Popular FWC responds to boating accident in Citrus County Citrus teen who troopers say fled from I-75 crash charged as adult Southbound U.S. 19 depressed lane closure near Bealls Plaza to lift soon Citrus County man accused of paying young child ‘Robux’ for sex Citrus County residents push back on fire rate hike at packed meeting Submit Your News Anniversary Announcement Birth Announcement Engagement Announcement Wedding Announcement Letter to the Editor Event sponsorship Request Place a Classified Ad Advertiser Request Sections Home News Sports Lifestyle Local Events Announcements Obituaries Opinion Multimedia Services Subscription Services Classifieds Promote Your Event Refund policy Privacy policy and terms & conditions Submission forms Search Weather Who Are We Contact Us About Us Contact Information chronicleonline.com 2519 W Highway 44 Inverness, FL 34453 Phone: 352-563-6363 For technical issues, email webadmin@chronicleonline.com. For subscription or home delivery issues, email subscription@chronicleonline.com. Facebook Twitter YouTube View Audit Florida Public Notices × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 chronicleonline.com 2519 W Highway 44, Inverness, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital . Back × Log In You are logged in Switch accounts Secure transaction. Cancel anytime. Back × Sign Up Account processing issue - the email address may already exist User information * Username This is the name that will be displayed next to your photo for comments, blog posts, and more. Choose wisely! * First name * Last name * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. Contact information Phone CAPTCHA Create Account Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Remember me Forgot your password? Log In Email me a log in link Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    },
    {
      "url": "https://www.ocala.com/story/entertainment/local/2018/04/11/boomtown-days-pies-blues-and-bandits/12729704007/",
      "text": "Boomtown Days: Pies, blues and bandits News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals LOCAL Boomtown Days: Pies, blues and bandits Six Gun Territory crew to fire up Dunnellon's big party Dave Schlenker dave.schlenker@ocala.com The annual Boomtown Days festival is a nod to Dunnellon's phosphate boom in the 1800s. It has become one of Marion County's biggest spring events, a vast family street party that spreads out over multiple blocks and attracts 8,000 people or more to the otherwise small river city. This year's festival will fill the city's historic district with about 100 vendors selling everything from plants to art to cowboy hats. There will be a kids area and crafts and pageants. There will be performances by blues man Keith Caton and rock band Final Note. There also will be a classic car show with 80 vehicles or more. And new this year: a pie-eating contest hosted by Dunnellon's Harmony Preschool. \"This year we wanted to make it an old-town country fair,\" said Julie Mancini, executive director of the Dunnellon Chamber and Business Association. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. But this old town also will be crawling with outlaws, lawmen and can-can dancers. Sometimes, that is not a healthy mix, especially around the festival's Boomtown Saloon. Therefore, amid the spring fun, crafts, games and food, there likely will be some trash-talking cowboys roaming Boomtown's streets. And that trash talk will boil over into a field near Pennsylvania Avenue and Cedar Street, where carefully choreographed Wild West shootouts will settle the disputes and provide some business for Digger the undertaker. That's right, the Six Gun Territory crew is back at Boomtown Days this year, celebrating not only the city's heritage but also its own. The pretend gunfights, tough talk and can-can dances are ripped right from the dusty streets of the long-defunct Six Gun Territory theme park in Ocala. Many cast members from the park — the people who played outlaws, good guys and can-can dancers — reunited in 2015 at Kirby Family Farm in Williston, where they still get together each year for public reunions with shootouts. But the movement has grown and attracted new can-can dancers and gunslingers. The current crew started appearing at Boomtown Days in 2016, staging saloon-soaked brawls amid the festival trappings. Their presence is a bit of a festival throwback, as well, because many of the cast members used to make appearances at Boomtown Days decades ago when the park was in his full swing, said Jim Pierce, who worked as a gunslinger at Six Gun in 1960s through early 1970s. He well remembers suiting up in his Six Gun gear and mingling with the Boomtown Days crowds in the 1970s. These days, though, the Six Gun players step it up up a notch, bringing the Wild West spittle to the streets and then squaring off for the shootout in the staging area. There will be up to 50 people in the Six Gun delegation at Boomtown Days on Saturday, Pierce said. That will include good guys, bad guys, can-can dancers and support staff. Of the cast of gunslingers, six or more — Pierce included — will be original from the old park. There also are several original dancers from the old park in the current line-up of can-can dancers. \"They say they are the can't-can't dancers,\" Pierce said. Boomtown Days What: Annual family festival celebrating Dunnellon's history When: 9 a.m. to 6 p.m. Saturday Where: Downtown Dunnellon, off Pennsylvania Avenue in the historic district Admission: Free; vendors available (489-2320) Boomtown Days Pancake Breakfast and Six Gun Shootout When: 7:30-9 a.m. Friday Where: Historic Train Depot, 12061 S. Williams St., Dunnellon Cost: $6 (489-2320) Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    },
    {
      "url": "https://www.ocala.com/story/news/2004/04/16/dunnellon-boomtown-days/31137077007/",
      "text": "Dunnellon Boomtown Days News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals NEWS Dunnellon Boomtown Days Dunnellon pays homage to heritage BY MONICA BRYANT STAFF WRITER B oomTown Days are back. Each year in April, the Dunnellon Area Chamber of Commerce traditional celebration turns back the hands of time to pay tribute to the city's primitive beginnings in phosphate mining. The 3-day festival, which celebrates more than 30 years of Dunnellon's heritage, draws nearly 10,000 people to the area to remember the era when the town was discovered and boomed during the 1890s. \"It's an effort to bring Dunnellon to the notice of people in Florida,\" said Don Koppler, executive director of the Chamber. \"Hey, we're over here, come find us, come shop and visit.\" To make the annual tradition more appealing, this year Koppler added a contest to name the mascots - two cartoon armadillos that symbolize the discovery of phosphate and the resulting mining industry. \"We're trying to bring back the old small town spirit by having the mascots as a conversation piece,\" Koppler said. \"We're attempting to refocus on the phosphate industry that was the start of our boom that made us. Boom Town will be branded with our armadillos.\" The festival kicks off today with a community breakfast hosted by the Front Porch Restaurant and Pie Shop at the Dunnellon Bingo Hall at7:30 a.m. Prizes will be awarded for best costume by individuals, and local businesses will be judged for best decoration and employee costume. The two names for the BoomTown Days mascot contest will be announced, the BoomTown mayor will be elected and the winning tickets for the Chinese Auction will be drawn. The continental buffet costs $3.50. Later that evening, Southeast Pride, the Navy's Rock Band, will host a free community concert from 6:30 to 8:30 p.m. at Ernie Mills Park. The music is Anna Bell Dobbs' favorite part. She said she's been attending the festival for about 10 years with her husband, Olin, and they enjoy walking around, seeing everybody and having a good time. \"Every year we're here we know more people,\" she said. \"It shows people what's really here. We talk to people who come from St. Petersburg or over in The Villages, and they can't believe what we have.\" The event boasts having something for everyone. Koppler said last year the Heritage Park area, which featured American Indian storytellers, dancers and miniature horses, drew more people, so they expanded it. But the main attraction is the arts and crafts. He said people always comment on the quality of the vendors. \"It's just full of all kinds of crafts. Really, really good crafts,\" said Barbara Walker. \"Not only the amount of crafts they have, but the quality of them is just wonderful.\" New this year is the addition of the Florida Cracker Cowman's Camp. The Dunnellon Women's Club will mark 82 years of community service by dressing in period costumes and handing out homemade cookies. Pet adoptions are available through the Humane Society of Marion County. Pony rides, a petting zoo, a rock climbing wall and rug weaving, spinning wheel and canoe construction demonstrations, also will be included. The BoomTown Mayor will cut the ribbon marking the festival's official opening at 10 a.m. on Saturday. Winners of the Little Miss and Mister Dunnellon pageant will be announced at 3 p.m. Almost 100 arts and crafts vendors will fill West Pennsylvania Avenue and display their wares, and Capt. Mike's Lazy River Cruises will offer 45-minute pontoon boat rides for $10. On Sunday, the winners of the Queen of the Rainbow River pageant will be crowned, and the Lions Club will host its 26th Annual Auto Show in Heritage Park throughout the day. \"It's a lot of fun,\" Walker said about the festival. \"It just gets better every year. \"You walk around the streets, meet your neighbors and have a hot dog. It's just a good time,\" she said. The festival is from 10 a.m. to 4 p.m. Saturday and Sunday. Free parking is available at Dunnellon Middle School. Proceeds help fund chamber projects such as Boom Town, Jazz up, Home for the Holidays, the Christmas Parade or to promote the Dunnellon Area. Monica Bryant covers State Road 200 and the Dunnellon Area. She can be reached at monica.bryant@starbanner.com or 867-4131. WHEN: Today through Sunday WHERE: Downtown Dunnellon COST: Admission is Free FOR MORE INFORMATION: Call; 489-2320 Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    }
  ]
}