{
  "fuentes": [
    {
      "url": "https://golfrange.org/winners/duran-golf-club-7/",
      "email": "djt@durangolf.com"
    },
    {
      "url": "https://www.dvforegolf.com/contactus/",
      "email": "proshop@dvforegolf.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "fbmgr@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "bryan.ewart@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "info@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "matt.vincent@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "ryan.dunkley@golfosoyoos.com"
    },
    {
      "url": "https://durangolf.com/signature-membership/",
      "email": "info@durangolf.com"
    },
    {
      "url": "https://www.hole19golf.com/courses/duran-golf-club-par-3",
      "email": "info@durangolf.com"
    },
    {
      "url": "https://www.peacockgapgolfclub.com/contact-us",
      "email": "info@peacockgapgolfclub.com"
    },
    {
      "url": "https://durangolf.com/meet-the-staff/",
      "email": "amn@durangolf.com"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "email": "hcc@unitelc.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/viera/american-cuisine/tradewinds-restaurant-at-duran-golf-club/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://golfbusinessnews.com/news/corporate/duran-group-takes-over-ngsa-and-gch/",
      "email": "publisher@golfbusinessnews.com"
    },
    {
      "url": "https://durangolf.com/instructors/",
      "email": "jkb@durangolf.com"
    },
    {
      "url": "https://spacecoastgolf.com/news/duran-news",
      "email": "jwc@durangolf.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/viera/golf/duran-golf-club/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "default-80@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "djt@durangolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "ejd@durangolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "info@durangolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "jpv@durangolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "mtm@durangolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "email": "travel@albrecht.de"
    }
  ],
  "mails": [
    "amn@durangolf.com",
    "bryan.ewart@golfosoyoos.com",
    "chosen-sprite@2x.png",
    "default-80@2x.png",
    "djt@durangolf.com",
    "ejd@durangolf.com",
    "fbmgr@golfosoyoos.com",
    "hcc@unitelc.com",
    "info@belfairsgolfclub.co.uk",
    "info@durangolf.com",
    "info@golfosoyoos.com",
    "info@peacockgapgolfclub.com",
    "jkb@durangolf.com",
    "jpv@durangolf.com",
    "jwc@durangolf.com",
    "matt.vincent@golfosoyoos.com",
    "mtm@durangolf.com",
    "proshop@dvforegolf.com",
    "publisher@golfbusinessnews.com",
    "ryan.dunkley@golfosoyoos.com",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "durangolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://golfrange.org/winners/duran-golf-club-7/",
      "text": "Duran Golf Club - Golf Range Association Home Golf Range Magazine Previous Issues Teaching Teaching & Training Aids Practice Player Development Fitting/Demo Operations Engagement Products Golf Range Magazine Email Best Practices GRAA Regional Boot Camps Supplier Directory Advertising Opportunities Awards 2024 GRAA Awards Archive 2023 GRAA Awards Archive 2022 GRAA Awards Archive 2021 GRAA Awards Archive 2020 GRAA Awards Archive 2019 GRAA Awards Archive 2018 GRAA Awards Archive 2017 GRAA Awards Archive 2016 GRAA Awards Archive 2015 GRAA Awards Archive 2014 GRAA Awards Archive 2013 GRAA Awards Archive 2012 GRAA Awards Archive Home Golf Range Magazine Previous Issues Teaching Teaching & Training Aids Practice Player Development Fitting/Demo Operations Engagement Products Golf Range Magazine Email Best Practices GRAA Regional Boot Camps Supplier Directory Advertising Opportunities Awards 2024 GRAA Awards Archive 2023 GRAA Awards Archive 2022 GRAA Awards Archive 2021 GRAA Awards Archive 2020 GRAA Awards Archive 2019 GRAA Awards Archive 2018 GRAA Awards Archive 2017 GRAA Awards Archive 2016 GRAA Awards Archive 2015 GRAA Awards Archive 2014 GRAA Awards Archive 2013 GRAA Awards Archive 2012 GRAA Awards Archive Duran Golf Club Duran Golf Club 7032 Stadium Pkwy Melbourne, Florida 32940 (321) 504-7776 http://www.durangolf.com djt@durangolf.com Watch the Video Facility Amenities: Grass Tees (50) Bays with Mats (30) Accurate Yardage Measurements on Tees to Targets Short Game Practice Area Lighting for Night Use Grass Putting Green Additional Amenities: Golf Shop (1500 sq. ft.) Food & Beverage Ball Flight Monitor Type of Range Targets: Flags Bunkers Built-up Greens 6 elevated target pitching nets PVC ground target hoops Instruction provided. Number of PGA Professional Instructors: 3 Clubfitting services provided. Total number of visits to range per year: 65,000 Number of range balls dispensed on range per year: 850,000 Number of range balls in inventory: 25,000 New balls are acquired: 5 times per year Best range promotion: Duran initiated Range membership bundles (Range and Par 3 membership) offering seasonal and annual programs for regulars and tourists. Programs include special rates for juniors and young executives. Our patrons have found great value in these memberships, and it has stimulated additional business at our facility. Many other monthly promotions are used, to include slower period buy one, get one, and promotions where juniors receive free product. WE also developed a partnership with a local new apartment complex, where all residents receive complimentary par 3 membership and free upgrade on range balls for a low monthly price! Special programs: Our PGA Professional Staff hosts two PGA Junior Golf Leagues per year, Middle School and High School Golf Leagues and Intramurals, {GA Drive. Chip, and Putt Qualifying Site, Host site of this years NJCAA Junior College National Golf Championship. Host of mens and womens college invitationals, . Duran also hosts complimentary clinics for local retirement community where they can either come to duran, or we go to visit their community. Duran hosts numerous charity golf fundraisers to assist locals raise money. GRAA Member Benefits Golf Range Magazine Email Best Practices Video Best Practices Supplier Directory Access to Preferred Vendors About the GRAA About Us Mission Statement Advisory Board Contact Us Privacy Policy Terms of Use Contact Us About Us Preferred Vendors Golf Range Association of America. All rights reserved."
    },
    {
      "url": "https://www.dvforegolf.com/contactus/",
      "text": "Contact Us - Deer Valley Golf Club Skip to primary navigation Skip to main content Deer Valley Golf Club Deer Grove, IL Home Book Tee Times Store About Us About Us Rates Course Photos Golf Shop Hours Email Club Membership Membership Information Corporate Events Bar & Grill Contact Contact Us Donation Request Contact Us Contact Us Deer Valley Golf Club 3298 Hoover Road Deer Grove, IL 61243 proshop@dvforegolf.com Tel: 815-438-4653 Book Your Next Round of Golf Online! BOOK YOUR TEE TIME Page Footer Contact Us Address : 3298 Hoover Road Deer Grove, IL 61243 Email : proshop@dvforegolf.com Phone : 815-438-4653 ex. 15 Join our E-Club Join Our Email Club! Please enable JavaScript in your browser to complete this form. Name: * Email: * Phone Number: * Send Me Text Messages Regarding Course Information. Please send me text messages regarding course information. Subject: Message: Email Submit Deer Valley Golf Club | 3298 Hoover Rd, Deer Grove, IL 61243 | (815) 438-4653 Copyright © 2025 Deer Valley Golf Club All Rights Reserved. Powered by 0 %"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "text": "Contact - Osoyoos Golf Club Skip to main content Skip to footer Book A Tee Time Member Ballot Desert Gold Park Meadows Golf Rates Lessons Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Dine & Events Our Club Contact Book A Tee Time Contact Us Let’s Talk Staff directory and contact information. Contact Information Location Osoyoos Golf Club 12300 Golf Course Drive Osoyoos, British Columbia Canada V0H 1V4 Phone (250) 495-7003 1-800-481-6665 Office Hours Monday – Friday: 8 AM – 4 PM Saturday, Sunday & Stat Holidays: Closed Staff Directory General Manager Bryan Ewart, NGCOA BC Chapter President General Manager T: 250-495-7003 Ext. 213 Golf Operations Matthew Vincent, PGA of Canada Member Head Golf Professional T: 250-495-7003  Ext. 212 Administration Susan Henry Finance Manager T: 250-495-7003 Ext. 215 Emilio Martinez Membership & Office Administration Coordinator T: 250-495-7003 Ext. 214 Course Maintenance Ryan Dunkley Course Superintendent T: 250-495-2323 Food & Beverage Alana Egli Food & Beverages Manager T: 250-495-7003 Ext. 221 Herman Subaru Executive Chef T: 250-495-7003 Ext. 216 Contact Us Complete our inquiry form and we’ll be in touch. Join Our Team We’re always looking for friendly, dedicated individuals who want to be part of a welcoming environment and help create unforgettable experiences for our members and guests. Please see the current job postings below: Finance & Human Resources Manager Apply Now Perched above Lake Osoyoos and sculpted into the desert bench, Osoyoos Golf Club offers a one-of-a-kind golf experience in an unforgettable setting. Every round is a postcard in the making. Subscribe to our Newsletter © 2025 Osoyoos Golf Club. All rights reserved. Privacy Policy. Website designed by Par Six Golf Media Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Apply Now Temporary Online Booking Outage Please note that our online booking system will be unavailable from July 9 to July 11, 2025 as we transition to a new booking and point of sale system. To book/request a tee time during this period, please call the Pro Shop directly at 250-495-7003 or 1-800-481-6665 extension #1. Our team will be available daily from dawn to dusk to assist with your reservation. Thank you for your patience and understanding! Home Golf Lessons Rates Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Member Ballot Desert Gold Park Meadows Book a Tee Time"
    },
    {
      "url": "https://durangolf.com/signature-membership/",
      "text": "Signature Membership - Duran Golf Club (321) 504-7776 [email protected] Facebook X Instagram Facebook X Instagram Home Course Info Development Centre Development Center Development Center Membership Chipper’s Walk Development Center Rates Smash Golf Golf Tip of the Month Club Fitting and Repair Tournaments Course Layout Scorecard Rates Dress Code Memberships Signature Membership Crown Players Pass Loyalty Rewards Academy Academy of Golf Adult Programs Junior Programs Instructors Lesson Rates & Packages Book a Lesson AimPoint Green Reading Trackman Weddings & Events Weddings & Events Host Your Wedding Hosting a Banquet or Event Wedding Testimonials Audubon Int’l Audubon Int’l Course Notes Restaurant Reservations Menus Order Food Contact Contact Us E-Club Sign Up Meet the Staff Careers Shop Online Select Page Duran Golf Club Become a Signature Member As a “Signature Club” patron, you will receive special benefits during program term as follows: (Junior and Young Professional included) Unlimited green fees on the 18 hole Duran Golf Club Championship Course (during program period) Unlimited green fees on the 9 hole Duran Golf Club Par 3 Course (during program period) Complimentary small warm-up bucket before round USGA Annual Handicap Service (available to Annual and Semi-Annual only) Loyalty points provided as a gift for purchase of membership Member plays at special “Crown Card Rate” when playing outside period Guests of member play at special rate when accompanied by member inside period 10% off regular priced in-stock merchandise in the Professional Golf Shop 10% off all food items for Signature Club Member and Spouse Pay with either Credit Card or Cash Special financing available to Annual and Semi-Annual Signature play options when purchasing with cash or check For pricing, please contact the golf shop at Call Duran Golf Club for information about the Signature Membership at (321) 504-7776, ext. 1, or email [email protected] . Duran Golf Club 7032 Stadium Parkway Viera, FL 32940 (321) 504-7776 [email protected] Follow Follow Follow © Copyright Duran Golf Club Website by Lightspeed"
    },
    {
      "url": "https://www.hole19golf.com/courses/duran-golf-club-par-3",
      "text": "Duran Golf Club (Par 3) - Golf Course Information | Hole19 Apps Discover Courses The 19th Hole Shop Sign In All courses ... Duran Golf Club (Par 3) All courses United States Florida Duran Golf Club (Par 3) Join 4.8M+ golfers worldwide today. Download now! Hole19 is the leading golf app for tracking scores, navigating courses with GPS precision, and unlocking performance insights. 4 Duran Golf Club (Par 3) Melbourne, FL, United States This course is mapped and available on Hole19 App Perfect for beginners and short game practice, Duran Golf Club Par 3 in Melbourne, Florida offers 9 scenic holes from 50 to 130 yards. Description The Duran Golf Club Par 3 Course in Florida offers a 9-hole layout perfect for golfers of all skill levels. Located in the heart of Melbourne, this charming course is ideal for a quick round, with holes ranging from 50 to 130 yards. The walkable design and compact layout make it particularly inviting for beginners, juniors, or anyone looking to fine-tune their short game. Nestled around the state-of-the-art practice range, the course showcases well-maintained greens and scenic surroundings. Golfers can also take advantage of Duran Golf Club's exceptional practice facilities, which include a full driving range, putting greens, and chipping areas. After your round, relax and refuel at the clubhouse, featuring a pro shop and a café with delicious menu options. Whether you're a local resident or visiting the vibrant Space Coast, the Duran Golf Club Par 3 Course is a must-play for a fun and affordable golf experience. Know Your Handicap at Duran Golf Club (Par 3) Calculate My Handicap Select Course Combination 9, 9 Holes Scorecard Tee Distance PAR CR SR yards 728 27 0 0 Leaderboard Loading Phone number +1 (321 *** *** Show more Email info@durangolf.com Where is it? Duran Golf Club, 7032 Stadium Parkway Viera,, FL 32940 Find similar golf courses. Get Hole19 App today. Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Closest courses You might want to consider playing other courses around the same area. Here are some of the closest: 4.5 Duran Golf Club (Championship) Melbourne, FL, United States 4.6 Indian River Colony Club Melbourne, FL, United States 4.2 Baytree National Golf Links Melbourne, FL, United States 4.5 Viera East Golf Club Rockledge, FL, United States 4.8 Suntree Country Club (Classic) Melbourne, FL, United States 5 Suntree Country Club (Challenge) Melbourne, FL, United States Discover Top Golf Courses with Hole19 App Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Download Hole19 now and elevate your golfing experience. However you play. Play More. Hole19 Golf App All features Apple Devices Android Devices Premium CORE Golf App All features Apple Devices For Golfers Shop Discover Courses HCP Calculator Glossary The 19th Hole All posts Hole19 News Courses Game improvement Reviews For Partners Advertise with us Press Kit About About Hole19 Careers Contacts Support Help Center Terms & Conditions Privacy Policy © 2025 H19 Ltd"
    },
    {
      "url": "https://www.peacockgapgolfclub.com/contact-us",
      "text": "Contact Us | Reach Out to Peacock Gap Golf Club for Inquiries and Assistance Skip to content Golf image-group Book Tee Time Rates and Scorecard Driving Range Tournaments Lessons link-group Annual Golf Pass NCGA Program Course Rules Golf Carts Pro Golf Tips FAQs Golf Instructors Event Venue image-group Weddings Business Meetings Conferences Social Events Facility Rental link-group Golf Events Capacity Chart FAQs RangeCafe image-group Menu Happy Hour Catering Services Events button-group Delivery Take-Out Gallery image-group Golf RangeCafe Event Venue About Us image-group About Peacock Gap Employment Opportunities Gift Cards Directions Contact Us Book Tee Time Start typing and press enter to search Search for: phone Home > Contact Us Contact Us Peacock Gap 333 Biscayne Drive, San Rafael, CA 99901 Get Direction Phone/Fax 415-453-4940 (P) 415-485-0743 (F) * First Name * Last Name * Email Phone * Area of Interest Area of Interest Golf Club The Clubhouse RangeCafe Comments Send Message Interested in learning more about our beautiful event space? Request Info right-arrow Golf Book Tee Time Rates and Scorecard Driving Range FAQ Annual Golf Pass Event Venue Weddings Business Meetings Facility Rental Conferences Social Events Capacity Chart RangeCafe Menu Order Online Catering Services Happy Hour Experiences Gift Cards Event Calendar Golf Tournaments Golf Lessons About About Peacock Gap Employment Opportunities Directions Contact Us Peacock Gap 333 BISCAYNE DRIVE SAN RAFAEL, CA 94901 Phone (415) 453-4940 Email info@peacockgapgolfclub.com @2025 All Rights Reserved. Terms of Use | Privacy Policy | Sitemap Stay Connected:"
    },
    {
      "url": "https://durangolf.com/meet-the-staff/",
      "text": "Meet the Staff - Duran Golf Club (321) 504-7776 [email protected] Facebook X Instagram Facebook X Instagram Home Course Info Development Centre Development Center Development Center Membership Chipper’s Walk Development Center Rates Smash Golf Golf Tip of the Month Club Fitting and Repair Tournaments Course Layout Scorecard Rates Dress Code Memberships Signature Membership Crown Players Pass Loyalty Rewards Academy Academy of Golf Adult Programs Junior Programs Instructors Lesson Rates & Packages Book a Lesson AimPoint Green Reading Trackman Weddings & Events Weddings & Events Host Your Wedding Hosting a Banquet or Event Wedding Testimonials Audubon Int’l Audubon Int’l Course Notes Restaurant Reservations Menus Order Food Contact Contact Us E-Club Sign Up Meet the Staff Careers Shop Online Select Page Duran Golf Club Here to serve you Jeff Von Eschen, General Manager Jeff has been at Duran since July 2004, and has been involved in the project since the construction and grow-in. Prior to employment at Duran; Jeff spent 15 years at various clubs in Florida and New York. Jeff attended State University of New York in Morrisville where he studied horticulture and landscape architecture before locating to Florida in 1997. His duties include direction of the Management Team, overall operational and fiscal responsibility for the Duran Golf Club, and to develop and ensure the club standards of service that will assure maximum customer satisfaction. Should you have any questions or comments that pertain to the golf course maintenance operations please feel free to contact Jeff at (321) 504-7776, ext. 7412 or email him at [email protected] . Christy Helton, Club Operations Manager Christy Helton joined the Duran Staff in March 2012. Prior to Duran, Christy’s background includes marketing for the home building industry and sports marketing for NASCAR. Christy graduated from Salisbury State University in Salisbury, Maryland, with a Bachelor’s Degree in Marketing, and happily calls Viera her home. She is responsible for assisting Duran’s championship golf facilities and restaurant, along with the coordination of all the membership maintenance. You can contact Christy at (321) 504-7776, ext. 7314 or via email at [email protected] . Jeff Turner, Head Golf Professional Jeff can be contacted at (321) 504-7776, ext. 7340 or email at [email protected] . Justin Blazer, Director of Instruction Originally from Yorktown, Virginia, Justin Blazer developed an interest in teaching golfers through the development of his own game. While Justin’s golfing journey began as a teenager, it always took a backseat to other sports. As a standout basketball player through college, Justin’s competitive spirit was fueled once again when he started regularly joining his college golf team practices. This led to Justin’s interest in golf instruction and, backed by the same competitive spirit that drove him in sports, he eventually became a PGA Class A Teaching Professional. Today, as part of his journey in the golf industry, Justin actively plays in PGA sectional events, with a dream to qualify for the PGA Professional National Championship. Justin’s true passion, however, lies in working with juniors and the growth of junior golf. As Director of Instruction at the Duran Academy of Golf, Justin has established a breadth of junior programs for newcomers and competitive players. Many of his juniors have had tremendous success and currently compete at an elite level such as the U.S. Kids World Championships and other premier junior golf championships. This work has not gone unnoticed, as Justin has been awarded a two-time U.S. Kids Golf Top 50 Teacher, which recognizes the top junior golf instructors in the country. Justin can be reached at (321) 504-7776, ext. 7460 or email at [email protected] . Ryan Rozic, Lead Instructor Ryan can be reached at (321) 504-7776, ext. 7460 or email at [email protected] . Drew Norman, Superintendent Drew has been with Duran Golf Club since September 2004, being a part of the construction and grow in of the course. Graduating locally from Rockledge High School, Drew obtained his Associate of Arts degree from Brevard Community College while working on the course as 2nd Assistant Superintendent. In 2008, Drew graduated from the University of Florida with a Bachelor’s Degree in Sports Management, and a Minor in Business Administration. In 2011, after spending 3 years as the Sports Director for a local YMCA, Drew followed his love of golf back to Duran Golf Club and rejoined the Duran staff as 1st Assistant Superintendent. Drew has over 16 plus years of experience on a golf course. Drew’s responsibilities at Duran are all turf related, all native areas, common areas, as well as both clubhouses. Should you have any questions or comments that pertain to the golf course maintenance operations please feel free to contact Drew at Call Drew Norman at (321) 504-7776, ext. 7410 or email him at [email protected] . Nicole Latner, Food and Events Manager Nicole Latner joined the Duran Staff in February of 2020. Prior to Duran, Nicole’s background includes marketing and special event management at Urban Air Adventure Park. Nicole graduated from the University of North Florida in 2013 with a Bachelor’s Degree in Marketing and International Business. After having lived in Jacksonville, FL for 9 years, she relocated back home to Viera with her husband and 3 children in 2017. Nicole will be responsible for marketing and coordinating all wedding, banquet and special events at Duran, as well as developing new relationships in the community. You can contact Nicole at (321) 504-7776, ext. 7300 or via email at [email protected] . Joy Gaskin, Chef (321) 504-7776, ext. 7371 or via email at [email protected] . John Madden, Development Center Lead John joined the staff at Duran in June 2020. He was born in New Fairfield, CT, and currently living in Bayside Lakes. He attended Melbourne High School and Brevard Community College, then played some tournaments on the Florida mini tour. He left golf and worked for Publix for 27 years as the meat manager but decided golf was his passion. He pursued a career in golf where he worked at a private club in Vero Beach, FL, prior coming to Duran. John is married with 4 kids and 3 grandkids. John is responsible for the daily activities at the Development Center. He also compled the Callaway University program gaining a certificate as a certified club fitter. He has hopes of joining the golf university program and gaining PGA status. You can contact John at (321) 504-7776, ext. 7470 or via email at [email protected] . Duran Golf Club 7032 Stadium Parkway Viera, FL 32940 (321) 504-7776 [email protected] Follow Follow Follow © Copyright Duran Golf Club Website by Lightspeed"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "text": "Contact Us - Headwaters Golf Club Skip to main content Skip to footer Headwaters Golf Club Park Rapids, MN Home Tee Times Tee Times Member Tee Times Rates Membership Club Info Lessons Scorecard Driving Range Pro Shop E-Club Sign Up Headwaters Code of Conduct Outdoor Patio Events Upcoming Events Mens League Women’s League Junior Golf Gallery Flyover Contact Us Apply Contact Us Headwaters Golf Club P.O. Box 9 20018 County Road 1 Park Rapids, MN 56470 Telephone: 218-732-4832 Toll free: 866-250-4224 Maintenance: 218-732-3153 Email: hcc@unitelc.com View Larger Map Contact Form Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Website Submit Footer Copyright © 2025 Headwaters Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/viera/american-cuisine/tradewinds-restaurant-at-duran-golf-club/",
      "text": "Tradewinds Restaurant at Duran Golf Club - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Tradewinds Restaurant at Duran Golf Club Add to Wishlist Tradewinds Restaurant at Duran Golf Club Overlooking the sparkling lakes and beautifully manicured greens at Duran Golf Club, Tradewinds Restaurant proudly offers a full service bar and a menu serving traditional American fare. Indoor and outdoor seating gives you the perfect view whether grabbing lunch after a round of golf or enjoying a nice early evening out to enjoy dinner. Add to Trip Visit Website Direction 7032 Stadium Pkwy, Melbourne, FL 32940 Contact (321) 504-7771 Discover More nearViera All Hotels Restaurants Events Add to Wishlist Urban Prime Marketplace & Restaurant Viera Celebrate the season’s bounty with Urban Prime’s Harvest Prix Fixe Menu! Prepared by the passionate Prime Team culinary artists, this menu uses autumn harvest to turn the finest ingredients into seasonal delicacies. With a bite of squash and dash of pumpkin spice, every night can be PRIMETIME. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera Melbourne and the Beaches A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your… Add to Trip Add to Wishlist Pacha Kava Lounge Viera Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly… Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Viera Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and… Add to Trip Add to Wishlist Viera Park Market & Food Trucks Viera Every 1st Friday of each month the Viera Park Market offers food trucks from 4 pm – 8:00 pm along with fresh foods, plants, handcrafted items, baked goods & more. Support Small Local Businesses and Local Artists at this incredible community event. When: 1st Friday of every month 4 pm-8… Add to Trip Add to Wishlist BeachFly Brewing Company Viera Rockledge’s only brewery, was created by mother/son team Lisa Freismuth and Zach Featherstone. Beer is in their blood – Lisa great-great-great-grandfather, Florentz Freismuth, was a brewer in Germany in the 1800’s. BeachFly’s core beers on tap are a tropical twist to the classic styles and the rotating selection, using locally… Add to Trip Add to Wishlist Avid Hotel Melbourne Viera Melbourne and the Beaches Welcome to the brand new Avid Melbourne – Viera. Our new hotel is located directly off of I-95 set in the heart of Florida’s Space Coast. We are conveniently located only minutes from Florida Institute of Technology, Holmes Regional Medical Center, Wuesthoff Medical Center, and General Electric. Avid Melbourne –… Add to Trip Add to Wishlist Lawndale Viera Lawndale is a restored Victorian home that has been furnished as a family home of 1895. It offers visitors a chance to experience what it was like to live in Central Florida in the late 1800’s. Docent in period dress guide you through the house telling you the history of… Add to Trip Add to Wishlist The Bonsai – A modern motor court Viera Cute & locally-owned 10 room motor court. It has been freshly remodeled, updated to current times, and is very clean! Located just a short walk from the National Scenic Byway, Indian River lagoon. One can take scenic walks and/or bike rides along the beautiful Indian River. 10-minute drive to the… Add to Trip Add to Wishlist Route 7 Adrenaline Warehouse Viera Route 7 Adrenaline Warehouse is a premiere family entertainment center located in Florida’s iconic Space Coast. Our 60,000 square foot facility in the historic FLORIDA TODAY building was intricately curated with one thing in mind: total, absolute, and mind-blowing FUN. The vision for Route 7 Adrenaline Warehouse is to be… Add to Trip Add to Wishlist Dingers Training Center Viera Dingers Training Center is an indoor training center located in the heart of Rockledge Florida just 1 mile from the Highway I-95 exit. Dingers was designed with a strong vision of creating a better training facility for all baseball and softball players to feel comfortable while they work on developing… Add to Trip Add to Wishlist Taj: Modern Indian Cuisine Viera Taj was started by a group of best friends who had a vision to create a restaurant, which would help take away the many stigmas surrounding Indian food and make it more relatable to western society. However, they wanted to do so, while preserving the beautiful culture and authenticity of… Add to Trip Add to Wishlist Country Cookin Diner – Rockledge Viera Great Food prepared Country Family Style. You won’t be disappointed with our large portions and selection of meals and homemade pies and desserts. A good breakfast place as well as lunch and dinner. If “Home Style” food is what your hungry for, stop by to see us and bring your… Add to Trip Add to Wishlist Le Crave Cafe Viera Le Crave is focused on providing delectable crêpes, delicious coffees and teas, and other unique menu specialties not readily available at most other chain restaurants. Our sweet and savory crepes, and many of the other items on our menu were developed by the owners of Le Crave. Our house coffee… Add to Trip Add to Wishlist La Quinta Inn & Suites Melbourne Viera Enjoy the warm sunshine, swaying palm trees, and ample amenities at this hotel, located just minutes from restaurants, shopping at Melbourne Square, white sand beaches and many local area attractions. Unwind in one of our non-smoking guest rooms, featuring a flat-screen HDTV, mini-refrigerator, microwave, desk, coffee maker, ironing amenities and… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Email This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://golfbusinessnews.com/news/corporate/duran-group-takes-over-ngsa-and-gch/",
      "text": "Golf Business News -\r\n\t\t\tDuran Group Takes Over NGSA and GCH Global Edition News GOOD Directory Diary Golf Jobs About GBN.com Duran Group Takes Over NGSA and GCH 10.17am 5th January 2016\t - Corporate In a private transaction, the Duran Group has acquired the largest sales representative organization in the golf industry, the National Golf Sales Representatives Association (NGSA), together with Golf Clearing House. The NGSA has 3400 Sales Representative Members and over 400 Manufacturer Members. The organization was founded in 1987 by the late Tom Moynihan, who passed away in September 2015. “Over the past 27 years and 27 Orlando PGA Shows, I’ve always looked forward to seeing Tom Moynihan, and all of us who were touched by Tom will miss him dearly” stated Tony Duran, President and Founder of The Duran Group. “Over the past couple decades, Tom and I had many discussions on ways to improve the Sales Representative profession in the Golf Industry, and we are looking forward continuing with this important mission at a crucial time in the golf market.” Pamela Nichols, the sister of Tom Moynihan assumed control of the NGSA and GCH upon Tom’s passing, and her golf industry advisers strongly recommended The Duran Group for running the organization going forward. “We researched many options for continuing operations with the NGSA and GCH, and we selected The Duran Group to continue with Tom’s vision and lead the organization in the future,” she said. The NGSA will be in a meeting room (Room W107) at the upcoming 2016 PGA Merchandise Show , which is located one floor below the PGA Booth Exhibitor level near the PGA Educational Conferences. The 2016 Orlando PGA Show is from January 27th through January 29th, 2016 at the Orlando Convention Center. “We have considerable work ahead to improve the benefits for NGSA Members, and I look forward to receiving lots of feedback from Sales Representatives nationwide during the week of the show,” stated Tony Duran. The NGSA and GCH is based in Scottsdale, AZ. Headquartered in Orange County, CA, The Duran Group is the largest sales and marketing firm in golf. Developing and managing sales teams and executing marketing campaigns over the past 25 years, The Duran Group has been an integral part of the growth of over 50 golf companies, including the development of several new categories in golf such as plastic spikes, hybrid clubs, hand-held GPS, robotic bag carts and single rider standing electric golf carts. Duran Group durangroup.com What did you think of this article? Share your thoughts 👍 👎 Well written Informative Enjoyable Helpful Thought provoking Write your own ✏️ Factual errors Poorly written Misleading Not useful Not suitable for GolfBusinessNews Learn nothing new Write your own ✏️ Share feedback → Your feedback will be used in accordance with our Privacy Policy . 70 GOOD Directory Updates Bailoy Products Ltd Bradshaw Electric Vehicles (Official Club Car Dealer) Ground2Control Huxley Golf Intuitive Edge Marketing John Greasley Limited Seventy2 Golf Simon Gidman Golf Course Architects Skyhawke Technologies UK (SkyCaddie and SkyTrak) Syngenta Lobb + Partners ZEN GREEN STAGE Latest Golf Industry News Property Formby Hall seeks public investors to fund redevelopment plans 10-09-2025 The owners of Formby Hall Golf Resort and Spa in Lancashire have announced plans to open up the business for public investment to help drive an expansion project. Practice Range & Teaching Inrange expands into Benelux countries 10-09-2025 Ball-tracking technology company Inrange is expanding across Belgium and the wider Benelux region. Sponsorship & Events DP World Tour unveils 2026 tournament schedule 10-09-2025 An increase in the total prize fund and a reduction in the number of tour cards available to be retained have been revealed by the DP World Tour for next year's schedule. Share GolfBusinessNews Share on Twitter Share on LinkedIn Duran Group / Golf Clearing House / National Golf Sales Representatives Association / Pamela Nichols / pga merchandise show / Tom Moynihan / Tony Duran In related news... PAYNTR Golf acquires IP rights Hassall and General Abdulla to Assume APGC Reins 59club partners with platform specialist Zen Golf DETAILS adds Troia to Portuguese portfolio GolfBusinessNews.com (GBN) is for the many thousands of people who work in the golf business all around the world. We cover the full range of topics both on and off the course. We aim to supply essential information both quickly and accurately in a format which is easy to use. We are independent of all special interest groups. Subscribe Click here to sign up for our free twice weekly golf industry news summary View the latest newsletter here GBN Archives Sep Aug Jul Jun May Apr Mar Feb Jan 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 Contact Information 5/7 High Street Dorchester-on-Thames Oxfordshire OX10 7HH United Kingdom publisher@golfbusinessnews.com © 1999-2025 e.GolfBusiness.com Limited | All Rights Reserved. | GBN Privacy Policy"
    },
    {
      "url": "https://durangolf.com/instructors/",
      "text": "Instructors - Duran Golf Club (321) 504-7776 [email protected] Facebook X Instagram Facebook X Instagram Home Course Info Development Centre Development Center Development Center Membership Chipper’s Walk Development Center Rates Smash Golf Golf Tip of the Month Club Fitting and Repair Tournaments Course Layout Scorecard Rates Dress Code Memberships Signature Membership Crown Players Pass Loyalty Rewards Academy Academy of Golf Adult Programs Junior Programs Instructors Lesson Rates & Packages Book a Lesson AimPoint Green Reading Trackman Weddings & Events Weddings & Events Host Your Wedding Hosting a Banquet or Event Wedding Testimonials Audubon Int’l Audubon Int’l Course Notes Restaurant Reservations Menus Order Food Contact Contact Us E-Club Sign Up Meet the Staff Careers Shop Online Select Page Duran Golf Club Learn from the Best in Brevard The Duran Academy of Golf Instructional Staff at Duran Golf Club realize each and every golfer responds to different educational approaches. Our Golf Professional Staff will develop a curriculum tailored to each individual student, based on athleticism, current level of play, specific goals, and the time available to reach those goals. The staff at Duran believes in providing students with the understanding of Golf’s “fundamentals.” With that knowledge, students better understand relationships between grip, posture, alignment and swing motion. Justin Blazer - PGA, Director of Instruction Originally from Yorktown, Virginia, Justin Blazer developed an interest in teaching golfers through the development of his own game. While Justin’s golfing journey began as a teenager, it always took a backseat to other sports. As a standout basketball player through college, Justin’s competitive spirit was fueled once again when he started regularly joining his college golf team practices. This led to Justin’s interest in golf instruction and, backed by the same competitive spirit that drove him in sports, he eventually became a PGA Class A Teaching Professional. Today, as part of his journey in the golf industry, Justin actively plays in PGA sectional events, with a dream to qualify for the PGA Professional National Championship. Justin’s true passion, however, lies in working with juniors and the growth of junior golf. As Director of Instruction at the Duran Academy of Golf, Justin has established a breadth of junior programs for newcomers and competitive players. Many of his juniors have had tremendous success and currently compete at an elite level such as the U.S. Kids World Championships and other premier junior golf championships. This work has not gone unnoticed, as Justin has been awarded a two-time U.S. Kids Golf Top 50 Teacher, which recognizes the top junior golf instructors in the country. Justin has also worked with many LPGA and Senior Tour players as their putting and short game instructor, including Sir Nick Faldo. He has also caddied in multiple tour events and Q-schools for some of his students as a result of his expertise in green reading, tournament preparation and on-course strategy. Justin has appeared in instructional videos on Golfweek.com and FoxSports.com and other popular publications and blogs. He also serves as both a U.S. Kids Golf certified instructor specializing in teaching, fitting and competition for ages 6-12. Additionally, he is 1 of only 14 Aimpoint Certified Level 2 Instructors in the world, which enables Justin to teach students on the finer points of putting, including how to read greens and accurately predict break. Justin earned a degree in Recreation and Leisure Studies with a focus in Recreational Programming, Leadership and Coaching from Virginia Wesleyan College. Click here to book a private lesson. Ryan Rozic - Academy Instructor Ryan Rozic was born and raised in Melbourne, Florida.  Throughout his childhood, he played many sports including baseball, basketball, and golf.  However, Ryan’s main focus was on playing baseball and he would only play golf in the summertime with his dad. But when Ryan turned 14, he and his parents decided to fully pursue golf. But not long after this decision, Ryan fell in love with the game. As a junior golfer, Ryan played for Viera High School where he was a four-year varsity letterman. During his career, the Viera Hawks made two State championship appearances.  Outside of high school golf, Ryan played many local and state-wide junior events as he pursued his goal of being a college golfer. Ryan went on to play two years at Eastern Florida State College. In his time as a Titan, Ryan participated in two national championships.   He was named to the All-District team and a semi-finalist for the Jack Nicklaus Award his sophomore year. Ryan transferred to Trevecca Nazarene University and played three more years of college golf at the NCAA Division 2 level.  In his junior year, he won his first college event in a playoff at the Music City invitational and his team was the first team in school history to go to a national championship in the D2 era. In his final season, Ryan went on to win two events, one of which was the Great Midwest Athletic Conference Championship. Rozic has the 2nd lowest career average (72.84) in program history … his three career wins are fourth-most in school history … finished his career with 33 par-or-better rounds, second-most in school history … his 201 career birdies rank him fourth all-time. He graduated with a Bachelors degree in Accounting and earned his Masters in Business Administration with a concentration in Data Analytics. Following college, Ryan caddied for local tour pro and friend, Mickey DeMorat on the Korn Ferry Tour for the summer 2021 season and teammate, Blain Turner in the 2022 US Amateur.  Ryan has also worked as the assistant coach for the Men’s and Ladies Golf teams at Eastern Florida State College under his former college coach, Jamie Howell. While pursuing this opportunity, Ryan was assured that he wanted to be a golf instructor and help golfers achieve their personal goals. He is currently enrolled in the PGA Apprentice Program working to become a Class A PGA Professional. Click here to book a private lesson. Kyle DeCenzo - Academy Instructor Kyle DeCenzo was born in Framingham, Massachusetts and moved to Viera in 2007. He was a baseball player growing up until halfway through his freshman year of high school he decided to give golf a try. With six months until tryouts for the high school golf team, Kyle went on to take lessons and play in junior tournaments for the first time. While attending Viera High School, Kyle played for the golf team his sophomore through senior year and became a three-year varsity letterman. After graduating high school, Kyle started his college golf career at Eastern Florida State College. He played there from 2016 to 2018 earning All-Academic second team both years. After his two years at EFSC he then transferred to play golf for Florida Tech. During his time at Florida Tech, Kyle had a scoring average of 73.5, was a two-time Cleveland/Srixon All-American Scholar and got his bachelor’s degree in business administration. Towards the end of his senior season at Florida Tech, the remainder of the season got cancelled due to Covid, granting all college athletes that year to have an extra year of eligibility. After playing locally for high school and college golf, Kyle decided to take his eligibility to Delta State in Mississippi. During his final college golf season, Kyle averaged a 72.9 and got his MBA in General Business. Locally, Kyle is a 4-time winner of two local amateur tournaments. He won the Space Coast Amateur at Duran Golf Club in 2018 and 2021 and won the Platinum Coast at Rockledge Country Club in 2018 and 2020. During the Platinum Coast in 2020, Kyle shot career low tournament round 64. Professionally, Kyle has played in 13 OGA tour events since November 2022, has won two events and posted a 71.0 scoring average. Recently, he has enrolled in the PGA Apprentice Program and is working towards becoming a Class A PGA Professional. Being an academy instructor at Duran, his goal is to give back to the local golf community that has done so much for him over the past 10 years. Kyle will also continue to play in PGA section events and other professional tournaments. Click here to book a private lesson. Duran Golf Club 7032 Stadium Parkway Viera, FL 32940 (321) 504-7776 [email protected] Follow Follow Follow © Copyright Duran Golf Club Website by Lightspeed"
    },
    {
      "url": "https://spacecoastgolf.com/news/duran-news",
      "text": "Duran News :: Space Coast Golf Book a vacation Courses The Orbit Card Book a vacation Courses The Orbit Card Home Courses Cocoa Beach Country Club Duran Golf Club Rockledge Country Club Savannahs Golf Club Viera East Golf Club Book a Tee Time Book a Vacation Hilton Cocoa Beach Crowne Plaza Oceanfront Local Golf Instruction Tournaments Local Flavor To Do To See To Eat & Drink Space Launches Area History News Duran News Rockledge News Savannahs News Links Contact Us Newsletter Sign Up Duran - Update Duran Golf Club was voted \"Best Public Golf Club\" by Hometown News readers in the communities of Indialantic, Melbourne, Palm Bay, Rockledge, Suntree, Viera & Cocoa.  Also voted \"Best Public Golf Club\" by Florida Today readers and Top 50 Range in the Country by GRAA for the 4th year in a row! FootGolf! We are VERY excited to announce a new sport and activity that we are offering at our Development Center!  A combination of soccer and golf on the Par 3 Course!  You can bring your own soccer ball or rent one from the course.  Play day or night all week long! Awards: Duran Golf Club has been selected as the 2019 Best Public Golf by Hometown News Readers and Florida Today readers.  Duran also received the 2019 Golf Range Association of America Top 50 Range in the Public Category. Book the Tradewinds for Your Next Party! : Don’t miss out on the opportunity to book your favorite venue for your corporate or personal gathering- whether it is a black tie event or company luncheon and anything in between.  Email jwc@durangolf.com to request more information. Learn from the best : The Duran Academy of Golf welcomes you to learn from the best! Contact Director of Instruction Justin Blazer to learn about individual and group programs for juniors, beginners, women and men; as well as clinics and schools. Start your game improvement with a visit to our Academy today. Junior Development Program: The concept will offer juniors a “learn prior to play” approach, focused on developing not only the juniors playing skills, but rules and game understanding, and character development. Juniors will be broken into one of four age groups, starting at age 5 and running through high school. The program will offer 5 levels of development, each requiring passing an evaluation to move on to the next level. Click here for more information. Men and Women Leagues: To really improve your game, you need to play regularly. There are several league opportunities open right here at Duran Golf Club. Duran offers morning and afternoon leagues on our championship course, and numerous leagues on the Par 3 course to include Night-time leagues for men, ladies, and couples. For more information about leagues and professional instruction, simply ask to speak with someone in our Golf Shop. Click here for more information. Retired & Active Personnel Special Rates: Did you know that Duran now offers special rates to all personnel from the following professions: Police, Fire, Military, Paramedic and Teacher. It's a small token of our appreciation for all the hard work that you've done for this country over many years. Book a tee time online www.durangolf.com or speak with a member of the golf shop staff today. Referral Program: Duran will reward you with free golf for referring your friends to the best golf membership on the Space Coast! Can you afford not to refer your friends? Click here for more information. Hospitality Industry Summer Promotion: Are you an employee of the hospitality industry? If so, we have a deal for you! Duran is offering FREE Green Fees on Monday’s from May 1 to October 31, 2018 to all employees of food and beverage, hotel, bar, and attraction industries. Electric cart required. Special rates offered on other weekday play. Come enjoy summer on the golf course! For more information about this promotion, simply ask to speak with a member of our Golf Staff. Loyalty Rewards: Not a Loyalty Rewards Member?  You're missing out!  You can earn points on all your purchases at the club, and redeem those points for free food, drink, golf and merchandise!  Ask a member of the staff how to sign up! Click here for more information . Book Your Tee Time at Duran Online 24 hours a day. Click here Home Courses Book a Vacation Local Golf Local Flavor News Links Contact Us FLORIDA SPACECOAST GOLF ASSOCIATION P.O. BOX 560457 ROCKLEDGE, FL 32956 Site Designed Maintained by Legendary Marketing"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/viera/golf/duran-golf-club/",
      "text": "Duran Golf Club - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Duran Golf Club Add to Wishlist Duran Golf Club Golfers travel to Viera, Florida to play the best public golf course in the area. Voted “Best Public Course” and Top 50 in the country for practice ranges, Duran Golf Club defines “Great Golfing Experience” to those who live for golf. This course is equally maintained to the condition of a championship course to provide you with exceptional practice and playing course conditions. The short course along with the expansive practice greens allow you the ultimate environment to improve your short game while working on putting, chipping and pitching. To prove that it can get even better than that, the entire 30-acre facility is illuminated, allowing you to practice and play right into the evening hours. Also, tee times can be booked 24 hours a day at your convenience, up to 60 days in advance. Add to Trip Visit Website Direction 7032 Stadium Parkway Viera, FL 32940 Contact (321) 504-7776 Discover More nearViera All Hotels Restaurants Events Add to Wishlist Urban Prime Marketplace & Restaurant Viera Celebrate the season’s bounty with Urban Prime’s Harvest Prix Fixe Menu! Prepared by the passionate Prime Team culinary artists, this menu uses autumn harvest to turn the finest ingredients into seasonal delicacies. With a bite of squash and dash of pumpkin spice, every night can be PRIMETIME. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera Melbourne and the Beaches A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your… Add to Trip Add to Wishlist Pacha Kava Lounge Viera Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly… Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Viera Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and… Add to Trip Add to Wishlist Viera Park Market & Food Trucks Viera Every 1st Friday of each month the Viera Park Market offers food trucks from 4 pm – 8:00 pm along with fresh foods, plants, handcrafted items, baked goods & more. Support Small Local Businesses and Local Artists at this incredible community event. When: 1st Friday of every month 4 pm-8… Add to Trip Add to Wishlist BeachFly Brewing Company Viera Rockledge’s only brewery, was created by mother/son team Lisa Freismuth and Zach Featherstone. Beer is in their blood – Lisa great-great-great-grandfather, Florentz Freismuth, was a brewer in Germany in the 1800’s. BeachFly’s core beers on tap are a tropical twist to the classic styles and the rotating selection, using locally… Add to Trip Add to Wishlist Avid Hotel Melbourne Viera Melbourne and the Beaches Welcome to the brand new Avid Melbourne – Viera. Our new hotel is located directly off of I-95 set in the heart of Florida’s Space Coast. We are conveniently located only minutes from Florida Institute of Technology, Holmes Regional Medical Center, Wuesthoff Medical Center, and General Electric. Avid Melbourne –… Add to Trip Add to Wishlist Lawndale Viera Lawndale is a restored Victorian home that has been furnished as a family home of 1895. It offers visitors a chance to experience what it was like to live in Central Florida in the late 1800’s. Docent in period dress guide you through the house telling you the history of… Add to Trip Add to Wishlist The Bonsai – A modern motor court Viera Cute & locally-owned 10 room motor court. It has been freshly remodeled, updated to current times, and is very clean! Located just a short walk from the National Scenic Byway, Indian River lagoon. One can take scenic walks and/or bike rides along the beautiful Indian River. 10-minute drive to the… Add to Trip Add to Wishlist Route 7 Adrenaline Warehouse Viera Route 7 Adrenaline Warehouse is a premiere family entertainment center located in Florida’s iconic Space Coast. Our 60,000 square foot facility in the historic FLORIDA TODAY building was intricately curated with one thing in mind: total, absolute, and mind-blowing FUN. The vision for Route 7 Adrenaline Warehouse is to be… Add to Trip Add to Wishlist Dingers Training Center Viera Dingers Training Center is an indoor training center located in the heart of Rockledge Florida just 1 mile from the Highway I-95 exit. Dingers was designed with a strong vision of creating a better training facility for all baseball and softball players to feel comfortable while they work on developing… Add to Trip Add to Wishlist Taj: Modern Indian Cuisine Viera Taj was started by a group of best friends who had a vision to create a restaurant, which would help take away the many stigmas surrounding Indian food and make it more relatable to western society. However, they wanted to do so, while preserving the beautiful culture and authenticity of… Add to Trip Add to Wishlist Country Cookin Diner – Rockledge Viera Great Food prepared Country Family Style. You won’t be disappointed with our large portions and selection of meals and homemade pies and desserts. A good breakfast place as well as lunch and dinner. If “Home Style” food is what your hungry for, stop by to see us and bring your… Add to Trip Add to Wishlist Le Crave Cafe Viera Le Crave is focused on providing delectable crêpes, delicious coffees and teas, and other unique menu specialties not readily available at most other chain restaurants. Our sweet and savory crepes, and many of the other items on our menu were developed by the owners of Le Crave. Our house coffee… Add to Trip Add to Wishlist Duran Golf Club Viera Golfers travel to Viera, Florida to play the best public golf course in the area. Voted “Best Public Course” and Top 50 in the country for practice ranges, Duran Golf Club defines “Great Golfing Experience” to those who live for golf. This course is equally maintained to the condition of… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Email This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.1golf.eu/en/club/duran-golf-club/",
      "text": "Duran Golf Club, Viera, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Duran Golf Club 18 Hole Public Overview Courses Visitors Prices Amenities Club Reviews Duran Golf Club 7032 Stadium Pkwy, Viera, FL 32940-8011, USA Phone: +1 321-504-7776 , Fax: +1 321-504-7715 djt@durangolf.com www.durangolf.com Map Save Share 4.5 of 5 stars 2 Reviews “ Beautiful Course Near the Florida Coast ” 10/2012 Courses 18-Hole Duran Championship Course 9-Hole Duran Short Par 3 Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Characteristics The Duran Golf Club is a world class golf masterpiece located on Central Florida's East coast. This wonderful facility was designed by Florida Architect Lewis “Chip” Powell, and was opened in 2005. Constant coastal breezes, mild mounding, native grasses, and beautiful swaying palms will set the ambiance of an elegant course accented with link characteristics. Spreading out over 160 magnificently manicured acres with pristine lake views on 14 holes, this exceptional par 72 layout will feature five sets of tees and yardage ranging from 5,265 yards to a stout 7,151 yards. True putting tiff-eagle greens and large chipping areas will require golfers to utilize their skills and imagination for scoring opportunities. One of the most unique features of Duran Golf Club is the “State-of-the-Art” Development Center that offers an expansive practice range with teeing areas at both ends of the facility. A nine-hole “Par 3 Course” encircles the practice facility, which is perfect for all skill levels of golfers wanting to learn or develop their short game. Best of all, this facility is illuminated, allowing you to practice into the evening hours. Academy instructors are available year round for individual or group sessions. Adjacent to the state-of-the-art learning center is the clubhouse, featuring the Professional Golf Shop that offers a complete line of golf equipment to golf wear, and the Tradewinds restaurant, a full service dining facility with bar. This magnificent structure reflects the architecture and lifestyle of the British West Indies. Stepping onto the grounds will feel like taking a vacation to a wonderful tropical retreat. Duran Golf Club defines “Great Golfing Experience” to those who live for golf. Courses 18-Hole Duran Championship Course Opened in 2005. Design: Chip Powell . Style: Links. Terrain: Slightly undulating with water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Black (Men) 72 74 132 7151 yards Gold (Men) 72 72 127 6781 yards Blue (Men) 72 69.4 120 6301 yards White (Men) 72 66.5 113 5873 yards White (Women) 72 73.7 127 5873 yards Red (Women) 72 70.1 120 5269 yards 9-Hole Duran Short Par 3 Course Opened in 2006. Design: Chip Powell . Style: Links. Terrain: Slightly undulating with water hazards Scorecard Tee Par CR Slope Length Gold (Men) 27 - - 1594 yards Gold (Women) 27 - - 1594 yards Practice Facilities Driving Range (30 tees) Putting Green Pitching Green Chipping Green Practice bunker 3-Hole short course Visitors Both Courses Visitors are welcome every day. Etiquette Softspikes required. No dogs allowed. Mobile phone permitted on course. GPS devices approved. Welcome Green Fees Driving Range Monday - Sunday Rangefee $25 (21 €) Bucket (30 balls) $3.5 (3 €) Amenities Club Amenities Clubhouse Club accepts credit cards Bar Snack Bar Beverage Cart Restaurant Tradewinds Phone: 321-504-7776 x 2, Fax: 321-504-7715 info@durangolf.com Credit cards accepted. Pro Shop Duran Golf Club Phone: 321-504-7776, Fax: 321-504-7715 info@durangolf.com Rentals Clubs for hire Trolley for hire Electro-cart for hire Golf tuition Duran Academy of Golf Phone: 321-504-7776 # 7460, Fax: 321-504-7715 djt@durangolf.com www.durangolf.com The Club General Information Founded : 2005 Membership : Available Personnel Title Name Club Manager David Tomczak 321-504-7776 #7310 E-mail Head Pro Matt Morrison 321-504-7776 x1 E-mail Head Greenkeeper Jeff Von Eschen 321-504-7776 #7412 E-mail Restaurant Manager Ed Diaz 321-504-7776 x2 E-mail Enlarge / get directions Nearby Courses Indian River Colony Club Viera (Melbourne) (2.8 km) 18 Hole Baytree National Golf Links Melbourne (3.5 km) 18 Hole 19-21 € / 18 Holes Viera East GC Viera (4.5 km) 4.0 of 5 stars (1) 18 Hole 21 € / 18 Holes See all User Reviews 4.5 of 5 stars 2 Reviews 5 Stars: 1 4 Stars: 1 3 Stars: 0 2 Stars: 0 1 star: 0 Write a Review Most Recent Reviews gator333 1 Review Beautiful Course Near the Florida Coast 5.0 of 5 stars Reviewed October 31, 2012 Amazing layout for golfers of all skill levels and ages. This is a true Florida golf course that is on a level with some of the nicest courses I've played in the state. From the grasses to the gorgeous lakes, you'll feel like you get the full Florida experience. One of the things I love is that you can play from multiple tee boxes round after round and feel like you're playing a completely different course each time. The practice range is like one I've never seen before. It has a dual sided driving range with a par 3 course and chipping area. The restaurant features excellent food and the bar serves local brews as well. lunatic 54 Reviews Automatic translation Original version Very good public course 4.0 of 5 stars Reviewed November 18, 2021 Very good condition. You play practically all the time between a settlement and a lot of water on the other side. The landscape is therefore not as great as other places. But there is still a lot of wildlife on the course. We even saw a bald eagle fishing. The greens are quite agile and challenging. Fairways and tea boxes in good condition. The game was a bit slow because there are many retirees who are slow despite the cart. At 66 USD, a bit more expensive than the other public courses I've played nearby. Translated by Google . Been to Duran Golf Club ? Share your experiences! Write a Review See all reviews Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    }
  ]
}