{
  "fuentes": [
    {
      "url": "https://www.taphunter.com/location/dylans-draft-house/6371824454074368",
      "email": "appicon-60@2x.png"
    },
    {
      "url": "https://www.taphunter.com/location/dylans-draft-house/6371824454074368",
      "email": "appicon-76@2x.png"
    },
    {
      "url": "https://www.taphunter.com/location/dylans-draft-house/6371824454074368",
      "email": "info@taphunter.com"
    },
    {
      "url": "https://variety.com/2022/film/news/drafthouse-films-giant-pictures-1235199895/",
      "email": "obits@variety.com"
    }
  ],
  "mails": [
    "appicon-60@2x.png",
    "appicon-76@2x.png",
    "info@taphunter.com",
    "obits@variety.com"
  ],
  "nombre_sitio": "dylansdrafthouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.taphunter.com/location/dylans-draft-house/6371824454074368",
      "text": "Dylan's Draft House - Restaurant in Central Naples, Naples - Menu - TapHunter Get listed on TapHunter! FREE for 60 days for a limited time. Get Started! Toggle navigation Find: Near: Places Beer Breweries Wine Spirits Cocktails Events Log In Sign Up Dylan's Draft House Restaurant Hours today: 11:00am - 2:00am Follow Click to claim: Half Price App With Purchase Of A Flight A Great Place To Go... An Awesome Place To Be... A Hard Place To Leave! Updated a week ago 1258 Airport Pulling Rd N, Naples, FL (Central Naples) (239) 300-0192 Beer Flights Food On-Site Free Wifi Gluten Free Beer Available Happy Hour Tap Bottle/Can Wine On Deck Tap List - 27 8th Wonder Beach Break Swellberry THC Seltzer THC Infused Seltzer 8th Wonder Brewing Company Houston, TX A sparkling beverage infused with THC, the primary psychoactive compound found in cannabis. Unlike traditional alcoholic drinks, THC seltzers offer a unique way to relax and unwind without the effects of alcohol. 8th Wonder Howdy Lemonade THC Infused Seltzer 8th Wonder Brewing Company Houston, TX A sparkling beverage infused with THC, the primary psychoactive compound found in cannabis. Unlike traditional alcoholic drinks, THC seltzers offer a unique way to relax and unwind without the effects of alcohol. Blue Moon Belgian White Witbier 5.4% ABV 9 IBU Blue Moon Brewing Co. Golden, CO Brewed with oats and spiced with orange peel and coriander. An unfiltered wheat ale spiced in the Belgian tradition. Bud Light American Light Lager 4.2% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Brewed with a malt and hops ratio different from Budweiser for a distinctively crisp taste with fewer calories. Budweiser American Lager 5.0% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Budweiser is a medium-bodied, flavorful, and crisp with blended layers of premium American and European hop aromas. Coors Light American Light Lager 4.2% ABV 12 IBU Coors Brewing Company Golden, CO Coors Light has a nice, bright appearance when poured and a crisp, clean taste. Corona Premier International Pale Lager 4.0% ABV 7 IBU Corona Mexico, CA A highly carbonated, medium-bodied lager that is well-balanced. Delirium Tremens Belgian Golden Strong Ale 8.5% ABV 25 IBU Brouwerij Huyghe Melle, Belgium As the palate is warmed, the taste is characterized by its roundness. The aftertaste is strong, long-lasting and dry bitter. Elysian Space Dust American IPA 8.2% ABV 62 IBU Elysian Brewing Company Seattle, WA The hopping is pure starglow energy, with Chinook to bitter and late and dry additions of Citra and Amarillo. Fort Myers High 5 IPA American IPA 5.9% ABV 59 IBU Fort Myers Brewing Company Fort Myers, FL A bitter, moderately strong American pale ale that uses its clean, supporting malt to showcase its hop character. Funky Buddha Floridian Hefeweizen Weissbier 5.2% ABV 12 IBU Funky Buddha Brewery Oakland Park, FL This unfiltered and refreshing German-style wheat beer is full on flavor yet light on the palate. Authentic hefeweizen yeast creates the compelling aromas of bananas, citrus, and cloves, while the all wheat and malt body perfectly captures the brilliance of a golden Florida sunset. Golden Road Mango Cart American Wheat Beer 4.0% ABV 10 IBU Golden Road Brewing Los Angeles, CA Inspired by the iconic fruit cart vendors of Los Angeles. A light, refreshing wheat ale with lots of fresh mango & a slightly tart finish. Guinness Extra Stout Irish Stout 5.6% ABV 47 IBU St. James Gate (Guinness) Dublin, Ireland A Guinness stout from the first velvety sip to the last lingering drop, and every deep-dark satisfying mouthful in between! Pure Guinness! High Rise Blood Orange Cbd Seltzer 10mg Cbd + 5mg Thc THC Infused Seltzer High Rise Beverage Co Mt. Pleasant, SC A sparkling beverage infused with THC, the primary psychoactive compound found in cannabis. Unlike traditional alcoholic drinks, THC seltzers offer a unique way to relax and unwind without the effects of alcohol. Kona Big Wave Blonde Ale 4.4% ABV 15 IBU Kona Brewing Company Kailua-Kona, HI A lighter bodied golden ale with a tropical hop aroma and flavor – a smooth, easy drinking refreshing ale. Michelob Ultra American Light Lager 4.2% ABV 10 IBU Michelob St Louis, MO Michelob Ultra appeals to beer drinkers interested in a superior tasting light beer that promotes an active, social lifestyle. Miller Lite American Light Lager 4.2% ABV 12 IBU Miller Brewing Company Milwaukee, WI Miller Lite is a pilsner-style beer brewed with choice hops, the finest blend of American-grown barley malts and pure, soft water. Modelo Especial International Pale Lager 4.4% ABV 18 IBU Grupo Modelo Mazatlan, Mexico With inspiration from German brewmasters, we created a consistently crisp and well-balanced beer that we fittingly named Modelo Especial. New Belgium Voodoo Ranger Juicy Haze Hazy IPA 7.5% ABV 42 IBU New Belgium Brewing Asheville , NC Packed with bright tropical aromas and brilliant citrusy flavors, this unfiltered IPA wraps up with a pleasantly smooth finish. Pacifico Clara Mexican Lager 4.5% ABV 10 IBU Grupo Modelo Mazatlan, Mexico The classic Mexican lager from the Pacifico Brewery of Mazatian, founded in 1900 by German settlers. Palm City Hazify Hazy IPA 6.5% ABV Palm City Brewing Co. Fort Myers, FL Big juicy hop aroma and flavor, low bitterness and malt flavor. Samuel Adams Octoberfest Märzen 5.3% ABV 16 IBU Boston Beer Company (Samuel Adams) Boston, MA Our Octoberfest blends hearty malts for a deep, smooth flavor with caramel notes creating a brew that’s perfect whatever you’re celebrating Stella Artois Lager International Pale Lager 5.2% ABV 25 IBU Stella Artois Leuven, Belgium One of the World's best selling beers, enjoyed in more than 80 countries.  Low malt sweetness with a crisp finish. SweetWater 420 Extra Pale Ale American Pale Ale 5.7% ABV 39 IBU SweetWater Brewing Company Atlanta, GA Our most popular brew is a tasty West Coast style Pale Ale with a stimulating hop character and a crisp finish. Twisted Tea Original Alternative Grain Beer 5.0% ABV 15 IBU Twisted Tea Brewing Company Cincinnati, OH Made from real brewed tea and natural lemon flavor, smooth, and of course, a little twisted Wicked Weed Blue Razz Burst Mixed-Fermentation Sour Beer 4.5% ABV Wicked Weed Brewing Asheville, NC A wild-fermented beer containing funky sour flavors and a variety of aromas Yuengling Lager American Lager 4.4% ABV 12 IBU Yuengling Brewery Pottsville, PA Yuengling Traditional Lager is an iconic American lager famous for its rich amber color and medium bodied flavor. Bottle List - 56 3 Daughters Key Lime Cider Common Cider 5.4% ABV 3 Daughters Brewing St. Petersburg, FL Hard apple cider blended with key lime juice for a uniquely Florida taste. Amstel Light International Pale Lager 3.5% ABV 18 IBU Amstel Brouwerij B. V. Netherlands A moderate amber lager with soft malt characteristics at the forefront that finishes well balanced. Angry Orchard House Crisp Apple Cider Fruit Cider 5.0% ABV Angry Orchard Cider House Walden, NY This crisp and refreshing cider offers sweet apple notes up front with a subtle dryness at the finish for a balanced cider taste. Big Top Hawaiian Lion American Porter 7.5% ABV Big Top Brewing Company Sarasota, FL Toasted Coconut & Coffee Porter Blue Moon Belgian White Witbier 5.4% ABV 9 IBU Blue Moon Brewing Co. Golden, CO Brewed with oats and spiced with orange peel and coriander. An unfiltered wheat ale spiced in the Belgian tradition. Boddingtons Pub Ale British Golden Ale 4.6% ABV 27 IBU Boddingtons Manchester, United Kingdom Renowned for its golden color, distinctive creamy head, smooth body and easy drinking character, Boddingtons is a medium-bodied pale ale. Brew Bus Brewing You'Re My Boy Blue Fruit Beer 5.0% ABV 12 IBU Brew Bus Brewing Tampa Bay, FL A beer with additional flavors and aroma from fruit Bud Light American Light Lager 4.2% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Brewed with a malt and hops ratio different from Budweiser for a distinctively crisp taste with fewer calories. Bud Light Lime American Light Lager 4.2% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Light-bodied brew with a delicate malt sweetness; clean, crisp finish, and the taste of a fresh-squeezed lime for ultimate refreshment. Budweiser American Lager 5.0% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Budweiser is a medium-bodied, flavorful, and crisp with blended layers of premium American and European hop aromas. Budweiser Zero American Lager Anheuser-Busch, Inc. St. Louis, MO A light-bodied lager designed with drinkability in mind. Busch Light American Light Lager 4.1% ABV 10 IBU Anheuser-Busch, Inc. St. Louis, MO Premium American-grown and imported hops and a combination of malt and corn to provide a pleasant balanced flavor. Chimay Cinq Cents Tripel (White) Belgian Tripel 8.0% ABV 36 IBU Bieres De Chimay Baileux, Belgium This Trappist beer combines sweet and bitter in a rare balance. The beer has fruity touches of Muscat grapes and raisins. Chimay Grand Reserve (Blue) Belgian Dark Strong Ale 9.0% ABV 30 IBU Bieres De Chimay Baileux, Belgium A dark Trappist beer with a powerful aroma, the complex flavour of which improves across the years. Chimay Première (Red) Belgian Dubbel 7.0% ABV 24 IBU Bieres De Chimay Baileux, Belgium Topped with a creamy head, it gives off a slight fruity apricot smell from the fermentation. Coors Banquet American Lager 5.0% ABV 6 IBU Coors Brewing Company Golden, CO A light-bodied lager designed with drinkability in mind. Corona Extra International Pale Lager 4.6% ABV 18 IBU Grupo Modelo Mazatlan, Mexico Corona's aroma is fruity-honey with a touch of malt and the flavor is crisp and well-balanced between hops and malt, toward the malt side. Corona Light Mexican Light Lager 4.0% ABV 18 IBU Grupo Modelo Mazatlan, Mexico Corona Light has approximately 30% less calories than Corona Extra but keeps the same refreshing flavor. Corona Premier International Pale Lager 4.0% ABV 7 IBU Corona Mexico, CA A highly carbonated, medium-bodied lager that is well-balanced. Founders Breakfast Stout Imperial Stout 8.3% ABV 60 IBU Founders Brewing Company Grand Rapids, MI Brewed with an abundance of flaked oats, bitter and imported chocolates, and Sumatra and Kona coffee, this stout has an intense fresh-roasted java nose topped with a frothy, cinnamon-colored head that goes forever. Heineken International Pale Lager 5.0% ABV 23 IBU Heineken Nederland B.V. Netherlands Mildly bitter taste, fresh, fruity aroma, bright color and clarity are obtained using only the purest water, hops and barley malt. Heineken 0.0 International Pale Lager Heineken Nederland B.V. Netherlands A highly carbonated, medium-bodied lager that is well-balanced. High Noon Black Cherry Mixed Drink 4.5% ABV High Noon Spirits Memphis, TN Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. High Noon Lemon Hard Seltzer 4.5% ABV High Noon Spirits Memphis, TN Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. High Noon Mango Hard Seltzer 4.5% ABV High Noon Spirits Memphis, TN Sunny, bright and snappy, this mango sparkles on the tongue like sunlight on the sea. Perfect for Summer Fridays! High Noon Peach Hard Seltzer 4.5% ABV High Noon Spirits Memphis, TN Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. High Noon Pineapple Mixed Drink 4.5% ABV High Noon Spirits Memphis, TN Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. High Noon Watermelon Mixed Drink 4.5% ABV High Noon Spirits Memphis, TN This hard seltzer is the real deal. Vodka, Seltzer, and real juice, make this gluten free, and under 100 calories. Kona Big Wave Blonde Ale 4.4% ABV 15 IBU Kona Brewing Company Kailua-Kona, HI A lighter bodied golden ale with a tropical hop aroma and flavor – a smooth, easy drinking refreshing ale. Landshark Lager Island Style Lager 4.6% ABV 15 IBU Margaritaville Brewing St. Louis, MO Refreshing, drinkable island lager. Michelob Ultra Pure Gold American Light Lager 4.3% ABV Michelob St Louis, MO A light-bodied and very refreshing lager. Michelob Ultra Zero American Lager Michelob St Louis, MO A light-bodied lager designed with drinkability in mind. Mickey's Fine Malt Liquor American Lager 5.6% ABV 32 IBU Miller Brewing Company Milwaukee, WI A light-bodied lager designed with drinkability in mind. Miller High Life American Lager 4.6% ABV 10 IBU Miller Brewing Company Milwaukee, WI Yeast our founder brought over from Germany, light Galena hops from the pacific northwest, and a combination of malted barley. Miller Icehouse American Lager 5.5% ABV Miller Brewing Company Milwaukee, WI A light-bodied lager designed with drinkability in mind. Modelo Especial International Pale Lager 4.4% ABV 18 IBU Grupo Modelo Mazatlan, Mexico With inspiration from German brewmasters, we created a consistently crisp and well-balanced beer that we fittingly named Modelo Especial. Modelo Modelo Oro American Light Lager 4.0% ABV Grupo Modelo Mazatlan, Mexico A light-bodied and very refreshing lager. Negra Modelo International Amber Lager 5.4% ABV 20 IBU Grupo Modelo Mazatlan, Mexico Negra Modelo is a Munich-style offering a balanced flavor and delicate aroma of dark malt, caramel and hops. Nutrl Orange Vodka Seltzer Hard Seltzer 4.5% ABV Nutrl Seltzer United States Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. Orange Blossom Pilsner German Pils 5.5% ABV 7 IBU Orange Blossom Brewing Co Orlando, FL Orange Blossom Pilsner is a honey beer made with real, local orange blossom honey. Pabst Blue Ribbon American Lager 4.6% ABV 10 IBU Pabst Brewing Company Milwaukee, WI Pabst Blue Ribbon is brewed in the finest traditions of an American Premium Lager dating back to 1844. Pabst Blue Ribbon Light American Light Lager 4.2% ABV Pabst Brewing Company Milwaukee, WI A light-bodied and very refreshing lager. Rolling Rock American Lager 4.4% ABV 9 IBU Anheuser-Busch, Inc. St. Louis, MO Using a time-honored recipe with only the finest malted barley and blend of hops, Rolling Rock is a classic American lager that is as well-known for its distinctive, full-bodied taste as it is for its craftsmanship, heritage and green bottle St. Bernardus Abt. 12 Abt/Quadrupel 10.0% ABV 22 IBU Brouwerij St. Bernardus Watou, Belgium Dark with a full, ivory-colored head. It has a fruity aroma, full of complex flavors and a long bittersweet finish with a hoppy bite. Stateside Vodka Surfside Iced Tea Vodka Hard Seltzer 4.5% ABV Stateside Vodka Company Philadelphia, PA Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. Sun Cruiser Iced Tea & Vodka Hard Seltzer 4.5% ABV Sun Cruiser United States Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. Sun Cruiser Lemonaid And Vodka Hard Seltzer 4.5% ABV Sun Cruiser United States Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. Tank Freedom Tower Amber American Amber Ale 5.2% ABV 30 IBU The Tank Brewing Co Miami, FL A moderate, hoppy beer with a distinct caramel malty flavor. Twisted Tea Half-N-Half Hard Seltzer 5.0% ABV Twisted Tea Brewing Company Cincinnati, OH Light sparkling alcoholic beverage type of highball drink containing seltzer (carbonated water), alcohol, and often fruit flavorings. Typically made by fermenting cane sugar or malted barley. Urban Artifact Teak Mixed-Fermentation Sour Beer 7.2% ABV Urban Artifact Cincinnati, OH Teak is a delightfully flavorful and thirst-quenching brew made with pineapples, pink guava, and key limes. Warsteiner Pilsner German Pils 4.8% ABV 33 IBU Warsteiner Brauerei Warstein, Germany Warsteiner Premium Verum is a classic North German pilsner brewed with noble Hallertau hops and naturally soft spring water. White Claw Black Cherry Hard Seltzer Hard Seltzer 5.0% ABV White Claw United States all-natural sparkling seltzer water with 5% alcohol and a hint of honest-to-goodness fruit. White Claw Lime Hard Seltzer Hard Seltzer 5.0% ABV White Claw United States all-natural sparkling seltzer water with 5% alcohol and a hint of honest-to-goodness fruit. Wicked Weed Perni-Haze Hazy IPA 6.9% ABV 40 IBU Wicked Weed Brewing Asheville, NC Citra and Simcoe from our favorite hop fields drive this juicy IPA. Crush-ability and effortless finish. Yuengling Flight American Light Lager 4.2% ABV 7 IBU Yuengling Brewery Pottsville, PA FLIGHT by Yuengling is easy drinking, clean, crisp, and refreshing. FLIGHT is only 95 calories, 2.6g carbs. Yuengling Lager American Lager 4.4% ABV 12 IBU Yuengling Brewery Pottsville, PA Yuengling Traditional Lager is an iconic American lager famous for its rich amber color and medium bodied flavor. Wine - 13 Beringer Luminus Chardonnay Chardonnay Beringer Vineyards Knights Valley, CA A white wine with notes of melon, citrus, apple, and pear. Freixenet Sparkling Cordon Brut Cava Sparkling Freixenet Cava, Valencian Community JaM Cellars Butter Chardonnay Chardonnay JaM Cellars Napa Valley, CA A white wine with notes of melon, citrus, apple, and pear. Vintage: 2014 Kendall Jackson Chardonnay Chardonnay Kendall-Jackson California- North Coast A white wine with notes of melon, citrus, apple, and pear. Kim Crawford Sauvignon Blanc Sauvignon Blanc 12.5% Kim Crawford IGP delle Venezie, Friuli-Venezia-Giulia Dry and acidic wine with herbal and tropical fruit notes. Vintage: 2016 Nicolas Feuillatte Brut Reserve Champagne 12% Champagne Nicolas Feuillatte Champagne A sparkling wine from France ranging from fruity to dry and citrusy. Ruffino Pinot Grigio Lumina Pinot Grigio/Gris Ruffino Wine Friuli-Venezia-Giulia Well-balanced fruit reveals notes of pear and citrus fruits. Delivers a fragrant, fruity finish. Pairs well with light seafood dishes!  ABV 12%  $9.79 a bottle Vintage: 2014 The Hess Collection Chardonnay Chardonnay 13.5% The Hess Collection Monterrey, Galicia A white wine with notes of melon, citrus, apple, and pear. Vintage: 2014 Vendange Cabernet Sauvignon Cabernet Sauvignon Vendange California Full bodied, flavors of dark fruit and toasted wood. Vendange Chardonnay Chardonnay Vendange California A white wine with notes of melon, citrus, apple, and pear. Vintage: 2005 Vendange Merlot Merlot Vendange California Fruity and spicy red wine with less tannins than Cabernet Sauvignon. Vintage: 2006 Vendange Pinot Grigio Pinot Grigio/Gris Vendange California White wine with notes of green apple, white nectarine, and citrus. Vendange White Zinfandel Zinfandel Vendange California Flavors of cherry, wild berry, & plum with notes of leather, earth, and tar. On Deck - 7 Bone Hook Sunset Surfer Blonde Ale 5.2% ABV Bone Hook Naples, FL An approachable, malt-oriented American beer that is well-balanced and great for easy-drinking. Funky Buddha Last Snow American Porter 6.4% ABV Funky Buddha Brewery Oakland Park, FL Rich, creamy porter layered with coconut and coffee. Miami Big Rod Coconut Blonde Ale 5.4% ABV Miami Brewing Homestead, FL An approachable, malt-oriented American beer that is well-balanced and great for easy-drinking. Samuel Adams Octoberfest Märzen 5.3% ABV 16 IBU Boston Beer Company (Samuel Adams) Boston, MA Our Octoberfest blends hearty malts for a deep, smooth flavor with caramel notes creating a brew that’s perfect whatever you’re celebrating Shiner Ruby Redbird Fruit Beer 4.2% ABV 13 IBU Spoetzl Brewery (Shiner) Shiner, TX Shiner Ruby Redbird is brewed with genuine Texas Rio Red Grapefruit, the signature sweet citrus of the Rio Grande Valley, and ginger. Tampa Bay Reef Donkey American Pale Ale 5.5% ABV 36 IBU Tampa Bay Brewing Company Tampa , FL A moderate, refreshing ale with noticeable hop aroma balanced by supporting malt flavors. Yuengling Hershey's Chocolate Porter American Porter 4.7% ABV 10 IBU Yuengling Brewery Pottsville, PA Dark Brewed Porter with the taste of Hershey’s Chocolate to create a deliciously smooth porter with roasted malts and rich chocolate finish Get listed on TapHunter! FREE for 60 days for a limited time. Get Started! × Close Special Offer for Dylan's Draft House Offer Code: Beer 1 Receive a Half Price App with the purchase of a Flight of 4.  Not valid with any other discounts or coupons Contact info@taphunter.com Company About Careers Blog Privacy Policy For Business Digital Menus Print Menus Inventory Social Media POS Integration Get the App Download on the AppStore Get it on Google Play San Diego | New York | Atlanta | San Francisco | Charlotte | Chicago | Dallas | Denver | Houston | Orange County | Los Angeles | More cities © 2025 TapHunter"
    },
    {
      "url": "https://variety.com/2022/film/news/drafthouse-films-giant-pictures-1235199895/",
      "text": "Drafthouse Films Sells to Giant Pictures, Sets Nick Savva as CEO Drafthouse Films Sells to Giant Pictures, Sets Nick Savva as CEO Plus Icon Film Plus Icon TV Plus Icon What To Watch Plus Icon Music Plus Icon Docs Plus Icon Digital & Gaming Plus Icon Global Plus Icon Awards Circuit Plus Icon Video Plus Icon What To Hear Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Got a Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Variety Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Variety Plus Icon Read Next: Channing Tatum Says Rejecting Guillermo del Toro’s Unmade ‘Beauty and the Beast’ Remake Is ‘One of the Biggest Mistakes of My Career’ Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Home Film News Mar 9, 2022 9:00am PT Drafthouse Films Sells to Giant Pictures, Sets Nick Savva as CEO (EXCLUSIVE) By Rebecca Rubin Plus Icon Rebecca Rubin Senior Film and Media Reporter rebeccaarubin Latest Box Office: ‘Conjuring: Last Rites’ Overtakes ‘It’ as Biggest Horror Movie Opening With $194 Million Globally 2 days ago After ‘Conjuring: Last Rites,’ Warner Bros. Makes Box Office History With 7 Consecutive Movies Opening Above $40 Million 2 days ago ‘Conjuring: Last Rites’ Scares Up Second Biggest Global Horror Opening Ever With $187 Million 3 days ago See All Digital distributor Giant Pictures has acquired Drafthouse Films , the genre movie label formed by Alamo Drafthouse founder Tim League. Giant Pictures general manager Nick Savva will serve as CEO of the company, which will continue to operate under the title Drafthouse Films. League will become the chairman of Drafthouse Films. “Giant Pictures’ investment enables Drafthouse Films to continue releasing the provocative, visionary, and artfully unusual genre films from around the world that have always defined the Drafthouse brand,” Savva said. “At the same time, this acquisition gives Giant new theatrical releasing capabilities which complement our existing digital distribution and streaming technology businesses.” Related Stories Balkan Cinema Surges Into Fall Festivals After Banner Year for Filmmakers From Southeast Europe ESPN Acquires U.S. Rights, Bell Media Canadian Rights to Richard Brown's 'Origin: The Story of the Basketball Africa League,' Distributed by Fremantle Drafthouse Films was created as the distribution arm of Alamo Drafthouse Cinemas in 2010 before being spun off from the exhibitor. Past titles on Drafthouse Films’ slate were “Bullhead,” “The Act of Killing,” “Spring” and “Cheap Thrills.” Giant Pictures partners with studios and filmmakers to release movies and TV shows across major streaming platforms, including Apple TV, Netflix and Peacock.  The companies began working together in early 2021, when Giant began representing the Drafthouse Films catalog for sales to digital distributors such as Hulu, Tubi, Kanopy, Mubi and AMC’s Shudder. Popular on Variety As CEO, Savva says he plans to expand the Drafthouse Films label. Both Giant Pictures and Drafthouse Films will attend the upcoming SXSW Film Festival to scout for new distribution titles. Giant Pictures also intends to work closely with Alamo Drafthouse and its related media companies, such as Fantastic Fest and the Alamo On Demand platform. Already, Drafthouse Films has acquired two movies — “NR. 10” and “Masking Thresold” — which debuted at Fantastic Fest and will be released theatrically this spring at Alamo Drafthouse locations. Following a run on the big screen, “NR. 10” and “Masking Threshold” will move to digital platforms via Giant Pictures, as well as Alamo On Demand. “Our label has always been about finding and supporting immensely talented genre filmmakers from around the world. I’m thrilled to be working with Nick and the team at Giant Pictures to carry on that vision,” League said. “Our new releases — ‘NR. 10’ and ‘Masking Threshold’ — are both weird and wonderful films, each in their own way fold perfectly into the Drafthouse Films library.” NR. 10″ has been described as a “gleefully genre-bending thriller” with a “large dose of dark comedy.” Drafthouse Films Dutch filmmaker Alex Van Warmerdam, who previously worked with Drafthouse Films on his 2013 movie movie “Borgman,” directed “NR. 10,” which has been described as a “gleefully genre-bending thriller” with a “large dose of dark comedy.” The logline reads: “Found alone in the German woods as a four year old boy, Günter is brought in by a foster family and grows up to lead a relatively normal life. But when a stranger triggers a buried memory from his past, Günter starts to wonder about his mysterious origins.” “The best way to watch this film is to know as little about it as possible in advance and let the wonder wash over you — you’ll thank me later,” League said. The distribution deal for “NR. 10” was negotiated by Savva for Drafthouse Films with Nelleke Driessen of Nine Film on behalf of the filmmakers. “Masking Threshold” is an existential psychological horror film that is “not for the faint of heart.” Johannes Grenzfurthner directed “Masking Threshold,” a psychological horror film that Drafthouse Films is calling “an experience not for the faint of heart.” One part chamber play, one part scientific procedural and one part YouTube unboxing video, “Masking Threshold” follows a skeptic IT worker who conducts a series of experiments in his makeshift home-lab to cure his harrowing hearing impariment. But, the logline teases, “where will his research lead him?” The distribution deal for “Masking Threshold” was negotiated by Emma Manfredi for Drafthouse Films with Bill Straus of Bridge Independent on behalf of the filmmakers. Read More About: Drafthouse Films Jump to Comments More from Variety Jussie Smollett Slams Chicago Police, Rahm Emanuel as ‘Villains’ While Denying Hate Crime Hoax and Mounting a Comeback: My Story ‘Has Never’ Changed Netflix Sets Jussie Smollett Documentary With ‘New Evidence’: Alleged Hate Crime Hoax ‘Might Just Be a True Story’ ‘The Truth About Jussie Smollett?’ Director Says the Doc Was Not Made to ‘Help Rehabilitate His Career in Any Way’ JavaScript is required to load the comments. Loading comments... Most Popular Dwayne Johnson Says Weight Loss Is for New Acting Role; He’s Playing a 70-Year-Old Man Whose Best Friend Is a Chicken: ‘I Still Have a Long Way to Go… Yorgos Lanthimos, Olivia Colman, Ayo Edebiri and Josh O’Connor Among 1,200 Industry Names Pledging Not to Work With Israeli Film Institutions… ‘Severance’s’ Jessica Lee Gagné Makes Emmys History By Becoming First Woman to Win for Outstanding Cinematography For a Series (One… Michael Caine Coming Out of Retirement at 92 Years Old for Vin Diesel’s ‘Last Witch Hunter 2’ at Lionsgate Lady Gaga Extends 'Mayhem Ball' Tour With 2026 North American Dates ‘SNL’ Finalizes Season 51 Cast: Bowen Yang, Chloe Fineman and More Return; Colin Jost and Michael Che Back for ‘Weekend Update… Glen Powell Says Chris Pratt in ‘Guardians of the Galaxy’ Changed Hollywood Leading Men: You Can Be ‘Sillier’ and Not Just ‘Brooding’ Like Robert… ‘One Battle After Another’ First Reactions: Steven Spielberg Praises PTA and DiCaprio’s ‘Incredible’ New Movie as Press Call It One of the Year’s… Apple Unveils iPhone 17 Line, Including Ultrathin ‘Air,’ Keeping Prices Level With Last Year’s Models Eagles Extend Las Vegas Sphere Residency Into 2026 Must Read Film COVER | Channing Tatum's 'Roofman' Reinvention By Andrew Wallenstein 1 week Film Venice Film Festival Reviews Film Cooper Hoffman on ‘The Long Walk,’ Coming of Age After 'Licorice Pizza' TV ‘SNL’ Adds Five: Meet the New Cast Members Film E. Jean Carroll Hopes Her Explosive Telluride Doc Will ‘Finish Off’ Donald Trump Sign Up for Variety Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Variety Confidential A Variety and iHeartRadio Podcast More From Our Brands Rolling Stone King Gizzard and the Lizard Wizard Let Fans ‘Name Your Price’ for Albums on Bandcamp Robb Report Saints Star Alvin Kamara Leased This $10 Million Colorado Home Over the Summer Sportico Josh Kraft’s Bid for Boston Mayor Takes Hit in Prelim Vote WWD WWD Timeline: Tracing 115 Years of Covering Fashion, Retail, Beauty and More TVLine Casting News: Game of Thrones Universe Alums Join Black Mirror Boss, Love Island Games Lineup and More Variety About Us Advertise Media Kit Careers Legal Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Magazine Customer Service Back Issues Subscribe Help More Newsletters Archives Events Luminate Connect Instagram Twitter YouTube Facebook LinkedIn Variety The Business of Entertainment Subscribe Today Have a News Tip? Let us know Variety Close the menu Expand the sub menu Film News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menu TV News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menu What To Watch Lists & Features Expand the sub menu Music News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menu Docs Lists & Features Expand the sub menu Tech Features Global VIP+ Tech Expand the sub menu Global News Asia Markets & Festivals Features Expand the sub menu Awards Circuit News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menu Video Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menu What to Hear Lists & Features Expand the sub menu More Coverage Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menu More Variety Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Alerts and Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Follow Us Got a Tip? Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Advertise About Contact Us Variety is a part of Penske Media Corporation. © 2025 Variety Media, LLC. All Rights Reserved. Icon Link Plus Icon ad"
    }
  ]
}