{
  "fuentes": [
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "heritageharbormaintenance@verizon.net"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "hproshop@tampabay.rr.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/fleming-island/eagle-harbor-golf-club",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "aexton@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "argylegrill@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "info@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "proshop@eaglevale.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "info@harborclub.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "u003einfo@harborclub.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "residents@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "apope@ruppertcompanies.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "courtneyb@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "dawnd@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "dbelet@lelandmanagement.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "hrunjo@hampton.golf"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "jend@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "julieszc@comcast.net"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "justinf@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "narmstrong@hampton.golf"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "office@cobblestoneeh.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "partyrequest@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "pinelake@thecamteam.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "rharrington@hampton.golf"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "sandersen@eagleharborcdd.com"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "solutions@eagleharbor.info"
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "email": "vmandile@hampton.golf"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "jamie.baxter@aquilini.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "nancy.gill@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "robert.dew@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "carson.spooner@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "glen.hartley@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "info@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "lamica.martin@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "mike.ryan@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "robert.dew@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.eagle.uk.com/about-us",
      "email": "info@eagle.uk.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "email": "david.benson@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "email": "patrick.ellis@invitedclubs.com"
    }
  ],
  "mails": [
    "aexton@eaglevale.com",
    "apope@ruppertcompanies.com",
    "argylegrill@eaglevale.com",
    "carson.spooner@goldeneaglegolfclub.com",
    "courtneyb@eagleharbor.info",
    "customerservice@golflink.com",
    "david.benson@invitedclubs.com",
    "dawnd@eagleharbor.info",
    "dbelet@lelandmanagement.com",
    "glen.hartley@goldeneaglegolfclub.com",
    "heritageharbormaintenance@verizon.net",
    "hproshop@tampabay.rr.com",
    "hrunjo@hampton.golf",
    "info@belfairsgolfclub.co.uk",
    "info@eagle.uk.com",
    "info@eaglevale.com",
    "info@goldeneaglegolfclub.com",
    "info@harborclub.com",
    "jamie.baxter@aquilini.com",
    "jend@eagleharbor.info",
    "julieszc@comcast.net",
    "justinf@eagleharbor.info",
    "lamica.martin@goldeneaglegolfclub.com",
    "mike.ryan@goldeneaglegolfclub.com",
    "nancy.gill@goldeneaglegolfclub.com",
    "narmstrong@hampton.golf",
    "office@cobblestoneeh.com",
    "partyrequest@eagleharbor.info",
    "patrick.ellis@invitedclubs.com",
    "pinelake@thecamteam.com",
    "proshop@eaglevale.com",
    "residents@eagleharbor.info",
    "rharrington@hampton.golf",
    "robert.dew@goldeneaglegolfclub.com",
    "sandersen@eagleharborcdd.com",
    "solutions@eagleharbor.info",
    "u003einfo@harborclub.com",
    "vmandile@hampton.golf"
  ],
  "nombre_sitio": "eagleharborgc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "text": "Contact Us - Heritage Harbor Golf and Country Club Skip to primary navigation Skip to main content Heritage Harbor Golf and Country Club Lutz, FL Home Golf Course Info Scorecard Hole by Hole Tee Times Facilities Golf Facilities Practice Facilities Pro Shop Double Bogey’s Tavern & Grille Heritage Harbor Golf and Country Club Lutz, FL Lessons Events Outings & Events Tournament Info Request Outing Info SRK Camp HOA Community Development Community Event Calendar HOA Info Home Owner’s Associations Architectural Information HOA Member Area Neighbors Helping Neighbors HOA Documents HOA Meeting Minutes For Sale/For Rent Sign Guidelines Contact Contact Join the Harbor’s E-Club Directions to Heritage Harbor Staff Listing ADA Compliance & Accessibility Contact Us Heritage Harbor Golf & Country Club 19502 Heritage Harbor Parkway Lutz, Florida 33558 Double Bogeys Tavern & Grille phone (813)949-6841  Ext. 3 Pro Shop and Golf Course phone (813) 949-4886 fax (813) 909-4826 hhproshop@gmail.com Clubhouse Front Desk phone (813) 949-6841 fax (813) 909-4826 hhcluboffice@gmail.com Golf Course Superintendent (813) 909-4336 heritageharbormaintenance@verizon.net Page Footer Contact Us Address : 19502 Heritage Harbor Pkwy Lutz, FL, 33558 Email : hhcluboffice@gmail.com Phone : 813-949-6841 Facebook Local Weather Copyright © 2025 Heritage Harbor Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/fleming-island/eagle-harbor-golf-club",
      "text": "Eagle Harbor Golf Club, Fleming Island, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Fleming Island Public 4 2 Reviews Eagle Harbor Golf Club Designed by Clyde B. Johnston, ASGCA and opened in 1993 Eagle Harbor - Fleming Island , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Nearby Courses Course Details Holes: 18 Par: 72 Length: 6840 yards Slope: 141 Rating: 73.4 Driving Ranges: Yes The 18-hole \"Eagle Harbor\" course at the Eagle Harbor Golf Club facility in Fleming Island , Florida features 6840 yards of golf from the longest tees for a par of 72. The course rating is 73.4 and it has a slope rating of 141. The estimated green fees for 18 holes is $85. Eagle Harbor Golf Club Golf Club has an onsite driving range with 6 practice tees. Designed by Clyde B. Johnston, ASGCA, the Eagle Harbor golf course opened in  1993. Estimated Green Fees $85 These rates are an estimate of what you might expect to pay at Eagle Harbor with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Eagle Harbor HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT Blue 72.10/131 432 385 515 178 415 165 552 372 393 3407 377 518 358 167 417 202 420 420 554 3433 6840 White 70.20/128 393 355 497 165 395 152 527 366 380 3230 352 493 348 150 402 186 368 380 523 3202 6432 Green 69.50/125 345 327 472 150 358 143 502 313 325 2935 322 472 327 135 382 167 340 345 490 2980 5915 Green (L) 74.20/135 345 327 472 150 358 143 502 313 325 2935 322 472 327 135 382 167 340 345 490 2980 5915 Gold 65.80/114 345 327 420 150 358 87 433 268 325 2713 322 412 280 117 335 136 340 345 438 2725 5438 Gold (L) 71.40/131 345 327 420 150 358 87 433 268 325 2713 322 412 280 117 335 136 340 345 438 2725 5438 Par 4 4 5 3 4 3 5 4 4 36 4 5 4 3 4 3 4 4 5 36 72 Swipe to See full table Eagle Harbor Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Eagle Harbor Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 What Golfers are Saying 4 Based on 2 Reviews Write a review Add a Photo Drop Photo Here or Click to Upload Submit Bill A. Reviewed April 03, 2013 Little bit of everything on this one...sand, water, trees and the occasional back yard.  Well maintained and a great staff!  Got backed up the first few holes but played out ok after that. Read More shaun N. Reviewed August 11, 2010 I've only played during twilight hours but enjoyed the course regardless.  I plan on getting in all 18 soon. Read More View More Courses in Fleming Island Fleming Island Golf Club, Fleming Island Plantation Course Public Year Opened: 2000 2260 Town Center Blvd, Fleming Island, FL, 32003-6331 4 miles from the center of Fleming Island view course details 18 Holes 71 Par 6,801 Yards Driving Range: Yes Nearby cities with courses Green Cove Springs 4 Courses Jacksonville 21 Courses Orange Park 1 Course Ponte Vedra Beach 1 Course Saint Augustine 3 Courses Saint Johns 1 Course St Augustine 1 Course 2217 Eagle Harbor Pkwy, Fleming Island, FL 32003-7304 (904) 269-9300 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "text": "Contact Us | Eagle Vale Golf Club Skip to main content Skip to footer Eagle Vale Golf Club Fairport, NY Call us: (585) 377-5200 Home Golf Tee Times Rates Memberships Indoor Simulators Pro Shop Specials! Driving Range Penfield NY 2025 Driving Range Membership 2025 Saturday Couples League Course Information Scorecard Front 9 Flyover Back 9 Flyover GOLF INSTRUCTION Virtual Tour Tournaments Tournaments 2026 Tournament Pricing Information Request Events Calendar Tee Times Argyle Grill Banquet Facility Banquet Facility Special Occasions Corporate Events Golf Tournaments Information Request Testimonials Weddings Eagle Vale News Newsletter Join Our Email List! Helpful Links Contact Us Argyle Grill Contact Us Contact Us Today! Staff Directory Eagle Vale Golf Club 4344 Nine Mile Point Road, Fairport, NY 14450 Phone: (585) 377-5200 ‎ Contact any of our staff during the hours indicated here! Hours of Operation Golf Shop: 9am-5pm Restaurant: 11am – until Office: 9am – 5pm Please click on the appropriate Contact below for more information and an email contact form: Name Position Phone E-Mail Scott Hunter Director of Golf (585) 377-5200 x231 proshop@eaglevale.com Amy Exton Sales & Events Coordinator (585) 377-5200 x224 aexton@eaglevale.com Heather Charles Argyle Grill Manager (585) 377-5200 x228 argylegrill@eaglevale.com Employment Application Click Here Our staff is fully equipped to handle all needs. Firstly, Scott Hunter is your go-to guy for all things golf. Secondly, Amy Exton will assist you with all your tournament and event needs. Feeling hungry? Talk to Heather Charles, our Argyle Grill manager! Get in touch with us today. We can’t wait to hear from you! Footer Sign-Up for Email Offers Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Website Submit Local Weather Sorry - your browser does not support iframes. meteoblue Find Us Address: 4344 Nine Mile Point Road Fairport, NY 14450 Phone: (585) 377-5200 Email: info@eaglevale.com Follow Us Copyright © 2025 Eagle Vale Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "text": "Contact - Harbor Club GA Real Estate Golf Lifestyle Memberships Find Homes Inquire Real Estate Golf Lifestyle Membership About Weddings & Events Blog Gallery Contact Discover the Harbor Club Lifestyle We hope you enjoyed your virtual visit to Harbor Club, but nothing compares to experiencing our beautiful community firsthand. To schedule an in-person tour, or to simply learn more about life at Harbor Club, reach us at (800) 505-GOLF (4653) or info@harborclub.com today. Visit Us 1111 Polo Circle Suite 102 Greensboro, GA 30642 (800) 505.GOLF or (706) 453.9690 info@harborclub.com Get Directions Get In Touch Contact us today and learn more about life at Harbor Club. First Name* Last Name* Phone Number* Email Address* Zip/Country Code* Contact Preference* Email Call Text I am interested in* Real Estate Golf Membership Wedding Private Event Local Outings Learn More Golf Learn More Keep In Touch @HARBORCLUBONLAKEOCONEE 1111 Polo Circle Greensboro Georgia 30642 Get Directions 866 805 5253 info@harborclub.com Harbor Club All Rights Reserved © 2023 Real Estate Golf Lifestyle Membership About Weddings Events Blog Gallery Accolades Contact Resident Log In Member Log In Front Gate Guest Registration Privacy Policy Cookie Policy © 2025 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions. 1111 Polo Circle Greensboro Georgia 30642 Get Directions Resident Log In Member Log In Privacy Policy Cookie Policy ©2023 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Harbor Club All Rights Reserved © 2023 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions."
    },
    {
      "url": "https://www.eagleharboronline.com/contact",
      "text": "Contact Community Events Amenities Talons Golf Resident Info CDD HOA Policies and Procedures Contact directory Eagle Harbor Solutions - Resident Concerns & Suggestions solutions@eagleharbor.info 904-257-5697 District Manager - Steve Andersen sandersen@eagleharborcdd.com Recreation & Aquatics Director - Dawn Decaminada dawnd@eagleharbor.info 904-621-8362 Community Events & District Newsletter - Courtney Buchman courtneyb@eagleharbor.info 904-621-8362 Tennis & Pickleball Director - Justin Flynn justinf@eagleharbor.info 904-269-2500 New Residents, Golf Carts, Amenity Updates - Coordinator ResidentS@eagleharbor.info 904-621-8362 Talons General Manager - Helen Runjo hrunjo@hampton.golf 904-269-9300 Facility & Party Rentals - Coordinator (excludes Talons & Golf facilities) partyrequest@eagleharbor.info 904-621-8362 Golf Tee Times & Membership - Randy Harrington rharrington@hampton.golf 904-269-9300 Talons: Special Events & Weddings - Vanessa Mandile vmandile@hampton.golf 904-269-9300 EXT. 5 Boat & RV Storage - Coordinator jend@eagleharbor.info 904-621-8362 Golf Maintenance - Nathan Armstrong narmstrong@hampton.golf 904-264-8199 Landscape Maintenance - AJ Pope apope@ruppertcompanies.com 904-778-1030 Daniel's Landing Marina Association - Julie Szczudluk julieszc@comcast.net 904-614-3545 Eagle Harbor HOA/Black Creek HOA - Paraclete Services tlbarengo@paracleteservicesllc.com 904-278-0616 Stone Creek HOA - Melanie Bowman stonecreek32003@gmail.com Enclave HOA/Town Center/East of 17 HOA - Dee Belet dbelet@lelandmanagement.com 904-223-7224 Cobblestone HOA - Jennifer Patel office@cobblestoneeh.com 904-215-1493 Pine Lake HOA - The CAM Team, Inc pinelake@thecamteam.com 904-278-2338 Tennis - Courts & Shop 904-269-2500 Pool Facility - Waterfront Park 904-621-8362 Pool Facility - Swim Park 904-264-8989 Pool Facility - Creekside Park 904-637-0035 Back to Homepage Community Events Amenities Talons Restaurant Golf Resident Info CDD Website HOA Info Employment Privacy Policy Contact Copyright © Eagle Harbor"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "text": "Pitt Meadows | Contact Us| Golden Eagle Golf Club top of page Home Golf Tournaments Online Booking Membership North Course South Course Gallery Weddings & Banquets Enquiries Form Weddings Banquets Testimonials Gallery Patio 37 Events Calendar Contact Us info@goldeneaglegolfclub.com 604-460-1111 Book Tee Time Contact Us To learn more about our services and facilities, contact us today! Photo Credit: Dragonflight Photography Contact Golden Eagle Golf Club If you have any questions about our facilities or services offered, simply contact the Golden Eagle Golf Club team using the eform below. We will get back to you as soon as possible to address your inquiry. Since we receive numerous emails, kindly allow 48 hours for us to reply to your message. 21770 Ladner Road Pitt Meadows, BC V3Y 1Z1 Phone: 604-460-1111 Email: info@goldeneaglegolfclub.com Contact Our Team General Inquires - info@goldeneaglegolfclub.com Jamie Baxter - Jamie.baxter@aquilini.com General Manager (Ext 310) Lamica Martin - lamica.martin@goldeneaglegolfclub.com Sales & Events Manager (Ext 303) Glen Hartley - glen.hartley@goldeneaglegolfclub.com Director of Operations (Ext 304) Carson Spooner - Manager of Golf Events & Operations (Ext 304) carson.spooner@goldeneaglegolfclub.com Robert Dew - Robert.dew@goldeneaglegolfclub.com Executive Chef Nancy Gill - Nancy.gill@goldeneaglegolfclub.com Senior Account (Ext 306) Patio 37 (Ext 307) Mike Ryan - mike.ryan@goldeneaglegolfclub.com Superintendent (Ext 309) Join Our Team Line Cooks/Kiosk Cook & Attendent Sous Chef Concierge & Reception Desk Server, Kiosk, Beverage Cart Attendents Seasonal Maintenance Contact Us Name Phone Number Email Message submit Thanks for submitting! Are You Ready To Hit The Green? Schedule online and get ready for the perfect day of golf. Book Your Tee Time Contact Us Golden Eagle Golf Club 21770 Ladner Road Pitt Meadows, BC V3Y 1Z1 Phone: 604-460-1111 Email: info@goldeneaglegolfclub.com Hours Golf Course Open Dawn to dusk, 7 days a week ​ Club House Phone 7:00am to 6:00pm ​ Patio 37 ​Hours: 10:00am - 7:00pm weather dependent Social Copyright Notice This website and its contents are the property of Aquilini Investment Group (and its subsidiary companies) – ©Aquilini Investment Group (and its subsidiary companies) 2019. All rights reserved. Any distribution, redistribution, or reproduction of any part of the contents of this website in any form is prohibited, except with the express prior written consent of Aquilini Investment Group. Copyright Golden Eagle Golf Club - Privacy Policy Created by bottom of page"
    },
    {
      "url": "https://www.eagle.uk.com/about-us",
      "text": "Who We Are — Eagle - Design for Golf Skip to Content Open Menu Close Menu Eagle Plus Signage Entrance Car Park & Clubhouse Directional Health & Safety Course Information Golf Services Driving Range Tee Signage Measured Mark Point of Play Markers Fairway Markers Architect Plaques Vintage Print Scorecards Course Guides Bag Tags Green Fee Tickets Pin Positions Club Collateral Branding Course Services Our Work About Us Who We Are Design & Manufacture Sustainability Contact Us 0 0 Open Menu Close Menu Eagle Plus Signage Entrance Car Park & Clubhouse Directional Health & Safety Course Information Golf Services Driving Range Tee Signage Measured Mark Point of Play Markers Fairway Markers Architect Plaques Vintage Print Scorecards Course Guides Bag Tags Green Fee Tickets Pin Positions Club Collateral Branding Course Services Our Work About Us Who We Are Design & Manufacture Sustainability Contact Us 0 0 Eagle Plus Folder: Signage Back Entrance Car Park & Clubhouse Directional Health & Safety Course Information Golf Services Driving Range Tee Signage Measured Mark Point of Play Markers Fairway Markers Architect Plaques Vintage Folder: Print Back Scorecards Course Guides Bag Tags Green Fee Tickets Pin Positions Club Collateral Branding Course Services Our Work Folder: About Us Back Who We Are Design & Manufacture Sustainability Contact Us Who WE ARe With Eagle’s reputation and respect, wealth of experience and know-how, we are the go-to company for any golf club needing industry advice and supplies. We lead by working with a golf club's identity to produce quality solutions and products, however we can ultimately produce and market anything that will help the club. We also offer a range of branding services to help develop and drive forward a club's identity - whether it is a logo refinement or a new logo development and full guidelines. Eagle consistently strives to be the best. We pride ourselves on our first-class service, creativity and range of products that ensure golf clubs look their best, stand out from the rest, and project the true ethos of the club to its members and visitors. All of which will enable the growth of their business. The EAGLE Vision The global leader of premium golf course print, signage and branding solutions SUSTainability Sustainability is more than a priority – it's our commitment… FIND OUT MORE Design & manufacture Eagle is renowned for its high-quality, skilled craftsmanship… FIND OUT MORE TACIT In 2018 Eagle joined forces with Tacit to create a service to the golf course industry that is unmatched anywhere else in the world of golf. Tacit key activities are invested in the design, manufacture and distribution of bespoke golf course equipment. Tacit’s unique vision is to be a growing, caring organisation, striving to achieve better results year on year. They achieve this by blending investment programmes in all business activities, using modern equipment and systems with dedicated, experienced and skilled people in all areas. View the extensive range at www.tacitgolf.com signage Entrance Car Park & Clubhouse Directional Health & Safety Course Information Golf Services Range Approach Tee Ground Measured Mark Point of Play Markers Fairway Markers Architect Plaques Course and Slope Ratings Print Scorecards Course Guides Bag Tags Green Fee Tickets Pin Positions Club Collateral Services Branding Course Services Eagle, First Floor, 11-13 Godstone Road, Caterham, Surrey, CR3 6RE United Kingdom Call us on +44 (0)1883 344244 or email info@eagle.uk.com Open Form Quote Request Please provide your contact details below and we will contact you with a quotation Club Name County Name First Name Last Name Email * Message Wishlist Thank you! Contact SHARE Privacy Policy © Copyright Eagle 2025"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "text": "Who We Are | Eagle's Nest Country Club | Phoenix, MD | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Eagle's Nest Country Club Main Site Navigation Who We Are Golf Amenities Membership Host An Event Join Now Host Event Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Golf Leagues Coaching & Club Fitting Game On Golf Lessons Crush It! Youth Golf Lessons Golf Course Amenities Racquet Sports Swimming Dining Membership Host An Event Weddings Events Meetings & Corporate Tournaments & Outings Event Rooms Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Who We Are Skip Image Carousel Our Team Calendar Directions & Hours A Treasure Built Over Time Founded in 1969 in the idyllic community of Phoenix, Eagle’s Nest is a private club with an inviting approach to the good life. From virtually every vantage point, sweeping views of Loch Raven Reservoir, towering trees and verdant golfing greens lend an air of majesty to the moment. And with each new experience, it becomes ever clearer that this is where you belong. Schedule A Tour Dawn Redwoods A Tale of Rare Beauty Our Club is home to about 75 dawn redwoods — one of the largest collections outside of China. Once prevalent throughout the Northern Hemisphere, these trees were thought to have become extinct until 1941, when a Chinese forester in the Sichuan province discovered more than 1,000 trees that had somehow survived. The trees at Eagle’s Nest are likely very close descendants of those discovered in China. How did so many of these magnificent trees find their way to Eagle’s Nest? According to Jimmy Watson, our first club president, his brother Bobby is to thank. “A nursery in York, PA, wanted to clear an area,” Jimmy explained. “So they said to Bobby, ‘Take ’em all … $1 apiece.’ They were the size of a broom handle. My brother and Roy Albin planted all the trees after work.” With that small investment roughly a half-century ago, another priceless attribute of Eagle’s Nest was born. \"Glad I chose the Club for this event...Management and Chef's execution exceeded my expectations. Bar service excellent and the wait and service staff were also wonderful. As it should have been...it was a fun and comfortable night for me, my family and our guests\" Patrick Ellis Regional General Manager Contact Me Contact Me + Close Patrick Ellis information modal Patrick Ellis Regional General Manager Serving since 2025 Patrick.Ellis Patrick.Ellis Contact Me Contact Me David Benson Membership Director Contact Me 410-469-8123 Contact Me About David + Close David Benson information modal David Benson Membership Director Serving since 2023 410-469-8123 David.Benson 410-469-8123 David.Benson Contact Me About David David Benson brings many years of Hospitality and Club experience. Most recently, David comes from Arcis Golf, where he served as Sales Director responsible for membership, private events, and tournament sales. His goal as Membership Director here at Eagle’s Nest is to “continue the growth of Membership by building relationships with new guests and most importantly our current Members.” David is thrilled to join the team and help contribute to the outstanding Member experience Eagle’s Nest has to offer Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Golf Amenities Membership Host an Event Contact Us Eagle's Nest Country Club Opens in new window 12801 Stone Hill Rd Phoenix, MD \r\n                                21131 1 410-252-8484 ClubCorp on facebook ClubCorp on twitter ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    }
  ]
}