{
  "fuentes": [
    {
      "url": "https://www.aeo-inc.com/leadership/",
      "email": "aeo-inc@2x.png"
    },
    {
      "url": "https://www.eaglesnestbrisbane.com.au/",
      "email": "sales@eaglesnestbrisbane.com.au"
    },
    {
      "url": "https://nestbedding.com/pages/our-team",
      "email": "customerservice@nestbedding.com"
    },
    {
      "url": "https://www.eaglesnestatblackwater.com/",
      "email": "cyordon@eaglesnestblackwater.com"
    },
    {
      "url": "https://business.crestviewchamber.com/events/details/ribbon-cutting-eagle-s-nest-at-blackwater-16527",
      "email": "info@crestviewchamber.com"
    },
    {
      "url": "https://www.eaglesnestgastropub.com/",
      "email": "events@eaglenestblackwater.com"
    },
    {
      "url": "https://www.eaglesnestgastropub.com/",
      "email": "social@eaglesnestblackwater.com"
    }
  ],
  "mails": [
    "aeo-inc@2x.png",
    "customerservice@nestbedding.com",
    "cyordon@eaglesnestblackwater.com",
    "events@eaglenestblackwater.com",
    "info@crestviewchamber.com",
    "sales@eaglesnestbrisbane.com.au",
    "social@eaglesnestblackwater.com"
  ],
  "nombre_sitio": "eaglesnestgastropub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.aeo-inc.com/leadership/",
      "text": "Leadership - AEO-Inc Skip to content AEO-Inc About AEO About AEO Letter from our CEO Leadership AEO Board of Directors Our Brands American Eagle Aerie OFFLINE Todd Snyder Unsubscribed News + Media Work Here AEO Culture IDEA Benefits Retail Careers Corporate Careers Distribution Center Careers Campus Recruiting Investor Relations Press Releases Events & Presentations Financials & Filings ESG Stock Information Investor Resources AEO Better World ESG Report Giving Back AEO Better World Foundation Brand Partnerships Sustainability Responsible Sourcing Contact Us Shop AE + Aerie Leadership We Lead With Innovation Executive Leadership Jay Schottenstein Executive Chairman of the Board and Chief Executive Officer Since 1992, Jay has been a visionary leader for American Eagle Outfitters. Together, with his father Jerome Schottenstein, the two forged a path that led to the evolution of AEO from a single brand company, to a multi-brand global business. Jay has been instrumental in the successful growth of American Eagle and the launch of the Aerie brand, and has built a strong foundation for AEO’s leading market position. Jay returned to AEO as Chief Executive Officer in 2014, a position he previously held from 1992 to 2002. He has served as AEO’s Chairman of the Board continuously since 1992, and he remains one of our largest shareholders. Jay’s expertise across apparel merchandising, operations, retail, real estate, brand development and team management provides valuable leadership and vision for the company. Jay also serves as Chairman of the Board and Chief Executive Officer of Schottenstein Stores Corporation. He currently is Chairman of the Board of DSW Inc., a leading footwear and accessories retailer, and previously held the position of Chief Executive Officer from 2005 to 2009. READ A LETTER FROM OUR CEO › LEARN MORE › READ MORE + Jennifer Foyle President, Executive Creative Director – AE & Aerie Jen joined AEO in August 2010 to lead the Aerie brand and expanded her scope to also oversee the strategic vision of American Eagle in 2020, rising to the position of President, Executive Creative Director – AE & Aerie. She has been an instrumental force in Aerie’s rapid expansion to a nearly $2 billion brand and has been the catalyst for fueling the next chapter of growth at AE. In her role, Jen leads Design, Merchandising, Marketing, Visual and Business Strategies. In 2014, Jen revolutionized the intimate apparel industry by bringing body positivity and inclusivity to the forefront with the power of #AerieREAL. This movement has been a game-changer for the Aerie business and for millions of women and girls who have been empowered to love their REAL selves inside and out. Throughout her tenure, Jen has assembled and developed a strong bench of talent at all levels and across functions. Most recently, Jen was recognized as one of the Top Women in Retail by Women in Retail Leadership Circle and was honored with the Vanguard Award from Delivering Good for creating positive change for those in need. In 2022, Jen was named of the 50 Women in Power by WWD x FN x BEAUTYINC for her passion and leadership in continuing to grow the American Eagle and Aerie brands, and was also recognized as Women in Retail’s Top Woman of the Year. Jen was previously honored by AdWeek with a prestigious Brand Genius award, which recognizes exceptional talent, insight, creativity and bravery in business. Aerie’s commitment to body confidence and empowerment has also been recognized with Glossy’s Best Influencer Campaign in 2018, a Femmy Award in 2017, and the NEDA Inspires Award in 2015, among others. Jen began her career at Bloomingdales and held positions of increasing responsibility at Gap Inc. and J. Crew. Prior to joining Aerie in 2010 she was the President of the global lifestyle brand, Calypso St. Barth. Jen has nearly 30 years of experience in the apparel retail industry. READ MORE + Marisa Baldwin Executive Vice President, Chief Human Resources Officer Marisa joined AEO in September 2021 as Executive Vice President – Chief Human Resources Officer, overseeing all aspects of the associate experience and the company’s vibrant culture. She provides the strategic vision for the human resources team, which includes talent acquisition and retention, learning and development, total rewards, and people operations and analytics. Marisa also provides executive oversight for the AEO Better World Foundation and IDEA. AEO’s most important asset is its people and Marisa is committed to upholding a community of belonging and purpose where associates are excited to work and grow their careers. Marisa has more than 25 years of experience in Human Resources and most recently held the position of EVP – CHRO for Ascena retail group. Before joining AEO, she served in leadership roles focused on growth and expansion of Starbucks and building a culture of inclusion at Diageo, North America. READ MORE + Sarah Clarke Executive Vice President – Chief Supply Chain and Technology Officer Sarah joined AEO in October 2023 as Executive Vice President – Chief Supply Chain Officer. In this role, she directs all facets of the company’s global supply chain operations, including Product Development, Sourcing, Production, and Distribution for AEO’s diverse portfolio of brands, as well as Quiet. Sarah’s role expanded to Chief Supply Chain and Technology Officer in October 2024. Under her leadership, the Technology team is driving innovation, evolving as a strategic enabling partner and playing a pivotal role in advancing AEO’s business priorities. With a talent-first and performance-driven approach, Sarah is dedicated to achieving operational excellence and driving robust commercial results through a best-in-class team. Sarah is a strategic leader with more than two decades of extensive experience in supply chain management across several large-scale, multi-brand retail organizations. Prior to joining AEO, she served as Chief Supply Chain Officer at PVH Corporation, where she was instrumental in overseeing global supply chain operations. Sarah also held significant leadership roles at Gap Inc., where she spearheaded optimizing the company’s supply chain and managed key initiatives in New York, San Francisco and Hong Kong. Throughout her career, Sarah has successfully led major integrations, including Warnaco at PVH and Athleta at Gap Inc., demonstrating her expertise in driving growth and operational efficiency. Sarah has been a valued member of the Executive Board of the American Apparel & Footwear Association (AAFA) since 2018, serving as Chair from 2022 to 2023. Additionally, she contributes as a non-executive board member of American Securities. READ MORE + Mike Mathias Executive Vice President, Chief Financial Officer Mike first joined the company more than 20 years ago and has a deep knowledge of AEO’s stores and operations, in both finance and operational areas including e-commerce, store finance, Aerie planning, strategy and business development. In his current role, Mike oversees numerous business areas, including Finance, Legal, Real Estate & Construction, Global Asset Protection, Workforce Management, Internal Audit, Investor Relations and Corporate Communications. Mike is a strategic leader with a unique and significant understanding of the company’s industry-leading business. His operational and financial expertise are instrumental in driving AEO’s profitable growth. From 2017 – 2020, Mike served as AEO’s Senior Vice President – Financial Planning & Analysis. From 2016 – 2017, he departed AEO to serve as VP, Financial Planning and Analysis at General Nutrition Centers, Inc. Mike began his career at May Company. READ MORE + Valerie van Ogtrop Executive Vice President – Brand Operations Valerie joined AEO in October 2023 as Executive Vice President – Brand Operations where she has full accountability for Brand Finance and Strategy, Merchandise Planning, Workforce Management, and AEO Stores and Store Operations throughout the U.S. and Canada. In this role, Valerie utilizes her deep industry knowledge to set the long-term vision for driving greater brand collaboration and fueling continued profitable topline and bottom-line growth across the American Eagle and Aerie brands. Valerie joins AEO after spending 19 years with J.Crew, where she most recently led the expansion of Madewell as Executive Vice President – Brand Operations. She previously held several leadership roles at Gap Inc. in Merchandising, Merchandise Planning, and Corporate Planning. READ MORE + Follow AEO Inc. © 2025 AEO Management Co. All Rights Reserved. | Privacy Notices | Terms of Use"
    },
    {
      "url": "https://www.eaglesnestbrisbane.com.au/",
      "text": "Eagles Nest - Brisbane's Best Rooftop Event Space Menus Corporate Functions Private Events Bar Contact Book a Table Menus Promotions Corporate Functions Private Events Bar Bookings Contact 1800 088 388 Book a Table Brisbane Rooftop bar and Event Venue A Leading Brisbane Rooftop Bar and Events Venue Rooftop Sunset Drinks and Corporate Event Venue Eagles Nest Brisbane offers a tapas style bar menu complemented by a range of signature cocktails, Champagne, wine and craft beer. Add some chilled music and there’s no better spot to catch the city’s spectacular sunsets. Eagles Nest Brisbane can also be booked for exclusive use. The spectacular rooftop views providing the ideal setting for both corporate and private events. Reservations are strongly recommended 1800 088 388. Our Menus Phone 1800 088 388 Address Level 12, The Point Brisbane Hotel, Lambert Street Open Times Thurs - Sun : 3pm - 9pm Mon - Wed: CLOSED Book a Table Menus Tapas Menu Cocktail Menu Beer, Wine & Spirits Menu Yoga & Pilates Rooftop Wellness at Eagles Nest Every Sunday, Yoga 8am · Pilates 9am\r\nStart your Sunday above it all. Join us at Eagles Nest Brisbane for rejuvenating rooftop wellness sessions, fea... See Offer New Event! Trivia Night at Eagles Nest – Every Thursday! Get ready for Trivia Night, the ultimate midweek hangout! Join us every Thursday for a fun-filled evening brought to you by the trivia pros at Quiz Me... See Offer / Rooftop Wellness at Eagles Nest Every Sunday, Yoga 8am · Pilates 9am Start your Sunday above it all. Join us at Eagles Nest Brisbane for rejuvenating rooftop wellness sessions, featuring back-to-back Yoga and Pilates overlooking the city skyline. Led by expert instructors, each class blends mindful movement with stunning morning views — the perfect way to reset for the week ahead. Complimentary for hotel guests $10 per class for external guests 50% off our Continental Breakfast after class Spots are limited — bookings essential. We kindly ask that you arrive 10 minutes early to sign-in at reception. Valid Dates: Every Sunday Reserve your spot Trivia Night at Eagles Nest – Every Thursday! Get ready for Trivia Night , the ultimate midweek hangout! Join us every Thursday for a fun-filled evening brought to you by the trivia pros at Quiz Meisters . Put your knowledge to the test while enjoying breathtaking views from our rooftop bar, sipping on cold drinks, and munching on delicious bites. It's the perfect combo of brains, banter, and good times! Here’s what’s in store: Free Entry – No cover charge, just bring your A-game! Awesome Prizes – The more you know, the more you win Great Vibes – Chill with friends, make new ones, and soak up the atmosphere Whether you’re a trivia champ or just in it for the laughs, it’s always a blast. So, gather your squad, grab your drink of choice, and let’s get quizzical! See you every Thursday at Eagles Nest for the most fun you can have on a rooftop! Quiz Meisters are in the house, and it's game on! Trivia Night Details: Every Thursday, Eagles Nest Rooftop Bar 6:30 PM - 8:30 PM Free Entry | Fun Prizes | Great Views Check out Quiz Meisters for more information. Get ready to flex those brain muscles! From $Free entry Book A Table Today! Book a corporate event space with a difference Corporate Functions Discover More Eagles Nest Brisbane is a versatile function space catering for a range of events in various settings, from an executive board meeting for 12 to a cocktail party for 120. Host your clients or reward your staff with a Christmas party... Learn More Download Events Kit Corporate Functions Eagles Nest Brisbane is a versatile function space catering for a range of events in various settings, from an executive board meeting for 12 to a cocktail party for 120. Host your clients or reward your staff with a Christmas party to remember. This unique space boasts Brisbane’s best rooftop views and our staff can tailor event management solutions to meet your individual requirements. Conveniently situated inside The Point Brisbane Hotel at Kangaroo Point, Eagles Nest Brisbane offers exclusive accommodation rates with complimentary Wi-Fi internet access for all events. Download Events Kit Impress your guests with Brisbane's top rooftop bar views Private Events Eagles Nest Brisbane encompasses breathtaking views towards the Brisbane River, city skyline and Story Bridge, a spectacular sight when lit up after dark. Situated exclusively on the top floor of The Point Brisbane Hotel, this rooftop event space provides the ideal setting for... Learn More Private Events Eagles Nest Brisbane encompasses breathtaking views towards the Brisbane River, city skyline and Story Bridge, a spectacular sight when lit up after dark. Situated exclusively on the top floor of The Point Brisbane Hotel, this rooftop event space provides the ideal setting for engagement parties, birthdays and other special occasions. Eagles Nest Brisbane, located within The Point Brisbane Hotel at Kangaroo Point, offers onsite deluxe accommodation with complimentary Wi-Fi internet access for all events. Event Kit Take your weekend to new heights... Bar bookings Learn More Open from 3pm every Thursday, Friday, Saturday and Sunday. Eagles Nest Brisbane will take you to even greater heights in 2025! Get in early, book your next event now. Enjoy sunset cocktails and tapas at Brisbane's premier roofto... Download Event Kit Learn More Bar bookings Open from 3pm every Thursday, Friday, Saturday and Sunday. Eagles Nest Brisbane will take you to even greater heights in 2025! Get in early, book your next event now. Enjoy sunset cocktails and tapas at Brisbane's premier rooftop bar, Eagles Nest Brisbane. Group bookings available for 10 people or more. Bookings - Free call: 1800 088 388 or Email: sales@eaglesnestbrisbane.com.au Being a rooftop bar, Eagles Nest Brisbane can be impacted by poor weather conditions. The safety of all staff and guests is always a priority. Please Note Eagles Nest Brisbane is strictly an 18 years and over venue. Event Kit Our Event Spaces Photo Gallery Kangaroo Point, Brisbane Roof top bar, located at The Point Brisbane Hotel A leading Brisbane rooftop bar with stunning views or Brisbane City and Brisbane River, its the perfect spot to celebrate or unwind. Eagles Nest Level 12, The Point Brisbane Hotel Directions Get directions Call Enquire now Great way to spend a Sunday afternoon. Fabulous Duet playing. Good Tapas and I would like to send a big thanks to Jasmine for all your help selecting the cocktails; they were absolutely fantastic! You nailed it. - Amanda W - Tripadvisor NYE party here was excellent. Great views; terrific venue with a lot of fun people. It is a great event with excellent music that catered for all ages. Loved it and woiuld go back. - antmanb - Tripadvisor This is the second time we have held an event at The Point. Guests attending the function are always surprised with the position and the sensational view. A special thanks the Function team as they are more than helpful with all our requirements. - triantafilla - Tripadvisor Awesome place for our company Xmas party, the staff really looked after us, food was great and the views are awesome. No hesitation in recommending them! - tobyu415 - Tripadvisor Fantastic place for my twins 21st party, the staff really looked after us, food was great and the views are awesome. Would consider booking another function. We also stayed in the hotel overnight everything was great, rooms very clean and spacious . - E8859IIjoannef - Tripadvisor Venue certainly has a very comfortable bar vibe with the best view over the river and city. We very much enjoyed the tapas treats which were of a wide variety and were prompt in their delivery. - Julie H - Tripadvisor Make an Enquiry Please fill out the online enquiry form below and one of our friendly staff will be in contact with you as soon as possible. © Copyright 2025 Eagles Nest Restaurant Website & Photography by © Pebble Design Back To Top Home Privacy Opening Times Thur - Sun: 3pm - 9pm Mon - Wed: CLOSED Level 12, The Point Brisbane Hotel, Lambert Street, Kangaroo Point Queensland 4169 Phone 1800 088 388 Email info@eaglesnestbrisbane.com.au Book a table"
    },
    {
      "url": "https://nestbedding.com/pages/our-team",
      "text": "Meet the team at Nest Bedding\n– Nest Bedding® Lifetime Renewal Exchange A comfort layer exchange you can redeem once , at any time, to alter the feel of your mattress or to increase its lifespan (this option saves you time and money while reducing waste). Learn more Account Log in Sign Up ` Forgot password? Subscribe to our newsletter for updates, new products and special offers! Sign up for SMS messaging By checking the box, I consent to receive recurring automated marketing by text message through an automatic telephone dialing system. Consent is not a condition to purchase. Message and Data rates may apply. Opt-out by texting STOP. Feels Guide Select plush if you... …are a side sleeper. …are looking for pressure point relief and gentle support. …are a lighter sleeper, under 140 lbs. …know plush is right for you and prefer a soft mattress. Select medium if you... …are a combination sleeper, back and side sleeper. …want to feel supported by your mattress, with a little give. …are an average weight. …are not sure which feel to choose. Medium is our most popular! Select firm if you... …mainly sleep on your back or stomach. …are a side or back sleeper who require additional lumbar support. …recommended to, by a medical professional. …prefer a firm sleeping surface, with a plush pillow top. Size Guide Size Inches Crib 5 28 x 52 x 5 Crib 6 28 x 52 x 6 Twin 38 38 x 75 Twin XL 38 38 x 80 Twin 39 39 x 75 Twin XL 39 39 x 80 Full 54 x 75 Queen 60 x 80 King (Eastern) 76 x 80 CalKing 72 x 84 Sleeper Guide Back Sleeper Back sleepers typically wake up in the morning on their backs. Side Sleeper Side sleepers will generally spend the most time sleeping on their left side Stomach Sleeper Stomach sleepers gravitate towards firm surfaces. Combination Sleeper Combination sleepers are a mix of many sleep positions. If you are not quite sure which mattress fits your sleep style, don't worry. Speak with an Expert Nestologist today! Material Guide Hybrid Our US made hybrid mattresses are constructed with individually wrapped coil systems that relieve pressure and add extra support to the edge of the bed. Specialty Foam Engineered to with improved responsiveness and to regulate heat more efficiently. Memory Foam Traditional foam that is much softer, designed to relieve pressure points and conform to your body. Latex Durable, Relieves Pressure Points, Responsive, Natural Material. Organic mattresses are Global Organic Latex Standard certified that the organic latex used in our products contain more than 95% of certified organic raw latex. Natural & Organic Soft, durable wool sourced from New Zealand and Certified Organic Cotton. We use organic materials in our Natural mattresses. Our Organic mattresses meet Global Organic Textile Standard (GOTS) requirements; ensures that organic cotton and organic wool used in our products are free from harmful chemicals. Dual Firmness Our luxury hybrid mattresses are available in dual firmness. Either side of the mattress can be customized to the sleeper; ideal for couples who can't make up their mind. Flippable Two Nest Bedding mattresses are flippable. Not sure which firmness you'll want, then this is a great fit. Commitment to Sustainability It’s our hope that more companies will focus on making sustainable products in the future. Until then, you can rely on Nest Bedding to make sustainable, environmentally-friendly bedding. Read more About Nest Bedding – Nest Bedding® Subscribe For SMS messaging By submitting I consent to receive recurring automated marketing by text message through an automatic telephone dialing system. Consent is not a condition to purchase. Message and Data rates may apply. Opt-Out by texting STOP. SUBMIT A little bird told us you live near a Nest Bedding showroom. Skip to content Link to external website Opens in new window Link to external website. Opens in a new window Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search Mattresses Mattresses Sparrow Hybrid Most Popular Owl Natural Hybrid Most Comfortable Raven Flippable Hybrid Quail Love & Sleep Best Value Starling Contour Grid New! Finch Natural View all Mattresses Kids Mattresses Puffin Big Kids Bed Lark Natural Kids Bed View all Kids Mattresses Toppers Cooling Topper Pillow-Top Latex Topper View all Toppers - - 20% Off + Free Bundles Awarded Most Comfortable Ideal for couples with different sleep styles and preferences. Designed to last 2-3 times longer than most mattresses. Sparrow Signature Hybrid Starting at $980.80 $1,226.00 Product questions? Call +1 (510) 372-1414 Bedding Pillows Easy Breather Award-Winning Easy Breather Natural 70% Off Side Sleeper EB Jr. (Just-right) View all Pillows Bedding Sets Percale Cotton Sets New! Sheet Sets + Pillowcases Duvet Covers + Shams Pillowcases Sets View all Bedding Sets Protectors Cooling Cotton Protector Organic Mattress Protector Wool Mattress Protector Cotton Pillow Protectors New Sizes! View all Protectors Comforters & Blankets Pure Silk Comforter Soft Wool Comforter Lightweight Bamboo Quilt New! Weighted Blanket View all Comforters & Blankets - - Affordable Luxury Comfortable for Every Sleeper An adjustable design for every style of sleeper. Cooling technology with a shredded foam blend and 2-day shipping. Easy Breather Shredded Foam Pillow Starting at $119.00 Product questions? Call +1 (510) 372-1414 Furniture Foundations & Frames Nest HomeBase Most Popular Woodland Platform Harmony Adjustable Base 15% Off Balance Adjustable Base 15% Off Azara Bed Frame Mercury Bed Frame Simple Metal Frame View all Foundations & Frames Bedroom Sets Azara Set Mercury Set Kids Furniture 10-Piece Play Couch New! View all Kids Furniture - - Sturdy Nest Foundations The Most Versatile Mattress Support Assembled in the USA and equipped with a built-in USB Power Kit. It's a foundation, platform bed, and charging station, All-In-One! HomeBase Foundation Starting at $449.00 Product questions? Call +1 (510) 372-1414 Home & Health Beauty & Apparel Silk Pillowcase Silk Sleep Masks Hydrating Hand Cream New! Sugar Lip Scrub New! View all Beauty & Apparel Sleep Collection Sleep Essential Oils Wellness Essential Oils Ceramic Diffuser Teddy Diffuser New! Rainbow Diffuser New! Bedtime Lip Mask New! Furry Family Members Bolstered Pet Bed View all Furry Family Members Laundry Care Wool Dryer Balls New! Laundry Detergent Laundry Spray Laundry Essential Oils View all Laundry Care - - NEW | Laundry & Sleep Products! Experience Natural Laundry Softening With our set of three unscented, extra-large dryer balls crafted from pure, organic New Zealand wool. Wool Dryer Balls Starting at $25.00 Product questions? Call +1 (510) 372-1414 SALE Reviews Customer Reviews Industry Reviews Store Reviews 30,000+ 5-star Reviews 3,500+ 5-star Google Reviews 1,500+ 5-star Yelp Reviews 25,000+ 5-star Product Reviews \"We ordered the medium firmness and it wasn't firm enough. Ordered the insert and the bed is perfect now. The customer service was excellent. Very responsive and willing to work with you to make the bed just right. We worked with Zachary; he was great!\" Angie N. Help Track Order Exchanges and Returns FAQ Contact Us Start my Gift Registry Financing Accessibility Policy Customer Support We are an expert sleep company, based here in the USA, available 7 days a week, 12 hours a day. (888) 992-2001 Stores Santa Monica, CA Chico, CA Houston, TX Chicago, IL Columbus, OH View all locations N N E E S S T T Showrooms Account Sweet Dreams! Log In Cart items Your Cart Subtotal $0.00 USD Taxes TBD TOTAL $0.00 USD Your cart Your cart is currently empty. Enable cookies to use the shopping cart Continue shopping Finance with AS LOW AS 0% APR ( Learn more ) Or pay with By selecting check out, you agree to the Terms of Service Menu logo Mattresses Mattresses Sparrow Hybrid Most Popular Owl Natural Hybrid Most Comfortable Raven Flippable Hybrid Quail Love & Sleep Best Value Starling Contour Grid New! Finch Natural View all Mattresses Kids Mattresses Puffin Big Kids Bed Lark Natural Kids Bed View all Kids Mattresses Toppers Cooling Topper Pillow-Top Latex Topper View all Toppers Bedding Pillows Easy Breather Award-Winning Easy Breather Natural 70% Off Side Sleeper EB Jr. (Just-right) View all Pillows Bedding Sets Percale Cotton Sets New! Sheet Sets + Pillowcases Duvet Covers + Shams Pillowcases Sets View all Bedding Sets Protectors Cooling Cotton Protector Organic Mattress Protector Wool Mattress Protector Cotton Pillow Protectors New Sizes! View all Protectors Comforters & Blankets Pure Silk Comforter Soft Wool Comforter Lightweight Bamboo Quilt New! Weighted Blanket View all Comforters & Blankets Furniture Foundations & Frames Nest HomeBase Most Popular Woodland Platform Harmony Adjustable Base 15% Off Balance Adjustable Base 15% Off Azara Bed Frame Mercury Bed Frame Simple Metal Frame View all Foundations & Frames Bedroom Sets Azara Set Mercury Set View all Bedroom Sets Kids Furniture 10-Piece Play Couch New! View all Kids Furniture Home & Health Beauty & Apparel Silk Pillowcase Silk Sleep Masks Hydrating Hand Cream New! Sugar Lip Scrub New! View all Beauty & Apparel Sleep Collection Sleep Essential Oils Wellness Essential Oils Ceramic Diffuser Teddy Diffuser New! Rainbow Diffuser New! Bedtime Lip Mask New! View all Sleep Collection Furry Family Members Bolstered Pet Bed View all Furry Family Members Laundry Care Wool Dryer Balls New! Laundry Detergent Laundry Spray Laundry Essential Oils View all Laundry Care SALE Reviews Customer Reviews Industry Reviews Store Reviews Help Track Order Exchanges and Returns FAQ Contact Us Start my Gift Registry Financing Accessibility Policy Stores CALL (888) 992-2001 CHAT EMAIL customerservice@nestbedding.com Search Submit Facebook Twitter Pinterest Instagram YouTube Nest Bedding Awards & Certifications Our Team Albany/Berkeley, CA – NestDNG 4.2 reviews See all showrooms BACK TO TOP Meet the flock behind Nest Bedding. Meet the family at Nest Bedding that literally has your back. We're a family-owned and operated D2C brand, making strides to improve sleep and preserve our planet for future generations. Meet the flock behind Nest Bedding. Meet the family at Nest Bedding that literally has your back. We're a family-owned and operated D2C brand, making strides to improve sleep and preserve our planet for future generations. Our Leadership Team [roll over a team member to reveal their favorite bird] Christian Alexander Owner & CEO Christian helped to estblish the first Nest Bedding showrooms in 2012. He officially joined his father's business in 2015 and brought a wealth of medical knowledge and military leadership experience with him. He served honorably in the US Navy as an FMF Hospital Corpsman, and then earned a Bachelors in Science and Healthcare Administration. Now he's working with the very capable team he had the privilege of establishing, to bring you the highest standard of quality in sleep and the best customer experience in the mattress and bedding industry. Favorite Nest Product: My 7-year-old Easy Breather Pillow , aptly named “Squishy”. Favorite Recreational Activity: Cooking, playing my ukulele, and mountain biking with my kids. Favorite Bird: Great Horned Owl Mikey Rademacher Director of Operations Coming from a Barista position with one company, a sales position with another, and working with youth, my past positions have been heavily influenced by the relationships that I have created with others. I’ve enjoyed taking those past experiences and applying them to my Operations position here at Nest Bedding! Outside of work, I love spending time with my family, friends, and pets. I enjoy getting outside and working in the backyard. My family is what (literally) gets me out of bed in the morning and makes me excited for the day! Favorite Nest Product: The Easy Breather Pillow , best pillow out there! Favorite Recreational activity: Golfing and Fishing. Favorite Bird: Macaw Brooke Alexander Owner & CBO As Chief Brand Officer of Nest Bedding, I bring a deep passion for health and wellness to everything we do. I started my career as a massage therapist, specializing in sports therapy and holistic medicine, working with athletes across the U.S. at Ironman events, marathons, and biking competitions. After settling in Los Angeles in 2014, I joined the family business and opened Nest Bedding’s first LA showroom. Applying my expertise in body mechanics, I helped customers find the best sleep solutions. Since then, I’ve led the expansion of our retail operations and taken charge of product development, design, branding, and customer experience, shaping Nest Bedding into a leader in luxury sleep solutions. Favorite Nest Product: My Sparrow mattress . I wish I could take it with me everywhere! Favorite Recreational activity: Mountain biking for sure is my favorite pass time. My brother and our CEO, Christian, will have said the same thing only because he is a copycat and I introduced him to the sport. Favorite Bird: Allen’s Hummingbird Heathir Davis Director of Customer Engagement I have always had jobs working with people and love being in the customer service industry. I joined the Nest family in October of 2018, exactly 1 month before a wildfire burned down the town where we lived in Northern California. Now we are living in Florida and loving it! I love my family and my dogs. I count it a privilege to lead such an amazing customer service team. They truly care about people and want them to sleep better. Favorite Nest Product: My Owl Latex Hybrid mattress . Best sleep ever! Favorite Recreational activity: All things Disney! Favorite Bird: Cockatoo Charles Eisenbarth Chief Solutions Officer I’ve been a part of the Nest Bedding team since April of 2018. Prior to that, my career consisted of various roles in retail, customer service, operations, and IT… which provided a sound professional foundation for my transition to Nest. Since then my role has expanded to incorporate all of those functions to varying degrees and more! For me, every day at Nest presents a new opportunity to refine or reframe processes that will allow Nest teams to be more successful in what their day requires of them. Favorite Nest Product: Finch (Firm), Easy Breather Side Sleeper , and Organic Cotton Sheets ! Favorite Recreational activity: Traveling, camping and movie nights with the family. Favorite Bird: Red-tailed Hawk Marie Murray Senior Marketing Manager From photography and digital design to e-commerce management, my journey has shaped my passion for creating exceptional online experiences. Over the years, I’ve honed my skills in operations, marketing, and website management, gaining valuable insight into what makes an online business thrive. Since joining Nest Bedding in 2019, I’ve been dedicated to crafting a seamless and relaxing shopping experience—helping customers turn dreams into reality, one comfy mattress at a time! Favorite Nest Product: My Easy Breather Side Sleeper Pillow that works for my ever changing sleep positions. Favorite Recreational activity: Apartment gardening, photography, and curling up on the couch to watch anime. Favorite Bird: Real, a carrion crow. For fun, Ash's sleepy Rowlet from Pokemon. Trevor Davis Chief People Officer Starting in 1994 I had a Homebuilding company. For 7 years we built up a large successful company in Dallas Texas. Deciding on a career change I went in a totally other direction and was a Director of the Boys and Girls Clubs and served as a pastor for 17 years. I've been fortunate to speak and do training across the US and really enjoy being a problem solver. I've also been privileged to sit as a board member of many unique organizations. I'm someone who is passionate about building and growing team members and helping people and organizations move forward. I am fortunate enough to be in charge of Culture and People. Nest bedding has an amazing group of Nestologists that make this one of the best-rated places to be employed. Favorite Nest Product: My Easy Breather side sleeper pillow and my Owl mattress . Favorite Recreational activity: Traveling and experiencing different Cultures and places all over the planet. Favorite Bird: Big Bird…yeah…from sesame street…. Or a Sand Crane. Christian Alexander Owner & CEO Christian helped to estblish the first Nest Bedding showrooms in 2012. He officially joined his father's business in 2015 and brought a wealth of knowledge and leadership experience with him. Serving in the US Navy as an FMF Hospital Corpsman, and then achieving Bachelors in Science and Healthcare Administration. Now he's working with the very capable team he had the privilege of establishing, to bring you the highest standard of quality in sleep and the best customer experience in the mattress and bedding industry. Favorite Nest Product: My 7-year-old Easy Breather Pillow , aptly named “Squishy”. Favorite Recreational Activity: Cooking, playing my ukulele, and mountain biking with my kids. Favorite Bird: Great Horned Owl Brooke Alexander Owner & CEO I have always been fascinated with the health and wellness of the human body. At a young age, I pursued a career as a massage therapist where I specialized in sports therapy and holistic medicine. For several years I was fortunate enough to travel around the US working with athletes in ironman events, marathons and biking competitions. I settled in the Los Angeles area in 2014 and soon after I moved to LA, I had the opportunity to join the family business and open the first Nest Bedding showroom in Los Angeles California. There I found I was able to apply my unique expertise and knowledge of the human body to help guide customers to the best mattress and bedding solutions for their needs. Since then, I have paved the way for the expansion of all retail operations within Nest Bedding. I have also taken a lead in product development, design, branding, and customer experience. It has been a great honor of mine to have been able to take our family business to the next level with our unique luxury product offerings. Favorite Nest Product: My Sparrow mattress . I wish I could take it with me everywhere! Favorite Recreational activity: Mountain biking for sure is my favorite pass time. My brother and our CEO, Christian, will have said the same thing only because he is a copycat and I introduced him to the sport. Favorite Bird: Allen’s Hummingbird Charles Eisenbarth Chief Solutions Officer I’ve been a part of the Nest Bedding team since April of 2018. Prior to that, my career consisted of various roles in retail, customer service, operations, and IT… which provided a sound professional foundation for my transition to Nest. Since then my role has expanded to incorporate all of those functions to varying degrees and more! For me, every day at Nest presents a new opportunity to refine or reframe processes that will allow Nest teams to be more successful in what their day requires of them. Favorite Nest Product: Finch (Firm), Easy Breather Side Sleeper , and Organic Cotton Sheets ! Favorite Recreational activity: Traveling, camping and movie nights with the family. Favorite Bird: Red-tailed Hawk Trevor Davis Chief People Officer Starting in 1994 I had a Homebuilding company. For 7 years we built up a large successful company in Dallas Texas. Deciding on a career change I went in a totally other direction and was a Director of the Boys and Girls Clubs and served as a pastor for 17 years. I've been fortunate to speak and do training across the US and really enjoy being a problem solver. I've also been privileged to sit as a board member of many unique organizations. I'm someone who is passionate about building and growing team members and helping people and organizations move forward. I am fortunate enough to be in charge of Culture and People. Nest bedding has an amazing group of Nestologists that make this one of the best-rated places to be employed. Favorite Nest Product: My Easy Breather side sleeper pillow and my Owl mattress . Favorite Recreational activity: Traveling and experiencing different Cultures and places all over the planet. Favorite Bird: Big Bird…yeah…from sesame street…. Or a Sand Crane. Mikey Rademacher Director of Operations Coming from a Barista position with one company, a sales position with another, and working with youth, my past positions have been heavily influenced by the relationships that I have created with others. I’ve enjoyed taking those past experiences and applying them to my Operations position here at Nest Bedding! Outside of work, I love spending time with my family, friends, and pets. I enjoy getting outside and working in the backyard. My family is what (literally) gets me out of bed in the morning and makes me excited for the day! Favorite Nest Product: The Easy Breather Pillow , best pillow out there! Favorite Recreational activity: Golfing and Fishing. Favorite Bird: Macaw Heathir Davis Director of Customer Engagement I have always had jobs working with people and love being in the customer service industry. I joined the Nest family in October of 2018, exactly 1 month before a wildfire burned down the town where we lived in Northern California. Now we are living in Florida and loving it! I love my family and my dogs. I count it a privilege to lead such an amazing customer service team. They truly care about people and want them to sleep better. Favorite Nest Product: My Owl Latex Hybrid mattress . Best sleep ever! Favorite Recreational activity: All things Disney! Favorite Bird: Cockatoo Marie Murray Senior Marketing Manager From photography and digital design to e-commerce management, my journey has shaped my passion for creating exceptional online experiences. Over the years, I’ve honed my skills in operations, marketing, and website management, gaining valuable insight into what makes an online business thrive. Since joining Nest Bedding in 2019, I’ve been dedicated to crafting a seamless and relaxing shopping experience—helping customers turn dreams into reality, one comfy mattress at a time! Favorite Nest Product: My Easy Breather Side Sleeper Pillow that works for my ever changing sleep positions. Favorite Recreational activity: Apartment gardening, photography, and curling up on the couch to watch anime. Favorite Bird: Real, a carrion crow. For fun, Ash's sleepy Rowlet from Pokemon. Based in California, Serving the USA Based in California, Serving the USA Californians knows how to party and as it turns out they know how to work really well too! We are based in Chico, CA and have nesters across the United States. Californians knows how to party and as it turns out they know how to work really well too! We are based in Chico, CA and have nesters across the United States. Celebrating 10+ Years Founded in 2011, Nest Bedding was one of the first bed-in-a-box brands, now sells mattresses for every-body in your home. They ship factory-direct right to your doorstep for free, with an industry-leading 365-Night Sleep Trial. Complete your bedroom with an array of luxury top-of-bed products by Nest, including pillows, sheet sets, duvet covers, comforters, blankets, toppers, and sleep accessories. We continue to strive to make our mattresses, bedding, and furniture, as sustainable as possible, through increased quality and consumer-friendly policies. Our goal is to help our customers get the most life possible out of their Nest. Thank you for shopping with us. -Christian Alexander, CEO and Expert Nestologist Commitment to Comfort & Sustainability In 2021, Nest Bedding became the world’s first mattress company to offer a Lifetime Renewal Exchange (LRE) program for our luxury mattresses. The LRE is a one-time comfort guarantee that can be redeemed either during your first 365-nights of sleep or years after. Renew your mattress when it’s right for you. Breath new life into your mattress with an exchange for a brand new comfort layer and save yourself the time and money it takes to shop for a new mattress. Celebrating 10+ Years Founded in 2011, Nest Bedding was one of the first bed-in-a-box brand to sell mattresses for every-body in your home. We ship factory-direct right to your doorstep for free, with our risk-free industry-leading 365-Night Sleep Trial. Complete your bedroom with an array of luxury top-of-bed products, including pillows, sheet sets, duvet covers, comforters, blankets, toppers, and other sleep accessories. In the ten years of operation, we've seen a lifetime of change. With wide eyes, we look to the future, but our goals stay the same; to help our customers get the best sleep of their lives on a Nest Bedding mattress. Thank you for shopping with us. -Christian Alexander, CEO and Expert Nestologist Commitment to Comfort & Sustainbility In 2021, Nest Bedding became the world’s first mattress company to offer a Lifetime Renewal Exchange (LRE) program for our luxury mattresses. The LRE is a one-time comfort guarantee that can be redeemed either during your first 365-nights of sleep or years after. Renew your mattress when it’s right for you. Breath new life into your mattress with an exchange for a brand new comfort layer and save yourself the time and money it takes to shop for a new mattress. A LITTLE BIRDIE TOLD ME... We use bird avatars for our team pictures. But definitely do not use bird-calls around the office. A LITTLE BIRDIE TOLD ME... We love what we do, but we're pretty big on the whole work-life balance thing too. A LITTLE BIRDIE TOLD ME... Some of us are surprisingly good at throwing nerf darts into that one mug sitting on our operations manager's desk. A LITTLE BIRDIE TOLD ME... We have a Slack Channel completely dedicated to our Nest pets. #puppylife A LITTLE BIRDIE TOLD ME... We use bird avatars for our team pictures. But definitely do not use bird-calls around the office. A LITTLE BIRDIE TOLD ME... We love what we do, but we're pretty big on the whole work-life balance thing too. A LITTLE BIRDIE TOLD ME... Some of us are surprisingly good at throwing nerf darts into that one mug sitting on our operations director's desk. A LITTLE BIRDIE TOLD ME... We have a Slack Channel completely dedicated to our Nest pets. #puppylife We're Hiring! We've been growing, adding talented new team members every year to our company. From our showrooms, to our warehouse, to our administrative teams, Nest Bedding is a great place to work! (See job openings on Indeed) Shop Nest Bedding Step into a Nest Bedding showroom to experience a peaceful, restful, and helpful buying experience. Our knowledgeable and non-pushy Nestologists are here to help. Visit a Showroom Take the guess work out of shopping for a mattress and start building your dream bedroom with a side-by-side comparison of all Nest Bedding Mattresses. Compare Mattresses We periodically run sales on our mattresses, an array of luxury bedding, and furniture items. Check out the current sale, or subscribe for future promotions. Shop the Sale Follow The Flock @nestbeddingorganics Facebook Twitter Pinterest Instagram YouTube Speak With A Nestologist Our experts can help you choose the perfect mattress. (888) 992-2001 Return to top @nestbeddingorganics About Real Reviews Our History Our Team Refer a Friend Join Our Affiliate Program Vacation Destinations Sleep Doctor Blog Sustainability Purity & Certifications Customer care FAQ Contact Us Gift Registry Returns, Exchanges and Warranties Financing Lifetime Warranty Lifetime Renewal Exchange Accessibility Shopping Mattresses Kids & Baby Pillows Protectors Sheets & Duvet Comforters Toppers Bed Frames Platforms Bedroom Pets Gifts Sale Sleep Collection Hot Sleepers Shop by Size Sign Up For News & Perks Subscribe SMS Messaging SIGN UP Submit Follow The Flock Facebook Twitter Pinterest Instagram YouTube About Real Reviews Our History Our Team Refer a Friend Join Our Affiliate Program Vacation Destinations Sleep Doctor Blog Sustainability Purity & Certifications Customer care FAQ Contact Us Gift Registry Returns, Exchanges and Warranties Financing Lifetime Warranty Lifetime Renewal Exchange Accessibility Shopping Mattresses Kids & Baby Pillows Protectors Sheets & Duvet Comforters Toppers Bed Frames Platforms Bedroom Pets Gifts Sale Sleep Collection Hot Sleepers Shop by Size"
    },
    {
      "url": "https://www.eaglesnestatblackwater.com/",
      "text": "Gastro Pub – Crestview, FL – Eagle's Nest at Blackwater Order for pick up Online! Online Ordering Call Us Now! (850) 331-3594 4927 Antioch Rd Crestview Florida 32536 United States Home Menu Cocktail Menu Kids Menu Dessert Menu Brunch Menu All Day Menu Our Weekly Specials Events Party Rooms Outdoor Pavilion Gallery Contact Eagle’s Nest at Blackwater: Where Flavor Takes Flight Now on DoorDash! Order Now! DoorDash Experience the Best Gastro Pub in Crestview, FL Eagle's Nest at Blackwater is your go-to gastropub in Crestview, FL, offering a delightful dining experience with a wide range of food options and a vibrant atmosphere. Locally owned and dedicated to providing great food and drinks, we strive to create an enjoyable and engaging environment for all our guests. Call (850) 331-3594 today to make your reservation! Our Restaurant's Menu Indulge in our diverse menu featuring classic pub fare and innovative dishes. With 20 draft beers on tap, brunch options, and daily meal specials, there's something for everyone to enjoy. Whether you're in the mood for a hearty burger, fresh seafood, or a light salad, our menu has it all. Learn More Weekly Events at Our Gastro Pub Join us for special events every day of the week! From live music and trivia nights to themed parties and seasonal celebrations, there's always something happening at Eagle's Nest. Check our events calendar to stay updated on the latest happenings and make your dining experience even more memorable. Learn More Party Rooms Are you looking for a private space to host your next event? Our party rooms are perfect for birthdays, anniversaries, corporate gatherings, and more. With customizable menus and dedicated service, we ensure your event is a success. Contact us to book your party room today. Learn More Outdoor Pavilion Enjoy the beautiful Florida weather in our outdoor pavilion. This spacious area is ideal for casual dining, socializing with friends, or hosting special events. With comfortable seating and a relaxed atmosphere, our outdoor pavilion is a favorite spot for many of our guests. Learn More Why Choose Us? At Eagle's Nest at Blackwater, we are committed to providing an exceptional dining experience. Our locally-owned gastropub prides itself on offering high-quality food and drinks, a welcoming atmosphere, and outstanding customer service. Locally Owned: We are proud to be a part of the Crestview community and support local businesses. Diverse Menu: Our menu caters to all tastes, with a variety of dishes and drinks to choose from. Engaging Atmosphere: From our lively events to our cozy dining spaces, we create an environment where everyone feels welcome. Exceptional Service: Our friendly and attentive staff are here to ensure you have a great time every time you visit. Dinner was fabulous !  We ordered a variety of items off the menu and it exceeded all of our expectations!!!   Jason was great and very knowledgeable about anything we had questions on!   Go check them out!!! We will definitely be back!! — David D Found a new favorite spot for good food and drinks. You can tell Eagle’s Nest cares about every plate they deliver to each customer. The quality of the food was *chefs kiss*. Every single bite did not disappoint. Even better? Sofie (or Sophie - spelling?) was an absolute gem of a server! Would come back just for her service alone! Excited to try every menu item! — Melissa E. Excellent place to enjoy a drink, food, and to wind down at the end of the day. We enjoyed a few days of this place during our stay in the area and were quite pleased. We had dinner specials throughout the week and had a lovely experience. — Eric A. Absolutely sublime! Everything about this restaurant added wonderful ambiance and calmness which added to a relaxing dinner of amazing food. I love how many unique dishes are on the menu and I can't wait to return and try more! — Lillian J. Our server Molly was a delight ! She was patient and knowledgeable. She recommended a tequila that my wife and I both fell in love with. We  had filets of beef , which were delicious and cooked to perfection. The atmosphere was on the verge of being romantic. This was our first time here, but it certainly won't be our last. — Vinyl B. We look forward to serving you at Eagle's Nest at Blackwater! Reach us at (850) 331-3594 for more. BROWSE OUR WEBSITE Home Menu Events Party Rooms Outdoor Pavilion Gallery Contact CONTACT INFORMATION Phone: (850) 331-3594 Email: events @eaglesnestblackwater.com Address: 4927 Antioch Rd Crestview Florida 32536 United States BUSINESS HOURS Indoor Hours Tuesday – Thursday 11am-8pm Friday & Saturday - 11am-9pm Sunday - 10am-8pm Brunch Hours Sunday Brunch - 10am-3pm Pavilion Hours Friday -  4pm-12am Saturday - 10am-12am Sunday - 10am-8pm Drive-Bar Hours Sunday - Thursday - 7:30am-8pm Friday & Saturday - 7:30am-10pm Closed Monday’s Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by:"
    },
    {
      "url": "https://business.crestviewchamber.com/events/details/ribbon-cutting-eagle-s-nest-at-blackwater-16527",
      "text": "Ribbon Cutting: Eagle's Nest at Blackwater - Sep 20, 2024 Skip to content Crestview Chamber would like to thank the following members: Menu Chamber About Us Chamber Staff Board of Directors Chamber Committees Crestview Chamber Scholarship Foy Shaw Tribute Video Strategic Plan Membership New Member Application Membership Benefits Member Directory Member to Member Deals Impact Partnerships Hot Deals Website Advertising Events Wellness & Business Expo Chamber Events Calendar Community Events Calendar Calendar of Events Event Gallery Area Info About Crestview Banking Dining Finance Health Care Job Postings Lodging Okaloosa County Scorecard Okaloosa County Tourism Development Department Real Estate Relocation News & Info Crestview News Bulletin NWF Daily News One Okaloosa EDC Resources Business Resource Center City Government Crestview Police County Government FL Dist 01 House of Representatives Military 7th Special Forces Group Eglin AFB Hurlburt Field Duke Field NAS Whiting Field Okaloosa County Sheriff Department School District State Representative State Senator Ribbon Cutting: Eagle's Nest at Blackwater Join us for a Ribbon Cutting Ceremony on Friday, September 20th at 11:00am. Everyone is welcome...we can't wait to see you there to celebrate with us! Ribbon Cutting: Eagle's Nest at Black... Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Date and Time Friday Sep 20, 2024 11:00 AM - 11:30 AM CDT Location 4927 Antioch Rd Crestview, FL Fees/Admission Open to the Public. There is no cost to attend. Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Business Directory News Releases Events Calendar Hot Deals Member To Member Deals Marketspace Job Postings Contact Us Information & Brochures Join The Chamber Share × Print Email Add to Calendar Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Select Calendar Type × Google Yahoo iCal (Outlook, Apple, or other) Close © 2025 Crestview Area Chamber of Commerce | Site by GrowthZone Crestview Area Chamber of Commerce phone number 850-682-3212 map and address 1447 Commerce Drive | Crestview, FL 32539 email info@crestviewchamber.com facebook Instagram linked in Crestview Chamber would like to thank the following members: © 2025 Crestview Area Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://www.eaglesnestgastropub.com/",
      "text": "Eagleâs Nest â Blackwaterâs Best-Kept Secret Home Menu Catering Private Events Calendar Contact Order noW Reserve Now Blackwater's Hidden Gem: Where Fun and Flavor Take Flight Welcome To Eagle's Nest in Crestview, FL We are a Veteran-owned restaurant open to the public on the stunning Blackwater Golf Course. Come as you are and indulge in delicious food you won't find anywhere else! From an incredible pizza to beautifully crafted cocktails, we have something to delight every palate. â Need some fresh air? Our unique outdoor pavilion bordered by lush trees is the perfect spot for a night (or day!) out. Join us for events like live bands, karaoke, trivia nights, and themed parties. There's fire pits (we have the s'mores kits ready!), cornhole, and bouncy houses to ensure a fun time for all ages. A Taste Of Elevation See Full Menu Exciting Nights See upcoming events Savor The Moment See Catering Sevices Visit Us Address 4927 Antioch Rd, Crestview, FL 32536 Phone (850) 331-3594 Email events@eaglenestblackwater.com social@eaglesnestblackwater.com Business Hours Sunday 10 am - 3pm Monday front bar only 11am - 4pm Tue - Thu 11am 8pm Fri & Sat 11am -9pm Social Media Leave A Message Have a question, want to book an event, or just say hello? Drop us a message, and our team will get back to you soon. We canât wait to connect! Name Email Address Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Home Menu Catering Private Events Calendar Contact Address: 4927 Antioch Rd., Crestview, FL 32536 | Phone: (850) 331-3594 Hours: Mon: Closed | Tue - Thu: 11â¯AM - 8â¯PM | Fri & Sat: 11â¯AM - 8â¯PM | Sun: 10â¯AM - 5â¯PM Designed with â¤ï¸ by SpotOn Â©2025"
    }
  ]
}