{
  "fuentes": [
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "bdlavell16@eaglespringsgcc.com"
    },
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "jhill@eaglespringsgcc.com"
    },
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "jnorvell@eaglespringsgcc.com"
    },
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "tburrough13@eaglespringsgcc.com"
    },
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "jhill@eaglespringsgcc.com"
    },
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "email": "jnorvell@eaglespringsgcc.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/eagle-creek-golf-club-orlando-to-unveil-new-20th-year-anniversary-logo-branding/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/eagle-creek-golf-club-orlando-to-unveil-new-20th-year-anniversary-logo-branding/",
      "email": "marketing@cflgolf.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "aexton@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "argylegrill@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "info@eaglevale.com"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "email": "proshop@eaglevale.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://touroldham.com/eagle-creek-golf-course-building-3m-clubhouse/",
      "email": "director@touroldham.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/golf-schools-and-group-coaching/",
      "email": "golfacademy@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/golf-schools-and-group-coaching/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/coaching-programs/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/policies/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/the-belfry-restaurant/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/course-details/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/summer-camp-parent-information/",
      "email": "lsullivan@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/summer-camp-parent-information/",
      "email": "aandrews@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/summer-camp-parent-information/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "aandrews@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "jclark@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "jmorales@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "lgabauer@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "lsullivan@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "mmorancy@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "email": "nbeland@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/blog/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/blog/",
      "email": "marketing@cflgolf.com"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/eagle-creek-golf-clubhouse/",
      "email": "newsletter@mycentralfloridafamily.com"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/eagle-creek-golf-clubhouse/",
      "email": "brandi@mycentralfloridafamily.com"
    },
    {
      "url": "https://www.eaglecreekorlando.com/tournaments-golf-events/",
      "email": "info@eaglecreekorlando.com"
    },
    {
      "url": "https://www.eagleridge.com.au/about-us/",
      "email": "golfshop@eagleridge.com.au"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "cscissions@clublink.ca"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "dgarries@clublink.ca"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "emorin@clublink.ca"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "kbest@clublink.ca"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "klillie@clublink.ca"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "email": "rlittle@clublink.ca"
    }
  ],
  "mails": [
    "aandrews@eaglecreekorlando.com",
    "aexton@eaglevale.com",
    "argylegrill@eaglevale.com",
    "bdlavell16@eaglespringsgcc.com",
    "brandi@mycentralfloridafamily.com",
    "cscissions@clublink.ca",
    "dgarries@clublink.ca",
    "director@touroldham.com",
    "emorin@clublink.ca",
    "golfacademy@eaglecreekorlando.com",
    "golfshop@eagleridge.com.au",
    "info@eaglecreekorlando.com",
    "info@eaglevale.com",
    "jclark@eaglecreekorlando.com",
    "jhill@eaglespringsgcc.com",
    "jmorales@eaglecreekorlando.com",
    "jnorvell@eaglespringsgcc.com",
    "kbest@clublink.ca",
    "klillie@clublink.ca",
    "lgabauer@eaglecreekorlando.com",
    "lsullivan@eaglecreekorlando.com",
    "marketing@cflgolf.com",
    "mmorancy@eaglecreekorlando.com",
    "nbeland@eaglecreekorlando.com",
    "newsletter@mycentralfloridafamily.com",
    "proshop@eaglevale.com",
    "rlittle@clublink.ca",
    "tburrough13@eaglespringsgcc.com"
  ],
  "nombre_sitio": "eaglecreekorlando.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://eaglespringsgcc.com/contact-us/",
      "text": "Contact Us - Eagle Springs GCC - Pro Shop Golf Course Rates Membership Calendar Shop & Cafe Contact Us Menu Menu Golf Course Rates Membership Calendar Shop & Cafe Contact Us Get in touch today Contact Us MORE INFORMATION Eagle Springs Golf & Country Club 21722 Fairway Oaks Lane Friant, CA 93626 (559) 325-8900 (559) 299-8565 Fax Open Monday, Wednesday — Sunday CLOSED TUESDAY (for Maintenance) For more information please contact: Brenda D. Lavell Sr Director of Golf Ops BDLavell16@eaglespringsgcc.com Travis Burrough Sr Manager of Golf Ops TBurrough13@eaglespringsgcc.com Jeff Hill, PGA Director of Golf Ops Sales & Marketing JHill@eaglespringsgcc.com Jordan Norvell Clubhouse Administration JNorvell@eaglespringsgcc.com Contact Us 21722 Fairway Oaks Lane Friant, CA • 93626 (559) 325-8900 Privacy Policy Copyright Eagle Springs 2025 © All Rights Reserved. Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://www.eaglecreekorlando.com/eagle-creek-golf-club-orlando-to-unveil-new-20th-year-anniversary-logo-branding/",
      "text": "Eagle Creek Golf Club, Orlando to Unveil New 20th Year Anniversary Logo & Branding - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Eagle Creek Golf Club, Orlando to Unveil New 20th Year Anniversary Logo & Branding April 26, 2024 by cflgolf Orlando, Fla. (April 26, 2024) – Two decades after opening in what was then mostly rural east Orlando, Eagle Creek Golf Club and the surrounding Lake Nona area look a lot different these days. To help celebrate 20 years of world-class growth, the 18-hole championship course is excited to unveil a soon-to-be released new-look logo and line of merchandise. The course’s new branding will be introduced May 17th at an invitee-only 20th anniversary event for invited guests and golf patrons, residents, vendors and media. Eagle Creek’s official new logo and 20th-year anniversary branding is part of the facility’s strategic “Vision 24” marketing campaign that longtime course owner/operator Kenny Nairn launched last January with feedback from his entire Central Florida Golf (CFL) organization. As for the exciting new Eagle Creek branding, the club’s logo itself was more than a year in the making. According to Nairn, the logo’s design process was a collaborative effort, including input from employees, guests and others associated with the highly acclaimed public layout. The esteemed Savannah College of Art and Design even contributed to the new logo that will be displayed on Eagle Creek merchandise and available for sale starting May 18. Among the new lines of merchandise, the pro shop staff is eager to showcase some “never-seen-before” brands as well as limited EDITION 20th-anniversary commemorative items. Once Eagle Creek’s new logo and branding is unveiled at the May 17th invite-only event, the special 20th-year anniversary items will only be sold for the remainder of the year. Nairn, and the rest of his golf course team, can’t wait to start sharing and wearing the course’s future dynamic-looking new logo. “Our new logo is off-the-charts good and I want to give a huge thank you to everyone who helped design this for Eagle Creek,” adds Nairn, who is considered one of the game’s elite golf instructors. The new-look logo/Eagle Creek branding is just one way the club is celebrating its 20th year anniversary at next month’s special event. Indeed, the purpose of Eagle Creek’s special daylong May 17th event is two-fold: celebrate Eagle Creek’s previous two decades of success and share some exciting news about other future changes planned for this top-ranked high-end daily-fee course. For instance, besides unveiling of Eagle Creek’s new branding and identity, the special May 17th event will also cover Eagle Creek’s clubhouse renovations and proposed Golf Academy expansion, and last, but not least, offer attendees a sneak preview of the property’s newest golf layout. Long a top golf destination of choice for both locals and travelers visiting the City Beautiful, Eagle Creek has consistently delivered the ultimate golf experience for all levels of golfers. But now, Eagle Creek is excited to start offering a new 18-hole short course experience with more details to come. The entire team at Eagle Creek can’t wait to start showing off the course’s exciting new look and officially kick off the 20th year celebration with next month’s invite-only event. To inquire or learn more about next month’s festivities, please email Head of Marketing Lauren Rykwalder at marketing@cflgolf.com or call 352-801-3683. For additional information about Eagle Creek, visit www.cflgolf.com and contact info@eaglecreekorlando.com. Or please connect with us on our following platforms: https://www.eaglecreekorlando.com/ ; https://www.facebook.com/EagleCreekGC ; Eagle Creek Golf Club Orlando – YouTube Filed Under: Uncategorized Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglevale.com/contact-us/",
      "text": "Contact Us | Eagle Vale Golf Club Skip to main content Skip to footer Eagle Vale Golf Club Fairport, NY Call us: (585) 377-5200 Home Golf Tee Times Rates Memberships Indoor Simulators Pro Shop Specials! Driving Range Penfield NY 2025 Driving Range Membership 2025 Saturday Couples League Course Information Scorecard Front 9 Flyover Back 9 Flyover GOLF INSTRUCTION Virtual Tour Tournaments Tournaments 2026 Tournament Pricing Information Request Events Calendar Tee Times Argyle Grill Banquet Facility Banquet Facility Special Occasions Corporate Events Golf Tournaments Information Request Testimonials Weddings Eagle Vale News Newsletter Join Our Email List! Helpful Links Contact Us Argyle Grill Contact Us Contact Us Today! Staff Directory Eagle Vale Golf Club 4344 Nine Mile Point Road, Fairport, NY 14450 Phone: (585) 377-5200 ‎ Contact any of our staff during the hours indicated here! Hours of Operation Golf Shop: 9am-5pm Restaurant: 11am – until Office: 9am – 5pm Please click on the appropriate Contact below for more information and an email contact form: Name Position Phone E-Mail Scott Hunter Director of Golf (585) 377-5200 x231 proshop@eaglevale.com Amy Exton Sales & Events Coordinator (585) 377-5200 x224 aexton@eaglevale.com Heather Charles Argyle Grill Manager (585) 377-5200 x228 argylegrill@eaglevale.com Employment Application Click Here Our staff is fully equipped to handle all needs. Firstly, Scott Hunter is your go-to guy for all things golf. Secondly, Amy Exton will assist you with all your tournament and event needs. Feeling hungry? Talk to Heather Charles, our Argyle Grill manager! Get in touch with us today. We can’t wait to hear from you! Footer Sign-Up for Email Offers Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Website Submit Local Weather Sorry - your browser does not support iframes. meteoblue Find Us Address: 4344 Nine Mile Point Road Fairport, NY 14450 Phone: (585) 377-5200 Email: info@eaglevale.com Follow Us Copyright © 2025 Eagle Vale Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/",
      "text": "Home - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Home Welcome to Eagle Creek Golf Club! Event Calendar Book A Tee Time Golf Coaching Scroll Down for More Course Tour Take a virtual tour and book your next round of golf online. It’s fast and easy! Course Tour Golf Events Golf Events From small golf outings to large corporate tournaments, the Eagle Creek professional staff is here to make your event a great success! Learn More Weddings + Events Wedding & Events Our experienced staff will make your special event a success. Learn More Here at Eagle Creek Golf Club Conveniently located minutes from the Orlando International Airport , Eagle Creek Golf Club Orlando was designed by world-renowned golf course architects Ron Garl and Howard Swan. It is an extraordinary 18-hole, 7200-yard, Par 73 championship course with five sets of tees for golfers of all skill levels and more than 60 bunkers and dramatic bulkheads are reminiscent of those found in Scotland and England. Overall, the true Scottish-style experience of Eagle Creek Golf Club stands out from other Orlando championship golf courses as a true golfing masterpiece! Enjoy our unique Orlando Golf Club features like the spectacular 14,000 square foot, two-story clubhouse designed in a vintage, New England-manor style, which includes a fully stocked pro shop, the Belfry Restaurant – a 120-seat restaurant with private wedding and banquet space available, plus locker rooms and showers for men and women. Whichever your occasion may be, we invite you to join us sometime soon for an exceptionally memorable experience at one of Central Florida’s finest signature golf clubs. Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://touroldham.com/eagle-creek-golf-course-building-3m-clubhouse/",
      "text": "Eagle Creek Golf Course building $3M clubhouse - Oldham County KY Tourism Skip to content Blog Media Request Contact Groups Filming Menu Toggle Oldham County KY Film Locations Oldham Films & TV Shows Oldham County KY Tourism Play Menu Toggle Craft Bourbon Distillery Tour Greenhouse Brewery & Gardens Trains On Main Train Museum in La Grange Art Galleries & Studios Kentucky Derby Hat Maker Drive-In Movie Theater Eat Menu Toggle Coffee, Ice Cream and Treats The Best Thing I Ever Ate – Bacon Pie American & New Southern Local BBQ International Italian & Pizza Farm Tours Menu Toggle Horse Farm Tours & More Garden Tours and Nature Preserves Foodie Farm Tours Near Louisville Oldham County and the Kentucky Derby Outdoor Menu Toggle Parks and Trails Botanical Gardens KY Garden Trail Oldham County Nature Preserve Oldham Fun In The Water Golf Course & Disc Golf Trip Ideas Menu Toggle All Things Kentucky at Hermitage Farm Horsin’ Around Bourbon Getaway Trains on Main Getaway Only in Oldham KY Near Louisville Motorcycle Tour near Louisville Farm To Table Getaway Near Louisville KY Couples Getaway to Oldham Guys Getaway to Oldham Girls Getaway to Oldham Antiques Near Louisville KY Fun Passport Trails Shop History Menu Toggle Underground Railroad in Oldham Famous People Historic Homes & Sites Historic Cemeteries Pewee Valley, KY – Little Colonel Stay Menu Toggle Hotels Near Louisville on I-71 Bed & Breakfasts Near Louisville Vacation Home Rentals near Louisville Events Menu Toggle Calendar of Events Annual Events Oldham County KY Event Space Spiritual Retreat Center Search for: Search Search Oldham County KY Tourism Main Menu Search for: Search Search Play Menu Toggle Craft Bourbon Distillery Tour Greenhouse Brewery & Gardens Trains On Main Train Museum in La Grange Art Galleries & Studios Kentucky Derby Hat Maker Drive-In Movie Theater Eat Menu Toggle Coffee, Ice Cream and Treats The Best Thing I Ever Ate – Bacon Pie American & New Southern Local BBQ International Italian & Pizza Farm Tours Menu Toggle Horse Farm Tours & More Garden Tours and Nature Preserves Foodie Farm Tours Near Louisville Oldham County and the Kentucky Derby Outdoor Menu Toggle Parks and Trails Botanical Gardens KY Garden Trail Oldham County Nature Preserve Oldham Fun In The Water Golf Course & Disc Golf Trip Ideas Menu Toggle All Things Kentucky at Hermitage Farm Horsin’ Around Bourbon Getaway Trains on Main Getaway Only in Oldham KY Near Louisville Motorcycle Tour near Louisville Farm To Table Getaway Near Louisville KY Couples Getaway to Oldham Guys Getaway to Oldham Girls Getaway to Oldham Antiques Near Louisville KY Fun Passport Trails Shop History Menu Toggle Underground Railroad in Oldham Famous People Historic Homes & Sites Historic Cemeteries Pewee Valley, KY – Little Colonel Stay Menu Toggle Hotels Near Louisville on I-71 Bed & Breakfasts Near Louisville Vacation Home Rentals near Louisville Events Menu Toggle Calendar of Events Annual Events Oldham County KY Event Space Spiritual Retreat Center Eagle Creek Golf Course building $3M clubhouse By Helen McKinney / March 31, 2024 Eagle Creek Golf Course is one of five golf experiences found in Oldham County. Here you’ll find 9-18 holes of golf for all skill levels. Make this a Stay & Play by adding a vacation home rental , bed and breakfast , or hotel stay to your visit, plus over 25 events in April sure to please any interest. Louisville Business First By Joel Stinnett – Senior Reporter March 14, 2024 The facility will include a 2,700-square-foot restaurant with a full bar and a covered porch for dining. Golfers in Oldham County will soon have a new 19th hole. Eagle Creek Golf Course at 2820 KY-53 in La Grange started construction in February on a new $3.3 million clubhouse, said Brian Koetter, design director at Miranda Construction, which is the design-build firm on the project. The new one-story, 10,600-square-foot clubhouse will include a pro shop, a basement for golf cart storage, a party room, two golf simulators, a covered porch in the front and a residential unit to house the course superintendent, Koetter said. The facility will also include a 2,700-square-foot restaurant with a full bar and a covered porch for dining. Koetter said Seasoned Pub and Grill will operate the restaurant. Seasoned closed its location in the Prospect Village Shopping Center in August. Eagle Creek Golf Course at 2820 KY-53 in La Grange started construction in February on a new $3.3 million clubhouse. The clubhouse is expected to be ready in the first half of October. Eagle Creek is a public course owned by the City of La Grange. “I think the city sees it more than a restauranteur that’s keeping the 19th hole business alive for the course,” Koetter said. “I think they’re seeing it as a standalone dining opportunity for some of the residents around there.” “I think it’s going to benefit everybody. Even people that aren’t golfing. We’re thrilled to be a part of it.” Eagle Creek is one of the 10-toughest golf courses in the Louisville-area, according to Louisville Business First research, with a U.S. Golf Association course rating of 73. The course opened in 1970. Koetter said Eagle Creek’s current club house is from that era and will be torn down to make way for a new putting green. In December, the La Grange City Council approved up to $4 million to build the new clubhouse, according to a report from The Oldham Era. The Eagle Creek Board of Directors is supplying $500,000 of those funds, with an additional $500,000 coming from American Rescue Plan funds. The clubhouse is phase one of the course’s tentative expansion plans, according to the report, which include pickleball courts and a swimming pool. Previous Spring Has Sprung in Oldham County! Next Oldham County woman wins Derby Burger Challenge Oldham County, Kentucky is 20 minutes from Louisville and 60 minutes from Cincinnati. Come experience the best weekend getaway Kentucky has to offer! Helpful Links Short-Term Rental HELP Crestwood Merchant Mingle Oldham County Chamber & Economic Development La Grange Tourism Contact Us Oldham County Tourism Office & Visitor Center at The Maples Park 6826 W State Hwy 22 Crestwood, KY 40014 Phone | (502) 222-0056 Toll-Free | (800) 813-9953 Director@TourOldham.com *Tourism Commission Meetings are held the third Wednesday of every month at 10:30am at the Tourism Office in The Maples Park. Call to be added to the Agenda (502) 222-0056. Oldham County Tourism Cities Buckner Crestwood Goshen La Grange Prospect Westport Helpful Links Short-Term Rental HELP Crestwood Merchant Mingle Oldham County Chamber & Economic Development La Grange Tourism © Copyright Oldham County Tourism. All Rights Reserved. Website Design & Hosting by Hotwire Productions . PRIVACY POLICY PRIVACY POLICY Oldham County Tourism Cities Buckner Crestwood Goshen La Grange Prospect Westport Copyright © 2025 Oldham County KY Tourism. All Rights Reserved. Website Powered by Hotwire Productions . PRIVACY POLICY Scroll to Top"
    },
    {
      "url": "https://www.eaglecreekorlando.com/golf-schools-and-group-coaching/",
      "text": "Golf Schools and Group Coaching - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Golf Schools and Group Coaching For more information on pricing for schools and groups please call (407) 273-4653 Ext 3 or email golfacademy@eaglecreekorlando.com . Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/coaching-programs/",
      "text": "Coaching - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Meet The Team The Golf Academy at Eagle Creek offers a wide range of Instruction programs & packages to suit the needs of every golfer. Select from the options below or contact our Instructors who will be happy to create a program for you. Coach Kenny Nairn AA  PGA Pro Lead Coach Learn More Coach Liam Sullivan Academy Director Learn More Coach Adam Andrews Head Golf Pro Learn More Coach Stone Gomez PGA Jr. League Head Coach Learn More Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/policies/",
      "text": "Policies - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Policies General Information All players must register in pro shop at least 20 minutes prior to tee time. Each player is required to play with their own bag and set of golf clubs. Rental sets are available in Golf Shop. All play will begin on the #1 hole unless instructed otherwise by course staff. All food and beverage must be purchased from Eagle Creek Golf. Pace of Play Pace of play is important to us as it ties into your golfing experience at Eagle Creek. It’s our goal to ensure all our guests joining us for a round of golf have an exceptional playing experience. Our course Pace of Play is 4 hours and 30 minutes or less . Here are a few Pace of Play tips: Arrive to the facility with ample time to check in, warm up and get to the 1st tee 10 minutes before your time. Selecting the right tee box. We offer five different tee boxes for golfers of all abilities. Check with our professional staff to see which one is most fitting for your game. Playing ready golf. While your playing partner is hitting their shot use that time to be thinking about and preparing for your shot. Should you fall out of position during your round our Player Assistant staff will ask you to please improve your pace of play. If this is not achieved the group will be moved into the proper position to avoid causing a delay for the rest of the golf course. Dress The attire in golf is part of the decorum of the game, perhaps more so than any other sport. That is what makes the game so great! These dress codes are not as restrictive as the rules for PGA Tour or LPGA Tour players, but they are designed to ensure that amateur players adhere to a certain protocol in order to help maintain the game’s traditions. Below are our general guidelines to help ensure you are ready come tee time. We understand some of golfs traditions are transforming into a new generation of style so if you are unsure about a certain piece of clothing, feel free to ask one of our Pro Shop Team Members – 407-273-4653 . Men Slacks or Bermuda-length golf shorts Collared golf shirts Women Slacks or Bermuda-length golf shorts Golf skirts Collared golf shirts Sleeveless/collarless golf shirts Juniors Junior attire is determined by age. Please check with our Pro Shop staff Denim jeans – slacks or shorts Athletic shorts including beach or bathing suit style Athletic warm-up suits T-shirts or tank tops Any persons going on the course or in the clubhouse must wear the proper attire. The management of Eagle Creek Golf Club reserves the right to refuse business to any guest not conforming to the above dress code. Cancellation Policy: Adjustments to player count or cancellation of a round must be done 24 hours in advance to avoid charges. Tournaments/Leagues have different requirements. Please refer to your contract or contact course management. Eagle Creek Golf Club reserves the right to charge golfers for missed tee times, “No-Shows” and “Short Shows”. Booking a Tee Time/”No Shows”: Tee Time bookings for all players will require full name, email address, phone number and credit card number of the person making the reservation to complete your booking. The credit card will not be charged unless the group does not cancel the round within 24 hours or does not show up for the tee time booked. In the event the tee time is not cancelled outside of the 24-hour window then it will be deemed as a “No-Show”. In the event of a No-Show the player will be charged the full amount of the tee time plus applicable taxes. Short Shows: When booking a group please always keep the golf course updated completely with any changes to your group size. If a reservation is made for 4 and only 3 show up without the player count being adjusted within 24 hours, then the group will be responsible to pay for the 4th golfer or any no show golfer in the group. The full amount will be charged and then a “Rain Check” will be issued for the total amount paid. The “Rain Check” can be used towards another round of golf at Eagle Creek. The “Rain Checks” are valid for 90 days from the date of issue. Attention: Please be advised that as of 11/01/2021 Eagle Creek Golf Club no longer allows spectators and extra riders that are not golfing. Carts will be reserved for Golfers only. 2 Carts per foursome and no guests/coaches/wives/friends/brothers can accompany the golfer onto the course. Single rider carts for golfers are also not available any longer. Please call the Pro Shop at (407) 273-4653 Ext. 7 for additional information and to book a tee time. Events: Eagle Creek Golf Club is not affiliated, associated, authorized, endorsed by, or in any way officially connected with any other company, agency or organization that hosts events at or on our facilities. All event-related activities are the sole responsibility of the respective event organizers. Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/the-belfry-restaurant/",
      "text": "The Belfry Restaurant - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online The Belfry Restaurant At Eagle Creek Golf Club, we believe that part of the golfing experience is having good times while enjoying great food, surrounded by stunning views.  You can enjoy our diverse menu thoughtfully crafted by our Head Chef, along with an ice cold beer or crafted cocktail. Whether you’re finishing up a round of golf or just looking to relax and unwind with friends, join us for a memorable dining experience that perfectly complements your day on the course. Check out our events calendar for community & holiday celebrations, or contact us about hosting a private event. Summer Hours Monday – Thursday: 11 AM – 3 PM Friday – Sunday: 11 AM – 6 PM Our Snack Bar & Beverage Cart will be rollin’ all summer long *Hours subject to change due to private events – check out the events calendar for current hours New Menu Click here to Download Menu PDF The best vendor and the best team! After hunting for vendors that would fit all of my needs, we came across Eagle Creek Golf Club and I couldn’t be happier! Nicole and the team did a phenomenal job from the wedding planning to executing our dream wedding and I wouldn’t have it any other way. I 1000% recommend hosting your next special event with Eagle Creek Golf Club. You wont regret it. Damayra 4/10/2025 Wanted to say thank you so much for setting everything up on Sunday! It was really great! Everyone loved it. And the mom to be was just amazed. The menu was perfect, and the pink tablecloth and all. You guys were so awesome! Mariel 4/15/2025 Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/course-details/",
      "text": "Course Details - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Course Details Welcome to the spectacular Eagle Creek Golf Club Orlando, a unique course collaboration that blends the best of traditional European design with state-of-the-art American technological innovation, all under Orlando, Florida’s trademark sunny skies. Designed by world-renowned golf course architects Ron Garl and Howard Swan, Eagle Creek is an extraordinary 18-hole, 7198-yard, Par 73 championship course with five sets of tees for golfers of all skill levels. Howard Swan also designed our highly acclaimed sister course, Boavista Resort Golf Course, in Lagos, Portugal. Eagle Creek Golf Club is proud to be part of an elite group of designated “Audubon International Silver Signature” courses, providing pristine surroundings for residents and visitors, featuring more than 60 white sand bunkers and dramatic bulkheads embracing water hazards and greens, all nestled beneath a canopy of towering trees and foliage. Eagle Creek is Florida’s first golf course to use the technologically advanced Mini-Verde grass, resulting in exceptionally fast and vibrant greens. Eagle Creek also offers a two-sided driving range and practice hole with bunkers. A professional teaching academy is on site. We invite you to Orlando, Florida to join us for an exceptionally memorable and fun round of golf at one of Central Florida’s finest signature golf courses. Scorecard Hole 1 2 3 4 5 6 7 8 9 Out Black 74.1/132 361 347 396 570 203 444 415 201 528 3465 White 72.5/128 348 330 371 563 195 419 394 182 502 3304 Yellow 70.3/125 313 308 337 512 181 393 365 171 479 3059 Blue M 68.0/118 W 74.0/131 291 296 296 480 165 364 337 146 451 2826 Red 70.5/125 268 265 258 445 149 324 301 119 406 2535 Men’s HDCP 15 17 13 3 11 1 5 9 7 Par 4 4 4 5 3 4 4 3 5 36 Women’s HDCP 15 13 11 1 7 5 9 17 3 Hole 10 11 12 13 14 15 16 17 18 In Tot Black 74.1/132 414 215 436 545 388 425 572 196 540 3731 7196 White 72.5/128 391 201 405 515 377 405 540 183 520 3537 6841 Yellow 70.3/125 362 182 374 483 355 380 512 166 489 3303 6362 Blue M 68.0/118 W 74.0/131 335 160 339 456 328 350 470 149 462 3049 5875 Red 70.5/125 308 138 311 421 295 318 429 128 422 2770 5305 Men’s HDCP 14 12 4 10 16 2 6 18 8 Par 4 3 4 5 4 4 5 3 5 37 73 Women’s HDCP 12 14 10 4 16 8 6 18 2 Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/summer-camp-parent-information/",
      "text": "Summer Camp – Parent information - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Summer Camp – Parent information We look forward to welcoming kids and parents to Eagle Creek Golf Club for our 2025 Summer camps. Please read the information below to ensure that your child has the best experience possible, and camps run smoothly! DROP OFF – Please drop off kids at the front entrance to Eagle Creek GC, not the driving range parking lot as per previous camps. Our staff will be on hand to help place golf clubs on a cart while we check participants in at the registration desk in the lobby. This is also an opportunity to help kids select lunch options. PICK UP – Kids to be collected from the front entrance as above. Parents are welcome to park cars at front entrance if they wish to arrive slightly early to attend the presentation. LUNCH – There will be 4 lunch options available each day, plus the option to bring a packed lunch. Make lunch selection upon arrival at the registration desk. Once the registration time is over, kids will be unable to change their minds. PRESENTATION – Will take place on the Friday of each camp at 11.45 for Half Day camps and 1.45 for Full Day Campers. Family members are encouraged to attend with complimentary refreshments available. WHAT TO BRING – It is critical that children arrive at camp with an empty water bottle, which we will refill regularly throughout the day. Please also ensure that children have clothing for all weather conditions. During the week we may also ask children to bring a fun item such as a watermelon for one of the skills challenges. More information on this will be communicated during the camp. Please ensure that lunch boxes and other items have name tags. GOLF CLUBS – We can provide Golf clubs for use during summer camp, for children who do not currently own a set. Our coaches are qualified club fitters & would be happy to make recommendations on golf club purchases, it is essential that junior golfers have the correct equipment to maximize fun and learning, so please speak to our team before buying golf equipment. WEATHER – Our coaching team are prepared with a number of golf skills challenges & games that can be completed indoors, to keep the campers entertained should rain/storms be present. In the event of lightening campers will head inside immediately. Heat and exhaustion will be dealt with immediately as appropriate. Please email any questions to: Liam Sullivan or Adam Andrews Director of Coaching / Head Golf Professional Lsullivan@eaglecreekorlando.com / aandrews@eaglecreekorlando.com Please enable JavaScript in your browser to complete this form. Junior Student Registration Form Name of Child * First Last Name of Parent/Guardian * First Last Address * Address Line 1 Address Line 2 City — Select state — Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming State Zip Code Phone * Email * Student Details Date of Birth * Allergies & Medical Concerns * Emergency Contact * First Last Emergency Contact Phone * How did you hear about us? * Waiver Form I, the undersigned, as a parent or legal guardian of a minor child, hereby waive & release the entity EAGLE CREEK GOLF CLUB LLC and its officers, agents and all its employees from any and all claims resulting from the participation of my child while in a golf lesson or camp . We also reserve the right to excuse a camper if needed for any disciplinary reason. Parent or Guardian * First Last Date * By checking this box, you are effectively using it as your legal signature. * Agree Promotional Waiver I, the undersigned, as a parent or legal guardian of a minor child, hereby allow EAGLE CREEK GOLF CLUB LLC to use any photo images or video of my child while participating in a coaching session. Parent or Guardian * First Last Date * By checking this box, you are effectively using it as your legal signature. * Agree Submit Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/contact-our-team/",
      "text": "Contact Our Team - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Contact Our Team Michael Morancy Director of Golf Operations mmorancy@eaglecreekorlando.com Nicole Beland Catering Event Sales/F&B Manager nbeland@eaglecreekorlando.com Adam Andrews Head Golf Professional aandrews@eaglecreekorlando.com Liam Sullivan PGA Golf Pro & Director of Coaching lsullivan@eaglecreekorlando.com Jonathan Morales Head Chef jmorales@eaglecreekorlando.com Jeff Clark Golf Course Superintendent jclark@eaglecreekorlando.com Linda Gabauer General Manager lgabauer@eaglecreekorlando.com Address Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Email Emailinfo@eaglecreekorlando.comto contact golf course Call Us (407) 273-4653 Reservationist Available 24/7 Hours The Belfry Restaurant 11AM – 6PM Golf Club 6:30AM – 6:00PM Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglecreekorlando.com/blog/",
      "text": "Blog - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Blog Orlando’s Eagle Creek Golf Club to celebrate 20th Anniversary with the opening of Wee 18 May 16, 2024 by cflgolf A key word in today’s golf course design and renovation is “flexibility.’’ That is, the ability to create a layout that’s challenging and fun for players of all skill levels without losing design integrity. With that in mind, Eagle Creek Golf Club on May 17 will introduce the “Wee 18’’ layout as part of its 20th anniversary celebration. The celebration will also include new 20th-year anniversary branding, a logo, and limited, never-seen-before commemorative merchandise. In addition, guests will get a sneak peek of the facility’s future clubhouse renovations and proposed Golf Academy expansion. The centerpiece of the celebration, however, will be the Wee 18, which features an additional set of tees that plays 2,024 yards. “The tees on the Wee 18 have been strategically placed to make it easier for players to reach the greens,’’ explained Eagle Creek Owner and Operator Kenny Nairn. “This layout is not just for kids and juniors; it’s designed to be a fun and engaging experience for all players. We envision using it for a variety of events and could even use the front nine as a putting course, showcasing its versatility and appeal to all golf enthusiasts.” The term “Wee” fits in well with Eagle Creek, a golf community created by The Emerson Group, a leading U.K.-based real estate developer. “Wee is a generic Scottish term for small,” says Nairn, a native Scotsman who is considered one of the golf industry’s elite instructors. “So, it’s a small golf course but something for all ages and abilities to enjoy. It’s designed for fun and something golfers and families can play in less than a couple hours.” The only water hazard that comes into play on the Wee 18 is the approach shot to the course’s signature finishing hole, where Eagle Creek’s vintage New England manor-style clubhouse overlooks the peninsula No. 18 green. “The third shot – over water -is about 94 yards,’’ Nairn said. “It will be a good playoff hole for scrambles. We used it as a playoff hole for an amateur event in 2023.  From the clubhouse balcony, it’s a fun hole for people to watch because it’s a natural amphitheater.’’ Designed by renowned architect Ron Garl and well-known British architect Howard Swann,  Eagle Creek features a distinctive “links-style’’ fair.  For example, when the course debuted, it included British-influenced revetted bunkers, rectangular tees, and compact greens. Sixty of these bunkers and dramatic bulkheads are still scattered throughout the course, reminiscent of those found in the classic courses found in Scotland and England. One of the Orlando area’s top public courses, Eagle Creek (7,198 yards) has a unique collection of par-5s, making it the only par-73 course in Florida. Eagle Creek has hosted such prestigious events as the Annika Invitational and the University of Central Florida’s NCAA Division I tournament, the UCF Challenge. Written by: STEVE PIKE Golf One Media Filed Under: Uncategorized Eagle Creek Golf Club, Orlando to Debut New Wee 18 Golf Course May 9, 2024 by cflgolf Orlando, Fla. (May 10, 2024) – On the eve of its 20 th anniversary, the golf course experience at Eagle Creek is about to get a ‘wee’ bit better. Wee bit as in the brand new Wee 18 golf layout scheduled to debut May 17at the upscale residential golf course community. A select group of Eagle Creek residents, guests, golf patrons, and vendors/media will have a sneak peak of Central Florida’s newest golf course experience as part of the facility’s invite-only 20 th anniversary grand-reopening event later this month. To mark the golf club’s special 20 th anniversary milestone, Eagle Creek has several exciting developments to celebrate on May 17th, including the club’s new 20 th -year anniversary branding, logo and limited never-seen-before commemorative merchandise. Other festivities planned for the event: news about the facility’s future clubhouse renovations and proposed Golf Academy expansion, and last, but not least, enjoy Eagle Creek’s newest Wee 18 layout. Indeed, long a top golf destination of choice for both locals and travelers visiting the City Beautiful, Eagle Creek has always delivered the ultimate golf experience for all levels of golfers. But now, longtime owner/operator Kenny Nairn of Central Florida Golf (CFL Golf) is excited to unveil Florida’s newest 18-hole alternative short course experience. Designed with a focus on “having fun,” Eagle Creek’s new Wee Tees will fittingly play to 2,024 yards to honor the 20 th anniversary year of the golf community created by leading U.K.-based real estate developer, The Emerson Group. And Nairn notes the new course is not just for kids. “Wee is a generic Scottish term for small,” says Nairn, a native Scotsman who is considered one of the golf industry’s elite instructors. “So, it’s a small golf course but something for all ages and abilities to enjoy. It’s designed for fun, and something golfers and families can play in a less than a couple hours.” This new layout will even have its own logo and new merchandise as well. Last of all is a planned The Wee Open Tournament later this year, Nairn said. According to Eagle Creek, all Wee Tees were strategically located in corridors and ways that give Wee 18 golfers the “easiest line into the green.” And the only water hazard that comes into play on the Wee 18 is the approach shot to the highly acclaimed course’s signature finishing hole, where Eagle Creek’s vintage New England manor-style clubhouse overlooks the picturesque peninsula No. 18 green. Based on current trends in the golf business, the Wee 18 is bound to be a popular new destination for Eagle Creek guests/members, giving the public facility yet another distinctive golf course component. Indeed, when Eagle Creek opened 20 years ago, the property featured a distinctive European flair after being co-designed by well-known British course architect Howard Swann and acclaimed Central Florida-based architect Ron Garl. For instance, when the course debuted, golfers were treated to British-influenced revetted bunkers, rectangular tees and compact greens. Sixty of these bunkers and dramatic bulkheads are still scattered throughout the course, reminiscent of those found in the classic courses found in Scotland and England. Another trademark of the world-class 7,198-yard facility is the unique collection of par-5s, making Eagle Creek the only par-73 course in Florida. Length notwithstanding, Eagle Creek’s six sets of tees, as well as the newest Wee Tees, truly caters to all levels of golfers from beginners to the world’s best, including elite women amateur golfers that annually play in the prestigious Annika Invitational and University of Central Florida’s NCAA Division I tournament, the UCF Challenge. Conveniently located 15 minutes from Orlando International Airport, Eagle Creek Golf Club’s European-style ambiance and hospitality is also found at the club’s remarkable two-story clubhouse. Among the clubhouse highlights are a fully stocked pro shop, locker rooms and showers for men and women, and the aptly named Belfry Restaurant – a 120-seat venue with private wedding and banquet space available. “From the very beginning, the golf course and the clubhouse were second to none,” Nairn says. “But like everything, you’ve got to keep improving what you’re doing. And you’ve got to have the vision to be able to do that, in order to stay at the top of your game and business. “That’s our team’s whole mantra, always striving to do things different and better for our customers.  That’s why we’re doing what we’re doing with our exciting 20 th anniversary celebration next month and Eagle Creek’s newest course, the Wee 18.” To inquire or learn more about Eagle Creek’s 20 th -anniversary May 17th festivities, please email Head of Marketing Lauren Rykwalder at marketing@cflgolf.com or call 352-801-3683. For additional information about Eagle Creek, visit www.cflgolf.com and contact info@eaglecreekorlando.com . Or please connect with us on our following platforms: https://www.eaglecreekorlando.com/ ; https://www.facebook.com/EagleCreekGC ; https://www.instagram.com/eaglecreekgolfcluborlando/ ; https://www.youtube.com/@EagleCreekGolfOrlando Filed Under: Uncategorized Eagle Creek Golf Club, Orlando to Unveil New 20th Year Anniversary Logo & Branding April 26, 2024 by cflgolf Orlando, Fla. (April 26, 2024) – Two decades after opening in what was then mostly rural east Orlando, Eagle Creek Golf Club and the surrounding Lake Nona area look a lot different these days. To help celebrate 20 years of world-class growth, the 18-hole championship course is excited to unveil a soon-to-be released new-look logo and line of merchandise. The course’s new branding will be introduced May 17th at an invitee-only 20th anniversary event for invited guests and golf patrons, residents, vendors and media. Eagle Creek’s official new logo and 20th-year anniversary branding is part of the facility’s strategic “Vision 24” marketing campaign that longtime course owner/operator Kenny Nairn launched last January with feedback from his entire Central Florida Golf (CFL) organization. As for the exciting new Eagle Creek branding, the club’s logo itself was more than a year in the making. According to Nairn, the logo’s design process was a collaborative effort, including input from employees, guests and others associated with the highly acclaimed public layout. The esteemed Savannah College of Art and Design even contributed to the new logo that will be displayed on Eagle Creek merchandise and available for sale starting May 18. Among the new lines of merchandise, the pro shop staff is eager to showcase some “never-seen-before” brands as well as limited EDITION 20th-anniversary commemorative items. Once Eagle Creek’s new logo and branding is unveiled at the May 17th invite-only event, the special 20th-year anniversary items will only be sold for the remainder of the year. Nairn, and the rest of his golf course team, can’t wait to start sharing and wearing the course’s future dynamic-looking new logo. “Our new logo is off-the-charts good and I want to give a huge thank you to everyone who helped design this for Eagle Creek,” adds Nairn, who is considered one of the game’s elite golf instructors. The new-look logo/Eagle Creek branding is just one way the club is celebrating its 20th year anniversary at next month’s special event. Indeed, the purpose of Eagle Creek’s special daylong May 17th event is two-fold: celebrate Eagle Creek’s previous two decades of success and share some exciting news about other future changes planned for this top-ranked high-end daily-fee course. For instance, besides unveiling of Eagle Creek’s new branding and identity, the special May 17th event will also cover Eagle Creek’s clubhouse renovations and proposed Golf Academy expansion, and last, but not least, offer attendees a sneak preview of the property’s newest golf layout. Long a top golf destination of choice for both locals and travelers visiting the City Beautiful, Eagle Creek has consistently delivered the ultimate golf experience for all levels of golfers. But now, Eagle Creek is excited to start offering a new 18-hole short course experience with more details to come. The entire team at Eagle Creek can’t wait to start showing off the course’s exciting new look and officially kick off the 20th year celebration with next month’s invite-only event. To inquire or learn more about next month’s festivities, please email Head of Marketing Lauren Rykwalder at marketing@cflgolf.com or call 352-801-3683. For additional information about Eagle Creek, visit www.cflgolf.com and contact info@eaglecreekorlando.com. Or please connect with us on our following platforms: https://www.eaglecreekorlando.com/ ; https://www.facebook.com/EagleCreekGC ; Eagle Creek Golf Club Orlando – YouTube Filed Under: Uncategorized Eagle Creek Golf Club, Orlando to Celebrate 20-Year Anniversary with May 17th Festivities April 19, 2024 by sebasaristizabal Orlando, Fla. (April 18, 2024) – When Eagle Creek Golf Club opened 20 years ago in east Orlando, the surrounding area was mostly rural and there were just a handful of homes along the tenth hole of the residential golf course development. Today, the championship course is in the heart of one of America’s fastest-growing master-planned communities, Lake Nona, and Eagle Creek will be fully sold out by the end of 2024. To mark the golf club’s official 20 th anniversary milestone, the course is hosting an invitee-only event on May 17 th for invited guests, golf patrons, residents, vendors and media. The purpose of the special event is two-fold: celebrate Eagle Creek’s previous two decades of success and share some exciting news about the future growth of this critically acclaimed high-end public course. Among the festivities on May 17 th will be the official unveiling of Eagle Creek’s new branding and identity, news about the facility’s clubhouse renovations and proposed Golf Academy expansion, and last, but not least, enjoy Eagle Creek’s newest layout. A long time top golf destination of choice for both locals and travelers visiting the City Beautiful, Eagle Creek has always delivered the ultimate golf experience for all levels of golfers. But now, longtime owner/operator Kenny Nairn of Central Florida Golf (CFL Golf) is excited to unveil Florida’s newest 18-hole short course experience at next month’s 20 th anniversary event. The new golf-friendly set of tees is for all levels of golfer seeking an alternative layout with special attention to having fun. It fittingly plays to 2,024 yards to honor the 20 th anniversary year of the golf community created by leading UK-based real estate developer, The Emerson Group. Therein lies the distinct European flair of Eagle Creek, which was co-designed by well-known British course architect Howard Swan and acclaimed Central Florida-based architect Ron Garl. For instance, when the course opened 20 years ago, golfers were treated to British-influenced revetted bunkers, rectangular tees and compact greens. Sixty of these bunkers and dramatic bulkheads are still scattered throughout the course, reminiscent of those found in the classic courses found in Scotland and England. Another trademark of the world-class 7,198-yard facility is the unique collection of five par-5s, making Eagle Creek the only par-73 course in Florida. Length notwithstanding, Eagle Creek’s five sets of tees caters to all levels of golfers from beginners to the world’s best, including elite women amateur golfers that annually play in the prestigious Annika Invitational and University of Central Florida’s NCAA Division I tournament, the UCF Challenge. Conveniently located 15 minutes from Orlando International Airport, Eagle Creek Golf Club’s European-style ambiance and hospitality is also found at the club’s remarkable 14,000-square-foot two-story designed in a vintage New England-manor style. Among the clubhouse highlights are a fully stocked pro shop, locker rooms and showers for men and women, and the aptly named Belfry Restaurant – a 120-seat venue with private wedding and banquet space available. “From the very beginning, the golf course and the clubhouse were second to none,” says Nairn, who is considered one of the game’s elite golf instructors. “But like everything, you’ve got to keep improving what you’re doing. And you’ve got to have the vision to be able to do that, in order to stay at the top of your game and business. “That’s our team’s whole mantra, always striving to do things different and better for our customers.  That’s why we’re doing what we’re doing with our exciting 20 th anniversary celebration next month.” To inquire or learn more about next month’s festivities, please email Head of Marketing Lauren Rykwalder at marketing@cflgolf.com or call 352-801-3683. For additional information about Eagle Creek, visit www.cflgolf.com and contact info@eaglecreekorlando.com . Or please connect with us on our following platforms: https://www.eaglecreekorlando.com/ ; https://www.facebook.com/EagleCreekGC ; https://www.instagram.com/eaglecreekgolfcluborlando/ ; https://www.youtube.com/@EagleCreekGolfOrlando Filed Under: Uncategorized February 28, 2024 by eaglecreekorlando May 2019 Still plenty of green to be found Despite industry assumptions, investors are buying golf real estate By Scott Kauffman In the last decade, more than 1,200 U.S. golf facilities closed, according to the National Golf Foundation, and the total number of U.S. golfers dropped to 23.8 million from a high of 32.9 million in 2003. Yet, in spite of this NGF data and the notso-favorable mainstream media coverage that continues to perceive golf business as a non-growth industry, investors still see “green” in the underlying real estate asset class as an operating course. At least that’s the attitude of numerous leading real estate brokers specializing in course marketing from coast-to-coast and a number of fairly new course buyers. To be sure, closed courses acquired for residential and commercial redevelopment have been – and will always remain – prime targets for real estate investors, builders and developers. But there’s a wave of new first-time buyers who keenly see opportunity or “green” when it comes to maintaining 9 or 18 holes of fairways, manicured greens and reimagined clubhouses for the modern-day club member/consumer attracted to these green-space settings. And many of these new investors are far from golf business rookies, whether it’s former Yamaha national sales manager Brooks West, PGA, in Nashville; noted Scottish PGA Professional Kenny Nairn in Orlando, longtime American Golf executive Ken Hultz or career PGA Professional Rich Smith, to name a foursome of fairly new owners. Indeed, while 1,200 courses might have closed their doors in the last decade, what’s missing in that statistical backdrop is the fact there is arguably an equal number of individuals seeking contrarian strategies and actually buying courses and keeping them open. Consider that Marcus & Millichap broker Steve Ekovich’s Tampa-based Leisure Investment Properties Group secured more than 150 buyers during that same timeframe, and Jon Knudson of Scottsdale-based brokerage Insight Land & Investments counts more than 40 course transactions in the last 10 years. Meanwhile, Adel, Georgia-based broker Hilda Allen closed on more than 40 course sales in the last five years alone (1,000-plus since 1991), and CBRE managing director Jeff Woolson of Carlsbad, California, whose Golf & Resort Properties is the leading leisure real estate brokerage firm in America with more than $1.1 billion in sales volume since 1991, is averaging 10-15 course sales per year since 2009. And this is just a sampling of the real estate professionals in course brokerage. Industry brokers and owners acknowledge supply and demand in the golf asset class hasn’t fully recovered from the financial crisis 10 years ago, and there certainly are not as many large-scale institutional private equity-type buyers chasing investment yield in the golf space. Lack of Wall Street capital notwithstanding, golf business and its typical 100-plus acres of real property continues to attract a steady flow of interested shoppers and buyers. “I’m not convinced that it’s harder to find golf course buyers,” says Golf Property Analysts President Larry Hirsh, one of the country’s leading golf course appraisers/brokers, principally focused in the Mid-Atlantic/Northeast markets. “If the opportunity meets their investment criteria, they’ll pursue it. Of course, there are still – believe it or not – some hobbyist buyers who simply like golf and have money. … There are, in my experience, plenty of suitors for cash-flowing properties or those that have opportunity to cash flow.” Therein explains the ongoing rush by course suitors, especially savvy golfexperienced professionals, to jump in the business. Simply put, many of these first-time buyers see opportunity to grow. Especially when the course or club is in the right place, at the right time – and equally as important, at the right price or valuation. That was certainly the case of West, who closed last Dec. 31 on the former Crossing Golf Course (renamed Franklin Bridge Golf Club) in booming, affluent Williamson County outside Nashville with the help of a Small Business Administration loan and a few local investor partners. As West put it, he’s either a revolutionary or just not so smart, he said with a confident smile of someone with 20-plus years in the business. If anything, West, a graduate of Mississippi State University’s PGA Golf Management program with impressive private club pedigree and strong sales experience for Ahead and Yamaha, is part of an exclusive course ownership club. According to Smith, former CEO/executive director of the PGA of America’s North Florida Section and new owner of Charlotte Harbor National Golf Club at Bobcat Trail and Golf Links of Charlotte Harbor in Port Charlotte, Florida, there’s probably 120 fellow PGA Professionals who own courses – out of some 29,000 members overall. “Twelve years ago there was way more interest in golf than there is today and there were a lot more larger companies (acquiring courses),” Ekovich points out. “What’s really different is there’s a lot more first-time buyers in the market and buyers new to golf because the affordability index for golf courses has totally changed. The model’s changed. “Before, an average course that was $4 million was out of most people’ s range. Now, that course, let’s call it a pre-2006 property, is worth $1.9 or $2 million. As a result, it opens up a lot more people. We’ve seen two different classes of buyers that have really come to the forefront in the last year or two. First is the golf course person with experience but working at other firms – someone seeing opportunities at courses being mismanaged by people who bought them and didn’t know what they were doing, or they were in bad locations.” The other first-time buyer increasingly kicking golf car tires these days, says Ekovich, is the “golf-passioned buyer” who believes golf’s traditional ways of doing business no longer works and they can create more “ebitda” or net income/value by adopting a more service-oriented, hospitality approach to golf. That can be everything from creating more “restaurant-type touch and feels throughout the club,” Ekovich adds, or adopting things like “internet marketing using the hotel model for tee times.” Fueling this confluence of first-time buyer activity is the fact more courses are falling into that “affordable” $2 million range, meaning the ability to raise capital from “family and friends” or SBA financing, for example, is more realistic. Of all the different commercial real estate asset classes, Woolson says golf and second-home developments are the only ones that haven’t “fully recovered” in the recent real estate cycle or economic expansion. “Golf is slightly ahead of second-home real estate,” Woolson notes, “But these are the two lagging asset classes for two different reasons. Secondhome real estate hasn’t recovered because there’s a lot of people who don’t want to own second homes. There’s a lot of people, the Gen Xers and Millennials that are saying, ‘We don’t know if we want to own a home in the mountains like our parents did.’ “Golf, I still think, is a viable asset class. It provides great cash flow. And we’ve had this in our proposals a lot. We call it the tale of two cities. Some golf courses are worth a lot; some golf courses are worth nothing. And there’s hardly anything in the middle. Golf course investments, and I don’t mean playable wise, I mean investment wise. … There’s either really good investments or there’s just really bad investments. Really bad ones are not trading and they’re not doing well.” That’s not the case at Gettysvue Polo, Golf & Country Club, situated high atop a matured affluent Knoxville, Tennessee, community that looks out over sweeping views of the Smoky Mountains. Featuring a strong membership base and great pool, tennis, fitness and clubhouse amenities, the private facility “always had my eye,” says Hultz. And Hultz knows this property well because his company, American Golf, oversaw the club prior to his scheduled closing April 9. “Like anything, you identify areas of opportunity whenever you acquire a club or asset, and from our perspective, Gettysvue had continued to be enhanced by American Golf in every level,” says Hultz, who was buying the club with three other career golf operations professionals. “There’s a better member experience, improved facilities. … And I think myself and the friends/partners that are part of this, we all identified there’s still those additional opportunities to drive membership and the member experience. “From our vantage point, which all of the partners feel and truly believe. If you take care of the members, the P&L (profit and loss) will take care of itself.” Nairn, managing partner of Orlando-based CFL Golf, has been taking care of golf operations business since 2008, when he joined Celebration Golf Management after his organization acquired Celebration Golf Club near Walt Disney World. Ten years later, after his previous group dissolved, Nairn became the owner of three other successful Orlando-area properties: Eagle Creek Golf Club, an upscale daily course in one of the country’s top-selling master-planned communities (Lake Nona); RedTail Golf Club, a semi-private facility in Sorrento at the doorstep of a soon-to-be-completed beltway that will encircle Orlando; and 36-hole King’s Ridge Golf Club situated in an active age-restricted community. Nairn’s partner in the new company is Larry Snyder, a third-generation certified course superintendent. In many respects, Nairn’s adjustment in becoming a course owner has been matter-of-fact. “It’s like everything,” Nairn notes. “You make a decision with all of the due diligence in advance.” Without providing specific figures, privately held CFL Golf is successful to say the least as it enters its fourth season. “If you can pay your debt, then you’re obviously doing something right,” says Nairn, a native of St Andrews, Scotland. “And if you can pay your debt, you’re usually putting some capital back into the property and so forth. So, your other hat is obviously real estate. You got to buy it right. And obviously – location, location, location. I think we’ve been successful in those things.” Regarding future golf property investments, Nairn, 48, says he’s not actively looking. And with his daughter beginning her last year of university, meaning “she’ll soon be off my payroll,” the Scotsman really doesn’t know what the future holds for his course portfolio and beloved game he represents so well as a member of the PGA of Great Britain & Ireland and European Golf Teachers Federation. “From an investment perspective I can easily say I don’t know the out or the end result,” Nairn says. “I would not say we’re successful or not successful. Our doors are open; our courses are in great condition; we’ve got fantastic employees. Let’s put it that way. “Golf is a very difficult business to be in, but I would say every business is difficult because you got to try and get your experiences correct. You got to try and get your marketing down. I’m coming up on over 20 years in Orlando and every year I still think about marketing. OK, what did I try last year? What was my success; what were my failures? It’s working but it’s just bloody hard work.” For a growing number of first-time course owners with golf backgrounds like Nairn, it’s bloody hard work they wouldn’t trade for anything else right now. https://www.eaglecreekorlando.com/blog-may-2019/ Filed Under: Uncategorized Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://mycentralfloridafamily.com/venue/eagle-creek-golf-clubhouse/",
      "text": "Eagle Creek Golf Clubhouse - MyCentralFloridaFamily.com Facebook Instagram TikTok Youtube Sign in Join Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Sign in Welcome! Log into your account your username your password Forgot your password? Create an account Sign up Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email Search Wednesday, September 10, 2025 Sign in / Join Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Facebook Instagram TikTok Youtube Sign in Welcome! Log into your account your username your password Forgot your password? Get help Create an account Create an account Welcome! Register for an account your email your username A password will be e-mailed to you. Password recovery Recover your password your email A password will be e-mailed to you. MyCentralFloridaFamily.com Home Who Are We? Today’s Events Daily Event Calendar Submit an Event New Events Calendar Seasonal Falls, Fairs, and Festivals Guide Oktoberfest Guide Halloween Event Guide Pumpkin Patch Guide Corn Maze Guide Fall Consignment Sales End of Summer Deals Outdoor Movie Guide School Calendar Guide News Latest Family Event News News Categories Family Events Steals and Deals Outdoor Fun & Events Indoor Fun & Events Theme Parks News & Events Music & Theater Events Free Events Event Daily Calendar Event Reviews Giveaways Website Guide Family Guides All Family Guides Parks and Playground Guide Library Guide Zoo and Animal Guide Museum Guide School Calendars Kid’s Theater Guide Indoor Playground Guide Farmer’s Market Guide Race and Walk Guide Kids Expo Exhibitor Information More Contact Us Advertise Social Facebook Instagram TikTok YouTube Facebook Group Submit Submit an Event Feature Your Event Submit Press Release Summer Camp Guide Info Summer Camp Guide Advertising Summer Camp Media Kit 2025 Summer Camp Guide Submit Summer Camp Facebook Instagram TikTok Youtube 0 events found. Orlando Family Events Calendar – Things to Do with Kids in Central Florida Discover the Orlando Family Events Calendar , your go-to guide for things to do with kids and families in Central Florida. From exciting Orlando festivals, family-friendly fairs, and seasonal holiday events to local story times, free community activities, and weekend fun across Orange, Seminole, Osceola, Lake, and Volusia counties, our calendar makes it easy to plan memorable outings. Whether you’re looking for kid-friendly events, indoor play, outdoor adventures, or special attractions like theme park happenings, our Central Florida events calendar Images by Blue Sunglass Photos With our Orlando Family Events Calendar , you can easily filter events by category to find exactly what fits your family’s needs. Browse holiday celebrations, free and low-cost events, back-to-school activities, seasonal festivals, and so much more. You can also filter by venue, city, cost, or even check out our featured events to quickly discover what’s happening near you. You can view listings by the day to plan their schedule, flip through different days to explore new opportunities, or switch to the monthly calendar view for a big-picture look at everything happening across Orlando and Central Florida. If you’re hosting a family-friendly event, you can even submit it directly to our calendar here . Want to have events and news deliverd to your inbox, click here to sign up for our weekly newsletters! Be sure to always double and triple check dates, times, and details of any event before heading out, as event producers may make last-minute changes without notifying us, and occasional errors may occur when loading events into the calendar. Notice There were no results found. Notice There were no results found. Eagle Creek Golf Clubhouse Events Venues Eagle Creek Golf Clubhouse Address 10350 Emerson Lake Boulevard Orlando , FL 32832 United States Get Directions Events at this venue Today Upcoming Upcoming Select date. Condense Events Series Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Thank you for visiting us at MyCentralFloridaFamily.com. We're happy you're here! This website was designed to assist families with finding resources, ideas and things to do within the Central Florida community. We encourage all families to check and double check all events, information and news prior to making decisions for their families because, while we strive for perfection, information, news, events, and details always will and do change. Our website contains paid, non-paid, and in-trade mentions, articles, and reviews of organizations, events, schools and businesses throughout Central Florida. These mentions are for informational purposes only and should not be considered an endorsement. Please do further research on your own before choosing an event, organization, school or business to engage with. Families and individuals using our site assume all risks from any activities they participate in. MyCentralFloridaFamily.com, Epic Expos, Inc., their employees and owners are not responsible for any injuries or issues that come from participating in any of the events or opportunities listed on our website or social pages. All users/readers/visitors to MyCentralFloridaFamily.com agree to hold Epic Expos, Inc. and all of it's entities harmless in any such claims. With that said, we hope you find our website and social pages full of fun ideas and opportunities to make family memories and make your Central Florida living easier than ever. Copyright © 2025 MyCentralFloridaFamily.com Contact us: Newsletter@MyCentralFloridaFamily.com Facebook Instagram TikTok Youtube ©"
    },
    {
      "url": "https://www.eaglecreekorlando.com/tournaments-golf-events/",
      "text": "Tournaments + Golf Events - Eagle Creek Golf Club Skip to primary navigation Skip to main content Skip to footer Eagle Creek Golf Club Home Golf Book a Tee Time Specials Frequent Player Programs Tournaments + Events Course Details Hole by Hole Photo Gallery Course Architects Course Tour Policies The Shortie The Shortie 2025 The Shortie 2024 The Shortie 2023 The Shortie 2022 The 2025 Shootout Weddings Weddings Special Events Gallery FAQ Request Information Restaurant The Belfry Restaurant Event Calendar Golf Coaching The Golf Academy at Eagle Creek Meet The Team Testimonials Annual Coaching Program Coaching Coach Liam Sullivan Coach Adam Andrews Coach Kenny Nairn Coach Stone Gomez Club Fitting Junior Golf Development Golf Schools and Group Coaching Tournaments & Corporate Events Coaching Gallery Kenny Nairn Golf Student Achievements Shop Online Tournaments + Golf Events Your Premier Destination in Central Florida for Tournaments, Golf Events & Outings! Come experience a first-class tournament set up from a professional staff! No matter what contests or unique offerings you would like to be part of your event, our team at Eagle Creek will make it happen. From Sponsor Signs to morning Bloody Mary bars and Closest to the Pin contests to on-course sponsors and vendors, we are here to help you make your golf tournament as fun and memorable to you and your players as humanly possible. Our spacious bag drop allows for plenty of room for tables and morning set up and a spread out cart staging area for your guests. There are endless options to make an event uniquely yours! Our staff is available not only for the set up but to help the players find their way and carry their golf bags as well. First time planning a golf outing and don’t know where to start? Let us help you and prove why we are the premiere Golf Club in Central Florida for your event! Starting Options Shotgun- A favorite for larger groups with all teams starting simultaneously on multiple holes, allowing all teams to start and finish around the same time. Single Tee- All teams start on one tee box in 9-minute intervals. Split tee- Identical to single tee but the group splits in half and half goes off the first tee and half the group goes off on the tenth tee. Tournament playing format options Scramble- Each player hits a tee shot, the second shot is taken from the best first shot. Play continues to take the best shot and everyone plays from there. Individual Stroke- Each golfer competes individually and gets a gross score. If handicaps are involved, then the winner would be the person with the lowest net score. Best Ball- Each player gets an individual score but only the best score is taken each hole for the team. Customized Golf Outing Experience Tournament Planning Tournament Announcements Social Media Posts Customized Cart Plates Showing Names of Players Custom Meal Packages Range Balls On-Course Contests (Long Drive, Closest to the Pin) Bag Handling Customized Scorecards Hole Sponsor Guidance and Setup Scoring Options Scoring At Eagle Creek we try to use the best technology to elevate your experience! TournEvents is our preferred tournament hosting platform. TournEvents offers easy to use software at no cost to the tournament and gives it a professional look that you can’t get anywhere else. Once the signups for the event have concluded the Tournament Organizer doesn’t even need to send over a pairings list as we the course can pull it straight from the TournEvents page. Combine that with the ease of use, free digital scoring and excellent reporting, this is what makes TournEvents our go to software. Learn More About TournEvents We also use Golf Genius for various playing formats and for printing custom tailored scorecards, cart placards and scoreboards for your event! Golf Genius’ open design concept makes it easy to customize literature with sponsor logos, company logos, event logos or anything else you can think of! Scoring for tournaments is done by our professional staff and is included in all events that have a banquet meal included at no charge. Tournament FAQ Can we have hole signs and, on the course sponsors? Yes, we think this is a great thing for your tournament to get your players more involved with the tournament and give exposure and networking opportunity to your vendors! Can we cater food and still use the restaurant? You cannot cater your own food, but with tournaments there is the availability of having a banquet upstairs in the Belfry with many options for lunch. Can we pass out food/Alcohol on the course? You are allowed to pass out things such as chips or other snacks, but a corkage fee would be applied, the same goes for Alcohol but there is only one Alcoholic beverage allowed per player per station for safe service purposes. How many people can our tournament have? Our maximum number of players is 144 players per shotgun tournament, the maximum we can have in the belfry is 185 people to eat after the conclusion of the tournament. When do we need to have our final player count for food and when do the final pairings need to be sent? For your food order we need the final count of players, volunteers, or any other people eating 14 days in advance to your tournament. For final player count and pairings, we need those 3 days before the start of your tournament. Do you have partners that you can recommend that you have worked with before? YES! Please reach out to Mike to discuss the hole games/activities you are looking to do. With as many tournaments as we do in a year we will be able to point you in the right direction if we cannot handle it in house. Can we have a golf clinic for inexperienced players who may want to learn or play in the future? Yes! We have several options that can be custom tailored to the experience you want your guests to have. The Golf Academy @ Eagle Creek will provide a memorable learning experience for players of all ages while keeping it light and fun! Do you have in house golf professionals for Beat the Pro or Long Drive contests? Yes we do! We have multiple Golf Professionals on staff that can do these games/activities and many others! We recommend reaching out 30 days in advance of the tournament to get this scheduled. Are we allowed to have Sponsors/Vendors or Tee Parties on course during our tournament to talk to players and hand out literature and food/drinks? Yes you are. At Eagle Creek we require 100 player minimum in order to do these things so that you have exclusivity in the morning and no other players will come in contact with your vendors. Without getting to the 100 player mark, you may still have contests such as Closest to the Pin and Long Drive or anything else that does not require physical witnesses. Donated food or drinks not purchased at Eagle Creek Golf Club will incur a corkage fee. Testimonials We love hearing your feedback! Check out this awesome review we received after we hosted the CFBAA Tournament! #eaglecreekgc What guests say: “I am writing to let you know how impressed I was interacting with your staff. Everyone from the ground crew to the administration displayed an awesome level of courtesy, professionalism and more importantly kindness. I am wowed by the respect shown by each level of staff working. I feel as if I won the lottery. You are to be commended for having a great staff with an awesome course. Thank you so very much. I will carry this experience for a lifetime, and I will share that with all I know.”  Delores THE BELFRY RESTAURANT THE BELFRY RESTAURANT Tournaments Request Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Footer Visit Us Eagle Creek Golf Club 10350 Emerson Lake Blvd Orlando, FL 32832 Hours of Operation Hours based on day light hours. For the most up to date information please call our Pro Shop. Contact Us (407) 273-4653 Directions | Ext. 1 Reservation Agent at Eagle Creek | Ext. 2 Golf Academy | Ext. 3 The Belfry Restaurant | Ext. 4 Banquets and Weddings | Ext. 5 Golf Events Sales Larger than 16 Players | Ext. 6 Speak with our Professional Staff | Ext. 7 info@eaglecreekorlando.com Follow Us Quick Links Policies Audubon Certified CFL Golf Contact 20th Anniversary Blog Eagle Creek Golf Club | 10350 Emerson Lake Blvd Orlando, FL 32832 | (407) 273-4653 Copyright © 2025 Eagle Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eagleridge.com.au/about-us/",
      "text": "About Us – Eagle Ridge Golf Course Skip to content BOOK ONLINE Toggle Navigation Play Golf Golf at Eagle Ridge Book Your Round Social Golf Enquiry Form Members Comp Booking Play & Stay Membership Membership Corporate Advertising Membership Learn Starter Golf Program Gift Vouchers The Course Essential Info About Us Gallery Hole by Hole Local Rules Contact Us FAQ About Us admin 2023-03-09T21:45:11+10:00 About Eagle Ridge Golf Course Eagle Ridge, a family business Eagle Ridge Golf Course began its life as the smaller Carlogie Golf Course until March 1988 when an additional parcel of land was purchased, earthworks commenced and a new Kevin Hartley designed championship course began to emerge, opening as Eagle Ridge Golf Course in December 1989. Kevin Hartley was the Australian amateur golf champion of 1958 and runner up to Bruce Devlin in the 1959 Australian Amateur. He captained the Victorian state team thirteen times, was the leading amateur at three Australian Opens, and represented Australia many times, including winning the 1966 Eisenhower Cup team in Mexico. Hartley based his design vision on Eagle Ridge becoming the “Royal Melbourne of the Mornington Peninsula”. Ownership of Eagle Ridge passed to the Russo family in 1995 and, in 1999, Pacific Coast Design was commissioned to design a five year Master Plan for course improvements and the design and construction of our magnificent Clubhouse commenced. The Clubhouse opened to great acclaim in October 2000 and, under the careful management of our Golf Course Superintendent Scott Balloch, the course Master Plan was completed four years later. In late 2007, in recognition of the challenges that the extended drought brings to all golf courses, Eagle Ridge closed for a summer to change all fairways to Santa-Ana couch – a more drought tolerant grass and regarded as one of the finest playing surfaces for golf course fairways. It has been one of the most important course decisions made since the inception of Eagle Ridge and we are proud of the success of the project with a 45% reduction in water consumption and stunning fairways to enhance every golfers’ game. Despite becoming one of the best landscaped and featured courses in Australia, we are always building on Kevin Hartley’s vision with an attitude of “continuous improvement”. From the smiles on first-time players’ faces, to the eager return visitors keen to conquer the layout, we’re confident Eagle Ridge presents something different to all golfers, and ensures a great day out on the famed golfing turf of the Mornington Peninsula. A FAMILY AFFAIR The Russo family owned and developed the Eagle Ridge course and facilities for 20 years. Nick Russo was passionate about the business and commenced the construction of the Clubhouse and Course Master Plan with a focus few could match. Much to our members’ amusement (and often dismay), he was not an avid golfer at all, which allowed him to see the course and facilities as a total package – he built our functions venue (home to some of the Peninsula’s most stunning weddings and now the Peninsula Beer Garden ), developed our outstanding corporate golf products (we are now a leader in corporate golf events) as well as learning about and delivering a great day out for golfers, whether they be green fee players, corporate guests or members. After losing Nick to cancer in 2007, it was an uphill, but ultimately fruitful, road as the business was passed to the next generation. THE FAMILY AFFAIR CONTINUES In April 2016 the baton was passed onto the Chen family with the parents as Directors, along with son Charlie and partner Katrina taking up roles within the management structure. All of the fantastic past work will be utilised as a strong base to further enhance both the golf and hospitality facilities. As of January 2022 Eagle Ridge Golf Course continues to improve with ongoing works to every hole in an effort to ensure Eagle Ridge remains on of the best public golf courses in Australia. Now in the suite of offerings comes our Peninsula Beer Garden which offers stunning views local live music while supplying local craft beer on tap and fantastic local meals. Toggle Navigation Home Environmental Policy Privacy Policy Eagle Ridge Golf Course 215 Browns Rd, Boneo VIC 3939 03 5988 2500 Golfshop@eagleridge.com.au Toggle Navigation Toggle Navigation Toggle Navigation Toggle Navigation We acknowledge the Bunurong / BoonWurrung people as the Traditional Custodians of the Country we are meeting on today. We recognise their continuing connection to the land and waters, and thank them for protecting this coastline and its ecosystems since time immemorial. We pay our respects to Elders past and present, and extend that respect to all First Nations people present today. © Copyright 2025 |   Created by AP |   All Rights Reserved   | Page load link Go to Top"
    },
    {
      "url": "https://eaglecreek.clublink.ca/about/team/",
      "text": "Our Team - \n          \n\n          \n            Eagle Creek Golf Club Toggle Menu Become a Member Sign In Home About Us Club Overview Scorecard Our Team Game Improvement Golf Shop Gallery Golf Policies Bistro Menu Membership Overview Guest Fees Request Information Events Golf Tournaments Meetings & Banquets Game Improvement Contact Us ClubLink View another club: Select a club Associate Gold Membership Blue Springs Golf Club Business Golf Concierge Caledon Woods Golf Club Cherry Downs Golf Club Club de golf Hautes Plaines Club de golf Islesmere Club de golf Rosemère Fontainebleau ClubLink Players Club Deer Creek DiamondBack Golf Club Eagle Creek Golf Club Emerald Hills Golf Club Georgetown Golf Club Glen Abbey Golf Club Glencairn Golf Club Glendale Golf Club Grandview Golf Club GreyHawk Golf Club Greystone Golf Club Heron Point Golf Links Hidden Lake Golf Club Kanata Golf and Country Club King Valley Golf Club King's Riding Golf Club La Bete Golf Course Le Maître de Mont Tremblant RattleSnake Point Golf Club Rocky Crest Golf Club Rolling Hills Golf Club Station Creek Golf Club The Lake Joseph Club Vespra Hills Golf Club Wyndance Golf Club U.S. Clubs © Copyright. All Rights Reserved. 15675 Dufferin Street. King City, Ontario, L7B 1K5, 1-800-661-1818 © Copyright. All Rights Reserved. 15675 Dufferin Street. King City, Ontario, L7B 1K5, 1-800-661-1818 Eagle Creek Golf Club About Us Club Overview Scorecard Our Team Game Improvement Golf Shop Gallery Golf Policies Bistro Menu Our Team Director of Operations Ryan Little 613-832-3400 ext. 2224 Head Superintendent Kim Best 613-832-3804 Associate Professional Carson Scissions 613-832-3804 ext. 2225 Events and Sales Manager Katie Lillie 613-832-3804 ext. 2223 Clubhouse Manager Eric Morin 613-832-3804 ext.2226 Facilities Manager Don Garries 613-832-3804 ext. 2228 Captcha: 109 Royal Troon Lane Dunrobin,\n                ON,\n                K0A 1T0,\n                Canada T 613-832-3804 F 613-832-2955 109 Royal Troon Lane\n            Dunrobin,\n            ON,\n            K0A 1T0,\n            Canada T 613-832-3804 F 613-832-2955 Become a Member Sign In About Us Membership Events Contact Us Employment Investor Relations Shop Privacy Policy Accessibility U.S. Clubs © Copyright. All Rights Reserved. 15675 Dufferin Street. King City, Ontario, L7B 1K5, 1-800-661-1818 © Copyright. All Rights Reserved. 15675 Dufferin Street. King City, Ontario, L7B 1K5, 1-800-661-1818"
    }
  ]
}