{
  "fuentes": [
    {
      "url": "https://www.ebparks.org/reservations/event-venues",
      "email": "brazil@ebparks.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "acooley@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "amcdonald@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "brandi@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "caxley@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "cvelasquez@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "dgiles@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "ekokernak@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "finance@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "grantsmanagement@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "info@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "jcavanagh@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "jhampton@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "jmoy@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "kgan@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "khersh@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "kjackson@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "mgaw@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "mgrajeda@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "mhaidari@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "philanthropy@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "sbaker@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "swu@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "syelimeli@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "tjohnson@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "tjue@eastbaycf.org"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "email": "zbrewer@eastbaycf.org"
    },
    {
      "url": "https://www.ebparks.org/reservations/event-venues/brazilian-room",
      "email": "brazil@ebparks.org"
    },
    {
      "url": "https://eastbayforeveryone.org/",
      "email": "info@eastbayforeveryone.org"
    },
    {
      "url": "https://www.eastbayspecialevents.com/contact-us",
      "email": "sales@eastbayspecialevents.com"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "info@eastbaydist.com"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "sales@eastbaydist.com"
    },
    {
      "url": "https://www.mytrilogylife.com/vineyards/events-weddings/",
      "email": "vineyardsweddings@trilogyresort.com"
    },
    {
      "url": "https://belistasteofhome.com/catering-company-in-east-bay/",
      "email": "info@belistasteofhome.com"
    },
    {
      "url": "https://eastbayc.com/about-us/",
      "email": "info@eastbayconnection.us"
    },
    {
      "url": "https://www.eastbaygrille.com/private-events",
      "email": "gmitchell@eastbaygrille.com"
    },
    {
      "url": "https://www.eastbaygrille.com/private-events",
      "email": "kodowd@eastbaygrille.com"
    }
  ],
  "mails": [
    "acooley@eastbaycf.org",
    "amcdonald@eastbaycf.org",
    "brandi@eastbaycf.org",
    "brazil@ebparks.org",
    "caxley@eastbaycf.org",
    "cvelasquez@eastbaycf.org",
    "dgiles@eastbaycf.org",
    "ekokernak@eastbaycf.org",
    "finance@eastbaycf.org",
    "gmitchell@eastbaygrille.com",
    "grantsmanagement@eastbaycf.org",
    "info@belistasteofhome.com",
    "info@eastbaycf.org",
    "info@eastbayconnection.us",
    "info@eastbaydist.com",
    "info@eastbayforeveryone.org",
    "jcavanagh@eastbaycf.org",
    "jhampton@eastbaycf.org",
    "jmoy@eastbaycf.org",
    "kgan@eastbaycf.org",
    "khersh@eastbaycf.org",
    "kjackson@eastbaycf.org",
    "kodowd@eastbaygrille.com",
    "mgaw@eastbaycf.org",
    "mgrajeda@eastbaycf.org",
    "mhaidari@eastbaycf.org",
    "philanthropy@eastbaycf.org",
    "sales@eastbaydist.com",
    "sales@eastbayspecialevents.com",
    "sbaker@eastbaycf.org",
    "swu@eastbaycf.org",
    "syelimeli@eastbaycf.org",
    "tjohnson@eastbaycf.org",
    "tjue@eastbaycf.org",
    "vineyardsweddings@trilogyresort.com",
    "zbrewer@eastbaycf.org"
  ],
  "nombre_sitio": "eastbayspecialevents.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ebparks.org/reservations/event-venues",
      "text": "Event Venues | East Bay Parks Skip to main content Show Mobile Menu Select a Park or Trail Select a Park or Trail Alameda Creek Regional Trail Anthony Chabot Antioch/Oakley Ardenwood Bay Point Big Break Bishop Ranch Black Diamond Mines Briones Briones to Las Trampas Regional Trail Briones to Mt. Diablo Regional Trail Brooks Island Browns Island Brushy Peak California Riding and Hiking Trail Carquinez Strait Castle Rock Claremont Canyon Contra Costa Canal Regional Trail Contra Loma Coyote Hills Crockett Hills Crown Beach Cull Canyon Deer Valley Del Valle Delta de Anza Regional Trail Diablo Foothills Don Castro Dry Creek Pioneer Dublin Hills Dumbarton Quarry Campground East Bay Skyline National Recreation Trail Five Canyons Garin Hayward Huckleberry Iron Horse Regional Trail Juan Bautista de Anza National Historic Trail Judge John Sutter Kennedy Grove Lafayette-Moraga Regional Trail Lake Chabot Las Trampas to Mt. Diablo Regional Trail Las Trampas Leona Canyon Little Hills Martin Luther King Jr. Marsh Creek Regional Trail McLaughlin Eastshore Miller/Knox Mission Peak Morgan Territory Ohlone Wilderness Oyster Bay Pleasanton Ridge Point Isabel Point Pinole Quarry Lakes Radke Martinez Reinhardt Redwood Roberts Round Valley San Francisco Bay Trail San Pablo Bay Regional Shoreline Trail Shadow Cliffs Sibley Sobrante Ridge Sunol Sycamore Valley Temescal Thurgood Marshall Tilden Tilden Botanic Garden Tilden Nature Area Vargas Plateau Vasco Caves Waterbird Wildcat Canyon Leave this field blank Search Terms Leave this field blank Visit a Park Parks Visitor Centers Trails Trail Courtesy Maps Alerts & Closures Rules & Regulations New Visitors Visitor Safety ADA Accessibility Things to Do Calendar Activities and Events Public Meetings Community Meetings Recreation Archery Biking Birding Boating Camping Equestrian Resources Fishing Geocaching Golfing Hiking Merry-Go-Round Model Boats, Planes & Trains Picnics Swimming Programs Community Outreach Day Camps Educator Resources Field Trips Healthy Parks Healthy People Memorial Bench Program Naturalist Education Outdoor Recreation Registration Youth and Teens Reservations Activity Registration Camping Event Venues Picnics Swimming Permits Get Involved Become a Member Donate Volunteer Our Work Park Projects Park Improvements Regional Trails Future Planning Resource Management Natural Resources Biodiversity Climate Adaptation Grazing Pest Management Water Quality Wildfire Resilience Government Affairs Public Safety Police Department Fire Department Lifeguard About Us Board & Staff Board of Directors General Manager Park Advisory Committee Staff Human Resources Division Jobs What's New News Newsletter RIN Activity Guide Social Media We Celebrate Public Info Awards Bids & RFPs Budget Publications & Media e-Newsletter Interpretive Panels Print Publications Story Maps Videos Mission & Vision History Regional Parks Foundation Compass Magazine Memberships & Donations Contact Us Get Help New to the Outdoors Police Register/Reserve Report an Incident Event Venues Activity Registration Camping Event Venues Permits Picnics Swimming Home  Reservations  Event Venues Back to top Reservations are currently booking through December of 2026. Reservations for 2027 will open on Wednesday, January 14, 2026 at 9 a.m. On opening day, reservations may be made by phone only, walk-ins will not be accepted For your next event, consider one of our event venues or outdoor spaces set in a natural park environment. Your guests will enjoy the unique historic, artistic, and cultural spaces for all group sizes inside and out. Our four event venues are ideal for weddings, celebrations, workshops, and retreats in tranquil parkland and waterfront settings at affordable rates. Our approved caterer and preferred vendor partners complete the package by offering their expertise and experience producing events to help guide you through your event planning journey. Contact our Rental Facilities Office at brazil@ebparks.org or (510) 544-3164. We also have many outdoor picnic sites throughout our parks that are perfect for weddings of all sizes. To make reservations for an outdoor location, call 1-888-EBPARKS ( 1-888-327-2757 ), press option 2. If you prefer a completely full service option, check out our event spaces operated by our approved and experienced park partners. Available Rental Facilities Image Tilden Brazilian Room Our iconic and historic flagship wedding and event venue located in the heart of Tilden Regional Park Image Kennedy Grove Fern Cottage An intimate venue with a private backyard garden and forest views located in the Kennedy Grove Regional Recreation Area Image Martin Luther King Jr. Shoreline Center - Temporarily Closed A mid-Century waterfront venue with views of the San Leandro Bay and East Bay Hills located at the Martin Luther King Jr. Regional Shoreline. Image Temescal Temescal Beach House A charming lakeside venue with a large courtyard patio and waterfront views located in the Temescal Regional Recreation Area Rental Facilities Resources Learn more about hosting your event at our beautiful and unique rental facilities. Image Availability and Reservations Image Caterers and Vendors Image Rental Facilities Documents Image Rental Facilities FAQs Image Contact Us For Availability, Reservations, and Insurance Info: Reservations Department Phone: 1-888-EBPARKS ( 888-327-2757 ), option 2 Office Hours : Mon-Fri, 9am-4pm For Appointments and General Facility Info: Rental Facilities Operations Phone : (510) 544-3164 or email below Office Hours : Mon-Fri, 10am-3pm Check availability online, 24 hours a day: Availability Calendar Send An Inquiry Popular Outdoor Picnic Sites for Weddings Image Reinhardt Redwood Picnic Areas - Oakland There are THREE (3) reservable sites at Reinhardt Redwood Regional Park. Image Roberts Picnic Areas - Oakland There are eight (8) reservable sites at Roberts Regional Recreation Area. Image Tilden Picnic Areas - Berkeley There are thirteen (13) reservable sites at Tilden Regional Park. Image Briones Picnic Areas - Lafayette / Martinez There are three (3) reservable sites at Briones Regional Park. Beer and wine… Image Contra Loma Picnic Areas - Antioch There are six (6) reservable sites at Contra Loma Regional Park. There is no… Image Del Valle Picnic Areas - Livermore There are twelve (12) reservable sites at Del Valle Regional Park. Beer and… Image Kennedy Grove Picnic Areas - El Sobrante There are seven (7) reservable sites at Kennedy Grove Regional Recreation Area. Image Quarry Lakes Picnic Areas - Fremont There are four (4) reservable sites at Quarry Lakes Regional Recreation Area. Partner Event Spaces (Opens in new window) Read More Image Little Hills Events by Palmdale Estates Events Nestled in the Las Trampas Regional Wilderness, this venue offers a beautiful and intimate setting for wedding ceremonies, receptions and corporate events. Say “I do” atop the picturesque plateau surrounded by nature's magnificent beauty, dine in our intimate white tent and dance the night away under the stars and twinkling market lights. (Opens in new window) Read More Image The Bridge Yard by Oakland Venue Management Once a maintenance facility for the Bay Area’s ubiquitous street cars, the Bridge Yard is Oakland’s newest event space. The award-winning restoration of this historic building features panoramic waterfront views of Oakland and San Francisco, an iconic light-filled indoor space, and an outdoor courtyard with a stage, seating and elevated viewing deck. Sign up for Monthly e-Newsletter Updates Sign up to receive the Park Explorer e-Newsletter to get latest updates on parkland and conservation projects, special events, and exciting activities in the Regional Parks. Your right to privacy is a priority -- be assured that we will never sell, rent, or provide your email address, or any other information to outside organizations. First Name (required) Last Name (required) Email Address (required) City (required) Leave this field blank 2950 Peralta Oaks Court, Oakland, CA 94605 1-888-EBPARKS, 1-888-327-2757 (Deaf or Hearing Impaired, use the TRS at 711) Footer menu First Column GENERAL INFO About Us Awards Bids & RFPs Board of Directors Budget Jobs News Park Advisory Committee Police Regional Parks Foundation Column 2 CONNECT Calendar Contact Us Donate Report an Incident Visitor Feedback Volunteer Column 3 RESOURCES Accessibility Alerts & Closures All Maps Calendar Park Rules & Regulations Terms of Use & Privacy Visitor Safety We Celebrate Stay Connected Facebook (Opens in new window) Twitter (Opens in new window) Instagram (Opens in new window) YouTube (Opens in new window) LinkedIn (Opens in new window) © 2025 East Bay Regional Park District. All Rights Reserved. Select a Park or Trail Select a Park or Trail Alameda Creek Regional Trail Anthony Chabot Antioch/Oakley Ardenwood Bay Point Big Break Bishop Ranch Black Diamond Mines Briones Briones to Las Trampas Regional Trail Briones to Mt. Diablo Regional Trail Brooks Island Browns Island Brushy Peak California Riding and Hiking Trail Carquinez Strait Castle Rock Claremont Canyon Contra Costa Canal Regional Trail Contra Loma Coyote Hills Crockett Hills Crown Beach Cull Canyon Deer Valley Del Valle Delta de Anza Regional Trail Diablo Foothills Don Castro Dry Creek Pioneer Dublin Hills Dumbarton Quarry Campground East Bay Skyline National Recreation Trail Five Canyons Garin Hayward Huckleberry Iron Horse Regional Trail Juan Bautista de Anza National Historic Trail Judge John Sutter Kennedy Grove Lafayette-Moraga Regional Trail Lake Chabot Las Trampas to Mt. Diablo Regional Trail Las Trampas Leona Canyon Little Hills Martin Luther King Jr. Marsh Creek Regional Trail McLaughlin Eastshore Miller/Knox Mission Peak Morgan Territory Ohlone Wilderness Oyster Bay Pleasanton Ridge Point Isabel Point Pinole Quarry Lakes Radke Martinez Reinhardt Redwood Roberts Round Valley San Francisco Bay Trail San Pablo Bay Regional Shoreline Trail Shadow Cliffs Sibley Sobrante Ridge Sunol Sycamore Valley Temescal Thurgood Marshall Tilden Tilden Botanic Garden Tilden Nature Area Vargas Plateau Vasco Caves Waterbird Wildcat Canyon Leave this field blank Search Terms Leave this field blank Mobile Menu Visit A Park Show submenu Parks Show submenu Visitor Centers Trails Show submenu Trail Courtesy Maps Alerts & Closures Rules & Regulations New Visitors Visitor Safety ADA Accessibility Things to Do Show submenu Calendar Show submenu Activities and Events Public Meetings Community Meetings Recreation Show submenu Archery Biking Birding Boating Camping Equestrian Resources Fishing Geocaching Golfing Hiking Merry-Go-Round Model Boats, Planes & Trains Picnics Swimming Programs Show submenu Community Outreach Day Camps Educator Resources Field Trips Healthy Parks Healthy People Memorial Bench Program Naturalist Education Outdoor Recreation Registration Youth & Teens Reservations Show submenu Activity Registration Camping Event Venues Picnics Swimming Permits Get Involved Show submenu Become a Member Donate Volunteer Our Work Show submenu Park Projects Show submenu Park Improvements Regional Trails Future Planning Resource Management Natural Resources Show submenu Biodiversity Climate Adaptation Grazing Pest Management Water Quality Wildfire Resilience Government Affairs Public Safety Show submenu Police Department Fire Department Lifeguard About Us Show submenu Board & Staff Show submenu Board of Directors General Manager Park Advisory Committee Staff Human Resources Division Jobs What's New Show submenu News Newsletters RIN Activity Guide Social Media We Celebrate Public Info Show submenu Awards Bids & RFPs Budget Publications & Media Show submenu e-Newsletter Interpretive Panels Print Publications Story Maps Videos Mission & Vision History Regional Parks Foundation Show submenu Compass Magazine Memberships & Donations Contact Us Get Help Show submenu New to the Outdoors Police Register/Reserve Report an Incident Social Links Facebook (Opens in new window) Twitter (Opens in new window) Instagram (Opens in new window) YouTube (Opens in new window) LinkedIn (Opens in new window)"
    },
    {
      "url": "https://www.ebcf.org/about-us/staff/",
      "text": "Staff | East Bay Community Foundation About Us Close Menu About Us Embracing our commitment to racial justice, we are becoming more than a traditional philanthropic services organization. Overview Mission History Financial Statements Staff Board of Directors Careers Quick Links Contact Us Conference Center Program Strategies Close Menu Program Strategies Advancing an inclusive, fair, and just East Bay through four core program strategies. Overview Arts and Culture for Social and Racial Justice Capacity Building with a Racial Equity Lens Community Organizing, Power Building, and Movement Building Fostering Inclusive Economic Models Quick Links ASCEND: BLO Belonging In Oakland: A Just City Cultural Fund REAL People’s Fund Oakland Small Business Resiliency Fund Investment Strategy Close Menu Investment Strategy Facilitating an ecosystem of collective progress and collaboration to revolutionize philanthropy and co-create a truly inclusive economy. Overview Mission-Related Investments Program-Related Investments Quick Links Financial Statements Grants & Scholarships Close Menu Grants & Scholarships Bolstering the success and impact of organizations in Alameda and Contra Costa Counties Overview Core Grantees Grant Opportunities Scholarship Opportunities Quick Links Donate to a Fund Giving Circles & Community Funds Donors & Partners Close Menu Donors & Partners Become part of a robust network of active supporters and partners dedicated to advancing social change and making effective impacts. Overview Get Started Partners Advisors Giving Circles & Community Funds Quick Links Donor Resources Donor Portal Make a Donation Campaign for A Just East Bay News & Events Close Menu News & Events The latest updates, impact stories, and community events from EBCF Overview News Stories Events Resources Quick Links Contact Us Conference Center Newsletter Signup Donor Portal Close Search Search for: Search Donate Home / About Us / Staff Staff Our staff are experts in finance, philanthropic giving, community organizing, capacity building, marketing and communications, and nonprofit management. We use these skills to assist our donors, our grantees, and our colleagues in philanthropy. Our staff has helped build East Bay Community Foundation’s reputation as a trusted, influential resource for the community. Interested in applying your skills and experience to our team? Visit our careers page to see open opportunities. Our staff are listed below alphabetically by last name. Use the dropdown menu to filter by department. person Chris Axley (he / him) Managing Director of IT caxley@eastbaycf.org Chris Axley is the Managing Director of IT at East Bay Community Foundation. Chris is an adaptable and strategic-minded leader with a passion for using technology to increase the effectiveness of the community he serves. With more than two decades of experience, Chris has a wealth of knowledge managing cross-functional teams and implementing efficient IT solutions. During his two-decade-long tenure at the Exploratorium, a museum of science, technology, and arts in San Francisco , Chris anticipated the need for a hybrid workforce in advance of the pandemic and smoothly moved the majority of staff to remote work. He also led the team to migrate CRM services from Raisers Edge to Salesforce, led the effort to design and move IT infrastructure to a new museum location, and implemented new transaction systems for admissions, membership, and events. Chris earned a Bachelor of Fine Arts from the San Francisco Art Institute and enjoys spending time with his family, playing disc golf, and gardening. Contact Chris Axley See Bio person Shannon Baker (she / her) Managing Director of Marketing & Communications sbaker@eastbaycf.org Shannon Baker is the Managing Director of Marketing and Communications at the East Bay Community Foundation. With more than 20 years of experience leading fundraising and communications for mission-driven organizations, Shannon is passionate about building community, helping leaders communicate their impact, and connecting donors with values-aligned giving opportunities. Shannon’s deep and diverse experience – including running grassroots campaigns with the State PIRGs, securing major gifts at Stanford Law School and The Nature Conservancy, and leading communications efforts at progressive organizations like Citizen Engagement Lab, New Media Ventures, and Mindful Schools – allows her to design and execute successful programs and campaigns. Shannon has a B.A. from Stanford University and an M.B.A. from University of Michigan, where she focused on strategy and social innovation. When not at work, she enjoys travel and photography, the East Bay’s best eats and treats, and spending time with her husband, stepson, and menagerie of dogs and cats. Contact Shannon Baker See Bio person Zakiyyah Brewer (she / her) Program Manager, ASCEND:BLO zbrewer@eastbaycf.org Zakiyyah Brewer is a Program Associate with our Community Investments and Partnerships department — working on the ASCEND:BLO initiative. This is a crucial role as the initiative has grown immensely over its first year. Working directly with Byron Johnson, Capacity Building Initiative Officer, Zakiyyah will support the ASCEND:BLO Accelerator, Stabilizer, and Network components of the program, ultimately contributing to the support, guidance, and connections of black-led organizations across the Bay Area. A recent graduate of San Francisco State University, before joining EBCF, Zakiyyah was with Five Keys Charter School and Programs in San Francisco, working both in the community and in San Francisco’s county jails. In her spare time, Zakiyyah enjoys going to concerts with friends and spending time with family. Contact Zakiyyah Brewer See Bio person Janelle Cavanagh Chief Philanthropy Officer jcavanagh@eastbaycf.org Janelle Cavanagh is the Chief Philanthropy Officer at East Bay Community Foundation, where she leads a dynamic team in advancing equitable, community-led philanthropy. Janelle is an accomplished philanthropic advisor, nonprofit leader and award-winning fundraiser, whose passion and expertise are in partnering with donors to identify the causes they care about and then recommending aligned experiences. She has a reputation for building enduring relationships grounded in trust and the fulfillment of goals. Before joining EBCF, Janelle served as Chief Philanthropy Officer at Marin Community Foundation, where she oversaw a $4.5 million departmental budget, led a 20-person team, and helped secure a record-breaking $620 million in new assets. She pioneered the foundation’s philanthropic strategy—deepening donor alignment with community needs and catalyzing innovative funding collaborations. Previously, Janelle was Interim Co-CEO and Vice President of Strategic Partnerships at Global Fund for Women, where she helped drive a $71 million fundraising portfolio and launched groundbreaking initiatives like Champions for Equality—combining education, travel, and pooled grantmaking to support feminist movements globally. Janelle is also the co-founder of the UC Berkeley Certificate in Fundraising and Volunteer Management. She began her career as a Peace Corps volunteer in Thailand and holds a Master’s degree in Social Welfare (Management and Planning) from UC Berkeley. Janelle was honored as the 2017 Outstanding Fundraising Professional by the Association of Fundraising Professionals, Golden Gate Chapter. A Bay Area native, Janelle has called Oakland home for nearly 25 years. She enjoys creating art and walking the Oakland Hills with her husband and their two dogs. Contact Janelle Cavanagh See Bio person Alexandria Cooley (she / her) Managing Director of Grants Management acooley@eastbaycf.org (510) 208-0847 With more than 20 years of experience in nonprofit management, grantmaking, program design, and youth development, Alexandria Cooley, is the Managing Director of Donor Services and Grants Management at East Bay Community Foundation. Alexandria previously served as the Chief Program Officer at Fresh Lifelines for Youth (FLY), a Bay Area nonprofit.  She spent 10 years in a variety of roles at AmeriCorps, a federal grantmaking agency, and most recently served as Deputy Regional Administrator of the Southeast Region. During her time at AmeriCorps, she and her team managed grant awards and project development of over $80 million across a six-state region. She was instrumental in supporting the agency through a transformation process that resulted in the development of new positions, a modification in grantmaking processes, and the hiring and training of 20 new staff members within her region. Alexandria also served in leadership roles at youth development and K-12-based institutions. A native of Brooklyn, NY, Alexandria is a first-generation Haitian-Cape Verdean American, 2021 Council on Foundations Career Pathways Fellow, and a 2003 Public Policy and International Affairs (PPIA) fellow. She holds a bachelor’s degree in sociology from Connecticut College, a master’s degree in nonprofit management from The New School for Social Research, and a certificate in federal grants management. Alexandria is an active volunteer and mentor in her community and is committed to supporting the eradication of poverty and the development of equitable structures. She and her husband, John, have two daughters and enjoy time with family, cooking, and kayaking. Contact Alexandria Cooley See Bio person Mimi Dibartolomeo (she / her) Grants & Scholarships Manager mdibartolomeo@eastbaycf.org Mimi is the Grants and Scholarship Manager at the East Bay Community Foundation where she supports the team in implementing best practices and driving process improvements for the department. Before joining EBCF, she worked as the Program Officer and Operations Manager at the Peggy and Jack Baskin Foundation and as a Program Associate at the David and Lucile Packard Foundation. Her past programmatic work included supporting policy and advocacy efforts for California’s early learning and children’s health field, including paid family leave and early childhood nutrition. Before working in philanthropy, Mimi received her BA from the University of California, Davis, and her MA from the University of San Francisco, both in International Studies. During her free time, she loves cooking recipes from her extensive cookbook collection, hiking in the redwoods, and taking her dog to the beach. Contact Mimi Dibartolomeo See Bio person Kathleen  Gan (she/her) Philanthropic Services Advisor kgan@eastbaycf.org Kathleen Gan brings a thoughtful, people-first approach to her role as Philanthropic Services Advisor at East Bay Community Foundation. With experience in communications, events, and relationship management across nonprofit and corporate sectors, she’s drawn to work that blends collaboration, connection, and impact that resonates beyond the day-to-day. Before joining EBCF, Kathleen supported donor communications and led event management at Planned Parenthood Northern California. She’s also worked in operations, marketing, and client experience across the beauty, wellness, and finance sectors—building a skill set rooted in storytelling, coordination, and meaningful partnerships. A Bay Area native and proud first-generation Asian American, Kathleen holds a B.A. in American Studies from the University of California, Berkeley. She lives in Concord with her husband and enjoys hiking with her dogs, visiting theme parks, and traveling to places with great food and better views. Contact Kathleen  Gan See Bio person Maddie Gaw (she / her) Grants Specialist mgaw@eastbaycf.org Maddie is a grants specialist at the East Bay Community Foundation, where she supports the Grants Management & Scholarships department by conducting due diligence for daily grants processing and performing key administrative functions for the organization’s various funds. Prior to joining EBCF, she worked in grants management at the Jewish Community Federation and Endowment Fund, starting as an associate and eventually serving as a Grants Manager, where she managed grantmaking operations for a portfolio of 1,100 donor-advised funds. Before working in philanthropy, Maddie received her BA from Sarah Lawrence College and worked for over five years in the theatre industry, holding positions at local organizations like Berkeley Repertory Theatre, 3Girls Theatre Company, and Playwrights Foundation. She’s also a writer, primarily writing cultural criticism about everything from prize-winning plays to trashy TV. Across Maddie’s work in philanthropy, writing, and theatre, she hopes to use her skills and knowledge to support organizations and movements that are building a just and equitable world. During her free time, she plays with her cats, watches the Golden State Warriors, and obsessively creates new Spotify playlists. Contact Maddie Gaw See Bio person Debrah Giles (she / her) Senior Program Director dgiles@eastbaycf.org Debrah Giles is a philanthropic and non-profit management professional that serves as a Program Director for the East Bay Community Foundation in Oakland, CA. She specializes in supporting initiatives within EBCF that foster education, youth development, and arts and culture.  In her role, she leads the foundation’s program strategy and grantmaking focused on arts and culture for social and racial justice, serves as the Senior Program Officer for the Clorox Company Foundation’s Responsive Grantmaking Program, and continues to lead the work that focuses on boys & men of color. Before joining the East Bay Community Foundation, for nearly 15 years, Debrah worked for Sun Microsystems in their Global Community Development Group (Foundation). At Sun Microsystems, she managed all aspects of their national and regional grant-making programs and develop strategies to improve their grant-making procedures. During her tenure with Sun, she also developed and guided major funding programs, including their international disaster relief program, multi-year educational grants, and global gift matching programs. Debrah received her bachelor’s degree in Business Management from St. Mary’s College. She is a native of Oakland. Contact Debrah Giles See Bio person Marta Grajeda (she / her) Director of Philanthropy mgrajeda@eastbaycf.org (510) 208-0840 As Director of Philanthropy at East Bay Community Foundation (EBCF), Marta leads our planned giving program and supports donors who are committed to strengthening our community and leaving a legacy of love and liberation for the East Bay. She is dedicated to aligning her passion for advancement work with her commitment to addressing systemic inequality. Marta has extensive fundraising experience and successfully raised funds for a $40 million and $24.5 million capital campaign and led a $4 million annual giving program. She also founded two social justice organizations that served Black, Indigenous, and People of Color (BIPOC) students and their families and has more than two decades of experience in local schools. Marta is a Bay Area native and first-generation graduate with a Masters in the Art of Teaching from Brown University and a B.A. in U.S. History from San Francisco State University. Marta enjoys gardening, hiking with her dogs in the Oakland hills, and cooking with her daughter. Contact Marta Grajeda See Bio person Myra Haidari (she / her) Accountant mhaidari@eastbaycf.org (510) 208-0838 Myra Haidari joined the Accounting team at East Bay Community Foundation in May 2022 as an Accountant. After having her children, she decided to embark on a new career that allowed her to maximize her love and talent with numbers. Prior to joining EBCF, Myra worked as a Project Accountant at an environmental firm and an engineering company. Myra was born in Afghanistan and came to the United States as a refugee and has been living in the East Bay ever since.  She spends her personal time volunteering and serving newly arrived refugee communities. In her spare time, Myra likes to spend quality time with her family, read, and explore new restaurants. Myra holds a Bachelor of Science degree in Molecular Biology and a minor in Chemistry from San Jose State University. Contact Myra Haidari See Bio person Julius Hampton (he / him / his) Program Associate, ASCEND:BLO jhampton@eastbaycf.org (510)208-0822 As ASCEND BLO: Program Associate, Julius brings extensive experience as an educator, community leader, and social justice advocate. As Program Associate, Julius supports the department of Community Investments and Partnerships’ Black-led organization initiative, serving as the lead person for the initiative’s network and community engagement activities. He has managed and facilitated programs, brought diverse groups together, and partnered with numerous Bay Area community-based organizations. In all his work, Julius pursues the promotion of justice, healing, love, and liberation in the communities he is a part of and serves. Before joining East Bay Community Foundation (EBCF), Julius worked for thirteen years as a classroom teacher in schools throughout the Bay Area. He has served on the Outdoor Afro Leadership Team in varying capacities and has served as a facilitator for the National Equity Project’s, Black Teacher Project program. Julius holds a Bachelor of Arts from Wesleyan University in Sociology, and a Master of Arts in Education from the University of the Pacific. He lives in Oakland with his husband. In his spare time, he enjoys caring for his plants, going to museums, and connecting with the many beautiful outdoor spaces in the Bay Area, especially the Redwoods with family and friends. Contact Julius Hampton See Bio person Kaya Hersh Chief Financial Officer khersh@eastbaycf.org Rachel “Kaya” Hersh is the Chief Financial Officer at the East Bay Community Foundation. With more than 25 years of experience leading financial and operational strategy, Kaya has managed budgets up to $900M, overseen complex compliance environments, and guided organizations through high-stakes change. She has built ERP systems from the ground up, led remote finance teams across multiple continents, and helped both nonprofits and global corporations navigate some of the toughest economic conditions in modern history. Kaya’s deep and diverse background spans Fortune 100 companies, PE and VC firms, philanthropists, and celebrity spokespeople. She has supported clients such as Medtronic, Microsoft, Meta, Apple, Google, GM, Ford, Honda, Toyota, and the Department of Defense. Her work has driven major transformations across industries ranging from biomanufacturing to consumer goods and automotive. Before the age of 35, she broke barriers as the first female executive at an Indian-owned automotive firm, and she is known for building high-performing teams rooted in both rigor and humanity. Kaya holds an MBA from Indiana University and an AI certification from Johns Hopkins University. Her connection to East Bay Community Foundation’s mission is deeply personal, driven by a commitment to community and to building the kind of institutional resources she needed growing up. Outside of work, she enjoys reading, music, travel, and spending time with her dog, family, and friends. Contact Kaya Hersh See Bio person Brandi Howard (she / her) President & CEO brandi@eastbaycf.org Brandi Howard is the president and CEO of East Bay Community Foundation (EBCF), one of the oldest community foundations in the country. Named the “boldest community foundation” in 2019 by Inside Philanthropy , EBCF is known for its work advancing inclusion, fairness, and racial justice in Alameda and Contra Costa counties. Howard is a collaborative and compassionate leader who brings deep experience as an equity and justice strategist rooted in community to the Foundation’s vision and framework for A Just East Bay. Before EBCF, Howard led strategic planning and the development of the equity learning infrastructure as chief of staff and interim vice president of programs at San Francisco Foundation. Her leadership was critical in advancing the equity-centered grantmaking policy and systems change in the region. When she began there, she worked with the The Daniel E. Koshland Civic Unity Program, a community leadership program that works with grassroots risk-takers and makes a five-year investment in their community. Prior to that, Howard worked for the New York City Department of Health and Mental Hygiene where she oversaw two city-wide initiatives to reduce infant mortality and chronic disease and led the development of a division-wide framework to streamline implementation, staffing, and quality improvement processes for Neighborhood Health Action Centers. Howard is a third-generation Oaklander who grew up in multicultural communities throughout the city, in a family with a heritage of Pan-Africanism and a global worldview. Conscious of the complexities of race, racism, and racial injustice, Howard began her career recognizing the linkage of all oppressions in the shared fight for liberation. She was drawn to advocacy and health equity work during her nineteen years as a doula working with Black and Latinx women. Decades-stagnant health outcomes for Black and Latinx mothers led her to speak out for systems change and her career shifted. As maternal child health subcommittee chair for the Alameda County Public Health Commission, she served as a liaison between public and nonprofit agencies, community members and the county board of supervisors to provide recommendations to support optimal maternal and child health in Alameda County. Howard also worked for First 5 Alameda County, and has advised a number of nonprofit organizations on strategy, sustainability, and equity as a consultant. Howard is a member of Chief, a network of senior women leaders built to strengthen their leadership journey, cross-pollinate ideas across industries, and affect change from the top-down. Howard is a lecturer for equity in practice at the School of Social Welfare at the University of California, Berkeley, where she is also an advisory committee member. Howard is principal consultant at Beyond the Curve, a consulting firm providing organizational development, business strategy, and talent and crisis management. Howard started her career transition journey at Merritt College after ten years in the workforce as a mother of three children. She transferred to the University of California, Berkeley where she earned a Bachelor of Arts in African American Studies and a Master of Social Work. Now a mother of four, Howard is constantly inspired by her children’s creativity and relentless energy. Her children are her motivation to advance racial equity, and transform political, social, and economic outcomes for all who call the East Bay home. Contact Brandi Howard See Bio person Kisha Jackson Executive Administrator kjackson@eastbaycf.org Kisha Jackson is a dedicated leader and connector with over two decades of experience supporting mission-driven organizations in the nonprofit and government sectors. She currently serves as Executive Administrator to the President and CEO of the East Bay Community Foundation, where she helps drive the organization’s commitment to racial equity and community transformation. Previously, Kisha served as District Scheduler and Executive Assistant to Congresswoman Lateefah Simon in California’s 12th Congressional District, where she supported legislative priorities and community engagement efforts during the office’s foundational years. Known for her attention to detail, creative problem-solving, and deep roots in the East Bay, Kisha brings both heart and strategy to every role she takes on. Outside of work, she is passionate about building community, mentoring emerging leaders, and creating spaces where people feel seen and supported. Contact Kisha Jackson See Bio person Germán  Jiménez (he/his) Philanthropic Specialist philanthropy@eastbaycf.org Germán Jiménez is a first-generation Mexican American whose experiences growing up in the inner city shaped his passion for social impact and philanthropy. Witnessing the challenges that underserved communities face firsthand, he was driven to work for organizations that create meaningful change. He earned his bachelor’s degree in Business Administration from California State University, Dominguez Hills, where he developed a strong foundation in organizational management and strategic planning. After moving to Oakland in 2021 from Los Angeles, he began his journey in the nonprofit sector, realizing the importance of community-driven initiatives. Now, as the Philanthropic Specialist at East Bay Community Foundation, Germán is excited to contribute to the foundation’s mission of advancing racial equity and economic opportunity. With over four years of fundraising experience, he brings expertise in donor stewardship, event coordination, CRM database management, and cross-departmental collaboration. Germán values building relationships across diverse communities and ensuring inclusive philanthropic efforts. Outside of work, he enjoys playing golf at Metropolitan and Monarch Bay Golf Courses, as well as exploring the Bay Area’s vibrant outdoor spaces. He’s eager to continue immersing himself in Oakland’s culture and connecting with his community. Whether on the golf course or walking around Lake Merritt with his dog, Cashew, Germán is always looking for ways to engage with and uplift those around him. Contact Germán  Jiménez See Bio person Theresa Johnson (she / her) Senior Accountant: Transactions, Systems, and General Ledger tjohnson@eastbaycf.org Theresa Johnson is a professional accountant whose past experience is with startup and growth phase companies; a background that has provided her with valuable insight into many areas of finance, accounting and system implementation, as well as developed her ability to successfully work in a dynamic, fast paced environment. She holds a B.A degree in Sociology and has completed extensive coursework in accounting. Theresa was born in Oakland and was raised in Ukiah. After living in a handful of other Northern California cities she eventually returned to live in the East Bay in 2012. In her free time, she enjoys hiking in the Walnut Creek Lime Ridge Open Space and spending time with her husband and five children. Contact Theresa Johnson See Bio person Tyson Jue (he/him) Chief Operating Officer tjue@eastbaycf.org Tyson is a public sector and nonprofit leader with nearly 20 years of experience working to build stronger, more equitable communities. His career has centered on creating and managing programs, teams, and systems that improve outcomes in areas like early childhood development, affordable housing, and community development. Before joining EBCF, Tyson served as Deputy Director of Administration at Chinatown Community Development Center in San Francisco, where he led internal operations—spanning facilities, IT, and HR—and supported board governance. Prior to that, he also held executive roles at First 5 Alameda County, First 5 Santa Clara County, and the San Francisco Office of Early Care and Education, helping guide multimillion-dollar agencies focused on children and families. A highlight of his work was leading an initiative to install water bottle-filling stations in Santa Clara County schools—an effort that gained national recognition from former First Lady Michelle Obama and the Partnership for a Healthier America. Throughout his career, Tyson has also advised elected officials, managed local campaigns, and led strategies that helped engage and mobilize communities. He brings a collaborative, community-first approach to everything he does—grounded in data, driven by values, and focused on systems that work for people. Tyson holds graduate degrees in public policy and social sciences from the University of Chicago, and a bachelor’s degree in history from UC Davis. Outside of work, he enjoys hiking, traveling, and running. Contact Tyson Jue See Bio person Emily Kokernak (she/her) Senior Philanthropic Advisor MBA ekokernak@eastbaycf.org Emily Kokernak, Senior Philanthropic Advisor, is dedicated to connecting donors with opportunities to make a lasting impact in their communities. With over 20 years of fundraising experience, she helps individuals invest in the causes they care about. Most recently at Planned Parenthood Northern California, Emily built strong relationships with donors committed to reproductive freedom and advancing health equity. She has a strong track record in major gifts, capital campaigns, corporate sponsorships, and gala events. Emily’s well-rounded career in Development includes significant roles at esteemed organizations such as Planned Parenthood Federation, Harvard University, Boston Medical Center, and the Oakland Museum of California. Emily earned her bachelor’s degree from Wellesley College and MBA from Simmons University. She and her family relocated to Oakland from New York City in 2018 and they spend their time exploring the beautiful spaces of the East Bay and beyond. Contact Emily Kokernak See Bio person Autumn McDonald (she/her) Vice President of Community Investments & Partnerships amcdonald@eastbaycf.org Autumn McDonald is the Vice President of Community Investments & Partnerships, leading EBCF’s strategic grantmaking, regional collaborations, and team of program officers to deliver on our mission across the East Bay. Autumn has more than two decades of experience working with foundations, nonprofit organizations, and government agencies at the intersection of strategy, advocacy, civic innovation, and social impact. Through her work with FSG, a social impact consulting firm, Autumn built expertise in providing strategic guidance to large, small, community, and family foundations. Autumn also served the late San Francisco Mayor, Ed Lee, shaping policies and public-private initiatives to improve economic opportunity for Bay Area families. Before joining EBCF, she was a member of the leadership team at New America where she served as a senior fellow and head of New America CA. At New America, Autumn’s work focused on issues of economic equity, community engagement, resident voice, policy influence, and narrative change. Her writing has been published by numerous media outlets, including Slate , The Washington Post , Stanford Social Innovation Review , Project Syndicate , Pacific Standard , CalMatters , and Britannica Parents . She also serves on the board of KQED, Women’s Foundation of California, and as Chair of the board for Lincoln Families. Autumn has a bachelor’s degree from Stanford University, a master’s from the Harvard Graduate School of Education, and a master’s from the Northwestern University School of Education and Social Policy. She, her husband, and their three children live in Oakland. Her parents moved to Oakland from the east coast right before the pandemic, happily making her East Bay kin now intergenerational! Contact Autumn McDonald See Bio person Jeffrey Moy (he/him) Grants and Data Associate jmoy@eastbaycf.org Jeffrey Moy is the Grants and Data Associate at the East Bay Community Foundation. He brings a wide range of nonprofit experience with a focus on equity and leadership development, including roles at the Center for Social Sector Leadership at UC Berkeley’s Haas School of Business, the National Collaborative for Health Equity, and the Institute of International Education. Throughout his career, he has also been actively involved in the Asian American and Pacific Islander community, including current service as a board member of the National Japanese American Memorial Foundation. Originally from Annapolis, MD, Jeffrey received his Master’s in Public Administration from Baruch College through the National Urban Fellows program and his Bachelor degree from the University of Southern California. He currently resides in San Francisco with his spouse and their daughter. Contact Jeffrey Moy See Bio person Ian Smith (he / him) Philanthropic Operations Manager philanthropy@eastbaycf.org Ian began his professional journey at Wells Fargo in Commercial Mortgage Servicing. He started out in the mail room and ascended to lead the document management team for the West Coast CMBS group. With more than 15 years of extensive database management expertise, Ian’s career spans various sectors, including land trust management and affordable housing. Throughout his career, Ian successfully spearheaded 8 database conversions, specializing in enhancing both operational efficiency and donor engagement. Prior to joining EBCF, Ian served as the Development Manager at East Bay Asian Local Development Corporation (EBALDC), focusing on elevating individual donor stewardship and cultivation strategies. Ian’s unique journey underscores his commitment to bridging corporate acumen with nonprofit values. As EBCF’s Development Manager, Ian is excited to partner with a diverse ecosystem of community leaders and that his work will have impact across the East Bay. During his free time, Ian enjoys hiking East Bay trails, trying out new restaurants in Oakland, and watching Warriors games. Contact Ian Smith See Bio person Natalie Torres-Rosas (she / her) Grants Manager grantsmanagement@eastbaycf.org Natalie Torres-Rosas joined the Donor Services and Administrative Support team at EBCF as a Donor Services Associate in June 2019, and now serves as a Grants Manager. In her new role, she works alongside Grants & Scholarships Manager, Laura Choe, and Grants & Scholarships Specialist, Clint Hayden, in administering daily grants processing, and supporting scholarships administration and processing – as EBCF increases our involvement in grant-making and scholarships. She holds Bachelor of Arts degrees in Criminal Justice and Sociology. She hopes to continue helping EBCF with our mission, given her educational and personal background, and strong interest in improving the criminal justice and social systems. Before joining EBCF, Natalie was with Development at UC San Francisco and UC Berkeley. She also volunteered at different organizations in San Francisco, both in the community and in San Francisco’s and San Mateo’s county jails. During her free time, she enjoys going to the dog park with her two pups, reading mystery and crime, listening to vinyls with her partner, and exploring Oakland. You can most likely find her at a taco stand! Contact Natalie Torres-Rosas See Bio person Carlos Velasquez (he / him / his) Managing Director of Operations & Facilities cvelasquez@eastbaycf.org (510) 208-0813 As the Managing Director, Operations & Facilities, Carlos Velasquez oversees the Operations Department which is responsible for day-to-day management of IT and network operations, the headquarters building, and the Foundation’s conference Center. He also serves as the liaison to the Foundation’s outside professional HR administrative services group. Carlos has more than 30 years of technical and operations experience. Prior to joining to the Foundation in 2009, Carlos worked in various managerial capacities at the Educational Testing Service, Snap Technologies/Embark, The Princeton Review, and the California Nurses Association. Carlos holds a B.A. in Humanities from U.C. Berkeley. Contact Carlos Velasquez See Bio person Sabrina Wu (she / her) Senior Program Officer swu@eastbaycf.org Sabrina Wu is a Senior Program Officer and leads EBCF’s work on building a just and inclusive economy. In this capacity, she supports increasing access to fair capital for BIPOC entrepreneurs, grassroots equitable economic development, and moving grant and impact investing resources in more participatory and collaborative ways. Sabrina is a collaborative leader with over twenty years of experience in non-profit leadership and coalition building. Prior to joining EBCF, she led grassroots non-profits and community collaboratives to advance racial and economic equity and build local sustainable food systems and ran community and youth programs. She serves on the Board of Directors of Just Futures Impact and was previously a Just Economy Institute Fellow and co-chair of the Bay Area Asset Funders Network Steering Committee. Sabrina holds a Bachelors degree from Barnard College of Columbia University and a Masters degree in Agriculture, Food and Environmental Policy from Tufts University. Contact Sabrina Wu See Bio person Supriya Yelimeli (she/her) Communications Officer syelimeli@eastbaycf.org Supriya Yelimeli is the Communications Officer at East Bay Community Foundation. She comes from a background in journalism where she spent a decade in newsrooms across California, covering breaking news, activism, and local stories. Most recently, she reported on housing and homelessness in Berkeley, where she led coverage of the historic People’s Park and its closure by UC Berkeley. Supriya’s upbringing in Fremont has shaped her perspective on the Bay Area’s rich cultural diversity, as well as its deep economic inequalities. She is passionate about creating lasting pathways for people of color in journalism and media through mentorship, and participating in mutual aid and community-led solutions for a happier, healthier Bay Area. She studied Communication at UC Santa Barbara, and believes that clear-eyed, compelling storytelling can empower local communities. She loves neighborhood cats, the Bay Area’s natural beauty, and yummy meals shared with loved ones. Contact Supriya Yelimeli See Bio person Gennie Zaragoza (she / her) Controller finance@eastbaycf.org Genevieve (Gennie) Zaragoza, CPA (inactive) currently serves as the Controller of East Bay Community Foundation. Her career of 30 plus years has been entirely devoted to accounting in the nonprofit sector, including more than 10 years as the Managing Partner of the Oakland based CPA firm Ghaffari Zaragoza LLP. She has experience with a wide variety of organizations using her broad in-depth experience to help organizations achieve financial clarity, efficiency and compliance. Most recently she served as the Controller for the Global Fund for Women where she implemented a cloud based paperless accounting system. She graduated from Mills College with honors earning a B.A. in Economics. Gennie was born in Pennsylvania, she moved to Berkeley as a one year old and has been an East Bay resident ever since. In her free time, she enjoys decluttering and organizing the home she shares with her husband and two children and exploring all the vegan food options the Bay Area has to offer. Contact Gennie Zaragoza See Bio Get Involved Today Meet \nOur Team Become \nA Partner Subscribe Make \nA Donation Subscribe to our newsletter About Us Initiatives B.L.O. Directory Funds Financials Careers News & Events Resource Library Conference Center Media Kit Contact Us Subscribe For Grantseekers For Advisors For Partners Privacy Policy Terms of Service 200 Frank H. Ogawa Plaza Oakland, CA 94612 (510) 836-3223 info@eastbaycf.org East Bay Community Foundation © 2025 maintained by StateWP Subscribe to Our Newsletter Δ E-mail Address Submit We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of all the cookies. Close GDPR Cookie Banner Accept All Reject All Close GDPR Cookie Banner Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings x Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.ebparks.org/reservations/event-venues/brazilian-room",
      "text": "Brazilian Room | East Bay Parks Skip to main content Show Mobile Menu Select a Park or Trail Select a Park or Trail Alameda Creek Regional Trail Anthony Chabot Antioch/Oakley Ardenwood Bay Point Big Break Bishop Ranch Black Diamond Mines Briones Briones to Las Trampas Regional Trail Briones to Mt. Diablo Regional Trail Brooks Island Browns Island Brushy Peak California Riding and Hiking Trail Carquinez Strait Castle Rock Claremont Canyon Contra Costa Canal Regional Trail Contra Loma Coyote Hills Crockett Hills Crown Beach Cull Canyon Deer Valley Del Valle Delta de Anza Regional Trail Diablo Foothills Don Castro Dry Creek Pioneer Dublin Hills Dumbarton Quarry Campground East Bay Skyline National Recreation Trail Five Canyons Garin Hayward Huckleberry Iron Horse Regional Trail Juan Bautista de Anza National Historic Trail Judge John Sutter Kennedy Grove Lafayette-Moraga Regional Trail Lake Chabot Las Trampas to Mt. Diablo Regional Trail Las Trampas Leona Canyon Little Hills Martin Luther King Jr. Marsh Creek Regional Trail McLaughlin Eastshore Miller/Knox Mission Peak Morgan Territory Ohlone Wilderness Oyster Bay Pleasanton Ridge Point Isabel Point Pinole Quarry Lakes Radke Martinez Reinhardt Redwood Roberts Round Valley San Francisco Bay Trail San Pablo Bay Regional Shoreline Trail Shadow Cliffs Sibley Sobrante Ridge Sunol Sycamore Valley Temescal Thurgood Marshall Tilden Tilden Botanic Garden Tilden Nature Area Vargas Plateau Vasco Caves Waterbird Wildcat Canyon Leave this field blank Search Terms Leave this field blank Visit a Park Parks Visitor Centers Trails Trail Courtesy Maps Alerts & Closures Rules & Regulations New Visitors Visitor Safety ADA Accessibility Things to Do Calendar Activities and Events Public Meetings Community Meetings Recreation Archery Biking Birding Boating Camping Equestrian Resources Fishing Geocaching Golfing Hiking Merry-Go-Round Model Boats, Planes & Trains Picnics Swimming Programs Community Outreach Day Camps Educator Resources Field Trips Healthy Parks Healthy People Memorial Bench Program Naturalist Education Outdoor Recreation Registration Youth and Teens Reservations Activity Registration Camping Event Venues Picnics Swimming Permits Get Involved Become a Member Donate Volunteer Our Work Park Projects Park Improvements Regional Trails Future Planning Resource Management Natural Resources Biodiversity Climate Adaptation Grazing Pest Management Water Quality Wildfire Resilience Government Affairs Public Safety Police Department Fire Department Lifeguard About Us Board & Staff Board of Directors General Manager Park Advisory Committee Staff Human Resources Division Jobs What's New News Newsletter RIN Activity Guide Social Media We Celebrate Public Info Awards Bids & RFPs Budget Publications & Media e-Newsletter Interpretive Panels Print Publications Story Maps Videos Mission & Vision History Regional Parks Foundation Compass Magazine Memberships & Donations Contact Us Get Help New to the Outdoors Police Register/Reserve Report an Incident Brazilian Room Home  Reservations  Event Venues  Brazilian Room Back to top Brazilian Room Open House Due to the fully booked event schedule, tours of the Brazilian Room will not be available outside of Open House. For a full schedule of Open House dates and attending Approved Caterers please see the Brazilian Room Open House Schedule linked below. Brazilian Room Open House Schedule Brazilian Room at Tilden Regional Park Share on X Share on Facebook Copy Link to Clipboard Copy to Clipboard Hours Office Hours: Monday - Friday, 10 a.m. - 3 p.m. Reservable Hours: Monday/Wednesday/Thursday/Friday, 8 a.m. - midnight Saturday & Sunday, 9 a.m. - midnight Address Wildcat Canyon Road at Shasta Road, Berkeley, CA 94708 Phone (510) 544-3164 Download Map opens in new tab Rental Rates (Opens in new window) Photo Gallery Image Image Image Image Image Image Image Image About the Facility The Brazilian Room derives its name from its rich hardwood paneling (Jacaranda, Imbuya, Brazilian Chestnut and Mahogany) that was once part of the Brazilian Pavilion at the 1939 Golden Gate International Exhibition on Treasure Island in the San Francisco Bay that showcased the commerce and culture of the country of Brazil. When the exposition ended, the Brazil Building was presented to the newly-formed East Bay Regional Park District as a gift of friendship from the Brazilian government. The exterior of the original building was perishable so the Works Progress Administration (WPA) built a new, English-style permanent exterior in Tilden Regional Park, one of the three inaugural regional parks, combining local rock and timber with the beautiful hardwood wall paneling from Brazil. The building was dedicated in 1941 and remodeled extensively in 1965. The Brazilian Room is currently a popular site for weddings, parties and business retreats. Read more about the above content Facility Information Seated Capacity: 150 Standing Capacity: 225 Indoor Dimensions: 32’x54’ Patio Dimensions: 40’x42’ with a 12’x18’ extension Parking: 34 spaces in lot, 36+ additional nearby street spaces ADA Accessible Reservation: more info Included Amenities Tables: 60” Round (16), 48” Round (1), 36” Round (5), 6’x30” Rectangular (24), 8’x30” Rectangular (2), 4’ Square (1) Chairs: Fruitwood Wood Folding Chairs w/ Ivory Pad (150), High Chairs (4), Booster Seats (2) Patio Umbrellas (Taupe) w/ Bases (4) Audio Visual System (indoor): Built-In Projector/Screen, Speaker System, Wired Microphone, Mic Stand, Podium Upright Yamaha Piano (for indoor use) Free Guest WiFi Other Features Panoramic Hillside and Forest Views Large Flagstone Patio with Landscaped Gardens Hardwood Floors Dimmable Ceiling Lights Full Industrial Kitchen Ice Machine Heat and Air Conditioning Gas Fireplace Dressing Room To Reach the Brazilian Room Download: Brazillian Room Directions Map | Brazilian Room Parking Map The Brazilian Room (Building) is located in Tilden Regional Park , Berkeley, on Wildcat Canyon at the intersection of Shasta Road . By Car From Highway 80: Take University Avenue exit in Berkeley. Follow University up (east) to Oxford. Left on Oxford to Rose. Right on Rose to Spruce. Left on Spruce on the top of the hill, cross the intersection, and Spruce becomes Wildcat Canyon Road. Continue for two miles and the Brazilian Room will be on your left. From Highway 24: At east end of Caldecott Tunnel, exit Fish Ranch Road up to Grizzly Peak Boulevard. Turn right and continue to Golf Course Road. Right again and continue to stop sign. Right on Shasta Road. Shasta dead-ends into Brazilian Room parking lot. The Brazilian Room has been voted Best Place for a Wedding in the East Bay by East Bay Times' readers three years in a row, and Best Wedding Venue two years in a row by East Bay Express readers. Image Image Image Image Image Image Open Houses and Scheduling Tours To view the Brazilian Room, please join us at open houses, the first and third Tuesdays of each month. Please see the full schedule of Brazilian Room Open Houses and Seasonal Celebrations linked below. Brazilian Room Open House Schedule To schedule a tour of the Beach House or Fern Cottage, please contact the Rental Facilities office at (510) 544-3164. We are not currently offering tours for the Shoreline Center due to closure, please check back. Rental Facilities Resources Learn more about hosting your event at our beautiful and unique rental facilities. Image Availability and Reservations Image Caterers and Vendors Image Rental Facilities Documents Image Rental Facilities FAQs Contact Us For Availability, Reservations, and Insurance Info: Reservations Department Phone: 1-888-EBPARKS ( 888-327-2757 ), option 2 Office Hours : Mon-Fri, 9am-4pm For Appointments and General Facility Info: Rental Facilities Operations Phone : (510) 544-3164 or email below Office Hours : Mon-Fri, 10am-3pm Check availability online, 24 hours a day: Availability Calendar Send An Inquiry Check out our other Event Venues! Read More Image Temescal Beach House A charming lakeside venue with a large courtyard patio and waterfront views located in the Temescal Regional Recreation Area Read More Image Fern Cottage An intimate venue with a private backyard garden and forest views located in the Kennedy Grove Regional Recreation Area Read More Image Shoreline Center - Temporarily Closed A mid-Century waterfront venue with views of the San Leandro Bay and East Bay Hills located at the Martin Luther King Jr. Regional Shoreline. 2950 Peralta Oaks Court, Oakland, CA 94605 1-888-EBPARKS, 1-888-327-2757 (Deaf or Hearing Impaired, use the TRS at 711) Footer menu First Column GENERAL INFO About Us Awards Bids & RFPs Board of Directors Budget Jobs News Park Advisory Committee Police Regional Parks Foundation Column 2 CONNECT Calendar Contact Us Donate Report an Incident Visitor Feedback Volunteer Column 3 RESOURCES Accessibility Alerts & Closures All Maps Calendar Park Rules & Regulations Terms of Use & Privacy Visitor Safety We Celebrate Stay Connected Facebook (Opens in new window) Twitter (Opens in new window) Instagram (Opens in new window) YouTube (Opens in new window) LinkedIn (Opens in new window) © 2025 East Bay Regional Park District. All Rights Reserved. Select a Park or Trail Select a Park or Trail Alameda Creek Regional Trail Anthony Chabot Antioch/Oakley Ardenwood Bay Point Big Break Bishop Ranch Black Diamond Mines Briones Briones to Las Trampas Regional Trail Briones to Mt. Diablo Regional Trail Brooks Island Browns Island Brushy Peak California Riding and Hiking Trail Carquinez Strait Castle Rock Claremont Canyon Contra Costa Canal Regional Trail Contra Loma Coyote Hills Crockett Hills Crown Beach Cull Canyon Deer Valley Del Valle Delta de Anza Regional Trail Diablo Foothills Don Castro Dry Creek Pioneer Dublin Hills Dumbarton Quarry Campground East Bay Skyline National Recreation Trail Five Canyons Garin Hayward Huckleberry Iron Horse Regional Trail Juan Bautista de Anza National Historic Trail Judge John Sutter Kennedy Grove Lafayette-Moraga Regional Trail Lake Chabot Las Trampas to Mt. Diablo Regional Trail Las Trampas Leona Canyon Little Hills Martin Luther King Jr. Marsh Creek Regional Trail McLaughlin Eastshore Miller/Knox Mission Peak Morgan Territory Ohlone Wilderness Oyster Bay Pleasanton Ridge Point Isabel Point Pinole Quarry Lakes Radke Martinez Reinhardt Redwood Roberts Round Valley San Francisco Bay Trail San Pablo Bay Regional Shoreline Trail Shadow Cliffs Sibley Sobrante Ridge Sunol Sycamore Valley Temescal Thurgood Marshall Tilden Tilden Botanic Garden Tilden Nature Area Vargas Plateau Vasco Caves Waterbird Wildcat Canyon Leave this field blank Search Terms Leave this field blank Mobile Menu Visit A Park Show submenu Parks Show submenu Visitor Centers Trails Show submenu Trail Courtesy Maps Alerts & Closures Rules & Regulations New Visitors Visitor Safety ADA Accessibility Things to Do Show submenu Calendar Show submenu Activities and Events Public Meetings Community Meetings Recreation Show submenu Archery Biking Birding Boating Camping Equestrian Resources Fishing Geocaching Golfing Hiking Merry-Go-Round Model Boats, Planes & Trains Picnics Swimming Programs Show submenu Community Outreach Day Camps Educator Resources Field Trips Healthy Parks Healthy People Memorial Bench Program Naturalist Education Outdoor Recreation Registration Youth & Teens Reservations Show submenu Activity Registration Camping Event Venues Picnics Swimming Permits Get Involved Show submenu Become a Member Donate Volunteer Our Work Show submenu Park Projects Show submenu Park Improvements Regional Trails Future Planning Resource Management Natural Resources Show submenu Biodiversity Climate Adaptation Grazing Pest Management Water Quality Wildfire Resilience Government Affairs Public Safety Show submenu Police Department Fire Department Lifeguard About Us Show submenu Board & Staff Show submenu Board of Directors General Manager Park Advisory Committee Staff Human Resources Division Jobs What's New Show submenu News Newsletters RIN Activity Guide Social Media We Celebrate Public Info Show submenu Awards Bids & RFPs Budget Publications & Media Show submenu e-Newsletter Interpretive Panels Print Publications Story Maps Videos Mission & Vision History Regional Parks Foundation Show submenu Compass Magazine Memberships & Donations Contact Us Get Help Show submenu New to the Outdoors Police Register/Reserve Report an Incident Social Links Facebook (Opens in new window) Twitter (Opens in new window) Instagram (Opens in new window) YouTube (Opens in new window) LinkedIn (Opens in new window)"
    },
    {
      "url": "https://eastbayforeveryone.org/",
      "text": "East Bay for Everyone | Twitter Email Facebook About Who We Are Our Platform Code of Conduct Contact Our Bylaws Join EB4E Donate News Calendar Social Housing Resources Housing Element Letters Books/TV about Housing Select Page We’re moving the East Bay forward, together East Bay for Everyone (formerly East Bay Forward) is a network of people fighting for the future of housing, transit, tenant rights, and long-term planning in the East Bay. We say yes to more neighbors, more housing, more renter protections, better public transit, and better infrastructure in our backyards. Flex your civic muscle We’re active and everywhere. Find us at community meetings, Zoning Boards, Planning Commissions, and your local City Council meetings. Read up on what we’re up to these days. Regular meetups We host monthly meetings every second Wednesday in Oakland and occasionally a weekend meeting every third Sunday in Berkeley. If you’re into procedure and direction-setting, join us. We also try to have fun events like happy hours or karaoke nights every once in a while. Event details are in the calendar. Join EB4E Donate Subscribe to the Newsletter! * indicates required Email Address * First Name Last Name Zipcode View previous campaigns. Oakland General Plan: Good, Bad and Ugly by Derek Sagehorn | August 20, 2025 | Uncategorized | 0 Comments Oakland is updating its general plan over the next several years with a goal of adopting a final General Plan in Winter 2027. The General Plan is a comprehensive document that controls land use but also open space, transportation and infrastructure in order to guide... Read More Under One Roof: EB4E Gala 11/15 at New Parkway by Derek Sagehorn | October 7, 2024 | Uncategorized | 0 Comments Under One Roof, the EB4E gala, is happening Friday, November 15, 2024 from 6:00pm to 9:00pm. We will be at the New Parkway Theater (474 24th St, Oakland, CA 94612). Come celebrate our wins from the past few years and take a well-deserved break after the 2024 election.... Read More EB4E Fall 2024 Endorsements by Derek Sagehorn | September 26, 2024 | Uncategorized | 0 Comments East Bay for Everyone (EB4E) is a membership organization dedicated to building just cities through land use, housing and mobility policies. EB4E is proud to support the following candidates and measures for the November 5, 2024 election.     Oakland Mayoral... Read More Berkeley District 4 City Council Election Endorsement by kevin | May 9, 2024 | Actions | 0 Comments East Bay for Everyone (EB4E) is a membership organization in Alameda and Contra Costa counties devoted to making our cities more just and inclusive through land use, housing and mobility reform. Berkeley City Council District 4 (D4) is the heart of Berkeley. It’s... Read More Oakland just voted to upzone Rockridge and expand housing opportunity citywide by kevin | October 4, 2023 | Uncategorized | 0 Comments East Bay for Everyone congratulates the City of Oakland for passing a package of zoning amendments that will meaningfully expand housing opportunities across the city. These policy changes include: 1) greater height limits along corridors like College Avenue and... Read More EB4E Audits City Housing Elements by kevin | January 2, 2023 | Uncategorized | 0 Comments Every city in Alameda and Contra Costa County has been updating their Housing Element, a state-mandated map of where and how much housing can be built in each jurisdiction. Many cities have been submitting plans that are unrealistic or could do more to increase... Read More Looking Back on 2020-2022 by Derek Sagehorn | December 29, 2022 | News | 0 Comments Back in the fall of 2019, East Bay for Everyone (EB4E) underwent a strategic planning process to focus on what members wanted to accomplish over the next two years. Back in our old clubhouse at 2044 Franklin (RIP) and online we debated where to focus our time and energy as a volunteer membership organization. Read More Oakland Mayor and Berkeley D8 Endorsements by Derek Sagehorn | October 25, 2022 | News | 1 Comment East Bay for Everyone members have voted to make the following additional endorsements: Oakland Mayor: Vote for Loren Taylor and Sheng Thao in either order Please do not vote for Ignacio De La Fuente anywhere in your ranked choices Berkeley City Council District 8: ... Read More November 2022 Endorsements by Derek Sagehorn | October 19, 2022 | Uncategorized | 0 Comments Part of bringing about abundant and affordable housing and transit for everyone is electing good officials who will make pro-housing votes and make sure city staff follow pro-housing values. East Bay for Everyone has made the following endorsements in East Bay... Read More Oakland Housing Element Rezonings: The Good, the Bad, and the Ugly by Derek Sagehorn | October 18, 2022 | Uncategorized | 0 Comments Oakland has a new proposal to rezone lots of land in the city for additional density. We took a close look at these proposals recently and wanted to highlight where Oakland is on the right track and where it is doubling down on ugly patterns of exclusion. These... Read More What’s going on: We are most active in the cities of Alameda, Oakland, and Berkeley, and more and more in the Tri-Valley, but we’re working to build a base of pro-housing advocates who believe that density is good, displacement needs to be stopped, housing is a home, and that we need more of it – especially in the long run. As more people join from each city, we can expand our work. Read our full platform. Join EB4E Header p hoto by Jef Poskanzer Code of Conduct Facebook Twitter RSS"
    },
    {
      "url": "https://www.eastbayspecialevents.com/contact-us",
      "text": "Contact Us | eastbayevents top of page Country Club at East Bay Welcome Our Venue Event Packages Dinner Banquets and Parties Dinner Entree Selections Luncheons Wedding Packages All Inclusive Wedding Package A La Carte Wedding Package Golf Directions Contact Us More Use tab to navigate through the menu items. East Bay Special Events 702 Country Club Drive Largo FL  33771 727-584-7111 ​ Give us a call, or submit any questions  you may have using the form, and a member of our staff will contact you. ​ We look forward to working with you and making your event memorable! ​ ​ © 2017 by Country Club at East Bay Terms and Conditions 702 Country Club Dr | Largo FL | 727-584-7111 ​ Copyright © 2017 - Country Club at East Bay - All rights reserved bottom of page"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "text": "Contact East Bay Distributors | Get in Touch Facebook-f X-twitter Instagram Youtube Linkedin-in $ 0.00 0 Cart Shop Inventory Management Custom Manufacturing Resources About Us FAQs Contact Us Contact Us Home Contact Us Contact East Bay Get in Touch Have a question or need assistance? Fill out the form below, and our team will get back to you as soon as possible. We’re here to help! Contact Name Email Address Phone Number Message Send 401-254-2960 401-254-2962 sales@eastbaydist.com 400 Franklin Street Bristol, RI 02809 8a-4p M-F Explore Our Collection and Find The Best products We’ve built our business by providing fast, honest, and quality service backed by an extensive line of products at great prices. Shop Now Why choose an ISO company? |Prototype Development | Sub-Assembly | Inventory Management | Custom Machined Plastics |Inline Static Mixers Call Us 401.254.2960 Email Us info@eastbaydist.com Our Location 400 Franklin St, Bristol, RI 02809, USA East Bay © 2025 East Bay Distributors. All Rights Reserved Search Menu Categories Accessories Fashion Toys Shop Blog Portfolio Wishlist Compare Login / Register Shopping cart Close Sign in Close Username or email address * Password * Log in Lost your password? Remember me No account yet? Create an Account Shop 0 Wishlist 0 items Cart My account"
    },
    {
      "url": "https://www.mytrilogylife.com/vineyards/events-weddings/",
      "text": "Brentwood Wedding Reception, East Bay Weddings | Club Los Meganos MyTrilogyLife Trilogy at The Vineyards Weddings Home Live Here Dining Spa Weddings Events & Banquets National Programming Home Live Here Dining Spa Weddings Events & Banquets National Programming menu Gallery Venues Catering Location Contact Live Here Say “Yes” to Savings! Book Your 2025 Wedding Now. Book your 2025 wedding now to enjoy $600 off our ceremony package! Call 925.809.7188 to learn more. Good for new bookings only, through December 1st, 2025. Events & Weddings at Club Los Meganos Club Los Meganos is an ideal wedding ceremony and reception venue for anyone in the East Bay area. We are perfectly suited to accommodate magnificent large celebrations as well as unforgettable intimate events with our variety of indoor and outdoor spaces to create the wedding of your dreams. Our award-winning Club Los Meganos perfectly melds striking views, a convenient location, flexibly-priced menu options, and an exceptional service team. Menus are planned and executed to perfection by our culinary team, and all details are personally cared for by our staff, giving you the freedom and peace of mind to truly enjoy your special day. To learn more about whether Club Los Meganos is the right venue for your upcoming event, please contact our team by email or at 925.809.7188 to arrange a tour. Weddings Brochure Book A Tour Virtual Tour Weddings Inquiry Photo Gallery “ We looked through and visited many Bay Area venues - but in the end, Club Los Meganos had everything we needed and more. ” Wedding Wire Review “ I just had my wedding here (ceremony and reception). It was amazing! The venue is modern, clean, and beautiful. ” Wedding Wire Review “ Our wedding day was everything we could have ever imagined. The grounds and wedding venue are GORGEOUS! ” Wedding Wire Review “ The food was decadent! Our pictures came out perfect! I would recommend this venue to every bride and groom! ” Wedding Wire Review Our Venues Mount Diablo Event Center The Events Center offers views of Mount Diablo through floor to ceiling windows, a spacious dance floor, and doors that open to the outside patio. Max-Capacity = 216 Mount Diablo Event Lawn Located just outside the Mount Diablo Events Center, the breathtaking Events Lawn is a lush, green setting for your ceremony,  with beautiful views. Max-Capacity = 216 Abby's Gourmet Studio & Patio Couples choosing to host their rehearsal dinner at Club Los Meganos are able to reserve this, one of the area's premier private dining experiences. Max-Capacity = 60 Catering Options & Packages Thank you for considering Club Los Meganos for your upcoming event. From the breathtaking venue to the fabulous food to the incredible service, our team is fully prepared to make your day spectacular. Using only the freshest and highest quality ingredients, often sourced from local providers, Club Los Meganos’ acclaimed culinary team offers menus ranging from inventive gourmet delights to classic country club fare and delicious homemade comfort foods. While we certainly will have suggestions for what has worked well for others, every event is unique and our menus are as well. Please contact our professional events team at 925.809.7188 or by email to learn more. Location 1700 Trilogy Parkway Brentwood, CA 94513 Get Directions Contact Information Events Team Phone: 925.809.7188 Email LEARN ABOUT THE HOMES AT OUR COMMUNITY: Call 800.685.6494 | Join Our Interest List SheaHomes.com Employment Privacy Policy Legal Terms of Use BlueStar Resort & Golf Accessibility Click for Accessibility"
    },
    {
      "url": "https://belistasteofhome.com/catering-company-in-east-bay/",
      "text": "Catering Company in East bay, CA | Beli’s Taste of Home Skip to the content About us Full Service Catering Catering By Tray Menu About us Full Service Catering Catering By Tray Home About us Full Service Catering Catering By Tray Schedule Tasting Contact Us My Account Menu Home About us Full Service Catering Catering By Tray Schedule Tasting Contact Us My Account Schedule Tasting Contact Us Menu Schedule Tasting Contact Us Home About us Full Service Catering Catering By Tray Schedule Tasting Contact Us My Account Menu Home About us Full Service Catering Catering By Tray Schedule Tasting Contact Us My Account December 19, 2023 Catering Company in East bay, CA The cuisine you select to serve at your wedding will be cherished for years to come, regardless of the scale of your celebration. Whether it’s a lavish affair for hundreds of guests, a small, intimate dinner party, a romantic wedding, a corporate gala, a custom-built workplace luncheon, or a highly traditional Indian wedding, every detail matters. With the help of Belis Taste of Home, a catering company in East Bay, CA , you can design a culinary experience that is uniquely yours and a joyous tribute to your heritage. Our Expert Crew Expert chefs from India make up our crew, and we are all focused on serving traditional regional Indian cuisine. Menus can be adjusted to suit a broad range of dietary restrictions and budgets. Whether it’s a wedding, banquet, corporate event, holiday party, or professional convention, our services can fit any sort of event. Serving You Food In Style Known for our effortless event planning, we are a full-service catering company in East Bay, CA, with years of experience serving our clients. Every aspect is meticulously planned to ensure that clients may unwind, delight, and splurge, whether it’s a reception, buffet, or seated dinner. We at Belis Taste of Home are dedicated to becoming the premier full-service catering company in the San Francisco Bay Area. Our goal is to wow our clients with our consistently high-quality food, outstanding service, innovative designs, and meticulous attention to detail. Events and Catering Celebrations When it comes to food, we are staunch supporters of sustainable and organic methods. At Belis Taste of Home , we promise to use only the highest-quality, freshly prepared ingredients. Our seasoned chefs will get to work coordinating every aspect of your unique cuisine after you’ve made your selection. Depending on the season, it could include making traditional regional dishes from around India or shopping for locally grown vegetables. The end product is an unforgettable culinary adventure that will stimulate every sensation in your body and mind. What Makes Us Special? Belis Taste of Home’s superb menu for both Jains and Non Jains and our culinary technique and devotion to the finest local ingredients will undoubtedly be enjoyed by your guests, whether they order their favourite restaurant meals or a custom-prepared menu. If you want your event to go off without a hitch, our catering planners in East Bay, CA, will be right there to help. We are pleased to assist you in locating the ideal venue for your event, as we are associated with numerous top-tier establishments in the Bay Area. Need Tasting ?? Please contact us for availability of Tasting Tasting is only available on request. Advance notice of 2 weeks required to setup tasting Email Subcribe Your go-to Indian vegetarian food caterer, offering a flavorful fusion of Gujarati, North Indian, Street food, Dosa, and Italian cuisines for all your special events. Facebook-f Linkedin-in Instagram Whatsapp Envelope Youtube Quick Links Home About us Contact Us How to Order Terms of Services Privacy Policy Blog Location Gallery FAQ Home About us Contact Us How to Order Terms of Services Privacy Policy Blog Location Gallery FAQ Order Now Full Service Catering Catering By Tray Schedule Tasting Full Service Catering Catering By Tray Schedule Tasting Contact Info +1 914-482-7674 info@belistasteofhome.com 324 Commercial St, San Jose, CA 95112, United States ©2024 Beli’s taste of home | Design and Developed by : Tripearlsoft Your go-to Indian vegetarian food caterer, offering a flavorful fusion of Gujarati, North Indian, Street food, Dosa, and Italian cuisines for all your special events. Facebook-f Linkedin-in Instagram Whatsapp Envelope Youtube Quick Links Home About us Contact Us How to Order Terms of Services Privacy Policy Blog Location Gallery FAQ Home About us Contact Us How to Order Terms of Services Privacy Policy Blog Location Gallery FAQ Order Now Full Service Catering Catering By Tray Schedule Tasting Full Service Catering Catering By Tray Schedule Tasting Contact Info +1 914-482-7674 info@belistasteofhome.com 324 Commercial St, San Jose, CA 95112, United States ©2024 Beli’s taste of home | Design and Developed by : Tripearlsoft"
    },
    {
      "url": "https://eastbayc.com/about-us/",
      "text": "About Us - East Bay Connection × Home Transportation Services About Us Testimonials FAQ Contact Us Airports: SFO | OAK | SJ Call To Book Pickup: 1-925-609-1920 Book Online Airports: SFO | OAK | SJ Call To Book Pickup: 1-925-609-1920 Book Online About Us Home About Us ABOUT East Bay Connection East Bay Connection offers a wide variety of services and vehicles. We are providing affordable transportation to all major Bay Area airports: Oakland, San Francisco, and San Jose. Luxury Lincoln town cars, 8-passenger vans, 11 passengers vans are available to take you anywhere you’d like to go and are also available at hourly rates for private parties, events, tours, or travel. Please call us at 1-925-609-1920 if you would like to make a reservation. Your Dependable, On Time, Door-to-Door, Transportation Service. Established in 1989, East Bay Connection has served the San Francisco Bay Area’s transportation needs with outstanding service and competitive prices. Lowest Fares and Best Service. Groups Rates, Charter Vans, and Luxury SUVs Available Dependable Safe and Comfortable PRIVATE SERVICE For Departing and Arriving Flights at any of the San Francisco Bay Area Airports, the San Francisco Cruise Line Port, Oakland, Emeryville, Martinez, Amtrack and other Point-to-Point needs. Pickup time to be determined by the passenger. CHARTER SERVICE Point-to-Point and Hourly Rates are available upon request. Call 1-925-609-1920 for a personalized quote. APPOINTMENT NOTICE For a price quote, please call one of our professional staff, or book online. Accurate price quotes are always available by speaking directly with our office staff over the phone at 1-925-609-1920 or via email at info@eastbayconnection.us We have private SUVs, sedans, and other vehicles to bring you and your group directly to your destination. Our office hours are 7 AM to 11 PM. For flights after 11 PM airport pickups, call us before your departure time. We will provide you with the professional driver’s name and mobile phone number for pickup. Please get in touch with the driver after you pick up your luggage. Please note our 24-hour cancellation policy. It is not possible to cancel a reservation with less than 24 hours notice before the scheduled pick-up time. If you need to cancel a reservation, please call us more than 24 hours before. Our phones are manned from 7 AM to 11 PM, so feel free to call us at 1-925-609-1920 any time you wish to discuss a reservation. SERVICE AREA East Bay Connection has been providing service to the greater Bay Area in California for over 25 years. Our airport transportation service is available in the following cities. If you do not see your city, we can still provide private vehicles for your needs, and discounts may even be available. Please call us at 1-925-609-1920 or email us at info@eastbayconnection.us for a fare quote. Alamo, Antioch, Bay Point, Benicia, Bethel lsland, Blackhawk, Brentwood, Clayton, Clyde, Concord, Crockett, Danville, Diablo, Discovery Bay, Dublin, Hercules, Lafayette, MA Center, Martinez, Morgan Territory, Moraga, Oakley, Orinda, Pacheco, Pinole, Pittsburg, Pleasant Hill, Pleasanton, Rodeo, Rossmoor, San Ramon, Walnut Creek. Airport Pickup SUV SUV’s are available for up to 4 passengers. We will arrive at your door at your requested time. A 15% tip is mandatory for chartered service. SUV’s can be chartered hourly for special events, parties, or several other occasions. SUV’s may make multiple stops if required; $ 15.00 is added for each additional stop. Courteous, professional, and well-dressed drivers will drive you to and from your destination. Available 24 hours a day, seven days a week. Corporate Accounts are available for businesses that frequently fly in employees, consultants, or anyone else. Airport Pickup Van Chartered vans are available for up to 11 passengers. A 15% gratuity is mandatory for chartered service. Vans can be chartered on an hourly basis for special events, parties, or for several other occasions. Chartered vans may make multiple stops if required; an extra $15.00 is added for each additional stop. Corporate Accounts are available for businesses that frequently fly in employees, consultants, or anyone else. Available 24 hours a day, seven days a week. Courteous, professional, well-dressed drivers will drive you to and from your destination. Location 140 Mayhew Way, Ste 1002, Pleasant Hill, CA 94523 Phones 1-925-609-1920 Email info@eastbayconnection.us Working Hours Monday - Sunday 24 Hours 1-925-609-1920 140 Mayhew Way, Ste 1002, Pleasant Hill, CA 94523 info@eastbayconnection.us Mo-Su: 24 Hours East Bay Connection © All Rights Reserved - 2023 go top"
    },
    {
      "url": "https://www.eastbaygrille.com/private-events",
      "text": "Private Events — East Bay Grille Menus Calendar Gallery Private Events Reservations Gift Cards Contact Back Live Music Upcoming Events Menus Calendar Live Music Upcoming Events Gallery Private Events Reservations Gift Cards Contact private events Celebrate the people in your life against the perfect backdrop. Whether you're planning a wedding reception, corporate party, or plated holiday dinner, we work with you to hold an event that both fits your needs and fulfills your vision. For every event, we strive to create a warm, stylish environment with exceptional service -- in fact, that's what we do daily. Contact our Function Manager to inquire about hosting your private event at East Bay Grille. Gelany Mitchell - Function Manager gmitchell@eastbaygrille.com WATERFRONT WEDDINGS Your wedding is something to celebrate, and East Bay Grille makes no exception for your reception. Our back lawn overlooking historic Plymouth Harbor makes an unforgettable backdrop for your special day. Tented receptions can accommodate up to 200 seated guests, and we offer comprehensive Wedding Packages that include a cocktail hour and plated dinner or buffet options, with special enhancements that allow you to customize your reception as you like it. For more information or to inquire about hosting your wedding with us, please contact our Function Manager, Gelany Mitchell at gmitchell@eastbaygrille.com WEDDING PACKAGES Tented Wedding Reception overlooking historic Plymouth Harbor SOCIAL CELEBRATIONS Don't get lost in the details; we're here to help plan your event. Whether it be a birthday, anniversary, charity or corporate function, you can be assured that our experienced staff will operate thoughtfully, thoroughly, and with the characteristic warmth and style that we've built our reputation on. We offer several different spaces to accommodate parties large and small. The Alcove, which offers guests a gorgeous water view, can host up to 40 people. Our Private Dining Room is available for groups of up to 55 people, and the Back Lawn, overlooking historic Plymouth Harbor, can be utilized for groups of up to 200 people, For more information, or to inquire about hosting your next event with us, please contact our Function Manager, Gelany Mitchell at gmitchell@eastbaygrille.com Private Event Menus Our Private Dining Room can host up to 55 people and is perfect for showers, birthday celebrations, or corporate functions. Private Dining Room Alcove Dining Space Back Lawn with Tent Private Dining Room WEDDINGS + EVENTS AT THE PAVILION AT PINEHILLS GOLF CLUB East Bay Grille proudly manages the food and beverage program at The Pavilion at Pinehills Golf Club in Plymouth. For more formal events, you may enjoy the same quality cuisine and exceptional service at the stunning Pinehills Clubhouse – with vaulted ceilings, exposed wood beams, iron chandeliers, and wall-to-wall windows offering views of the beautifully manicured golf course. For more information, please visit their website. the Pavilion at pinehills Wedding Reception at The Pavilion at Pinehills Golf Club CONTACT + hours EAST BAY GRILLE ON PLYMOUTH WATERFRONT 173 Water Street Plymouth, MA 02360 (508) 746-9751 Sunday - Wednesday 11 am – 9:00 pm. Kitchen Hours Thursday - Saturday 11 am - 10 pm. Kitchen Hours Friday & Saturday Bar Open Until Midnight Sunday - Dinner Menu All Day STAY IN THE KNOW Sign up with your email address to receive news and updates on upcoming events and happenings at East Bay Grille. Email Address Sign Up We respect your privacy. Thank you! Site by hershfield creative"
    }
  ]
}