{
  "fuentes": [
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "email": "herrickstavern@yahoo.com"
    },
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "email": "tmanjourea@yahoo.com"
    },
    {
      "url": "https://www.delaneystx.com/contact",
      "email": "cheers@delaneystx.com"
    },
    {
      "url": "https://tastychomps.com/2020/04/orlandotogo-takeout-review-delaneys-tavern-sodo-district.html",
      "email": "nicole@mpactorlando.com"
    },
    {
      "url": "https://staydh.com/contact-us",
      "email": "info@staydh.com"
    },
    {
      "url": "https://www.eatdt.com/menu/cocktails",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/our-blog/delaneys-tavern-orlando-hidden-gem-lunch",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/our-blog/gluten-free-dining-delaneys-tavern-orlando",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://www.thedelancey.com/about",
      "email": "bookings@thedelancey.com"
    },
    {
      "url": "https://eatdt.com/our-blog/best-place-to-eat-near-orlando-health",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/our-blog/best-of-downtown-orlando-dining-delaneys-tavern",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/menu/breakfast",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/private-events",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/careers",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/careers",
      "email": "resumes@eatdt.com"
    },
    {
      "url": "https://eatdt.com/our-blog/story-behind-delaney-tavern",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/contact-us",
      "email": "info@eatdt.com"
    },
    {
      "url": "https://eatdt.com/our-blog/unparalleled-experience-delaney-hotel-tavern",
      "email": "info@eatdt.com"
    }
  ],
  "mails": [
    "bookings@thedelancey.com",
    "cheers@delaneystx.com",
    "herrickstavern@yahoo.com",
    "info@eatdt.com",
    "info@staydh.com",
    "nicole@mpactorlando.com",
    "resumes@eatdt.com",
    "tmanjourea@yahoo.com"
  ],
  "nombre_sitio": "eatdt.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "text": "Contact – Herrick’s Tavern Skip to content Herrick’s Tavern Menu expanded collapsed Home Menu Specials Beer & Wine Desserts Contact Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Please do not submit take out orders through the contact form. The email is not constantly monitored. To submit a take out order please call the restaurant. Get in Touch 207 Daniel Shays Highway Orange , Massachusetts 01331 USA herrickstavern@yahoo.com krisdeacon@hotmail.com tmanjourea@yahoo.com (978) 544-3902 Instagram Facebook Twitter WordPress Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... Herrick’s Tavern , Blog at WordPress.com. Subscribe Subscribed Herrick’s Tavern Sign me up Already have a WordPress.com account? Log in now. Herrick’s Tavern Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.delaneystx.com/contact",
      "text": "Contact — Delaney's Irish Pub & Scratch Kitchen 0 Skip to Content About Menus Specials & Events Merch Press Careers Contact ORDER ONLINE Open Menu Close Menu About Menus Specials & Events Merch Press Careers Contact ORDER ONLINE Open Menu Close Menu About Menus Specials & Events Merch Press Careers Contact ORDER ONLINE HOURS OF FUN Monday - Thursday 11:00 AM - 12:00 AM Friday - Saturday 11:00 AM - 1:00 AM Sunday 11:00 AM - 12:00 AM Weekend Brunch 11:00 AM - 2:00 PM 6150 Eldorado Parkway, Suite 120, McKinney , Texas 75072 Get in touch Want to get in touch, tell us about a recent experience or purchase a gift card for Delaney's? We'd love to hear from you! Email * Message * Thank you! LOCATION 6150 Eldorado Parkway, Suite 120, McKinney, Texas 75072 (972) 547-2222 cheers@delaneystx.com SOCIAL © 2025 Delaney’s Irish Pub & Scratch Kitchen. All rights reserved."
    },
    {
      "url": "https://tastychomps.com/2020/04/orlandotogo-takeout-review-delaneys-tavern-sodo-district.html",
      "text": "#OrlandoToGo: Takeout Inside Look: Delaney’s Tavern – SoDo District | Tasty Chomps: A Local's Culinary Guide Facebook Instagram Twitter Youtube Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials Search TASTYCHOMPS ORLANDO FOOD BLOG Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. Wednesday, September 10, 2025 Sign in / Join About Foodie Faves Interviews Food Travels Recipes Contact Facebook Instagram Twitter Vimeo Youtube Tasty Chomps A Local's Culinary Guide Home About About Us Media/Press Newsletter Archives Holiday Dining Food Guides Favorite Restaurants Videos Recipes Interviews Brunch Best Bets Happy Hour Travels Hotels Florida St Augustine South Florida Miami Tampa St.Petersburg Sarasota London Hong Kong Vietnam New York City Atlanta Contact Specials More Search #OrlandoToGo: Takeout Inside Look: Delaney’s Tavern – SoDo District By Tiffany Nguyen Apr 7, 2020 In American Downtown Local Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print 2762 Governor Ron DeSantis issued Executive Order 20-71, directing all restaurants and food establishments within the State of Florida to suspend on-premises food and alcohol consumption for customers.  The establishments may, however, operate their kitchens for the purpose of providing delivery or takeout services.  Patrons can order alcoholic beverages to go with food either through pick-up or delivery with valid identification. Delaney’s Tavern current special: $4 import, $3 domestic, $22 six-pack import. Delaney’s Tavern at The Delaney Hotel , located directly across from Orlando Health, is open for business and has implemented a new contactless takeout system. Guest can walk through the automatic sliding doors at The Delaney Hotel which will then lead them to the restaurant’s side door (pictured above) where they can pick up their order at the bar or they can simply call the restaurant when they have arrived at the parking lot and have their order brought out to them curbside. Delaney’s Tavern is currently offering a special takeout menu that includes some of their Tavern favorites as well as daily Family Meals specials available at 4pm everyday.  All family meals feed four people and feature a house salad and Parker House rolls for $45. Executive Chef Anthony Albino and his team have been working together for the past 10-12 years and they certainly know what they are doing. I recently had the opportunity to try their Tavern Burger with a side of crispy potato wedges and it was one of the best burgers and best crispy potato wedges that I have ever had in my life. The Tavern Burger consists of brisket, chuck, short rib blended patty, smoked gouda cheese, caramelized onion aioli, crispy onion frizzle, and chipotle bbq in between a toasted brioche bun. The finished product. For a limited time only, guest can order a Tavern Burger ($13) and receive a free beer.  Choices are: Budweiser, Michelob Ultra, or Bud Light. I would 100% recommend this burger. I took my burger togo and enjoyed it in my scenic backyard. I hope to return soon after the quarantine is over for a staycation at The Delaney Hotel and dinner *inside* Delaney’s Tavern. Until then, takeout will do. Delaney’s Tavern 1315 S Orange Ave Suite B, Orlando, FL 32806 (407) 849-0801 eatdt.com Tags: featured Share Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Print Must Read Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Ricky Ly - UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Ricky Ly - H Mart Orlando Announces Opening Date – September 25, 2025 Ricky Ly - New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek Tiffany Nguyen - Inside Look: Tempo + Grace at Aloft Lake Nona Hotel Ricky Ly - Previous article Edible Orlando and Walt Disney World Host Seventh Annual Field to Feast Dinner 2020 Next article #OrlandoToGo: Takeout Inside Look: Stefano’s Trattoria – Oviedo Related Articles Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 H Mart Orlando Announces Opening Date – September 25, 2025 New Omakase at illume Rooftop Bar & Lounge – JW Marriott Bonnet Creek LEAVE A REPLY Cancel reply Log in to leave a comment Downtown Magazine PRO Facebook Instagram Twitter Youtube About Foodie Faves Interviews Food Travels Recipes Contact TastyChomps.com A Local's Culinary Guide About Foodie Faves Interviews Food Travels Recipes Contact Latest Pumpkin Season at Metro Diner Returns with Pumpkin Pancakes, Waffles, and Bread Pudding Orlando Sep 7, 2025 0 Established in 1992 as a family-owned eatery in Jacksonville, Florida,... UPCOMING EVENT: Walt Disney World Swan and Dolphin Food & Wine Classic returns November 14-15 Orlando Sep 3, 2025 0 The Walt Disney World Swan and Dolphin Food &... H Mart Orlando Announces Opening Date – September 25, 2025 Orlando Aug 30, 2025 0 The highly anticipated Korean market H Mart in Orlando... Popular Is The Krusty Krab Restaurant Opening in Florida? Orlando Jul 10, 2021 0 The Krusty Krab is a fictional fast food restaurant in the American animated... 20 Best Brunch Spots in Orlando for Spring 2021 Best of Apr 14, 2021 0 Springtime in Orlando means lots of warmth and sunshine,... 900 Degreez Food Truck  – featuring Wood-Fired Oven Pizzas food trucks May 15, 2014 0 Artisan Pizza in just 90 seconds - all served... Sitemap About Foodie Faves Interviews Food Travels Recipes Contact © 2008- Present. TastyChomps.com . All Rights Reserved."
    },
    {
      "url": "https://staydh.com/contact-us",
      "text": "Contact Delaney's Hotel | The Best Hotel in Downtown Orlando, FL Home Our Hotel Accommodations Specials Your Events Eat + Drink Our Neighborhood Contact Us Virtual Tour Book Now Home Our Hotel Accommodations Specials Your Events Eat + Drink Our Neighborhood Contact Us Virtual Tour Book Now Contact Us Need help or more information about our hotel? Feel free to call or email us for more information. Ready to visit? Driving directions are just a click away. THE DELANEY HOTEL 1315 S. Orange Avenue, Orlando, FL 32806 Phone: (407) 849-0805 | Email: info@staydh.com General Hotel Information The Delaney Hotel Blog Signup for Exclusive Rates and Content © The Delaney Hotel - All Rights Reserved | Website by OrangeSquare"
    },
    {
      "url": "https://www.eatdt.com/menu/cocktails",
      "text": "Cocktails Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Eat, Drink, Repeat Proprietary Cocktails Magic Martini Bombay Sapphire, Domaine de Canton, Lemon, Butterfly Pea Extract M.I.A. Johnnie Walker Red, Solerno Blood Orange, Sour, San Estaben Malbec Floated Carmen Miranda Cachaca 51, Banana Liqueur, coconut milk, lime, muddled raw sugar Clean Slate La gioiosa prosecco, grapefruit bitters, rose water The Tribute EG Rosemary Lavender Vodka, Pama Pomegranate, grand marnier, cranberry New Takes on Classics Margarita En Fuego Jalepenõ Tequila, Cointreau, Lime, House Made Sour, Chili-Lime Bitters, Cilantro New Fashioned Suntory Toki Whiskey, Cherry Bitters, Muddles Tangerine + Blackberry The Delaney Mule EG Vodka, Fever Tree Ginger Beer, Simple Syrup, Lime Cucumber Cooler Hendricks Gin, St. Germain, Cucumber-Lime Infused Syrup, Muddled Cucumber Boat Drink Bacardi Rum, Banana Liqueur, Blackberry Brandy, Pineapple Juice, Tili Bitters, Myers Rum Sounds tasty, right? You should check out what we've got for lunch + dinner. Lunch + Dinner Menu 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/our-blog/delaneys-tavern-orlando-hidden-gem-lunch",
      "text": "Discover Why Delaney's Tavern is Orlando's Hidden Gem for Lunch Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Discover Why Delaney's Tavern is Orlando's Hidden Gem for Lunch July 27th, 2024 Nestled in the heart of Orlando, FL, Delaney's Tavern offers a delightful escape from the hustle and bustle of city life. Whether you're a local or a tourist, finding the perfect spot for lunch can be a daunting task. This blog aims to unveil why Delaney's Tavern stands out as a hidden gem for a midday meal. From its charming atmosphere to its delectable menu and impeccable service, Delaney's Tavern has something special for everyone. The Unique Atmosphere of Delaney's Tavern Walking into Delaney's Tavern, you're immediately struck by an ambiance that perfectly balances contemporary comfort and understated elegance. The decor is tastefully designed to create an inviting yet stylish space, making it an ideal spot for any occasion. The seating arrangements offer a mix of cozy booths and spacious tables, providing a comfortable setting whether you're dining solo, with friends, or having a business meeting. For those who prefer dining al fresco, the outdoor seating area is a refreshing option, allowing guests to enjoy Orlando's beautiful weather in a relaxed environment. Delaney's is a place where you can unwind, enjoy great food, and feel right at home. Exquisite Lunch Menu One of the key attractions of Delaney's Tavern is its exquisite lunch menu. The chefs at Delaney's take pride in crafting dishes that not only satisfy but also impress. The menu offers a variety of dishes that cater to different tastes and dietary preferences, ensuring there’s something for everyone. Soups and Salads: Start your meal with one of Delaney's delightful soups and salads. The Vegetarian French Onion Soup is a rich, flavorful option topped with house-made crostini and provolone. This soup is a comforting choice that’s perfect for warming up on a cool day. For salad lovers, the Tavern Wedge Salad features applewood smoked bacon, tomato, gorgonzola cheese dressing, and a balsamic glaze, offering a harmonious blend of savory and tangy flavors. Another standout is the Grilled Artisan Romaine & Crostini Caesar Salad, enhanced with fried anchovies for a unique twist. The Shrimp Salad is a versatile choice, with shrimp that can be either crispy or grilled, combined with Arcadian blend, toasted pepita seeds, fire-roasted peppers & onions, carrots, cucumbers, sweet chili Thai vinaigrette, and peanut sauce. These salads are not only fresh and vibrant but also substantial enough to serve as a main course. Small Plates: For those looking to share or sample a variety of flavors, the small plates section is perfect. The Bang Bang Rock Shrimp is a must-try, featuring sriracha kewpie, sweet chili aioli, and a garlic crunch. These shrimp are crispy, spicy, and utterly addictive. If you’re in the mood for something vegetarian, the Kung Pao Cauliflower with peppers, onions, shishito, and peanuts delivers a satisfying kick. This dish is a great example of how Delaney's can turn simple ingredients into a flavor-packed experience. The Brie in Puffs offers a sophisticated blend of maple Brix8 apricot gastrique, orange pistachio crumb, and spiced Amarena cherries, creating a perfect balance of sweet and savory. The Fried Stuffed Mushrooms filled with boursin cheese and served with pesto aioli are a decadent treat that’s perfect for starting your meal or enjoying as a snack with drinks. Handhelds: Delaney's handhelds are perfect for a hearty lunch. The Short Rib Tacos come with cherry hoisin, daikon & carrot slaw, and sriracha kewpie, providing a delightful fusion of flavors that are both bold and refreshing. The Smokehouse Chicken Sando combines lettuce, tomato, bacon, smoked gouda, BBQ, chipotle aioli, all served on Texas toast for a rich and satisfying bite. This sandwich is a smoky, savory delight that’s perfect for those who love BBQ flavors. For a steak lover’s dream, the Grilled Ribeye Sandwich with horseradish aioli, crispy onion frizzles, and a fresh roll is sure to hit the spot. This sandwich is hearty and flavorful, making it a perfect choice for a satisfying lunch. Flatbreads: Flatbreads at Delaney's are another popular choice, combining traditional and inventive toppings. The Roasted Mushroom & Burrata flatbread is topped with pesto, caramelized onion, arugula, and a drizzle of truffle honey balsamic. This flatbread is a perfect blend of earthy, sweet, and savory flavors. The BBQ Chicken Flatbread features pimento cheese, bacon, roasted peppers & onions, smoked provolone, and chipotle BBQ, creating a smoky, savory delight that’s perfect for sharing or enjoying as a main course. Mains: For a more substantial meal, the mains at Delaney's Tavern do not disappoint. The Pan Roasted Fresh Diver Scallops are served with butternut squash & caramelized onion mash, pork belly, and a bourbon maple glaze. This dish is a luxurious choice that’s perfect for seafood lovers. The Grilled 14oz New York Strip is a meat lover's paradise, accompanied by gorgonzola fondue, bacon, asparagus, fingerling potato, mushrooms, and balsamic caviar. This steak is cooked to perfection and served with delicious sides that complement its rich flavors. Pasta enthusiasts will love the Cajun Shrimp Mac-n-Cheese, featuring creste di gallo pasta, jerk cheese sauce, andouille sausage, and lemon panko. This dish is a spicy, cheesy delight that’s perfect for comfort food lovers. Finally, the Black Truffle & Cheese Ravioli is a luxurious dish with roasted clamshell mushrooms, porcini cream, and truffle caviar, offering a rich, earthy flavor that’s perfect for a special treat. For those with dietary restrictions, Delaney's offers a variety of options, including gluten-free and vegetarian dishes. Every item on the menu is prepared with the freshest ingredients, ensuring a delightful culinary experience. The menu at Delaney's is designed to offer something for everyone, making it the perfect spot for a diverse group with varying tastes and dietary needs. Exceptional Customer Service At Delaney's Tavern, customer satisfaction is paramount. The friendly and attentive staff go above and beyond to ensure that every guest feels welcomed and valued. Numerous patrons have shared stories of exceptional service, from personalized menu recommendations to special accommodations for dietary needs. The staff's dedication to providing a top-notch dining experience truly sets Delaney's apart from other lunch spots in Orlando. The attention to detail and the genuine care that the staff shows to each guest make every visit to Delaney's a memorable one. Convenient Location and Accessibility Conveniently located in Orlando, Delaney's Tavern is easily accessible from various local attractions and business centers. Whether you're visiting the nearby Dr. Phillips Center for the Performing Arts or exploring the city's vibrant downtown area, Delaney's is just a short drive away. The tavern also boasts accessibility features to accommodate all guests, ensuring everyone can enjoy a pleasant dining experience. With ample parking and easy access, Delaney's is a convenient choice for a quick lunch break or a leisurely meal. Conclusion In summary, Delaney's Tavern is a hidden gem in Orlando, offering an unparalleled lunch experience. The combination of a unique atmosphere, an exquisite menu, exceptional customer service, and a convenient location makes it a standout choice for both locals and visitors. Whether you're looking for a quick bite, a place to enjoy with friends, or a memorable dining experience, Delaney's Tavern has something to offer. So next time you're in Orlando, be sure to stop by Delaney's Tavern for a lunch that is sure to impress and delight. Previous Discover Orlando's Best Brunch at Delaney's Tavern August 3rd, 2024 Next A Gluten-Free Adventure: Dining at Delaney's Tavern, Orlando July 25th, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/our-blog/gluten-free-dining-delaneys-tavern-orlando",
      "text": "A Gluten-Free Adventure: Dining at Delaney's Tavern, Orlando Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 A Gluten-Free Adventure: Dining at Delaney's Tavern, Orlando July 25th, 2024 A Gluten-Free Adventure at Delaney's Tavern, Orlando Welcome to the ultimate gluten-free dining adventure in Orlando! If you’re someone who loves food but needs to avoid gluten, you know the struggle of finding delicious and safe options when eating out. But fear not, fellow food enthusiasts, because Delaney's Tavern is here to save the day. Nestled in the heart of this vibrant city, Delaney's Tavern is a treasure trove of mouthwatering dishes that cater to gluten-free diets without compromising on taste or quality. Get ready to embark on a culinary journey filled with delightful flavors and unforgettable experiences at this gem of a restaurant. Let's dive in and explore what makes Delaney's Tavern a must-visit destination for gluten-free dining in Orlando! The Ambiance and Atmosphere Let’s talk about the vibe first. Delaney's Tavern is located in the buzzing district of Orlando, and from the moment you walk in, it’s like stepping into a cozy, stylish haven. Picture this: warm lighting, chic décor with a modern twist, and a friendly staff that makes you feel right at home. Whether you're out for a romantic dinner, a family gathering, or just a fun night out with friends, Delaney’s has got you covered. Menu Highlights Now, onto the main event – the food! Delaney's Tavern offers a plethora of gluten-free delights that are as delicious as they are safe to eat. Here are some highlights that you absolutely cannot miss: Delicious Starters Lobster Bisque First up, the Lobster Bisque. This isn’t just any bisque; it’s a rich, creamy dream made with sherry cream and chunks of cold-water lobster. One spoonful of this velvety goodness and you’ll be hooked. It’s the perfect way to kick off your meal. Vegan House Salad Next, we have the Vegan House Salad. Even if you're not vegan, this salad will win you over with its fresh mix of chopped iceberg, arugula, tomato, red onion, cucumber, shredded carrot, and vegan cheese, all tossed in a tangy mustard caper vinaigrette. It's light, refreshing, and a great palate cleanser. Tavern Wedge Salad And don’t miss the Tavern Wedge Salad. This salad is a flavor explosion with applewood smoked bacon, juicy tomatoes, gorgonzola cheese dressing, and a sweet balsamic glaze. It’s hearty, satisfying, and 100% gluten-free. Savory Main Courses Niman Ranch Grilled Tomahawk Pork Chop On to the mains! The Niman Ranch Grilled Tomahawk Pork Chop is a showstopper. Imagine a juicy pork chop topped with capicola ham and fontina cheese, served with grilled broccolini and Tuscan-style mash. The mixed wild mushrooms in a marsala sauce take this dish to the next level. It's a meat lover’s dream and completely gluten-free. Scallop, Shrimp and Grits Seafood fans, rejoice! The Scallop, Shrimp, and Grits is a must-try. This dish features Congaree and Penn purple grits, tasso ham, and a sundried tomato cream sauce that’s to die for. The scallops and shrimp are perfectly cooked, making every bite a delightful combination of textures and flavors. Previous Discover Why Delaney's Tavern is Orlando's Hidden Gem for Lunch July 27th, 2024 Next Best Place to Eat Near Orlando Health | Delaney’s Tavern July 23rd, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://www.thedelancey.com/about",
      "text": "About Us | The Delancey - A Tradition of NYC Nightlife top of page Home Events & Reservations Private Events/Corporate Bottle Service Reservation Free Table Reservations Live Music Events Live Music Bookings Live Music Events Upcoming Events Drink & Food Menu About General Info FAQ Event Space 3D Walk Through Venue Gallery LIVE CHAT LIVE CHAT ABOUT US In the heart of Lower East Side, The Delancey opened its doors in May 2004, embarking on a journey to redefine the nightlife experience. Over the years, our three-level club has evolved into a sanctuary of vibrant music, inviting bars, and a unique all-weather rooftop garden, offering a glimpse of the Manhattan skyline by the Williamsburg Bridge. Our journey began with a vision, to create a haven in Lower East Side where the vibrant local essence could thrive. The Delancey was conceived as more than a nightclub—it was to be a canvas for memories, a hub for diverse musical beats, and a city getaway. Our aim was to merge the modern with the timeless, crafting spaces where music and laughter flow freely amidst a warm, candlelit ambiance. In the heart of Lower East Side, The Delancey opened its doors in May 2004, embarking on a journey to redefine the nightlife experience. Over the years, our three-level club has evolved into a sanctuary of vibrant music, inviting bars, and a unique all-weather rooftop garden, offering a glimpse of the Manhattan skyline by the Williamsburg Bridge. Our journey began with a vision, to create a haven in Lower East Side where the vibrant local essence could thrive. The Delancey was conceived as more than a nightclub—it was to be a canvas for memories, a hub for diverse musical beats, and a city getaway. Our aim was to merge the modern with the timeless, crafting spaces where music and laughter flow freely amidst a warm, candlelit ambiance. Over the years, The Delancey has become a hallmark of authentic New York nightlife. Each floor resonates with a unique vibe, mirroring the city's dynamic pulse. The Main Floor invites dance enthusiasts, the Rooftop Garden offers a serene escape, while the Downstairs Venue nurtures live music aficionados. Step up to our Rooftop Garden, your go-to spot for a relaxed or lively get-together under the sky. With a retractable roof and heating, it's perfect all year round, whether for private parties, special events, or chill evenings with friends. Reserve a spot and let the city skyline add magic to your night at The Delancey. Rooftop Garden Dive into The Delancey's Main Floor, where the night comes alive. Plush settings and a luxe vibe make it a dance lover's dream. Perfect for private parties or just a night out, this is where your evening turns extraordinary. Main Floor Head down to our Downstairs Lounge, your spot for a musical adventure. Ideal for private parties, special events, or late-night weekend hangouts, especially with live music on the agenda. Here at The Delancey, let the tunes guide your moves as the night tells its story. Downstairs Lounge For any inquiries or assistance, feel free to reach out. We're here to help! ​ Phone: 212.254.9920 Email: thedelanceynightclub@gmail.com ​ Location: 168 Delancey St, New York, NY 10002 ​ Operating Hours: Tuesday & Wednesday: 7pm - late Thursday: 6pm - late Friday & Saturday: 5pm - 4am General Info For any inquiries or assistance, feel free to reach out. We're here to help! ​ Phone: 212.254.9920 Email: thedelanceynightclub@gmail.com ​ Location: 168 Delancey St, New York, NY 10002 ​ Operating Hours: Tuesday & Wednesday: 7pm - late Thursday: 6pm - late Friday & Saturday: 5pm - 4am Reservations For reservations, private parties, or special events, please contact us through the provided phone number or email. Private Event VIP Table Reservation Contact us I Delancey NYC First name Last name Email * Phone Message * Submit 168 Delancey St  |  New York, NY 10002 ​ bookings@thedelancey.com (212) 254-9920 Home Events & Reservations Private Events/Corporate Bottle Service Reservation Free Table Reservations Live Music Events Live Music Bookings Live Music Events Upcoming Events Drink & Food Menu About General Info FAQ Event Space 3D Walk Through Venue Gallery Terms & Conditions Privacy Policy Cookie Policy © 2024 The Delancey NYC Home Events & Reservations Private Events/Corporate Bottle Service Reservation Free Table Reservations Live Music Events Live Music Bookings Live Music Events Upcoming Events Drink & Food Menu About General Info FAQ Event Space 3D Walk Through Venue Gallery bottom of page"
    },
    {
      "url": "https://eatdt.com/our-blog/best-place-to-eat-near-orlando-health",
      "text": "Best Place to Eat Near Orlando Health | Delaney’s Tavern Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Best Place to Eat Near Orlando Health | Delaney’s Tavern July 23rd, 2024 Nestled in the heart of downtown Orlando, Delaney's Tavern epitomizes the vibrant dining culture of the city. This family-owned hotspot, known for its sophisticated yet welcoming atmosphere, attracts both locals and tourists seeking an exceptional dining experience. The team at Delaney’s Tavern has poured their passion, hard work, and love for food into every aspect of the establishment, creating a legacy that celebrates Orlando’s culinary diversity. Conveniently situated near popular attractions like Lake Eola Park, the Dr. Phillips Center for the Performing Arts, and the Amway Center, Delaney's Tavern is the perfect spot to unwind and enjoy a delectable meal after a day of adventure. A Prime Location Located conveniently in downtown Orlando, Delaney's Tavern is easily accessible and surrounded by bustling city attractions. It serves as a perfect spot for dinner after a day of exploring the city's rich cultural landscape. Culinary Delights at Delaney's Tavern At Delaney's Tavern, the menu is a reflection of both traditional and innovative culinary styles. The kitchen, led by renowned chef Anthony Albino, offers dishes that cater to a variety of palates, ensuring that every guest finds something to enjoy. Signature Dishes Soups and Salads Lobster Bisque Start your meal with a decadent Lobster Bisque. This rich soup features cold water lobster chunks and is finished with a touch of sherry cream, offering a luxurious and comforting dish. Spinach & Berries Salad For a refreshing start, try the Spinach & Berries Salad. It includes cayenne-dusted candied pecans, fresh berries, feta cheese, crispy onion frizzles, and is tossed with a strawberry basil balsamic vinaigrette. Shrimp Salad Seafood lovers must try the Shrimp Salad. Featuring crispy or grilled shrimp, Arcadian blend greens, toasted pepita seeds, fire-roasted peppers and onions, carrots, cucumbers, and dressed with a sweet chili Thai vinaigrette and peanut sauce. Small Plates Mama Becky's Meatballs One of the most popular small plates, Mama Becky's Meatballs are served in an arrabiata sauce and topped with asiago cheese, pairing beautifully with the savory meatballs. Shoyu Beef Filet Skewers For meat lovers, the Shoyu Beef Filet Skewers are a delightful treat. Served with five-spice pan-braised red cabbage and almond sesame, creating a unique fusion of flavors. Fried Stuffed Mushrooms Vegetarian options include the Fried Stuffed Mushrooms, stuffed with boursin cheese and served with pesto aioli. Handhelds Mahi Fish Tacos Choose between grilled or blackened fish in the Mahi Fish Tacos, topped with pineapple mango salsa, avocado dressing, and watercress for a delightful combination of tropical and savory flavors. Short Rib French Dip The Short Rib French Dip features smoked provolone, mustard aioli, and is served on a fresh roll, combining tender short rib with melted cheese. Flatbreads Blue Crab Flatbread Includes tomato, wilted spinach, alfredo sauce, herb feta, and Old Bay aioli, offering a unique blend of creamy, tangy, and savory flavors. Roasted Mushroom & Burrata Flatbread Featuring pesto, caramelized onion, arugula, and truffle honey balsamic, the combination of earthy mushrooms and creamy burrata is divine. Mains Almond Garlic Crusted Salmon This dish comes with an orange honey glaze, mango coconut Neptune rice, grilled asparagus, yuzu plum sauce, and wasabi aioli. The crusted salmon is tender and flavorful, with sides that perfectly complement it. Allen Harim Lemon Rosemary Airline Chicken Breast Served with Trevi's gnocchi and charred kale pesto, the lemon rosemary seasoning adds a refreshing zest to the tender chicken. Grilled Filet Mignon For steak enthusiasts, the Grilled Filet Mignon is a must-try, served with Tuscan mash, a gourmet mushroom medley, and cognac cream sauce. Scallop, Shrimp, and Grits A flavorful southern-inspired dish featuring Congaree and Penn purple grits, tasso ham, and a sundried tomato cream sauce. Why Delaney's Tavern Stands Out in Orlando's Dining Scene Delaney's Tavern is not just a place to eat; it’s a destination that offers a memorable dining experience. What sets it apart is not only its food but its overall ethos and approach to hospitality. Exceptional Service The staff at Delaney's Tavern are known for their warm, attentive service, ensuring that every guest feels right at home. Their expertise and enthusiasm contribute significantly to the overall dining experience, making each visit unforgettable. Ambiance and Design The interior combines rustic charm with contemporary elegance, creating a welcoming environment that resonates with both intimacy and style. The thoughtful design, from the cozy seating to the ambient lighting, plays a crucial role in crafting the perfect setting for a meal that is both relaxing and refined. Visiting Delaney's Tavern For those planning a visit, Delaney's Tavern offers a seamless reservation process via their website or over the phone. It’s advisable to book in advance, especially during peak dining hours or special occasions. Special Events and Offerings Delaney's Tavern also caters to various events, from private parties to corporate gatherings. Their flexibility in accommodating different group sizes and event specifics makes them a preferred choice for those looking to host an event in a stylish yet comfortable venue. Conclusion Delaney's Tavern is more than just a restaurant; it is a pillar of the Orlando dining scene, reflecting the spirit of its vibrant community. Whether you're a local or a visitor, a meal here promises not only to delight the palate but also to leave you with lasting memories of genuine hospitality and outstanding cuisine. Previous A Gluten-Free Adventure: Dining at Delaney's Tavern, Orlando July 25th, 2024 Next 5 Best Dishes You Will Love At Delaney's Tavern in Orlando, FL July 20th, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/our-blog/best-of-downtown-orlando-dining-delaneys-tavern",
      "text": "Experience the Best of Downtown Orlando’s Dining Scene at Delaney’s Tavern Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Experience the Best of Downtown Orlando’s Dining Scene at Delaney’s Tavern September 4th, 2024 Downtown Orlando is a haven for food enthusiasts, boasting a vibrant and diverse culinary scene that offers something for every palate. From upscale dining to trendy cafes and hidden gems, this bustling area is a must-visit for anyone looking to experience the best of Orlando’s food culture. Amidst this rich tapestry of dining options, Delaney's Tavern shines as a standout, offering a unique blend of local flavors, innovative dishes, and a welcoming ambiance that makes it a must-visit destination for locals and visitors alike. Exploring the Culinary Landscape of Downtown Orlando Downtown Orlando's dining scene is as diverse as it is dynamic. Whether you're in the mood for modern American cuisine, international flavors, or comfort food with a twist, you'll find a spot that satisfies your cravings. Popular eateries like Ceviche Tapas Bar serve up flavorful Latin-inspired dishes, while The Strand offers a sophisticated take on French cuisine. For sushi lovers, there's Kabooki Sushi, known for its creative rolls and fresh ingredients. What makes Orlando’s dining scene truly exceptional is the emphasis on creativity and quality. Chefs in this city are not just preparing food—they’re crafting experiences, often using locally sourced ingredients to create dishes that are as innovative as they are delicious. This is where Delaney’s Tavern truly shines. Situated in the heart of downtown, our restaurant offers a dining experience that celebrates local ingredients and culinary artistry, setting us apart from the crowd. Delaney’s Tavern: A Culinary Gem in the Heart of Orlando Just steps away from popular attractions like the Amway Center and the Dr. Phillips Center for the Performing Arts, Delaney’s Tavern is perfectly positioned for those looking to enjoy a memorable meal in the heart of downtown Orlando. But it’s not just our location that draws people in—it’s our dedication to delivering a dining experience that’s both comforting and exciting. A Menu that Celebrates Local Flavors At Delaney’s Tavern, we believe that great dishes start with great ingredients. Our menu is a celebration of Central Florida’s bounty, featuring fresh, locally sourced produce and sustainably caught seafood. For a lighter, yet equally flavorful option, the Spinach & Berries Salad is a vibrant choice. It’s packed with fresh berries, cayenne-dusted candied pecans, feta cheese, and crispy onion frizzles, all tossed in a strawberry basil balsamic vinaigrette. The mix of sweet, spicy, and tangy flavors offers a refreshing and balanced start to your dining experience. Seafood lovers shouldn’t miss the Shrimp Salad, featuring crispy or grilled shrimp on a bed of Arcadian blend greens, fire-roasted peppers and onions, and cucumbers, dressed with a sweet chili Thai vinaigrette and peanut sauce. The diverse ingredients and dressings create a flavorful and satisfying dish that’s perfect for lunch or dinner. Craft Cocktails and a Stellar Wine Selection No meal at Delaney’s Tavern is complete without one of our expertly crafted cocktails or a glass of wine from our extensive selection. Our bartenders have created a cocktail menu that’s as creative as it is delicious, featuring drinks like our signature Delaney's Mule and a range of classic cocktails with a twist. Wine lovers will appreciate our carefully curated list, which includes selections from around the world, with a focus on small producers who share our commitment to quality. Whether you’re looking for the perfect pairing for your meal or simply want to enjoy a glass on its own, our sommelier is always available to help you find exactly what you’re looking for. A Perfect Spot for Every Occasion Delaney’s Tavern is designed to be versatile, offering a space that’s perfect for any occasion. Whether you’re planning a casual dinner with friends, a romantic date night, or a special celebration, our warm and inviting dining room provides the ideal setting. With a décor that blends modern elegance with rustic charm, and a team of friendly, attentive staff, you’ll feel right at home from the moment you walk in. Why Delaney's Tavern Stands Out In a city filled with dining options, Delaney’s Tavern has established itself as a standout thanks to our commitment to quality, creativity, and exceptional service. We strive to offer more than just a meal—we aim to provide an experience that lingers long after you’ve left the table A Family-Owned Legacy of Excellence Delaney’s Tavern is more than just a restaurant; it’s a family-owned establishment with a legacy of excellence. Our passion for hospitality and good food drives everything we do, from the care that goes into each dish to the warm welcome you receive at the door. This personal touch is what sets us apart and makes Delaney’s Tavern a beloved spot for both locals and visitors. Rave Reviews from Locals and Visitors Our commitment to excellence hasn’t gone unnoticed. Whether it’s a glowing review from a first-time visitor or praise from a loyal regular, we’re proud to have built a reputation as one of downtown Orlando’s top dining destinations. Customers often rave about our Mama Becky’s Meatballs, served in a spicy arrabiata sauce and topped with asiago cheese, or our Shoyu Beef Filet Skewers, which come with five-spice pan-braised red cabbage and almond sesame. These dishes, like so many others on our menu, showcase our dedication to quality and flavor. The Future of Dining at Delaney's Tavern Delaney’s Tavern is more than just a restaurant—it’s a place where food, drink, and ambiance come together to create a dining experience that’s truly special. As part of downtown Orlando’s vibrant culinary scene, we’re proud to offer a menu that celebrates local ingredients, creative dishes, and exceptional service. Whether you’re a local or just visiting, make sure to stop by Delaney’s Tavern and see why we’re considered one of the best dining spots in the city. Previous Start Your Culinary Journey in Downtown Orlando at Delaney’s Tavern September 10th, 2024 Next Sip and Savor: The Best Happy Hours in Downtown Orlando August 7th, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/",
      "text": "Best Restaurant in Orlando | New American Cuisine | Delaney's Tavern Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 New American Cuisine Delaney's Tavern offers Friendly Fare & Spirits. HOURS OF OPERATIONS Our Hours of Operations Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30am Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** Order Online Reservations RESERVE NOW Gift Cards Friendly Fare's & Spirits Welcome to Delaney's Tavern Elevate Your Palate Welcome to Delaney's Tavern, where hospitality is reimagined and culinary creativity thrives. Under the expert guidance of Chef Anthony Albino, our menu features a delightful array of chef-inspired creations, ranging from tempting small plates and shareables to flavorful handhelds and tacos. Our soups and salads offer fresh, vibrant flavors, while our robust entrees promise a satisfying dining experience.\nAt Delaney's Tavern, we take pride in our craft cocktails, thoughtfully curated by our head bartender, Chris Silvasman. Savor one of our seven beers on tap, showcasing a variety of flavors from both local and nationally sourced breweries.\nDelaney's Tavern is the perfect setting for any gathering. We gladly accommodate larger groups with reservations and are equipped to host banquets and events for up to 65 guests. Recognized as Orlando's #1 rehearsal dinner space and a top-20 event venue by Orlando Weekly, we are dedicated to making every occasion memorable. 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/menu/breakfast",
      "text": "Breakfast Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Breakfast FRESH TAKES ON THE CLASSICS Best Starts to Your Day The Standard 2 eggs any style, pecan smoked bacon, sausage link, poblano & potato hash, mini biscuit & sage sausage gravy Egg White Omelet spinach, tomato, pancetta, feta, kale & potato hash, rosemary cream sauce Charred Kale + Potato Skillet beef short rib, madeira braised pearl onions & mushrooms, sunny side up egg, sage aioli Swine Frittata chorizo, bacon, ham, roasted mushroom & shallot, smoked gouda cheese, chive cream, salsa Vegetarian Frittata roasted piquillo peppers & onions, escarole, grilled asparagus tips, goat cheese, pepper tomato jam, jalapeno cream Chilaquiles Tostada spicy guacamole, tomatillo braised chicken, cotija cheese crema, sunny side up egg, pickled red onion Texas Toast Brioche French Toast maple pecan butter, apricot rum maple syrup Side Dishes Griddle Cakes 3 Egg Omelet Mini Biscuits + Sage Sausage Gravy Pecan Smoked Bacon Sausage Link Poblano + Potato Hash Kale + Potato Hash Chorizo + Egg Taco Greek Vanilla Yogurt w/ House Made Granola Sounds tasty, right? You should check out what we've got for lunch + dinner. Lunch + Dinner Menu 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/private-events",
      "text": "Private Events Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Private Dining + Special Events BEAUTIFUL BANQUETS, EXCEPTIONAL EVENTS Planning an event? Give your team room to breathe in our cool and colorful event space, complete with catering options and flexible set-ups. We are unrivaled when it comes to romantic wedding receptions, stellar banquets, corporate meetings, and specialty events. We can accommodate meetings and events for groups of two to 65 and we are equipped with all the latest technology to keep your meeting on point. Banquet & Catering Menu To start planning your group dining event at Delaney’s Tavern, tell us more about your event: Event Request 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/careers",
      "text": "Join The Top Restaurant in Orlando, FL | Delaney's Tavern Careers Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Join The Top Restaurant in Orlando, FL Delaney's Tavern Careers I Need an application I need an application. Download App Apply Now I'm ready to apply. Apply Now 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/our-blog/story-behind-delaney-tavern",
      "text": "The Story Behind Delaney's Tavern: Blending Tradition with Innovation Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 The Story Behind Delaney's Tavern: Blending Tradition with Innovation June 22nd, 2024 Several years ago, in the vibrant city of Orlando, a unique idea was born over a casual dinner . Dr. Tom Winters, a local orthopedic surgeon, and his wife, Dr. Becky Moroose, were enjoying a meal with friends when inspiration struck. Becky mused, \"Wouldn’t it be great to create a Cheers-style restaurant and bar where family, friends, locals, and visitors to Orlando could come together?\" As a managing member of a real-estate partnership with holdings across from Orlando Health, Tom knew the area was ripe for such a venue. This shared vision led to the creation of Delaney's Tavern , a place where tradition meets innovation. The Dream of a Community Hub As the managing member of a real-estate partnership with holdings across from Orlando Health , Tom had deep insight into the Downtown South District. He knew that a restaurant and bar were much needed in the area. Their dream was clear: a place where everyone feels welcome, where hospitality and quality go hand in hand. Partnering with Experts Through personal contacts, Tom partnered with Greg Allowe, a long-time hotelier and restaurateur specializing in independent, boutique properties. Over many months of brainstorming and fine-tuning, Delaney’s Tavern was born. Their combined expertise and passion for hospitality laid the foundation for what would become a beloved local hotspot. Location, Location, Location Situated in the Heart of Delaney Park Delaney’s Tavern is strategically located directly across the street from Orlando Health, known locally as ORMC, and situated in Delaney Park, Florida . This prime location fills a much-needed gap for restaurants and bars in South Downtown Orlando, offering a convenient and stylish dining option for both locals and visitors. A New American Tavern As a New American Tavern, Delaney’s specializes in “friendly fare & spirits”, providing patrons with stylish cuisine in both small plates and shareables. The restaurant aims to be more than just a place to eat and drink; it’s a community hub where people can relax, socialize, and enjoy themselves. Culinary Excellence Under the Guidance of Chef Anthony Albino Welcome to Delaney's Tavern, where hospitality is reimagined and culinary creativity thrives. Under the expert guidance of Chef Anthony Albino, our menu features a delightful array of chef-inspired creations. From tempting small plates and shareables to flavorful handhelds and tacos, every dish is crafted with care and innovation. A Menu to Delight Soups and Salads Enjoy our rich Lobster Bisque or the vibrant Spinach & Berries Salad. For a seafood twist, try the flavorful Shrimp Salad. Small Plates and Handhelds Savor Mama Becky’s Meatballs or the delightful Shoyu Beef Filet Skewers. Vegetarian? The Fried Stuffed Mushrooms are a must. For handhelds, choose the fresh Mahi Fish Tacos or the hearty Short Rib French Dip. Flatbreads and Mains Indulge in the Blue Crab Flatbread or the Roasted Mushroom & Burrata Flatbread. For mains, try the Almond Garlic Crusted Salmon, the Allen Harim Lemon Rosemary Chicken Breast, the Grilled Filet Mignon, or the southern-inspired Scallop, Shrimp, and Grits. A Craft Cocktails and More Curated by Head Bartender Steven Pruitt At Delaney's Tavern, we take pride in our craft cocktails, thoughtfully curated by our head bartender, Steven Pruitt. Each drink is a work of art, designed to complement our menu and enhance your dining experience. A Selection of Beers and Wines Savor one of our seven beers on tap, showcasing a variety of flavors from both local and nationally sourced breweries. Our wine selection is equally impressive, offering something for every palate. The Perfect Gathering Place Accommodating Larger Groups Delaney's Tavern is the perfect setting for any gathering. We gladly accommodate larger groups with reservations and are equipped to host banquets and events for up to 65 guests. Whether you’re planning a rehearsal dinner, a corporate event, or a casual get-together, we are dedicated to making every occasion memorable. Recognized and Celebrated Recognized as Orlando's #1 rehearsal dinner space and a top-20 event venue by Orlando Weekly, Delaney’s Tavern has become a cornerstone of the community. Our dedication to quality and service ensures that every visit is a special one. Conclusion Delaney’s Tavern is more than just a restaurant; it’s a dream realized through hard work, innovation, and a deep love for the community. Dr. Tom Winters and Dr. Becky Moroose, alongside their expert team, have created a space where tradition and innovation blend seamlessly. Whether you’re a local or a visitor, we invite you to join us at Delaney’s Tavern and experience our friendly fare and spirits firsthand. Previous Top Dishes to Try at Delaney’s Tavern for First-Time Visitors June 26th, 2024 Next Planning Your Orlando Stay: Why Delaney's Tavern Should Be on Your Itinerary June 20th, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/contact-us",
      "text": "Contact Delaney's Tavern | Upscale Restaurants in Orlando Florida Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 Contact Delaney's Tavern Contact Information Questions? We're here to help. Our Address 1315 S. Orange Ave. Orlando, FL 32806 Phone 407.849.0801 E-mail info@eatdt.com 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    },
    {
      "url": "https://eatdt.com/our-blog/unparalleled-experience-delaney-hotel-tavern",
      "text": "Delaney's Tavern: A Culinary Gem in Orlando's Dining Scene Welcome to Delaney's Tavern FRIENDLY FARES & SPIRITS Home Menu Private Events Our Hotel Contact Us CALL: (407) 849-0801 From Check-In to Check-Out: A Full Experience at Delaney's Tavern and the Delaney Hotel June 13th, 2024 Welcome to The Delaney Hotel, your gateway to a unique escape from the ordinary, right in the pulsing heart of Orlando. Perfectly located just steps away from downtown and opposite Orlando Health, our hotel blends luxurious comfort with cutting-edge technology. At The Delaney Hotel, we go beyond the usual offerings to ensure that every aspect of your stay is exceptional, from our oversized rooms to our advanced amenities. Accomodations at The Delaney Hotel Unmatched Room Features Experience a new level of accommodation in our thoughtfully designed rooms which feature spacious layouts and sophisticated technology. With amenities like in-room tablets, digital concierge services, and mobile keys, every detail is tailored to enhance your stay. Our luxurious bathrooms are equipped with smart mirrors that integrate digital clocks, and you can relax with a movie on our 55\" TVs after a day of exploring Orlando. Dining at Delaney's Tavern Delaney's Tavern, our on-site restaurant, offers a gastronomic adventure with dishes that blend traditional flavors with modern culinary techniques. Start your meal with our signature Blue Crab Beignets or Brie in Puffs, and savor main courses like the Pan Roasted Sea Bass served on a bed of wasabi mashed potatoes with a shoyu cream sauce. The tavern’s ambiance, characterized by plush seating and stylish fire walls, provides the perfect backdrop for a memorable dining experience. Tailored Guest Experience Our commitment to providing personalized service is evident in every aspect of The Delaney Hotel. From room automation systems that adjust settings to your liking to our efficient express check-in and checkout processes, we ensure that your stay is seamless and personalized. Amenities and Services Beyond the Basics - Exclusive Amenities Whether you're visiting for business or pleasure, our exclusive amenities are designed to cater to all your needs. Keep up with your fitness routine in our state-of-the-art fitness center, or stay on top of work in our fully-equipped business center. If you're planning an event, our private dining room and event space can accommodate up to 100 guests, making it ideal for both corporate and social gatherings. Convenience at Your Fingertips We prioritize your convenience at every turn. Our hotel offers self-parking facilities, a pet-friendly policy, and inclusive amenities like complimentary super-fast WiFi to ensure you stay connected. Our accessibility options cater to all guests, ensuring everyone enjoys their stay to the fullest. Accessibility and Inclusivity At The Delaney Hotel, inclusivity is at the core of our hospitality. We offer a range of accessible accommodations, including options for mobility accessibility and services for guests with hearing impairments. Our team is dedicated to accommodating your needs, so please reach out to us directly to ensure your requirements are met. Dining and Entertainment Eat and Drink at Delaney's Tavern At Delaney's Tavern, we pride ourselves on a diverse menu that features everything from small plates to full entrees, allowing guests to taste a variety of flavors. Our cocktails, like the color-changing Magic Martini and the robust M.I.A., are crafted to complement your meal or serve as a standalone treat. The tavern’s integrated charging ports and free WiFi also mean you never have to worry about staying connected. Happy Hour and Special Deals Our Happy Hour at Delaney's Tavern is not to be missed. Enjoy $3 off cocktails, $2 off all wines, and $1 off beers and select appetizers every weekday from 4 to 6 PM. It's the perfect opportunity to unwind in a lively atmosphere with exceptional drinks and delicious food at a great value. Happy Hour and Special Deals Our Happy Hour at Delaney's Tavern is not to be missed. Enjoy $3 off cocktails, $2 off all wines, and $1 off beers and select appetizers every weekday from 4 to 6 PM. It's the perfect opportunity to unwind in a lively atmosphere with exceptional drinks and delicious food at a great value. Exploring Orlando from The Delaney Hotel Prime Location for City Attractions Located across from the Orlando Health Downtown Campus and within easy reach of the city’s top attractions like the Amway Center and Dr. Phillips Center, The Delaney Hotel is ideally situated for exploring Orlando. Whether you're here for medical reasons, business, or pleasure, our location serves as a convenient base for all your activities. Recommendations for Local Activities We encourage you to explore Orlando's vibrant offerings. Visit nearby attractions like Walt Disney World, Universal Studios, or Sea World, or discover local gems like the Orlando Science Center and the Mall at Millenia. Our staff is always ready to recommend the best local dining, shopping, and entertainment options. The Delaney Hotel and Delaney's Tavern offer a comprehensive experience that seamlessly blends comfort, luxury, and convenience. From our modern accommodations and gourmet dining options to our prime location and personalized services, everything about our hotel is designed to ensure you have an unforgettable stay. Book your visit with us and discover the extraordinary in Orlando! Previous Must-Try Craft Cocktails at Delaney Tavern in Orlando June 15th, 2024 Next Delaney's Tavern Orlando - Where Local Ingredients Meet Global Flavors June 7th, 2024 1315 S Orange Ave, Orlando, FL 32806 GET IN TOUCH (407) 849-0801 info@eatdt.com get directions HOURS OF OPERATION Breakfast | 7:30am - 10:00am Weekend Brunch | 10:30am - 2:30pm Happy Hours | 3pm-6pm & 8:30pm-Close Monday thru Thursday | 11:00am-9:30pm Friday | 11:00am-10:30pm Saturday | 10:30am-10:30pm Sunday | 10:30am-9:30pm **Kitchen closes 15 minutes prior to close** RESERVATIONS © 2025 - DELANEY'S TAVERN - ALL RIGHTS RESERVED SITE BY ORANGESQUARE"
    }
  ]
}