{
  "fuentes": [
    {
      "url": "https://eclipsepower.co.uk/contact-us/",
      "email": "enquiries@eclipsepower.co.uk"
    },
    {
      "url": "https://www.eclipseevents.com/contact",
      "email": "sales@eclipseevents.com"
    },
    {
      "url": "https://www.eclipseir.com/contactus.php",
      "email": "csmart@eclipseir.com"
    },
    {
      "url": "https://www.eclipseir.com/contactus.php",
      "email": "smiller@eclipseir.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "aleach@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "amestdagh@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "bbulmer@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "cgumbinger@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ecarlo@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "esoto@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "gmikaiel@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jallinson@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jbell@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jgoldschmidt@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "kmitura@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ldegon@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lhickox@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lsharrit@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "mcorrigan@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "pmartin@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "slindblad@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "swiechens@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "tchalifourdrahman@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "visitorinformation@visitjacksonville.com"
    },
    {
      "url": "https://www.eclipsejacksonville.com/",
      "email": "info@eclipsejacksonville.com"
    }
  ],
  "mails": [
    "aleach@visitjacksonville.com",
    "amestdagh@visitjacksonville.com",
    "bbulmer@visitjacksonville.com",
    "cgumbinger@visitjacksonville.com",
    "csmart@eclipseir.com",
    "ecarlo@visitjacksonville.com",
    "enquiries@eclipsepower.co.uk",
    "esoto@visitjacksonville.com",
    "gmikaiel@visitjacksonville.com",
    "info@eclipsejacksonville.com",
    "info@visitjacksonville.com",
    "jallinson@visitjacksonville.com",
    "jbell@visitjacksonville.com",
    "jgoldschmidt@visitjacksonville.com",
    "kmitura@visitjacksonville.com",
    "ldegon@visitjacksonville.com",
    "lhickox@visitjacksonville.com",
    "lsharrit@visitjacksonville.com",
    "mcorrigan@visitjacksonville.com",
    "pmartin@visitjacksonville.com",
    "sales@eclipseevents.com",
    "slindblad@visitjacksonville.com",
    "smiller@eclipseir.com",
    "swiechens@visitjacksonville.com",
    "tchalifourdrahman@visitjacksonville.com",
    "visitorinformation@visitjacksonville.com"
  ],
  "nombre_sitio": "eclipsejacksonville.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://eclipsepower.co.uk/contact-us/",
      "text": "Get in touch | Eclipse Power Networks Skip to content Electricity Connections . Simplified . About us About us Meet the team Careers Get In Touch About us About us Meet the team Careers Get In Touch POWER CUT? 0800 0548 192 TALK TO US 01234 486487 TALK TO US 01234 486487 BUSINESS UNITS Networks Get connected Get connected How we connect you Asset value Customer care Customer care Power cut Priority Service Register Optimise Solutions Solutions About Grid consultancy services Grid consultancy team SECTORS CASE STUDIES KNOWLEDGE HUB Knowledge Hub Regulated Document Library Priority Service Register FAQs Glossary Securities Explained Transmission Connections NEWS &  EVENTS BUSINESS UNITS Networks Get connected Get connected How we connect you Asset value Customer care Customer care Power cut Priority Service Register Optimise Solutions Solutions About Grid consultancy services Grid consultancy team SECTORS CASE STUDIES KNOWLEDGE HUB Knowledge Hub Regulated Document Library Priority Service Register FAQs Glossary Securities Explained Transmission Connections NEWS &  EVENTS BUSINESS UNITS NETWORKS GET CONNECTED GET CONNECTED HOW WE CONNECT YOU ASSET VALUE CUSTOMER CARE CUSTOMER CARE POWER CUT PRIORITY SERVICE REGISTER OPTIMISE SOLUTIONS SOLUTIONS ABOUT GRID CONSULTANCY SERVICES GRID CONSULTANCY TEAM SECTORS CASE STUDIES KNOWLEDGE HUB KNOWLEDGE HUB REGULATED DOCUMENT LIBRARY PRIORITY SERVICE REGISTER FAQS GLOSSARY SECURITIES EXPLAINED TRANSMISSION CONNECTIONS NEWS & EVENTS ABOUT US ABOUT US MEET THE TEAM CAREERS GET IN TOUCH BUSINESS UNITS NETWORKS GET CONNECTED GET CONNECTED HOW WE CONNECT YOU ASSET VALUE CUSTOMER CARE CUSTOMER CARE POWER CUT PRIORITY SERVICE REGISTER OPTIMISE SOLUTIONS SOLUTIONS ABOUT GRID CONSULTANCY SERVICES GRID CONSULTANCY TEAM SECTORS CASE STUDIES KNOWLEDGE HUB KNOWLEDGE HUB REGULATED DOCUMENT LIBRARY PRIORITY SERVICE REGISTER FAQS GLOSSARY SECURITIES EXPLAINED TRANSMISSION CONNECTIONS NEWS & EVENTS ABOUT US ABOUT US MEET THE TEAM CAREERS GET IN TOUCH Get in touch How can we help? Call us: +44 (0) 1234 486487 enquiries@eclipsepower.co.uk Linkedin Youtube In an emergency or loss of supply, please call our free 24hr telephone number: 0800 0548 192 In an emergency or loss of supply, please call our free 24hr telephone number: 0800 0548 192 First name* (Required) Surname* (Required) Email address* (Required) Phone number Company What do you want to talk about? What do you want to talk about? Power Cut or Network Emergency Priority Service Register General Enquiry Get Connected Asset Value Request Careers Customer Feedback Other Please specify Message* CAPTCHA Consent (Required) I agree with Eclipse Power Limited's privacy policy and terms and conditions. (Required) *Mandatory Envelope Linkedin Youtube Eclipse Power Ltd Head Office: 100 Avebury Boulevard Milton Keynes MK9 1FH Eclipse Power Ltd London Office: 4 Winsley Street Mappin House London W1W 8HF Company numbers: Eclipse Power Limited 09633451 Eclipse Power Networks Limited 09633506 Eclipse Powers Solutions Limited 09633542 Eclipse Power Optimise Limited 16141777 VAT number: 233695394 PRIVACY & COOKIES TERMS & CONDITIONS SERVICE TERMS NETWORK ASSET SEARCH PORTAL enquiries@eclipsepower.co.uk © 2025 Eclipse Power Group Branding and Design by Sims Creative | Website build by Tim’s Digital"
    },
    {
      "url": "https://www.eclipseevents.com/contact",
      "text": "Contact Us | Eclipse Events: Weddings, Mitzvahs, Corporate Events — ECLIPSE EVENTS 0 Skip to Content Wedding Who We Are Reviews Meet The Team Investment Partners Photography Cinematography Live Music Production + Enhancements Mitzvah Corporate Event Blog Contact Login Open Menu Close Menu Wedding Who We Are Reviews Meet The Team Investment Partners Photography Cinematography Live Music Production + Enhancements Mitzvah Corporate Event Blog Contact Login Open Menu Close Menu Folder: Wedding Back Who We Are Reviews Meet The Team Investment Partners Photography Cinematography Live Music Production + Enhancements Mitzvah Corporate Event Blog Contact Login This Is Where It All Begins . Please fill out the form below and we’ll get you some much needed information as soon as possible Click Here For Request Information Form Come Visit Us Our New Headquarters 30 Liberty Street Edison, NJ 08837 30 Liberty Street, Edison, NJ 08837 908.766.8900 sales@eclipseevents.com © 2025 Eclipse Events. All rights reserved"
    },
    {
      "url": "https://www.eclipseir.com/contactus.php",
      "text": "Contact Us! Changing the Face of Identity Recognition Home Products MatchPointLITE™ MatchPoint6™ MatchPoint COMMANDER™ SearchPointIR™ Fusion-IR™ Technology Applications FAQS Our Team Latest News Contact Us EclipseIR Corporation Offices 1968 South Coast Hwy #4060 Laguna Beach, CA 92651 Contacts Please contact us for questions or information Steve Miller,\n                  CEO\n                  : smiller@eclipseir.com (408) \n                888-0892 Charley Smart : EVP Operations & Communications csmart@eclipseir.com (408) 502-6147 Eclipse Identity Recognition Corporation EclipseIR™ brings next-generation facial recognition and identity technologies to the real, imperfect world\n          of intelligent surveillance and video analysis for law enforcement, commercial security, and business applications. Copyright 2025 Eclipse Identity Recognition Corporation. All rights reserved  | Terms of Use and Privacy Policy"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "text": "Meet the Team | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 76 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home Who We Are Meet the Team Meet the Team Share Get in touch with the Visit Jacksonville team. See our full staff listing below. Get to know the friendly and helpful team at Visit Jacksonville. Click through for contact information for every member of our team including sales, destination experience, marketing, media, and more. Executive Team Michael Corrigan President & CEO Charged with marketing, selling and promoting Jacksonville’s image, driving visitation and boosting the economy through tourism. Office Phone: (904) 421-9150 Send An Email Sarina Wiechens Chief Operating Officer Oversees the daily operations and financial components of Visit Jacksonville to implement the vision and mission of the organization and CEO/President. Office Phone: (904) 421-9152 Send An Email Katie Mitura Chief Marketing Officer Oversees the Marketing team to implement the goals of the President and CEO for Visit Jacksonville pertaining to marketing Jacksonville as a premier destination. Office Phone: (904) 421-9160 Send An Email Jeanne Goldschmidt Director of Convention Sales Oversees the Convention Sales team to implement the goals of the President and CEO of Visit Jacksonville pertaining to growth of bookings and support within the destination. Office Phone: (904) 421-9164 Send An Email Courtney Gumbinger Director of Destination Experience Oversees the Destination Experience team to implement the goals of the President and CEO to provide exceptional customer service to both individual visitors as well as group and meeting attendees. Office Phone: (904) 421-9151 Send An Email Administration Becky Bulmer Assistant Director of Finance Responsible for the financial oversight and integrity of financial processes for the organization. Oversees all accounting functions. Office Phone: (904) 421-9189 Send An Email Eva Soto Accounting Manager Responsible for financial oversight, payment processing, financial statements and all financial aspects of the business. Office Phone: (904) 421-9155 Send An Email Laurie Degon Senior Analytics Manager Responsible for data analytics and reporting to develop marketplace analysis of trends in tourism as well as economic impact forecasts. Office Phone: (904) 421-9178 Send An Email Lisa Sharrit Administration Manager Responsible for human resources and insurance components for Visit Jacksonville. Liaison to the Board of Directors. Office Phone: (904) 421-9181 Send An Email Convention Sales Bob Doering Senior National Accounts Manager Responsible for promoting Jacksonville as a premier destination for Corporate, State and National Association conferences and events. Office Phone: (904) 798-9123 Send An Email Emma Carlo National Accounts Manager Responsible for promoting Jacksonville as a premier destination to the Social, Military, Religious and Fraternal markets. Office Phone: (904) 421-9172 Send An Email Sydney Lindblad Sales Development Manager Responsible for promoting Jacksonville as a premier destination to meetings of less than 200 total room nights and sporting events of all sizes. Office Phone: (904) 421-9182 Send An Email Gaby Mikaiel Sales and Administration Manager Responsible for administrative support, grant process management and travel coordination for the sales team and President. Office Phone: (904) 421-9159 Send An Email Destination Experience Paloma Martin Senior Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners, and acts as liaison with local hoteliers and businesses. Office Phone: (904) 421-9176 Send An Email Jorie Allinson Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners and oversees visitor center staffing. Office Phone: (904) 421-9154 Send An Email Kerry Weatherhead Destination Experience Coordinator Responsible for assisting visitors contacting or entering centers or as a part of a conference or group with requests for information, maps and brochures, referrals and trip planning services. Office Phone: (904) 798-9111 Send An Email Seymour Jax Responsible for showing you all there is to do and see in Jacksonville. Seymour often roams the streets and is set up at special events. Stop by, say hi, take a selfie… Meet Seymour Marketing Andrea Mestdagh Senior Marketing Communications Manager Responsible for marketing, communication and public relations initiatives to promote and market Jacksonville as a premier leisure destination to key markets. Office Phone: (904) 421-9169 Send An Email Tess Chalifour-Drahman Meetings Marketing Manager Responsible for marketing initiatives and strategies to entice conventions and groups to book their meetings in Jacksonville. Office Phone: (904) 421-9162 Send An Email Joey Bell Community Outreach Manager Responsible for managing outreach initiatives and growing relationships in the local community with all tourism partners and business entities. Office Phone: (904) 421-9157 Send An Email Autumn Leach Marketing Communications Manager Responsible for Visit Jacksonville’s website, promotions and other major marketing initiatives. Office Phone: (904) 421-9166 Send An Email Lauren Hickox Marketing Manager Responsible for assisting with the research and development of marketing materials, website content, app content, email content, and various marketing initiatives. Office Phone: (904) 421-9183 Send An Email Tucker Responsible for exploring Jacksonville and posing for photos. Follow his adventures on Instagram! Meet Tucker Want to join our team? Click here to see the open positions! Here to Help The Jacksonville Information Authority Visit Jacksonville is your go-to resource as you begin to plan your next Jacksonville story. Read More Your Next Meeting Destination Read More Industry Resources Learn about the Power of Tourism Read More More About Visit Jacksonville Destination Experience Hub Read More Meet the Sales Team Read More Meet the Visit Jacksonville Insiders Read More Visit Jacksonville Board of Directors Read More Research & Development Information Read More Jacksonville Area History Read More JAX Facts Read More Jacksonville Accolades Read More Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://www.eclipsejacksonville.com/",
      "text": "Eclipse Riverside Nightlife Jacksonville – Jacksonville's premier alternative nightlife destination. Eclipse offers live music, themed nights, karaoke, and special events in the heart of Riverside. Open 7 days until 2am with no cover charge and easy parking. Eclipse Riverside Nightlife Jacksonville Events Contact Us Private Parties Bartending School Gallery Where Jacksonville Gets Real After Dark come PARTY with us Since opening our doors in Jacksonville’s Riverside neighborhood, Eclipse Bar & Nightclub has become the city’s premier venue for those seeking genuine nightlife experiences. Directions AUTHENTIC JACKSONVILLE NIGHTLIFE Authentic Jacksonville Nightlife means real people, real music, and zero pretense – where you can actually be yourself instead of putting on a show. EVENTS 🍍PINEAPPLE PARTIES FIRST SATURDAY OF EVERY MONTH🍍 PRIVATE PARTIES AVAILABLE VIP SERVICES THEME NIGHTS FULL SERVICE BAR PINEAPPLE PARTIES FULL SERVICE BAR EVENTS VIP SERVICES PRIVATE PARTIES UNIQUE NIGHT CLUB EXPERIENCE The Eclipse Experience - Jacksonville More than just a night out – it’s a community experience. From karaoke to live bands, themed nights to private events, Eclipse delivers authentic Jacksonville nightlife. FOLLOW US Join our community online for event notifications, photo highlights, and insider access to Jacksonville’s alternative nightlife scene Facebook Instagram TikTok WHAT WE OFFER WE ARE MORE THAN JUST ANOTHER NIGHTCLUB We are Jacksvonville’s authentic community where real people can create real memories! VENUE RENTAL Rent Eclipse for private parties, corporate events, and special celebrations with full service bar, sound system, and event coordination. EVENTS Weekly themed nights, live performances, and special events bringing together Jacksonville's most diverse and authentic entertainment. PINEAPPLE PARTIES Home of the First Saturday Lifestyle Party hosted by pineappleparties.com. Jacksonville's premier alternate lifestyle party! LOUNGE AREA Comfortable indoor and outdoor lounge spaces perfect for conversation, drinks, and relaxing between sets. DANCE FLOOR Spacious dance floor with professional sound system and lighting where Jacksonville's diverse crowds come together. FULL SERVICE BAR Complete full service bar featuring premium spirits, signature cocktails, and affordable specials like our famous 'Fuckit Buckit'. EVENTS UPCOMING EVENTS Check out upcoming events featuring guest DJs, tribute bands, open mic nights, and themed parties that keep Eclipse’s calendar packed with excitement. 1 AUGUST Karaoke Fridays - Eclipse Jacksonville No Cover 10PM - 2AM 2 AUGUST Pineapple Party Meet & Greet 12 8PM - 12AM 8 AUGUST Lingerie Party by Pineapple Parties 10 9PM - 2AM 9 AUGUST Crazy Horse Free 9PM - 2AM 15 JULY Karaoke Fridays - Eclipse Jacksonville No Cover 10PM - 2AM Karaoke Fridays - Eclipse Jacksonville 🎤 Friday Night Karaoke at Eclipse Bar & Nightclub 🎤\n\nKick off your weekend right with Jacksonville's most authentic karaoke experience! Every Friday night, Eclipse transforms into your personal stage where real people create real memories. Pineapple Party Monthly Meet & Greet Pineapple Parties presents monthly meet & greet.  First Saturday of every month. Pineapple Parties Bad Kitty Aug 2nd 🐱 Meow-velous Night at Eclipse! 🐱\nUnleash your inner feline for Bad Kitty Night! Come dressed as your favorite cat - house cat, wild cat, or fantasy feline - and prowl the night away at Jacksonville's most authentic nightclub. Night of the Crazy Horse Aug 9th 🔥 SADDLE UP FOR THE WILDEST NIGHT IN JAX! 🔥\n\nDust off those boots and bring your best yeehaw energy! From traditional country to modern rock remixes - we've got something for every cowboy and cowgirl! Lingerie Party at Eclipse Aug 8th 💋 Lingerie Party at Eclipse 💋\n\nGet ready for Jacksonville's hottest night of the summer! Eclipse presents an exclusive lingerie party where confidence meets elegance in Riverside's most authentic nightclub atmosphere. GALLERY CLUB FUN MOMENTS AND GALLERIES Browse our photo gallery showcasing live performances, themed nights, karaoke fun, and the authentic moments that make Eclipse Jacksonville’s favorite venue. our gallery book the venue for your next private party! VISIT: 904-228-4663 4219 St Johns Ave info@eclipsejacksonville.com Contact Us Eclipse Bar & Nightclub is Jacksonville’s premier alternative nightlife venue, located in the heart of the historic Riverside district in Jacksonville, Florida . LINKS Contact Us Event List Gallery Private Parties CONTACT 4219 St Johns Ave, Jacksonville, FL djkeithwilson@gmail.com 904-228-4663 Facebook Instagram OPENING HOURS MON: 8PM - 2AM TUES: 8PM - 2AM THURS - SAT 8PM - 2AM SUN: 8PM - 2AM Copyright © 2025 Eclipse by eCommWiz"
    }
  ]
}