{
  "fuentes": [
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "email": "herrickstavern@yahoo.com"
    },
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "email": "tmanjourea@yahoo.com"
    },
    {
      "url": "https://members.lwrba.org/directory/Details/ed-s-tavern-sr-64-3441700",
      "email": "info@lwrba.org"
    },
    {
      "url": "https://www.eodcarpentry.com/contact",
      "email": "info@eodcarpentry.com"
    },
    {
      "url": "https://edstavernfl.com/classic-car-show/",
      "email": "lance@collectorcarstv.com"
    }
  ],
  "mails": [
    "herrickstavern@yahoo.com",
    "info@eodcarpentry.com",
    "info@lwrba.org",
    "lance@collectorcarstv.com",
    "tmanjourea@yahoo.com"
  ],
  "nombre_sitio": "edstavernfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://herrickstavern202.wordpress.com/contact/",
      "text": "Contact – Herrick’s Tavern Skip to content Herrick’s Tavern Menu expanded collapsed Home Menu Specials Beer & Wine Desserts Contact Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Please do not submit take out orders through the contact form. The email is not constantly monitored. To submit a take out order please call the restaurant. Get in Touch 207 Daniel Shays Highway Orange , Massachusetts 01331 USA herrickstavern@yahoo.com krisdeacon@hotmail.com tmanjourea@yahoo.com (978) 544-3902 Instagram Facebook Twitter WordPress Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... Herrick’s Tavern , Blog at WordPress.com. Subscribe Subscribed Herrick’s Tavern Sign me up Already have a WordPress.com account? Log in now. Herrick’s Tavern Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://members.lwrba.org/directory/Details/ed-s-tavern-sr-64-3441700",
      "text": "Ed's Tavern SR 64  - Lakewood Ranch Business Alliance Skip to content Login Join Directory LWR Guide Facebook Instagram LinkedIn YouTube Menu About About Lakewood Ranch About the LWRBA Board of Directors Committees LWRBA Staff Member News Contact Us Membership Join Now Member Directory Annual Sponsors About Annual Sponsorships Member Center Member Directory Member Tools Member News Alliance Shop Community Help Forum Member 2 Member discounts Publications The LWR Guide: Your Connection to the LWR Region Connection Magazine Events About Our Events Events Calendar Community Calendar Ribbon Cuttings 2025 Sandies The Alliance Gives Back Connecting Lakewood Ranch Non-Profits LWRBA Event Photos Business Tools Business Resources Florida Blue – Working Uninsured Program How To Videos Job Board Post a Position Young Leaders Alliance About YLA Join the YLA YLA Events Vertical Drives Member Directory Ed's Tavern SR 64 Back to Search Ed's Tavern SR 64 Categories Restaurant, Bar & Catering Network Affiliate 1305 108th St E , Bradenton , FL , 34212 (941) 329-1010 https://edstavernfl.com Membership Type Network Affiliate Contacts Primary Kristy   Petersheim Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Lakewood Ranch Business Alliance | Site by GrowthZone The Power of Connection Lakewood Ranch Business Alliance 5391 Lakewood Ranch Blvd N, STE 103. Sarasota, FL 34240 941-757-1664 info@lwrba.org Facebook Instagram LinkedIn YouTube © 2025 Lakewood Ranch Business Alliance . All Rights Reserved | Site by GrowthZone"
    },
    {
      "url": "https://www.eodcarpentry.com/contact",
      "text": "Contact | Reach Out Today — EOD Carpentry 0 Skip to Content Home Services About Contact Open Menu Close Menu Home Services About Contact Open Menu Close Menu Home Services About Contact Contact Us If you’re interested in collaborating, please provide your information, and we will contact you soon. We look forward to connecting with you. info@eodcarpentry.com +34 672172991 Name * First Name Last Name Email * Message * Thank you! info@eodcarpentry.com +34 672172991 Chat on WhatsApp"
    },
    {
      "url": "https://edstavernfl.com/classic-car-show/",
      "text": "Classic Car Show Lakewood Ranch | Best Sports Bar Manatee County (941) 907-0400 10719 Rodeo Drive, Lakewood Ranch, FL 34202 Menu Cocktail Menu Drink Menu Food Menu Delivery Options DoorDash GrubHub UberEats LWR Events $6 Burger Monday Poker Night Wing Wednesdays Music Trivia Nights Trivia Night Classic Car Show LWR Tuesday Bowl Specials Happy Hour Gift Cards Contact Visit Our Other Locations Blog In the News Review Us Toys for Tots close ORDER NOW CLASSIC CAR SHOW Welcome to Ed's Tavern! We're a local Sports Bar & Restaurant located on Rodeo Drive in Downtown Lakewood Ranch, right next to the Lakewood Ranch Cinema . We are a proud Sponsor of the Classic Car Show, which is a community event that takes place on Main Street on the First Wednesday of Each Month from 5 p.m. to 8 p.m. Bring your ride or just enjoy the family-friendly atmosphere while you gaze at the classics! You can bring anything on wheels to participate! It's just $10 per vehicle and there are no restrictions! Oh and don't forget the food, music, and prizes that take place during this event! To participate and to find out more information contact Lance by phone at 941-371-1061 , or by email at lance@collectorcarstv.com . Remember to come on into Ed's to unwind after the event to have one of our local draft beers , wines, or spirits ! Don't leave Ed's without tasting one of our mouth-watering items off of our food menu too! Thank you again for making Ed's Tavern in Lakewood Ranch the Best Sports Bar in Manatee & Sarasota Counties ! Lakewood Ranch 10719 Rodeo Drive Lakewood Ranch, FL 34202 (941) 907-0400 MON - THUR 11:00 am – 12:00 am FRI - SAT 11:00 am – 1:00 am SUN 11:00 am – 11:00 pm © 2025 Ed's Tavern | All Rights Reserved | Privacy Policy | Accessibility | Website Design by DigiSphere Marketing facebook-f google instagram yelp clock bars chevron-down location-dot phone xmark"
    }
  ]
}