{
  "fuentes": [
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "adam@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "ava@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "bpalozzi@e.systemsinteractive.ca"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "chris@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "colin@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "craig@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "e@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "eli@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "erika@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "erin@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "halpern-logo_140x@2x.png"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "halpern-logo_200x@2x.png"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "holly@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "james@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "jeff@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "joel@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "jordan@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "joseph@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "katlin@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "kevin@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "martin@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "matt@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "mika@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "paul@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "randy@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "sheena@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "sheila@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "stef@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "tela@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "todd@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "tommy@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "violet@halpernwine.com"
    },
    {
      "url": "https://halpernwine.com/pages/about-us",
      "email": "will@halpernwine.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.ellenswineroom.com/about-ellen/",
      "email": "ellen@ellenswineroom.com"
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "email": "info@brookswine.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "info@homecoin.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "wilianny@novaorlando.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "ggrizzard@egrizzard.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "info@homecoin.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "info@realestatewall.com"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "email": "machweb1@msn.com"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "email": "adam@theaustralianwinecompany.com"
    },
    {
      "url": "https://www.ellenswineroom.com/events/",
      "email": "ellen@ellenswineroom.com"
    },
    {
      "url": "https://www.ellenswineroom.com/",
      "email": "ellen@ellenswineroom.com"
    },
    {
      "url": "https://laurelglen.com/visit/",
      "email": "bettina@laurelglen.com"
    },
    {
      "url": "https://laurelglen.com/visit/",
      "email": "concierge@laurelglen.com"
    },
    {
      "url": "https://laurelglen.com/visit/",
      "email": "wineclub@laurelglen.com"
    }
  ],
  "mails": [
    "adam@halpernwine.com",
    "adam@theaustralianwinecompany.com",
    "ava@halpernwine.com",
    "bettina@laurelglen.com",
    "bpalozzi@e.systemsinteractive.ca",
    "chris@halpernwine.com",
    "colin@halpernwine.com",
    "concierge@laurelglen.com",
    "craig@halpernwine.com",
    "e@halpernwine.com",
    "eli@halpernwine.com",
    "ellen@ellenswineroom.com",
    "erika@halpernwine.com",
    "erin@halpernwine.com",
    "ggrizzard@egrizzard.com",
    "halpern-logo_140x@2x.png",
    "halpern-logo_200x@2x.png",
    "holly@halpernwine.com",
    "info@brookswine.com",
    "info@homecoin.com",
    "info@realestatewall.com",
    "james@halpernwine.com",
    "jeff@halpernwine.com",
    "joel@halpernwine.com",
    "jordan@halpernwine.com",
    "joseph@halpernwine.com",
    "katlin@halpernwine.com",
    "kevin@halpernwine.com",
    "machweb1@msn.com",
    "martin@halpernwine.com",
    "matt@halpernwine.com",
    "mika@halpernwine.com",
    "paul@halpernwine.com",
    "randy@halpernwine.com",
    "sales@finewineliquors.com",
    "sheena@halpernwine.com",
    "sheila@halpernwine.com",
    "stef@halpernwine.com",
    "tela@halpernwine.com",
    "todd@halpernwine.com",
    "tommy@halpernwine.com",
    "violet@halpernwine.com",
    "wilianny@novaorlando.com",
    "will@halpernwine.com",
    "wineclub@laurelglen.com"
  ],
  "nombre_sitio": "ellenswineroom.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://halpernwine.com/pages/about-us",
      "text": "About Us\n– Halpern Wine Enterprises Skip to content . . . Site navigation Halpern Wine Enterprises Search Close Search Account 0 Cart . . . Site navigation Close Search Close Cancel Wines Halpern Exclusives New Arrivals Featured Wines Hosting Essentials Mixed Cases Large Format Bottles 375mL Kosher Wine Bin Ends Style White Wine Red Wine Sparkling Wine Rosé Dessert Wine Spirits Country Australia Canada France Germany Italy Japan Mexico Portugal Spain USA Price Point Under $20 $20 - $50 $50 - $100 $100 - $200 $200 & up Quick shop Temporarily Unavailable A26 Chardonnay Antinori California 750mL 2022 \"Close (esc)\" Accessories Sold by The Enterprise Corkscrews Wine Bags Glassware Quick shop Sold Out MT Double Bend Red Glass MarkThomas 880mL $95 00 $95.00 \"Close (esc)\" Offers Brands Halpern Wine Portfolio About Us Contact Us Search Close Subtotal $0.00 Check out One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Wines Expand submenu Wines View all Halpern Exclusives Expand submenu Halpern Exclusives View all New Arrivals Featured Wines Hosting Essentials Mixed Cases Large Format Bottles 375mL Kosher Wine Bin Ends Style Expand submenu Style View all White Wine Red Wine Sparkling Wine Rosé Dessert Wine Spirits Country Expand submenu Country View all Australia Canada France Germany Italy Japan Mexico Portugal Spain USA Price Point Expand submenu Price Point View all Under $20 $20 - $50 $50 - $100 $100 - $200 $200 & up Accessories Expand submenu Accessories View all Sold by The Enterprise Expand submenu Sold by The Enterprise View all Corkscrews Wine Bags Glassware Offers Brands Halpern Wine Portfolio About Us Contact Us View more About Us Halpern Enterprises has been in the business of importing fine wines and spirits in to Canada for over 65 years. Today we are one of the oldest in Ontario. Founded by Harold Halpern, a Pharmacist by education, it started small but quickly developed strong relationships with a few European and New World wine producers who have grown along with us. Todd Halpern joined his father, Harold, in 1979. Todd’s brother Colin joined the Company in 1991, and Todd’s son Adam came on board in 2017. Todd and Colin have seen the company grow tremendously over the last number of years. Today we represent over 175 wineries and distilleries from all around the world. Year after year we continue to strengthen our long standing relationships, as well as establish new ones as the industry continues to grow and shift. We are so extremely privileged to represent some of the wine world’s most revered and sought after estates, alongside new generation properties pushing the boundaries and setting new bars. Our Network Our sales force in Toronto is composed of 17 salespeople, including 5 certified sommeliers. Additionally, the areas of Western Ontario, the Hamilton/Niagara region, Eastern Ontario and the Greater Ottawa Valley are each covered locally. Promotional activities, which include LCBO in-store work and promotional tastings, are covered by 3 dedicated representatives. We also have two dedicated promotional staff members solely responsible for LCBO store promotional activity and in-store tastings. Our Customers Over the past 65 years, we have developed a large and comprehensive customer base comprising the most important private, corporate and restaurant wine and spirit consumers and collectors in Ontario and Canada. Our relationships with our customers are based on mutual trust and exceptional service. Our emphasis has always been on customer service and we maintain that we offer the best service to go with the best wines available in the market. Our Team Todd Halpern Todd Halpern joined his father, Harold, the founder of Halpern Enterprises, in 1979. A man of many titles — among them father and President of Halpern Enterprises — Todd is also vice-chair of the Toronto General & Western Hospital Foundation Board of Directors. In this role, Todd blends his two passions — using everyone’s favourite elixir, wine, as a vessel for making a difference in Canadian health care. He also continues to successfully navigate Halpern Enterprises through the exciting and ever-changing world of Wine. Contact Todd Colin Halpern Colin joined Todd and their father, Harold, in 1991 with the mission to expand, grow and strengthen relationships with existing and new top quality producers. Colin, curates, finely tunes, and works with his teams to manage the Halpern portfolio and develop the top producers from far corners of the world. Colin believes Halpern’s customers demand quality, and quality is what he supplies. Contact Colin Adam Halpern Exactly sixty years after Harold Halpern began importing wine through the back of his pharmacy on Spadina Avenue, his grandson Adam Halpern proudly joined the family company alongside his father and uncle. Having graduated from the University of Western Ontario in 2015 with aspirations of investment banking, a game time decision in realizing where his passions truly lay led him back to the family business. Having been raised with the finest winemakers around the kitchen table, and access to the world’s most revered and classic wines, Adam’s palate was honed at a far younger age than most. Now in the role of assisting his father and uncle with company operations, the ardent athlete and Burgundy fanatic oversees sales, logistics, and allocations. Contact Adam Ava Chiu Ava is a graduate of the University of Guelph, where she earned her degree in Sociology in the Criminal Justice and Public Policy program, and a minor in Child and Family Studies. With a diverse background in medical administration and the restaurant industry, she brings a unique blend of organizational skill, adaptability, and customer service experience to her role. Ava thrives in environments that challenge her and takes pride in staying organized and detail-oriented, making her a valuable part of any team. Born and raised in Toronto, Ava has a deep appreciation for the city's rich culinary scene and loves discovering new restaurants. Her passion for wine began through her brother’s guidance and has grown into a shared interest she continues to explore. Outside of work, she enjoys watching Formula 1, reading romance novels, and playing competitive sports like ultimate frisbee and volleyball. Contact Ava Chris Faubert Chocolate and Wine are a great pairing. Chris certainly thought so when he made the leap from Lindt Chocolates to the world of Wine and Spirits in 2011 as the Regional Sales Director at Kirkwood Diamond Canada. He joined Halpern Enterprises in October 2016 as the Sales Director responsible for the Direct Sales and Retail Sales Teams. His passion for wine led Chris to complete his Level 3 WSET Wine & Spirits Education in fall of 2017. Cooking, outdoor activities such as cycling and hiking plus his young kids keep him busy outside of work. Contact Chris Craig Marshall After 20 years working in the production and development of children’s animation, from Care Bears and Beetlejuice to Batman, Craig learned and developed an appreciation for providing excellence in delivering world class children’s programming. Craig brings the same commitment, passion and dedication to the world of fine wines at Halpern. He has grown to love the fine wine culture. Contact Craig Eli Rodriguez Eli (that's \"Ellie\") was born in Brooklyn, NY and spent his formative years in Queens and on Long Island’s south shore. He completed his B.A. at Cornell University in Ithaca, NY, graduating in 2001. He caught the wine bug while in the Finger Lakes, and dove into the wine business, first at retail with Best Cellars New York, then as a sommelier for Daniel Boulud’s Dinex Group at Restaurant Daniel, before launching a 15-year career at Sotheby’s as a wine auction specialist, auctioneer, and Chief of Staff to Amy Cappellazzo and the Global Fine Art Division. Eli's wife is a Toronto native and they ditched NYC for TO Summer 2023.  He joined the Halpern Team in Spring 2024 as a sales representative. Contact Eli Ellen Lichman Ellen has studied and worked at home and abroad in the fields of music performance and midwifery for over 30 years.  When she needed a change of pace, she found it working with the Halpern team and the finest wines of the world.  This inspired her to start studying wine and has successfully completed her Level 1 WSET course. In her spare time, Ellen plays trombone in military and community bands throughout the GTA.  When not working or playing, you can find her on her balcony enjoying her current favourite glass of wine. Contact Ellen Erika Altosaar Erika joined the Halpern team in 2021 following her tenure as the Beverage Director at Eataly Toronto. Having grown up with restaurateur parents, an unrelenting passion for wine was sparked at a young age, which culminated in a life-long obsession following years of travel. She has a penchant for storytelling with teaching being her greatest passion, and she takes pride in being able to offer exciting and accessible private tastings to her clients. Beyond managing private and on-premise accounts, Erika is a Brand Manager who works with Halpern’s wineries in the Rhône Valley, the South of France, Alsace, Germany, Spain and Portugal. When not at her desk, she can be found playing soccer with her dog Hugo, traveling or more than likely drinking a glass of Chardonnay. Contact Erika Erin Kritzer Erin joined Halpern in 2019 as a Retail Sales Representative, working throughout the GTA and east, and north up to cottage country. Before Halpern, Erin spent 3 years living, working, eating, drinking and learning her way around the beautiful Niagara wine region. While working at Peninsula Ridge Estate Winery as the Assistant Retail Manager, she graduated as a Certified Sommelier through the Niagara CAPS program in 2015. When she is not working, you can find her spending time with family and friends - often enjoying good food and good wine! Contact Erin Holly Caverly As the Canadian Brand Manager of Aviation Gin and Global Ambassador of Scrappy's bitters Holly gained experience growing small spirits brands. She fostered a passion for spirits and hospitality bartending at award winning Toronto establishments. She joined Halpern in 2022 after spending 3 years as a costume designer in Film and Television. She now manages the Halpern spirits portfolio and designs and sews her own eccentric wardrobe. Contact Holly James Oatway James came to work for Halpern Enterprises in September of 2000. That position led to an interest in wine, and that interest led to a bit of a passion for wine. In 2011, James gained certification with CAPS and the Court of Master Sommeliers. In 2012, he created the 'Southern Ontario Sommelier Association' that held an annual Ontario Wine Competition. This led to a seat on the CAPS board of directors. Wine manages to seep into your life and take hold. Not a bad thing. Contact James Jeff Johnston Jeff came to Halpern in August, 2021 after having worked in the Accounting field in both the Public and Private Sectors for approximately 27 years. The Wine Industry has been a new experience and Jeff is looking forward to the continuous learning of this business. Contact Jeff Joel Rosenthal Joel's interest in wine began in 1995 while holding the position as a principal of Atlas Bar and Grill Restaurant in Toronto. After discovering a strong enjoyment in wine, his appreciation proceeded from sampling hundreds of bottles to a formal wine education with level 1 and 2 WSET courses. Joel also participated in Robert Parker’s Matter of Taste seminars and master classes in Napa, California. In 2017, he joined Halpern Enterprises in a sales role.As of 2022, Joel expanded his role and is a Brand Manager for New World properties located in Arizona, Australia, Chile, New Zealand, Oregon, South Africa and Washington. Contact Joel Jordan Alessi Jordan is a Toronto born Sommelier who was in a previous life, The Wine Director of all Chase Hospitality Group of Restaurants and Cafe Boulud at The Four Seasons as their Maitre D/Sommelier. Hospitality and Wine has always been Jordan's love but wine really became a career when Jordan went off to New Zealand to study all aspects of the wine industry for four years. Contact Jordan Joseph Langton Joseph is a seasoned expert in Management and Logistics, celebrated for his extensive experience working alongside creative executives and visionary entrepreneurs. His diverse background encompasses Film Production, Hospitality Management, the Professional Music Industry, and the Tattoo industry, equipping him with a unique perspective on maintaining alignment and effectiveness within innovative teams. With a blend of ambition and a commitment to excellence, Joseph is an indispensable asset to Halpern Enterprises and its esteemed wine portfolio. Contact Joseph Katlin James Katlin currently serves as a Logistics Coordinator, where she leverages her exceptional attention to detail and customer service skills to ensure seamless operations. Known for her strategic approach and effective management style, Katlin is committed to optimizing processes and enhancing team collaboration. Previously, Katlin worked as a Model Agent, where she developed a keen eye for detail while managing complex schedules and fostering client relationships. Her passion for wine led her to assist a Cellarmaster, where she gained intimate knowledge of winemaking processes and the intricacies of vineyard operations. With a strategic approach and a commitment to excellence, Katlin continuously seeks to optimize processes and enhance team collaboration. Contact Katlin Kevin Graham Kevin joined the Halpern team in 2014 - working as an in-store sales representative throughout the GTA West and Southwestern Ontario. During his time studying Marketing Management at the University of Guelph, Kevin gained an interest in wine and an appreciation for it's ability to bring people together. He expanded on that interest while traveling through Argentina and Chile in 2007. Kevin moved to Toronto in 2008 to pursue other passions - namely music and photography - before working in fine dining and ultimately, in wine. In his spare time, he enjoys hockey and golf, playing and attending concerts, traveling, and visiting his cottage in Eastern Ontario. Contact Kevin Martin Lerman A love of wine and collecting turned into a passion. After a successful career in retail sales with his own business catering to consumers across Canada, Martin's next career involved IT which focused primarily on Enterprise level organizations The years of working with clients has enhanced his skills interpreting customer needs and tailoring their individual needs to our extensive portfolio. Over 10 years in the wine industry has allowed Martin to understand client needs and to achieve those objectives. Contact Martin Matt Woo Matt has over 20 years of experience in the Service industry including 8 years at Angus Glen Golf Club, 5 years at The Drake Hotel, and another 5 years at Rodney’s Oyster House. He began taking wine courses in 2015 as a hobby, but it quickly sparked a new passion that has seen him travel to many of the world’s greatest wine making regions such as Burgundy, Tuscany, and Champagne. He has most recently completed the IWEG’s Italian Wine Scholar program, earning top marks in his class. Matt’s dedication to service and the guest experience translate seamlessly to his role as both Brand Manager for our Californian, Japanese, and Canadian producers, as well as a sales rep for private and on-premise accounts. Contact Matt Mika Giroux Mika Joined the sales team at Halpern at the end of 2019 with an added focus on events. Having grown up around the restaurant industry, a career in hospitality was a natural progression. After studying French Literature at the University of Toronto, Mika worked for various restaurant groups such as Oliver & Bonacini and Maple Leafs Sports and Entertainment as a Sommelier in the Platinum Club. Looking to focus solely on wine, Mika transitioned to the agency side in 2017 learning the ins and outs of the world of wine taking on a variety of roles such as marketing, sales, and logistics. Contact Mika Paul Koster Coming from a background in food and beverage divisions while working in the hotel industry, Paul joined Halpern as a Sales Representative in 2008. Since that time, Paul's role has increased to include being the Italian Brand Manager representing over 30 prestigious producers. A certified sommelier through CAPS and the Court of Master Sommeliers, Paul has been fortunate enough to help build some of the best wine cellars in the Toronto region and to offer insight into wines worthy of your time and exploration. On several evenings, he can be found enjoying a glass of something delicious with his roommate and 4 legged friend \"London Fog\". Contact Paul Randy Ostlund Randy joined Halpern after spending 25+ years in management of Fine Dining restaurants in Toronto. Years of heightening the dining experience, building relationships and talking wine with guests are all key aspects that helped with the transition into the role of private client wine sales. He gained his Sommelier certification in 2001 through the International Sommelier Guild and was in charge of curating and expanding the wine lists in the places he worked. Delving into the world of wine has allowed him to travel to many of the wine producing regions on the globe.  Randy lives outside of the city with his wife and 2 daughters and can be found enjoying a glass of red by the bonfire. Contact Randy Sheena Neel From her first glass of Burgundy in 2001, while studying abroad in France, her passion for wine was ignited. Sheena has spent 2 decades cultivating her passion for travel, cuisine and fine wines. Sheena is working towards completing her Master Sommelier with the Court of Master Sommelier's. When not sampling wine, Sheena, a University of Ottawa graduate, spends her time with her two beautiful Huskies; Loki and Aku. She is a passionate connoisseur of all things elegant and refined but equally values the simple things in life. À ta santé! Contact Sheena Sheila Flaherty The former Mercatto Wine Director and Momofuku sommelier has always been marked by her entertaining and accessible approach to wine. Focused on learning all aspects of the industry, she left the restaurant world to head up sales and marketing for Niagara winery Pearl Morissette. Following that she spent time selling for Norman Hardie in Prince Edward County. In January 2013, she took the role of brand ambassador for the iconic Maison Louis Jadot with Halpern Enterprises. Today, she heads the European Wine Division of Halpern Wine, and is one of Toronto’s authorities on Burgundy wines. Contact Sheila Stefanie Smagala Stefanie spent 10 years in education, teaching in both Canada and the UK, before finally giving in to her love of great wine and delicious food. Now, she brings that passion to Halpern, where she helps run the logistics team and adds a creative flair to our social media with engaging photos and videos. Whether behind the scenes or behind the camera, Stef is all about sharing the joy of wine with a dash of fun and flair! Contact Stefanie Téla Giroux Téla joined Halpern in 2021 as Warehouse Coordinator, bringing with her a background in the fast-paced Film and Television industry, where she developed a sharp eye for detail and the ability to adapt quickly. Since then, she has transitioned into her current role as Website Manager and Inventory Manager, combining her organizational skills with a growing expertise in the wine world. When she’s not managing online content or overseeing inventory, Téla enjoys expanding her wine knowledge alongside her colleagues and exploring all the nuances of the industry. Contact Téla Tommy Kelly Born and raised in one of the country’s hospitality centres - Stratford, Ontario-Tommy rose to managing top restaurants at a very young age. Having moved to Toronto and graduating with a Bachelor of Commerce from Ryerson University, Tommy moved back into the world of fine wine and began his now illustrious career in the importation and distribution of fine wines firstly through Trialto Wine Group, followed by a partnership at Brix + Mortar Wine Co. Today, Tommy sits on the Executive Board for the Ryerson Hospitality Alumni Association, is Chairperson of that boards’ Engagement committee and while regularly educating and lecturing at the university, and has taken on the role of director of the New World Wine Division of fine wine importers, Halpern Enterprises. Contact Tommy Will Larkin Will joined the Halpern team in 2023 after spending the greater part of the past two decades within the world of hospitality. His time in the industry began in the dish pit & led to senior management & partner roles in some of Ottawa and Toronto’s top establishments. Yet the inevitable path leaned more towards wine and spirits. Two vintages as a cellar hand in Prince Edward County, WSET 2 and WSET 3 certifications & an MBA focusing on wine marketing and management reinforced that direction.Willis exuberant about travel & has spent years working in wine abroad in New Zealand, in France & most recently in Vietnam as a Key Account Manager with Celliers d’Asie representing Louis Jadot & Vega Sicilia no less.Will’s dedication to his craft and to the experiential aspects of wine translate wonderfully to his role as both Brand Manager within the Old World division of Halpern Wine & as a Sales Representative for private and on-premise accounts. Dog person. Contact Will Violet Skuce Coming from the world of luxury hospitality, Violet has always loved great wine, food and travelling. Having spent time studying in France, Vancouver and New York, she became WSET 1 & 2 certified in 2016 and became a CMS Certified Sommelier in 2018. Her love of wine & travel brought her to the 5 Star Pacific Rim Hotel in Vancouver, followed by the Four Seasons Hotel Toronto where she worked in various management positions within Daniel Boulud's Cafe Boulud and d|bar. Violet strives to make wine more approachable, and loves to learn about what different people look for in their wine. Violet joined Halpern as a Brand Manager in 2021 with a primary focus on California wineries, but loves wine from around the world! Contact Violet Contact us Name Email Phone number Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Subscribe to be the first to know about special offers, events & more! Enter your email Subscribe Navigate Wines Accessories Offers Brands Halpern Wine Portfolio About Us Contact Us Customer Support Contact Us Privacy Policy Terms & Conditions My Account Get in Touch +1 (416) 593 2662 Email Us Follow Us Instagram Facebook Twitter We Accept American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa © 2025 Halpern Wine Enterprises Website Design by BoundLove Creative Subscribe Enter your email Subscribe \"Close (esc)\" \"Close (esc)\" \"Close (esc)\""
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.ellenswineroom.com/about-ellen/",
      "text": "About Ellen – Ellen's Wine Room Skip to content 407-257-2970 | ellen@ellenswineroom.com HOME EVENTS NEW ARRIVALS PHOTOS ABOUT ELLEN CONTACT Meet ELLEN Debra ELLEN Hartman, who goes by Ellen, always had a fascination with wine and the way in which it was created. Ellen was a vintner in the mid 90’s growing her own grapes and experimenting with different methods of making wine. She has traveled extensively in Europe, the Middle East and Africa, but especially in France, Italy and Germany. She has dined in some of the most prestigious restaurants in Europe…always sampling the wines of the region. In her grandfathers village In the mountains of Greece, she witnessed her relatives making their special wines. Ellen appreciates the knowledge and expertise that it takes to create that special bottle of wine. Be connected Join Ellen’s Wine Room Newsletter for Upcoming Events, Specials and Featured Wines Email * Get In Touch! 440 S. Sanford Avenue Sanford, FL 32771 407-257-2970 ellen@ellenswineroom.com Good Wine, Better Friends Hours Tuesday - Saturday 4:00pm-10:00pm+ or by Appointment © 2025 Ellen's Wine Room. All Rights Reserved. | Designed by Chocolate Dog Media LLC Scroll To Top"
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "text": "Contact Us - Brooks Wine Skip to content See what’s on this month in the Tasting Room! Shop Riesling Pinot Noir Club Exclusives Other Wines Library Wines Brooks Swag Join Visit In the Tasting Room this Month Summer Tours and Special Tastings Brooks University Upcoming Events Private Events Travel with Brooks About Us Artisans in Residency Our Story Our People Our Impact Our Blog Take the Quiz My Account How can we help? We’re always here to answer your questions. Get in touch and one of our team members will get back to you as soon as possible. Customer Care For questions about orders, reservations, or general inquiries, email us at [email protected] and we’ll respond asap. For questions about wine clubs and shipping, get in touch with [email protected] or [email protected] . Trade & Media Looking for technical sheets and approved assets? You’ll find everything you need in our Brooks Tech Sheet folder . Partnerships Brands, influencers, and ambassadors wanting more information on partnering with Brooks, please reach out directly at [email protected] . Or, complete our form and we will respond by email shortly Skip Footer Visit Brooks Open daily 11:00 a.m. to 5:00 p.m. 21101 SE Cherry Blossom Lane Amity, OR 97101 Phone: (503) 435-1278 Email: [email protected] In the Tasting Room Book a Table Wine Tastings This Month Spring Tours and Special Tastings Upcoming Events Brooks Recipes Shop our wine All Wines All Red Wines All White Wines Find your perfect wine Wine Clubs Distributors Get to know us About Us Our Impact American Wine Story Strange Inheritance Jimi’s Legacy Series Our Blog Get help Contact Us Shipping & Returns Accessibility Statement Facebook Instagram X YouTube © 2025            Brooks Wine Privacy Policy | Terms and Conditions | Site by 5forests ↑ × Search Looking for a specific wine, experience, or story? Looking for a specific wine, experience, or story?"
    },
    {
      "url": "https://www.sanford365.com/day-164-ellens-wine-room/",
      "text": "Ellen's Wine Room - Sanford FL Wine Bar Home About Calendar Blog The Latest Events Food For Kids Arts Businesses Real Estate Guides Subscribe Videos Find a Home Submit Event Advertise Contact Select Page Day 164 – Ellens Wine Room Feb 28, 2014 | 0 Shame on me for not visiting Ellen’s Wine Room much sooner! I had planned on going so many times but somehow it never happened! Well, after tonight I vow to not stay away from Ellen’s Wine Room for too long. It was a rainy evening so that made the already super cozy interior even more cozy! In fact, I don’t think I know of a cozier place in Sanford. It felt like sitting in a friend’s living room while enjoying a glass of wine. On top of that we were also welcomed like old friends. Ellen’s WIne Room is just the right place to have a good long conversation with a friend. Even though I am not typically a wine drinker I enjoyed the wine that was recommended a lot. For all you beer drinkers, there is also beer available! Then there is also Wine Swap Tuesdays, a very popular event every Tuesday evening at Ellen’s Wine Room. You pay for a great dinner (which changes every week) and buy a bottle of wine which you then share with everyone attending. Don’t worry every guest also shares their bottle so you get to sample a lot of great fine wines while enjoying delicious food. Ellen’s Wine Room, 440 S Sanford Ave, Sanford, FL 32771 – (407) 936-1705 I know that Sanford Avenue is currently under construction but please know that ALL businesses are open!! Now is a good time to support them! Share: Previous Day 163 – Weiberfasching Next Day 165 – Red Robin’s Juicy Burger Dinner About The Author Claudia Hi, my name is Claudia! I live, work and play in Sanford, FL. To top it all off,  I am also totally in love with Sanford! My husband Jose and I are Realtors in Sanford, FL and help people realize their dreams of home ownership. We have two sons, Nicolas (2011) and Lukas (2013).\r\nI am originally from Germany, moved here in 2004. In 2008 I started Sanford365.com.\r\nI love everything that says creativity. Design is my passion, no matter if Graphic, Web or Fashion Design - and I am also into photography :) I'm also very social and love to hang out with my family and friends, be it for a kids play date or a fun night out ;) Related Posts Day 100 – Nursery Lights on Upsala December 26, 2013 Day 363 – Fort Mellon Park Sanford FL September 16, 2009 Day 80 – Christmas in the Square December 6, 2013 Day 329 – The Eola Squirrel August 22, 2009 Leave a reply Cancel reply You must be logged in to post a comment. WHAT ARE YOU LOOKING FOR? Search for: Never Miss a Thing! Receive our free weekly newsletter! SUBSCRIBE! YAY, you're in! Can't wait to share everything Sanford with you! Support us by buying a Sanford Illustrative Map Latest Listings Down Payment Assistance available! Readthe latest issue of our partner My Sanford Magazine Subscribe to our Channel Recent Posts How do you Porchfest? Sanford365’s Porchfest Tips & Tidbits! Feb 19, 2025 | Blog , Events , Visit Sanford Sanford Holiday Events and Things to Do Nov 30, 2023 | Blog , Events , Guides NEW YEARS EVE, BRING IN THE 2023 NEW YEAR IN SANFORD! Dec 22, 2022 | Blog , Calendar , Events Neighborhood Tours with Claudia https://www.youtube.com/watch?v=MZhZnUNGnWY Search Sanford365 Search for: Designed by Elegant Themes | Powered by WordPress About Find a Home New Construction Contact Never Miss a Thing in Sanford Join our mailing list to receive our free weekly event preview and news digest. No spam. Ever. Promised! I'm in! Thank you! Just one more step: check your email account now and find the email we just sent you. Click the link inside to activate your subscription!"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "text": "Contact us – The Australian Wine Company Skip to content Pause slideshow Play slideshow Deliveries in The Netherlands and to countries across mainland Europe Deliveries in The Netherlands and to countries across mainland Europe Facebook Instagram LinkedIn Language English English Nederlands Deutsch . . . Site navigation The Australian Wine Company Search Search Search Account 0 Cart . . . Site navigation Close Search Search Home Wines Red Wines Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Australian Chardonnay Australian Semillon and Blends Regions New South Wales Canberra District Hunter Valley South Australia Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Geelong Yarra Valley Beechworth Western Australia Margaret River Great Southern Tasmania Winemakers New South Wales Brokenwood Tyrrells South Australia d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Tolpuddle Dalrymple Vineyards About Us & FAQ's News Search Search Subtotal €0,00 Check out Taxes included. Shipping and discount codes calculated at checkout. Your cart is currently empty. Home Wines Expand submenu Wines View all Red Wines Expand submenu Red Wines View all Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Expand submenu White Wines View all Australian Chardonnay Australian Semillon and Blends Regions Expand submenu Regions View all New South Wales Expand submenu New South Wales View all Canberra District Hunter Valley South Australia Expand submenu South Australia View all Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Expand submenu Victoria View all Geelong Yarra Valley Beechworth Western Australia Expand submenu Western Australia View all Margaret River Great Southern Tasmania Winemakers Expand submenu Winemakers View all New South Wales Expand submenu New South Wales View all Brokenwood Tyrrells South Australia Expand submenu South Australia View all d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Expand submenu Western Australia View all Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria Expand submenu Victoria View all By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Expand submenu Tasmania View all Tolpuddle Dalrymple Vineyards About Us & FAQ's News Want to Know More About Australian Wines? If you would like further information about our wines and how they suit your style of drinking then please get in touch and we'd be happy to help you further in your selection adam@theaustralianwinecompany.com Get in Touch \"Close (esc)\" Are you 18 years or Older? No I'm not Yes I am Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Get in Touch The Australian Wine Company would love to hear your comments, recommendations or if you would like to know more about our wines or just to chat about Australia and the wine industry please get in touch we'd be glad to help out The Australian Wine Company Diependaalse Drift 11, Hilversum 1213CM North Holland, The Netherlands +31 682 4090 61 adam@theaustralianwinecompany.com Customer Service Shipping Policy Refund Policy My account Menu Home Red Wines White Wines Terms of Service Refund policy About Contact us About us Wine Tastings Get in touch +31 682 4090 61 Follow us Facebook Instagram LinkedIn We accept Bancontact iDEAL Klarna Maestro Mastercard PayPal Shop Pay Visa © 2025\n              The Australian Wine Company Privacy Policy Terms of Service Powered by Shopify \"Close (esc)\" Contact us"
    },
    {
      "url": "https://www.ellenswineroom.com/events/",
      "text": "Events – Ellen's Wine Room Skip to content 407-257-2970 | ellen@ellenswineroom.com HOME EVENTS NEW ARRIVALS PHOTOS ABOUT ELLEN CONTACT “Great Wine, Beer & Music... Friends Gather Here” Open: Tuesday - Saturday 4pm- 11pm Ellen’s Wine Room Supports other Sanford Avenue Restaurants & Welcomes ”TAKE OUT” to eat On-Premise: Shantell's Soul Food Wops Hops Brewery Throwbacks Bar & Grill El Zocalo - Mexican Sanford Brewing Company Best Fish & Chicken Wings (Korean) Thursday , Dec 14th. 6:30 pm GRILLED PORK TENDERLOIN w Balsamic Glaze & 5 WINES TBA Au Gratin Potatoes SALAD W VEGGIES APPETIZER & DESSERT ONLY $17 Food PER PERSON 5 Wine Tasting $15 per person RSVP 407-257-2970 RSVP for this Event Thursday Dinner Reservation Your Name * Email * # of People in Your Party * LIMITED TIME - By the Glass! Orin Swift Wines - Machete ( left) Petite Syrah, Syrah and Grenache $15.00 per glass 8 Years in the Desert (right)- Zinfandel, Petite Sirah & Syrah …               (both 15-16% alc) $12.00 per glass RECURRING EVENTS Don't miss out... See you at Ellen's Wine Room Wine Cellar Wednesdays Wine by the Glass $6.00 Buy 1 Bottle 10% off Buy 6 Bottles 15% off Order 12 bottles-20% off Call 407-257-2970 (Even if we do not stock) What’s in the Air Fryer tonight ? CHUCK CULBERTSON on Guitar EVERY FRIDAY & SATURDAY 7:30 pm –  11:30pm + ! Always a Street Party on Sanford Avenue Be connected Join Ellen’s Wine Room Newsletter for Upcoming Events, Specials and Featured Wines Email * Get In Touch! 440 S. Sanford Avenue Sanford, FL 32771 407-257-2970 ellen@ellenswineroom.com Good Wine, Better Friends Hours Tuesday - Saturday 4:00pm-10:00pm+ or by Appointment © 2025 Ellen's Wine Room. All Rights Reserved. | Designed by Chocolate Dog Media LLC Scroll To Top"
    },
    {
      "url": "https://www.ellenswineroom.com/",
      "text": "Ellen's Wine Room – Wine Bar in Sanford Florida Skip to content 407-257-2970 | ellen@ellenswineroom.com HOME EVENTS NEW ARRIVALS PHOTOS ABOUT ELLEN CONTACT BUY THE Bottle or the glass OPEN: TUES -THURS 4:00PM - 9:00PM FRIDAY & SATURDAY 4:00PM -11:00PM OR BY APPOINTMENT 407-257-2970 Welcome to ELLEN'S WINE ROOM in beautiful Historic Downtown Sanford, Florida Join us for exceptional Wines, Fine Beers, friends and fun. Sit in our comfortable big chairs by the Fireplace, at the Granite Bar, around the Barrel Table or outside on our Patio Light appetizers are available WINE TASTING every day Book small parties Let Ellen “special order” ANY wine or beer for you…  and save  $$$ Thursday Sept 11th… 6pm A Coq Au Vin …..is a classic French stew in which chicken is braised slowly in red wine and a little brandy to yield a supremely rich sauce filled with tender meat, crisp bits of bacon, mushrooms and burnished pearl onions. Cheese Appetizer “Coq Au Vin … 🇫🇷” over mashed potatoes Salad , Croissants & Dessert Food Only $25 per person French Wine Tasting $20 RSVP to Ellen 407-257-2970 MEET “ SUZANNA HAKOBYAN “ She was born in ARMENIA our New  SOMMELIER 🍷 🍾 Discuss WINES  & the World  🌍 🇦🇲 GREAT GIFTS 🎁 🎄 Wine Aerators/ Pourers Menagerie $30 each Tuesday - Saturday 4:00pm - 9:00/ 11:00pm Tuesday nights: 6:00pm \"Grapes, Guitar and Games\" We will have a wine tasting/grape comparison. Available to play: Games, Guitar, Bongos, Keyboard Or bring your own 🎸 You are welcome to bring Food in or place an order from adjacent restaurant. Wine by the Glass or the Bottle International  🌍 Wines to Choose Many International BEERS 🍺 Cheese Snacks ! CHARCUTERIE BOARDS You are Welcome to Bring in Food! BEST OF SANFORD “The Best Place to Have a Glass of Wine” Ellen’s Wine Room Musical Evenings FRIDAY  &  SATURDAY CHUCK CULBERTSON … ON GUITAR 🎸 7:00pm - 11:00pm “ WINE CELLAR WEDNESDAYS “ House Wines $9.00….4pm-7pm Buy 1 Bottle- 10% OFF Buy 6 Bottles- 15% OFF Order 12 Bottles- 20% 0FF ( Even if we do not stock it! ) .....Call Ellen ... 407-257-2970 ... Let us help you with Wines 🍷 Be connected Join Ellen’s Wine Room Newsletter for Upcoming Events, Specials and Featured Wines Email * Get In Touch! 440 S. Sanford Avenue Sanford, FL 32771 407-257-2970 ellen@ellenswineroom.com Good Wine, Better Friends Hours Tuesday - Saturday 4:00pm-10:00pm+ or by Appointment © 2025 Ellen's Wine Room. All Rights Reserved. | Designed by Chocolate Dog Media LLC Scroll To Top"
    },
    {
      "url": "https://laurelglen.com/visit/",
      "text": "Best Wine Tasting Experience in Glen Ellen, California - Laurel Glen Vineyard Please ensure Javascript is enabled for purposes of website accessibility Member Login Visit Shop Current Releases Chilled Wines Cabernet (2018+) Library Cabernet (2013-2017) Barrel Select Old & Rare Cabernet (Pre 2012) Large Format Gift Cards Gifts Gift Cards Holiday Gifting Holiday Wine Bundles About The Vineyard Organic Farming Wines Sonoma Mountain Cabernet Small Batch Wines Collector’s Reference Winemaking Our Team Discover Blog Recipes Club Subscription Club Traditional Clubs Member Login Cruise Information Events Best Glen Ellen Wine Tasting Experience Enjoy our intimate, newly redesigned tasting room in the charming village of Glen Ellen, California – 20 minutes North of Sonoma Square and 40 minutes Northwest of downtown Napa. With a distinct rural ambiance, Glen Ellen is unlike anywhere else in the San Francisco Bay Area. Although about an hour from San Francisco, Glen Ellen feels like a world away. We welcome your well-behaved dog to join you, and your children are also welcome to sit with you while you enjoy your tasting. We are open seven days a week from 11 a.m. to 4 p.m. We welcome walk-ins; a quick text will ensure we can accommodate you! (707) 933-9877. We look forward to meeting you! Make a Reservation Wine tasting room address: 13750 Arnold Drive Glen Ellen, CA 95442 Google Map Tasting Experiences Explorer Tastings We invite you to come enjoy one of our curated tastings. Each guest can choose their favorite. Tasting fees are waived with each three-bottle purchase, and as always club member tastings are complimentary. Chilled Wine Tasting Our Chilled Wine Tasting includes 4 limited production white and rosé wines for $30pp . 'Sonoma 200' Wine Tasting To celebrate 200 years of winemaking in Sonoma Valley, this tasting includes two chilled wines and two of our signature Sonoma Mountain Cabernets for $40pp. Collector Wine Tasting The Collectors Tasting starts with a splash of a limited-production chilled wine, followed by three of our signature Sonoma Mountain Cabernet Sauvignon, both current and library vintage, for $50pp. Cellar Selection Tastings These selections offer a deeper dive into Cabernet and must be booked for all guests in the group. Library Wine Tasting Your opportunity to sample a selection of rare, perfectly stored Laurel Glen Vineyard Cabernet Sauvignon vintages chosen from our extensive wine library and spanning at least a decade. We recommend everyone in your party take part for the full experience. Advance reservations are strongly encouraged. Cost is $60pp. Evolution of Cabernet Tasting Premiering in January 2025, Laurel Glen Vineyard is offering a tasting showcasing 30 years of our Estate Cabernet Sauvignon. The tasting consists of 5 wines selected from vintages of the 1990’s, 2000’s and 2010’s and is paired with a selection of complex bites prepared by Chef Fiorella Butron of Allikai in Sonoma as well as a keepsake folder. Cost is $125pp with bites , or $100pp without bites . Wine Tasting Group Reservations Join us for an unforgettable wine tasting experience at our Glen Ellen tasting room. Our intimate setting is ideal for your group to savor a curated selection of our seasonal chilled wines and indulge in our sought-after, exquisite Cabernets. Dive deep into the rich legacy of our organic Sonoma Mountain Vineyard, where every wine tells a story. Whether your party consists of seasoned sommeliers or curious newcomers to the world of wine, we are here to personalize your experience and ensure every guest feels engaged. Tasting fees of $40 per person, which include gratuity and tax, are required to hold the reservation. If something should come up, these fees are refundable up to 5 business days prior to reservation date. Laurel Glen Vineyard Club Members receive 6 tastings complimentary, and their guests enjoy 20% off all wine purchases at the time of the event. ~Seated Group Tasting~ Available to groups of 8-22 (multiple tables) – 90 minutes allotted Tasting experience of five wines, including a library vintage of Estate Cabernet Outside food can be accommodated Your host will plan your wine selections prior to your visit. 10% discount on wine purchases extended to your guests ~Reception Style Tasting~ Available to groups of 24-40 (tasting room will be closed to visitors) – 90 minutes allotted Tasting experience of five wines Outside food can be accommodated. Your host will plan your wine selections prior to your visit. 10% discount on wine purchases extended to your guests Contact us to reserve: Talk/Text(707) 933-9877, concierge@laurelglen.com Delicious wines, lovely space, knowledgable and enjoyable host! ⭐️⭐️⭐️⭐️⭐️ Jill A. – Google Reviews An essential stop for a fun, delicious tasting experience! Don’t miss it! ⭐️⭐️⭐️⭐️⭐️ Cathy Z. – Google Reviews We had a great tasting with seven friends just before Thanksgiving. Everyone at Laurel Glen is so friendly and they share their extensive knowledge of their delicious wines with as much detail as you like. It’s a very nice tasting room too. Looking forward to our next visit. Thanks so much Nick and Rhita! ⭐️⭐️⭐️⭐️⭐️ Richard H. – Google Reviews What a wonderful wine tasting! The wine was so tasty and the service was amazing! Thank you!! ⭐️⭐️⭐️⭐️⭐️ Kate R. – Google Reviews Laurel Glen wine is delicious and the service top notch! My whole family gathered in their cozy tasting room and all left with a new appreciation of this Sonoma County gem. ⭐️⭐️⭐️⭐️⭐️ Wynne B. – Google Reviews There are several elegant little places in Glen Ellen including restaurants, a French bakery and Laurel Glen Vineyard which is an essential stop for wine tasting. Everyone goes for the cabs but the Sauvignon Blanc maybe the best in the USA. ⭐️⭐️⭐️⭐️⭐️ Colin I. – Google Reviews We stopped in after a hike in Jack London Park and were welcomed into a beautiful cool tasting room with several options for a flight of tasting. The Sauvignon Blanc and white blend were delicious and well balanced and the Riesling was excellent. It was nice to find such a good version in Sonoma County. We also really enjoyed the Counterpoint Cabernet Sauvignon which was well balanced with fruit flavors and complexity. We shared stories and learned about the family history of the winery from Rhita who was friendly and knowledgeable about the Sonoma County wine region. I highly recommend a stop here if you are going through Glen Ellen. ⭐️⭐️⭐️⭐️⭐️ Mandy M. – Google Reviews The Laurel Glen Winery, nestled amidst the vine-clad hills, is a Dionysian dreamscape where sanity is optional and hedonism reigns supreme. Nick, the madman behind the tasting bar, poured with the precision of a surgeon and the reckless abandon of a Vegas high roller. Each glass of Sauvignon Blanc was a crisp, citrusy revelation, while the Cabernet Sauvignon hit like a velvet freight train of dark fruit and oak. The Blanc was so good it made me consider buying a vineyard and adopting a pet goat named Sauvignon. By the time we hit the Cab, my taste buds were partying harder than a Hell’s Angel at Sturgis. If you’ve got the guts, follow Nick down the rabbit hole–just don’t blame me when you emerge a wine-soaked lunatic. ⭐️⭐️⭐️⭐️⭐️ Brandon E. – Google Reviews Virtual W ine Tastings Can’t Make it to Our Wine Tasting Room This Time? Book a fun and informative virtual wine tasting. Invite friends, family, clients, or co-workers to your home and let us help you create an entertaining, intimate and informative wine tasting as if you were in Sonoma Valley. What to Expect: Your host will share highlights from the 40 plus year history of our estate and fun facts about the Sonoma Mountain wine growing region. We will also lead your group through a sensory exercise, encouraging people to make aroma and flavor connections with common pantry items. Expect the virtual wine tasting to last about an hour, the same as an actual visit to Laurel Glen. To request a custom virtual wine tasting: Email: wineclub@laurelglen.com Follow Follow Follow Follow Join Our Mailing List Trade Resources Accessibility Terms of Use Privacy Policy Returns & Cancellations © 2024 Laurel Glen Vineyard Join Our Mailing List & Enjoy 10% Off Your First Purchase JOIN NOW ×"
    }
  ]
}