{
  "fuentes": [
    {
      "url": "https://www.etmotorgear.com/collections/emerald-coast-cruisin",
      "email": "top_header2_3450x@2x.png"
    },
    {
      "url": "https://www.mypanhandle.com/news/local-news/bay-county/car-enthusiasts-welcome-back-annual-emerald-coast-cruizin-car-show/",
      "email": "news@wmbb.com"
    },
    {
      "url": "https://cruisintours.com/",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://emeraldmanagementservices.com/contact-us/",
      "email": "info@emeraldmanagementservices.com"
    },
    {
      "url": "https://emeraldcoastcruizin.com/contact-us/",
      "email": "rbprrsh@yahoo.com"
    }
  ],
  "mails": [
    "info@emeraldmanagementservices.com",
    "micah@micahrich.com",
    "news@wmbb.com",
    "rbprrsh@yahoo.com",
    "top_header2_3450x@2x.png"
  ],
  "nombre_sitio": "emeraldcoastcruizin.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.etmotorgear.com/collections/emerald-coast-cruisin",
      "text": "Emerald Coast Cruizin' – ET Motorgear Skip to content Search Car Show Gear T Shirts All T-Shirts Hot Rods Cruisin Triple Crown of Rodding Cruisin' The Coast Pigeon Forge Rod Run Corvette Expo Chevys in the Smokies Emerald Coast Cruizin' Tri-Five Nationals Grand National F-100 Florida Jeep Jam Alloway's Hot Rod Shop Hot Rod Santa Metal Signs Clocks Jackets Work Shirts Hats Posters, Stickers and Pins Hot Rods Cruisin Metal Signs Cruisin' The Coast Shades of the Past Pigeon Forge Rod Run Emerald Coast Cruizin' Corvette Expo Grand National F-100 Tri-Five Nationals Florida Jeep Jam Ponies in the Smokies Blue Suede Cruise Georgia Mtn Moonshine Cruiz-In Alloway's Hot Rod Shop Hot Rods Cruisin 12 inch Garage Signs Triple Crown of Rodding Car Shows 2025 Tour Schedule Triple Crown of Rodding Cruisin' The Coast Pigeon Forge Rod Run Corvette Expo Chevys in the Smokies Emerald Coast Cruizin' Blue Suede Cruise Grand National F-100 Florida Jeep Jam Tri-Five Nationals Ponies in the Smokies Shades of the Past Custom Custom Custom Apparel Custom Automotive Tags, Metal Signs, Dash Plaques & Hats for shows!! 2025 Tour Schedule Contact Contact Us About Us Apparel Catalog Account Site navigation Search Search Cart Menu Site navigation Car Show Gear Car Show Gear All T Shirts All T-Shirts Hot Rods Cruisin Triple Crown of Rodding Cruisin' The Coast Pigeon Forge Rod Run Corvette Expo Chevys in the Smokies Emerald Coast Cruizin' Tri-Five Nationals Grand National F-100 Florida Jeep Jam Alloway's Hot Rod Shop Hot Rod Santa Metal Signs Clocks Jackets Work Shirts Hats Posters, Stickers and Pins Hot Rods Cruisin 2024 Corvette Expo Main Design Metal Sign Regular price $85 View 2024 Corvette Expo Dark Design Metal Sign Regular price $85 View 2024 Chevys in the Smokies Metal Sign Regular price $85 View Metal Signs Metal Signs All Cruisin' The Coast Shades of the Past Pigeon Forge Rod Run Emerald Coast Cruizin' Corvette Expo Grand National F-100 Tri-Five Nationals Florida Jeep Jam Ponies in the Smokies Blue Suede Cruise Georgia Mtn Moonshine Cruiz-In Alloway's Hot Rod Shop Hot Rods Cruisin 12 inch Garage Signs Triple Crown of Rodding 2023 Tupelo Blue Suede Cruise Metal Sign Regular price $85 View 2023 Spring Pigeon Forge Rod Run Main Design Sign Regular price $85 View Car Shows 2025 Tour Schedule Triple Crown of Rodding Cruisin' The Coast Pigeon Forge Rod Run Corvette Expo Chevys in the Smokies Emerald Coast Cruizin' Blue Suede Cruise Grand National F-100 Florida Jeep Jam Tri-Five Nationals Ponies in the Smokies Shades of the Past Custom Custom Custom Apparel Custom Automotive Tags, Metal Signs, Dash Plaques & Hats for shows!! 2025 Tour Schedule Contact Contact Us About Us Apparel Catalog Account Item added to cart. View cart and check out . Close Close Emerald Coast Cruizin' Filter by All 2024 Cruizin' Dark Design ECC Emerald Coast Emerald Coast Cruizin' Featured Hot Gear Hot Rod Hot Rods Large Metal Signs Main Metal Metal Signs New Official Sort by Featured Best selling Alphabetically, A-Z Alphabetically, Z-A Price, low to high Price, high to low Date, old to new Date, new to old 2024 ECC Spring Martin Bros Custom Design Metal Sign Regular price $85 View 2024 ECC Spring Main Design Metal Sign Regular price $85 View ET Motorgear Search Terms of Service Refund policy Follow us Facebook Twitter Instagram YouTube Contact ET MotorGear Today! ET MOTORGEAR OFFICE: 641 BARBROW LANE KNOXVILLE, TN 37932 865-671-3000 © 2025, ET Motorgear . Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa choosing a selection results in a full page refresh Liquid error (layout/theme line 119): Could not find asset snippets/remove-sold-out.liquid"
    },
    {
      "url": "https://www.mypanhandle.com/news/local-news/bay-county/car-enthusiasts-welcome-back-annual-emerald-coast-cruizin-car-show/",
      "text": "Car enthusiasts welcome back annual Emerald Coast Cruizin Car Show | mypanhandle.com Skip to content mypanhandle.com Panama City 74° WATCH NOW Watch News 13 This Morning with … Sign Up Panama City 74° WATCH NOW Sponsored By Toggle Menu Open Navigation Close Navigation Search Please enter a search term. Primary Menu Watch Now WMBB News 13 Newscasts 13NOW Livestreams Video Headquarters News Local News Regional News Florida News National News Crime News 13 This Morning Entertainment News Black History Month Your Local Election Headquarters Politics from The Hill Automotive News Press Releases E-Mail Newsletters WMBB Mobile Apps Send us video or photos! WMBB AI Policy Top Stories US marks 24th anniversary of 9/11 terror attacks Top Stories The Latest: Trump will mark 9/11 anniversary at the … 5 minutes ago Wewahitchka woman dead after 3-vehicle crash in Gulf … 1 hour ago LIVE: Update on search for Charlie Kirk assassin 25 minutes ago Live Panhandle communities to honor 9/11 victims with … 5 hours ago Weather Interactive VIPIR Radar Today’s Forecast 7 Day Forecast Weather Forecast by County Beach and Boating Forecast Rip Current Safety Red Tide Map Center Weather Alerts Hurricane HQ Hurricane Supply Checklist Tropic Topics Weather Pic of the Day Download the StormTrack13 App Sports All Sports Local Sports NFL Draft Friday Night Fever Friday Night Fever Scoreboard 21 Teams in 21 Days Scholar Athlete Nominate a Scholar Athlete NASCAR Sports Illustrated Top Stories Reigning champions return to the course Video Top Stories Dolphins defeat Seahawks on home-turf 1 day ago Video Bay Tornado hopeful for return after blood clot diagnosis 19 hours ago Video North Bay Haven wears pink for Lani 2 days ago Video Scholar Athlete of the Week – Lauren Davis 3 days ago Video Features 13NOW Digital Desk Class Act Local Flavors Pet Adoption Option Mentor Monday Remarkable Women of the Panhandle Buddy Check Alzheimer’s Awareness The Daily Pledge Community Calendar Cold Case Files BestReviews BestReviews Daily Deals Big Event Contests Pro Football Challenge 2025-26 Car Payments for a YEAR $5,000 Sweepstakes Rock It Lanes Birthday Club Submit Your Pledge Contest Winners Marketplace Epic Discounts Find a Job Post a Job Careers at WMBB | Nexstar About Us Contact Us Meet the Team Meet the Sales Team Advertise with WMBB Our Programming TV Guide Antenna Reception Regional News Partners About BestReviews Search Please enter a search term. Bay County Car enthusiasts welcome back annual Emerald Coast Cruizin Car Show by: Courtney Fegley Posted: Nov 7, 2024 / 04:45 PM CST Updated: Nov 7, 2024 / 10:23 PM CST by: Courtney Fegley Posted: Nov 7, 2024 / 04:45 PM CST Updated: Nov 7, 2024 / 10:23 PM CST SHARE PANAMA CITY BEACH, Fla. ( WMBB ) — Car lovers from across the nation brought their hot rides to Panama City Beach for the annual fall Emerald Coast Cruizin Car Show. From antique Cadillacs to souped-up Lamborghinis, each vehicle is sure to impress. Gulf County Correctional Institution plans on re-opening it’s sister unit “We’ve got tons of classic cars, new cars, any kind of car you want. We’ve got anything from a Lamborghini to a Volkswagen, lots of vendors, food vendors, car vendors,” event organizer Terry Poore said. Event organizers say the car show is one of the best in the south. Its wide variety of cars keeps enthusiasts coming back for more. “You’ve got Fords, you’ve got Chevrolets, you’ve got everything that you can imagine out here. They just like to see what people are bringing. Behind us, we’ve got an Auburn and a Ford Coupe Saturn right here behind us,” Poore said. Event attendees say it’s fascinating to see the hard work and detail each car owner puts into their vehicles. “I like to go around and see the cars and see the uniqueness of them. A lot of people put a lot of time and detail into things that people don’t recognize. They see a paint job and fancy tires and that’s it. But if you look, there’s a lot of hours in probably each and every one of these cars out here being built,” event attendee Rick Sasser said. And they’re excited to see what the rest of this week’s car show brings. 33 bags of cocaine and $4K found following traffic stop in Calhoun County “I like the entertainment and just milling around, looking at cars, and talking to people,” event attendee Vonnie Kirker said. TV personality Cristy Lee and syndicated radio talk show host Sam Memmolo will be holding meet-and-greets this weekend and signing autographs. Single-day admission is $20, a 3-day pass is $50. Copyright 2025 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. ✕ Read next > Read next > Next ✕ ✕ Read next > Next story in Cancel Read next > Next story in Cancel Top Stories LIVE: Update on search for Charlie Kirk assassin Jamaican Lake residents and Bay County officials … Marching band program returns to the Franklin County … PCFD partners with Ellie’s Boxes to help families … DC ‘sandwich guy’ pleads not guilty to misdemeanor … Top Stories More Stories US marks 24th anniversary of 9/11 terror attacks The Latest: Trump will mark 9/11 anniversary at the … Wewahitchka woman dead after 3-vehicle crash in Gulf … LIVE: Update on search for Charlie Kirk assassin Panhandle communities to honor 9/11 victims with … Politicians who have experienced violence directly … The Latest: Conservative activist Charlie Kirk is … Jamaican Lake residents and Bay County officials … More Stories mypanhandle.com Video Jamaican Lake residents and Bay County officials … 9 hours ago Bay District Schools gets ahead of the game with … 10 hours ago Marching band program returns to the Franklin County … 9 hours ago PCFD partners with Ellie’s Boxes to help families … 9 hours ago Body cam footage released of deputy involved shooting 13 hours ago Apalachicola selects Chuck Anderson as city manager; … 9 hours ago Officials break ground on Costera Residencies, new … 14 hours ago New building to be constructed at the MERE Project 14 hours ago Demolition starts at Ascension Sacred Heart Bay 14 hours ago Wellness Wednesday: Foods to lower cholesterol 21 hours ago Powerball Fast Facts 2 years ago Lynn Haven officials approve tentative millage rate … 1 day ago More Videos Bay County News Panhandle communities to honor 9/11 victims with … Local News / 5 hours ago Jamaican Lake residents and Bay County officials … Bay County / 5 hours ago Bay District Schools gets ahead of the game with … News / 5 hours ago PCFD partners with Ellie’s Boxes to help families … Bay County / 9 hours ago Body cam footage released of deputy involved shooting Bay County / 5 hours ago Demolition starts at Ascension Sacred Heart Bay Panama City / 14 hours ago Wellness Wednesday: Foods to lower cholesterol Wellness Wednesday / 20 hours ago View All Bay County More from mypanhandle.com Sheetz warns of higher Hershey’s prices: Here’s why Former WMBB reporter crowned 2025 U.S. Scuba Queen Fave 5: Home improvement products worth buying Kayaker explains why he faked his death, fled US FDA sends drugmakers warnings, cease-and-desist orders LEGO’s 2025 Advent calendars are here and always … FL Powerball tickets could still be worth thousands Stephen King reveals his top 10 favorite movies More from mypanhandle.com Trending Stories Wewahitchka woman dead after 3-vehicle crash in Gulf … LIVE: Update on search for Charlie Kirk assassin Body cam footage released of deputy involved shooting Officials break ground on Costera Residencies, new … Nation of Patriots to stop in Port St. Joe during … Latest Forecast Clear and Cool Start to Thursday Morning Weather Forecasts / 45 minutes ago See Latest Forecast BestReviews.com - Top picks to make everyone happy Apple Event 2025: Apple announces new iPhone Air Holiday / 2 days ago Ulta’s 21 Days of Beauty sale is live now Holiday / 3 days ago Amazon’s Halloween storefront is loaded with spooky … Holiday / 4 days ago Walmart’s ‘Flash Deals’ are filled with hidden gems … Holiday / 6 days ago Home Depot’s next viral holiday drop is a 7-foot … Holiday / 6 days ago Balsam Hill’s cult-favorite Halloween countdown calendar … Holiday / 7 days ago View All BestReviews Picks Don't Miss US marks 24th anniversary of 9/11 terror attacks The Latest: Trump will mark 9/11 anniversary at the … Wewahitchka woman dead after 3-vehicle crash in Gulf … LIVE: Update on search for Charlie Kirk assassin Panhandle communities to honor 9/11 victims with … NewsNation Trending Stories Recalls and Consumer Alerts Soap recall expands to 30 products from shampoo to … Politics Manhunt underway for gunman who killed Charlie Kirk 3 minutes ago Missing Officials give update after body of missing Randolph … Politics How Charlie Kirk moment of silence devolved into … Politics Shouting breaks out in House after silent prayer … 9/11 Anniversary Watch live: Trump attends Pentagon’s 9/11 memorial 21 minutes ago Find out how you can watch #PanhandleStrong Contact Us About Us EEO Report FCC Public File CC Certification Get News App Get the iOS app Get the Android app from Google Play Get Weather App Get the iOS Weather app Get the Android Weather app from Google Play Stay Connected Haystack Privacy Policy 04/24/2025 Terms Of Use FCC Applications Public File Assistance Contact The Hill NewsNation BestReviews Content Licensing Nexstar Digital Journalistic Integrity Sitemap Your Privacy Choices © 1998 - 2025 Nexstar Media Inc. | All Rights Reserved. ✕"
    },
    {
      "url": "https://cruisintours.com/",
      "text": "Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Emerald Coast Cruisin Reserve your perfect day today! Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Book Now Reserve your perfect day today! Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Exclusive Sunset, Dolphin and Beach Experiences Book Now About Us Welcome to one of the best kept secrets in the Panama City area! Book your exclusive sunset tour, private dolphin excursion or experience a perfect day at Shell Island along the Emerald Coast of Florida. Our beautiful Grady-White offers a smooth and stable ride and the customizable trip allows you and your guests to maximize their time on the water, like a real islander! Let’s go fishing, snorkeling, shell hunting, sightseeing and experience the local sea life! We can see dolphins, sting rays and manatees to name a few! Want to experience a fun trip to the famous Crab Island sandbar in Destin, FL. Enjoy a beautiful ride across the sparkling Gulf waters on your way to Crab Island where you’ll enjoy swimming and fun activities in this on-the-water hotspot as you soak up the tropical sun! Wanting something truly unique, let’s run the intercoastal down the “Forgotten Coast” and experience old Apalachicola where the seafood industry started over 175 years ago and is thriving today with renowned locally caught seafood. Grab lunch and hit the shops for a once in a lifetime experience! The combinations are endless! Come experience, Panama City Beach, Destin, Apalachicola, and all destinations between! Rates Contact us for a free quote to your once-in-a-lifetime experience! Photo Gallery Contact Us Send us a message with any comments, questions, or scheduling concerns. We will get back to you soon! Emerald Coast Cruisin Get in Touch! Get in Touch! Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Get in Touch! Copyright © 2023 Emerald Coast Cruisin - All Rights Reserved. Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://emeraldmanagementservices.com/contact-us/",
      "text": "Contact Us – Emerald Management Services Skip to content Home Profile About Us Leadership Vision, Mission and Values Services Staffing Consulting Reference Check Inhouse Services HR solutions Community Services Job Seekers Search Assessments Training Resume Making Selection Resources Ability Support Overview Contact Us Menu Contact Us Enquiry Form Come to us and experience our quality services Error: Contact form not found. Contact Us AddressSCO – 145, 146, Madhya Marg, Sector 8C, Chandigarh, 160009 Reach us by Phone: +91-172-5065495 Reach us by Mobile: +91-9876000489 Reach us by Email: info@emeraldmanagementservices.com View Larger Map Looking for world class staffing solutions? Get in touch with us Quick Links Home About Us Leadership Mission & Vision Ability Support Overview Contact Us Companies Staffing Consulting Reference Check Inhouse Services HR solutions Community Services Job Seekers Search Assessments Training Resume Making Selection Reach Us Emerald Management Services SCO 145-146, Madhya Marg, Sector 8C, Chandigarh, 160009 Phone: +91-172-5065495 Mobile: +91-9876000489 Email: info@emeraldmanagementservices.com © Copyright Emerald Management Services, All rights reserved. A SiteOrigin Theme"
    },
    {
      "url": "https://emeraldcoastcruizin.com/contact-us/",
      "text": "Emerald Coast Cruizin': Contact The Car Show Today Connect with us: Home Events Lodging Sponsors Vendors FAQ’s Contact Vehicle Registration Spectator Tickets Menu Home Event Schedule Sponsors Lodging Packages Vendors Frequently Asked Questions Contact Us Vehicle Registration Spectator Tickets March 8-11, 2023 Contact Us Send us a note if you have a question. Contact Us Please feel free to contact us! Just send us an email or give us a call if we can assist you. Flip Flop Promotions, Inc. PO Box 393 Tupelo , MS , 38802 Phone: 662.587.9572 Email: rbprrsh@yahoo.com Spectator Tickets Don’t worry! We’ve got you covered! You can still come stroll the event with access to thousands of Show Cars and Trucks on display, plus enjoy our Vendor Market Midway and Concerts. Admission Only Tickets can be purchased at the Event Spectator Gate for $20 per day (children under 12 are free). Click to Buy Your Tickets Main Event Location Aaron Bessant Park is located at 500 W Park Dr, Panama City Beach, FL 32413. We are just across from Pier Park, just one block away from the beach! This event is positioned on 17 acres of luscious green grass, with side walks, shade trees, park benches, and clean air conditioned restrooms. Emerald Coast Cruizin’ features a center stage to host live music and show awards. Ladies, Pier Park offers over 125 stores for fabulous shopping right next door! You will not want to miss this event! Make plans now for Emerald Coast Cruizin’! Secure offsite trailer parking, please contact Bill Nieland at (360) 789-1260 or billnieland1@gmail.com to register your trailer for the entire event. All money raised from this parking lot is being donated to the Optimist Club benefiting childhood cancer research. More Event Info © Copyright 2023 Emerald Coast Cruizin’ | Website Developed by LAT 30 ° Menu"
    }
  ]
}