{
  "fuentes": [
    {
      "url": "https://emeraldcoastbeerfest.com/food",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/brewers-only",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/pairing-dinner",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/pairing-dinner",
      "email": "nancy@rosies.com"
    },
    {
      "url": "https://www.pnj.com/story/entertainment/play/2024/09/01/things-to-do-in-pensacola-emerald-coast-beer-fest-good-time-regatta/74962802007/",
      "email": "online@pnj.com"
    },
    {
      "url": "https://escambiabayhomebrewers.org/pensacola-fl-breweries",
      "email": "info@ebhb.org"
    },
    {
      "url": "https://pensacolaflorida.com/event/28th-annual-emerald-coast-beer-festival/",
      "email": "register@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/250/boston-ma/boston-beer-company",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/267/pensacola-fl/emerald-republic-brewing-company",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/main-event",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/homebrewclub/221/semmes-al/random-acts-of-brewing",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://www.discover850.com/event/28th-annual-emerald-coast-beer-festival/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.discover850.com/event/28th-annual-emerald-coast-beer-festival/",
      "email": "icons-ffffff@2x.png"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/239/mobile-al/oyster-city-brewing-co",
      "email": "info@emeraldcoastbeerfestival.com"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/222/new-orleans-la/urban-south-brewery",
      "email": "info@emeraldcoastbeerfestival.com"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "chosen-sprite@2x.png",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "icons-ffffff@2x.png",
    "info@ebhb.org",
    "info@emeraldcoastbeerfestival.com",
    "innovationliaison@communityartsmentorship.com",
    "managingdirector@communityartsmentorship.com",
    "nancy@rosies.com",
    "online@pnj.com",
    "programcoordinator@communityartsmentorship.com",
    "register@emeraldcoastbeerfestival.com",
    "sponsorship@communityartsmentorship.com"
  ],
  "nombre_sitio": "emeraldcoastbeerfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://emeraldcoastbeerfest.com/food",
      "text": "Emerald Coast Beer Festival Food Vendors Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App We Got Food Trucks at the Beerfest! Hope you're hungry!  Beer goes well with Festival Eats Home At The Fest Food Vendors Bella Donna Catering Donna Hardin’s culinary career began early on, inspired by her Polish and Italian grandparents and their love and respect for quality and tradition. Her grandfather had a Italian meat market and restaurant, located in the historic neighborhood Ybor CIty in Tampa, Florida. It was populated by thousands of immigrants, mainly from Cuba, Spain, and Italy. Ybor City was and still is ground zero for the famous ‘Cuban’ sandwich the vibrate smells of Cuban, Italian and Spanish culture and food. Lone Star Kitchens 2 Go Serving Fresh Shrimp, Fish, Chicken, Beef, Pulled Pork Quesadillas and Tacos....Loaded with Fresh Ingredients you pick. P'cola Rolla Pensacola's premier Eggroll Food truck specializing in southern style comfort food eggrolls. Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/brewers-only",
      "text": "Brewers. Register your beers here for the festival. Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewers' Registration Welcome Brewers Home Brewers Only Brewers' Login Password login Forgot Your Password? Please inclue your full name and brewery or club in the email. Registration for 2025 is now open. If you did not get an invitation but would like to attend this year, contact us and include the name (POC), phone number, email address, and name/location of brewery or club. Table space is limited and we expect to sell out by mid-August. Brewer Testimonial Derrell Winowich Brewery Owner & Brewmaster Chattahoochee Brewing Company Phenix City, Alabama The first Emerald Coast Beer Festival I ever attended was in 1998 and haven't missed one since. The\n                friendships we've made have reached all over and the Escambia Bay Homebrewers have been great\n                stewards of the event. Imagine beer lovers, homebrewers and professionals alike coming together over\n                one weekend a year at a beautiful beach location to socialize, reminisce and enjoy the fruits of their\n                labors together. The Emerald Coast Beer Festival has become our annual mini vacation, marketing trip and beerfest all rolled\n                into one. Each year we see so many familiar faces and have so many great memories of this event, it's\n                truly hard to explain how much we look forward to it each year. I encourage everyone homebrewer and\n                professional brewery owner to come hang out, make some new friends, grow your brand (even if you\n                don't distribute here), it will be worth the money, and the time spent relaxing is priceless. Contact our Brewer Coordinator Please include brewery/homebrew club name, location, and phone number Brewer Testimonial Derrell Winowich Brewery Owner & Brewmaster Chattahoochee Brewing Company Phenix City, Alabama The first Emerald Coast Beer Festival I ever attended was in 1998 and haven't missed one since. The\n                friendships we've made have reached all over and the Escambia Bay Homebrewers have been great\n                stewards of the event. Imagine beer lovers, homebrewers and professionals alike coming together over\n                one weekend a year at a beautiful beach location to socialize, reminisce and enjoy the fruits of their\n                labors together. The Emerald Coast Beer Festival has become our annual mini vacation, marketing trip and beerfest all rolled\n                into one. Each year we see so many familiar faces and have so many great memories of this event, it's\n                truly hard to explain how much we look forward to it each year. I encourage everyone homebrewer and\n                professional brewery owner to come hang out, make some new friends, grow your brand (even if you\n                don't distribute here), it will be worth the money, and the time spent relaxing is priceless. Contact our Brewer Coordinator Please include brewery/homebrew club name, location, and phone number Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/pairing-dinner",
      "text": "2025 Emerald Coast Beer Festival Pairing Dinner Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Beer Pairing Dinner at Seville Quarter Home At The Fest Beer Pairing Dinner September 4th, 2024 Reception starts at 7pm The annual Emerald Coast Beer Festival kicks off the event with a Beer Pairing Dinner at  7pm, September 4th, 2024.\n\t\t\t\tIn the Beer Pairing Event, a brewery hosting the event will present their beers paired with cruisines from Seville Quarter's Executive Chef Jason Duckworth.\n\t\t\t\tThe brewery host will talk about the characteristics of the beer and how it compliments with the entree.  The event takes place in Seville Quarter's \"Apple Annie's Room\". Reservations are required. For more information, or to secure your space, call (850) 434-6211 , or email nancy@rosies.com . Cost:  $75 plus tax and gratuity Price includes Three course meals Appetizers Desserts Five beer selections Make RSVP Our Event's Host TBA We will find out the next host within a month before the beer fest. Our Pairing Dinner Menu Menu for this year's pairing dinner at Sept. 5th @ 6:30pm TBA Venue Location Seville Quarter - Apple Annie's Room 130 E. Government St., Pensacola, FL 32501 RSVP The Beer Paring event sells out quickly.  This event is first come, first serve. Mention \"2025 Beer Pairing Dinner\" in the \n\t\t\t\t\t\tcontact form subject or when calling to make an RSVP. Make RSVP Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://www.pnj.com/story/entertainment/play/2024/09/01/things-to-do-in-pensacola-emerald-coast-beer-fest-good-time-regatta/74962802007/",
      "text": "Things to do in Pensacola: Emerald Coast Beer Fest; Good Time Regatta News Sports Play Opinion Advertise Obituaries eNewspaper Legals PLAY Things to do in Pensacola: Emerald Coast Beer Fest; Juana Good Time Regatta; Memorial 5K Pensacola News Journal/USA TODAY NETWORK Pensacola News Journal Seven days out is your guide to entertainment events, concerts, festivals and activities in Escambia and Santa Rosa counties. MONDAY Fall Foliage Zipline Tours Sunday, Sept. 1 through Saturday, Nov. 30. Adventures Unlimited, 8974 Tomahawk Landing Road, Milton. Beaches to Woodlands in the fall is a great time to enjoy the many natural attractions at Adventures Unlimited located just north of Milton in the Blackwater River State Forest. Enjoy the changing colors and the rush of excitement while doing one of the Canopy Zipline Tours. Overnight accommodations at the resort’s campsites or cabins are available along with canoeing and kayaking down Coldwater Creek. More info: adventuresunlimited.com . Monday Night Blues 7 p.m. Monday, Sept. 2. Seville Quarter, 130 E. Government St. Seville Quarter and the Blues Society of Northwest Florida are bringing the “blues” back to the Seville Quarter Entertainment District. The event features live blues music and \"BBQ and Bud\" food and drink specials. More info: 850-434-6211 or sevillequarter.com . Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. TUESDAY Ballz Bday Bash 7 p.m. Tuesday, Sept 3. The Handlebar, 319 N. Tarragona St. Ballz Bday Bash will perform live in concert featuring Cancer Christ, The Taints, and Box Cutter. $10 in advance and at the door. More info: thehandlebar850.com . Bands on the Beach 7 p.m. Tuesday, Sept. 3. Gulfside Pavilion at Casino Beach, Pensacola Beach. Bands on the Beach is Pensacola Beach's popular outdoor summer concert series with performers for every musical taste. Featuring a lineup of regional artists, the series delivers an eclectic musical experience throughout the entire summer. This week features Shenanigans. Spectators are encouraged to bring lawn chairs and blankets. Free. More info: 850-932-2257 or visitpensacolabeach.com . Get ready for Foo: Pensacola's Foo Foo Fest has announced 13+ events you can check out this fall WEDNESDAY Shrek the Musical 7:30 p.m. Wednesday and Thursday, Sept. 4 and 5. Saenger Theatre, 118 S. Palafox St. Your favorite ogre is back in the hilarious stage spectacle based on the Oscar-winning, smash hit, DreamWorks animated film. Tony Award-winning duo Jeanine Tesori (music) and David Lindsay-Abaire (book) revisit their first collaboration to deliver a more intimate and engaging experience – a joyful, colorful Shrek that leans into the humanity in all of us that celebrates our differences. For ages 6 and older. Tickets start at $60. More info: 850-595-3880 or pensacolasaenger.com . THURSDAY Backpack Project USA Family Fishing Rodeo Thursday through Saturday, Sept. 5 through 7. Grand Lagoon Yacht Club, 10653 Gulf Beach Highway. The 11th annual Family Fishing Rodeo will feature adults and their children competing in numerous fresh and saltwater fishing categories to win prizes. The open division offers first, second and third place monetary prizes while the junior division offers prizes such as trophies and new fishing poles. Watch children's faces light up as they proudly weigh their catch and watch for their names on the leader board. Participants will also have a chance to enter raffles and bid on silent auction items. More info: backpackprojectusa.com . Bulls On The Beach 6 p.m., doors; 8 p.m., rodeo; Thursday through Saturday, Sept. 5 through 7. Flora-Bama Lounge & Package, 17401 Perdido Key Drive. Bring the family out to experience the ultimate adrenaline rush with three nights of live rodeo action featuring professional bull riders from all around the country. Thursday night will feature kids 12 and younger participating in a coloring contest bike giveaway for both a girl and a boy, followed by professional bull riding. Friday and Saturday night will feature the professionals in the adult bull riding competition. A portion of the proceeds from this event will go to St. Jude Children's Research Hospital. $40 for ages 18 and older; $20 for ages 7 to 17; free for ages 6 and younger. More info: 850-492-0611 or florabama.com . FRIDAY 34th annual Juana Good Time Regatta Friday through Sunday, Sept. 6 through 8. Juana's Pagodas & Sailors' Grill, 1451 Navarre Beach Causeway. The Juana Good Time Regatta is designed for both experienced and novice racers, with the main emphasis being a “Good Time.” It is open to all sizes of multihull sailboats, from beach cats and trimarans to cruisers. The regatta will be held over three days and includes parties, food and live music. The event starts with The Wish for Wind Party (packet pick up) from 6 to 8 p.m. Friday. The sailboat races are Saturday and Sunday from 11 a.m. to 3 or 4 p.m., depending upon the wind. More info: juanaspagodas.com . Emerald Coast Beer Festival 5:30 p.m. Friday, Sept. 6. Seville Quarter, 130 E. Government St. Pensacola's largest and oldest craft beer tasting event will feature breweries all around the Gulf Coast area, including 50-plus microbreweries and another 50 to 100 represented by their distributors. In addition to the microbreweries, there will be 10-plus homebrew clubs providing beer. The festival will also feature live music, food trucks, and a variety of other activities. This is the perfect opportunity to sample some of the best beers from the Emerald Coast and beyond. VIP admission gets early access at 5 p.m. More info: emeraldcoastbeerfest.com . Bands on the Blackwater 7 p.m. Friday, Sept. 6. Jernigan’s Landing, 5154 Willing St., Milton. Come by boat or bring a lawn chair and join friends and neighbors for the best live music on the Gulf Coast at the award winning, family-friendly Bands on the Blackwater concerts. The series offers a variety of music. This week features Six Piece Suits. Free. More info: 850-983-5400 or facebook.com/BandsOnTheBlackwater . Laura Jane Grace & the Mississippi Medics 7 p.m. Friday, Sept. 6. The Handlebar, 319 N. Tarragona St. Laura Jane Grace & the Mississippi Medica will perform live in concert with Catbite and Taylor Hollingsworth. $25 in advance; $30 at the door. More info: thehandlebar850.com . Satisfy your taste buds: Longtime Pensacola chef buys Milton's Cosse's Corner Shack. Here's what's on the new menu SATURDAY The Wingman Foundation Pensacola Memorial 5K 7:30 a.m. Saturday, Sept. 7. Seville Quarter, 130 E. Government St. The Wingman Foundation’s Memorial 5K and 1 Mile Fun Run will be in honor and remembrance of brave fallen Naval and Marine Corps air warriors. The event will take place in historic downtown Pensacola, beginning and ending at Seville Quarter. Runners and walkers also have a virtual registration option, so they can participate from anywhere. More info: wingmanfoundation.org . Vegan BrewFest Pensacola Noon Saturday, Sept. 7. Perfect Plain Brewing Co., 50 E. Garden St. Get ready for a day of plant-powered perfection at the Vegan BrewFest Pensacola, a family-friendly celebration of all things vegan. Indulge in vegan food by exploring a delectable array of vegan delights that will tantalize your taste buds and showcase the best in plant-based cuisine. More info: perfectplain.com . Dinner Detective Murder Mystery Dinner Show 6 p.m. Saturday, Sept. 7. Hilton Garden Inn Pensacola Downtown, 8 S. Ninth Ave. America’s largest interactive comedy murder mystery dinner theatre show is now playing. Solve a mystery while feasting on dinner. Just beware, the culprit is hiding in plain sight somewhere in the room, and you may find yourself as a prime suspect before you know it. This event differs from a traditional murder mystery dinner show. The actors are not dressed in costume and are hidden in the audience. This results in a fun, social and interactive evening suitable for all adults. More info: thedinnerdetective.com . In A Nutshell - Tribute To Alice In Chains 7 p.m., doors; 8 p.m., show; Saturday, Sept. 7. Vinyl Music Hall, 2 S. Palafox St. In A Nutshell will perform a tribute to Alice In Chains, who rose to international fame as part of the grunge movement of the early 1990s, along with other Seattle bands such as Nirvana, Pearl Jam, and Soundgarden. They achieved success during the era with the albums Facelift (1990), Dirt (1992) and Alice in Chains (1995), as well as the EP Jar of Flies (1994). $20. For all ages. More info and ticket purchase: vinylmusichall.com . Tay Tay Dance Party With DJ Swiftie 7:30 p.m. Saturday, Sept. 7. Saenger Theatre, 118 S. Palafox St. The Tay Tay Dance Party brings the ultimate “T-Swift” laser dance party to the Saenger. The event is a popular themed dance party hosted by DJ Swiftie and comes crafted around everyone’s favorite Taylor songs. This show is Taylor-made for the ultimate fan. Fans can immerse themselves in Tay Tay’s music, provided by DJ Swiftie, while surrounded by synchronized lasers and lights. Tickets start at $29. More info: 850-595-3880 or pensacolasaenger.com . SUNDAY Emerald Coast Health & Beauty Expo 11 a.m. Sunday and Monday, Sept. 8 and 9. Pensacola Bay Center, 201 E. Gregory St. Discover the ultimate destination for health and beauty professionals at the Emerald Coast Health & Beauty Expo. This event draws thousands of professionals from across the nation, offering a unique platform for networking, education, and growth. The expo isn’t just about showcasing the latest trends; it’s a celebration of empowerment and education among the entrepreneurs of the industry. Attendees will gain skills, insights, and resources that will transform their approach to health and beauty. More info and ticket details: 850-432-0800 or pensacolabaycenter.com . Birds and Brew 5 p.m. Sunday, Sept. 8. Big Lagoon State Park, 12301 Gulf Beach Highway. Participants will begin the evening at Big Lagoon State Park, where they'll explore the boardwalk, lagoon, and intercoastal waterway. The walk is less than one-mile round trip and handicap accessible. Participants will then relocate to Gary's Brewery & Biergarten, 208 Newman Ave., 3403 Gulf Beach Highway, for drinks and social time. Food trucks are often on site. More info: fmwaudubon.org . Never miss a story: Subscribe to the Pensacola News Journal using the link at the bottom of the page under Stay Connected. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://escambiabayhomebrewers.org/pensacola-fl-breweries",
      "text": "Breweries in Pensacola, FL with Most Popular Craft Beer List Brew it, Drink it! Join EBHB Menu Calendar Event Calendar Style of the Month Past Events Board Meeting Minutes Info Event Signup FAQ Pensacola Breweries Pensacola Craft Beers News Newsletters About Our Mission Photo Gallery Winos Emerald Coast Beerfest Club Officers Bylaws Brewing Resources Brewer Marketplace Homebrew Supply Shops Beer Style Guidelines Resourceful Links Home > Pensacola, FL Breweries Breweries in Pensacola 12 Breweries Listed According to Pensacola News Journal ,\n\t\t\t\t\t\tPensacola, Florida ranked No. 9 in the country in breweries per capita.\n\t\t\t\t\t\tSupport your local breweries and order a couple of pints of craft beer. Use our Map View to find breweries around your location. If you enjoy drinking quality craft brews at your local brewery, join EBHB to learn the art of beer making at home. Cheers! List View Map View What are the best craft beers in Pensacola? Here's what the the local craft beer enthusiasts are drinking at the local brewery. List is based on popularity, number times ordered, \n\t\t\t\t\tand updated monthy. Beers are sorted from most popular per brewery with the first one being the most popular. Call your local brewery first if \n\t\t\t\t\tthe beer is still on tap. Click the \"View Complete List\" to see all beers served at that brewery location with photos, reviews, and brewery description. A Little Madness Brewing Company Pensacola, FL 4.7 Most Popular Beers View Complete List Alga Beer Company Pensacola, FL 5 Most Popular Beers Lo-Fi IPA - New England / Hazy 6.2% ABV ▪ 34 IBU Welcome To Solitude Lager - Dark 5.4% ABV ▪ 28 IBU East Hillsner Lager - American 5.4% ABV ▪ 28 IBU Possum Kingdom IPA - American 7% ABV ▪ N/A IBU Neighborhood Beer Farmhouse Ale - Saison 5.9% ABV ▪ 30 IBU View Complete List Coastal County Brewing Pensacola, FL 4.8 Most Popular Beers Super Sundrop IPA - New England / Hazy 6.5% ABV ▪ N/A IBU Hazy Decisions IPA - Imperial / Double Milkshake 7.5% ABV ▪ N/A IBU Sea Fox IPA IPA - American 7.5% ABV ▪ N/A IBU Fred's Red Red Ale - Irish 6.7% ABV ▪ N/A IBU Island Hopper Pale Ale - American 5.2% ABV ▪ N/A IBU View Complete List Doc's Hop Shop Pensacola, FL 4.6 Most Popular Beers Blonde Ale Blonde Ale 4.9% abv ▪ 16 ibu Blood Orange Sunset Ale Fruit Beer 5% abv ▪ 14 ibu Tropical Cyclone (Mango/ Passion fruit) Sour - Fruited 6.8% abv ▪ n/a ibu Amber Ale American Amber 5.5% abv ▪ 32 ibu Shark Bite IPA IPA - American 6.5 % abv ▪ 72 ibu View Complete List Emerald Republic Brewing Pensacola, FL 4.9 Most Popular Beers 10 Wraiths IPA - New England / Hazy 6.1% ABV ▪ 40 IBU Gozen Sour - Fruited 4.8% ABV ▪ 5 IBU For One Perfect Moment Wheat Beer - Hefeweizen 5.2% ABV ▪ 15 IBU Brittle Is the Bone Brown Ale - American 5.9% ABV ▪ 27 IBU Luminescent Shores Lager - American 4.2% ABV ▪ N/A IBU View Complete List Gary's Homebrew Supply Pensacola, FL 4.8 Most Popular Beers View Complete List Goat Lips Chew & Brew House Pensacola, FL 4.7 Most Popular Beers Raiders of the Last Hops Red Ale - Imperial / Double 7.5% ABV ▪ 62 IBU Jalapeno Cream Ale Cream Ale 5.5% ABV ▪ 14 IBU Blackwater Brown Brown Ale - American 8% ABV ▪ 35 IBU Sweet Potato Ale Spiced / Herbed Beer 8.1% ABV ▪ 14 IBU Big Easy Coffee Stout Stout - Other 6% ABV ▪ 35 IBU View Complete List McGuire's Irish Pub Pensacola, FL 4.7 Most Popular Beers Irish Red Ale Red Ale - Irish 5% ABV ▪ N/A IBU Irish Pale Ale (IPA) Pale Ale - English 6.5% ABV ▪ N/A IBU McGuire's Irish Stout Stout - Irish Dry 5.4% ABV ▪ N/A IBU McGuire's Porter Porter - Other 6% ABV ▪ N/A IBU Mcguire's Old Fashioned Ale Pale Ale - American 4.2% ABV ▪ N/A IBU View Complete List Odd Colony Brewing Company Pensacola, FL 4.9 Most Popular Beers Barren Lands IPA - New England / Hazy 7% ABV ▪ 45 IBU Moonbeam Lager - Dark 5.2% ABV ▪ 27 IBU Bone Harvest Lager - American 4.2% ABV ▪ 15 IBU The Basement Grapes Farmhouse Ale - Saison 6.4% ABV ▪ 23 IBU Campfire Noir Stout - American 7.5% ABV ▪ 32 IBU View Complete List Pensacola Bay Brewery Pensacola, FL 4.7 Most Popular Beers Riptide Red Ale - American Amber / Red 5.4% ABV ▪ 40 IBU Li'l Napoleon IPA IPA - American 6.7% ABV ▪ 70 IBU Lighthouse Porter Porter - American 6.1% ABV ▪ 45 IBU Treasure Grove Pale Ale - American 4.7% ABV ▪ 34 IBU DeSoto Sour - Fruited Berliner Weisse 3.4% ABV ▪ 6 IBU View Complete List Perfect Plain Brewing Co. Pensacola, FL 4.6 Most Popular Beers Citra Spin IPA - New England / Hazy 6.5% ABV ▪ N/A IBU Coco Gnar Stout - Milk / Sweet 6.7% ABV ▪ 20 IBU Yachtside Lager - American 4.5% ABV ▪ N/A IBU Pensacola POG Sour - Fruited Gose 4.2% ABV ▪ N/A IBU Buzzer Beater Sour - Fruited Berliner Weisse 5.8% ABV ▪ 5 IBU View Complete List The 5 Barrel Pensacola, FL 4.9 Most Popular Beers 4G High Gravity IPA - Quadruple 18% ABV ▪ 120 IBU Black Jack Ipa IPA - American 5.4% ABV ▪ 60 IBU Tommy Gun Cream Ale Cream Ale 4.3% ABV ▪ 16 IBU 15 Ton Stout - Oatmeal 5.7% ABV ▪ 25 IBU Shillelagh Irish Red Red Ale - Irish 4.6% ABV ▪ N/A IBU View Complete List Find Breweries outside of Pensacola Share this Page Brewery Ratings are from Google Places Community and not from Escambia Bay Homebrewers View ALL Pensacola Craft Beers Emerald Coast Beer Festival is the longest running beer festival in Pensacola, FL! \n\t\t\tWe have over 50 brewers and over 200 beers to sample. See Our Fest Thank You Pensacola Florida Breweries! Emerald Coast Beer Festival would not exsist without their support and Pensacola locals that appreciate locally crafted beer.\n\t\t\t\t\t\tIf you are a Brewer, Brewery Owner, or Homebrew Club and want to particpate in the next beer festival attended by over 2500 attendees, \n\t\t\t\t\t\tyou should contact us! Contact Fest Organizers Is the Pensacola Brewery List Up-to-Date? We want to keep our brewery list as accurate as possible.  If a new brewery opened or closed, please let us know.\n\t\t\t\t\t\tYou can send updates to info@ebhb.org .  Include any pictures, logos, social media links, and brewery website in the email. Brewers... Would you like to host an EBH Club Meeting? Our club buys all their members 1 complementary beer and we usually buy a couple beers after that. We also support and promote local breweries through the \n\t\t\t\t\t\tbiggest Beerfest in Pensacola: Emerald Coast Beer Festival . We would like to hear from you and help promote your brewery \n\t\t\t\t\t\tthrough our Beerfest. Contact us at info@ebhb.org . Interested in joining the club? Learn to Homebrew. It's Legal! Join EBHB Check our Facebook Page Subscribe and network with other members! Join Facebook Love Craft Beer? Sign up with your email and name to receive news, upcoming events, and updates. Sign Up Quick Links Join Club Our Mission Calendar FAQ Club Photos Brewer Marketplace Winos Club Pensacola Breweries Home Brew Supply Shops Emerald Coast Beer Fest Email us at info@ebhb.org Membership Information: +1-850-384-6415 Brew it, Drink it! By using our website, you agree to our Privacy Policy and our cookies usage. ©2025 Copyright:\n\t\t\tEscambia Bay Homebrewers"
    },
    {
      "url": "https://pensacolaflorida.com/event/28th-annual-emerald-coast-beer-festival/",
      "text": "28th Annual Emerald Coast Beer Festival - PensacolaFlorida.com Skip to content Have You Signed Up For Your Free Business Listing? Signing Up Takes Less Than 1 Minutes And It Is Totally Free! Click Here To Create Your Free Business Listing Home Businesses Events Guides PensacolaFlorida.com Blog Hurricane Info eCards Anniversary Baby Birthday Bridal Congratulations Everyday Get Well Soon Miz Thangs Art Pensacola Bill Art Serena Woody Art Sympathy Thanks – Send a Free Ecard Contact Us Sign Up For A Free Business Listing Log In Click Here To Read The Article Layers and Layers The Ephemeral Beauty of the Graffiti Bridge Click Here To Find Your Guide Click Here And We'll Give You Everything You Need To Know! Want To Scuba Dive? Not Sure Where To Start? « All Events This event has passed. 28th Annual Emerald Coast Beer Festival September 5, 2024 @ 5:30 pm - September 6, 2024 @ 8:30 pm « Bulls on the Beach Rolling By The Bay » The Escambia Bay Homebrewers and Seville Quarter are once again hosting the 28th Annual Emerald Coast Beer Festival September 5-6. The longest running beer festival on the Gulf Coast, the festival kicks off on Thursday, September 5, starting at 7 p.m. at Seville Quarter (Tarragona North Parking Lot, 176 E Government Street in Pensacola) with a five-course beer pairing dinner featuring handcrafted beers. To make a reservation, call Seville Quarter at (850) 434-6211. Friday, September 6, the festival kicks into full gear from 5:30-8:30 p.m. with beer samples featuring micro brewed beverages from more than 45 breweries from throughout the U.S. highlighting the Southeast and Gulf Coast region. Additionally, there will be over a dozen regional homebrew clubs as well as the major regional beer distributors. You will be able to purchase food from food truck vendors on-site and live music will be played on several stages. Festival general admission tickets are $30.00 in advance from an Escambia Bay Homebrew club member. You can purchase tickets online from the Festival’s website for $35.00 in advance as well as the following outlets in Pensacola: Gary’s Homebrew Supply, Doc’s Hop Shop, Pensacola Bay Brewery, Seville Quarter, Ye Olde Brothers Brewery, and St. Michael’s Brewing Company in Navarre, FL. General Admission tickets are $40 the day of the event starting on July 1, 2024. VIP tickets are limited to 250 and can only be purchased in advance for $75 from an Escambia Bay Homebrewers Club Member, $80 online, or from a local retail outlet. VIP ticket holders receive early entry into the VIP room at 5 p.m. where they can enjoy complimentary hot hors d’oeuvres, and special exclusive hand-crafted beers. All ticket holders receive a souvenir festival beer tasting glass. Proceeds from the 2024 Emerald Coast Beer Festival ticket sales benefit Seville Rotary and the Alfred-Washburn Center. For details visit. If you are a brewery or homebrew club and would like to participate at this year’s beer festival, contact us soon as spaces are limited. Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Start: September 5, 2024 @ 5:30 pm End: September 6, 2024 @ 8:30 pm Website: https://www.emeraldcoastconnected.com/event/28th-annual-emerald-coast-beer-festival.html Venue Seville Quarter 130 E. Government St. Pensacola , FL United States + Google Map « Bulls on the Beach Rolling By The Bay » Pensacola, FL You’ve found your beach! Pensacola, FL is home to some of the most amazing beaches in the world. We host millions of visitors each year and we’re looking forward to your visit too! We hope you find everything you need while here. If not, please let us know so we can make your experience perfect. Relax, chill, and make some memories! Follow Us! Sign Up For Our Newsletter! Newsletter Signup Name * Name First First Last Last Email * By submitting this form, you are consenting to receive marketing emails from PensacolaFlorida.com. You can revoke your consent to receive emails at any time by using the SafeUnsubscribe® link, found at the bottom of every email. Emails are serviced by Constant Contact. If you are human, leave this field blank. Sign Up For The Newsletter! © 2000–2021 PensacolaFlorida.com . All rights reserved Have You Signed Up For Your Free Business Listing? Signing Up Takes Less Than 1 Minute & It’s Totally Free Click Here To Create Your Free Business Listing ×"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/250/boston-ma/boston-beer-company",
      "text": "Boston Beer Company Registered for the 2023 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewery Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2023 Emerald Coast Beer Fest Registration Boston Beer Company Brewery                        in Boston, MA Website, Social Links, and Location The Boston Beer Company began in 1984 with a generations-old family recipe that Founder and Brewer Jim Koch uncovered in his father’s attic and brought to life in his kitchen. That beer was aptly named Samuel Adams Boston Lager, in recognition of one of our nation's great founding fathers, a man of independent mind and spirit. Little did Jim know at the time, Samuel Adams Boston Lager would soon become a catalyst of the American craft beer revolution.\n\nIn 2019, Boston Beer & Dogfish Head joined forces, bringing together each company's unrelenting passion for brewing, passion, and innovation.  Today, at Boston Beer, we brew more than 60 styles of beer. We relentlessly pursue the development of new styles and the perfection of classic beers by searching the world for the finest ingredients. We remain focused on brewing quality beer and challenging drinkers’ perceptions of what beer can be through the use of innovative ingredients and brewing techniques. We are committed to elevating the image of American craft beer and are one of the world’s most award-winning breweries at international beer competitions. Although Samuel Adams beer is one of America's largest-selling craft beer, it accounts for only about one percent of the U.S. beer market.\n\nThe Boston Beer Company will continue its independently-minded quest to brew great beer and to advocate for the growth of craft beer across America. In addition to Samuel Adams and Dogfish Head beers and the other craft beers brewed by Angel City Brewery and Coney Island Brewery, our family of brands include Truly Hard Seltzer, Twisted Tea, Angry Orchard Hard Cider, Hard Mountain Dew, Sun Cruiser, Slingers, TeaPot, and many more. Brewery Address 30 Germania St Boston, MA 02130 Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/267/pensacola-fl/emerald-republic-brewing-company",
      "text": "Emerald Republic Brewing Company Registered for the 2023 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewery Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2023 Emerald Coast Beer Fest Registration Emerald Republic Brewing Company Brewery                        in Pensacola, FL Website, Social Links, and Location Emerald Republic through Goldring Gulf. Three reps present. Brewery Address 1414 W Government St Pensacola, FL 32502 Beers Registered (4) For One Perfect Moment - Raspberry Wheat Fruit Beer Fruit Beer Draft A harmonious marriage of fruit and beer, but still recognizable as a beer. The fruit character should be evident but in balance with the beer, not so forward as to suggest an artificial product. Luminescent Shores American Light Lager Standard American Beer Draft Highly carbonated, very light-bodied, nearly flavorless lager designed to be consumed very cold. Very refreshing and thirst quenching. ABV:  2.8% to 4.2% IBU:  8 to 12 Gozen Sour Ale Fruit Beer Fruit Beer Draft A harmonious marriage of fruit and beer, but still recognizable as a beer. The fruit character should be evident but in balance with the beer, not so forward as to suggest an artificial product. Ten Wraiths NEIPA Specialty IPA IPA Draft Recognizable as an IPA by balance – a hop-forward, bitter, dryish beer – with something else present to distinguish it from the standard categories. Should have good drinkability, regardless of the form. Excessive harshness and heaviness are typically faults, as are strong flavor clashes between the hops and the other specialty ingredients. Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/main-event",
      "text": "Emerald Coast Beer Fest Main Event - September 5th, 2025 Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Emerald Coast Beer Festival Tasting Event A must-attend event for craft beer lovers in Pensacola, Florida! Friday - September 5th, 2025 5:30 PM - 8:30 PM 130 E Government St Pensacola, FL 32502 Home At The Fest Sample Over 200 Craft Beers from over 50 Breweries The Emerald Coast Beer Festival is held annually at The Seville Quarter in Downtown Pensacola, FL and organized by Escambia Bay Homebrewers. \n\t\t\t\t\tThe largest and longest-running Beer Fest in Northwest Florida is going down September 5th, 2025 beginning at 5:30pm. \n\t\t\t\t\tThe event also includes over 200 craft beers to sample, food vendors, mead, and live music. A souvenir tasting glass is included with a full admission \n\t\t\t\t\tticket purchase for the first 2,500 entrants . Brewers, both from our local region and nationwide, \n\t\t\t\t\twill convene on the streets of Seville Quarter to bring you some of the finest brews that one could ever hope to imbibe at the beer fest.  And they're all available at one time, \n\t\t\t\t\tin one place, at what promises to be one EPIC street party in Pensacola, Florida! Our Beer List Biggest Beer Tasting Event in Pensacola Florida Don't miss your chance to be a part of the 29th Anniversary of this amazing beer fest. \t\t\t\n\t\t\t\t\tThere are 40+ microbreweries present and another 50-100 represented by their distributors. In addition to the micrbrewies there are generally 10+ \n\t\t\t\t\thomebrew clubs providing beer.  You can buy a ticket for $35 in advance from a retail outlet. VIP tickets are limited to 200 and can be purchased in \n\t\t\t\t\tadvance for $75 through a Escambia Bay Homebrewers club member. Read our FAQ page to buy from a club member. \n\t\t\t\t\tVIP ticket holders receive early entry to the VIP room, hors d'oeuvres, and special \n\t\t\t\t\texclusive hand-selected beers chosen by the top breweries. All ticket holders receive a souvenir festival beer tasting glass and free admission to a post-concert event in Seville Quarter's Seville Plaza. Proceeds from the beer festival ticket sales benefit Society of St. Vincent de Paul and Seville Rotary . Our Confirmed Brewers Crescent City Homebrewers Back Forty Beer Co Abita Brewing Company Boston Beer Company The Prost Office Brewery Props Craft Brewery LLC Oyster City Brewing Co. Goat Island Brewing Company Rollins Distillery Grayton Beer Company Braided River Brewing Co Hopheads Homebrewing Club Palm Folly Hard Seltzer Mcguires Irish Pub Ace Cider Company The Finnish Long Drink EBH Libation Station Wood Foot Beer Co. Beardless Brewhaus Escambia Bay Homebrewers - Winos Alga Beer Co. Odd Colony Brewing Co VIP Room Fairhope Brewing Company Coastal County Brewing Company Goat Lips Chew & Brewhouse Gary's Brewery & Biergarten Iron Hand Brewing, LLC New Holland Dragon's Milk Perfect Plain Brewing Co. Pensacola Bay Brewery 3rd Planet Brewing Knights of the Hop Table BRAVAZZI Hard Italian Soda Random Acts of Brewing Parish Brewing Company Ology Brewing Co. New Belgium Brewing Chattahoochee Brewing Company Urban South Brewery Props Craft Brewery Beer Festival Tickets GENERAL ADMISSION $35* Online Price Samples of 200+ Craft Beers 29th anniversery sampling glass Live Music Food Vendors Guaranteed Admission Party continues at Seville Quarter when the fest ends Buy Tickets Online * A nominal merchant fee is added. VIP ADMISSION $80* Online Price Includes everything from General Admission Early Access.  Entry begins at 5:00 PM Hors D'oeuvres by Seville Quarter Private restroom facilities Mead Tasting Craft Spirits from Local Distilleries Buy Tickets Online *A nominal merchant fee is added. VIP room will be in Heritage Hall. Entry begins at 5:00 pm from the East side of the Seville Complex.\n\t\t\t\tVIP's have access to the VIP room all evening. They may enter the main festival area at 5:30 pm. VIP tickets limited to 200. These tickets always sell out! Venue Location Seville Quarter Rosie's was the birthplace of Seville Quarter in Pensacola. The Gulf Coast's Entertainment Destination Since 1967. There's no better place on \n\t\t\t\t\t\t\t\tthe Gulf Coast to enjoy the hottest high-energy dance music! Enjoy the ambiance of the room and magnificent courtyard fountain. 130 E. Government St. Pensacola, FL 32502 Our VIP Room Heritage Hall Located on the east end of the Seville Quarter complex and in the heart of downtown Pensacola, Heritage Hall is a charming banquet facility \n\t\t\t\t\t\tthat can accommodate any event from rehearsal dinners and wedding receptions, to business meetings and seminars. Featured VIP Breweries SERVING THEIR EXCLUSIVE BEER Unholy Roller DIPA SERVING THEIR EXCLUSIVE BEER Double IPA LIVE Bands Playing at the Beer Festival This list will be updated a month before the event Event Organizers Escambia Bay Homebrewers Founded 1985 Emerald Coast Beer Festival is managed and operated by the club members of Escambia Bay Homebrewers.\n\t\t\tIf you want to learn the craft of homebrewing and located in Pensacola or surrounding areas,\n\t\t\tyou should contact us. Join the Club Countdown for the Craft Beer Tasting Buy Tickets Now Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy {\n\t\t\t\"@type\": \"PriceSpecification\",\n\t\t\t\"price\": 35,\n\t\t\t\"currency\": \"USD\"\n\t\t\t}"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/homebrewclub/221/semmes-al/random-acts-of-brewing",
      "text": "Random Acts of Brewing Registered for the 2023 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Homebrew Club Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2023 Emerald Coast Beer Fest Registration Random Acts of Brewing Homebrew Club                        in Semmes, AL Website and Social Links Homebrew Club in Mobile Alabama  - veterans of MANY Emerald Coast Beerfests! Beers Registered (8) Wee Heavy Scottish Ale Wee Heavy Strong British Ale Draft Rich, malty, dextrinous, and usually caramel-sweet, these beers can give an impression that is suggestive of a dessert. Complex secondary malt and alcohol flavors prevent a one-dimensional quality. Strength and maltiness can vary, but should not be cloying or syrupy. ABV:  6.5% to 10% IBU:  17 to 35 Oberkirch Haus Dunkel Munich Dunkel Dark European Lager Draft Characterized by depth, richness and complexity typical of darker Munich malts with the accompanying Maillard products. Deeply bready-toasty, often with chocolate-like flavors in the freshest examples, but never harsh, roasty, or astringent; a decidedly malt-balanced beer, yet still easily drinkable. ABV:  4.5% to 5.6% IBU:  18 to 28 Viennas Noches Lager International Amber Lager International Lager Draft A well-attenuated malty amber lager with an interesting caramel or toast quality and restrained bitterness. Usually fairly well-attenuated, often with an adjunct quality. Smooth, easily-drinkable lager character. ABV:  4.6% to 6% IBU:  8 to 25 Hefeweizen Weissbier German Wheat Beer Draft A pale, refreshing German wheat beer with high carbonation, dry finish, a fluffy mouthfeel, and a distinctive banana-and-clove yeast character. ABV:  4.3% to 5.6% IBU:  8 to 15 Brown Ale British Brown Ale Brown British Beer Draft A malty, brown caramel-centric British ale without the roasted flavors of a Porter. ABV:  4.2% to 5.4% IBU:  20 to 30 Oberkirch Haus Pils German Pils Pale Bitter European Beer Draft A light-bodied, highly-attenuated, gold-colored, bottom-fermented bitter German beer showing excellent head retention and an elegant, floral hop aroma. Crisp, clean, and refreshing, a German Pils showcases the finest quality German malt and hops. ABV:  4.4% to 5.2% IBU:  22 to 40 Oberkirch Haus Märzen Märzen Amber Malty European Lager Draft An elegant, malty German amber lager with a clean, rich, toasty and bready malt flavor, restrained bitterness, and a dry finish that encourages another drink. The overall malt impression is soft, elegant, and complex, with a rich aftertaste that is never cloying or heavy. ABV:  5.8% to 6.3% IBU:  18 to 24 Hippy Go Lightly Spice, Herb, or Vegetable Beer Spiced Beer Draft A harmonious marriage of SHV and beer, but still recognizable as a beer. The SHV character should be evident but in balance with the beer, not so forward as to suggest an artificial product. Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/",
      "text": "Emerald Coast Beer Festival | September 5th, 2025 | Craft Beer Extravaganza Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Save up to 20% on Tickets!* *Must buy from a Escambia Bay Homebrewer club member Friday - Sept. 5th, 2025 5:30pm to 8:30pm Taste over 200+ Beers from over 50 Breweries Buy Tickets Now The Longest Running Beer Festival on the Gulf Coast The Emerald Coast Beer Festival is back for its 29th year! Pensacola's largest and oldest craft beer tasting event. This year's craft beer festival will be held on September 5th, 2025 at Seville Quarter in Pensacola, Florida. The beer fest will feature breweries all around the Gulf Coast area, including 50+ microbreweries and another 50-100 represented by their distributors. In addition to the microbreweries, there will be 10+ homebrew clubs providing beer. VIP Admission gets early access at 5:00pm, and General Admission starts at 5:30pm. The festival will also feature live music, food trucks, and a variety of other activities. This is the perfect opportunity to sample some of the best beers from the Emerald Coast and beyond. With over 200 craft beers to choose from, you're sure to find something you love. So come out and enjoy the festivities! More Info Got Questions? ABOUT THE FESTIVAL The Emerald Coast Beer Festival, attended by 2500 beer lovers, is the Northwest Florida's prominent  \n\t\t\t\t\t\"street party\"  featuring craft beers, food vendors, and music. Sample 200+ Craft Beers 50+ Breweries Live Music Local Community Support 29th Annual Tasting Glass \"Dixieland Style\" Atmoshpere Homebrew Club Friendly Fest A \"No-Token\" Beer Fest! Beach Party for Brewers Wine Tasting We have a Beer Fest App Beer Festival Tickets Friday's Beer Tasting - Main Event GENERAL ADMISSION $35* Online Price Samples of 200+ Craft Beers 29th anniversery sampling glass Live Music Food Vendors Guaranteed Admission Party continues at Seville Quarter when the fest ends Buy Tickets Online * A nominal merchant fee is added. VIP ADMISSION $80* Online Price Includes everything from General Admission Early Access.  Entry begins at 5:00 PM Hors D'oeuvres by Seville Quarter Private restroom facilities Mead Tasting Craft Spirits from Local Distilleries Buy Tickets Online *A nominal merchant fee is added. VIP room will be in Heritage Hall. Entry begins at 5:00 pm from the East side of the Seville Complex.\n\t\t\t\tVIP's have access to the VIP room all evening. They may enter the main festival area at 5:30 pm. VIP tickets limited to 200. These tickets always sell out! Brewers that Recently Registered View Confirmed Brewers Beer of the Day Beer served at the Fest King Cake Cream Ale Cream Ale Standard American Beer A clean, well-attenuated, flavorful American \"lawnmower\" beer. Easily drinkable and refreshing, with more character than typical American lagers. ABV: 4.2% to 5.6% Brewed by:  The Prost Office Brewery Please Support Your Local Breweries! Our festival wouldn't exist without \n\t\t\t\ttheir support and your patroniage. Find a Brewery Are you a brewer and interested in participating? Would you like to promote your brewery or homebrew club and share your craft of brewing? You should contact us! We're a beer festival\n\t\t\torganized by professional brewers and homebrewers. No registration fee required and an after beach party for brewers that participate. Contact Us Brewer Testimonial Countdown for the Craft Beer Tasting Buy Tickets Now Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://www.discover850.com/event/28th-annual-emerald-coast-beer-festival/",
      "text": "28th Annual Emerald Coast Beer Festival - Discover850 Sign In Home Discover Panama City East End PCB West End PCB Destin 30A Lynn Haven Events Blog Contact Beach Cams Sign In Forgot Password Or Cancel Sign In Home Discover Panama City East End PCB West End PCB Destin 30A Lynn Haven Events Blog Contact Beach Cams Why Are You Reposrting this Listing? Report Now! 28th Annual Emerald Coast Beer Festival The Escambia Bay Homebrewers and Seville Quarter are hosting the Emerald Coast Beer Festival! The longest running beer festival on the Gulf Coast kicks off on Thursday, September 5th-6th starting at 7:00pm at Seville Quarter. A five-course beer pairing dinner featuring handcrafted beers. To make a reservation, call Seville Quarter at 850-434-6211. You can purchase tickets online from the Festival’s website at https://emeraldcoastbeerfest.com/tickets for $35.00 in advance. They are also available for purchase at the following outlets in Pensacola: Gary’s Homebrew Supply, Doc’s Hop Shop, Pensacola Bay Brewery, Seville Quarter. General Admission tickets are $40.00 the day of the event starting on July 1st, 2024. VIP tickets are limited to 250 and can only be purchased in advance for $75.00 from an Escambia Bay Homebrewers Club Member, $80.00 online. Proceeds from the 2024 Emerald Coast Beer Festival ticket sales benefit Seville Rotary and the Alfred-Washburn Center. If you are a brewery or homebrew club and would like to participate at this year’s beer festival, contact us at [email protected] . + Add to Google Calendar + iCal / Outlook export Date Sep 06 2024 Expired! Time 5:30 pm - 8:30 pm More Info Read More Location Pensacola Category Food / Drink Nightlife Share this event"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/239/mobile-al/oyster-city-brewing-co",
      "text": "Oyster City Brewing Co.  Registered for the 2023 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewery Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2023 Emerald Coast Beer Fest Registration Oyster City Brewing Co. Brewery                        in Mobile, AL Website, Social Links, and Location We are Oyster City Brewing Company, part of the Made by the Water group - which includes Oyster City, Catawba, Palmetto, and Faubourg Breweries out of Alabama, Florida, North and South Carolina, and Louisiana. We recently won a gold medal at the World Beer Cup in the Munich Style Helles category! Brewery Address 600 Government St Mobile, AL 36602 Beers Registered (4) Hooter Brown Ale American Brown Ale Amber And Brown American Beer Package A malty but hoppy beer frequently with chocolate and caramel flavors. The hop flavor and aroma complements and enhances the malt rather than clashing with it. ABV:  4.3% to 6.2% IBU:  20 to 30 Mangrove Pale Ale American Pale Ale Pale American Ale Package A pale, refreshing and hoppy ale, yet with sufficient supporting malt to make the beer balanced and drinkable. The clean hop presence can reflect classic or modern American or New World hop varieties with a wide range of characteristics. An average-strength hop-forward pale American craft beer, generally balanced to be more accessible than modern American IPAs. ABV:  4.5% to 6.2% IBU:  30 to 50 Apalach IPA American IPA IPA Package A decidedly hoppy and bitter, moderately strong American pale ale, showcasing modern American or New World hop varieties. The balance is hop-forward, with a clean fermentation profile, dryish finish, and clean, supporting malt allowing a creative range of hop character to shine through. ABV:  5.5% to 7.5% IBU:  40 to 70 Tate's Helles Lager Munich Helles Pale Malty European Lager Package A clean, malty, gold-colored German lager with a smooth grainy-sweet malty flavor and a soft, dry finish. Subtle spicy, floral, or herbal hops and restrained bitterness help keep the balance malty but not sweet, which helps make this beer a refreshing, everyday drink. ABV:  4.7% to 5.4% IBU:  16 to 22 Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    },
    {
      "url": "https://emeraldcoastbeerfest.com/r/brewery/222/new-orleans-la/urban-south-brewery",
      "text": "Urban South Brewery Registered for the 2023 Emerald Coast Beer Festival Online Tickets are Now Available. Buy Now! Sept. 5th, 2025 Pensacola, FL Buy Tickets Sept. 5th, 2025 Pensacola, FL Sept. 5th, 2025 Pensacola, FL Tickets Confirmed Brewers At The Festival Beer Tasting Beer List Beer Pairing Dinner Live Music Food Vendors Fest App & Program Vendors Fest Info FAQ Contact Organizers About The Venue Fest History Facebook Event Brewers Only Buy Tickets Fest App Brewery Registration Info Home At The Fest Confirmed Brewers Brewer Registration 2023 Emerald Coast Beer Fest Registration Urban South Brewery Brewery                        in New Orleans, LA Website, Social Links, and Location Urban South Brewery is New Orleans' flagship craft brewery. With beers like Paradise Park, Holy Roller IPA, and Lime Cucumber Gose - Urban South makes beers for every occasion, geared specifically to our southern climate. Brewery Address 1645 Tchoupitoulas St New Orleans, LA 70130 Back to Confirmed Brewers Be Social Please Take a Moment and SHARE this Event with Family and Friends Follow us on Facebook to receive the most current information about the festival! Join Our Facebook Facebook Event Organized by Join Our Club Portion of the Proceeds Benefit #ECBeerFest Event hosted at Seville Quarter Seville Quarter 130 E Government St Pensacola, FL 32502 info@emeraldcoastbeerfestival.com Tickets: (850) 384-6415 © 2025 Emerald Coast Beer Festival | Privacy Policy"
    }
  ]
}