{
  "fuentes": [
    {
      "url": "https://m.edenusa.com/contactus/contactform.asp",
      "email": "sales@edenusa.com"
    },
    {
      "url": "https://www.hotelenzian.com/en/cuisine/",
      "email": "office@hotelenzian.com"
    },
    {
      "url": "https://enzian.systems/",
      "email": "enzian-contact@lists.inf.ethz.ch"
    },
    {
      "url": "https://enzian.org/food/",
      "email": "shuskins@enzian.org"
    },
    {
      "url": "https://enzian.org/press-room/",
      "email": "marketing@enzian.org"
    },
    {
      "url": "https://enzian.org/press-room/",
      "email": "pbabbage@enzian.org"
    },
    {
      "url": "https://www.edenhotelcollection.com/contact/",
      "email": "admin@edenhotelcollection.com"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "boxoffice@enzian.org"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "events@enzian.org"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "jgilley@enzian.org"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "mcurtis@enzian.org"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "pdipietro@enzian.org"
    },
    {
      "url": "https://enzian.org/contact/",
      "email": "tanderson@enzian.org"
    },
    {
      "url": "https://enzian.org/faq/",
      "email": "boxoffice@enzian.org"
    },
    {
      "url": "https://enzian.org/faq/",
      "email": "development@enzian.org"
    },
    {
      "url": "https://enzian.org/film/city-hall/",
      "email": "streaming@eventive.org"
    },
    {
      "url": "https://enzianinn.com/meetinga-and-events/",
      "email": "events@enzianinn.com"
    },
    {
      "url": "https://enzianinn.com/meetinga-and-events/",
      "email": "info@enzianinn.com"
    },
    {
      "url": "https://enzianinn.com/meetinga-and-events/",
      "email": "info@enzianinn.com"
    },
    {
      "url": "https://enzian.org/friends/enzian-shop/",
      "email": "boxoffice@enzian.org"
    },
    {
      "url": "https://www.eden.com/contact/",
      "email": "info@unicomglobal.com"
    },
    {
      "url": "https://www.eden.com/contact/",
      "email": "info@unicomsi.com"
    },
    {
      "url": "https://www.theedenproject.com/who-we-are/",
      "email": "info@edenteam.org"
    },
    {
      "url": "https://edengrowsystems.com/contactus",
      "email": "inquiry@edengrowsystems.com"
    },
    {
      "url": "https://edenrecruitment.ie/contact-us/",
      "email": "jobs@edenrecruitment.ie"
    }
  ],
  "mails": [
    "admin@edenhotelcollection.com",
    "boxoffice@enzian.org",
    "development@enzian.org",
    "enzian-contact@lists.inf.ethz.ch",
    "events@enzian.org",
    "events@enzianinn.com",
    "info@edenteam.org",
    "info@enzianinn.com",
    "info@unicomglobal.com",
    "info@unicomsi.com",
    "inquiry@edengrowsystems.com",
    "jgilley@enzian.org",
    "jobs@edenrecruitment.ie",
    "marketing@enzian.org",
    "mcurtis@enzian.org",
    "office@hotelenzian.com",
    "pbabbage@enzian.org",
    "pdipietro@enzian.org",
    "sales@edenusa.com",
    "shuskins@enzian.org",
    "streaming@eventive.org",
    "tanderson@enzian.org"
  ],
  "nombre_sitio": "enzian.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://m.edenusa.com/contactus/contactform.asp",
      "text": "Contact Us EDEN USA Rent Staging, Lighting, Sound, AV Home Rent a Stage Rent Lighting Rent Sound Rent Video Wall Rent DJ Gear Services Get A Quote Contact Us PHONE: +1 (866) 501-3336 EMAIL: sales@edenusa.com TEXT: +1 (951) 505-6967 Search Search Our Website × CLOSE Contact Us Eden USA is an event production/rental company, specializing in staging, sound, and \r\n\tlighting rentals for events of all types and sizes.  Please click on this link LOCATIONS if you would\r\n\tjust like general contact information (locations, phone/fax, email).  Otherwise, continue with this form to request a CALL BACK or EMAIL RESPONSE. First Name: Last Name: Phone Number: Ext: Email Address: Preferred Contact Method: --- Choose One --- Any Method E-mail Phone Text Best Time to Contact --- Choose One --- Call Anytime 8:00AM to NOON NOON to 1:00PM 1:00PM to 5:00PM 5:00PM to 9:00PM 9:00PM to MIDNIGHT Closest Location --- Choose One --- Las Vegas Area Los Angeles Area New Jersey Area NYC Area Orange County Area Riverside County San Bernadino County San Diego Area San Francisco/Bay Area Service(s) of Interest Sound System Rental Lighting Services (Dance, Ambient, or Stage) Stage Rental DJ Equipment Rental Karaoke Rental DJ Services (Wedding or Party) Backline Rental Ultimate Stands/Horizon Cabling Products Please provide additional details regarding your production services or gear rental needs: characters left Uncheck only if you would NOT like to receive our Monthly Newsletter! ABOUT US Company Info Contact Form News Site Map Social Media Google Reviews ORDERING Product Catalog Terms & Conditions Wall of Shame Request Quote Resource Center Services RESOURCES Newsletter Archive Newsletter Subscription FAQs Photo Gallery Blog Use Legacy Website CONTACT/SOCIAL MEDIA Contact Form Locations Instagram Facebook TikTok DISCLAIMER/TERMS: Published pricing is subject to change (based upon location). The Eden USA website is designed and hosted by: Eden IT Services COPYRIGHT © 1995 - 2025 Eden USA, Incorporated  All Rights Reserved. Thank you for visiting!  This page last was updated on: Monday, August 25, 2025 9:07:40 PM."
    },
    {
      "url": "https://www.hotelenzian.com/en/cuisine/",
      "text": "Cuisine - Hotelenzian EN DE Hotel Enzian The Enzian History & hosts 5 reasons for vacation Live Image & Weather Digital Guest Directory Hygiene measures Enzian News Rooms & Offers Room Overview Package Overview Included services Worth knowing Cuisine Active & Relaxed Activities Winter Summer Activities Overview Service Contact & Location Voucher Newsletter Taxi Zürs Visit us! +43 5583 22420 office@hotelenzian.com EN DE +43 5583 22420 office@hotelenzian.com Voucher Inquiry Book now Call Book a room Inquire now Gift a Voucher Visit us! Zürs 84 | A-6763 Zürs am Arlberg Culinary pleasure Dining experience for all senses Restaurant & hotel for connoisseurs Our kitchen team will spoil you with traditional Austrian specialities as well as international delicacies with products mainly from the region. Our dedicated service team is happy to recommend enjoyable wine experiences in or from the well-stocked Austrian wine cellar “Zur Reblaus”. Restaurant Enzian Stube & sun terrace Culinary delights on the hillside for a lunch stop or for fine enjoyment in the evening – it is a good place to sit in the original “Zirbenstube”. The cozy atmosphere invites you to linger. Experience culinary delights made from regional, international and seasonal products . Or would you prefer a delicious fondue? Our sun terrace – the hotspot in Zürs am Arlberg with a fantastic view of the ski and mountain world Visit us in WINTER Opening hours Lunch 11.30 am to 01.45 pm For a well-deserved lunch break from the lunch menu. Lunch menu Afternoon snack 01.45 pm to 05.00 pm For a well-deserved stop in the afternoon from the snack menu. Dinner 06.00 pm to 08.30 pm To enjoy in good company from the evening menu. Dinner menu Make your table reservation: email: office@hotelenzian.com phone: +43 5583 22420 Sun terrace Visit us in SUMMER Opening hours Lunch 12.00 am to 02.00 pm For a well-deserved lunch break from the lunch menu. Lunch menu summer 2025 Afternoon snack 02.00 pm to 06.00 pm For a well-deserved stop in the afternoon from the snack menu. Snacks summer 2025 Dinner 06.00 pm to 08.00 pm To enjoy in good company from the evening menu. Dinner summer 2025 For dinner make your table reservation: email: office@hotelenzian.com phone: +43 5583 22420 hotel bar Place for get-togethers Our hotel bar with its stylish ambience is the ideal meeting point for interesting encounters, social gatherings, a cozy chat with friends or simply for a pleasant end to a wonderful day on holiday. And staying there becomes a special moment . How about an afternoon tea ? Enjoy your tea or coffee break with your holiday reading in an elegant atmosphere . Start with a delicious aperiti f to get you in the mood for the 5-course evening meal as part of the Enzian half-board or before your dinner in our Enzian Stube. Have an enjoyable cocktail mixed for you, choose from the finest spirits or enjoy fine wines from our wine cellar . Our bar team is also available for alcohol-free enjoyment . Is your four-legged friend accompanying you on your holiday? Your dog is allowed and welcome at the hotel bar. included services Enzian half-board in our hotel restaurant Sumptuous buffet-style breakfast with assorted teas and juices from the bar Daily afternoon snack between 4:00 pm and 5:00 pm (in winter) 5- course degustation dinner with choice of menu (in winter) Various themed buffet evenings (in winter) 3- course dinner menu (in summer) Kid´s menu Sundays: Gala-Gourmet-Dinner with a glass of sparkling wine (in winter) refreshing welcome drink (in summer) Intolerances Please let us know of any food intolerances and allergies before your arrival. We try to respond to all wishes and special requirements as far as possible. Zur Reblaus Selected wines from our wine cellar In our wine cellar “Zur Reblaus” you can expect an exquisite selection of wine specialities and tastings full of passion for the fine wines with our hosts Richard and Denny. Embark on a taste journey through the most beautiful and best wine regions , especially in Austria. Our experienced service staff will be happy to advise you and help you choose the right wine for your meal."
    },
    {
      "url": "https://enzian.systems/",
      "text": "Enzian | Home Systems Group Home Who Are We? What is Enzian? Why Enzian? Updates Tech Nuggets Projects Publications Documentation FAQ Subscribe to the mailing list for updates. Enzian is a research computer built by the Systems Group at ETH Zurich. As a research computer, Enzian is designed for computer systems\nsoftware research and deliberately over-engineered. Enzian\nhas a big server-class CPU closely coupled to a large FPGA, with\nample main memory and network bandwidth on both sides. If you want to cite Enzian in your work, use the citation for our ASPLOS 2022 paper .\nYou can find the bibtex citation on our FAQ page . Several institutions are already using Enzian. If you think your work could benefit\nfrom Enzian contact us at enzian-contact@lists.inf.ethz.ch . October 24, 2022 Enzian at the seL4 Summit 2022 The seL4 Summit took place\nearlier this month in Munich, and the Enzian team was represented by Daniel\nSchwyn , giving a talk about Trustworthy\nBMCs ( recording available\nhere ). October 13, 2022 RISC-V on Enzian Thanks to the hard work of a bachelor’s student, Diego de los Santos, we\nhave brought up the Rocket RISC-V core on the Enzian’s\nFPGA. We are able to load an image from the CPU side, across ECI, directly into the FPGA’s DRAM.\nWe can then boot into Linux on the RISC-V core. While clock speed is obviously limited in the FPGA implementation \n(currently 100MHz) this is still many orders of magnitude faster than RTL simulation. This allows us to run\nmore realistic, larger memory benchmarks on RISC-V. We can then examine power and performance implications of various microarchitectural changes. September 26, 2022 Identifying an Enzian over USB As we explained in our post about the Enzian rear panel there are two client USB ports on Enzian:\none for the JTAG scain chain and one for the system UARTs.\nThe JTAG chip on the Enzian main board has a pre-configured JTAG cable ID that is unique.\nThe serial-to-USB converter by default does not have a unique ID though.\nIf you just plug one Enzian into your machine that does not matter, however we have 9 of these machines all plugged into our gateway server. We built Enzian to have a platform for our research into\noperating systems, databases, hardware acceleration, machine\nlearning, networking, and high-performance computing, and because\nthere was nothing comparable out there that we could get hold of\notherwise. Now that it works, we’d like to make Enzian systems available\nto the rest of the research community.  If you want to work with\nEnzian, or if you might be able to help us make it more widely\navailable, please contact us! © 2024 ETH Zurich"
    },
    {
      "url": "https://enzian.org/food/",
      "text": "Food - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: EDEN BAR HOURS Monday & Tuesday: 4 – 11PM; Closed for Lunch Wednesday & Thursday: 11AM –11PM Friday & Saturday: 11AM – 1AM Sunday: 11AM – 11PM KITCHEN HOURS POSTED BELOW Enjoy lunch or dinner at Eden Bar, Central Florida’s best alfresco dining destination. With daily food and drink specials, lunch offerings, and a late night menu, Central Florida’s most unique outdoor restaurant and bar doesn’t even need the movie to go with it. Although Eden Bar is outdoors, we are a non-smoking establishment, and appreciate your help in keeping it a safe and healthy environment for everyone. Please note: 18% gratuity will be added to any unsigned checks at Enzian and Eden Bar. Looking to host an event at Eden Bar? Contact shuskins@enzian.org for more information! Eden Bar hours are subject to extreme weather conditions. To confirm its hours of operations during these circumstances please call 407-629-1088 ext. 230. We produce much of our food in-house, with an unwavering commitment to quality ingredients, and choosing to work with independent businesses, farmers, brewers, and artisans, locally whenever possible. Theater Menu FOOD + DINING Theater Menu BEER/WINE Eden Bar FOOD + DINING Eden Bar BEER/WINE/COCKTAILS Chocolate Chip Cookies FARE TO SHARE (OR NOT) ENZIAN POPCORN (V) Enzian Film Society Members get free popcorn at every show! CHICKEN TENDERS & FRIES Hand-battered, served with seasoned fries and honey mustard. Substitute truffle fries ULTIMATE NACHOS Cheese sauce, jalapeños, lettuce, salsa and sour cream. Add chicken / chili / pork / guacamole CRISPY BRUSSELS SPROUTS (V) Tossed in a balsamic truffle honey, finished with Parmesan, walnuts and smoke sea salt ARTICHOKE AND SPINACH DIP (V) Served hot with tortilla chips EDAMAME (VG)(GF) Tossed with shichimi togarashi OLDE HEARTH PRETZEL STICKS (V) Served with cheese sauce and horseradish honey mustard FRENCH FRIES (V) Regular or truffle fries HUMMUS WITH PITA BREAD (VG) Seasonally inspired flavor served with pita bread SWEET AND SPICY SHRIMP Hand battered, fried to a golden brown, served with a sweet and spicy sauce FRIED CAULIFLOWER (VG) Hand battered, served with a sweet and salty gobi sauce for dipping SOUPS & SALADS CREAM OF TOMATO (VG)(GF) Cup | Bowl BEEF CHILI Cup | Bowl Texas style, all beef...no beans SOUP & SALAD Side house or Caesar salad with a bowl of soup THE NUTTY PEAR SALAD Seasonal pear, almonds, walnuts, sunflower seeds, fresh berries, crisp greens, grape tomato, cucumber, citrus vinaigrette FRIED CHICKEN SALAD Mixed greens, cheddar, tomato, bacon, chopped egg, red onion, seasoned croutons, honey mustard dressing CHICKEN CAESAR SALAD Crisp romaine, saved Parmesan, garlic croutons and grilled chicken HOUSE SALAD (VG) Mixed greens, tomato, cucumber, red onion, croutons, balsamic vinaigrette Add chicken / scoop of chicken salad / avocado / black bean burger / shrimp SANDWICHES AND MORE Sandwiches are served with your choice of soup, fries, mac & cheese, or side salad. Substitute truffle fries, dairy free cheese, gluten free wrap. Add avocado. SMASH BURGER 1/4 lb. Single or Double Patty American cheese, pepper mayo, lettuce and tomato on a toasted bun. Add mushrooms / sautéed onion / bacon CHICKEN SALAD CROISSANT Chicken breast, walnuts, craisins, honey and mayonnaise with lettuce and tomato GRILLED CHEESE (V) Creamy fontina on thick ciabatta bread. Add bacon TURKEY CRANBERRY CROISSANT Smoked gouda, bacon, cranberry orange chutney, lettuce and tomato CUBAN Pulled pork, ham, Swiss, pickles and mustard sauce served on pressed Cuban bread BLACK BEAN BURGER (V) House made, topped with Swiss, chipotle aioli, lettuce & and tomato GOURAV'S WRAP (VG)(GF) Gluten free tortilla, vegan chorizo, avocado, lettuce, black bean corn salsa and dairy free cheese LOADED QUESADILLA (V) Does not include side Cheddar, jack, black beans, onions and peppers, with salsa and sour cream on the side Add blackened chicken / pork / guacamole. Substitute dairy free cheese FLATBREADS CHEESE (V) Red sauce, cheese blend PEPPERONI Red sauce, cheese blend, spicy pepperoni SUPPORTING ROLE (VG) Hummus, grape tomato, artichoke hearts, red peppers, caramelized onion, dairy free cheese and sunflower seeds FANTASTIC FUNGI (V) Gorgonzola, cheese blend, spinach, mushrooms and caramelized onion PEAR & PROSCIUTTO Gorgonzola, cheese blend, spinach, pears and shave prosciutto THE RIGHT THING (V) Red sauce, cheese blend, spinach, roasted red peppers, garlic, mushrooms, caramelized onion and tomato SWEETS CHOCOLATE CHIP COOKIES MINI DONUTS Served with a signature sauce CHOCOLATE BROWNIE (V)(GF) Make it a sundae with ice cream & chocolate sauce DRAFT BEER 16oz | 20oz | 60oz Pitcher BUD LIGHT YUENGLING STIEGL GRAPEFRUIT RADLER SAM ADAMS BOSTON LAGER TERRAPIN HOPSECUTIONER IPA IVANHOE PARK GUAVACATION SIERRA NEVADA HAZY IPA BELL'S TWO HEARTED IPA IVANHOE PARK TOBAGGAN ALE BOTTLED BEER PABST BLUE RIBBON BUDWEISER MICHELOB ULTRA MILLER LITE PERONI COORS LIGHT CORONA STELLA ARTOIS LAGER IVANHOE PARK BAVIK SUPER WIT STELLA ARTOIS LIBERTE N/A GUINNESS 16.9oz CAN KONA BIG WAVE WHITE, SPARKLING, & ROSE Glass or Bottle PINOT GRIGIO, HOUSE CHARDONNAY, HOUSE PINOT GRIGIO, DUE TORRI, IT BLANC, MOULIN DE GASSAC, FR SAUVIGNON BLANC, BRANCOTT ESTATE, NZ WHITE CONUNDRUM, CA RIESLING, SEAGLASS, WA CHARDONNAY, SEA SUN BY CAMUS, CA RUEDA VERDEJO, HONORO VERA, SP ROSE, MOULIN DE GASSAC, FR SPARKLING ROSE, CHANDON, FR, SPLIT PROSECCO, CANDONI, IT, SPLIT BLANC DE BLANCS BRUT, JP. CHENET, FR, SPLIT RED WINE Glass or Bottle HOUSE CABERNET SAUVIGNON PINOT NOIR, BLOCK NINE, CA MALBEC, TILIA, ARG BORDEAUX, CHATEAU LA GRAVIERE, FR COTES DU RHONE, LA JASSINE, FR CABERNET SAUVIGNON, SILVER PALM, CA SANGRIA WHITE SANGRIA RED SANGRIA CIDER & SELTZER ANGRY ORCHARD HARD CIDER WHITE CLAW SELTZER ORIGINAL SIN BLACK WIDOW CIDER Blackened Mahi Tacos FARE TO SHARE (OR NOT) CHICKEN TENDERS & FRIES Hand-battered, served with seasoned fries and honey mustard. Substitute truffle fries ULTIMATE NACHOS Cheese sauce, jalapeños, lettuce, salsa and sour cream. Add chicken / chili / pork / guacamole CRISPY BRUSSELS SPROUTS (V) Tossed in a balsamic truffle honey, finished with Parmesan, walnuts and smoke sea salt ARTICHOKE AND SPINACH DIP (V) Served hot with tortilla chips EDAMAME (VG)(GF) Tossed with shichimi togarashi OLDE HEARTH PRETZEL STICKS (V) Served with cheese sauce and horseradish honey mustard FRENCH FRIES (V) Regular or truffle fries HUMMUS WITH PITA BREAD (VG) Seasonally inspired flavor served with pita bread SWEET AND SPICY FRIED SHRIMP Hand battered, fried to a golden brown, served with a sweet and spicy sauce FRIED CAULIFLOWER (VG) Hand battered, served with a sweet and salty gobi sauce for dipping SOUPS & SALAD CREAM OF TOMATO (VG)(GF) Cup | Bowl BEEF CHILI Cup | Bowl Texas style, all beef...no beans SOUP & SALAD Side house or Caesar salad with a bowl of soup THE NUTTY PEAR SALAD Seasonal pear, almonds, walnuts, sunflower seeds, fresh berries, crisp greens, grape tomato, cucumber, citrus vinaigrette FRIED CHICKEN SALAD Mixed greens, cheddar, tomato, bacon, chopped egg, red onion, seasoned croutons, honey mustard dressing CHICKEN CAESAR SALAD Crisp romaine, saved Parmesan, garlic croutons and grilled chicken HOUSE SALAD (VG) Mixed greens, tomato, cucumber, red onion, croutons, balsamic vinaigrette Add chicken / scoop of chicken salad / avocado / black bean burger / shrimp SANDWICHES, BURGERS, AND MORE Sandwiches are served with your choice of soup, fries, mac & cheese, or side salad. Substitute truffle fries, dairy free cheese, gluten free wrap. Add avocado. THE EDEN BURGER 1/2 lb wagyu beef, cheddar jack cheese, pepper mayo, lettuce and tomato on a toasted bun SMASH BURGER 1/4 lb. Single or Double Patty American cheese, pepper mayo, lettuce and tomato on a toasted bun. Add mushrooms / sautéed onion / bacon CHICKEN SALAD CROISSANT Chicken breast, walnuts, craisins, honey and mayonnaise with lettuce and tomato GRILLED CHEESE (V) Creamy fontina on thick ciabatta bread. Add bacon TURKEY CRANBERRY CROISSANT Smoked gouda, bacon, cranberry orange chutney, lettuce and tomato CUBAN Pulled pork, ham, Swiss, pickles and mustard sauce served on pressed Cuban bread BLACK BEAN BURGER (V) House made, topped with Swiss, chipotle aioli, lettuce & and tomato GOURAV'S WRAP (VG)(GF) Gluten free tortilla, vegan chorizo, avocado, lettuce, black bean corn salsa and dairy free cheese LOADED QUESADILLA (V) Cheddar, jack, black beans, onions and peppers, with salsa and sour cream on the side Add blackened chicken / pork / guacamole. Substitute dairy free cheese MAHI TACOS Lightly blackened, jalapeno marinated slaw, sriracha aioli, corn tortillas. Substitute pork, chicken, or shrimp FLATBREADS CHEESE (V) Red sauce, cheese blend PEPPERONI Red sauce, cheese blend, spicy pepperoni SUPPORTING ROLE (VG) Hummus, grape tomato, artichoke hearts, red peppers, caramelized onion, dairy free cheese and sunflower seeds FANTASTIC FUNGI (V) Gorgonzola, cheese blend, spinach, mushrooms and caramelized onion PEAR & PROSCIUTTO Gorgonzola, cheese blend, spinach, pears and shave prosciutto THE RIGHT THING (V) Red sauce, cheese blend, spinach, roasted red peppers, garlic, mushrooms, caramelized onion and tomato SWEETS CHOCOLATE CHIP COOKIES MINI DONUTS Served with a signature sauce CHOCOLATE BROWNIE (V)(GF) Make it a sundae with ice cream & chocolate sauce Handcrafted Tiki Cocktails Handcrafted Tiki Cocktails Handcrafted Tiki Cocktails 13 Cocktails of Halloween, Every October Holiday Cocktails, Every December Ask about our Shareable Bowls (Offered Seasonally) Bring Your Special Someone to Eden for a Date Night BARTENDERS ENVY FLAMING LUSH Jalapeno infused Ketel One Peach and Orange Blossom Vodka, lemon juice, passionfruit syrup, cranberry juice SUN GODDESS Tanqueray Sevilla Orange Gin, lemon juice, passionfruit syrup, champagne DOG ISLAND Gordons Gin, pineapple juice, Aperol, lime juice, almond syrup LIME IN DA COCONUT Brinley Gold Shipwreck Coconut Rum, lime juice, cream of coconut, topped with whipped cream BLOOD MOON Gordons Gin, lemon juice, passionfruit syrup, Velvet Falernum, almond syrup WOLFSBANE Cask & Crew Ginger Spice Whiskey, simple syrup, bitters TRINIDAD SOUR Bulleit Rye Whiskey, lemon juice, bitters, almond syrup RAINY DAY RADLER Stiegl Grapefruit Draft, Goslings Dark Rum CHILL PILL Ron Zacapa 23 Yr Old Rum, pineapple juice, orange juice, cream of coconut, Goslings Dark Rum FLAVOR OF LOVE Don Julio Blanco Tequila, Banhez Mezcal, lime juice, passionfruit syrup, Campari, pinot noir Eden Sangria Glass | Pitcher A refreshing blend of citrus with our house wine. Available red or white BIRDS OF PARADISE Wray & Nephew Overproof Rum, lime juice, Aperol, pineapple juice, simple syrup DRAFT BEER 16oz | 20oz | 60oz Pitcher BUD LIGHT YUENGLING STIEGL GRAPEFRUIT RADLER SAM ADAMS BOSTON LAGER TERRAPIN HOPSECUTIONER IPA IVANHOE PARK GUAVACATION SIERRA NEVADA HAZY IPA BELL'S TWO HEARTED IPA SANFORD BREWING DRINKIN' BEER IVANHOE TOBAGGAN BLOND ALE BEER, CIDER, & SELTZER PBR 16OZ BUDWEISER MICHELOB ULTRA MILLER LITE PERONI COORS LIGHT STELLA ARTOIS LAGER BAVIK SUPER WIT IVANHOE PARK STELLA ARTOIS LIBERTE N/A GUINESS 16.9OZ CAN KONA BIG WAVE ANGRY ORCHARD HARD CIDER WHITE CLAW SELTZER ORIGINAL SIN BLACK WIDOW CIDER WHITE, SPARKLING, & ROSE WINES Glass | Bottle HOUSE PINOT GRIGIO, CA PINOT GRIGIO, DUE TORRI, IT BLANC, MOULIN DE GASSAC, FR SAUVIGNON BLANC, BRANCOTT ESTATE, NZ RIESLING, SEAGLASS, WA HOUSE CHARDONNAY, CA CHARDONNAY, SEA SUN BY CAYMUS, CA RUEDA VERDEJO, HONORO VERA, SP ROSE, MOULIN DE GASSAC, FR SPARKLING ROSE, CHANDON, FR, SPLIT PPROSECCO, CANDONI, IT, SPLIT BLANC DE BLANCS BRUT, JP. CHENET, FR, SPLIT RED WINES HOUSE PINOT NOIR, CA PINOT NOIR, BLOCK NINE, CA MALBEC, TILIA, ARG BORDEAUX, CHATEAU LA GRAVIERE, FR COTES DU RHONE, LA JASSINE, FR HOUSE CABERNET SAUVIGNON, CA CABERNET SAUVIGNON, SILVER PALM, CA TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://enzian.org/press-room/",
      "text": "Press - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: Press Room The Public Relations Department of Enzian is dedicated to supplying members of the press and media with resources about Enzian and Eden Bar. Press releases are distributed via e-mail as well as available to download below. Click here to send a request to be added to the media database that receives email press release updates. High-resolution press images are available for download here or by special request from the Public Relations Department on an individual basis. Members of the press and media are encouraged to contact the Public Relations Department if they need any additional information or have questions regarding Enzian, its films, festivals, or special events. Enzian Press Contact Paige Babbage | pbabbage@enzian.org Recent Press Releases Enzian Presents New Monthly Midnight Series: Freaky Fridays – December 2021 Enzian Presents 12 Days of Christmas – November 2021 Enzian Presents the 29th Annual Brouhaha Film & Video Showcase – November 2021 Enzian Presents the 23rd Annual Central Florida Jewish Film Festival – October 2021 Enzian and the Asian Cultural Association Present the 27th Annual South Asian Film Festival – September 2021 Enzian Presents “13 Films and Cocktails of Halloween” Throughout October – August 2021 Enzian Announces Four “Meet the Filmmaker” Events – August 2021 Enzian Partners with Opera Orlando and Orlando Ballet for Annual Summer Opera & Ballet Series – June 2021 Enzian to Host “Reel Representation: Diversity in Film” Showcase – May 2021 New HVAC Installed for Safer Indoor Screenings – February 2021 Enzian and the Asian Cultural Association Present the 26th Annual South Asian Film Festival – September 2020 Enzian Presents “13+ Films and Cocktails of Halloween” Throughout October – September 2020 Enzian Presents New Season of National Theatre Live Productions – August 2020 Enzian Theater Announces Stanley Kubrick Week – July 2020 Enzian Theater Announces Spike Lee Week and The Rental – July 2020 Enzian Theater Announces Focus Features Favorites Week and The Truth – July 2020 Enzian Theater Announces The Empire Strikes Back and Horror Film Relic – July 2020 Enzian Announces Christopher Nolan Week and John Lewis Documentary – June 2020 Enzian Theater Announces Universal Classic Monsters Week and Ella Fitzgerald Documentary – June 2020 Enzian Theater Announces John Hughes Week and Award-Winning Drama Babyteeth – June 2020 Enzian Reopens with Alfred Hitchcock Week, The Trip to Greece, A Free Screening of I Am Not Your Negro, and more! – June 2020 TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://www.edenhotelcollection.com/contact/",
      "text": "Get in touch with Eden Hotel Collection Menu GIFT VOUCHERS EXPERIENCES BOOK BOOK Bovey Castle Mallory Court The Greenway Hotel & Spa Brockencote Hall The Arden Hotel Gift vouchers BOOK BOOK Bovey Castle Mallory Court The Greenway Hotel & Spa Brockencote Hall The Arden Hotel Gift vouchers MENU HOTELS All Hotels Spa Hotels Offers GIFT VOUCHERS EXPERIENCES BOOK BOOK Bovey Castle Mallory Court The Greenway Hotel & Spa Brockencote Hall The Arden Hotel Gift vouchers Get in touch Have a query? One of our professional team members will be more than happy to help... Eden Hotel Collection Head Office Bridgeway House, Bridgeway Stratford-upon-Avon Warwickshire CV37 6YX t: 01789 610025 e: admin@edenhotelcollection.com Send an enquiry Fill out my online form . Fill out my Wufoo form! Your data is safe with us. To find out more about how we will use and store your email data go to our Privacy Policy page. Here we will tell you all about how we collect, store and use your data. Media & PR Contact us Hotels Offers Experiences Elan Spa Christmas & New Year Brochures Gift Vouchers Rewards Making change About The Eden Story Vision & Values Our Team Journal Blog Hotels Offers Experiences Elan Spa Christmas & New Year Brochures Gift Vouchers Rewards Making change About The Eden Story Vision & Values Our Team Journal Blog exclusive special offers, promotions and inspiration Sign up Unique in character, individual in style AA Small Hotel Group of the Year 2024-25 Our hotels Careers Get in touch Media and PR Media Library Price Promise Privacy policy Terms and conditions Cookie policy Accessibility Supplier code of conduct Eden Hotel Collection is part of Rigby Group (RG) plc Eden Hotel Collection Limited is a company registered in England and Wales with Company Number 06772001. Registered office address: Mallory Court Hotel Harbury Lane, Bishops Tachbrook, Leamington Spa, Warwickshire, CV33 9QB VAT Number: 806 6412 41\r\nAll rights reserved © 2024 ©2025 All rights Reserved Designed by Rawww phone chevron-down"
    },
    {
      "url": "https://enzian.org/contact/",
      "text": "Contact - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: Contact Us Name * First Last Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Phone Email * Comments CAPTCHA Phone This field is for validation purposes and should be left unchanged. Contact Enzian Box Office is open 3:00 PM – 9:30 PM Monday – Thursday, and 12:00 PM – 9:30 PM Friday – Sunday Info Line: (407) 629-0054 | Theater Offices: (407) 629-1088 To email the Box Office, click here . 1300 South Orlando Avenue | Maitland, FL 32751 Meet Our Staff Enzian does not and shall not discriminate on the basis of race, nationality, disability, age, gender, gender expression, sexual orientation, or religion in any of its activities or operations. These activities include, but are not limited to, hiring and firing of staff, selection of volunteers and vendors, and provision of services. We are committed to providing an inclusive and welcoming environment for all staff, patrons, volunteers, and vendors. Matthew Curtis : Programming Director Peter DiPietro Technical Director Where Are You From or Where Did you Grow Up? Philadelphia suburbs, PA Favorite Movie(s) or Movie Genre: I love the Step Up movies What Movie Could you Watch over and over?: Sixteen Candles Favorite Enzian Series: Cult Classics Favorite Type of Music or Musician (s) : Pop Favorite TV Show (s) : Last Week Tonight with John Oliver Best Concert You’ve Ever Been to: Lollapalooza 1992 and Prince 2003 Favorite Place You’ve Ever Traveled to: Cruise to Bermuda Where Would You Like to Travel to?: Europe and South America My Guilty Pleasure Is… Ke$ha (I know, but I prefer the dollar sign era) Have Any Pets?: Just Beowulf, the Enzian resident cat Are You More of a Cat or Dog Person?: Cat person What are Some of Your Hobbies ? : Crossword puzzles and the Wordle, pinball, bicycling What’s Your Favorite Part About Working at Enzian? Just being a part of such an iconic Orlando institution Rachel Harley Events Coordinator Where Are You From or Where Did you Grow Up? Apopka, Florida Favorite Movie(s) or Movie Genre: The Third Man, First Reformed, and Tombstone What Movie Could you Watch over and over? Moonstruck. The chemistry between Nicholas Cage and Cher is crazy! Favorite Drink to Sip On at Eden Bar: Any fun mocktails the bartenders can create for me Favorite Enzian/Eden Bar Food: Crispy Brussel Sprouts Favorite Place You’ve Ever Traveled to: Vancouver, BC. If You Could Have Dinner with Anyone (Dead or Alive), Who Would it be and Why?: Orson Welles. I find his absurd self aggrandizing to be charming. My Guilty Pleasure Is…: The county fair! The thrill of my fragile mortality makes the whole experience that much better. Have Any Pets?: My boy, Alfred, a Black Mouth Cur Are You More of a Cat or Dog Person?: Dog, definitely. What are Some of Your Hobbies?: I have a film/supper club that I host once a month. I also enjoy travelling around Florida, and some surrounding states, to hike through the parks with Alfred. Tim Anderson Programming Coordinator Favorite Quote or Personal Motto:  “I will not make any more boring art” – John Baldessari My favorite movie is Casablanca. but I love Silent, Foreign, Horror, and Experimental Films If a movie title could describe my life, it would be: “Women on the Verge of a Nervous Breakdown” (take that however you want) If I could have dinner with anyone, it would be Andy Warhol – he’s the person most singularly responsible for my career trajectory My Guilty Pleasure is coming-of-age movies (Now and Then, Can’t Hardly Wait, Fast Times at Ridgemont High, Empire Records) Pets: I have 4 cats, two of which might secretly hate me. Other Fun Fact(s): I was a regular “featured extra” on the New Mickey Mouse Club and hit Britney Spears in the head (accidentally) during a scene where I had to drag her out of a restaurant. Jo Gilley (They/Them) Box Manager & Development Coordinator Where Are You From or Where Did you Grow Up? California Favorite Movie(s) or Movie Genre: Millennium Mambo What Movie Could you Watch over and over?: The Last Holiday Favorite Drink to Sip On at Eden Bar: Ginger ale Favorite Place You’ve Ever Traveled to: Joshua Tree, California If You Could Have Dinner with Anyone (Dead or Alive), Who Would it be and Why?: Francis Bacon, He’s my favorite artist and to be able to pick his brain a bit would be so dreamy. Top 3 Things on Your Bucket List: I’d like to travel to Norway, work in film restoration, and drink enough coffee to become a walking vibrational frequency Have Any Pets?: Two cats Are You More of a Cat or Dog Person?: C A T What are Some of Your Hobbies?: Painting, playing music, petting cats, and watching movies Contact Us Name * First Last Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Phone Email * Comments CAPTCHA Comments This field is for validation purposes and should be left unchanged. TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://enzian.org/faq/",
      "text": "FAQ - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: Because we are unlike anywhere else, we do things a little differently. We want your visit to go smoothly whether it’s your first or 100th time at Enzian. HOW DO I FIND OUT WHAT’S PLAYING OR COMING SOON? We offer daily programming with additional special programming throughout the month. Please check our Films page or call the Movie Info Line at (407) 629-0054 for the most accurate and up-to-date information about showtimes and tickets. Please note that all “coming soon” dates are subject to change. I WANT TO COME SEE A FILM AT ENZIAN. WHAT DO I DO? Once you have chosen the show you wish to see, you will need to purchase tickets online or in person at the Box Office. Opening weekends, Cult Classics and other special programming tend to sell out quickly and buying tickets in advance is strongly encouraged. Tickets may also be purchased the day of the show, but availability cannot be guaranteed. When a screening reaches capacity, you may place your name on a wait list . DO I NEED A RESERVATION? Table reservations are available to members of the Enzian Film Society at the Contributor level and above. Anyone can see a film at Enzian, and anyone can become a member. For Regular level and non-members, seating is on a first-come basis. We recommend that all guests arrive 45 minutes before the start of the show to get in line for tickets and seating. For opening weekends, Cult Classics, and special events, you may want to arrive earlier. Theater doors open for seating approximately 30 minutes before the show. WHEN IS THE BOX OFFICE OPEN? The Box Office hours are Monday – Thursday from 3:00 PM – 9:30 PM, and Friday – Sunday from Noon – 9:30 PM. HOW MUCH ARE TICKETS? Tickets start at $12.50 General Admission $11 Students, Seniors (62+) & Military (ID required) $11 Matinee (before 4PM) $10.00 Members of Enzian Film Society For discounts, click here to learn more about becoming a member of the Enzian Film Society. WHAT HAPPENS IF I PURCHASE MY TICKETS ONLINE? You will be placed on our door list for the show. There is no need to stop by the Box Office. Simply line up for seating (if you choose) and give your first and last name to the house manager taking tickets as you enter the theater. WHAT IS ENZIAN’S WAIT LIST POLICY? For sold out screenings, Enzian often offers a standby option. Due to the unique layout of our theater, being “sold out” of general admission tickets does not necessarily mean there won’t be seats available during the performance. If possible, we will try to accommodate additional seating through our standby process. How standby works: Visit the Enzian Box Office one hour before showtime to receive a numbered standby card At showtime, line up at the Box Office in order of numbered cards Staff will count available seats and try to seat as many standby card holders as we can Standby seating is not guaranteed and is always at staff discretion. Standby may not be available for every show. For any questions about ticket quantity, availability, and seating options please contact the Enzian Box Office . To avoid missing a busy show, we always recommend that you purchase your tickets in advance or become a Contributor Member of the Enzian Film Society , which enables you to make table reservations to guarantee a place for your party. DO YOU SERVE FOOD AND DRINKS? HOW DOES THAT WORK? Yes! We offer food at our outdoor pavilion, Eden Bar as well as inside the theater. You do not have to see a film to attend and dine in our outside area. Eden Bar offers a full dining menu and full bar. Our theater is arranged like a dining room in front of the screen. We have four tiers of tables for two or four, single seats, and couches. Once you are seated, a server will come to your table and take your order. A full dining menu is available, as well as a beer and wine list. Liquor drinks are not available for order inside the theater. Food times may take longer than a normal dining experience as we serve up to 230 guests menu items prepared fresh and carefully. Thank you in advance for your patience. Dining is optional and the dress is casual. HOW DO I GET MY COMPANY’S SLIDE ON THE SCREEN BEFORE EACH SHOW? Your business, restaurant, or travel destination can reach attractive, upscale new customers using one of today’s most effective advertising media while supporting Central Florida’s premier art house cinema café, Enzian. Click here for more information on slide advertising, contact development@enzian.org or call 407-629-1088 ext. 303. WHERE CAN I FIND INFORMATION ABOUT CLOSED CAPTIONING? Please check the film you’re interested in seeing on our website. The film page will specify if closed captioning is available for that film. Upon arriving to the theater, you will be given printed materials that explain how to use the closed captioning glasses. Our staff and managers are knowledgeable on the closed captioning system and can assist with any specific questions you may have. TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://enzian.org/film/city-hall/",
      "text": "City Hall - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: City Hall - Enzian Theater Enzian Theater City Hall Click Showtimes to Purchase Tickets Enzian On Demand City Hall Stream new release City Hall and support Enzian! Here’s how this works: For $12, the service provider will grant you access to the film, which is viewable on any internet-connected device including laptops, tablets, and smartphones. If you have the appropriate technology (Chromecast, Amazon Firestick, AirPlay, Apple TV, Smart TV, etc), you may be able to stream this to your television at home from your computer or phone. If you have any questions or concerns regarding your order, you can visit the Help Page or contact the streaming platform here . For every purchase of City Hall from Friday, November 13th, through Thursday, November 26th, nearly 50% goes directly back to Enzian in an effort to support us. We appreciate your support! Click Here to Stream City Hall » Certified Fresh with 100% on Rotten Tomatoes! City government touches almost every aspect of our lives. Most of us are unaware of or take for granted these necessary services such as police, fire, sanitation, veterans affairs, elder support, parks, licensing of various professional activities, recordkeeping of birth, marriage and death as well as hundreds of other activities that support Boston residents and visitors. CITY HALL, by Frederick Wiseman, shows the efforts by Boston city government to provide these services. The film also illustrates the variety of ways the city administration enters into civil discourse with the citizens of Boston. Mayor Martin J. Walsh and his administration are presented addressing a number of their policy priorities which include racial justice, affordable housing, climate action, and homelessness. CITY HALL shows a city government successfully offering a wide variety of services to a diverse population. USA, 2020, 275 minutes, Not Rated, Directed by Frederick Wiseman Upcoming Programming Popcorn Flicks in the Park Encanto Special Program CatVideoFest 2025 Saturday Matinee Classics/Enzian Film Club Ran (4k Restoration) Music Mondays Ron Delsener Presents Enzian Theater is proudly powered by WordPress TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://enzianinn.com/meetinga-and-events/",
      "text": "MEETINGS & EVENTS – Enzian Inn – Leavenworth Link to Facebook Link to Instagram PHONE: 509.548.5269 GALLERY ACCOMMODATIONS AMENITIES DINING MEETINGS & EVENTS STEINBOCK RESORTS BOOK NOW Menu Menu MEETINGS & EVENTS Allow our hospitality and events team to create an event tailored to your individual needs. With meeting space ranging from 350sf – 1,100sf and on-site catering provided by our chefs, we are able to accommodate a wide range of requests and would love to assist you in hosting your next board meeting, church retreat, strategy session or boutique conference. 509-548-5269 | INFO@ENZIANINN.COM CONFERENCES, MEETINGS, & EVENTS Meeting and Banquet Rooms Five unique meeting and event rooms with over 8300 sf of event space. Catered events are served amidst stunning views in our Fourth Floor Solarium Banquet Room. All meeting rooms have complimentary wifi and flat screen projection with HDMI or VGA connectivity. Our largest meeting room has three screen projection. Perfect for speakers and presenters. Audio /projection packages include lectern, wired or wireless mics, including lapel mics.  Our staff is here to provide what you need to present your event. Located just a stroll across the street from Village restaurants, shops, and activities it is easy to connect in Leavenworth. Our friendly, knowledgeable staff is always willing to help your guests discover local venues, activities, and sights. The Enzian is well known for it’s guest amenities—our daily breakfast buffet with omelet bar, morning alphorn serenade, the 18 hole Enzian Falls Putting Course, indoor and outdoor pool and hot tub, racquetball/basketball court, fitness room, wifi in all lodging rooms, always easy/free parking and no hidden charges.  Your guests deserve the best  all the time, every time. GENERAL CONFERENCES & RETREATS The Enzian Inn has an outstanding reputation for providing Conferences and Retreats with warm hospitality and personalized service. Our experiences sales,  hospitality and catering team are ready to facilitate every aspect of your event for 12-180 attendees. Five unique meeting and event rooms Over 8300 sf of event space with Solarium Banquet Room for catered meals or hospitality gatherings. All meeting rooms have complimentary wifi and flat screen projection with HDMI or VGA connectivity. Our largest meeting room has three screen projection. Audio /projection packages include lectern, wired or wireless mics, including  lapel mics.  Polycom service available.  Conference Aids are always complimentary when requested. SMALL GROUP MEETING PACKAGES These inclusive packages make it easy to plan for groups under 30 attendees, and manage costs effectively and affordably. Perfect for Board Retreats and Small Meetings. Per night charges enable you to plan your perfect fit – an overnight or extended stay meeting. Inclusive rate includes Continuous Coffee Service, Break Service, In Room Meeting Lunch, Meeting Room, A/V and Conference Aids. MINISTRY RETREATS & GATHERINGS The Enzian Inn has created a venue packet specific to churches and the needs of ministry. Information is presented in a manner that makes it easy for all departments, ministry leaders, administrators, and the church family. Small churches can expand their walls and scope of ministry here. Large churches can create the smaller arena so necessary for connectivity. We welcome you. We welcome your call to share more about how the Enzian Inn can partner with your church. SOCIAL GROUPS & GATHERINGS It is an honor to work in the hospitality industry and a great joy to be part of bringing people together, to reconnect and to build new and ongoing memories. If you are a professional, class, military, or family reunion, we are pleased to help you bring your family and friends to Leavenworth’s Enzian Inn. With 33 single queen rooms and 55 double queen rooms, plus deluxe and suite offerings, we can provide well for families and reunion groups of all sizes. Our fourth floor solarium dining room, makes our complimentary breakfast an event and a good time to share and catch up with the people dear to our hearts. Please talk with the sales office about gathering rooms or reserving banquet space for a catered meal, or with help in finding local venues that your group will enjoy for off site options. CATERING GUIDELINES & SAMPLE MENU Our menus offer a variety of selections and services to provide onsite catering for your event. Our beautiful Continental Room can host banquets, buffet style or served meals and receptions with an array of hors d’ oeuvres. We can also provide services delivered to conference rooms such as small meeting lunches. Try one of our fun themed break services or order ala carte. Our Director of Catered Events is available to assist in making selections that are customized to fit your schedule and event. We look forward to serving you at your next conference. Groups over 120 will have a specialized banquet menu created to fit the vision of a large event. Similar menu options will be offered for all events. Click here to download Venue & General Information Packet. Event Office 509.548.5269 x197 direct 800.223.8511 toll-free Events@enzianinn.com RESERVATIONS: 509-548-5269 ADDRESS: 590 US Hwy 2, Leavenworth, Washington 98826 E-MAIL: info@enzianinn.com RESERVATIONS | ACCOMMODATIONS | ROOMS & EVENTS For a relaxing spa experience, please also consider our sister property, the adult-only Posthotel & Spa . RESERVATIONS: 509-548-5269 590 US Hwy 2, Leavenworth, Washington 98826 RESERVATIONS ACCOMMODATIONS ROOMS & EVENTS COPYRIGHT © ENZIAN INN, INC. 2024. ALL RIGHTS RESERVED. Link to Facebook Link to Instagram PRIVACY TERMS & CONDITIONS Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://enzian.org/friends/enzian-shop/",
      "text": "Enzian Shop - Enzian Theater Menu Film + / Films & Events + / Calendar + / Special Programs + / Festivals + / Food + / Friends + / Membership + / Donate + / Sponsor + / Volunteer + / Theater Rental + / Enzian Shop + / Call or visit the box office with any questions 1300 SOUTH ORLANDO MAITLAND, FL 32751 (407) 629-0054 | Search for: Search for: Enzian and Eden Bar Apparel Store Click the link above to view our branded apparel. Every purchase helps our nonprofit organization, and shipping is included in the price! Evening for Two – $40 2 Regular Film Admission & $15 to spend on food & drink at Enzian or Eden Bar A Gift of Film – $12.50 1 Regular Film Admission Enzian Sticker Pack –  $10 Purchase a 4-Pack of stickers to represent your favorite local art house theater on water bottles, laptop cases, your phone… wherever you want! Sticker packs purchased online are mailed out within two days to the address specified while checking out. They make a great add-on to any gift! E-Bucks (any increment of $5) E-bucks can be spent on anything at Enzian or Eden Bar, like Food, Drinks, or Tickets to movies & events! Gift of Membership Starting at $60. No paperwork required just give a lovely voucher and the recipient can register at their convenience. For more information on membership click here . We are unable to support sending gift certificates via email. When purchasing online, you will need to provide an address for a physical certificate to be shipped to, and your order cannot also contain tickets to an event. You may provide a special message for the recipient in the “comments/special instructions” section, which we will include on a card in the envelope. Gift certificates are put in the mail within two days and must be redeemed in person. If you have any questions, please contact us at boxoffice@enzian.org or 407-629-1088 ext 0230. TICKETS START AT Regular $12.50 Student/Senior/Military (with ID) $11.00 Matinees $11.00 Film Society Members $10.00 CONTACT 1300 South Orlando Avenue Maitland, FL 32751 Info Line: (407) 629-0054 Theater Offices: (407) 629-1088 About | COVID-19 Safety | FAQ | Mission + Leadership | Theater Rental | Volunteer | Press | Jobs | Privacy | Contact | Home Calendar Donate Food"
    },
    {
      "url": "https://www.eden.com/contact/",
      "text": "Contact Us | Eden Real estate Real estate Our real estate A strategically assembled real estate portfolio worth in excess of $100 million. Real estate assets UNICOM Science & Technology Park, Whitehouse Station, NJ UNICOM Technology Park, Chantily, VA UNICOM Innovation Park, Schaumburg, IL PickFair Estate, Beverly Hills, CA The Orangery, Crawley, UK Crabbet Park House, Crawley, UK Wingsweep, Temecula, CA Roripaugh Ranch, Temecula, CA Business & Financial Mergers & Acquisitions Company Company Our company Eden fosters growth by acquiring real estate assets that are used for regional operations, corporate retreats, and special events. Overview About Contact Press Newsroom Search Contact us Need to get in touch? Fill out the form below and we'll get back to you. Name * Email * Country * Message To receive occasional updates about UNICOM Systems Inc's products, services, news and events, please tick the box below. You can unsubscribe at any time. Yes, I would like to receive communications from UNICOM Systems Inc. For details on how your data is stored and used, please visit our Privacy Statement . Submit Eden UNICOM Plaza Suite 310 15535 San Fernando Mission Blvd. Mission Hills, CA 91345 United States +1.818.838.0606 +1.818.838.0776 info@unicomglobal.com Loading... UNICOM divisions Enterprise software IT infrastructure Government technology Finance & real estate Useful links About Contact Real Estate Business and financial services Mergers and acquisitions Newsroom Sitemap Privacy & legal Privacy Cookies Legal Do not sell my personal information Social media © 2025 Eden    |    All rights reserved."
    },
    {
      "url": "https://www.theedenproject.com/who-we-are/",
      "text": "Who We Are | Eden Project Skip to content Main Menu Resources (Re)Story (Re)Form JH Retreats EL Cohorts Give Who We Are We’re glad you’re here! Let us intro­duce you to the people behind The Eden Project. The Eden Team is made up of men and women with a passion for people to experience and learn to live at home in the love of God. The Team represents a diverse background with decades of leadership and pastoral experience, supported by a deeply invested and engaged board of directors. The Eden Team Nathan Wagnon Co-Founder & CEO Chuck Gschwend Co-Founder & Director of Eden Lead Duke Revard Co-Founder & Eden Lead Marketplace Dustin Flueckiger Director of Development Melissa Miller Women’s Director Eric Field​ Marketing Coordinator Lindy Gschwend Eden Lead Assistant The Eden Project Board Nathan Wagnon Co-Founder & CEO, The Eden Project Brett Bruster Lay Leader, Watermark Church Gordon Ip President, Genesis Real Estate Group Eddy Badrina CEO, Eden Green Technology Pat Dunne JPMChase & BOK Financial (Retired) The Eden Project team believes there are no experts in the company of Jesus . . . we are all learners. We are committed to helping people experience and live at home in the love of God. If you’d like to contact any of our team members please email info@edenteam.org . Eden Newsletter Sign up to receive weekly emails that include teaching, personal stories, and ways to connect with the Eden Project. All subscribers also receive a free copy of our Triad Guide & How to Pray the Psalms Guide ! About The Team Our Mission Eden Creed Apostle’s Creed The Team Our Mission Eden Creed Apostle’s Creed Retreats The Journey Home Retreat Eden Lead Cohorts The Journey Home Retreat Eden Lead Cohorts Resources (Re)Story Podcasts (Re)Form Podcasts Videos Newsletters (Re)Story Podcasts (Re)Form Podcasts Videos Newsletters The Team Our Mission Eden Creed Apostle’s Creed The Team Our Mission Eden Creed Apostle’s Creed The Journey Home Retreat Eden Lead Cohorts The Journey Home Retreat Eden Lead Cohorts (Re)Story Podcasts (Re)Form Podcasts Videos Newsletters (Re)Story Podcasts (Re)Form Podcasts Videos Newsletters Copyright © Eden Project 2025, All Rights Reserved Back to Top Contact Us Mailing Address: 7616 LBJ FWY Ste 735 Dallas, TX 75251 Facebook Twitter Instagram Youtube Linkedin Back Home Resources (Re)Story (Re)Form Journey Home Eden Cohorts About The Team Our Mission Eden Creed Apostle’s Creed More Experience Deep Connection at Eden Chapters Triad Guides Learning to Pray the Psalms Guide Contact Us Give Close"
    },
    {
      "url": "https://edengrowsystems.com/contactus",
      "text": "Contact Us Payment plans as low as $30 per month. Credit approval required. Home Shop Contact Us My Cart Wishlist 0 Sign in Contact Us We'll do our best to get back to you as soon as possible. Or call us at 877-333-6476 . We'd love to hear your questions! Your Name Phone Number Email Subject Your Question Send Eden Grow Systems 710 N. Post Oak Rd Suite 400 Houston TX 77024 United States 8773336476 inquiry@edengrowsystems.com Google Maps Providing sustainable food and energy independence to local communities around the world, and one day, off it . SITE MAP EDEN APP BLOG MEDIA-NEWS ABOUT US JOBS PRIVACY POLICY CONTACT US 1-877-EDENGRO (1-877-333-6476) inquiry@edengrowsystems.com NEWSLETTER Subscribe Thanks Copyright © Eden Grow Systems Powered by - \n                    An awesome Open Source CRM"
    },
    {
      "url": "https://edenrecruitment.ie/contact-us/",
      "text": "Contact Us | Office Jobs | Finance Jobs | Eden Recruitment Saved Jobs (0) Login/Register Login Logout Submit CV Saved Jobs (0) Login/Register Login Logout Submit CV About us Job Seeker Job Seeker Job Search Job Alerts Submit CV Employer News & Insights Contact Us About us Job Seeker Job Seeker Job Search Job Alerts Submit CV Employer News & Insights Contact Us Contact Us You deserve to be happy at work! Let's talk about how we can make that happen. You'll find our new offices right in the heart of Dublin's Temple Bar. 20 Essex Street East, Temple Bar, Dublin 2 Phone: +353 1 474 4500 Email: jobs@edenrecruitment.ie Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Message Submit Company Home About us Meet the Leadership Team Insights Contact Us Home About us Meet the Leadership Team Insights Contact Us Job Seekers Job Seeker Send a CV Job Search Job Alerts Job Seeker Send a CV Job Search Job Alerts Staffing Services Hire Talent Hire Talent Office 20 Essex Street East Temple Bar Dublin 2 D02 F670 20 Essex Street East Temple Bar Dublin 2 D02 F670 Contact 353 1 474 4500 jobs@edenrecruitment.ie 353 1 474 4500 jobs@edenrecruitment.ie © 2025 Eden Recruitment Privacy Policy Site by Vinctos Ltd © 2025 Eden Recruitment Privacy Policy Site by Vinctos Ltd This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    }
  ]
}