{
  "fuentes": [
    {
      "url": "https://www.giftly.com/gift-card/edge-rooftop-cocktail-lounge-tampa",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/edge-rooftop-cocktail-lounge-tampa",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.tripadvisor.ca/Attraction_Review-g34678-d6016240-Reviews-EDGE_Rooftop_Cocktail_Lounge-Tampa_Florida.html",
      "email": "kscott@epicureanhotel.com"
    },
    {
      "url": "https://thevendry.com/venue/222275/edge-rooftop-cocktail-lounge-tampa-fl",
      "email": "sales@epicureanhotel.com"
    }
  ],
  "mails": [
    "corporate@giftly.com",
    "kscott@epicureanhotel.com",
    "merchants@giftly.com",
    "sales@epicureanhotel.com"
  ],
  "nombre_sitio": "epicureanhotel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.giftly.com/gift-card/edge-rooftop-cocktail-lounge-tampa",
      "text": "EDGE Rooftop Cocktail Lounge Giftly - Email, Text or Print, 1207 S Howard Ave, Tampa, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Tampa Going Out EDGE Rooftop Cocktail Lounge EDGE Rooftop Cocktail Lounge Gift Card EDGE Rooftop Cocktail Lounge Giftly A beautiful gift card alternative for EDGE Rooftop Cocktail Lounge EDGE Rooftop Cocktail Lounge 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount EDGE Rooftop Cocktail Lounge (109) (813) 999-8700 Categories Cocktail Bars, Lounges, New American Location 1207 S Howard Ave, Tampa, FL Gift Tips Try the Senorita cocktail, which features a delightful hint of spice – it's a must-try for cocktail enthusiasts. Make sure to order the Bayshore Gimlet, a refreshing cocktail that perfectly captures the essence of summer. For a savory snack, don't miss the Shrimp Cocktail – it's a classic choice and pairs well with any drink. Consider the spicy Margarita, which has received rave reviews for its fantastic balance of flavors, making it a perfect choice for a delightful evening. Opt for seating in the cozy couches for a more intimate experience, ideal for date nights or special gatherings. Click here to send a gift up to $1,000 with the suggestion to use it at EDGE Rooftop Cocktail Lounge. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about EDGE Rooftop Cocktail Lounge Price $$ Ambience Upscale Hours Wednesday-Thursday: 5PM-12AM Friday-Saturday: 5PM-1AM EDGE Rooftop Cocktail Lounge is an upscale destination in Tampa that combines stunning views with expertly crafted cocktails. Perched high above the city, this rooftop lounge provides a vibrant atmosphere ideal for unwinding with friends or enjoying a romantic evening. Guests can indulge in a selection of delicious appetizers that complement the drinks perfectly. The bar offers a varied cocktail menu, featuring unique concoctions like the Senorita and Bayshore Gimlet, both known for their distinctive flavors. The lounge's chic decor and comfortable seating create a relaxing ambiance, making it a favored spot for both locals and visitors alike. With stunning sunset views and a lively nightlife scene, EDGE Rooftop Cocktail Lounge is a must-visit for anyone seeking an unforgettable night out in Tampa. Great Alternatives Gift $100 for Jekyll : Jekyll at Hyde Park in Tampa is a captivating local hotspot, offering an exquisite dining experience that seamlessly blends innovative cuisine, a stylish atmosphere, and exceptional service. Buy a Gift & Greeting Card for Palihouse Lobby Bar - Hyde Park Village : Palihouse Lobby Bar - Hyde Park Village in Tampa offers a sophisticated and welcoming atmosphere to enjoy craft cocktails and small plates in style. Updated: September 01, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a EDGE Rooftop Cocktail Lounge gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at EDGE Rooftop Cocktail Lounge. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at EDGE Rooftop Cocktail Lounge or anywhere else they like! Top Related Gifts Yellow Pony Pub & Garden Savor Moments at Yellow Pony Pub 8510 NW 17th Ln, Ocala, FL 3.7 (147) • $$ • Lounges Cooper's Hawk Winery & Restaurant- Wesley Chapel Wines and Dishes for Every Palate 28963 State Rd 56, Wesley Chapel, FL 4.2 (236) • $$ • Wine Bars Main Street at Lakewood Ranch Music, Food, and Fun Await You 8100 Lakewood Main St, Bradenton, FL 5.0 (2) • Music Venues Flutes Champagne Bar Bubbles and Bliss Await You 480 N Orlando Ave, Winter Park, FL 4.7 (43) • Wine Bars CW's Gin Joint Crafted Cocktails and Tasty Bites 633 N Franklin St, Tampa, FL 4.1 (540) • $$ • Cocktail Bars Copper Shaker Crafted Sips and Savory Bites 1502 E 7th Ave, Tampa, FL 4.5 (115) • $$ • Cocktail Bars Hotel Bar Sip in Style at Tampa's Hot Spot 200 N Tampa St, Tampa, FL 4.3 (213) • $$ • Cocktail Bars Bar AW at Armature Works Craft Cocktails, Chill Vibes 1910 N Ola Ave, Tampa, FL 3.8 (102) • $$ • Cocktail Bars More Nearby Businesses Mandarin Heights 5901 N Florida Ave, Tampa, FL 4.3 (157) • $$ • Cocktail Bars M.Bird 1903 Market St, Tampa, FL 3.9 (552) • $$ • Cocktail Bars Repeal 18 9882 W Linebaugh Ave, Tampa, FL 4.4 (138) • $$ • Cocktail Bars LIT Cigar & Martini Lounge 908 N Franklin St, Tampa, FL 2.8 (37) • Cocktail Bars Native Cocktail Events 4520 W Oakellar Ave, Tampa, FL 5.0 (7) • Cocktail Bars Bouzy 1640 W Snow Ave, Tampa, FL 3.9 (157) • $$$ • Wine Bars Rowe Bar 3400 Gulf Blvd, Saint Pete Beach, FL 3.0 (52) • $$ • Cocktail Bars Sonder Social Club 966 Douglas Ave, Dunedin, FL 4.3 (170) • $$ • Cocktail Bars 360° Rooftop 3701 Gulf Blvd, Saint Pete Beach, FL 3.7 (55) • $$ • Cocktail Bars The Dan 905 N Florida Ave, Tampa Bay, FL 3.9 (124) • Cocktail Bars Cantina Viajero 1338 Epiphany Wy, New Port Richey, FL 4.1 (173) • $$ • Cocktail Bars Frescos Southern Kitchen & Bar 132 S Kentucky Ave, Lakeland, FL 3.6 (487) • $$ • Cocktail Bars BABs Secret Lounge 16540 Pointe Village Dr, Lutz, FL 4.3 (45) • Cocktail Bars In Between Days 2340 1st Ave S, St. Petersburg, FL 4.5 (101) • Cocktail Bars TASTE Downtown Tampa 513 South Florida Ave, Tampa, FL 4.2 (72) • $$ • Cocktail Bars Driftlight Lounge 510 Water St, Tampa, FL 4.0 (41) • $$ • Cocktail Bars Six 510 Water St, Tampa, FL 3.8 (116) • Cocktail Bars The Local Draught House 4308 W Gandy Blvd, Tampa, FL 3.3 (10) • Cocktail Bars Square 1 4100 George J Bean Pkwy, Tampa, FL 3.7 (16) • Cocktail Bars Side Piece 2202 W Platt St, Tampa, FL Sports Bars Tiki Docks Madeira 15015 Madeira Way, Madeira Beach, FL 4.0 (9) • $$ • Cocktail Bars Hi-Fi Rooftop Bar 453 Edgewater Dr, Dunedin, FL 3.9 (87) • $$ • Cocktail Bars Revival 119 S Kentucky Ave, Lakeland, FL 4.5 (97) • $$ • Cocktail Bars The Breakroom Bar & Grill 13575 58th St N, Clearwater, FL 4.3 (275) • $$ • Cocktail Bars Lazy Gator 102 W Shellpoint Rd, Ruskin, FL 3.8 (193) • $$ • Cocktail Bars Over The River 400 N. Ashley Dr, Tampa Bay, FL 4.3 (4) • Cocktail Bars Punch Room 500 Channelside Dr, Tampa Bay, FL 4.2 (32) • Cocktail Bars AC Lounge 395 Coronado Dr, Clearwater Beach, FL Cocktail Bars Yeoman's Topgolf Swing Suite 202 N Morgan St, Tampa, FL 4.1 (611) • $$ • Cocktail Bars Agave Social 14803 N Dale Mabry Hwy, Tampa, FL 4.6 (209) • $$ • Cocktail Bars First Chance Last Chance 1707 N 16th St, Tampa, FL 3.8 (75) • $ • Cocktail Bars Alter Ego 420 S Nebraska Ave, Tampa, FL 3.8 (58) • $$$ • Cocktail Bars The Attic 1510 E 8th Ave, Tampa, FL 3.9 (16) • $$$ • Cocktail Bars Sorsi 516 S Howard Ave, Tampa, FL 4.9 (7) • Wine Bars Mandarin Hide 231 Central Ave, Saint Petersburg, FL 4.3 (278) • $$ • Cocktail Bars Pan Filo's 656 S Gulfview Blvd, Clearwater Beach, FL 4.1 (315) • $$ • Cocktail Bars Slicker's Eatery 12012 Cortez Rd W, Bradenton, FL 4.6 (134) • $$ • Cocktail Bars Copper Shaker 169 1st Ave N, St Petersburg, FL 4.3 (147) • $$ • Cocktail Bars Salty Lime Cantina 1019 Florida Ave, Palm Harbor, FL 4.0 (315) • $$ • Cocktail Bars Arts Club 500 Channelside Dr, Tampa Bay, FL 4.1 (12) • Cocktail Bars Sparrow Rooftop 1234 Central Ave, St. Petersburg, FL 3.0 (43) • Cocktail Bars Jamminz Beach Bar 411 Mandalay Ave, Clearwater, FL 3.0 (74) • $ • Cocktail Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Cocktail Bars Lounges New American 3.7 100-199 4 single place gcdp giftly_in_title_tag Tampa, FL XXL M Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.tripadvisor.ca/Attraction_Review-g34678-d6016240-Reviews-EDGE_Rooftop_Cocktail_Lounge-Tampa_Florida.html",
      "text": "EDGE ROOFTOP COCKTAIL LOUNGE (2025) All You MUST Know Before You Go (w/ Reviews) Skip to main content Discover Trips Review CAD Sign in Tampa Hotels Things to Do Restaurants Flights Cruises Vacation Rentals Forums United States Florida (FL) Tampa Things to do in Tampa EDGE Rooftop Cocktail Lounge See all things to do EDGE Rooftop Cocktail Lounge Share Review Save See all things to do EDGE Rooftop Cocktail Lounge 4.1 4.1 4.1 of 5 bubbles ( 69 reviews ) #9 of 127 Nightlife in Tampa 31 What is Travellers’ Choice? Tripadvisor gives a Travellers’ Choice award to accommodations, attractions and restaurants that consistently earn great reviews from travellers and are ranked within the top 10% of properties on Tripadvisor. About The rooftop bar at the Epicurean Hotel. Cocktails, wine, beer, small plates, sunsets and night caps! We look forward to welcoming you. Read more Open now 5:00 PM - 12:00 AM Thursday 5:00 PM - 12:00 AM Friday 5:00 PM - 12:00 AM Saturday 5:00 PM - 12:00 AM Sunday Closed Monday Closed Tuesday Closed Wednesday 5:00 PM - 12:00 AM Suggest edits to improve what we show. Improve this listing About The rooftop bar at the Epicurean Hotel. Cocktails, wine, beer, small plates, sunsets and night caps! We look forward to welcoming you. Read more Suggest edits to improve what we show. Improve this listing Hours Open now Thursday 5:00 PM - 12:00 AM Recommended experiences nearby Tampa's ZooQuarium Admission 4.2 of 5 bubbles ( 12 ) Duration: 2–8 hours Free cancellation from C$128 Reserve Likely To Sell Out* Guided Tampa Sightseeing Tour in New Street Legal Golf Cart 4.9 of 5 bubbles ( 65 ) Duration: 90–120 minutes Free cancellation from C$64 Reserve Tiki Boat - Downtown Tampa - The Only Authentic Floating Tiki Bar 4.4 of 5 bubbles ( 68 ) Duration: 1h 30m from C$85 Reserve Small Group Tampa Sightseeing City Bus Tour 5 of 5 bubbles ( 40 ) Duration: 90–120 minutes Free cancellation from C$71 Reserve Luxury Private Boat Charter 4.4 of 5 bubbles ( 13 ) Duration: 3–7 hours Free cancellation from C$1,301 Reserve Historic Ybor City Food Walking Tour 4.8 of 5 bubbles ( 1,908 ) Duration: 3h Free cancellation from C$127 Reserve Guided Tampa Sightseeing Tour in a Deluxe Street Legal Golf Cart 4.9 of 5 bubbles ( 640 ) Duration: 90–120 minutes Free cancellation from C$70 Reserve Tampa Bay CityPASS® 4.4 of 5 bubbles ( 62 ) Duration: 9 days from C$212 Reserve Escape Game at Midtown Tampa 5 of 5 bubbles ( 52 ) Duration: 1h 15m Free cancellation from C$58 Reserve Tampa Indoor Skydiving Experience with 2 Flights & Personalized Certificate 4.4 of 5 bubbles ( 33 ) Duration: 1h 15m Free cancellation from C$145 Reserve Are you currently on your trip? Help us find experiences available for you. Yes No The area Address 1207 S Howard Ave Rooftop of the Epicurean Hotel, Tampa, FL 33606-3101 Reach out directly Visit website Call Email Best nearby Restaurants 867 within 5 kms Harry Waugh Dessert Room at Bern's Steak House 4.7 4.7 of 5 bubbles ( 1,383 ) 0.2 km $$$$ • Dessert • American • Vegetarian friendly Bern's Steak House 4.4 4.4 of 5 bubbles ( 4,804 ) 0.2 km $$$$ • Steakhouse • Seafood • Vegetarian friendly Bosphorous Turkish Cuisine - South Tampa 4.9 4.9 of 5 bubbles ( 117 ) 0.7 km $$ - $$$ • Mediterranean • Turkish • Vegetarian friendly Bella's Italian Café 4.4 4.4 of 5 bubbles ( 475 ) 0.2 km $$ - $$$ • Italian • Pizza • Vegetarian friendly Green Lemon 4.4 4.4 of 5 bubbles ( 442 ) 0.5 km $$ - $$$ • Mexican • Southwestern • Vegetarian friendly Fresh Kitchen 4.6 4.6 of 5 bubbles ( 192 ) 0.1 km $ • American • Fast food • Vegetarian friendly Daily Eats 4.4 4.4 of 5 bubbles ( 533 ) 0.5 km $$ - $$$ • Healthy • American • Vegetarian friendly Haven 4.5 4.5 of 5 bubbles ( 223 ) 0.4 km $$ - $$$ • American • Contemporary • Vegetarian friendly Bulla Gastrobar 4.5 4.5 of 5 bubbles ( 171 ) 0.5 km $$ - $$$ • Bar • Spanish • Vegetarian friendly Elevage 4.1 4.1 of 5 bubbles ( 335 ) 36 m $$$$ • American • International • Vegetarian friendly See all Attractions 262 within 10 kms Tampa Riverwalk 4.5 4.5 of 5 bubbles ( 1,898 ) 2.9 km Scenic Walking Areas Henry B. Plant Museum 4.5 4.5 of 5 bubbles ( 847 ) 2.6 km History Museums Hyde Park Village 4.2 4.2 of 5 bubbles ( 86 ) 1 km Shopping Malls The Florida Aquarium 4.2 4.2 of 5 bubbles ( 5,939 ) 4 km Aquariums Amalie Arena 4.5 4.5 of 5 bubbles ( 1,954 ) 3.4 km Arenas & Stadiums Tampa Theatre 4.8 4.8 of 5 bubbles ( 722 ) 3.3 km Theatres SoHo 4.2 4.2 of 5 bubbles ( 26 ) 0.6 km Neighbourhoods Tampa Bay History Center 4.4 4.4 of 5 bubbles ( 642 ) 3.6 km History Museums The University of Tampa Campus 4.7 4.7 of 5 bubbles ( 110 ) 2.6 km Points of Interest & Landmarks • Universities & Schools Hyde Park 4.5 4.5 of 5 bubbles ( 185 ) 2.2 km Neighbourhoods • Points of Interest & Landmarks Straz Center for the Performing Arts 4.5 4.5 of 5 bubbles ( 561 ) 3.1 km Theatres Glazer Children's Museum 4.3 4.3 of 5 bubbles ( 500 ) 3.1 km Children's Museums Curtis Hixon Waterfront Park 4.5 4.5 of 5 bubbles ( 290 ) 3 km Parks Bayshore Boulevard 4.5 4.5 of 5 bubbles ( 972 ) Hiking Trails Sacred Heart Catholic Church 4.8 4.8 of 5 bubbles ( 160 ) 3.4 km Churches & Cathedrals TECO Line Streetcar System 4.5 4.5 of 5 bubbles ( 514 ) Trams International Plaza and Bay Street 4.4 4.4 of 5 bubbles ( 450 ) Shopping Malls Sparkman Wharf 4.3 4.3 of 5 bubbles ( 126 ) 3.8 km Parks Cigar City Brewing 4.6 4.6 of 5 bubbles ( 689 ) 4.1 km Breweries Heights Public Market 4.5 4.5 of 5 bubbles ( 68 ) 3.9 km Farmers Markets Tampa Museum of Art 3.7 3.7 of 5 bubbles ( 391 ) 2.9 km Art Museums SS American Victory Mariners' Memorial and Museum Ship 4.1 4.1 of 5 bubbles ( 401 ) 4.1 km Military Museums • Ships Tampa Convention Center 4.1 4.1 of 5 bubbles ( 253 ) 3 km Convention Centres Tampa Antiques and Books 5.0 5 of 5 bubbles ( 2 ) 1 km Antique Shops Raymond James Stadium 4.2 4.2 of 5 bubbles ( 1,142 ) Arenas & Stadiums Ybor City 4.0 4 of 5 bubbles ( 3,127 ) Historic Sites • Neighbourhoods Centro Asturiano De Tampa 3.6 3.6 of 5 bubbles ( 8 ) 2.5 km Historic Sites Davis Island Dog Beach 4.1 4.1 of 5 bubbles ( 34 ) 4.2 km Parks Dark Door Spirits 4.4 4.4 of 5 bubbles ( 9 ) 1.3 km Distilleries Waterworks Park 4.4 4.4 of 5 bubbles ( 38 ) 3.9 km Parks George M. Steinbrenner Field 4.4 4.4 of 5 bubbles ( 656 ) Arenas & Stadiums Michael Murphy Gallery 5.0 5 of 5 bubbles ( 2 ) 1.4 km Art Galleries Ballast Point Park 4.4 4.4 of 5 bubbles ( 119 ) 4.6 km Parks • Playgrounds WestShore Plaza 3.9 3.9 of 5 bubbles ( 102 ) 4.6 km Shopping Malls Madewell 5.0 5 of 5 bubbles ( 2 ) 0.9 km Department Stores Julian B Lane Riverfront Park 4.6 4.6 of 5 bubbles ( 8 ) 3 km Parks Tampa Police Museum 4.4 4.4 of 5 bubbles ( 11 ) 3.2 km Speciality Museums • History Museums Butterfly Tampa 4.5 4.5 of 5 bubbles ( 2 ) 2.9 km Nature & Wildlife Areas • Zoos Tampa Union Station 3.8 3.8 of 5 bubbles ( 24 ) 4.1 km Historic Sites Hyde Park Village Circle 5.0 5 of 5 bubbles ( 1 ) 1 km Parks Cypress Point Park 4.0 4 of 5 bubbles ( 138 ) Parks Ybor City Museum State Park 4.4 4.4 of 5 bubbles ( 183 ) History Museums Cotanchobee Fort Brooke Park 4.1 4.1 of 5 bubbles ( 18 ) 3.3 km Bodies of Water • Parks Playgrounds 4.6 4.6 of 5 bubbles ( 10 ) 4 km Playgrounds MacDill Park 4.0 4 of 5 bubbles ( 8 ) 3 km Parks Gasparilla Distillery & Cocktail Bar 4.9 4.9 of 5 bubbles ( 63 ) Distilleries Anthropologie, 4.0 4 of 5 bubbles ( 1 ) 1.1 km Department Stores Hidden Springs Ale Works 4.4 4.4 of 5 bubbles ( 39 ) 4 km Breweries Beer, Bourdon & BBQ Festival 5.0 5 of 5 bubbles ( 1 ) 3 km Food & Drink Festivals Magnanimous Brewing 4.8 4.8 of 5 bubbles ( 8 ) 3.8 km Breweries ZooTampa At Lowry Park 4.3 4.3 of 5 bubbles ( 4,142 ) Zoos Anderson Park 5.0 5 of 5 bubbles ( 1 ) 2.5 km Parks Jose Marti Park 4.1 4.1 of 5 bubbles ( 32 ) Parks Salvation Army Thrift Store & Donation Center 5.0 5 of 5 bubbles ( 1 ) 1.5 km Antique Shops Tampa Firefighters Museum 4.1 4.1 of 5 bubbles ( 12 ) 3.7 km Speciality Museums • History Museums Gamblers bay distillery 5.0 5 of 5 bubbles ( 1 ) 2.5 km Distilleries Sunshine Thrift Store 3.3 3.3 of 5 bubbles ( 4 ) 3.7 km Antique Shops Tabellas At Delaney Creek 5.0 5 of 5 bubbles ( 1 ) 2.5 km Convention Centres Wildbook Hall 5.0 5 of 5 bubbles ( 1 ) 2.1 km Antique Shops Foreign Citizen 5.0 5 of 5 bubbles ( 1 ) 3.1 km Department Stores Lykes Gaslight Square Park 3.4 3.4 of 5 bubbles ( 5 ) 3.2 km Parks Apple Store 5.0 5 of 5 bubbles ( 1 ) 3.1 km Department Stores Florida Museum of Photographic Arts 3.6 3.6 of 5 bubbles ( 99 ) Art Museums Jobsite Theater 4.7 4.7 of 5 bubbles ( 3 ) 3.1 km Theatres Wat Mongkolratanaram Of Florida 4.6 4.6 of 5 bubbles ( 339 ) Religious Sites Scarfone/Hartley Gallery 4.0 4 of 5 bubbles ( 1 ) 2.3 km Art Museums Amalie Arena 4.0 4 of 5 bubbles ( 2 ) 3.4 km Arenas & Stadiums Al Lopez Park 4.2 4.2 of 5 bubbles ( 98 ) Parks Shanna and Bryan Glazer Jewish Community Center 5.0 5 of 5 bubbles ( 1 ) 2.1 km Convention Centres Hillsborough County Sheriff's Office History Museum 4.7 4.7 of 5 bubbles ( 3 ) 3.8 km Speciality Museums • History Museums Tampa / Hillsborough Convention and Visitors Association 3.7 3.7 of 5 bubbles ( 6 ) 3.1 km Visitor Centres LimoLogic LLC. 5.0 5 of 5 bubbles ( 3 ) 3 km Nordstrom Rack 5.0 5 of 5 bubbles ( 1 ) 3.9 km Department Stores Herman Massey Park 2.0 2 of 5 bubbles ( 1 ) 3.4 km Parks Water Works Park-amphitheatre 5.0 5 of 5 bubbles ( 1 ) 3.7 km Parks Joe Chillura Courthouse Square Park 4.0 4 of 5 bubbles ( 3 ) 3.5 km Parks Queenie's Dog Park 5.0 5 of 5 bubbles ( 1 ) 3.8 km Parks Water Works Park 5.0 5 of 5 bubbles ( 1 ) 3.9 km Parks Lowry Park 4.4 4.4 of 5 bubbles ( 208 ) Parks Walmart 5.0 5 of 5 bubbles ( 1 ) 3.7 km Department Stores See all Contribute Write a review Upload a photo Reviews Q&A Filters English Most Recent Most Recent: Reviews ordered by most recent publish date in descending order. Detailed Reviews: Reviews ordered by recency and descriptiveness of user-identified themes such as waiting time, length of visit, general tips, and location information. 4.1 4.1 of 5 bubbles ( 69 ) Excellent 32 Very good 21 Average 9 Poor 5 Terrible 2 Tampa2020 Tampa, FL 50 contributions 0 2 of 5 bubbles Rude bartenders Apr 2022 Management, please get new bartenders. This was the worst service I can remember. We were served (at the bar) by 2 different bartenders and they could not have acted more aloof and irritated if they tried. We were 2, quiet couples all around 60 ish at a table (as an aside if you have 3-4 staff behind the bar as we saw and only 10 or fewer customers, some table service would have been nice). Nevertheless approaching the bar, we were ignored, then finally asked what we wanted  - not by walking up to where we were standing but by shouting from the other end while leaning against the wall near the door to a back room. Best part is this happened again the second time we went up. Just rude. Read more Written April 18, 2022 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. TOURtheWORLDMexPal United States 4,558 contributions 0 3 of 5 bubbles Nothing special about the bar nor the view Jun 2021 Nothing special about the bar nor the view Service: non-existent May be it is a place just for very young folks and for large groups. Read more Written June 26, 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. MzMima Lakeland, FL 1 contribution 0 3 of 5 bubbles It was ok....... Mar 2021 I went to this beautiful \"The Edge\" bar last night with some friends. The place was a beautiful setting. I did not know you cant have dinner on the roof top bar itself but you can have these small snack plates which they do offer on the roof top bar itself. They are a bit pricey for the portions they give you. The staff was excellent, polite and the drinks were great too but i feel it could have been better for a rooftop bar.  Music was ok...  You get there and have to wait for a bit to go upstairs because of the covid, they dont want to many ppl up there. You do have to pay for parking after 7pm.  It is a great place to have lunch but for my night time review of this place i want to give a 3 star. Read more Written March 28, 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Renae U Cleveland, OH 6 contributions 0 5 of 5 bubbles Short stay Feb 2021 My husband and I stayed at the Edge hotel for a night.  The rooftop bar is where we spent most of the time due to the pool bar being closed during the week...that was a disappointment. But Dan the bartender who worked his tail off to please the customers had such a great attitude and made our stay better.  I'm not sure why he had no one to help him throughout the day and into happy hour but he handled it very well and kept a smile on his face the whole time.  I would return to the Roof top bar again  but not stay at the hotel. Read more Written February 15, 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Teakwo23 Palm Harbor, FL 6,600 contributions 0 4 of 5 bubbles Veggie cocktails? Feb 2020 • Couples Cool atmosphere with outdoor patio area. Service was a bit slow. Weird drink menu with vegetable drinks on it. Old fashioned was good. Read more Written February 19, 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there Teakwo23!\nThank you so much for joining us and taking a moment to share your thoughts and feedback around your experience. As Tampa's favorite food & wine hotel we wanted to provide a creative spin on a few culinary focused cocktails. They are light, refreshing and pair well with the amazing weather we've been having. At the same time we are known for our old fashioned and are so pleased to read you enjoyed it. \nAgain, thank you for visiting and we hope to welcome you back soon!\nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written February 24, 2020 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. Anne F Palm Harbor, FL 4,767 contributions 0 4 of 5 bubbles S&P Feb 2020 • Couples Fun little rooftop bar in a pretty aNd modern South Tampa Hotel. Nice crowd and comfortable lounging. Drink menu was however odd with 1/2 the drinks containing either lettuce, peas, or salt and pepper?! However old fashioneds were good and loved the big clear rocks sphere and view in an area with lots to do. Read more Written February 17, 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there Anne!\nThank you so much for joining us at EDGE and for taking a moment to share your experience. We loved having you and appreciate your kind words around our space, crowd and view. Please note that while many of the drinks you mentioned are changing we have no plans to take away the Old Fashioned! \nAgain, thank you for joining us and we look forward to welcoming you back soon. \nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written February 19, 2020 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. Glenn C Madeira Beach, FL 129 contributions 1 3 of 5 bubbles Cool atmosphere but pricey drinks and rough service Dec 2019 Came here for a few drinks before heading over to Burns steakhouse. We ordered two top shelf Whiskeys on the rocks.  The bartender, \"Nevena\"  grabs the rocks glasses off the shelf by putting her fingers into the glass holding them from the top. No, No, No,  Never put your fingers inside a customers drink glass !!! Then using a shot jigger precisely measures up the line (1.5oz) not a drop more and while dumping the shot into the glass spills little over the side of the glass.  Geez, happened with both drinks.. I did really like the single big square Ice cubes for rocks drinks. Read more Written December 16, 2019 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there Glenn!\nThank you so much for joining us at EDGE and for taking a moment to share your thoughts from your recent experience this weekend. While we are thrilled to hear you enjoyed the atmosphere you are absolutely right about the behavior witnessed. It's not allowed for any service staff to put fingers in a guests glass. I'm terribly sorry that this happened and we'll be re-training the entire team on this standard. \nWe'd love to welcome you back for a round of drinks of us given the experience you had. Please don't hesitate to reach out to me directly to set up. \nAgain, thank you for joining us and we hope you have a wonderful holiday and amazing 2020!\nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written December 23, 2019 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. NFulton 1 contribution 0 5 of 5 bubbles Drinks w/ my girls Jul 2019 • Friends We had a women empowerment meet up here and I was simply blow away by the friendly staff and the amazing drinks. I would definitely be going back and happy with my entire service here! Read more Written August 23, 2019 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there NFulton5!\nFirst, thank you for joining us for the women empowerment event. We were grateful to play a small role in the event and are thrilled to hear how great of a time you had with us. Our team takes immense pride in providing our guests with delicious food and beverage offerings and personalized service. \nAgain, we are so happy to have you join us and cannot to welcome you back. \nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written August 28, 2019 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. airie2011 Tampa, FL 955 contributions 0 5 of 5 bubbles Nice Rooftop with Unique Drinks May 2019 • Couples Love the renovated rooftop bar. We enjoy coming here for craft cocktails after dinner downstairs. I was very impressed with a drink I had last time we visited that was supposed to taste like a salad. It was very refreshing and interesting and unique. This is why I will continue to come here. The view is nice, its not amazing, but you can see downtown off in the distance. Its kind of a small space, but its not too crowded. It wasn't super  busy any of the times we visited. Read more Written July 18, 2019 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there airie2011!\nThank you so much for joining us and for taking a moment to share your thoughts and feedback around the recent enhancements we've made to EDGE. After listening to our guests for the past year we decided it was time to give EDGE it's own roof. Love that you enjoyed the Ahead of Lettuce cocktail as well! So tasty and refreshing. \nAgain, thank you for joining us and we look forward to welcoming you back soon. \nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written July 22, 2019 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. O N Fort Lauderdale, FL 106 contributions 1 5 of 5 bubbles Very Surprised Apr 2019 • Solo I'm very skeptical about hotel food... however, didn't want to leave hotel for dinner and decided to go up to 4th floor and enjoy the breeze... I was very pleased with the burger I ordered.  Great flavor and freshness. I was truly surprised... Service by Sierra and Frank was great!!  Buen Provecho!! Read more Written April 11, 2019 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Kevin Scott Hello there 681on,\nThank you so much for staying with us and for taking a moment to share your story with us. We complete understand your viewpoint and come across this a fair amount even though we are considered to be Tampa's favorite food & wine hotel. As with other guest's we are thrilled to hear that the service and food & beverage offerings provided exceeded your expectations. Our team takes immense pride in making sure that our guests are treated like heroes.\nAgain, thank you for joining and we hope to welcome you back soon!\nKind regards,\nKevin Scott\nkscott@epicureanhotel.com Read more Written April 16, 2019 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. 1 2 3 4 5 6 … Showing results 1 - 10 of 68 No questions have been asked about this experience Ask a question Also popular with travellers See all Nightly Spirits Ghost Tours 4.8 4.8 of 5 bubbles ( 160 ) Bar, Club & Pub Tours • Ghost & Vampire Tours Historic Ybor Topgolf Tampa 4.4 4.4 of 5 bubbles ( 485 ) Bars & Clubs • Game & Entertainment Centres Open now Corona Cigar Company & J.C. Newman Diamond Crown Lounge 4.9 4.9 of 5 bubbles ( 68 ) Bars & Clubs • Cigar Bars Open now King Corona Cigars Cafe and Bar 4.6 4.6 of 5 bubbles ( 124 ) Speciality & Gift Shops • Cigar Bars Open now • Historic Ybor Staying Afloat Party Boat 4.9 4.9 of 5 bubbles ( 37 ) City Tours • Bar, Club & Pub Tours Open now The Sail Pavilion on the Riverwalk 4.1 4.1 of 5 bubbles ( 91 ) Bars & Clubs Open now Cigar City Cider and Mead 4.6 4.6 of 5 bubbles ( 34 ) Bars & Clubs Historic Ybor The Tampa Improv 4.0 4 of 5 bubbles ( 115 ) Theatres • Comedy Clubs Historic Ybor Splitsville 3.8 3.8 of 5 bubbles ( 101 ) Bowling Alleys • Bars & Clubs Open now Side Splitters Comedy Club 3.8 3.8 of 5 bubbles ( 113 ) Comedy Clubs Open now As Featured In By Amber C. Snider 6 must-visit cities in Florida, beyond Miami and Orlando Go beyond the hot spots for stellar Cuban cuisine, wildlife experiences, and more. *Likely to sell out: Based on Viator’s booking data and information from the provider from the past 30 days, it seems likely this experience will sell out through Viator, a Tripadvisor company. EDGE ROOFTOP COCKTAIL LOUNGE (2025) All You MUST Know Before You Go (w/ Reviews) Tampa Tampa Tourism Tampa Hotels Tampa Bed and Breakfast Tampa Vacation Rentals Flights to Tampa Tampa Restaurants Tampa Attractions Tampa Travel Forum Tampa Photos Tampa Map Hotels All Tampa Hotels Tampa Hotel Deals Last Minute Hotels in Tampa Hotels near EDGE Rooftop Cocktail Lounge Hotels Near Me By Hotel Type Tampa Motels Tampa Hostels Tampa Campsites Tampa Luxury Hotels Tampa Green Hotels Tampa Beach Hotels Business Hotels Tampa Tampa Casinos Tampa Resorts Spa Resorts Tampa Romantic Hotels Tampa Tampa Family Hotels By Hotel Class 5-Star Hotels in Tampa 3-Star Hotels in Tampa 4-Star Hotels in Tampa By Hotel Brand Red Roof Inns in Tampa Fairfield (Marriott Bonvoy) Hotels in Tampa Hampton by Hilton Hotels in Tampa Courtyard (Marriott Bonvoy) Hotels in Tampa WoodSpring Suites in Tampa Hilton Garden Inns in Tampa Rodeway Inns in Tampa La Quinta Inns & Suites in Tampa Motel 6 Hotels in Tampa Choice Hotels in Tampa Marriott Hotels in Tampa Hilton Hotels in Tampa Radisson Hotels in Tampa Hyatt House Hotels in Tampa Hyatt Place Hotels in Tampa Popular Amenities Tampa Hotels with Parking Tampa Hotels with a Pool Pet Friendly Hotels in Tampa Popular Neighbourhoods Downtown Hotels Historic Ybor Hotels Hotels near Old West Tampa Hotels near Southeast Seminole Heights Hotels near South Westshore Hotels near South Seminole Heights Hotels near Sunset Park Hotels near Highland Pines Hotels near Palma Ceia Hotels near Old Seminole Heights Popular Tampa Categories Budget Hotels in Tampa Hotels with Balconies in Tampa Hotels with Smoking Rooms in Tampa Hotels with Shuttle in Tampa Hotels with Kitchenette in Tampa Hotels with Hot Tubs in Tampa Tampa Accessible Hotels Tampa Hotels with Outdoor Pool Tampa Hotels with a View Tampa Non-Smoking Hotels Near Landmarks Hotels near Busch Gardens Hotels near The Florida Aquarium Hotels near ZooTampa At Lowry Park Hotels near Ybor City Hotels near Seminole Hard Rock Casino Tampa Hotels near Amalie Arena Hotels near Tampa Riverwalk Hotels near Museum of Science and Industry Hotels near Adventure Island Hotels near Raymond James Stadium Near Airports Hotels near Tampa Intl Airport (TPA) Hotels near St. Petersburg Intl Airport (PIE) Hotels near Bradenton Airport (SRQ) Motels near St. Petersburg Intl Airport (PIE) Motels near Bradenton Airport (SRQ) Motels near Tampa Intl Airport (TPA) Near Colleges Hotels near University of Tampa Hotels near Argosy University Tampa Hotels near Brewster Technical Center Tampa, FL Hotels near International Academy of Design & Technology Hotels near Erwin Technical Center Hotels near Ultimate Medical Academy Hotels near South University - Tampa, FL Hotels near The Art Institute of Tampa Hotels near Everest University Tampa Hotels near Shear Excellence Hair Academy Popular Hotel Categories Popular Boutique Hotels Popular Romantic Hotels Popular Family Hotels Popular All-Inclusive Family Resorts Popular Spa Resorts Popular Resorts Popular Honeymoon Resorts Popular Ski Resorts Popular Apartment Hotels Popular Villas Things to Do All things to do in Tampa Commonly Searched For in Tampa Good for a Rainy Day Budget-friendly Good for Couples Good for Children Free Entry Good for Big Groups Good for Adrenaline Seekers Hidden Gems Adventurous Honeymoon spot Nightlife in Tampa Bars & Clubs in Tampa Blues Bars in Tampa Cigar Bars in Tampa Gay Bars in Tampa Jazz Bars in Tampa Karaoke Bars in Tampa Piano Bars in Tampa Comedy Clubs in Tampa Dance Clubs & Discos in Tampa Wine Bars in Tampa Bar, Club & Pub Tours in Tampa Popular Tampa Categories Tours & Activities in Tampa Sightseeing Tours in Tampa Factory Tours in Tampa Bus Tours in Tampa Segway Tours in Tampa Walking Tours in Tampa Water Sports in Tampa Boat Hire in Tampa Dolphin & Whale Watching in Tampa Speed Boats Tours in Tampa Kayaking & Canoeing in Tampa Scuba & Snorkelling in Tampa Shark Diving in Tampa Surfing & Windsurfing in Tampa Swim with Dolphins in Tampa Waterskiing & Jetskiing in Tampa Tours & Activities in Tampa Outdoor Activities in Tampa Beach & Pool Clubs in Tampa Beaches in Tampa Golf Courses in Tampa Horseback Riding Tours in Tampa Biking Trails in Tampa Hiking Trails in Tampa Sports Camps & Clinics in Tampa Water Sports in Tampa Equipment Hire in Tampa Boat Hire in Tampa Dolphin & Whale Watching in Tampa Speed Boats Tours in Tampa Kayaking & Canoeing in Tampa Scuba & Snorkelling in Tampa Shark Diving in Tampa Outdoor Activities in Tampa Shopping in Tampa Art Galleries in Tampa Antique Shops in Tampa Department Stores in Tampa Flea & Street Markets in Tampa Shopping Malls in Tampa Speciality & Gift Shops in Tampa Farmers Markets in Tampa Fashion Shows & Tours in Tampa Airport Shops in Tampa Shopping in Tampa Spas & Wellness in Tampa Health Clubs in Tampa Yoga & Pilates in Tampa Spas & Wellness in Tampa Nature & Parks in Tampa Playgrounds in Tampa Beaches in Tampa Forests in Tampa Gardens in Tampa Marinas in Tampa Nature & Wildlife Areas in Tampa Biking Trails in Tampa Hiking Trails in Tampa Bodies of Water in Tampa Nature & Parks in Tampa Boat Tours & Water Sports in Tampa Water Sports in Tampa Boat Hire in Tampa Dolphin & Whale Watching in Tampa Speed Boats Tours in Tampa Kayaking & Canoeing in Tampa Scuba & Snorkelling in Tampa Shark Diving in Tampa Surfing & Windsurfing in Tampa Swim with Dolphins in Tampa Waterskiing & Jetskiing in Tampa Fishing Charters & Tours in Tampa Stand Up Paddleboarding in Tampa Boat Tours & Water Sports in Tampa Fun & Games in Tampa Playgrounds in Tampa Cinemas in Tampa Comedy Clubs in Tampa Game & Entertainment Centres in Tampa Horse Tracks in Tampa Bowling Alleys in Tampa Sports Complexes in Tampa Escape Games in Tampa Scavenger Hunts in Tampa Shooting Ranges in Tampa Miniature Golf in Tampa Paint & Pottery Studios in Tampa Fun & Games in Tampa Transportation in Tampa Trams in Tampa Ferries in Tampa Taxis & Shuttles in Tampa Bus Services in Tampa Transportation in Tampa Food & Drink in Tampa Wineries & Vineyards in Tampa Breweries in Tampa Distilleries in Tampa Beer Tastings & Tours in Tampa Coffee & Tea Tours in Tampa Cooking Classes in Tampa Food Tours in Tampa Wine Tours & Tastings  in Tampa Wine Bars in Tampa Farmers Markets in Tampa Distillery Tours in Tampa Food & Drink in Tampa Sights & Landmarks in Tampa Cemeteries in Tampa Civic Centres in Tampa Religious Sites in Tampa Historic Sites in Tampa Historic Walking Areas in Tampa Monuments & Statues in Tampa Neighbourhoods in Tampa Observation Decks & Towers in Tampa Piers & Boardwalks in Tampa Scenic Walking Areas in Tampa Ships in Tampa Arenas & Stadiums in Tampa Farms in Tampa Auto Racing Tracks in Tampa Points of Interest & Landmarks in Tampa Sights & Landmarks in Tampa Museums in Tampa Art Galleries in Tampa Art Museums in Tampa Children's Museums in Tampa History Museums in Tampa Military Museums in Tampa Science Museums in Tampa Speciality Museums in Tampa Museums in Tampa Classes & Workshops in Tampa Sports Camps & Clinics in Tampa Lessons & Workshops in Tampa Cooking Classes in Tampa Paint & Pottery Studios in Tampa Classes & Workshops in Tampa Traveller Resources in Tampa Convention Centres in Tampa Libraries in Tampa Visitor Centres in Tampa Traveller Resources in Tampa Theatre & Concerts in Tampa Blues Bars in Tampa Jazz Bars in Tampa Piano Bars in Tampa Comedy Clubs in Tampa Theatre & Performances in Tampa Dinner Theatres in Tampa Cabarets in Tampa Theatre & Concerts in Tampa Events in Tampa Cultural Events in Tampa Exhibitions in Tampa Music Festivals in Tampa Food & Drink Festivals in Tampa Events in Tampa Popular Neighbourhoods Civic Centres in Historic Ybor Convention Centres in Downtown Monuments & Statues in Historic Ybor History Museums in Historic Ybor Neighbourhoods in Historic Ybor Visitor Centres in Downtown Scenic Walking Areas in Historic Ybor Speciality & Gift Shops in Historic Ybor Points of Interest & Landmarks in Historic Ybor Bike Tours in Downtown Things to do near EDGE Rooftop Cocktail Lounge Bern's Fine Wines & Spirits Spa Evangeline Hyde Park Massage and Spa Cook With Muriel SoHo CMX CineBistro Hyde Park Village eBoats Tampa City Escape Adventures Tampa Bay Fun Boat LLC Magic Carpet Glide Aldi Hyde Park Village Henry B. Plant Museum Tampa Bay Water Bike Company Tampa Riverwalk Explore more top attractions Ivey Park Playa Estrella Hnausa Beach Provincial Park Taboo Nightclub Madison Wreck Cove General Store Colliery Dam Park Asessippi Provincial Park El Torcal de Antequera Mlini Beach Delphi, Thermopylae, Corycian Cave 300 Spartans Tour Liverpool City Sights Hop On Hop Off City Tour - 24hr Ticket Tree-climbing Goats in Agadir Ghibli Museum and Ghibli Film Appreciation Bus Tour From Split: Plitvice Lakes National Park Guided Tour Completed Thai Silk Class Experience Chicago: Escorted Bus Tours from Toronto Battle of the Scheldt from Amsterdam Tour and Tasting Start From Surabaya: Mount Bromo Sunrise Shared Guided Tour Restaurants Flights Vacation Rentals Travel Stories Cruises More Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre Trip Planner © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in Canada . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor   LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor   LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor  . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more $ CAD Canada (English)"
    },
    {
      "url": "https://thevendry.com/venue/222275/edge-rooftop-cocktail-lounge-tampa-fl",
      "text": "EDGE Rooftop Cocktail Lounge - Bar / Club in Tampa, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels EDGE Rooftop Cocktail Lounge Bar / Club 1207 S Howard Ave, Tampa, FL 33606, United States Bayshore Gardens EDGE Rooftop Cocktail Lounge 1207 S Howard Ave, Tampa, FL 33606, United States Bayshore Gardens Request Pricing # of Spaces 1 Space Capacity Max Standing: 90 Crafted cocktails using the freshest fruits, herbs and spices. A concise and delicious wine list. A variety of beer from craft microbreweries and four rotating tap handles. Popular small plates with an Epicurean flourish. A vibrant mood mingling with the night sky.\n\nMemorable events require inspiring locations. Let our staff design the perfect soiree for any occasion. Semi-private space for birthdays, anniversaries and company socials. Our customized menus and beverage packages make planning a breeze. Show more Request Pricing 1207 South Howard Avenue, Tampa, FL Show on the map Spaces Full Buyout of EDGE Rooftop Cocktail Lounge Max Standing: 90 Full Buyout of EDGE Rooftop Cocktail Lounge Max Standing: 90 Press The Rooftop Guide 18 Best Rooftop Bars in Tampa Bay - Complete Guide Jun 2, 2023 MyBartender 13 Best Bars In Tampa Bay To Visit In 2023 Nov 9, 2022 Time Out Night out in Tampa? Sep 29, 2021 The Rooftop Guide 18 Best Rooftop Bars in Tampa Bay - Complete Guide Jun 2, 2023 MyBartender 13 Best Bars In Tampa Bay To Visit In 2023 Nov 9, 2022 Time Out Night out in Tampa? Sep 29, 2021 Do you work for EDGE Rooftop Cocktail Lounge ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Tampa for Your Event Tampa Restaurants Tampa Stadiums Tampa Hotels Tampa Event Spaces Tampa Boats / Yachts Tampa Museums / Galleries Tampa Bars / Clubs Tampa Convention Centers Tampa Breweries / Distilleries Tampa Aquariums / Zoos Tampa Performance Spaces Tampa Coworking Spaces Tampa Golf Courses Tampa Restaurants Tampa Stadiums Tampa Hotels Tampa Event Spaces Tampa Boats / Yachts Tampa Museums / Galleries Tampa Bars / Clubs Tampa Convention Centers Tampa Breweries / Distilleries Tampa Aquariums / Zoos Tampa Performance Spaces Tampa Coworking Spaces Tampa Golf Courses"
    }
  ]
}