{
  "fuentes": [
    {
      "url": "https://www.eustisgunclub.org/empty-page",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/empty-page",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.eustisgunclub.org/",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/experiences",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/experiences",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "anjurrh@prestigesecurity-usa.com"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "info@coveryour6shooting.com"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "sarah@uswomensshootingacademy.com"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "email": "sasquatch@sasquatch-tactical.com"
    },
    {
      "url": "https://www.eustisgunclub.org/findus",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/findus",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/calendar",
      "email": "admin@eustisgunclub.org"
    },
    {
      "url": "https://www.eustisgunclub.org/calendar",
      "email": "admin@eustisgunclub.org"
    }
  ],
  "mails": [
    "admin@eustisgunclub.org",
    "anjurrh@prestigesecurity-usa.com",
    "gabe@journeysherwood.org",
    "info@coveryour6shooting.com",
    "info@journeysherwood.org",
    "leadershipboard@journeysherwood.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "sarah@uswomensshootingacademy.com",
    "sasquatch@sasquatch-tactical.com",
    "scott@journeysherwood.org"
  ],
  "nombre_sitio": "eustisgunclub.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.eustisgunclub.org/empty-page",
      "text": "Members log in HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.eustisgunclub.org/",
      "text": "Eustis Gun Club Lake Count Florida. HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Discover Eustis Gun Club Explore Central Florida’s Premier Membership-Based Outdoor Firing Range Experience EUSTIS GUN CLUB INC MEMBERS CLUB Eustis Gun Club Inc. stands as a premier destination for shooting enthusiasts, offering a comprehensive array of facilities and opportunities for its members. Founded as a membership-only club, Eustis Gun Club provides access to a diverse range of shooting disciplines and events, fostering a vibrant membership community of firearm enthusiasts. Facilities and Offerings for all Members Immerse yourself in a range of shooting disciplines suitable for all ages, from meticulously designed pistol ranges (featuring Pocket Berms) to rimfire rifle ranges extending up to 50 yards, and long-distance rifle ranges reaching 100 yards and beyond, including a 200-meter rifle range, steel target shooting opportunities, and archery options. Additionally, indulge in our shotgun sports complex equipped for automated trap & skeet, 5-stand, and sporting clays. Gain comprehensive access to the entirety of Eustis Gun Club's offerings through our affordable yearly membership. Enjoy unlimited use of our facility and range, available 7 days a week, 363 days a year. Embrace a welcoming atmosphere where shooters of all experience levels are included, catering to both seasoned professionals and newcomers alike. Eustis Gun Club 25 beautiful acres Enter the Facility Enter the facility on our picturesque tree lined entrance Air Conditioned Membership Hall Modern and meticulously maintained membership hall and full public restrooms and water fountains Shotgun Sports Complex Trap, Skeet, 5 Stand, Sporting Clays, ATA, Night Skeet 200m Long Range Multiple Steel targets at 100, 150, and 200 Rifle Range 25yd, 50yd, 75yd, 100yd Rifle Range Rifle Range Shaded firing line with fans Swampwater Cowboy Town Lake County Pistoleros is proud to present a fully themed S.A.S.S western town. LCP and EGC has monthly shoots every third Saturday of the month One of our Pistol Pocket Berms Practice your CC pistol skills in one of our pocket berms More Pocket Berms Movable shooting tables and staging areas Shotgun Skeet House One of our skeet houses and trap houses Prospective Members are cordially invited Visitors are cordially invited to experience a comprehensive tour of our range facility led by our dedicated Range Safety Officer during regular range hours 7 days a week, Friday-Monday 7am-5pm Tues-Thurs 7am-5pm. Please check in at the office with the RSO on duty immediately upon arrival for your tour. Eustis Gun Club is private property, therefore all guests must visit the office for check in prior to proceeding on to the Range facilities. Please note that utilization of the range is exclusively reserved for members of the Eustis Gun Club. Call About Membership Property Location Nestled within the serene beauty of 25 acres adorned with lush trees, our location at 12950 Frankies Rd in Tavares, Florida offers convenience and tranquility. Ample parking ensures hassle-free arrival, while covered ranges and abundant shade trees provide comfort during your visit. Our members enjoy access to an air-conditioned hall, meticulously maintained restroom facilities, and the assurance of certified Range Safety Officers and dedicated membership specialists always on hand. FIND US What Our Members Say: \"Nestled in the scenic landscapes of Central Florida, the Eustis Gun Club offers a picturesque setting and impeccable maintenance standards. With well-manicured facilities and a variety of amenities, it provides shooters of all levels with a comfortable and enjoyable experience.\" -Dina Button “Eustis Gun Club, safety takes center stage, setting a gold standard for responsible shooting practices. The staff and instructors demonstrate exceptional knowledge, ensuring every shooter feels confident and secure. With safety as the paramount policy, visitors can trust in the club's commitment to providing a safe and enjoyable environment for all.” -Charles H. Button “Eustis Gun Club stands out as the most affordable gun range in Florida, offering exceptional value without compromising quality. The membership procedure is straightforward and well-organized, making it easy for shooters to join and enjoy the benefits of this budget-friendly club. Whether you're a seasoned marksman or a beginner, Eustis Gun Club provides a cost-effective option without skimping on professionalism or amenities.” Button 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    },
    {
      "url": "https://www.eustisgunclub.org/experiences",
      "text": "Gun Club Membership HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Membership Scroll This Page in its Etirety for Full Details on How to Join Eustis Gun Club! All New Membership is completed exclusively Online. Always Accepting New Members: No Membership Cap and No Sponsorship Required! Scroll to the bottom to apply for membership now! Eustis Gun Club Membership Benefits: Year-Round Access : A once-a-year membership fee of $250.00 (plus a one-time $100.00 new member initiation fee is collected for all new memberships), grants members and their household family access to the club's facilities 363 days a year, ensuring consistent and convenient access to their preferred shooting activities. Eustis Gun Club is open 7 days a week, with extended facility hours on Tuesday-Thursday until 7pm to accommodate all schedules. This fee is pro rated if you join outside our membership month of June. Family Inclusion : The membership yearly fee extends to include the primary member, a spouse/partner residing in the same household, and all minor children, promoting a family-friendly atmosphere and facilitating shared experiences within households. Guests : Full members may bring up to 4 shooting guests per day for a nominal daily guest fee. Membership Requirements Download EGC Full Range Rules Identity Verification Provide a State ID, Driver's License, or Passport to verify your identity. Verification of Safety Course Completion Provide proof of completion of a firearm safety course, such as a current non expired CCW, Basic Safety Certification with an instructor signature and number (must be dated within the past 5 years ), Law enforcement ID, Military active duty or retiree ID, Hunter Safety Certificate (must be dated within the past 5 years ), or a NRA Firearm Safety Certificate with an instructor signature and number. If you haven't completed a safety course, qualified approved instructors are available to fulfill this requirement (fees apply). Trainer information can be found on our Instructors page. Site and Safety Orientation Attend the Eustis Gun Club Site and Safety Orientation with the Chief Range Safety Officer, which is offered by appointment only after successful completion of the application process, safety verification, and payment . Approximately 12 class dates each month are offered for your convenience and is scheduled after completion of all paperwork and payment. Onsite Safety Verification Upon finishing the new membership sign up procedure and the successful completion of the site and safety orientation class, new members will enter a probationary period lasting up to 60 days. Probation may conclude in as little as 3 days, though individuals are given up to 60 days to fulfill it. Site and Safety Class Completion The FIRST verification signature must be completed by our Site Orientation Instructors, Assistant CRSO, or CRSO. Upon completion of the site and safety orientation, you will receive your FIRST verification signature, allowing you to begin shooting on the property Probationary Safety Signatures Required Probationary members must obtain three EGC Range Safety Officer signatures by shooting on three separate occasions within 60 days. These signatures attest to the member's knowledge of Club procedures and safe gun handling on the range. While on probation, members are not permitted to bring guests Safety Demonstration Requirement Range safety is our top priority. Each applicant must demonstrate safe firearm handling skills to an EGC Range Safety Officer. Adherence to all Eustis Gun Club Facility rules and individual range rules is paramount. The safety verification includes but is not limited to adherence to safe firearm handling rules I'M READY TO JOIN NOW! CLICK HERE TO BEGIN THE APPLICATION FOR MEMBERSHIP Membership Specialist Administrator Our Membership Specialist Administrator assists current and prospective members with applications, renewals, payments, account updates, and general membership inquiries. This role also supports daily operations, ensures accurate recordkeeping, and helps facilitate smooth communication between members and club leadership. Regular Office Hours: Tuesday – Thursday, 9:00 AM – 3:00 PM (Closed on weekends and holidays) Emails to the Business office are monitored 7 days a week, please remit email questions at any time to: admin@eustisgunclub.org ﻿ Extended Hours in June: To accommodate our annual membership renewal period, the Membership Specialist is available for extended hours, including select evenings and weekends, throughout the month of June—making it easier for members who work during the week to renew. Call about Membership Contact Membership Business Office Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. FACILITY HOURS Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    },
    {
      "url": "https://www.eustisgunclub.org/instructors",
      "text": "Eustis Gun Club Instructors HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Eustis Gun Club Approved Instructors Unlock Your Potential with Eustis Gun Club's Elite Team of Certified Firearms Instructors: Where Safety Meets Skill, and Learning Never Ends Sydney Chipchase Sydney.chipchase@gmail.com Button Rick Hansing rhhansing@gmail.com Button Sarah Williamson U.S Women's Shooting Academy sarah@USWomensShootingAcademy.com Button Sasquatch Tactical, Aaron Hilderbrandt- sasquatch@sasquatch-tactical.com Button Cover Your 6 Shooting info@coveryour6shooting.com Button Prestige national security Anjurrh@PrestigeSecurity-USA.com Button 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    },
    {
      "url": "https://www.eustisgunclub.org/findus",
      "text": "FIND US HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Contact Us GETTING HERE Getting to Eustis Gun Club has never been easier. Questions? Name: Email: Phone: Message: Thank you for your email. Please note that our administrative office hours are from Tuesday to Friday, 9:00 AM to 3:00 PM. During these hours, we process all membership, renewal, and administrative tasks in the order they are received. For contact details of the Board of Directors and other staff members, kindly visit the Board/Staff page on our website. If you need to reach an on-duty Range Safety Officer (RSO) during our range hours, please call 352-408-8869 . Everything you need to know about becoming a member of Eustis Gun Club can be found on the Membership page , including the ability to submit and sign your application online to join! Have your ID and Firearm Safety Certification handy to begin the membership process! For information on current activities and events, please refer to the calendar page . Thank you, have a great day! Oops, there was an error sending your message. Please try again later. Do you have questions about membership? Call the Membership Specialist Administrator at 352-742-0118 or click below to call. ﻿ Call Membership Specialist Administrator 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    },
    {
      "url": "https://www.eustisgunclub.org/calendar",
      "text": "Eustis Gun Club Calendar HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF CONTACT US GETTING HERE CONTACT MEMBERS LOGIN Get in touch Street Address, City, State and Zip Admin@eustisgunclub.org Mon - Sun 9:00 am - 5:00 pm HOME OUR EGC HISTORY MEMBERSHIP DISCOVER ACTIVITIES CALENDAR INSTRUCTORS BOARD/STAFF MORE CONTACT US GETTING HERE CONTACT MEMBERS LOGIN September 2025 Sun Mon Tue Wed Thu Fri Sat 31 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 8am Trap Match Show all 1 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Practice Clays Show all 2 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 3:30pm Youth Practice Shotgun Field 5:30pm Nowlon Hall Reserved- Youth Team Parent Meeting Show all 3 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 9am Admin Office OPEN 9am Sporting Clays 5:30pm Night Skeet Show all 4 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 8:30am Five Stand Sporting Clays 9am Admin Office OPEN 5pm ATA Registered Target Shoot TRAP FIELD Show all 5 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 9am Skeet & Trap 3pm IDPA  Set Up Berms1-7 Show all 6 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7am IDPA Match Ranges 1-7 CLOSED 9am Sporting Clays Show all 7 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 8am Trap Match 8am Muzzle Loader/Black Powder Matches Ranges 7 & 8 Closed Show all 8 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Practice Clays Show all 9 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 3:30pm Youth Practice Shotgun Field Show all 10 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 9am Admin Office OPEN 9am Sporting Clays 5:30pm Night Skeet Show all 11 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 8:30am Five Stand Sporting Clays 9am Admin Office OPEN 5pm ATA Registered Target Shoot TRAP FIELD Show all 12 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 9am Skeet & Trap Show all 13 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Sporting Clays Show all 14 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am SWAP MEET  RANGES 6, 7, 8 and 9 closed 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 8am Trap Match Show all 15 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Practice Clays Show all 16 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 3:30pm Youth Practice Shotgun Field Show all 17 AUTOMATION TRAP/SKEET ALL DAY 7am ARA Match - Range 7 7am Swampwater Closed 7am RANGE HOURS 7AM-7PM 7am Nowlon Hall Reserved- ARA Match Scoring 9am Admin Office OPEN 9am Sporting Clays 5:30pm Night Skeet Show all 18 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 8:30am Five Stand Sporting Clays 9am Admin Office OPEN 9am Fun Match .22 Members only BERM 7 5pm ATA Registered Target Shoot TRAP FIELD Show all 19 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 9am Skeet & Trap 3pm Cowboy set up in Pistol Berms 3-6 Show all 20 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am Pocket Berms 3-6 & Swampwater Occupied 7am RANGE HOURS 7AM-5PM 9am Sporting Clays Show all 21 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 8am Trap Match 8:30am Hunter's Silhouette Match  Range 8 CLOSED Show all 22 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Practice Clays Show all 23 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 3:30pm Youth Practice Shotgun Field Show all 24 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 9am Admin Office OPEN 9am Sporting Clays 5:30pm Night Skeet 6pm Board of Directors Meeting Show all 25 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 8:30am Five Stand Sporting Clays 9am Admin Office OPEN 5pm ATA Registered Target Shoot TRAP FIELD Show all 26 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 9am Skeet & Trap Show all 27 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am Service Firearms Shoot Range 8 CLOSED 7am RANGE HOURS 7AM-5PM 9am Sporting Clays Show all 28 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 8am Trap Match Show all 29 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 9am Practice Clays Show all 30 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 3:30pm Youth Practice Shotgun Field Show all 1 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 9am Admin Office OPEN 9am Sporting Clays 5:30pm Night Skeet Show all 2 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-7PM 8:30am Five Stand Sporting Clays 9am Admin Office OPEN 5pm ATA Registered Target Shoot TRAP FIELD Show all 3 AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7:45am Nowlon Hall Reserved CRSO 9am Admin Office OPEN 9am Skeet & Trap 3pm IDPA  Set Up Berms1-7 Show all 4 Admin Office CLOSED AUTOMATION TRAP/SKEET ALL DAY 7am RANGE HOURS 7AM-5PM 7am IDPA Match Ranges 1-7 CLOSED 9am Sporting Clays Show all 12950 Frankies Rd, Tavares FL 32778 (352) 408-8869 Range Facility Phone Membership Admin Office For all Membership inquiries (352)742-0118 admin@eustisgunclub.org ﻿ © 2025 All Rights Reserved | Eustis Gun Club | Powered by AssociationSphere CALL NOW Range Facility Hours Mon, Fri 7:00 am - 5:00 pm Tue - Thu 7:00 am - 7:00 pm Sat - Sun 7:00 am - 5:00 pm Administration Hours Monday Appointment Only Tue - Fri 9:00 am - 3:00 pm Sat - Sun Appointment Only Share by:"
    }
  ]
}