{
  "fuentes": [
    {
      "url": "https://www.evansprairierestaurant.com/accessibility",
      "email": "guestrelations@ourfmk.com"
    },
    {
      "url": "https://windowselchuy.com/contact-us",
      "email": "customerservice@windowselchuy.com"
    },
    {
      "url": "https://windowselchuy.com/contact-us",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g1930048-d3617158-r329766564-Evans_Prairie_Country_Club-The_Villages_Florida.html",
      "email": "jose@bonifaycc.com"
    },
    {
      "url": "https://shop.evanevansbrewery.com/pages/contact-us",
      "email": "breweryshop@evan-evans.com"
    },
    {
      "url": "https://shop.evanevansbrewery.com/pages/contact-us",
      "email": "simon.lewis@evan-evans.com"
    }
  ],
  "mails": [
    "breweryshop@evan-evans.com",
    "customerservice@windowselchuy.com",
    "flags@2x.png",
    "guestrelations@ourfmk.com",
    "jose@bonifaycc.com",
    "simon.lewis@evan-evans.com"
  ],
  "nombre_sitio": "evansprairierestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.evansprairierestaurant.com/accessibility",
      "text": "Accessibility | Evans Prairie top of page Home Menus Lunch Dinner Daily Specials Cocktails & Wine Order Online Reservations Events Event Calendar Autumn Wine Dinner - 9/23 Motown Boyz - 9/25 Large Party Prix Fixe Options Our Team Careers Gift Cards Contact More... Use tab to navigate through the menu items. Accessibility Statement for Evans Prairie Country Clubs Website This is an accessibility statement from Evans Prairie Country Club. Conformance status The Web Content Accessibility Guidelines (WCAG) defines requirements for designers and developers to improve accessibility for people with disabilities. It defines three levels of conformance: Level A, Level AA, and Level AAA. Evans Prairie Country Clubs website is fully conformant with WCAG 2.0 level AA. Fully conformant means that the content fully conforms to the accessibility standard without any exceptions. We will continue to make every effort to provide a website in which all functionality and content is accessible to all individuals, and we will continuously monitor and update our site regularly to make it as accessible as possible. ​ Disclaimer Please be aware our efforts to maintain accessibility and usability are ongoing.  While we strive to make the Website as accessible as possible, there may be issues that arise with different assistive technology.  If at any time, you have specific questions or concerns about accessibility of a particular web page on the Website, please contact us by email at guestrelations@ourfmk.com. Thank you for your understanding. ​ Feedback We welcome your feedback on the accessibility of Evans Prairie Country Clubs Website. Please let us know if you encounter accessibility barriers on Evans Prairie Country Clubs Website: Phone: 352-626-5080 E-mail: guestrelations@ourfmk.com Postal Address: PO Box 1227, Wildwood, FL 34785 We try to respond to feedback within 1-2 business days. ​ Date This statement was created on April 10, 2024. Evans Prairie Country Club presents a laid-back yet elegant dining experience with a panoramic view of the charming Evans Prairie. Our restaurant offers a diverse menu of classic American cuisine in an intimate setting. Explore Home Menus Lunch Dinner Daily Specials Cocktails & Wine Order Online Reservations Events Event Calendar Autumn Wine Dinner - 9/23 Motown Boyz - 9/25 Large Party Prix Fixe Options Our Team Careers Gift Cards Contact Contact Us (352) 750-2225 Monday - Saturday 11AM - 9PM Sunday 11AM - 8PM © 2024 Belle Glade Country Club Proudly Operated By Privacy Accessibility bottom of page"
    },
    {
      "url": "https://windowselchuy.com/contact-us",
      "text": "Contact Window Experts | Grand Prairie, TX | Windows El Chuy [email protected] (214) 412-2804 Home About Us Testimonials FAQs Services Windows Installation Doors Installation Gallery Financing Blogs Contact Us Get Your Quote Contact Details Call Us Today Ready to start a project or just have questions? Call us today: (214) 412-2804 Email Us Looking to schedule a quote? Email Us Today: [email protected] Visit Us Want to visit our office? 209 S State Highway 342, Red Oak TX 75154 Office hours Mon - Fri: 8.30am – 5.00pm Saturday: 8.30am – 12.00pm Sunday: Closed Request a quote Feel free to call us for any window questions, or get in touch via our contact form below. Your message will be dispatched directly to our staff who will answer as soon as they can. Full Name * Email * Phone * Zip Code * Inquiring About * Inquiring About Windows/Doors Replacement New Construction Windows/Doors Install Other No elements found. Consider changing the search query. List is empty. Additional Details * Request Quote Request a quote Feel free to call us for any window questions, or get in touch via our contact form below. Your message will be dispatched directly to our staff who will answer as soon as they can. Full Name * Email * Phone * Zip Code * Inquiring About * Inquiring About Windows/Doors Replacement New Construction Windows/Doors Install Other No elements found. Consider changing the search query. List is empty. Additional Details * Request Quote Contact Details Call Us Today Ready to start a project or just have questions? Call us today: (214) 412-2804 Email Us Looking to schedule a quote? Email Us Today: [email protected] Visit Us Want to visit our office? 2125 W Pioneer Pkwy Suite A4, Grand Prairie, TX 75051 Office hours Mon - Fri: 8.30am – 5.00pm Saturday: 8.30am – 12.00pm Sunday: Closed What Our Clients Have To Say \"Windows El Chuy did a fantastic job replacing one of my large front windows. Their pricing was fair, and they got the job done quickly and without issue. Will definitely use Windows El Chuy in the future for any needs that arise.\" —Ben Camillo When I called Chuy he was able to give me a quote very quick. Great, fast and effective service, unbeatable prices. I will keep using them for all my future projects. —LB R. from Allen, TX He was super fast and very thorough when he came to help us with a broken window.  He took the time to explain what we need and the process of replacement. We will definitely use him again! —Rina Rinard Follow Us Quick Links Home About Us Services Gallery Testimonials Blogs FAQs Contact Us Service Areas Highland Park University Park Southlake Colleyville Keller Plano Frisco Service Areas Trophy Club Flower Mound McKinney Coppell Grapevine Irving Contact Us (214) 412-2804 [email protected] 209 S State Highway 342, Red Oak TX 75154 Mon - Fri: 8.30am – 5.00pm Saturday: 8.30am – 12.00pm Sunday: Closed Copyright © 2025 Windows El Chuy LLC. All Rights Reserved. Privacy Policy. Terms & Conditions. Web Design by Fused Media"
    },
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g1930048-d3617158-r329766564-Evans_Prairie_Country_Club-The_Villages_Florida.html",
      "text": "Sunday breakfast buffet - Review of Evans Prairie Country Club, The Villages, FL - Tripadvisor We noticed that you're using an unsupported browser. The Tripadvisor website may not display properly.We support the following browsers: Windows: Internet Explorer , Mozilla Firefox , Google Chrome . Mac: Safari . The Villages The Villages Tourism The Villages Accommodation The Villages Holiday Rentals The Villages Flights Evans Prairie Country Club The Villages Attractions The Villages Travel Forum The Villages Photos The Villages Map All The Villages Hotels The Villages Hotel Deals Skip to main content Discover Trips Review More NZD Sign in Inbox See all Sign in to get trip updates and message other travellers. The Villages Hotels Things to Do Restaurants Flights Holiday Homes Travel Stories Cruises Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre Sunday breakfast buffet - Evans Prairie Country Club United States Florida (FL) Central Florida The Villages The Villages Restaurants Evans Prairie Country Club Search “Sunday breakfast buffet” Review of Evans Prairie Country Club 60 photos Evans Prairie Country Club 1825 Evans Prairie Trl , The Villages, FL 32163-2701 +1 352-750-2225 Website Improve this listing Ranked #32 of 153 Restaurants in The Villages 378 Reviews Price range: $8 - $40 Cuisines: American More restaurant details Restaurant details Dining options: After-hours, Breakfast, Reservations Description: We are a year around Country Club located just off Buena Vista Blvd. Our menu offers appetizers, sandwiches, shrimp and steak dinners as well as some Italian favorites. We have seating for 2 or as many as 100 people at ounce. If you have catering need we are your Country Club. Please stop by after a round of golf or just out with friends. We look forward to serving you soon. KIngTV1 Winter Garden, Florida 181 39 Reviewed 30 November 2015 Sunday breakfast buffet This buffet is relatively new to the area. It offers an made to order omelet and waffle station. There is a hot buffet of scrambled eggs, various breakfast meats, english muffin, potatoes, cheesy grits and oatmeal. There is nice option of fresh fruit. The buffet is situated in the back of restaurant and overlooks a nature area. Date of visit: November 2015 Value Service Food Ask KIngTV1 about Evans Prairie Country Club Thank KIngTV1 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Updating list... Reviews (378) Traveller rating Excellent 130 Very good 126 Average 73 Poor 25 Terrible 24 Traveller type Families Couples Solo Business Friends Time of year Mar-May Jun-Aug Sep-Nov Dec-Feb Language All languages English (377) Italian (1) Language English (377) Italian (1) Show reviews that mention All reviews shrimp scampi mashed potatoes country clubs golf course lori Review tags are currently only available for English language reviews. Read reviews in English Go back 229 - 233 of 378 reviews ladylake1 The Villages, Florida 112 52 Reviewed 25 November 2015 Not consistent. Have been here several times ad found service and quality of food not consistent, When it's good it's great but have had poor service on a couple of visits. Food is usually very good and worth trying out and hoping for a \"good\" day. Date of visit: November 2015 Ask ladylake1 about Evans Prairie Country Club Thank ladylake1 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Sue in reho K Delaware 151 68 Reviewed 6 November 2015 So Not Worth The Wait Hubby and I waited almost 1/2 hour to be seated. Unless this is the first time for every diner, I can't figure out why it was so crowded. I don't know what was worse-the waitress or the food. I don't think I received the drink I ordered but it tasted pretty good so I didn't complain. We waited 20 minutes for any food on the table and finally asked for bread. Bread was flavored with weird spices. Hubby's fish entree was okay. Mine was overcooked and the broccoli was mushy. Never got the extra napkin I requested. There are so many nearby good restaurants. Not going back to this one. Date of visit: October 2015 Value Service Food Ask Sue in reho K about Evans Prairie Country Club Thank Sue in reho K This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Joyce G The Villages, Florida 1 5 Reviewed 4 November 2015 Horrible experience We had a horrible experience at Evan's Prairie last night. 4 of us were dining and we all ordered salads we were part way done with our salads when suddenly my partner said to stop eating and covers his salad plate with his napkin. He has just found a whole mouse that was dead in his salad. The waitress came over and she was going to take his plate but he followed her and the went direct to the manager. Then the manager came back to our table along with the director of operations and they were apologizing and offered both couples gift cards. Then suddenly the owner of Fresh Made Kitchen who runs Evan's Prairie restaurant came to our table and he also was apologizing and told us that he was going to self report to the Florida Health department. We contacted the Florida Licensing Department this morning they oversee any complaints of this type and we filed a complaint. We also then contacted the Sumpter county Health department just in case they see any food borne illnesses with Evan's Prairie or prepackaged salad as a common denominator. Needless to say we probably won't be returning to Evan's Prairie for a long time if ever. Date of visit: November 2015 Ask Joyce G about Evans Prairie Country Club 5 Thank Joyce G This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Valarie K Westerville, Ohio 121 33 Reviewed 22 October 2015 Very good food tasty entrees, dinner salad is big enough to share. The lobster mac and cheese was also very good. Portions are decent size. Date of visit: October 2015 Ask Valarie K about Evans Prairie Country Club Thank Valarie K This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Previous Next 1 … 46 47 48 … Updating list... Travellers who viewed Evans Prairie Country Club also viewed Bonifay Country Club 378 Reviews The Villages, Central Florida Cane Garden Country Club 637 Reviews The Villages, Central Florida Havana Country Club Restaurant 304 Reviews The Villages, Central Florida City Fire 492 Reviews The Villages, Central Florida All restaurants in The Villages (153) Been to Evans Prairie Country Club? Share your experiences! Write a Review Add Photos & Videos Owners: What's your side of the story? Own or manage this property? Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Listing Viewed restaurants Evans Prairie Country Club 378 Reviews Browse nearby Restaurants (153) | Hotels (3) | Things to Do (72) Also show Hotels Restaurants Things to Do Also show Map Satellite Map updates are paused. Zoom in to see updated info. Reset zoom Updating Map... Return to Map Revenue impacts the experiences featured on this page, learn more . © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in New Zealand . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more $ NZD New Zealand"
    },
    {
      "url": "https://shop.evanevansbrewery.com/pages/contact-us",
      "text": "Contact us – Evan Evans Brewery Shop Ales & Lager Cider Mixed Cases About us Log in Search Facebook Twitter Instagram Untappd Menu Search Cart Ales & Lager Cider Mixed Cases About us Log in Cart ( 0 ) Search Contact us We love to talk beer. If you're a pub, bar, restaurant, or shop and would like to stock our brands or take our beer for an event or festival, get in touch to find out how we can help. ORDER ENQUIRIES For all online order enquiries, please call 01558 824 455 or email breweryshop@evan-evans.com . For trade accounts, and to talk anything financial, please email simon.lewis@evan-evans.com or write to us at: Evan Evans Brewery, 1 Rhosmaen Streen, Llandeilo, SA19 6LU, West Wales. Sign-up for free! Sign-up to receive beer and cider offers, food pairings, special recipes and news of everything that's happening at Evan Evans Brewery. Email Subscribe Our brands Evan Evans Artisan Organic Celt Fire Island Redhog Cider General Information Contact us Deliveries information and returns Privacy policy Terms and conditions Contact us If you have a general enquiry, or an observation that will help us improve our service, please do get in touch. breweryshop@evan-evans.com Tel: 01558 824 455 Social Facebook Twitter Instagram Untappd Diners Club Discover Maestro Mastercard Shop Pay Union Pay Visa © 2025   Evan Evans Brewery Shop , 1 Rhosmaen Street, Llandeilo, SA19 6LU Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Subscribe Age verification You need to be over 18 years of age to enter our website. By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main menu Ales & Lager Cider Mixed Cases About us Shopping Cart Your cart is currently empty. Shop now"
    }
  ]
}