{
  "fuentes": [
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/pricing-guide/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/historic-dubsdread-home/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-at-the-highland-manor-taylor-and-brian/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://highlandmanornh.com/contact-us/",
      "email": "info@highlandmanornh.com"
    },
    {
      "url": "https://highlandmanornh.com/contact-us/",
      "email": "info@highlandmanornh.com"
    },
    {
      "url": "https://eventsbydubsdread.com/venue-spotlight-the-highland-manor/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/upcoming-events/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://highlandhall.org/contact-us/",
      "email": "events@highlandhall.org"
    },
    {
      "url": "https://highlandhall.org/contact-us/",
      "email": "info@highlandhall.org"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "email": "info@manortavern.com"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "email": "jerryedwards@chefsexpressions.com"
    },
    {
      "url": "https://highlandbrewing.com/team/",
      "email": "hb-default-feature-image@3x-480x321.png"
    },
    {
      "url": "https://highlandbrewing.com/team/",
      "email": "hb-default-feature-image@3x.png"
    },
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-catering/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-the-highland-manor-alexis-johnston-benjamin-silva/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-the-highland-manor-grossholz-and-sharp/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://eventsbydubsdread.com/the-highland-manor-home/the-highland-manor-blog/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://thehighlanddallas.com/contact-us/",
      "email": "contactus@thehighlanddallas.com"
    },
    {
      "url": "https://www.highlandartstheatre.com/about-us",
      "email": "academy@highlandartstheatre.com"
    },
    {
      "url": "https://www.highlandartstheatre.com/about-us",
      "email": "boxoffice@highlandartstheatre.com"
    },
    {
      "url": "https://www.highlandartstheatre.com/about-us",
      "email": "info@highlandartstheatre.com"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3572/highland-manor/",
      "email": "awardwinner@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3572/highland-manor/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3572/highland-manor/",
      "email": "standardrentals@2x.png"
    },
    {
      "url": "https://eventsbydubsdread.com/we-moved-that-page/",
      "email": "info@eventsbydubsdread.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "corey@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "billh@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "courtneyz@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "daled@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "daves@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "davew@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "david@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "dougv@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "drewc@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "gordonu@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "kevinj@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "krista@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "mary@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "rachael@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "randy@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "roger@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "sid@manor-hill.com"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "email": "timw@manor-hill.com"
    },
    {
      "url": "https://eventsbydubsdread.com/",
      "email": "info@eventsbydubsdread.com"
    }
  ],
  "mails": [
    "academy@highlandartstheatre.com",
    "awardwinner@2x.png",
    "billh@manor-hill.com",
    "boxoffice@highlandartstheatre.com",
    "contactus@thehighlanddallas.com",
    "corey@manor-hill.com",
    "courtneyz@manor-hill.com",
    "daled@manor-hill.com",
    "daves@manor-hill.com",
    "davew@manor-hill.com",
    "david@manor-hill.com",
    "dougv@manor-hill.com",
    "drewc@manor-hill.com",
    "events@highlandhall.org",
    "gordonu@manor-hill.com",
    "hb-default-feature-image@3x-480x321.png",
    "hb-default-feature-image@3x.png",
    "indooroutdoor@2x.png",
    "info@eventsbydubsdread.com",
    "info@highlandartstheatre.com",
    "info@highlandhall.org",
    "info@highlandmanornh.com",
    "info@manortavern.com",
    "jerryedwards@chefsexpressions.com",
    "kevinj@manor-hill.com",
    "krista@manor-hill.com",
    "mary@manor-hill.com",
    "rachael@manor-hill.com",
    "randy@manor-hill.com",
    "roger@manor-hill.com",
    "sid@manor-hill.com",
    "standardrentals@2x.png",
    "timw@manor-hill.com"
  ],
  "nombre_sitio": "eventsbydubsdread.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-about/",
      "text": "Events by Dubsdread About - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Why Choose Us Events by Dubsdread is Orlando’s premier catering and event services company, delivering Culinary Excellence served with Southern Charm. Our team’s diverse background and extensive experience mean that every aspect of your event is in expert hands. We collaborate closely with you to bring your dreams to life, ensuring a seamless and stress-free experience. From planning to execution, we are committed to excellence, making your special day truly unforgettable. Our Team Our team brings over a century of combined experience to ensure your wedding or event is nothing short of incredible. Meet the talented individuals whose expertise and dedication will make your special day unforgettable. Carissa Llewellyn-Burns Director of Operations Carissa joined the company in 2013. A communications and journalism graduate of Shippensburg University, she moved from Pennsylvania to Florida for sunshine and job opportunities. She began her career with Dubsdread as a banquet server and has worked her way through every position in the office to learn each aspect of the operation and is proud to be part of the amazing team. When she is not at work, Carissa enjoys time with her husband, Tyler, her crazy kiddos Connor and Cameron and her fur child, Roxy. Christiana Bullard Banquet Sales Manager An Orlando native and a UCF graduate, Christiana worked in advertising before joining Dubsdread in 2005. She found the hospitality industry far more entertaining and mentally stimulating. Christiana enjoys humorous clients, problem-solving, and working with great colleagues. When she is not at work, she enjoys watching UCF football, going to the gym and spending time with her three “kids:” her daughter, husband and dog. David Osmola Senior Wedding & Event Coordinator David joined the Dubsdread team in 2008 and is our Senior Wedding and Event Coordinator. Before coming on board, he worked in customer service positions in the wedding and airline industries. David strives to make every bride’s dream a reality, allowing his attention to detail and customer service skills to shine through. When he is not at work, David enjoys spending time with his friends and his dog, Sweet Pea, and visiting family in Michigan. Michelle Edmiston Event Specialist/Sales Representative Michelle joined the team in 2017 and wears many hats, managing the property at The Highland Manor being one of them.  She grew up working in a family friend’s restaurant and expanded that knowledge working at country clubs, event venues, hotels and stadiums. After nearly three decades, she still loves helping her client's vision become a reality. When Michelle is not planning an event, she spends time with her husband Jay, son Blake, two rescue dogs and her vast extended family. Shanna Paris Event Specialist/Sales Representative Shanna has been at Dubsdread since 2017. An Event Management graduate of the University of Central Florida’s Rosen College of Hospitality, she began her career with local wedding and destination event management companies. Since 2000, Shanna has planned weddings and events throughout the Orlando area, helping planners worldwide execute their corporate gatherings. At Dubsdread, she can focus on her passion to help brides make their day unique and personal. Shanna enjoys time with her four favorite guys when she’s not at work: her dog Giggsy, her sons Liam and Alfie and her husband Josh. Peighton Ballant Event Specialist/Sales Representative Peighton is a native of Orlando and joined Dubsdread in 2018. In 2021, she earned her Event Management degree at the University of Central Florida’s Rosen College of Hospitality. Before joining the events team, Peighton was a hostess at The Tap Room at Dubsdread. Peighton enjoys working with prospective brides to discover what they are most interested in bringing to their special day and how to make those ideas come to life. When not at work, she enjoys caring for Dexter, her cat-child, going to the beach, hanging out with friends, and being a UCF Knight football fan. Roxy Llewellyn-Burns EBanquet Operations Ambassador Roxy joined the team in January 2015. A Pet Smart’s Elite Obedience School graduate, she parlayed her training into a unique and valued office position. Roxy’s favorite role is greeting guests and fulfilling her Events by Dubsdread ambassador duties. When not at work, Roxy enjoys playing fetch with her humans, licking her brothers, belly rubs, treats, being completely spoiled and days at the doggie spa. Kristen Berry Wedding & Event Coordinator Kristen joined the Dubsdread team as a catering captain in 2021 before transitioning to a wedding and event coordinator. She graduated with a degree in the arts and found she preferred the people-oriented nature, pacing, and problem-solving that comes with working in the service industry. Kristen enjoys planning, facilitating, and contributing to creating joyous occasions. When she is not at work, she loves traveling, cooking, working on creative projects and hanging out with her two cats, Diana and Henry. Get Inspired Follow us on Instagram Get Started Submit an Inquiry Catering Menus Exclusive Venues Partner Venues Brochures Galleries Exclusive Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment PRICING GUIDE INQUIRE TODAY Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/pricing-guide/",
      "text": "Pricing Guide - Events by Dubsdread Skip to content Plan Your Dream Wedding with Confidence Welcome to Events by Dubdread! Planning your wedding is one of the most exciting journeys of your life, and we’re here to make it easier for you. Our Pricing Guide for Weddings introduces our wedding venues and catering services. It is designed to help take some guesswork out of planning so you can focus on creating the celebration you’ve always imagined. Fill out the form below to grab a copy of our Pricing Guide First Name* Last Name* Phone* Email* Where are you in the venue selection journey? * Not engaged yet Newly engaged and just looking at what’s out there Planning mode and building my list of venues to tour Touring venues and still haven’t found what I’m looking for Ready to tour an Events by Dubsdread venue but want more information beforehand Where did you hear about us? * Online search Google ad The knot Wedding wire Wedding venue map Facebook Instagram Linkedin Pinterest Visited our website Partner venue website Friend/word of mouth Attended an event at one of our venues Bridal show Other Get My Guide Inside, you’ll discover: Exclusive Venue Details: Get an overview of our venue pricing, guest capacity, and what is included with our venues. (Hint: Your own personal butler!) Showcase of Real Weddings: Real weddings with menus and cost breakdowns for each of our venues to give you an idea of what’s possible and what your celebration could look like. Service and Catering Inspiration: Meet our team and get pricing guidelines for our diverse service and food offerings. Next Steps: What happens next and how to get started! Looking for more detailed and personalized pricing? We’d love to chat with you! Contact us or book your tour, and let’s explore your ideas, fine-tune details, and bring your dream day to life. Call 407-650-9558, text 844-533-0002, or email info@eventsbydubsdread.com . As always, if you have any questions for our team, just reach out! We’re here to help. Quick-turn weddings, done beautifully. Planning on a shorter timeline doesn’t mean sacrificing a thing. Book your 2025 wedding and get the exceptional venue, food, and service we’re known for – plus The Curated Collection , our gift of elevated enhancements to make your day even more unforgettable. Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/historic-dubsdread-home/",
      "text": "Historic Dubsdread Ballroom - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Events Catering Gallery About Pricing Guide FAQ Historic Dubsdread Blog Weddings Events Catering Gallery About Pricing Guide FAQ Historic Dubsdread Blog INQUIRE TODAY! Weddings Historic Dubsdread Parties & Events Historic Dubsdread Catering & Cuisine Historic Dubsdread Historic Dubsdread Ballroom Classic refinements and charming elegance come together to create the perfect backdrop for your special event at Historic Dubsdread Ballroom in Orlando. The beautiful country club setting with majestic hundred-year-old oak trees, lush foliage, and the manicured greens of the legendary Dubsdread Golf Course frame the warm and inviting stone and wood interiors of this 100-year-old historic building to create a truly one-of-a-kind experience. Video Walk-Through Tour Weddings Built in 1924, the original stone fireplace at one end and hardwood pine floors gleaming beneath the open wood-beam ceiling, the Historic Dubsdread Ballroom venue exudes sophistication and Old Florida rustic charm. Exclusively managed by Events by Dubsdread - Award-Winning Food and Service. Three Distinct Spaces Within the Historic Dubsdread Ballroom Venue - Booked Separately or Can Be Combined. Able to Accommodate Parties of 20-250 Guests. On-Site Bridal Suite. Venue Rental includes – Tables, Chairs, China, Glassware, Silverware, and Standard House Linens. Indoor and Outdoor Ceremony Options Available. Stunning Outdoor 100-Year-Old Oak Tree Ceremony Space. Ceremony and Reception Timeframes – 5 Hours. Reception Only Timeframes – 4 Hours with Option for Additional Time. (subject to availability) Brunch/Afternoon and Evening Timeframes Available. Venue Rental Rate Discounts Available. (based on time of year, day of the week, time of day, etc.) Located just 10 minutes north of downtown Orlando. Parking included. View Brochure You Get More Than a Venue - We Are at Your Service When you plan your wedding with Events by Dubsdread in the greater Orlando area, our Event Specialists offer their knowledge, experience, and guidance throughout the pre-event planning process and become dedicated members of your day-of event team for no additional charge. At Your Service Our event coordinators offer service and hospitality you won’t find anywhere else including: PRE-EVENT SERVICES: Tasting for Four – Scheduling and Menu Guidance. Ceremony and Reception Layout Assistance. Vendor Guidance and Coordination Assistance. Optional Planning Session. Final Event Planning Meeting – 1 to 2 Hours. Ceremony Rehearsal Assistance (for onsite events). DAY-OF SERVICES: Day-of Event Vendor Check-In and Management. Schedule, Coordinate and Manage Day-Of Event. Display Case Creation. Placement of Favors, Pre-Assembled Centerpieces, Place Cards, and Table Assignments. Floral Distribution for Family and Wedding Party. Door Greeters for Guest Arrival. Personal Butler for Wedding Couple. Cake Cutting Coordination. Inquire Today Parties & Events Let's Celebrate Whether it’s an intimate gathering to prepare for a milestone event, corporate function, or a large celebration of a special occasion, Events by Dubsdread works with your taste and personality to get every detail right for your event. Onsite at one of our three exclusive venues or at a location of your choice, our creativity and award-winning food will help you leave a lasting impression on your attendees, friends, and family. Anniversary Parties Baby Showers Birthdays Bridal Showers Celebrations of Life Corporate Luncheons Employee Appreciation Events Holiday Parties Leadership Meetings Lectures Lunch and Learns Networking Events Product Launches Rehearsal Dinners Training Sessions Events by Dubsdread social gatherings are customized to your needs with flexible seating and setups that can include sit down receptions, theater-style seating, cocktail-style, or a combination of several to accommodate your needs. Inquire Today Catering Dining Together Whether you prefer plated service, heavy hors d’oeuvres, or a buffet-style meal, your cuisine options are limitless. We can customize your menu to create something perfect for your event, group size, budget, cultural or dietary needs, and personal preferences. Some of our most popular menu options include: (availability subject to change) Boursin-stuffed Chicken with Herb Crust. Filet Mignon with Mushroom Merlot Sauce. Maryland-style Jumbo Lump Crab Cakes. Parmesan-Crusted Fresh Catch of the Day. Handmade Mushroom Ravioli, plus Many Vegetarian, Gluten Free, and Dairy Free Options. I-Do Barbecue Buffet: Candied Bacon Skewers, Brined Chicken, Smoked Tri Tip, Hush Puppies and Much More! Build-Your-Own Brunch Buffet: Eggs Benedict, Mimosa Bars, and Omelet Stations. Mix and Mingle Hors D’oeuvres: Poke Shooters, Mini Chicken Cordon Bleu, Baked Brie and Raspberry en Croute, Conch Fritters with Key Lime Mustard Sauce, Pot Stickers, and So Many More! And Our Fun Addition Bars: Macaroni & Cheese Bar, Slider Bar, Mini-Pancake Bar, Shrimp & Grits, Nitro Popcorn, S’mores Station, Bottomless Mimosas, Cotton Candy Bubbly Bar, Late Night Treat Selections, and Many More! See the delicious options for yourself! View Menus Get Inspired Follow us on Instagram Get Started Submit an Inquiry Historic Dubsdread 549 West Par Street\nOrlando, FL 32804 | 407-650-9558 Submit an Inquiry Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment PRICING GUIDE Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Walk Through The Historic Dubsdread Venue Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-at-the-highland-manor-taylor-and-brian/",
      "text": "Real Wedding at The Highland Manor – Taylor and Brian - Events by Dubsdread Skip to content Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Real Wedding at The Highland Manor – Taylor and Brian Real Wedding at The Highland Manor – Taylor Welsh and Brian King At Dubsdread Catering we love being dedicated members of the team that makes your big day your best day. While we are masters at the planning and executing the behind-the-scenes work, we know our clients have their own unique perspective on their event. We thank recent couple Taylor Welsh and Brian King for graciously sharing their experience to benefit others. BRIDE AND GROOM: Taylor Welsh and Brian King WEDDING DATE: December 10, 2022 VENUE: The Highland Manor EVENT COORDINATOR: Michelle Edmiston, Event Specialist/Sales Representative VENDORS: Photographer: Photography by Greg See our Dubsdread Catering Vendor Profile on Photography by Greg Florist: Fairbanks Florist https://www.fairbanksflorist.net/ See our Dubsdread Catering Vendor Profile on Fairbanks Florist DJ: Junction 88 See our Dubsdread Catering Vendor Profile on DJ Mike and Junction 88 Hair/Makeup: Grace Ha & Presila Pilar Draping: W Draping Dessert: Tru Cakes ONE YEAR OUT: How/where did you get engaged? Brian proposed to me in July of 2019 in front of Cinderella’s castle at Walt Disney World’s Magic Kingdom. Before the pandemic we were annual passholders and made the two-hour drive once or twice a month to visit the parks. I had a feeling that the proposal was coming so it was nerve wracking to act 100% surprised but I still loved every minute of it. It was also my birthday weekend, so we finished off the evening with dinner inside the castle, taking photos with all of the princesses as they came around to our table. What are you most excited about for your wedding day? Brian is super excited about the food, and I have to say I am too – we are huge foodie people! But in all seriousness, we are mostly excited to come together with family and friends and finally just celebrate our marriage. Postponing and rescheduling our wedding three separate times was taking a toll on everyone involved but we wanted to make sure we could be inclusive of all our loved ones. I am dreaming of what he is going to look like in his suit, and I know his curiosity about my dress has been killing him – in a good way! What aspect are you excited to plan the most? (Ceremony, food & beverages, photographer, DJ) Did I mention we love food – oh, and the cake, of course! I could also talk about the decor and flowers all day long if given the chance. It’s difficult to choose just one aspect that we are excited about because I just know the entire day will be wonderful no matter what happens or what we choose. We just can’t wait to get married! A FEW MONTHS OUT / PLANNING PROCESS: How do you feel the planning is going? We have thankfully had a lot of time to prepare for our ceremony and that has given us breathing room. With less than four months to go we have a lot of small items left open that Michelle Edmiston , our wonderful Dubsdread Catering coordinator , has kept us on track with ideas, updates, and reminders that that I never would have thought of on my own! I created a checklist based on our conversations to help us stay on track. Being able to visualize what’s outstanding has been a huge help. What have you found to be more difficult than you expected? Ensuring that everyone received a save the date and formal invitation in the mail has been a lot harder than I expected! Brian has lived at the same address (until we got engaged) for nearly two decades, and I also had been in the same location for nearly ten. That just isn’t the norm anymore and I learned the hard way once mail either did not arrive at a guest’s address or I had it being returned to me. Never assume just because a few months ago someone lived in one place that they haven’t moved! I think that if we were to do this over again, I would save paper invites for family and look more into digital options for other guests. What has been more fun about the process than you expected? With our families being on the small side these days, it’s been so nice to see everyone just generally be excited for the big day. Normally the bride’s dress shopping is a huge deal – and it was a lovely day – but personally seeing my future mother-in-law pick out a gorgeous gown of her own made my heart so full. Brian’s father had a suit custom made and my mother is also having her gown created by a family friend. Weddings and formal events are something none of us typically find ourselves a part of and so we wanted everyone to feel special and confident in what they were wearing. We can’t wait to see the photographs in the end when it all comes together. WEDDING DAY: What was the best, most memorable part of your big day? Since the sun sets rather quickly in December, we had to do a first look and take the bulk of our photographs before the ceremony. I was caught up in the whirlwind of the bridal party being awake since the sun rose that morning, afraid that we would run out of time. When I came downstairs to meet Brian and our families I had to pause and take everything in. His reaction to seeing me in my dress was emotional and so special. At that moment the photographs didn’t matter, I didn’t hear the buzz of guests arriving down the hall, I just felt like only he and I seemed to exist in that moment. We could have gotten married right there in the entryway of the manor and it would have been perfect. If you could change one or two things about your event, what would they be? I should have asked someone to record the cocktail hour musicians that we hired, even if it was on a cell phone. Our photographer was wonderful at keeping a tight timeline while making sure we had lots of lovely pictures but it’s simply just impossible to be in so many places at once when you are the bride and groom. I did manage to watch and listen from a distance while my dress was being bustled in a corner and snuck in a couple of tunes! I also should have researched how to preserve a wedding bouquet a lot sooner than a month after the event. My bouquet has been drying on a towel on our dining room table since we arrived home and I am still unsure of what to do with it! Is there any advice you would give other couples planning their event that you wish some-one had told you? When planning a wedding – no matter how big or how small – there will always be someone that is not accepting or approving of the choices you are making about your day. You will not please everyone no matter how hard you try. Your wedding is about you and your future spouse and what makes the two of you happy. The only thing you can control about your wedding day is how you react to what is happening around you. Focus on your own needs and those of your partner. This can also apply to unexpected hiccups that may happen throughout the process or even the day of. We definitely had to go with the flow as we had multiple members of the wedding party suddenly drop out for various reasons with about a week to go. They were missed dearly, but in the end, we had each other and that’s what truly matters. Photos courtesy of the bride, groom, and Photography by Greg. When you book a wedding with Dubsdread Catering at one of our exclusive venues, we provide wedding coordination at no additional charge. Our coordinators become dedicated members of your team bringing experience and expertise to help you execute your vision. Contact them today via our Contact Us page to make our team your team in making your dreams come true. Previous Next Share the Post: Related Catering Event Posts Real Wedding: Emily Gordon & Jack Biro Read More Real Wedding: Olivia Gibbons & Jason Howick Read More Discover the Natural Beauty of a Winter Park Wedding Venue Like No Other Read More Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://highlandmanornh.com/contact-us/",
      "text": "Contact Us | Highland Manor Rehabilitation and Nursing Center Skip to content Home About Us Our Services General Services Rehab & Long-Term Care Short-Term Care Join Our Team Contact Us Home About Us Our Services General Services Rehab & Long-Term Care Short-Term Care Join Our Team Contact Us Get in Touch with Highland Manor Whether you have questions about our personalized care options, want more information about our community, or would like to schedule a tour, we’re here to help. Our dedicated team is available to assist you with any inquiries and guide you through the process of finding the right care for your loved one. (507) 655-3791 info@highlandmanornh.com Schedule a Tour Interested in seeing our vibrant community firsthand? Fill out our online form or give us a call to arrange a tour. We look forward to welcoming you to Highland Manor Rehabilitation and Nursing Center at Johnstown and showing you all that our community has to offer! Name Email Phone Message Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. With a focus on patient-centered care, Continuum’s approach to patient satisfaction is the foundation of its culture. Quick Links About Us Join Our Team Contact Us Our Services General Services Rehab & LTC Short-Term Care Contact Us 750 Schooley Avenue Exeter, PA 18643 Phone: 570-655-3791 info@highlandmanornh.com Facebook Instagram Linkedin © 2025 – All Rights Reserved | Continuum Healthcare"
    },
    {
      "url": "https://eventsbydubsdread.com/venue-spotlight-the-highland-manor/",
      "text": "Venue Spotlight – The Highland Manor - Events by Dubsdread Skip to content Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Venue Spotlight – The Highland Manor Venue Spotlight – The Highland Manor Nestled on secluded grounds in Apopka, The Highland Manor is surrounded by ancient oaks and steeped in 110 years of history. Once a grand private home, the Apopka landmark has become one of Central Florida’s premier event venues exclusively available through Dubsdread Catering. Come visit us and find yourself on our sweeping veranda looking out over ancient oaks, rolling scenic vistas, and gracious spaces all providing a classic and stunning backdrop for your special Central Florida wedding or event. A great location with plenty of options for events of all sizes and has three different spaces within the facility to select from, or combine, to accommodate groups large and small. Hosting Your Wedding or Event at The Highland Manor The Highland Manor features distinguished details you won’t find anywhere else. The large, rambling house with its metal roof and native woodwork is charming and authentic. The Crystal Ballroom and Oak Room are perfect for ceremonies or receptions and the Verandah with its many glass windows is the perfect stage for buffets. The large bar area is grand and provides plenty of room for intimate cocktail functions. The rolling oak-shaded lawn offers stunning natural backdrops for wedding photos and videos. Many wedding ceremonies take place under one of the grand oak trees for those looking for a gorgeous natural setting. We are able to accommodate parties of 20 to 250 for a full dinner service and cocktail-style receptions for up to 600 guests, when utilizing all banquet areas. The Highland Manor has been voted the best wedding venue in Central Florida by readers of The Knot nine years in a row. . The Highland Manor is also the perfect location for business meetings, corporate functions, conventions and conferences as well as space for baby or bridal showers, milestone birthday celebrations and so much more.The versatile venue offers a combination of indoor and outdoor event spaces that allows for the flexibility in size, seating and ability to move your group from outdoor for a cocktail reception or tented soirée, to a full sit-down dinner. Our atmosphere is truly unmatched in Central Florida, providing the perfect venue and setting for unforgettable receptions and parties. Included at no additional charge When you plan your wedding with Dubsdread Catering, our event coordinators become dedicated members of your team for no additional charge. They offer knowledge, experience, and professional polish, to your event and attend to the details. Venue-owned tables, chairs, ceremony chairs, house linens are included with the venue rental. The Highland Manor amenities include: Historic Building Classic Southern Charm & Elegance Natural and Scenic Grounds Able to accommodate parties of 20-600 guests 600 Guests Cocktail Style, Seating up to 250 Guests Indoor and Outdoor Ceremony options available Indoor and Outdoor Event Spaces options available Rolling oak-shaded lawn offers stunning natural backdrops for wedding photos and videos Ballroom, Oak Room, Verandah and Large Bar areas Stage and Dance Floor areas Brunch, afternoon and evening time frames available Fantastic Bridal Suite and Ready Rooms Award-winning cuisine Superior service including dedicated Head Table server for the wedding couple Tables, chairs, china, glassware, and silverware included Standard House Linens in white, ivory or black (table linens and napkins) included Exclusively Managed by Dubsdread Catering Event Coordinator and complete coordination service included Parking lot on-site, valet available if needed Hotel accommodations available directly next door Just 30 minutes from downtown Orlando Contact one of our dedicated event specialists today to learn more about visiting this venue, all the extras included, and food and beverage options for hosting your wedding or event at The Highland Manor or another of our exclusive venues. Reach one of our dedicated team members at 407-917-9269 or fill out our form on the Contact page. Looking for more inspiration? Visit The Highland Manor wedding gallery. Previous Next Share the Post: Related Catering Event Posts Real Wedding: Emily Gordon & Jack Biro Read More Real Wedding: Olivia Gibbons & Jason Howick Read More Discover the Natural Beauty of a Winter Park Wedding Venue Like No Other Read More Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/upcoming-events/",
      "text": "Upcoming Events - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Upcoming Events Share this event with your friends Forever Begins Here – Open House event at The Highland Manor The Highland Manor Sunday, September 14 · 11:00 a.m. – 1:00 p.m. Join Events by Dubsdread for Forever Begins Here — a romantic, detail-filled open house at The Highland Manor. Tour the space at its most magical and see why couples fall in love with our venues — but choose us for our service. If you’re considering one of Events by Dubsdread exclusive venues or our catering services at one of our partner locations, this is the perfect chance to meet our team, experience our service, enjoy food and beverage samples, check out vendors, and imagine what’s possible. Location: The Highland Manor • 604 E Main St, Apopka, FL 32703 Date/Time: Sunday, September 14th, 2025 • 11 a.m. – 1 p.m. RSVP Today Share this event with your friends “Best Laid Plans” Murder Mystery Dinner at The Highland Manor The Highland Manor Friday, September 26 · 5:30 p.m. – 9:30 p.m. Due to popular demand, the murder mystery returns! Join us on Friday, September 26 at The Highland Manor for “Best Laid Plans” , a glamorous Old Hollywood murder mystery dinner you won’t forget. Enjoy appetizers, salad bar, dinner buffet, dessert, and a drink ticket – all while you and your friends solve a live murder mystery show. Reserve your table of eight with bottomless champagne or purchase individual tickets. Seating is limited to 150 guests and we sold out early for our last event! Location: The Highland Manor • 604 E Main St, Apopka, FL 32703 Date/Time: Friday, September 26th, 2025 • 5:30 – 9:30 p.m. Get Your Tickets Share this event with your friends Sip & Shop Fall Finds & Local Vibes Azalea Lodge at Mead Botanical Garden Sunday, September 28 · 11:00 a.m. – 2:00 p.m. Fall may not have fully arrived in Florida, but that doesn’t mean we can’t channel the season’s best vibes. Join us for a relaxed, feel-good afternoon at Azalea Lodge – where the gardens are lush, the drinks are flowing, and every local business brings something curated or handcrafted – and always inspired. Whether you’re a planner getting a head start on holiday shopping or someone who simply loves beautiful, unique finds, this is your go-to event for local finds and early autumn feels. Whether you’re a planner getting a head start on holiday shopping or someone who simply loves beautiful, unique finds, this is your moment. Sip something chilled, taste something delicious, and shop your way through a curated collection of Central Florida’s most creative vendors. What’s Included: 🍷 Two drinks included with your ticket 🧀 Light bites from Events by Dubsdread Catering 🎶 Music, outdoor ambiance & plenty of fall charm 📸 Gorgeous photo ops throughout the gardens Location: Azalea Lodge at Mead Botanical Garden Date/Time: Sunday, September 28th, 2025 • 11 a.m. – 2 p.m. Admission: $15 (includes food, two drinks, and a $5 vendor credit) Buy Tickets Contact Us Today Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://highlandhall.org/contact-us/",
      "text": "Get in Touch with Highland Hall Waldorf School Skip to content About Diversity, Equity and Inclusion Leadership and Governance News Academics Parent & Child Preschool Kindergarten Lower School Middle School High School Athletics Music Programs Farm and Garden World Languages Our Perspective on Media & Technology Art Program Class Trips Admissions Visit Us How To Apply Tuition: A Waldorf Education within your Reach International Student Program FAQ Campus Life The Treehouse Events & Festivals Farm and Garden Parent Association Alumni Summer Camps Giving Donate Wish List Spring Soiree 2025 Ways To Give Contact Job Postings Login Inquire Menu About Diversity, Equity and Inclusion Leadership and Governance News Academics Parent & Child Preschool Kindergarten Lower School Middle School High School Athletics Music Programs Farm and Garden World Languages Our Perspective on Media & Technology Art Program Class Trips Admissions Visit Us How To Apply Tuition: A Waldorf Education within your Reach International Student Program FAQ Campus Life The Treehouse Events & Festivals Farm and Garden Parent Association Alumni Summer Camps Giving Donate Wish List Spring Soiree 2025 Ways To Give Contact Job Postings Login Inquire Login Inquire Contact Us Home Contact Us Contact Us Leave Us a Message Do you have questions or are you ready to connect with us? Contact us today. We are here to help you on your educational journey. Name Phone Email Message GET IN TOUCH Leave Us a Message Do you have questions or are you ready to connect with us? Contact us today. We are here to help you on your educational journey. School Contact Information: Address: 17100 Superior Street, Northridge CA 91325 Main Office: Phone: 818-349-1394 (press \"0\" for reception) Fax: 818-341-6455. Campus Directions: Click here for directions Stay Informed Follow Highland Hall on: Instagram Facebook Linkedin Sign up to receive notices about school events: Email: events@highlandhall.org Job Postings Parent Child Teacher- Part-Time Position (25-28 hours) or Salaried with Bridge Program This position is responsible for holding classes in a variety of environments, both indoors and outdoors, for parents and their children ranging from two months to three years. In addition, this position is responsible for attending faculty and mentoring meetings as well as liaising with the administration, faculty, and parents, as needed.\r\n\r\nEssential Functions\r\n\r\n• Facilitate educational opportunities in the form of discussions and readings to provide inspiration, tools, and support for parenting\r\n• Provide families with a warm introduction to Waldorf education and Highland Hall Waldorf School\r\n• Thoughtful planning of the daily, weekly, and seasonal rhythms of the class\r\n• Maintain open communication with parents\r\n• Participate in school community and public relations events (e.g. open house)\r\n• Other duties as directed to meet the needs of the school.\r\n\r\nEducation / Certifications\r\n• Bachelor's Degree\r\n• Waldorf teaching or LIFEWAYS certification from a recognized institution\r\n• Pediatric CPR/First Aid certification\r\n• Current TB clearance\r\n\r\nJOB DESCRIPTION\r\n• Understanding and embracing of Waldorf pedagogy\r\n• Excellent communication skills, both verbal and written – detailed, clear, and concise\r\n• Commitment to a collaborative work environment\r\n• Organizational and time management skills\r\n\r\nSkills, Specialized Knowledge, Experience\r\n• Waldorf parent-child teaching experience or Waldorf lead teaching experience\r\n• Deep commitment to Waldorf principles part time Learn More Early Childhood Substitute Our Early Childhood Center is seeking a substitute assistant teacher. The substitute may assist in the classroom and help with the transition to nap, or carry nap-time and supervise afternoon play outdoors. We are looking for someone with a calm, quiet demeanor who is interested in a non-academic, developmental, nurturing, approach to early childhood education. Candidates must have completed the state required ECE 12 course units. Substitute hours vary and are usually 8:00AM-1:00PM or 12:15-3:15, Monday through Friday.\r\n\r\nQualified candidates, please send a resume and brief letter of interest to: klavner@highlandhall.org. part time $20 per hour Learn More VIEW ALL Highland Hall, a non-profit school, does not discriminate due to race, religion, gender, national origin, disability, or other basis protected by law. Instagram Facebook Linkedin Contact us info@highlandhall.org Phone: (818) 349-1394 17100 Superior Street, Northridge, CA 91325 Others About Visit Us Admissions Campus Life News Quick Links Parent Square Public Calendar Faculty Links Jobs Accreditations Back to top Powered By Pink Shark Marketing Inc Privacy policy Login Please select your login below to access the school’s resources and stay connected with the community PARENT LOGIN Parent Square Login Ravenna Login STUDENT LOGIN Square Student Login"
    },
    {
      "url": "https://www.themanortavern.com/about",
      "text": "About — MANOR TAVERN Menus About Catering and Events Reservations Gift Cards Contact Back Lunch Dinner Dessert Brunch Bar Menu Wine Bottle List Wine by the Glass Specialty Cocktails WEEKLY SPECIALS Back Manor Events & Wine Suppers Catering at Manor Tavern Catering Off Premise Menus Lunch Dinner Dessert Brunch Bar Menu Wine Bottle List Wine by the Glass Specialty Cocktails WEEKLY SPECIALS About Catering and Events Manor Events & Wine Suppers Catering at Manor Tavern Catering Off Premise Reservations Gift Cards Contact THE HISTORY Come Out to the Country, We’re Worth the Drive The Manor Tavern is a picturesque, 267 year old property dating back to the time of George Washington and is said to have housed the first president’s horse on occasion. In fact, the area began as a stable and over the years had evolved into a blacksmith shop, a general store and a saloon. Our logo, inclusive of a horse, is a hat tip to our historic roots here in Monkton. Today, it’s a country oasis in the heart of steeplechase land where friends and family gather for delectable food and exquisite service. Like our history here in Maryland, our patrons are loyal and longstanding. We value the relationships we have cultivated with all of you year after year. FARM-TO-TABLE At the Manor Tavern, taste is everything. Our grounds allow us to control all aspects of the growing process from our farm to your table. We are always open to suggestions so share with us any specific herbs or produce you’d like to see in our garden. Optimal Freshness Our produce is generally harvested when we need it. When a fruit or vegetable is given the time to completely ripen, it fully develops and retains its vitamins and minerals, giving it a more vibrant flavor and maximizing the nutritional content. Our large variety of items have a longer time to ripen “on the vine” ultimately eliminating travel time and processing and optimizing the taste and texture of our food. Community Each item that we grow has its own unique story. Growing and buying locally means you are supporting the family farmers and ranchers that raised your food. Connecting to the sources is a very meaningful part of the overall experience. Our selection of available produce changes weekly, dependent upon what is readily available in our area. This allows us to deliver items when they are at their peak, are most abundant, and in the case of farmers markets, least expensive. Managing Partner, The Manor Group Jerry Edwards, CPCE Founder of Chef’s Expressions at the Manor, NACE Hall of Fame Inductee, Hospitality Industry Icon Award Winner From 1981 to 2020, Jerry was Founder and Owner of Chef’s Expressions Catering and Events, which has twice been named The National Catering Company of the Year. Jerry holds an honorary doctorate in hospitality. In 2008, he was inducted into the NACE Hall of Fame. In 2015, Jerry was honored as a National Industry Icon by the hospitality community. He has won over 50 industry competitions including Baltimore’s Best Crab Soup, three ACF Gold Medals, the “Best Chef” for the Meals on Wheels Culinary Extravaganza, The Crystal Toque Award in the Nation’s Capitol, The Special Event Award for best event, Baltimore’s “Iron Chef” competition and the Mid-Atlantic Taste of Elegance competition. Today, Jerry leads the team of professionals at The Manor Tavern.  These outstanding individuals include Alicia Strawderman, Director of Chef’s Expressions at The Manor, Luis Banegas, Manor Tavern Restaurant Manager, Zoltan Dober-Huang and Executive Chef Sebastien Lemarre. Our team is here to serve you and create an unparalleled experience. Restaurant Manager, The Manor Tavern Luis Banegas Luis began his career with Chef’s Expressions in 1997. His infectious smile and dedication to serving guests quickly propelled him to become the top catering manager. He later managed the Chef’s Expressions operations team for over 10 years, honing his skills in leadership and customer service. With extensive experience in fine dining and exceptional hospitality, Luis is now the perfect choice to manage The Manor Tavern. This storied restaurant has undergone a renaissance under a new management team, bringing fresh enthusiasm and innovative ideas to the Tavern. Be sure to stop in and see Luis or Assistant Manager/ Sommelier Zoltan Dober -Huang, soon. Their warm welcome and exceptional service are sure to enhance your dining experience. Executive Chef, The Manor Tavern Restaurant Sebastien Lemarre Chef Sebastien brings a wealth of culinary expertise and leadership to The Manor Tavern, elevating its dining and catering experiences. With a distinguished career as both a Chef and Culinary Instructor, Sebastien has seamlessly integrated into The Manor Tavern team, sharing his knowledge in culinary arts and management. Under his leadership, he has built a talented team of chefs and cooks dedicated to delivering some of the finest restaurant and catering cuisine in the region. His impressive résumé includes serving as Executive Chef at Hunt Valley Country Club and contributing to World Central Kitchen as Director of Relief Training and Director of Culinary Training. His passion for culinary education has also been a significant asset to The Manor Tavern. He previously held roles as Culinary Arts Instructor and Coordinator in Mayagüez, as well as Culinary Arts Academy Director at Escuela Hotelera de San Juan. Sebastien’s dedication to culinary excellence and mentorship continues to shape and strengthen The Manor Tavern’s culinary offerings. Assistant Manager, The Manor Tavern Zoltan Dober - Huang Zoltán was born in Budapest, Hungary, and raised in San Jose, California. A recent Maryland transplant, he’s eager to explore everything the Chesapeake Bay State has to offer. With extensive experience in every Front of House role, Zoltán brings a deep understanding of hospitality to his managerial responsibilities. Having lived in California’s renowned wine regions, he developed a passion for winemaking and tasting, which he now shares as the leader of The Manor Tavern’s wine education program. He also curates weekly wine initiatives, including complimentary tastings and wine-by-the-glass specials, to enhance the guest experience. Zoltán’s ultimate dream is to own a chic cocktail and wine club featuring live jazz every night. In the meantime, he’s dedicated to bringing that same energy and creativity to The Manor Tavern. 410.771.8155 info@manortavern.com Hours VISIT US HOURS 15819 Old York Rd. Monkton, MD, 21111 410.771.8155 Inquiries RESTAURANT HOURS Lunch - 11:00-4:00 Wednesday to Saturday Dinner - Tuesday to Saturday 4:00-9:00 (last seating) Sunday Brunch - 11:00-3:00 Sunday Dinner - 3:00 - 8:00 BAR HOURS Tuesday open 4:00 until 9:00 Wednesday, Thursday open until 10:00 Friday and Saturday open until 11:00 Sunday open until 9:00"
    },
    {
      "url": "https://highlandbrewing.com/team/",
      "text": "Team - Highland Brewing Beer All Beers Beer Finder 2025 Beer Release Calendar Visit Us Brewery Experience Food Trucks Tours Reservations Events Public Events Live Music Host an Event Recreation Volleyball Disc Golf Rec Calendar About Thirst for Good About Us Our Values Our Founder Meet The Team Community Sustainability Store Team We cultivate and celebrate beer, business, people, and place. About Us Our Values Meet The Team Community Sustainability Careers Leadership Leah Wong Ashburn President/CEO, Family Owner Brock Ashburn Vice President of Operations Nikki Mitchell Vice President of Brand Development Sales Matt Thompson Sales Director Amy Heald Sales Operations Manager Fritz Wirt Market Development Manager - Western North Carolina Andrew Baker Key Account Manager:  Large Format, Small Format, & On Premise Chains Ben West Market Development Manager – Charlotte Bryan Ludwig Market Development Manager – WNC Allison Brown Market Development Manager – Raleigh-Greensboro Jacob Wiedeman Field Sales Representative – TN Matthew Watson Strategic Account Manager Marketing Marissa Burns Destination Marketing Manager Laura Beck Creative Design Manager Jared Turbyfill Brand Manager Hannah Smentkowski Social Media & Content Creator Cait Brennan Graphic Designer Dave Lee Retail & POS Planner Private Events Erin Winter Event Manager Monica Mayville Venue Coordinator Bailey Penrod Events Assistant Manager Kirsten Fraude Venue Coordinator Kara Bonelli Venue Coordinator Vivienne Ankeney Venue Coordinator Taproom Events & Programming Chris Norred Talent Buyer Steve Till Lead AV Engineer Keith Thering AV Engineer Douglas Mostyn Sports & Rec Coordinator People & Culture Meg May Payroll & Benefits Admin Specialist Accounting Liza Van Cauwenberghe Finance Director Megan Best Accounting and Regulatory Coordinator Beth Gaither Accounting & Purchasing Assistant INNOVATION BREWING Josh Jiles Brewing Innovation Manager Mike Shield Pilot Room Brewer Brewing Jesse Lapinski Brewing Supervisor Alan Robinson Brewer Drew Ashdown Brewing Team John Mitchell Brewer Nate Corn Brewing Team Ivan Hernandez Brewer Keith Wright Brewer Quality Megan Rayfield Quality Manager Hannah Motter Quality Lead Chris Messina Quality Lab Assistant Packaging Cooper Allison Production Services Specialist Mike Radzilowsky Packaging Technician Ryan Sullivan Packaging Team Leader Emily Fisher Packaging Technician Van Wharton Packaging Technician Jonathan Sorrentino Packaging Technician Steve St. Clair Packaging Technician Aiden Delowery Packaging Technician Robert Little Packaging Technician Distribution Tyler Melton Distribution Team Leader Cole Crusenberry Distribution Associate Fetch Miller Distribution Technician Facilities Reggie Lunsford Events & Facilities Tech Ben Glass Facilities Maintenance Manager Justin Adams Facilities Operations Manager Operations Josh Yoder Production Maintenance Manager Jamie Rowe Production Brewing Manager Kevin Kellar Project Manager/Optimization Ben Strall Production Maintenance Technician Russ Robertson Brewery Operations Director Hospitality Chris Genua Guest Experience Director Peter Landis Assistant Taproom General Manager Blake Daughtrey Taproom General Manager Matt Smith Hospitality Ambassador J Unger Hospitality Ambassador Karoline Carr Hospitality Ambassador Jennifer Nathanson Hospitality Ambassador Paul Richau Hospitality Ambassador Lori Ahn Hospitality Ambassador Mike Herder Hospitality Ambassador Sophie Pruett Hospitality Ambassador Kenzie Alexander Hospitality Ambassador Taylor Pierson Hospitality Ambassador Lucas Owens Hospitality Support Staff Adam Jones Assistant Taproom General Manager Daryl Nathanson Hospitality Ambassador Margot Sutton Hospitality Ambassador Kevin Williams Hospitality Ambassador Kelcie Barker Hospitality Ambassador Bianca Colangelo Taproom Assistant Manager Jacob Coats Hospitality Ambassador Liza A Hospitality Ambassador Joe Austin Hospitality Ambassador Satchel Moberg Taproom Assistant Manager Brittany Carter Hospitality Ambassador Maggie Anderson Hospitality Ambassador Jessica Newhouse Hospitality Ambassador Lexie Harvey Hospitality Ambassador Cynthia McDermott Hospitality Ambassador Nicole Moore Taproom Assistant Manager Chelsea Gulliver Hospitality Ambassador Matt Tobia Hospitality Ambassador Emma Smiley Hospitality Ambassador Nicholas Williams Parking Attendant Brent Soesbee Parking Attendant Doug Rowe Parking Attendant Tyler Cupp Parking Attendant Merrick Noyes Parking Attendant Frank Milko Parking Attendant Eric Odom Parking Attendant Amanda Mortensen Hospitality Ambassador Elizabeth Shirley Hospitality Ambassador Michael Plourde Hospitality Ambassador Dustin Randall Hospitality Ambassador Beth Madden Parking Attendant 12 Old Charlotte Highway Asheville, NC (828) 299-3370 HOURS Updated 5/29/25 Mon – Fri | 12pm to 10pm Sat | 11am to 10pm Sun | 11am to 8pm Quick Links Contact Us Shop FAQs Careers Stay in the Know Sign up for Highland’s newsletter! Sign Up Now © 2025 Highland Brewing Co. Powered by Big Boom Design Privacy Press Follow Follow"
    },
    {
      "url": "https://eventsbydubsdread.com/events-by-dubsdread-home/events-by-dubsdread-catering/",
      "text": "Events by Dubsdread Catering - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Catering at Your Location or Ours Celebrations Catering at Your Location or Ours Corporate Events Catering at Your Location or Ours Catering & Events Welcome to Central Florida’s premier events and catering company, where we bring your vision to life. Our team specializes in weddings , corporate events, and special celebrations, crafting tailored experiences with exquisite cuisine and exceptional venues. We offer premium catering services at our exclusive locations and top venues across Central Florida, including the Winter Park Event Center, Orlando Science Center, and Harry P. Leu Gardens, as a preferred partner. Additionally, we are at your service for in-home or business catering. Learn More Catering Whether you prefer plated service, heavy hors d’oeuvres, or a buffet-style meal, your cuisine options are limitless. We can customize your menu to create something perfect for your event, group size, budget, cultural or dietary needs, and personal preferences. Some of our most popular menu options include: (availability subject to change) Boursin-stuffed Chicken with Herb Crust. Filet Mignon with Mushroom Merlot Sauce. Maryland-style Jumbo Lump Crab Cakes. Parmesan-Crusted Fresh Catch of the Day. Handmade Mushroom Ravioli, plus Many Vegetarian, Gluten Free, and Dairy Free Options. I-Do Barbecue Buffet: Candied Bacon Skewers, Brined Chicken, Smoked Tri Tip, Hush Puppies and Much More! Build-Your-Own Brunch Buffet: Eggs Benedict, Mimosa Bars, and Omelet Stations. Mix and Mingle Hors D’oeuvres: Poke Shooters, Mini Chicken Cordon Bleu, Baked Brie and Raspberry en Croute, Conch Fritters with Key Lime Mustard Sauce, Pot Stickers, and So Many More! And Our Fun Addition Bars: Macaroni & Cheese Bar, Slider Bar, Mini-Pancake Bar, Shrimp & Grits, Nitro Popcorn, S’mores Station, Bottomless Mimosas, Cotton Candy Bubbly Bar, Late Night Treat Selections, and Many More! You Get More - We Are at Your Service When you plan your wedding or event with us, our Event Specialists offer their knowledge, experience, and guidance throughout the pre-event planning process and become dedicated members of your day-of event team for no additional charge. Inquire Today Download Our Menus Wedding Menu Download Social Deluxe Menu Download Fun Additions Menu Download Get Started Submit an Inquiry Catering Menus Exclusive Venues Partner Venues Brochures Galleries Exclusive Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment PRICING GUIDE INQUIRE TODAY Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-the-highland-manor-alexis-johnston-benjamin-silva/",
      "text": "Real Wedding The Highland Manor - Alexis Johnston & Benjamin Silva - Events by Dubsdread Skip to content Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Real Wedding The Highland Manor – Alexis Johnston & Benjamin Silva Alexis Johnston & Benjamin Silva – 10/7/23 – The Highland Manor Photographer/Videographer: Honeywood Photography DJ: Soundwave Entertainment Florist: Dream Design Cake/Dessert: Cake n Bake Hair/Makeup: Kristy’s Artistry Design Team Photobooth: Soundwave Entertainment Draping: W Draping Pre-Wedding Experiences How/where did you get engaged? We were having a pool party at our house to celebrate Ben’s birthday and our college graduation. Towards the end, right before the cake, Ben started to give a speech to say thanks to everyone. His uncle actually interrupted the speech to sing a happy graduation song to him, but Ben asked him to stop so he could finish. The rest of the speech turned into a proposal. I was super surprised when it happened, but of course I said yes! What are you most excited about for your wedding day? Ben is most excited about spending time and sharing our exciting day with family. Honestly, I’m excited about everything that has to do with our wedding day. I can’t pick one thing to be most excited about. What aspect are you excited to plan the most? (ceremony, food & beverages, photographer, DJ) Ben is most excited to plan the reception, and I’m most excited to plan the ceremony. Wedding Planning How do you feel the planning is going? Planning is going pretty well! We have gotten a lot done so far, but we still have a ways to go before we are completely ready for the big day. What have you found to be more difficult than you expected? Timing has been more difficult than I expected. There was such a large gap between when we got engaged to our wedding day that I put off a lot of the planning and booking of vendors. I definitely wished I had spaced out everything a little better. What has been more fun about the process than you expected? The most fun thing about the whole process is getting to try out all these once in a lifetime experiences Wedding Day What was the best, most memorable part of your big day? I think the best, most memorable part was the ceremony. For me, walking down that aisle to the love of my life and expressing our love was my favorite part. For Ben, his most memorable part was seeing me come out the door and walk down the aisle. If you could change one or two things about your event, what would they be? We wish we had more time for all the things we wanted. I also wish I had taken the opportunity to eat some of the food we ordered (like appetizers and late night snacks) when they weren’t brought to me. Is there any advice you would give other couples planning their event that you wish someone had told you? My advice would be to make sure to be present and live every moment of your event. I felt like my whole wedding went by so fast, and while I got to do everything I wanted and more, I wish I had more time. Previous Next Share the Post: Related Catering Event Posts Real Wedding: Emily Gordon & Jack Biro Read More Real Wedding: Olivia Gibbons & Jason Howick Read More Discover the Natural Beauty of a Winter Park Wedding Venue Like No Other Read More Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/real-wedding-the-highland-manor-grossholz-and-sharp/",
      "text": "Real Wedding – The Highland Manor – Grossholz and Sharp - Events by Dubsdread Skip to content Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Real Wedding – The Highland Manor – Grossholz and Sharp Real Wedding at The Highland Manor – Nicole Grossholz and Coltee Sharp At Dubsdread Catering we love being dedicated members of the team that makes your big day your best day. While we are masters at the planning and executing the behind-the-scenes work, we know our clients have their own unique perspective on their event. We thank recent couple Nicole Grossholz and Coltee Sharp for graciously sharing their experience to benefit others. BRIDE AND GROOM: Nicole Grossholz and Coltee Sharp WEDDING DATE: April 16, 2022 VENUE: The Highland Manor EVENT COORDINATOR: David Osmola, Senior Wedding and Event Coordinator VENDORS: PHOTOGRAPHER : PB&J Studios FLORIST: Dream Designs Florist DJ: DJ Yves Entertainment DESSERT: Bakers Cottage OTHER: W Draping ONE YEAR OUT: How/where did you get engaged? He proposed at Disney Springs. We were supposed to be taking family Christmas photos, but he surprised me with the proposal. It was perfect because both of our families were there! What are you most excited about for your wedding day? We’re excited to celebrate and dance with all our closest friends and family! What aspect are you excited to plan the most? (Ceremony, food & beverages, photographer, DJ) We’re so excited to plan all the reception details including the decor, flowers, and how the food will be set up. The food is important to us because good food makes any occasion better! A FEW MONTHS OUT / PLANNING PROCESS: How do you feel the planning is going? We feel good with where we are at because we really have most everything done. All that is left are just small decorations to decide on. What have you found to be more difficult than you expected? Keeping to our budget has been more difficult than I expected. What has been more fun about the process than you expected? My favorite part so far was finding my dress. WEDDING DAY: What was the best, most memorable part of your big day? For us it was our ceremony. It was the happiest moment of our lives to finally say, “I do.” If you could change one or two things about your event, what would they be? Sadly, our cake wasn’t what we were expecting. I am gluten intolerant and the cake we test tasted isn’t what our cake ended up tasting like and we were very disappointed. Otherwise, everything else was perfect and I wouldn’t change anything else. Is there any advice you would give other couples planning their event that you wish some-one had told you? Have a plan and stay ahead of your schedule. Surround yourself with people who support you and what you want. Lastly and most importantly is don’t be afraid to put your foot down for what you are want. A lot of times you may feel pressured to give up things due to others’ opinions or difficulties, but where there’s a will there’s a way. Photos courtesy of the bride, groom, and PB&J Photography. When you book a wedding with Dubsdread Catering at one of our exclusive venues, we provide wedding coordination at no additional charge. Our coordinators become dedicated members of your team bringing experience and expertise to help you execute your vision. Contact them today via our Contact Us page to make our team your team in making your dreams come true. Previous Next Share the Post: Related Catering Event Posts Real Wedding: Emily Gordon & Jack Biro Read More Real Wedding: Olivia Gibbons & Jason Howick Read More Discover the Natural Beauty of a Winter Park Wedding Venue Like No Other Read More Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://eventsbydubsdread.com/the-highland-manor-home/the-highland-manor-blog/",
      "text": "The Highland Manor Blog - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Events Catering Gallery About Pricing Guide FAQ The Highland Manor Blog Weddings Events Catering Gallery About Pricing Guide FAQ The Highland Manor Blog INQUIRE TODAY! Weddings Events Catering Gallery About Pricing Guide FAQ The Highland Manor Blog Weddings Events Catering Gallery About Pricing Guide FAQ The Highland Manor Blog The Highland Manor Blog Real weddings, vendor insights, and professional advice from the Team at Events by Dubsdread. Real Wedding: Karla Ortega & Harsh Sachdev Read More » Real Wedding: Abby Goetz & Justin Merkel Read More » Real Wedding The Highland Manor – Alexis Johnston & Benjamin Silva Read More » Real Wedding The Highland Manor- Ashley Hill & Erik Schweikert Read More » Real Wedding The Highland Manor- Julianna Ortiz & Gabriel Malaret Read More » Real Wedding – The Highland Manor – Grossholz and Sharp Read More » Real Weddings – Megan Powers and Nick Howard Read More » Real Weddings – Vow Renewal – Katherine and Wesley Read Read More » Venue Spotlight – The Highland Manor Read More » Real Weddings – Jacqueline Carrillo and Tarek Saade Read More » « Previous Page 1 Page 2 Page 3 Page 4 Next » Search Search The Highland Manor 604 East Main Street\nApopka, FL 32703 | 407-650-9558 Submit an Inquiry Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment PRICING GUIDE Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://thehighlanddallas.com/contact-us/",
      "text": "Contact Us | Hotels near Downtown Dallas | Highland Dallas Skip to Main Content Skip to Main Menu Skip to Footer Menu Stay Overview Rooms Suites Special Offers Pet Friendly Accessible Rooms Dine Highland Steakhouse Private Dining Events Relax Overview Infinity Pool Spa Fitness Events Overview Weddings Meetings Social Events Request for Proposal Explore Overview Things To Do About Overview Gallery FAQ Press Contact Us Highland Steakhouse Stay Overview Rooms Suites Special Offers Pet Friendly Accessible Rooms Dine Highland Steakhouse Private Dining Events Relax Overview Infinity Pool Spa Fitness BOOK NOW Events Overview Weddings Meetings Social Events Request for Proposal Explore Overview Things To Do About Overview Gallery FAQ Press Contact Us Book Direct & Save! Overview Gallery FAQ Press Contact Us Contact Us WE LOOK FORWARD TO IT If you’d like to know more about The Highland Dallas, a Curio Collection by Hilton™ hotel, would like to make arrangements for an upcoming visit to Dallas, or have a comment or suggestion about a recent stay, please get in touch. Contact Us \" * \" indicates required fields Name * First * Last * Email * Phone * Preferred Follow-up Method(s) * Phone Email Select All Comments Please note that by submitting this form you are agreeing to the sharing of your information in accordance with our Privacy Policy . Phone This field is for validation purposes and should be left unchanged. . THE HIGHLAND DALLAS RESERVATION 888-225-9664 PHONE 214-520-7969 CONTACTUS@THEHIGHLANDDALLAS.COM 5300 E. Mockingbird Lane Dallas Texas 75206 USA QUICK LINKS FAQ Contact Us Careers Global Privacy Statement Accessibility Advice Site Usage Agreement Cookies Statement Personal Data Requests Do Not Sell My Information Cookie Settings STAY IN TOUCH Instagram Facebook TripAdvisor © 2025. Hilton Hotel Website by O’Rourke . All Rights Reserved. 888-225-9664 Book Now"
    },
    {
      "url": "https://www.highlandartstheatre.com/about-us",
      "text": "About Us — The Highland Arts Theatre 0 Skip to Content WHAT'S ON Upcoming Events Next up: THE 22nd CONFIDENTIAL MUSICAL THEATRE PROJECT Sneak Peek: BEETLEJUICE THE MUSICAL JR Sneak Peek: PRICKED! - A Sleepingly Beautiful Pantomime Sneak Peek: CHRISTMAS AT SACRED HEART DOWNTOWN 2025 Sneak Peek: A CHRISTMAS CAROL 2025 Digital Experience GET INVOLVED 2025 FALL AUDITIONS Radical Access Work With Us Volunteer Become A Sponsor House An Artist Rent Our Space Join Our Mail List LEARN MORE HAT Gazette Blog July 2025 About Us Contact Us FAQ Past Productions Community Partners Seating Chart HAT ACADEMY DONATE Donate To Radical Access All Donations TICKETS Open Menu Close Menu Open Menu Close Menu WHAT'S ON Upcoming Events Next up: THE 22nd CONFIDENTIAL MUSICAL THEATRE PROJECT Sneak Peek: BEETLEJUICE THE MUSICAL JR Sneak Peek: PRICKED! - A Sleepingly Beautiful Pantomime Sneak Peek: CHRISTMAS AT SACRED HEART DOWNTOWN 2025 Sneak Peek: A CHRISTMAS CAROL 2025 Digital Experience GET INVOLVED 2025 FALL AUDITIONS Radical Access Work With Us Volunteer Become A Sponsor House An Artist Rent Our Space Join Our Mail List LEARN MORE HAT Gazette Blog July 2025 About Us Contact Us FAQ Past Productions Community Partners Seating Chart HAT ACADEMY DONATE Donate To Radical Access All Donations TICKETS Folder: WHAT'S ON Back Upcoming Events Next up: THE 22nd CONFIDENTIAL MUSICAL THEATRE PROJECT Sneak Peek: BEETLEJUICE THE MUSICAL JR Sneak Peek: PRICKED! - A Sleepingly Beautiful Pantomime Sneak Peek: CHRISTMAS AT SACRED HEART DOWNTOWN 2025 Sneak Peek: A CHRISTMAS CAROL 2025 Digital Experience Folder: GET INVOLVED Back 2025 FALL AUDITIONS Radical Access Work With Us Volunteer Become A Sponsor House An Artist Rent Our Space Join Our Mail List Folder: LEARN MORE Back HAT Gazette Blog July 2025 About Us Contact Us FAQ Past Productions Community Partners Seating Chart HAT ACADEMY Folder: DONATE Back Donate To Radical Access All Donations TICKETS WELCOME TO THE HIGHLAND ARTS THEATRE HERE YOU’ll find information about our team, organization, history, achievements, and our vision for our community PURPOSE To inspire artists, audiences and youth by creating meaningful opportunities that educate, entertain, and encourage. VISION The HAT will be a leader of artistic excellence for the performing arts in Atlantic Canada, enriching the lives of artists, audiences, and the broader community through accessible professional theatre. MISSION To fortify the professional theatre community in Cape Breton, to drive the local creative economy, to produce first-class, home-grown productions, and champion the education of the next generation of theatre artists. MANDATE To provide a year-round, professional theatrical presence in downtown Sydney, producing and presenting quality productions with a special emphasis on Cape Breton artists, stories, and songs. About Us Highland Arts Theatre, or \"The HAT\" as it's affectionately called, is the name of a performance venue in downtown Sydney, Nova Scotia, formerly the home of St. Andrew's Church. When the church was decommissioned in 2013, a team led by local businessman Kevin Colford stepped up to transform the beloved historical building into a state-of-the-art centre for arts and culture. The venue officially re-opened in June 2014 with an original musical comedy: \"The Wakowski Brothers\". While the venue is available for rent and has hosted many of Cape Breton's finest in the fields of music, comedy, dance and literature (such as Brent Butt, Ron James, The CBC Massey Lecture, Port Cities) , it is our mandate to create a year-round, professional theatrical presence in downtown Sydney, producing and presenting quality productions with a special emphasis on Cape Breton artists, stories, and songs. The Highland Arts Theatre Association is a non-profit organization registered under the Societies Act of Nova Scotia (3285136) and a registered charity with the Canada Revenue Agency (82383 3181 RR0001.) We are a Professional Member of Theatre Nova Scotia and have memberships with the Sydney & Area Chamber of Commerce, the Playwrights Atlantic Resource Centre (PARC), and the Playwrights Guild of Canada. In 2020, we piloted our brand new operating model: Radical Access - a crowd-sourcing model that allows us to offer all Mainstage Productions free of charge (inquire today for bookings or donations at info@highlandartstheatre.com). Our productions have toured to Ontario, Prince Edward Island, and mainland Nova Scotia and we have conducted partnerships and co-productions with Neptune Theatre, the Savoy Theatre, Sacred Heart Downtown, Eastern Front Theatre, Theatre New Brunswick, Festival Antigonish, The Confederation Centre for the Arts, the 2023 Canada Games, and the Chester Playhouse. About the Building Built by the Sydney and Mira Presbyterian congregation, originating in 1852, construction for St. Andrew's United Church started in 1910 and was completed in 1911. It was the third church built by the congregation, and was built to contain 1,000 people for services. Designed by architects Curry and Sparling, and built by Rhodes and Curry Company, the building was constructed using red brick from Mira, and the cost was $62,945. The church was fit with a 3,000 pipe pipe-organ made by the famous Casavant Frères in Quebec, as well as 10 engraved bell chimes that are still in use today. Architecturally, the end result was a beautiful house of worship, with impressive towers, bells chiming on Sundays and the steadfast permanence of the Gothic Revival style, rare within the Cape Breton Regional Municipality. In 2014, local business man Kevin Colford renovated the former church into its current form, a state of the art theatre venue in Downtown Sydney. HAT Academy After several years of courses being offered through the Highland Arts Theatre, the HAT Academy was officially launched in 2019 to meet the growing demand for more education opportunities. Courses and training programs are offered for recreational, emerging, and professional artists aged 5 to 105, covering topics including acting, music, dance, triple threat performance, writing, directing, stage craft, improv, Shakespeare, and more! Our first Academy production, Seussical the Musical, hit the stage in March 2019. The Academy's current home is 295 Charlotte Street, just behind the main theatre building. Many students (youth and adult) have made the leap from the Academy to the Mainstage, being hired as performers and stage craft artists in our season of professional productions. Some have had their writing developed for full length productions, and members of our current faculty began as students of the Academy. Whether you're looking for artistic growth or something to do, we pride the HAT Academy as a jumping off point for those looking to get more involved in our community. Thanks to our Radical Access program 100 scholarships are awarded annually to students in need of financial support. For more information, you can email us at academy@highlandartstheatre.com ! Awards 2025 Artist & Executive Director Wesley J. Colford honoured with the King Charles III Coronation Medal . 6 Robert Merritt Theatre Award nominations, winning 1 for: Outstanding Choreography (Sarah Propser - Mimikej) 2024 6 Robert Merritt Theatre Award nominations. 2023 14 Robert Merritt Theatre Award nominations, winning 3 for: Outstanding Independent Production (Samqwan) , Outstanding Choreography (Sarah Prosper - Samqwan) , and Outstanding Costume s (Kayla Cormier - The Happy Prince) . 2022 5 Robert Merritt Theatre Award nominations. 2020 Our Artistic & Executive Director, Wesley Colford, was named one of the Globe & Mail’s “Canadian Arts Heroes of 2020”. Recipient of the “Creative Community Impact Award” from Arts Nova Scotia. 1 Robert Merritt Theatre Award nomination. 2019 Recipient of the “Community Impact Award” and the People’s Choice Award for “Favourite Thing to Do/Experience in the CBRM” at the 30th Annual Excellence in Business Awards 2018 Nominated for “Venue of the Year” at the 2018 Music Nova Scotia Industry Awards Nominated for “Business of the Year” at the Sydney Chamber of Commerce Excellence Award 5 Robert Merritt Theatre Award nominations. 2017 1 Robert Merritt Theatre Award nomination. 2016 Recipients of the \" Arts & Entertainment Award \", the \" People's Choice for Favourite Arts and Culture Experience \", and Artistic Director Wesley J. Colford was awarded the \" Jack Yazer Young Entrepreneur of the Year\" , at the Sydney and Area Chamber of Commerce Excellence in Business Awards . Timeline 1852 The Mira Presbyterian congregation is formed. 1910 Construction of St. Andrew’s Church begins. 1911 Construction of St. Andrew's Church is completed. 2013 St. Andrew’s congregation amalgamates with other nearby churches and the building is put up for sale. 2014 Local businessman Kevin Colford purchases building and begins renovations to transform the former St. Andrew’s Church into the Highland Arts Theatre. 2016 The HAT becomes a professional member of Theatre Nova Scotia. 2018 The HAT becomes a member of the Sydney & Area Chamber of Commerce. The HAT is granted Charity Status. 2019 The HAT Academy officially launches as a training program for recreational, emerging, and professional artists aged 5 to 105. 2020 Radical Access is launched. 2024 The HAT celebrates its 10th Anniversary Season! Circa 1928, scanned from the St. Andrew's Church Annual Report MEET THE TEAM Wesley j. colford ARTISTIC & EXECUTIVE DIRECTOR (they/them) Wesley J. Colford is a Dora and Merritt Nominated playwright and theatre artist from Cape Breton who currently resides in Sydney, NS where they operate as the inaugural Artistic & Executive Director of the Highland Arts Theatre (or HAT). They studied theatre performance at Sheridan and George Brown College and spent eight years working in  Toronto’s independent theatre scene, working as a writer, director, actor, and producer for multiple companies, as well as box office manager for Tarragon Theatre. Their plays have been produced in three provinces and have won national awards, been published, and adapted for film. Under their leadership, the Highland Arts Theatre has produced more than 100 mainstage theatrical productions in the past ten years and been nominated for Dora, Merritt, Excellence in Business, and Nova Scotia Music Industry Awards. They are a recipient of a 2015 Vital Award, the 2016 Jack Yazer Young Entrepreneur of the Year Award, The Queen Elizabeth II Jubilee Medal, and have been nominated for “Business Person of the Year” from the Sydney and Area Chamber of Commerce Excellence in Business Awards. They were recently honoured as one of the Globe & Mail’s “Canadian Arts Heroes of 2020” for their work developing the HAT’s bold new funding model, Radical Access. adriana dimitri GENERAL MANAGER (she/her) Adriana is the General Manager of the HAT. She spends most of her time making sure the theatre is running smoothly and finding ways to improve our processes and systems. She has a Bachelor of Fine Arts, with honors in Production from York University and has worked in theatre across Canada and abroad at companies such as The Canadian Opera Company, Mirvish Productions, The Edinburgh Fringe Festival and the Centre for Opera studies in Italy. She is passionate about exploring alternate ways of working and different ways of leading, having worked for global companies in Defence and in the professional service industry. When she is not at the theatre, you can find her cuddling her two kitties, Burke and Arlo. KAYLA CORMIER TECHNICAL DIRECTOR (she/her) Kayla is the Technical Director and Resident Designer at the Highland Arts Theatre. She has designed and constructed the set, costume, and/or props for over 50 productions e.g. She Loves Me (Set), Mary’s Wedding (Set and Costume), West Moon (Set and Costume), and Little Shop of Horrors (Set). Kayla received a Vital Award (2020) for her work at the Highland Arts Theatre and was the recipient of a Robert Merritt Award (2023) for outstanding costume design for the HAT's production of The Happy Prince. Kiersten Penny PATRON SERVICES MANAGER (she/her) Tom Colford COMMUNICATIONS DIRECTOR (he/him) Tom has been informally involved with the Highland Arts Theatre since it began in 2014, as a frequent consultant. Over the years he has performed, directed, choreographed, written, filmed and produced at the HAT (not to mention painted hallways, moved pianos, been a bouncer and pulled all nighters setting lights with Ken).  At the end of 2019 Tom took over as social media manager at the HAT and in 2021 expanded that role to Communications Director for the organization. The HAT is near and dear to his heart, as the place he wished he had downtown when he was growing up in Cape Breton. HILARY SCOTT PROMOTIONS & GRAPHIC DESIGNER (she/her) Hilary is a co-founder of the Highland Arts Theatre, and served as Assistant Artistic Director from 2014 to 2017.  She continues of be a close collaborator at the HAT. A graduate of George Brown’s Theatre Conservatory Program, and a Certificate Holder in Art & Design Studio Skills from OCAD U. She has worn nearly every hat at the HAT, onstage and off; from season programming, patron services, and 4 AM set painting, to lighting, directing, and performing. Currently she operates out of Toronto as the HAT's Lead Graphic Designer. The posters you see pouring up the stairwells are nearly all her designs! You can find Hilary’s artwork for the HAT as well as other personal works/commissions on Instagram @hilhob ! KEN HEATON HEAD ELECTRICS (he/him) Ken Heaton (Lighting Designer, Theatre Electrician and Technician) has been actively involved in theatre for over 45 years.  Ken has designed the lighting for almost every show and event at the Cape Breton University's Boardmore Playhouse for more than 25 years, working and collaborating with a range of groups from student productions to professional touring groups. Ken is presently the Resident Theatre Lighting Designer and Head of Electrics for both the Savoy Theatre in Glace Bay, Nova Scotia, and at the Highland Arts Theatre in Sydney, Nova Scotia, responsible for much of the hands-on technical work (hanging instruments, programming the light board, etc.) that would be the work of the lighting crew in a larger theatre. Ken has created lighting for various productions at many other venues throughout the Maritimes, small and large, with many diverse theatre groups including Made With Purpose , the St Anne’s Bay Players , New York’s Yara Arts Group , Acadia Drama Group , Musicadians , Bells of Baddeck , and the Zuppa Theatre Co . Ken's lighting designs have toured with productions internationally, reaching at times as far as New Zealand. Recent lighting designs include pretty much everything produced at the HAT since 2014, including the recent productions of 'Cabaret', and 'Samqwan' (for which Ken was nominated for a 'Robert Merritt Award' for Lighting Design). If you don't find Ken in a theatre, try looking on a sailboat somewhere out on the Bras d'Or Lakes.  He'll probably be there... Nik Boisvert PRODUCTION ASSISTANT (they/them) Nik has descended from a long line of theatre kids, D&D nerds, and fix-it goblins. At any given moment they can likely be found screeching Sondheim to the pants in the costume room. The HAT is a perfect habitat for them. A big thank you to the Louisbourg costume dept. and the cosplay & convention community. MEET THE BOARD OF DIRECTORS Russell Coleman BOARD PRESIDENT (he/him) Board Member since 2021. He served for 22 years as an officer in the United States Marine Corps, then enjoyed a second career as a university and not-for-profit strategic planner. HEATHER GRANT BOARD VICE PRESIDENT (she/her) Board Member since 2024. Heather brings over 20 years of sales experience, she is a Realestate Agent for Remax Park Place. Erika Shea BOARD SECRETARY (she/her) Board Member since 2019. Erika is the CEO/President of New Dawn Enterprises. Shauna Giggey BOARD TREASURER (she/her) Board Member since 2024. Shauna recently started working for the Centre for Education but spent over 15 years in the financial industry. Anna Manley BOARD MEMBER Board Member since 2019. Past president (2021-2023). Legal industry. Principal lawyer at Manley Law Inc. Founder and CEO of Advocate Cognitive Technologies. Michael Cormier BOARD MEMBER (he/him) Board Member since 2021. ANJU VIRICK BOARD MEMBER (she/her) Board Member since 2021. Anju comes from the world of Education and was recently appointed the Interim Education Director at the HAT Academy. Aaron Prosper BOARD MEMBER (he/him) Board Member since 2024. Aaron is graduate of Dalhousie's Bachelor of Science (Neuroscience) program, Aaron currently works as the Indigenous Health Consultant for Nova Scotia Health. Aaron is also a member of the multimedia band Alan Sylliboy and the Thundermakers, and the Eastern Eagle Singers. PETER STEELE BOARD MEMBER (he/him) Board Member since 2020. Peter is a visual artist based in the CBRM. The final verse of Silent Night during our first ever Christmas Eve Sing-Along Service on December 24th, 2017. It has since become our favourite holiday tradition at the HAT and one of our favourite community events. Video by Tom Colford Location 40 Bentinck Street, Sydney, NS B1P 1G2 Box office Hours Tuesday — Friday 12:00pm — 6:00pm Contact boxoffice@highlandartstheatre.com info@highlandartstheatre.com (902) 565-3637"
    },
    {
      "url": "https://www.wedding-spot.com/venue/3572/highland-manor/",
      "text": "Highland Manor | Venue - Apopka, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Highland Manor Report Highland Manor 407-650-9558 CALL VENUE FAVORITE Venue highlights Award winner Indoor and outdoor spaces Rentals included Venue details Style: Historic/Landmark Building, Mansion, Private Estate Guest capacity: Accommodates up to 350 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 604 East Main Street Apopka, FL 32703 Awards: Description: The Highland Manor https://eventsbydubsdread.com/the-highland-manor-home/ Instagram: https://www.instagram.com/thehighlandmanor/ Facebook: https://www.facebook.com/TheHighlandManor Pinterest: https://www.pinterest.com/DubsCatering/ Elegance and vintage charm create the perfect backdrop for your special event at The Highland Manor. The beautiful panoramic vistas of rolling hills, ancient oak trees, and wide verandahs frame the gracious interiors of the Manor. Polished wood, crystal flourishes, and sweeping spaces of this grand 110-year-old historic building create a stunning setting for weddings, parties, and social and corporate events. Venue Highlights: •\tAuthentic historic home with an expansive wrap-around porch and vintage details. •\tExclusively managed by Events by Dubsdread with its award-winning food and service. •\tFour distinct spaces within the venue: The Crystal Ballroom, Oak Room, Glass Verandah, and Oak Bar. •\tAble to accommodate parties of 20-350 guests. •\tBridal suite and dressing rooms. •\tGroom's lounge with pool table. •\tVenue rental includes tables, chairs, china, glassware, silverware, and standard house linens. •\tIndoor and outdoor ceremony options available. •\tStunning outdoor 110-year-old oak tree ceremony space. •\tCeremony plus reception timeframe is five hours. •\tReception-only timeframe is four hours, with the option for additional time, subject to availability. •\tBrunch, afternoon, and evening timeframes are available. •\tVenue rental discounts are available based on time of year, day of the week, and other factors. •\tLocated just outside Orlando in historic Apopka, FL. •\tParking included. •\tHilton Garden Inn located directly next door. Cuisine and Service Whether you prefer plated service, heavy hors d’oeuvres, or a buffet-style meal, your cuisine options are limitless. We can customize your menu to create something perfect for your wedding theme, group size, budget, cultural or dietary needs, and personal preferences. Event Specialists When you plan your wedding or event with us, our event specialists offer their knowledge, experience, and guidance throughout the pre-event planning process and become dedicated members of your day-of-event team at no additional charge. READ MORE Additional details Service Options Venue notes The rental fee on average ranges from $1,500 to $4,000 for a ceremony and reception and includes 5 hours of event time excluding set up and clean up time. Extra Additional hours can be arranged for an additional fee. Amenities and Restrictions Amenities - Wedding planning services - Bride's dressing area - Groom's dressing area - Dance floor - Podium and/or stage - Tables and chairs provided - Upgraded chairs - Linens, silverware, glassware provided - Piano - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - All food and beverage handled by venue - Food & beverage minimum - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Catering provided by venue - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Amenities - Wedding planning services - Bride's dressing area - Groom's dressing area - Dance floor - Podium and/or stage - Tables and chairs provided - Upgraded chairs - Linens, silverware, glassware provided - Piano - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - All food and beverage handled by venue - Food & beverage minimum - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Catering provided by venue - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 2:00AM Highland Manor 407-650-9558 CALL VENUE FAVORITE Venue Highlights Award winner Indoor and outdoor spaces Rentals included STARTING AT $5,198 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 100 Max Outdoor capacity: 350 Reception Indoor only Max Indoor capacity: 350 STARTING AT $5,198 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://eventsbydubsdread.com/we-moved-that-page/",
      "text": "We moved that page - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog We moved that page We have fine tuned our website to answer your questions and serve you better. If you can not find what you're looking for, please reach out to us. Contact Us The Highland Manor Exclusively Managed Venue Azalea Lodge at Mead Botanical Garden Exclusively Managed Venue Historic Dubsdread Exclusively Managed Venue Catering Menus Exclusive Venues Partner Venues Brochures Galleries Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment Inquire Today Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.manor-hill.com/who-we-are/",
      "text": "Who We Are - Manor Hill Productions Who We Are What We Do Our Work Contact Us Client Portal MENU Who We Are What We Do Our Work Contact Us Client Portal Who We Are Our Mission Our Mission is to deliver our client’s most important messaging opportunity, through world-class, experiential, live event solutions. Why Manor Hill Our leadership has deep roots in the live event, advertising and creative industries, with a combined total of well over 300 years of successfully producing magical moments in time. We staff our events much like a major motion picture or theatrical production. We source the most talented professionals in the industry for each event. Our roster of seasoned professionals reads like a “Who’s Who” in the live event world. Our event technology is sourced with your specific requirements in mind, not just what may be in the warehouse – this helps to ensure quality, the right application and fiscal responsibility. What makes us different from every other event service provider? Manor Hill is an event production agency, be the event live, virtual or hybrid. As an agency, we provide a singular and seamless resource to produce that event. We are not an equipment company, but rather a people and solutions company. Our Leadership Team Rachael Mull Chief Executive Officer Rachael Mull An accountant at heart, Rachael leverages her extensive experience in business management, consulting, and public accounting across healthcare, marketing, and hospitality sectors to effectively lead the talented team at Manor Hill Productions with thoughtful organization. Mary Marriner Founder Mary Marriner Mary co-founded Marriner Marketing Communications and Victoria Restaurant Group, where she not only designed its three restaurants, but served as CFO. As sole Trustee of the Marriner Family Trust, Mary controls all Manor Hill Farm operations. Randy Marriner Chairman & Founder Randy Marriner Randy is a serial entrepreneur and the former Chairman & Founder of Marriner Marketing with a client list that included Citibank, Coca-Cola, Glaxo Pharmaceuticals, Marriott International, and more. Proactive and results-oriented, he has proven experience in business management across a wide range of industries. Corey Mull Chief Administrative Officer Corey Mull Corey brings more than 20 years of experience in marketing, consulting, and project management to the entire Manor Hill enterprise, overseeing sales and brewing operations at the Farm Brewery and leading the marketing, branding, and information technology for Manor Hill Productions. Krista Lapato Chief Financial Officer Krista Lapato Krista’s detail-oriented, organized mentality serves her well in managing the financials at Manor Hill Productions. Being exposed to the challenges of supervising people and projects across the globe enables Krista to adapt to changing priorities that match her client’s needs. David Hubbard Chief Strategy Officer David Hubbard As Chief Strategy Officer, David is responsible for developing and aligning strategies to enhance customer relationships and attendee experiences. With over three decades of experience as a Live Event Specialist, David excels in leading creative development teams. Dave Walters Chief Operating Officer Dave Walters Dave’s extensive experience, leadership, industry connections, and unwavering customer focus make him an exceptional client advocate. After a 30 year career, Dave found a perfect fit at Manor Hill, where the company’s commitment to prioritizing clients aligns seamlessly with his passion for developing strong customer relationships. Sid Curtis Chief Creative Officer Sid Curtis A lifelong creative professional, Sid is a versatile creative force capable of seamlessly blending existing visuals with new materials or developing live event concepts from scratch. Her extensive experience in theater, rock ‘n’ roll, television, and live events has given her a unique perspective and a tenacious work ethic. Kevin Jost Senior Vice President, Customer Experience Kevin Jost A second-generation entrepreneur, Kevin has spent his entire working career as a meetings and events professional most recently as President & Owner of JSAV, a global event production company. Kevin’s strong business ethic is coupled with his passion to provide exceptional customer service. Roger Lee Senior Vice President, Customer Experience Roger Lee Roger brings over 30 years of expertise in cultivating long-standing customer relationships. He has collaborated with prestigious clients across every sector, transforming complex requirements into successful solutions. His ability to efficiently address concerns and provide timely solutions instills trust and confidence, ensuring clients feel confident throughout the process. Dave Sweet Senior Vice President, Customer Experience Dave Sweet Dave, a seasoned live event professional with 35 years of experience, thrives on collaboration and excels in partnering with planners, designers, and technology experts to create exceptional events. His expertise lies in harnessing collective creativity to deliver outstanding experiences for clients and attendees alike. Doug Virden Senior Vice President, Customer Experience Doug Virden Doug is a seasoned professional with over two decades of experience in the audio-visual and event hospitality industry. Known for his passion for delivering exceptional customer experiences, Doug is highly customer-centric, consistently going above and beyond to anticipate and meet client needs. Bill Haynie Senior Vice President, Customer Experience Bill Haynie Bill brings three decades of live event experience and a reputation for thoughtful, relationship-driven leadership. Known for his ability to anticipate needs and simplify the complex, he partners closely with clients to create seamless, high-impact productions that feel as good as they look. Dale DeWitt Senior Vice President, Event Technology Dale DeWitt A senior-level technologist in the live events industry, Dale has a proven track record of aligning business solutions with advanced technologies, consistently delivering significant returns on investment. He excels at effectively communicating direction and motivating teams to tackle challenges in innovative ways. Drew Connor Senior Production Manager Drew Connor Drew began working in corporate production at the age of 18, succeeding as a technician in all areas of production, before transitioning into a Production Manager. After spending 15 years with a Houston-based production management company, Drew is thrilled to be part of the Manor Hill family. Courtney Ziegler Senior Production Manager Courtney Ziegler Courtney has been managing live events for 10 years, starting as a Stage Manager and Production Manager for theatrical shows before transitioning into live event production. Courtney has successfully translated her expertise in managing the logistics and creative aspects of theatrical productions into the live events arena. Tim Womack Senior Production Manager Tim Womack Tim is a dedicated live event professional with a wealth of technical knowledge and a focus on building strong teams to create outstanding events. His background as a touring musician, recording engineer, and audiovisual expert equips him with the skills to troubleshoot issues and elevate every show. Gordon Ulsh Senior Production Manager & Technical Designer Gordon Ulsh Gordon has mastered his craft by working in all areas of production, from Rigging and Lighting to Live Streaming and Event Design. With almost 20 years of customer service experience Gordon takes pride in building and maintaining strong client relationships and providing a safe and comfortable working environment for both clients and his production teams. Mike Buscher Director of Photography Mike Buscher Mike began his career as a photojournalist in the late 1990s. After shooting for outlets such as the New York Daily News, Baltimore Sun, and USA Today, he started a business that specializes in corporate event photography. Mike’s talent for composition, lighting, detail, and communication shine in his work at Manor Hill. Our Story In 1989, Randy & Mary Marriner founded Marriner Marketing Communications, which provided world class creative services to a client list that included ARAMARK, Citibank, Coca-Cola, Glaxo Pharmaceuticals, Kellogg’s, and Marriott International. They sold the business to pursue new opportunities with their daughters, Rachael and Tori. That included founding Victoria Restaurant Group (and Victoria Gastro Pub) in 2007. Manor Hill Brewing was founded shortly after, with production brewing beginning in June of 2015. In September 2015, Manor Hill Productions was created with a primary focus on the décor but soon after expanded to add a Technical Services group, offering audio-visual, lighting, staging, etc. to bolster its live events portfolio. As demand surged, Manor Hill responded by creating an agency approach to providing  comprehensive event solutions, establishing outposts in Dallas and Las Vegas, and bolstering its leadership team with industry stalwarts. Today, the Manor Hill brand stands as a beacon of success, proudly woman-owned and operated. Manor Hill Farm hosts Maryland’s largest farm brewery; serves as the corporate hub for the restaurant group; and houses Manor Hill Productions’ headquarters. Manor Hill Productions Washington, DC    |     Dallas, TX Las Vegas, NV 888-MANORHILL (888-626-6744) Contact Us © Copyright 2025 Manor Hill Productions, All Rights Reserved."
    },
    {
      "url": "https://eventsbydubsdread.com/",
      "text": "Wedding Venues & Events Catering - Events by Dubsdread Skip to content Download our Pricing Guide for our wedding venues & catering services Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Weddings Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Events Azalea Lodge at Mead Botanical Garden Home The Highland Manor Home Historic Dubsdread Home Catering Contact Us More Pricing Guide About Application for Employment Gallery Blog Explore Orlando's Best Venues & Catering Services The Highland Manor Exclusively Managed Venue Azalea Lodge at Mead Botanical Garden Exclusively Managed Venue Historic Dubsdread Exclusively Managed Venue Upcoming Events There’s always something fun happening at Events by Dubsdread venues, and this season is no different. Learn more about our upcoming public events. Learn More Event and Catering Services Welcome to Central Florida’s premier events and catering company, where we bring your vision to life. Our team specializes in weddings, corporate events, and special celebrations, crafting tailored experiences with exquisite cuisine and exceptional Orlando venues. We offer premium catering services at our exclusive Orlando locations and top venues across Central Florida, including the Winter Park Event Center, Orlando Science Center, and Harry P. Leu Gardens, as a preferred partner. Additionally, we are at your service for in-home or business catering. Inquire Today Catering Highlights of Events by Dubsdread: Whether you’re planning an executive meeting for 20, a party for 100, or an Orlando wedding for 350 people, we promise to deliver Culinary Excellence served with Southern Charm that compliments the venue, the event, and you! All-Inclusive or A La Carte Menus Plated, Heavy Hors D’oeuvres, or Buffet Options Mix and Mingle Appetizers, Cocktail Hours, or Full Meals Breakfast, Brunch, Lunch, and Dinner Options Large or Small Events – No Caps or Limits on Guest Counts Learn More Get Inspired Follow us on Instagram Get Started Submit an Inquiry Catering Menus Exclusive Venues Partner Venues Brochures Galleries Exclusive Venues Azalea Lodge Historic Dubsdread The Highland Manor Events Weddings Parties & Events Catering Contact Us Application for Employment PRICING GUIDE INQUIRE TODAY Instagram Facebook 549 West Par Street, Orlando, FL 32804 | 407-650-9558 | info@eventsbydubsdread.com © Dubsdread Catering, 2025. All Rights Reserved | Site Map | Privacy Statement Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    }
  ]
}