{
  "fuentes": [
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g34141-d13413259-r571735443-Evy_s_Terrace_Bar_Bistro-Clearwater_Florida.html",
      "email": "stephen.nunley@hilton.com"
    },
    {
      "url": "https://www.watergen.com/about-us/executive-team-board/",
      "email": "group-3467@3x.png"
    },
    {
      "url": "https://evysclearwater.com/contact-us/",
      "email": "info@cabanasgrill.com"
    },
    {
      "url": "https://ilovetheburg.com/crabby-bills-new-restaurant-palm-harbor/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "office@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "board@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "office@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "president@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "secretary@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "treasurer@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "vicepresident@clearwater.org"
    },
    {
      "url": "https://evysclearwater.com/",
      "email": "info@cabanasgrill.com"
    }
  ],
  "mails": [
    "board@clearwater.org",
    "group-3467@3x.png",
    "info@cabanasgrill.com",
    "info@ilovetheburg.com",
    "office@clearwater.org",
    "president@clearwater.org",
    "secretary@clearwater.org",
    "stephen.nunley@hilton.com",
    "treasurer@clearwater.org",
    "vicepresident@clearwater.org"
  ],
  "nombre_sitio": "evysclearwater.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tripadvisor.co.nz/ShowUserReviews-g34141-d13413259-r571735443-Evy_s_Terrace_Bar_Bistro-Clearwater_Florida.html",
      "text": "A little disappointing. - Review of Evy's Terrace Bar & Bistro, Clearwater, FL - Tripadvisor We noticed that you're using an unsupported browser. The Tripadvisor website may not display properly.We support the following browsers: Windows: Internet Explorer , Mozilla Firefox , Google Chrome . Mac: Safari . Clearwater Clearwater Tourism Clearwater Accommodation Clearwater Bed and Breakfast Clearwater Holiday Rentals Clearwater Flights Evy's Terrace Bar & Bistro Clearwater Attractions Clearwater Travel Forum Clearwater Photos Clearwater Map All Clearwater Hotels Clearwater Hotel Deals Last Minute Hotels in Clearwater Skip to main content Discover Trips Review More NZD Sign in Inbox See all Sign in to get trip updates and message other travellers. Clearwater Hotels Things to Do Restaurants Flights Holiday Homes Travel Stories Cruises Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre A little disappointing. - Evy's Terrace Bar & Bistro United States Florida (FL) Clearwater Clearwater Restaurants Evy's Terrace Bar & Bistro Search “A little disappointing.” Review of Evy's Terrace Bar & Bistro 56 photos Evy's Terrace Bar & Bistro 635 S Gulfview Blvd , Clearwater, FL 33767-2643 (Clearwater Beach) +1 727-281-4829 Website Improve this listing Ranked #69 of 754 Restaurants in Clearwater 62 Reviews Price range: $15 - $30 More restaurant details Restaurant details Neighbourhood: Clearwater Beach Description: Join us at Evy’s Terrace Bar & Bistro, the go-to rooftop bar for hand-crafted cocktails, delicious shareable plates, and breathtaking sunset views. Located on the 6th-floor open-air terrace of the Hampton Inn & Suites Clearwater Beach, Evy’s is the perfect spot for casual gatherings and romantic date nights. Soak in the spectacular views of Clearwater Beach’s award-winning sugar-white sand and inviting gulf waters. nancy b crosswicks 13 7 Reviewed 8 April 2018 A little disappointing. There was only entertainment on the weekend, which we missed because we arrived on a Sunday and left on a Friday. Plus, the menu is not very kid friendly. Date of visit: April 2018 Ask nancy b about Evy's Terrace Bar & Bistro Thank nancy b This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Stephen N, Assistant General Manager at Evy's Terrace Bar & Bistro, responded to this review Responded 23 April 2018 Thank you visiting Evy's Terrace Bar & Bistro! We are sad to see you did not get to enjoy the live music which we have every Friday and Saturday night. We try to promote a different atmosphere each day, to try and open things up for all guests of different flavors and tastes! Also, we like to try out different things on our menu to see what our guests enjoy, and are just doing some fine tuning! You are always open to ask one of our knowledgeable servers what we can offer for kids, and we will be happy to assist. We invite you back to see the new menu and hope we can take care of you again soon. Have a wonderful day! Stephen Nunley Assistant General Manager Hampton Inn and Suites - Clearwater Beach Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Updating list... Reviews (62) Traveller rating Excellent 48 Very good 10 Average 2 Poor 2 Terrible 0 Traveller type Families Couples Solo Business Friends Time of year Mar-May Jun-Aug Sep-Nov Dec-Feb Language All languages English (62) Language English (62) Show reviews that mention All reviews great food gina bartender sunset atmosphere appetizers servers Review tags are currently only available for English language reviews. Read reviews in English Go back 57 - 61 of 62 reviews Debdeb Hartford 31 18 Reviewed 2 April 2018 Great hotel bar On sixth floor but open air, above the beach and great views of the bay. Can see all the boats heading out to the open water, bridge traffic, etc. Great service. We got a couple of free drinks when the bartenders were trying out new concoctions. Date of visit: March 2018 Ask Debdeb about Evy's Terrace Bar & Bistro Thank Debdeb This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Stephen N, Assistant General Manager at Evy's Terrace Bar & Bistro, responded to this review Responded 23 April 2018 Thank you for visiting Evy's Terrace Bar & Bistro! We are so happy to see you had a great stay and enjoyed our location! The views really are truly something special! We look forward to taking care of you again VERY soon. Have a wonderful day! Stephen Nunley Assistant General Manager Hampton Inn & Suites - Clearwater Beach Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Vikki B Binghamton, New York 20 5 Reviewed 1 April 2018 via mobile The perfect location We stayed at the Hampton inn and suites and found this an absolute GEM! The atmosphere and the staff were warm and inviting. Stan was fabulous and Gina was awesome! I looked forward each day to hangout, have an adult beverage and listen to live music at sunset Date of visit: April 2018 Ask Vikki B about Evy's Terrace Bar & Bistro Thank Vikki B This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Stephen N, Assistant General Manager at Evy's Terrace Bar & Bistro, responded to this review Responded 23 April 2018 Thank you so much for the great review! We are ecstatic to see you enjoyed dining with us! We appreciate the little hidden \"GEM\" statement, isn't it the truth! We look forward to having you back out at Evy's so don't be a stranger! Have a wonderful day! Stephen Nunley Assistant General Manager Hampton Inn and Suites - Clearwater Beach Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Daydream404526 1 Reviewed 4 March 2018 via mobile Best sunset view in Clearwater Beautiful sunset views and great live music. Good food. Better drinks. Excellent margarita pizza. Busy and great vibe. Date of visit: March 2018 > Ask Daydream404526 about Evy's Terrace Bar & Bistro Thank Daydream404526 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Stephen N, Assistant General Manager at Evy's Terrace Bar & Bistro, responded to this review Responded 23 April 2018 Thank you for the excellent review! We are so happy to see you enjoyed Clearwaters best hidden gem! The panoramic views of the sunset are truly special. We look forward to taking care of you again for another great evening! Stephen Nunley Assistant General Manager Hampton Inn and Suites - Clearwater Beach Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC RP2358 Nuangola, Pennsylvania 94 27 Reviewed 15 February 2018 Good for Hotel Restaurant We stayed at the hampton inn where this restaurant was. The drinks were a good price and the food was good. Would eat here again. Date of visit: February 2018 Ask RP2358 about Evy's Terrace Bar & Bistro Thank RP2358 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Stephen N, Assistant General Manager at Evy's Terrace Bar & Bistro, responded to this review Responded 23 April 2018 Thank you so much for visiting Evy's Terrace Bar & Bistro! We are happy to see you enjoyed the food and drinks! We look forward to having you again for another great meal! We hope you have a wonderful day! Stephen Nunley Assistant General Manager Hampton Inn & Suites Clearwater Beach Report response as inappropriate Thank you. We appreciate your input. This response is the subjective opinion of the management representative and not of Tripadvisor LLC Previous Next 1 … 12 13 14 Updating list... Travellers who viewed Evy's Terrace Bar & Bistro also viewed Eatin' Fresh 23 Reviews Clearwater, FL Tampa Style Cubans 42 Reviews Largo, FL Jimmy's On The Edge 165 Reviews Clearwater, FL Cesare's 946 Reviews Clearwater, FL All restaurants in Clearwater (754) Been to Evy's Terrace Bar & Bistro? Share your experiences! Write a Review Add Photos & Videos Owners: What's your side of the story? Own or manage this property? Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Listing Viewed restaurants Evy's Terrace Bar & Bistro 62 Reviews Browse nearby Restaurants (754) | Hotels (96) | Things to Do (596) Also show Hotels Restaurants Things to Do Also show Map Satellite Map updates are paused. Zoom in to see updated info. Reset zoom Updating Map... Return to Map Revenue impacts the experiences featured on this page, learn more . © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in New Zealand . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more $ NZD New Zealand"
    },
    {
      "url": "https://www.watergen.com/about-us/executive-team-board/",
      "text": "Executive Team & Board | Watergen Skip to main content area Skip to content New! Register NOW for GENNY Pre-Order > Pre-Order Home & Office GENNY High quality drinking water Know Your GENNY Better Commercial GEN-M PRO GEN-M1 GEN-L Case Studies Mobility Watergen Mobile Box Watergen ON Board – Coming Soon Technology About Us Our Vision Executive Team & Board Awards GET IN TOUCH Home › About Us › Executive Team & Board Executive Team & Board Dr. Michael Mirilashvili President It is the birthright of every person in this world to enjoy the most basic human necessity of clean and pure drinking water, regardless of geographical location, skin color, or religious belief. Mr. Mirilashvili, who serves as the president of Watergen, is a philanthropist who supports donatings to many worthy causes, improving and saving the lives of many around the world. Mr. Mirilashvili is the visionary behind Watergen’s mission to provide clean and safe drinking water to every corner of the globe. He is actively involved in the development of Watergen towards spreading its revolutionary technology all over the world. For more than 30 years, Mr. Mirilashvili has been leading and directing numerous business ventures all over the world in various fields ranging from real estate, healthcare, information technology, management, entrepreneurship, to media, agro-tech, innovation social entrepreneurship, sports, hi-tech, infrastructure and green technologies. Mr. Mirilashvili devotes his time and resources to a broad spectrum of philanthropic activities, and has been chairing several renowned organizations around the world, including chairing the positions of the President of the Euro-Asian Jewish Congress and of the Vice President of the World Jewish Congress. In October 2017, he awarded former President George Bush the Isaiah Award on behalf of Keren Hayesod-United Israel Appeal for his economic, diplomatic and security cooperation with Israel while president. Dr. Mirilashvili himself received the same award in 2015. In years past, other recipients of the Isaiah Award also included former U.S. President Bill Clinton, late Israeli Prime Minister Yitzchak Rabin, and actress and producer Sharon Stone. Dr. Michael Mirilashvili President Steve Elbaz Chief Executive Officer Over 12 years of experience in International Business Development, Innovation Units, Venture Capital and Technology Integration in Corporate and Startups (Sectors: Automotive, Energy & Bio-Technology; Companies: Schneider Electric, Alstom, Solvay, Aster Capital and SKODA AUTO part of the VW Group) Vast experience in executive general and operational management, including strategic partnerships set-up and running Investments portfolios through Corporate VCs. Holds Executive MBA from Northwestern University – Kellogg School of Management Steve Elbaz Chief Executive Officer Sharon Dulberg Chief Technology Officer and VP Innovation Leads the scientific researches, the inventions and the initiations of new technologies in the company’s industrial fields, for more than a decade. Mr. Dulberg has a vast experience in several R&D industrial companies both in practical and scientific fields. M.Sc. in Electrical Systems Engineering and B.Sc. in Mechanical Engineering. Sharon Dulberg Chief Technology Officer and VP Innovation Yarden Gonen Chief Financial Officer Yarden Gonen joined Watergen in 2022 as Chief Financial Officer responsible for accounting and controllership, financial planning and analysis, tax, internal audit, investor relations, corporate development, and treasury. Prior to Watergen, Mr. Gonen held finance leadership positions at Elbit Systems, where he served as VP Finance & Control, responsible for covering all strategic and operational financial management. Mr. Gonen brings over 20 years of experience in corporate finance for global public organizations, including shareholder value creation, corporate governance, business partnering, mergers and acquisitions, treasury and funding, investor relations, taxation, and management consulting. Mr. Gonen is a Certified Public Accountant and holds a bachelor’s degree in accounting and economics from the Hebrew University of Jerusalem. Yarden Gonen Chief Financial Officer Roni Litinetsky VP Sales Roni Litinetsky leads Watergen’s sales around the world, bringing Watergen’s drinking water from the air to people everywhere. As the VP Sales, Mr. Litinetsky manages Watergen’s Sales team and a global distribution network with clients in diverse sectors such as business, government, defense, infrastructure, beverage, etc. Mr. Litinetsky represents Watergen in complex negotiations and has brought Watergen into new markets such as Golf, Asia, LATAM and more. Prior to his current role, Mr. Litinetsky served as Chief of Staff to Watergen’s controlling stakeholder & President, and as Chief of Staff to the previous VP of Sales and Marketing with his deep knowledge of Watergen’s technology and products and rich experience in the company. Before joining Watergen, Mr. Litinetsky served in various executive leadership roles in an Israeli leading lobbying firm, representing prominent Israeli and global firms in fields of hi-tech, finance, medical and media. Mr. Litinetsky holds a B.A. in Communications, specializing in Political Marketing, from IDC, Herzliya. Roni Litinetsky VP Sales Chen Nechemia VP R&D Chen Nechemia leads the technological research and development of consumer, commercial and automotive products at Watergen. Mr. Nechemia has led the Research and Development department for over a decade, and has been responsible for most of Watergen’s product launches in recent years. Mr, Nechemia oversees the company’s team of talented engineers and developers who create the high-quality breakthrough products, using Watergen’s patented and award-winning technology. Before joining Watergen, Mr. Nechemia held various key positions in companies from the water production technology industry. He was also employed in the R&D field in the industrial, automotive, and medical industries. Chen Nechemia VP R&D Board Members Interested to learn more? Contact Us Bring Watergen’s solutions to your business or community. Connect with our team today. Book a Call Contact Us Terms of Use Privacy Policy Sitemap Technical support Standard Warranty Locations: Americas Global © Watergen . All Rights Reserved. Website by Volle' | design by clutch Close Close Accessibility by WAH Pre-Order Home & Office GENNY High quality drinking water Know Your GENNY Better Commercial GEN-M PRO GEN-M1 GEN-L Case Studies Mobility Watergen Mobile Box Watergen ON Board – Coming Soon Technology About Us Our Vision Executive Team & Board Awards GET IN TOUCH"
    },
    {
      "url": "https://evysclearwater.com/contact-us/",
      "text": "Contact Evy’s Terrace Bar & Bistro | Clearwater Beach, FL Skip to content (727)-333-7944 Local Ingredients – Support local! We source fresh local ingredients to make your food healthier and tastier! Home Menu Drinks Events About Us Jobs Rewards Contact Us Menu Home Menu Drinks Events About Us Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Click Here Contact Info Phone : (727)-281-4829 Address : 635 South Gulfview Boulevard | 6th Floor of the Hampton Inn & Suites Clearwater Beach, FL 33767 Email: info@cabanasgrill.com Location Hours : Daily 5:00 PM - 10:00 PM Social Media Contact Us Now Or Stop By Today For guest comments or suggestions please feel free to send us an inquiry or tell us how to how to contact you by completing the form below. Name * Email * Phone Number Message Submit Order Specials Reservations Parties Catering [contact-form-7 id=\"a4c05c2\" title=\"Contact form 1\"] Join us at Evy’s Terrace Bar & Bistro, the go-to rooftop bar for hand-crafted cocktails, delicious shareable plates, and breathtaking sunset views. Located on the 6th-floor open-air terrace of the Hampton Inn & Suites Clearwater Beach, Evy’s is the perfect spot for casual gatherings and romantic date nights. Soak in the spectacular views of Clearwater Beach’s award-winning sugar-white sand and inviting gulf waters. Hours Daily 5:00 PM - 10:00 PM Quick Links Menu Drinks Jobs Events About Us Rewards Gift Cards Contact Us Menu Menu Drinks Jobs Events About Us Rewards Gift Cards Contact Us Contact Us (727)-281-4829 635 South Gulfview Boulevard | 6th Floor of the Hampton Inn & Suites Clearwater Beach, FL 33767 info@cabanasgrill.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Evy’s Terrace Bar & Bistro | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://ilovetheburg.com/crabby-bills-new-restaurant-palm-harbor/",
      "text": "Crabby Bill's new Palm Harbor location debuts, marking another milestone for the brand We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search COMMUNITY PARTNER Beyond the Burg Crabby Bill’s new Palm Harbor location debuts, marking another milestone for the brand February 13, 2025 • By Aaron Styza Crabby Bill's new Palm Harbor location is located at 1114 Florida Ave, Palm Harbor. Photo via Crabby Bill's Facebook. February 13, 2025 • By Aaron Styza 14 SHARES Facebook Twitter Beloved seafood restaurant Crabby Bill’s debuted its new location in Palm Harbor (1114 Florida Ave). This marks the third Crabby Bill’s, joining The Original Crabby Bill’s in Indian Rocks (401 Gulf Blvd) and the St. Pete Beach location (5100 Gulf Blvd). Known for its no-frills seafood—especially its crab and grouper—and its casual, beachy atmosphere, Crabby Bill’s epitomizes Florida’s coastal charm. Originally opening as Captain Bill’s in the 1970s, the restaurant rebranded in the 1980s after the family established its business in a humble 800-square-foot building in Indian Rocks. ADVERTISEMENT The giant, iconic crab on the roof, brandishing its heavy claw, is easily recognizable and has become a beacon in the community. The Crabby Bill’s family keeps growing, and the Palm Harbor location marks another significant milestone in the brand’s impressive expansion over the last 50+ years. Inside the new Palm Harbor location. Photo via Crabby Bill’s Facebook. Crabby Bill’s includes a large set of family brands Over the years, Crabby Bill’s has grown into a family of brands. Since its inception in that modest space, the brand has expanded to include Crabby Gifts, Jake’s Coastal Cantina, Seabreeze Island Grill, Pipo N Betty’s Bakery, Crabby Bill’s St. Pete Beach, JD’s Lounge & Restaurant, Cabanas Coastal Grill, Evy’s Terrace Bar & Bistro, and Bon Appetit Restaurant. Follow Crabby Bill’s on Instagram . Subscribe Now Don’t miss out on All Things Good in the Burg 👉 Email Stay in the know 👇 GET UPDATES 👇 Stay connected to All Things Good in the Burg by subscribing today. Email Stay in the know Aaron Styza Aaron Styza is an itinerant journalist, poet, fiction writer and resident of St. Pete. Recent Stories American Stage’s ‘Broadway by Candelight’ brings Broadway performers to The James Museum September 11, 2025 The Wee British Shop brings a taste of Britain and Ireland to St. Pete September 11, 2025 New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Related Stories Beautiful local farm hosts fun fall events: Sangria Fest, haunted maze and more September 11, 2025 Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 The Frog Pond reopens in North Redington Beach: “the heart of this place stays the same” September 8, 2025 All Recent Stories New BOOlevard of Play Family Zone announced for Halloween on Central September 11, 2025 Things to do with kids this weekend: St. Pete, Clearwater, and beyond September 11, 2025 Fun and free fitness classes in St. Pete: kayaking, biking, and trail runs September 10, 2025 Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 20 amazing events to attend during St. Pete’s City of Performing Arts Month September 9, 2025 Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 Things To Do In St Pete This Weekend: Best Festivals & Events Going On In St Petersburg September 9, 2025 Award-winning author of ‘Build It Boldly’ to host book talk, Q&A in Tampa this week September 8, 2025 Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "text": "Board of Directors - Hudson River Sloop Clearwater Skip to content BOOK A SAIL NOW! Subscribe to Our Newsletter JOIN or DONATE SHOP Clearwater Online Store Official Clearwater Etsy Store Clearwater Bonfire Shirts Search for: About Our Team Board of Directors Business Model Planning Job Opportunities Crew Jobs Volunteer Opportunities Latest News Clearwater Blog Generations Archive Publications & Financials Webinar Recordings Press Releases Local Sloop Clubs Press Resources Support Clearwater Join or Donate Donor Portal Planned Giving Private Charters Corporate Charters & Partnerships Sponsor a Community Sail The Sloop History & Specifications Restoring the Clearwater Virtual Sloop Tour Work/Volunteer Onboard Crew Jobs Kingston Home Port Come Sailing Public Sails Education Sails (Sailing Classroom) Private Charters Corporate Charters & Partnerships Community Sail Sponsorship Opportunities Dock Directions Volunteer Onboard Frequently Asked Questions Education The Sailing Classroom Youth Empowerment Onboard Volunteer Climate Change at Clearwater Tideline Programs In-School Programs Community Resources Fish Key Eating Hudson River Fish Digital Learning Library Activities for Students at Home Lil’ Clearwater Our River Connects Us Voices of the Valley: One Year Later Advocacy Hudson River PCB Contamination Indian Point Closure + Decommissioning Newburgh PFAS Drinking Water Contamination + Cleanup Invasive Species in the Hudson River Past Work Events Calendar Annual Folk Picnic City of Kingston Earth Fair Hike and Learn Program Spirit of the Hudson Gala Paddle For Our Hudson Search for: About Our Team Board of Directors Business Model Planning Job Opportunities Crew Jobs Volunteer Opportunities Latest News Clearwater Blog Generations Archive Publications & Financials Webinar Recordings Press Releases Local Sloop Clubs Press Resources Support Clearwater Join or Donate Donor Portal Planned Giving Private Charters Corporate Charters & Partnerships Sponsor a Community Sail The Sloop History & Specifications Restoring the Clearwater Virtual Sloop Tour Work/Volunteer Onboard Crew Jobs Kingston Home Port Come Sailing Public Sails Education Sails (Sailing Classroom) Private Charters Corporate Charters & Partnerships Community Sail Sponsorship Opportunities Dock Directions Volunteer Onboard Frequently Asked Questions Education The Sailing Classroom Youth Empowerment Onboard Volunteer Climate Change at Clearwater Tideline Programs In-School Programs Community Resources Fish Key Eating Hudson River Fish Digital Learning Library Activities for Students at Home Lil’ Clearwater Our River Connects Us Voices of the Valley: One Year Later Advocacy Hudson River PCB Contamination Indian Point Closure + Decommissioning Newburgh PFAS Drinking Water Contamination + Cleanup Invasive Species in the Hudson River Past Work Events Calendar Annual Folk Picnic City of Kingston Earth Fair Hike and Learn Program Spirit of the Hudson Gala Paddle For Our Hudson Search for: Board of Directors Board of Directors Jen Benson 2025-09-09T14:20:24-04:00 Board Meeting Schedule 2024-2025 Clearwater Board of Directors meetings are currently virtual on Zoom, and are held from 7:00 PM to 9:00 PM with the exception of the Annual Meeting unless otherwise indicated. All board meetings are open to Clearwater members. Clearwater’s Fiscal Year starts December 1 and ends November 30. Downloadable List of Board Meetings for 2024-2025 Thursday, November 14, 2024 Agenda for Nov. Meeting Wednesday, December 18, 2024 Tuesday, January 14, 2025 Agenda for January meeting Thursday, March 6, 2025 View Meeting Notes April 2025 – No meeting Spirit of the Hudson Gala at The Garrison, Sunday, April 6, 2025 Thursday, May 8, 2025 Tuesday, July 15, 2025 Tuesday, September 9, 2025 View agenda Zoom Link: https://us06web.zoom.us/j/87314075717?pwd=JIx1sQ5Kq13IlljMy0Wa99wLi565wG.1 Meeting ID: 873 1407 5717 Passcode: 258157 Sunday, October 5, 2025 – 10:00 AM-5:00 PM Annual Meeting & Board Retreat (in-person) Click to view the board meeting minutes archive Clearwater’s Board Manual (includes Charter, Bylaws, Policies, and Statement of Values) Clearwater board members play key creative roles in fundraising, event planning, program development, financial management, public relations, and project management, and serve as spokespersons and ambassadors for Clearwater. The Clearwater Annual Meeting provides members with the opportunity to participate in the vital function of electing board candidates into office. Clearwater members and the public may communicate with the Board at any time: board@clearwater.org . Communications will be acknowledged and responded to, when appropriate. Strategic Plan In spring 2020, an ad hoc advisory committee of staff, board, members, and en vironmental leaders set out to gather feedback regarding Clearwater’s role i n Hudson River environmentalism, clarify and update the organization’s vision for the 21st century and lay out a strategic plan to achieve that vision and promote our evolution into a more sustainable organization. With help from the Hudson River Foundation and the Support Center for Nonprofit Management, the planning effort identified strengths, weaknesses, opportunities, and threats to be considered in working toward that outcome. The committee solicited input via a community survey, a carefully curated roster of interviews, retreats, and an organizational assessment tool. Data gathered were both quantitative and qualitative, including information on member demographics, entry points, and ongoing participation. Findings confirmed the sloop as the organization’s core strength, education and advocacy as the most important and successful of our programs, and music as a unique and central means of promoting our mission and engaging our members and Hudson Valley communities. Based on the findings, the committee identified seven priorities necessary to bring Clearwater stability, maintain its relevancy, and fulfill its mission to the highest potential. Each priority includes goals aimed at fulfilling the priorities and specific action items needed to achieve them over three years. These priorities, goals, and actions constitute a strategic plan intended to establish a path to stability and sustainability for Clearwater over the next three years. The plan, approved by Clearwater’s board of directors in December 2021, calls for the organization to focus and then act, all the while operating in adherence to the goals and management practices we have set for ourselves. Otherwise, we risk maintaining the status quo of being spread too thin, and doing many things shoddily instead of a few things with excellence. If we can do this, Clearwater will not only survive but prosper in years to come. Read Clearwater’s strategic plan Clearwater Board Members Samantha Hicks, President Third term, expires October 2027 Email Samantha: president@clearwater.org Samantha, AKA Captain Sam, started working on the sloop as an apprentice in 1994 at the very beginning of what would become a 17-year career in sail education. She worked her way up through the ranks on numerous vessels, including the Schooner Ernestina out of New Bedford, sailing as chief mate for the maiden voyage of the brigantine Irving Johnson, and sailing to both Europe and Asia aboard the Pride of Baltimore II. After sailing as captain of the Sloop from 2000 to 2005, she signed on as chief mate for the Barque Picton Castle’s fourth World Voyage, circumnavigating the globe. Arthur Jones, Vice-President Third term, expires October 2027 Email Arthur: vicepresident@clearwater.org A lifelong resident of the Hudson Valley, Arthur Jones has been a Clearwater member and perennial sloop volunteer for 22 years. Arthur is a dedicated environmentalist, an avid sailor and an award-winning filmmaker who has made several short films in support of Clearwater, The NY Democracy Project and other local non-profits. Arthur is serving his second term as a board member but has been involved with Clearwater most of his life. He currently lives in Jersey City and works in New York as a full-time television professional, specializing in the management of large and complex projects. As a board member, Arthur offers a unique blend of digital media expertise, love of the Hudson River and a passionate commitment to Social and Environmental Justice. Tom Murphy, Treasurer First term, expires October 2025 Email Tom: treasurer@clearwater.org Tom Murphy is a Hudson Valley native – he grew up in Newburgh, attended Newburgh schools and Orange County Community College. He has been a banker since the early 1980s when he got his start at a small bank in Newburgh. He is currently a Senior Vice President at M&T Bank, running their Government Banking Division here in the Hudson Valley and Long Island. Tom serves on M&T Bank’s local Charitable Foundation Board, providing funding to over 100 non-profit organizations in Dutchess, Ulster, Sullivan, and Orange counties. He is currently on the Board of the Community Foundations of the Hudson Valley and Chair of their Ulster Board and previously served on the boards of the Bardavon Opera House, Mohonk Preserve, and many other community organizations. While on the Mohonk Preserve Board, Tom was Treasurer and a member of the Executive Committee for many years and also spent time on their Environmental Education and Finance and Development Committees. Tom lives in Kingston, NY with his wife Ellen, their two college-age boys, two dogs, two cats, and five chickens. He is an avid reader, skier, hiker and fisherman. Adenike Bamgboye First Term, expires October 2026 Email Adenike: secretary@clearwater.org A seasoned administrator and expert in public procurement, small business, and vendor management, as well as process reengineering. In her career of over 20 years, Adenike has served in various capacities for over a decade at the City of New York, including contracting, environmental health and safety, and quality assurance. She pioneered a number of initiatives for small business contracting opportunities, not limited to MWBE participation and outreach. Adenike is passionate about environmental conservation through policy-making. In one of her past projects, she unraveled the impact of single-use plastic carry-out bags on environmental footprints, as a contribution to a NYC legislation for its ban. Adenike developed health and safety programs for four bureaus at the NYC Department of Environmental Protection. She currently lives in Elmont and consults for the NYC DOE and serves as Assistant Deputy Comptroller for Nassau County. At-Large Board Members Joan Gaylord Third term, expires October 2026 Joan Gaylord currently serves on Clearwater’s Executive Committee and Chairs its Communications Committee. A correspondent for “The Christian Science Monitor,” she previously headed press relations at Pace Law School, the country’s leading environmental law program. A photographer and graphic designer, as well, Joan has had credits in “The Wall Street Journal” and the “CS Monitor” and served as calligrapher for the United Nations. She is an Associate Fellow at Yale University where she is the advisor to the Undergraduate Jazz Collective. Neil Gordon Third term, expires October 2025 Neil is starting his third three-year term on Clearwater’s board. He has also served for the last five years as Clearwater’s treasurer and Chair of the Finance Committee. Neil is a longtime onboard Clearwater volunteer and has great passion and regard for the Sloop and its crew. Neil is politically active in local government and has served on a number of not-for-profit boards, including the Andover (MA) Historical Society, where he also served as Treasurer. Neil was raised in the Bronx and Yonkers and currently lives in Brookline, MA. His mother, children, and grandchildren live in New York City. Steve Stanne Second term, expires October 2026 Steve Stanne has been teaching about the Hudson since 1980 when he stepped aboard Clearwater as education director, a position he held for 19 years. His time with the organization also included two stints as acting executive director. From 1999 until retirement in 2017 he was employed by Cornell University in partnership with NYSDEC to direct education efforts of the agency’s Hudson River Estuary Program. Over his career Steve designed signature river education programs including Clearwater’s Classroom of the Waves and the Estuary Program’s Day in the Life of the Hudson, as well as coordinating placement of the familiar blue and white sturgeon signs at highway crossings of Hudson River tributaries. He is the principal author of The Hudson: An Illustrated Guide to the Living River, published by the Rutgers University Press, and the Estuary Program’s State of the Hudson reports in 2009 and 2015. Steve is also a musician, performing with the Hudson River Sloop Singers while at Clearwater, and with the folk quintet Betty and the Baby Boomers, which earned the Hudson River Environmental Society’s 2016 “Outstanding Environmental Communicator” award. Directors Sarah Armour Second term, expires October 2027 Born and raised in the Hudson Valley, Sarah has been lucky enough to be part of the Clearwater community since before she was born. She grew up volunteering at the festival, singing with Clearwater’s Power of Song Program, and working on the Sloop in a number of capacities, including as a volunteer, educator, and first mate. Sarah has spent the last ten years working in environmental education, sail training, and experiential learning and she credits Clearwater with sending her along that path. Sarah works at Mystic Seaport Museum as the Captain of the classic Schooner Brilliant , running one of the oldest Youth Sail Training programs in the country. Sarah has a degree in Earth Systems Science from Cornell University where she focused on applied ecology, sustainable agriculture, and environmental education. Peter Capek Third term, expires October 2026 Peter has been concerned with environmental issues for most of his life but has taken a more active role since his retirement from IBM Research.  The increasing awareness and seriousness of the climate change issue has led him to increase his involvement with Clearwater with the goal of increasing public awareness and response to the crisis. He has been active as a volunteer at Revival for more than 35 years, where he has managed (jointly with his wife) the T-shirt sales, a substantial fund-raiser for the event,  and been active on the Revival Planning Committee.  Peter first met Pete Seeger at the 1964 Newport Folk Festival and has admired Pete’s music and life accomplishments for many years. Peter’s work experience involved research in Computer Science.  He has experience serving on a public library board for 14 years, including several as its President, and on a local tax assessment review board. Josh Clyburn First Term, expires October 2026 As an accomplished utility professional, Josh brings extensive expertise in digital transformation, product development, and data analytics. He found his love of the sea and naval engineering during his eight-year enlistment in the U.S. Navy, while a part of the Nuclear Program. During his time at NYSERDA, he successfully designed, launched, and managed the $75M Real-Time Energy Management program. As Manager at the New York Power Authority, he orchestrated energy solution projects and strategic marketing initiatives in clean energy technologies. His educational portfolio includes an MBA in Finance, an MS in Information Systems, an MS in Environmental Management, and a BS in Nuclear Engineering. Josh served as a voluntary crew on the Clearwater Sloop and was quickly reminded of his love of the water, and passion for environmental education through community engagement. Josh lives in Brooklyn, NY, with his wonderful wife of 10 years and two fantastic kids. Dr. Stuart Findlay First Term, expires October 2027 Dr. Stuart Findlay has worked on the Hudson River for over 30 years, researching sensitive wetlands, shoreline restoration, and conducting environmental monitoring critical to helping guide the river’s recovery. He aims to identify impending problems and devise suitable solutions in streams, wetlands, and the Hudson River, and is committed to carrying science from discovery to dissemination and is actively engaged with a wide array of management, outreach, and educational programs. Peter Gregory First Term, expires October 2027 Peter is a financial advisor at RBC Wealth Management in Albany and Saratoga, NY, where he has worked since 2007. Peter leads a team of financial Advisors who provide comprehensive management services to families, business owners, professionals, and non-profit organizations. Peter is currently a board member and the Treasurer of the SUNY Schenectady Foundation and was previously a board member of The Estate Planning Council of Eastern NY, Make-A-Wish Foundation of the Capital Region, Better Neighborhoods, Inc., and the Sunnyview Hospital Foundation. He was also President of the Sunnyview Hospital Foundation board for four years. He is a native of Schenectady, and for the past 25 years has lived in Halfmoon, NY, with his wife Kimberly, and two children. Gareth Hougham, Ph.D (Chemistry) Second term, expires October 2026 Gareth is president of Hudson Valley Arts and Science, a 501(c)(3) nonprofit dedicated to improving the water quality, fish migration, recreation potential and public access to the Hudson River, the Long Island Sound, and their small, neglected tributaries. He is also an adjunct professor of environmental science at SUNY Purchase and a member of the Town of Ossining Planning Board. When not working, Gareth can be found canoeing and biking or as pictured here, helping with eel counts. Aaron Mair Third term, expires October 2026 Aaron Mair of Schenectady, New York, is an epidemiological-spatial analyst with the New York State Department of Health and is President of the Sierra Club’s Board of Directors. Aaron’s experience includes more than three decades of environmental activism and over 25 years as a Sierra Club volunteer leader, where he has worked diligently for environmental justice. Jennifer McMillan Second term, expires October 2027 Jennifer is a lifelong, passionate advocate for environmental issues, and has lived in Wappingers Falls for 20 years. She is an adjunct professor at Marist College and Dutchess Community College, works as a freelance editor, including for Clearwater, has volunteered in the Clearwater office, and, with her two children, volunteers at Revivals and other Clearwater events. She is an artist and herbalist, teaches herbalism, art classes, meditation, Reiki, and has led meditation classes and held Reiki sessions for Clearwater employees. As a current board member with East Fishkill Historical Society, she helps organize events and fundraisers and holds classes specifically directed towards public education and fundraising for the organization. Liam Purvis First term, expires October 2027 Liam is a lifelong resident and recreator in the Hudson Valley. He has fond memories of learning about river life aboard the Clearwater as a child and performed at the Clearwater festival multiple times with the Vanaver Caravan Dance Company. Liam has over a decade of professional experience teaching outdoor education and facilitating experiences that connect individuals with the environment immediately around them: including stints at The Riekes Center, Wild Earth, and Vermont Wilderness School. Liam is an avid whitewater kayaker who loves fishing in the Hudson. This passion for clean water has inspired him to volunteer with Riverkeeper’s water sampling program for the last 4 years. Jeremy Rainer Third term, expires October 2026 Jeremy Rainer is a sound engineer and producer at WFUV FM in New York. His family fostered in him a deep love and respect for Pete Seeger and the principles he stood for. He’s been going to the Revival all his life and has been a Festival volunteer for twenty years. When he was seventeen years old, Jeremy invited Pete to his high school to play a concert, and since that time, he saw Pete whenever and wherever he performed. In his work at WFUV, Jeremy produces “Woody’s Children” with Bob Sherman, and once was able to set up an interview with Pete for a birthday special. In addition to maintaining a relationship with Pete himself, Jeremy has fostered friendships with many of Pete’s own friends and fellow Clearwater artists, including David Amram, Tom Chapin, and Noel Paul Stookey. When Toshi Seeger passed away in 2013, Jeremy was honored to mix sound for her memorial concert in NYC. Performers not only included Pete, but also Judy Collins, Arlo Guthrie, Guy Davis, Fred Hellerman, and Peter Yarrow. After Pete himself passed in 2014, Jeremy co-produced “Seeger Fest,” a five-day festival in memory of Pete and Toshi. Jeremy was the technical manager for the festival, which encompassed making stage plots for numerous artists, formulating soundcheck and run-of-show schedules, and stage-managing the five concerts. Jeremy’s commitment and devotion both to Pete’s legacy and to Clearwater run deep and wide, and he has enjoyed bringing that passion to the Clearwater board of directors. Daniel Riesel Second term, expires October 2027 Daniel Riesel was raised in Croton on Hudson, but presently resides in Manhattan and Arlington, Vermont. His love of the outdoors and the Hudson Valley led him to be a Clearwater Board member for over a decade during the 70s and 80s–and also served on the boat crew. Daniel has been practicing law for 60 years, and since 1970, his practice has focused on environmental litigation. He is a founder of the first Environmental Protection Unit in the Department of Justice. During the period 1970 to 1973, the Unit successfully prosecuted over 30 Hudson River polluters. In 1973, he entered private practice and joined the country’s oldest environmental law firm, (now) Sive, Paget & Riesel, P.C. He has taught environmental law and litigation at Cardozo and Columbia Law Schools for over a decade, and chairs the American Law Institute annual courses on environmental law and environmental litigation. Daniel is a Fellow of the American College of Environmental Lawyers. Gabriella Spielberg First Term, Expires October 2026 Gabbie Spielberg is a native New Yorker, lifelong Clearwater kid, and recent graduate of Oberlin College, where she studied theater, politics, and film. She has experience as a board member of the Oberlin Student Cooperative Association, a fully student-led multimillion-dollar 501(c)3 dedicated to cooperatively providing housing and dining for students. Clearwater was always the highlight of her summer and an inspiration to her activism, which now informs her goals of breathing new life into the in-person aspects of the organization to create stronger networks of community organizing and open avenues to new forms of activism. She understands the needs of young activists who came of age in overlapping global crises and believes that the Clearwater organization has the tools to build intergenerational coalitions among advocates for environmental and social justice. Larry Rothbart Second term, expires October 2027 Lawrence (Larry) Rothbart has lived in Brooklyn for over 40 years but is a lifelong New Yorker. He is a lawyer-mediator-collaborative Professional focused on Family Law issues. His first memory of the Clearwater was soon after it first sailed into New York harbor going to the old, gritty South Street as a child. He had to go through a hole in the fence for the sail. Fast forward a bit. Larry became a member of Clearwater in his own right as a young adult when he returned to New York after college in Boston (where he worked on environmental issues including Seabrook). Once Larry had children, they came with him on Clearwater sails from the time they were babes in arms. They all were volunteers together on the boat for years. Eventually, they became “spare parts” especially when the boat was near New York Harbor or Pumpkin Sails. Larry’s hope is to keep the focus on the boat as a vehicle to encourage environmental education, environment action, cultural and historical education, sailing experiences, music, and a little fun; throughout the length of the Hudson. Sarah Underhill Second term, expires October 2025 Sarah Underhill’s love of the Hudson Valley began in the 1980s when she worked on the “Clearwater” as an environmental educator, activist, and sailor. A singer and song collector, her love of music and the arts combines with her dedication to community building. Sarah serves on the Town of Wawarsing’s Environmental Commission and on the boards of Mohonk Consultations, the SeedSong Farm Center, the Rondout Creek Watershed Alliance, Ulster County Environmental Management Council, and Slow Food Hudson Valley. She has worked as an RN since 1998 and is a member of the Ethics Committee for Health Alliance Hospitals. Her Quaker heritage, with its emphasis on justice and mercy, informs her work. Julia Wilson First term, expires October 2025 Julia became involved in Clearwater as a high school boat and office intern in 1991. During college at Cornell, where she majored in premed studies and environmental science, Julia continued to intern on the sloop, and after graduating, decided to spend a year or two sailing on Clearwater and other boats before grad school. By the time she started graduate study four years later, she had been the sloop’s engineer, deckhand, bosun, second mate, and educator. After earning a doctorate of chiropractic in Portland, OR, Julia returned to the Hudson Valley and Clearwater as mate and relief captain. That led to her becoming captain, a position she held until a week before the birth of her first child in 2008. Since then, Julia has done occasional relief work, but mostly has been working hard at raising two kids and running a thriving chiropractic office and business in Kingston and Hudson. She is looking forward to bringing her in-depth knowledge of the many facets of Clearwater together with her business knowledge to help bring Clearwater to the next level. Hudson River Sloop Clearwater 724 Wolcott Ave. - Beacon, NY 12508 (845) 265 8080 - Office@Clearwater.org Posts Feed || Privacy Policy Join Our Email List Email: Search for: Copyright © Hudson River Sloop Clearwater - All Rights Reserved Page load link Go to Top"
    },
    {
      "url": "https://evysclearwater.com/",
      "text": "Evy’s Terrace Bar & Bistro | Clearwater Beach, FL Skip to content (727)-333-7944 Local Ingredients – Support local! We source fresh local ingredients to make your food healthier and tastier! Home Menu Drinks Events About Us Jobs Rewards Contact Us Menu Home Menu Drinks Events About Us Jobs Rewards Contact Us Gift Cards Gift Cards Welcome To B ook A T able *Powered By OpenTable 1 Person 2 Person 3 Person 4 Person 28.6.2023 29.6.2023 30.6.2023 01.7.2023 11:30am 12:00pm 02:45pm 05:30pm RESERVE TABLE About Us Located on Clearwater Beach, Evy’s is the perfect spot for cocktails, small plates, and unforgettable sunsets. Join us at Evy’s Terrace Bar & Bistro, the go-to rooftop bar for hand-crafted cocktails, delicious shareable plates, artisan pizza, and breathtaking sunset views. Located on the 6th-floor open-air terrace of the Hampton Inn & Suites Clearwater Beach, Evy’s is the perfect spot for casual gatherings and romantic date nights. Soak in the spectacular views of Clearwater Beach’s award-winning sugar-white sand and inviting gulf waters. Learn More Hot Tonic Friday, September 12 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Chello Hollyday Saturday, September 13 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Chello Hollyday Sunday, September 14 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Kenny Later Friday, September 19 Enjoy the sunset, spirits, and bites with live music by Kenny Later on our terrace. 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Ed Rock Saturday, September 20 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Sticks and Stones Sunday, September 21 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Matt Knabe Duo Friday, September 26 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar Logan Grant Saturday, September 27 5:30 PM - 9:30 PM Add To Calendar iCalendar Google Calendar Outlook Outlook Online Yahoo! Calendar View All Events Previous Next Menu Highlights Appetizers Drinks Desserts View Test-menu Drinks Menu\t\t\n\t\t[displayOurMenu parent_slug=\"menu\"] Clausthaler NA Mimosa $8.00 Champagne, orange juice Red Sangria $10.00 Brandy, agave, cabernet, orange, lime, lemon, cinnamon History OVER THE YEARS 1976 The Beginnings Peter Kreuziger and Chef Karl Riedl opened Bon Appétit Restaurant on Dunedin’s waterfront in 1976. 1986 Break Through Top-notch service, and breathtaking views to Dunedin and Tampa Bay since opening on the coastline in 1976. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. Cocktails and Gulf Views Drinks Enjoy Live Music from Local Artists Events Experience the Best Sunset Views on Clearwater Beach Menu Book Your Next Party With us ! If you have any questions before making a party reservation give us a call at (727)-333-7944. Your event is not confirmed until you speak to someone for confirmation. Reviews Join us at Evy’s Terrace Bar & Bistro, the go-to rooftop bar for hand-crafted cocktails, delicious shareable plates, and breathtaking sunset views. Located on the 6th-floor open-air terrace of the Hampton Inn & Suites Clearwater Beach, Evy’s is the perfect spot for casual gatherings and romantic date nights. Soak in the spectacular views of Clearwater Beach’s award-winning sugar-white sand and inviting gulf waters. Hours Daily 5:00 PM - 10:00 PM Quick Links Menu Drinks Jobs Events About Us Rewards Gift Cards Contact Us Menu Menu Drinks Jobs Events About Us Rewards Gift Cards Contact Us Contact Us (727)-281-4829 635 South Gulfview Boulevard | 6th Floor of the Hampton Inn & Suites Clearwater Beach, FL 33767 info@cabanasgrill.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Evy’s Terrace Bar & Bistro | All rights reserved. | Terms, Privacy, and ADA Compliance"
    }
  ]
}