{
  "fuentes": [
    {
      "url": "https://www.allamericanspeakers.com/celebritytalentbios/Alan+Faena/405559",
      "email": "andrew@allamericanentertainment.com"
    },
    {
      "url": "https://maps.apple.com/place?auid=7596573784622585781&lsp=9902",
      "email": "button-foursquare-1@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?auid=7596573784622585781&lsp=9902",
      "email": "button-foursquare-1@3x.png"
    },
    {
      "url": "https://maps.apple.com/place?auid=7596573784622585781&lsp=9902",
      "email": "snippet-foursquare-logo-1@2x.png"
    },
    {
      "url": "https://maps.apple.com/place?auid=7596573784622585781&lsp=9902",
      "email": "snippet-foursquare-logo-1@3x.png"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.bizbash.com/venue-directory/ballrooms/venue/13461179/faena-forum",
      "email": "events-miamibeach@faena.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://members.faena.com/contact",
      "email": "faenarose@faena.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    }
  ],
  "mails": [
    "andrew@allamericanentertainment.com",
    "button-foursquare-1@2x.png",
    "button-foursquare-1@3x.png",
    "events-miamibeach@faena.com",
    "faenarose@faena.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "sales@finewineliquors.com",
    "snippet-foursquare-logo-1@2x.png",
    "snippet-foursquare-logo-1@3x.png"
  ],
  "nombre_sitio": "faena.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.allamericanspeakers.com/celebritytalentbios/Alan+Faena/405559",
      "text": "Alan Faena Biography | Booking Info for Speaking Engagements Top-Rated Speakers Bureau and Entertainment Booking Agency for Corporate Meetings and Business Events. Book an AAE Speaker Today . Top-Rated Speakers Bureau and Entertainment Booking Agency for Corporate Meetings and Business Events. Book an AAE Speaker Today . CONTACT US 888.985.3646 Your Location: Home Alan Faena Speaker Profile Alan Faena Biography The Leading Speakers Bureau for Booking Top Entertainment, Celebrities, and Speakers. Alan Faena Category : Art & Design , Business , Business Consulting , Business Growth , Communication , Entrepreneurship , Ethics & Integrity , Fashion , Fashion , Hospitality , Innovation , Real Estate Booking Fee Range : Live Event: Please Contact Virtual Event: Please Contact Booking Fee Range : Travels From : Please Contact See Similar Speakers See Similar Speakers More About Alan Faena Alan Faena Biography In 1985, Faena followed in his parents footsteps into the textile industry and founded the fashion label Via Vai at age 19. He launched the brand with 50 colored shirts he funded himself. The brand expanded to include ready-to-wear collections and a denim line. Faena sold the company in 1996 He was a fashion designer for over ten years before beginning a career in real estate development in 2000. He partnered with Len Blavatnik, Philippe Starck and Foster + Partners to redevelop abandoned docklands in the Puerto Madero neighborhood of Buenos Aires, Argentina. Foster + Partner's residential condominium in re-development was their first project in South America. The Faena Hotel designed by Starck opened in 2004. The Faena District, which is estimated to be a $200 million development, is the most valuable real estate in Buenos Aires. The Faena Arts Center, a converted flour mill located in the center of the district, opened in September 2011 and displays the work of local and international artists. In November 2011, German artist Franz Ackermann exhibited the results of his voyages around Buenos Aires with the largest mural of his career in the center. The Cuban duo Los Carpinteros debuted their first solo exhibition in Buenos Aires at the arts center in May 2012. He expanded his brand to Miami Beach with a $1 billion project to develop a six block waterfront property. Construction on the Miami Beach Faena District began in 2013. The project includes the restoration of the 1948 Saxony hotel, and an arts center, Faena Forum, by architect Rem Koolhaas and OMA and residences by Foster + Partners. Baz Luhrmann and Catherine Martin are also involved in the project as designers for the interior of the Faena Hotel Miami Beach. The district will be landscaped by Miami-based firm Raymond Jungles. The Faena House, a 18-story residential unit, is the project's first building scheduled for completion. All American Speakers Bureau is a full-service talent booking agency providing information on booking Alan Faena for speaking engagements, personal appearances and corporate events. Contact an All American Speakers Bureau booking agent for more information on Alan Faena speaking fees, availability, speech topics and cost to hire for your next live or virtual event. Tag Cloud alan faena corporate event hire schedule keynote speaking appearance fees special event contact speaker bureaus booking agency famous celebrity entertainment how to find favorite recommended Check Availability For Alan Faena Please select your approximate talent budget * $5,000 or less $5,000 - $10,000 $10,000 - $20,000 $20,000 - $30,000 $30,000 - $50,000 $50,000 - $100,000 $100,000 and above I have a budget, but I am unsure of what it is I am looking for Talent to donate their time Need Instant Answers? We are here to help!  Call us to speak with a booking agent to discuss your event or specific speaker request. Connect with an agent: 888.985.3646 Booking Agency Disclaimer: Alan Faena Booking Agency: Celebrity Appearance Fees and Availability Contact a booking agent to check availability on Alan Faena and other top corporate entertainment Exclusive Buyer's Agent that Books Celebrities, Entertainers and Speakers like Alan Faena for Speaking Engagements, Appearances and Corporate Events Please Note : All American Speakers Bureau is a full-service talent booking agency providing information on booking Alan Faena for speaking engagements, personal appearances and corporate events. Contact an All American Speakers Bureau booking agent for more information on Alan Faena speaking fees, availability, speech topics and cost to hire for your next live or virtual event. Related Tags: Information on keynote speaking engagements, personal appearances, corporate entertainment and appearance fees for Alan Faena , an inspirational motivational speaker. bio for Alan Faena agency, manager, speaker fees, speaking agency entertainment booking agency, speaker's fee, how to book, booking agencies for lectures, speaking event, celebrity appearances for hire, who is agent, manager, publicist, who represents, speakers bureau management who represents Alan Faena Popular Topics Business Speakers Celebrity Speakers Diversity Speakers Education Speakers Health & Wellness Leadership Speakers Motivational Speakers Political Speakers Sales & Marketing Sports Speakers Technology TED Speakers University Speakers Women Speakers Talent Finder Find a Speaker Keynote Speaker Lists Speakers by Fee Speakers by Location Speakers by Topics Author Catalog Entertainment Catalog Music Catalog Speakers Catalog Sports Catalog About AAE About Us AAE In The News Testimonials Speakers Bureau FAQs Contact Us Speaker News & Blog Quick Links Speakers Bureau Home Request Booking Info Event Planner Resources View all Speakers Weekly TV Shows Lineups Client Login Motivational Speakers Bureau AAE is one of the premier celebrity booking agencies and top keynote speakers bureaus in the world. Let us help you find the perfect motivational speaker, celebrity, or entertainer for your next corporate event. Contact Us Copyright © 2025 All American Speakers Bureau. All rights reserved. Sitemap | Privacy Policy 1.800.698.2536 Contact Us TOP"
    },
    {
      "url": "https://maps.apple.com/place?auid=7596573784622585781&lsp=9902",
      "text": "Faena Forum in Miami Beach, FL United States - Apple Maps Apple Maps Search Guides Directions Have a Business on Maps? Manage Your Business Faena Forum Faena Forum Music Venue · Miami Beach, Florida Directions Call Website 4 RATINGS 75% ACCEPTS Foursquare Foursquare Foursquare Foursquare Foursquare Foursquare Foursquare Foursquare Foursquare Foursquare Ratings Overall 75% 4 ratings Good to Know Accepts Apple Pay Accepts Contactless Payments Good for Groups Accepts Credit Cards Details Website faena.com Phone +1 (305) 534-8800 Address 3300 Collins Ave Miami Beach, FL  33140 United States"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.bizbash.com/venue-directory/ballrooms/venue/13461179/faena-forum",
      "text": "Faena Forum | Bizbash Venue & Supplier Directory Informa Bizbash is part of the Informa Connect Division of Informa PLC Informa PLC ABOUT US INVESTOR RELATIONS TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. Informa Documents Magazine Awards Events Subscribe Topics Event Production & Planning Related Topics Experiential Marketing Event Fabrication Programming & Entertainment Event Rentals See All > Event Design Related Topics Event Decor Corporate Swag See All > Event Catering Related Topics Food & Beverage Trends See All > Event Tech Related Topics AI for Meetings Event Tools Virtual Events See All > Event Venues Related Topics Hotels See All > Sporting Events Meetings & Trade Shows Related Topics Corporate Events Meetings Trade Shows Suppliers Venues Event Production & Planning Experiential Marketing Event Fabrication Programming & Entertainment Event Rentals Event Design Event Decor Corporate Swag Event Catering Food & Beverage Trends Event Tech AI for Meetings Event Tools Virtual Events Event Venues Hotels Sporting Events Meetings & Trade Shows Corporate Events Meetings Trade Shows Suppliers Venues Connect About us Advertise Resources Webinars White Papers Press Releases Venue & Supplier Directory Join Us Subscribe Gain easy access to downloads, webinars, magazine articles, and more! Follow Us Faena Forum Venue Description Faena Forum is a pioneering new landmark showcasing groundbreaking work ranging in fields from art and entertainment to business and beyond. Designed with OMA/Rem Koolhaas, the 43,000-square-foot Forum is designed for ultimate flexibility. Offering a collection of unique event spaces, including two grand Exhibit Halls, a rose marble Amphitheater with built-in seating and three meeting rooms, Faena Forum is dedicated to showcasing groundbreaking work in fields ranging from art and entertainment to business and beyond. Memorable Moment Faena Forum was inaugurated in late 2016 with Faena Art programming featuring local and international institutions. Bash Buzz Oceanfront on Collins Avenue from 32nd to 36th streets, Faena District is a cultural neighborhood in the heart of Miami Beach. Preferred Partners Preferred audiovisual services by SAV. Food and beverage service exclusive to Faena Hotel. Follow us on social media: ​​ ​​ Facebook ​​ Instagram Spaces Entire Space Area: 8,000 square space Markets Miami/South Florida Categories Ballrooms (All Venues) Banquet & Reception Halls Entertainment Venues/Performance Spaces Museums/Cultural Spaces Venue Faena Forum Website Email Us 786.655.5746 Address 3400 Collins Ave. 33140 Miami Beach, FL Send inquiry Explore About Us Subscribe to\r\n                BizBash Venue & Supplier Directory BizBash Lists Partner With Us Advertise Get\r\n                Featured Join Us Subscribe Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. Website TOU Code of conduct events Group privacy policy CCPA Cookie Policy Drop Us A Message I have read, understood and consent to your Privacy Policy Send Inquiry JavaScript is not enabled in your browser. Please enable\r\n              JavaScript, or certain functions may not work properly."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * Surname First name E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://members.faena.com/contact",
      "text": "Contact Us ● ● ● ● ● ● Contact Us Your Name Email Mobile Number What can we help you with? Please enter your code below.  Your code is: 39c4 I would like to Opt In to receive e-mail and text messages from Faena Rose Faena Rose 3201 Collins Avenue Miami Beach, FL 33140 Contact Us Phone (305) 283-9621 Email faenarose@faena.com © Faena Rose 2025.  Powered by PeopleVine . Terms of use | Privacy Policy | Cookie Policy"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    }
  ]
}