{
  "fuentes": [
    {
      "url": "https://www.fairexpo.com/participate/sponsors",
      "email": "sponsors@fairexpo.com"
    },
    {
      "url": "https://calendar.fiu.edu/event/miami-dade-county-fair-exposition-2024",
      "email": "accommodations@fiu.edu"
    },
    {
      "url": "https://www.fairexpo.com/expo/request",
      "email": "scamilo@fairexpo.com"
    },
    {
      "url": "https://www.salezshark.com/company/miami-dade-county-fair-exposition-inc",
      "email": "name@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/seedo/specialevents/5k",
      "email": "info@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "aleiva@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "cdouglass@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "dolday@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "ecora@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "info@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "ipaulino@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "itunon@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "jabreu@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "jblanco@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "mpretto@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "rmadruga@fairexpo.com"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "email": "scamilo@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/expo/events",
      "email": "debbie.thevintagemart@yahoo.com"
    },
    {
      "url": "https://www.fairexpo.com/expo/events",
      "email": "exhibits@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/expo/events",
      "email": "info@thevintagemart.com"
    },
    {
      "url": "https://www.fairexpo.com/expo/events",
      "email": "scamilo@fairexpo.com"
    },
    {
      "url": "https://careerfairexpo.com/",
      "email": "admin@diversityrecruitmentpartners.com"
    },
    {
      "url": "https://careerfairexpo.com/",
      "email": "diversityrecruitmentpartners@getvfairs.io"
    },
    {
      "url": "https://careerfairexpo.com/",
      "email": "info@careerfairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/about/scholarships",
      "email": "exhibits@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/seedo-fair_food_drive_thru.php",
      "email": "debbie.thevintagemart@yahoo.com"
    },
    {
      "url": "https://www.fairexpo.com/seedo-fair_food_drive_thru.php",
      "email": "exhibits@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/seedo-fair_food_drive_thru.php",
      "email": "info@thevintagemart.com"
    },
    {
      "url": "https://www.fairexpo.com/seedo-fair_food_drive_thru.php",
      "email": "scamilo@fairexpo.com"
    },
    {
      "url": "https://k-12.careerfairexpo.com/",
      "email": "editor@diversityined.com"
    },
    {
      "url": "https://k-12.careerfairexpo.com/",
      "email": "k-12@getvfairs.io"
    },
    {
      "url": "https://k-12.careerfairexpo.com/",
      "email": "trina@diversityined.com"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5206/miami-dade-county-fair-and-expo-center/",
      "email": "byob@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5206/miami-dade-county-fair-and-expo-center/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5206/miami-dade-county-fair-and-expo-center/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://www.fairexpo.com/participate/performers",
      "email": "chernandez@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/performers",
      "email": "mpretto@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/performers",
      "email": "scamilo@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/exhibits/students",
      "email": "afebles@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/exhibits/students",
      "email": "chernandez@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/exhibits/students",
      "email": "exhibits@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/participate/exhibits/students",
      "email": "lmanzanares@fairexpo.com"
    },
    {
      "url": "https://www.fairexpo.com/about/contact",
      "email": "info@fairexpo.com"
    }
  ],
  "mails": [
    "accommodations@fiu.edu",
    "admin@diversityrecruitmentpartners.com",
    "afebles@fairexpo.com",
    "aleiva@fairexpo.com",
    "byob@2x.png",
    "cdouglass@fairexpo.com",
    "chernandez@fairexpo.com",
    "debbie.thevintagemart@yahoo.com",
    "diversityrecruitmentpartners@getvfairs.io",
    "dolday@fairexpo.com",
    "ecora@fairexpo.com",
    "editor@diversityined.com",
    "exhibits@fairexpo.com",
    "indooroutdoor@2x.png",
    "info@careerfairexpo.com",
    "info@fairexpo.com",
    "info@thevintagemart.com",
    "ipaulino@fairexpo.com",
    "itunon@fairexpo.com",
    "jabreu@fairexpo.com",
    "jblanco@fairexpo.com",
    "k-12@getvfairs.io",
    "lmanzanares@fairexpo.com",
    "mpretto@fairexpo.com",
    "name@fairexpo.com",
    "rmadruga@fairexpo.com",
    "scamilo@fairexpo.com",
    "sponsors@fairexpo.com",
    "trina@diversityined.com",
    "valet@2x.png"
  ],
  "nombre_sitio": "fairexpo.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fairexpo.com/participate/sponsors",
      "text": "Miami-Dade County Fair and Exposition - sponsors March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Participate sponsors sponsors Become a Sponsor Explore our wide-range of sponsorship opportunities from the highest on-site level of visibility to effortless channels to reach fairgoers. With more than half a million guests, The Youth Fair ranks among the top 30 fairs in North America. Our team is committed to making your experience a positive, profitable and memorable one. We’ll match you up with the best sponsorship level for you or design a custom-made package designed to meet all your business and marketing needs. Benefits Increase brand awareness and recognition On-site display, sales and sampling Activation opportunities Lead generation Drive sales Product and/or business showcase On-site Signage Inclusion on website and marketing materials Opportunity to sponsor entertainment and/or concert lineup Benefits will vary depending on the level of investment By The Numbers Get Started Let us tailor your way to success! Contact If you are interested in learning more about sponsorship opportunities, please send an email to sponsors@fairexpo.com Corporate Sponsors Friends of The Youth Fair Media Partners Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://calendar.fiu.edu/event/miami-dade-county-fair-exposition-2024",
      "text": "Miami-Dade County Fair & Exposition\n    \n    \n      | FIU Calendar Skip to Main Content Florida International University Events Calendar Campus Life Arts & Culture Athletics Academics Career Readiness Recreation & Wellness Community Search Search Close Menu Search Sign Up Log in Sign up FIU Calendar Past Events Miami-Dade County Fair & Exposition Clear message Miami-Dade County Fair & Exposition Thursday, April 4, 2024 I'm Interested Share Miami-Dade County Fair & Exposition Share Miami-Dade County Fair & Exposition on Facebook Share Miami-Dade County Fair & Exposition on X Share Miami-Dade County Fair & Exposition on LinkedIn I'm Interested About this Event Miami-Dade County Youth Fairgrounds View map Free Event Add to calendar Save to Google Calendar Save to iCal Save to Outlook 10901 Coral Way, Miami, FL 33165 https://www.fairexpo.com/ View map Free Event Add to calendar Save to Google Calendar Save to iCal Save to Outlook BE THERE! THE FAIR.® The Miami-Dade County Fair & Exposition , adjacent to MMC, invites members of the FIU community to two free entry days for students, faculty, and staff on March 21 and April 4 with your FIU ID. Learn more at go.fiu.edu/YouthFair2024 . Should you need an ADA accommodation to participate in a university event, program, or activity or need to request materials \n  in an accessible format, please contact FIU’s Office of Civil Rights Compliance and Accessibility (CRCA) at 305-348-2785 or accommodations@fiu.edu . All requests for ADA accommodation or accessible materials for this event must be submitted to CRCA \n  at least seven (7) business days prior to the event or at the earliest possible opportunity. Event Details Event Type Arts & Culture Exhibitions Community Audience Students Faculty & Staff Website https://www.fairexpo.com/ Cost Free with your FIU ID Department Center for Community Impact & Public Purpose See Who Is Interested + 18 People interested in event I'm Interested Hide map Show map Public transport Car Walking Your browser does not support iframes. User Activity No recent activity Sign up to post Statement of Free Expression FIU endorses the Florida Board of Governors' Statement of Free Expression to support and \n                    encourage full and open discourse and the robust exchange of ideas and perspectives on our \n                    campuses. In addition to supporting this legal right, we view this as an integral part of \n                    our ability to deliver a high-quality academic experience for our students, engage in \n                    meaningful and productive research, and provide valuable public service. This includes \n                    fostering civil and open dialogue in support of critical thinking in and out of the classroom, \n                    including events hosted by the university. Event Types Academic Calendar Admissions Alumni Arts & Culture Campus  Life Career Readiness Community Faculty & Staff Info Sessions Lectures & Conferences Recreation & Wellness Workshops & Webinars Audience Alumni Faculty & Staff General Public Parents & Family Private Prospective Students Retirees Students Activity All events All departments All groups All places Submit an event Connect Contact FIU FIU News Explore FIU About FIU Admissions Academics Locations Research Student Life Athletics Alumni and Giving Careers at FIU Estimate Cost of Attendance Tools & Resources Phonebook (Directory) University Calendar Campus Maps MyFIU Canvas FIU Email System Status Reserve Space Nondiscrimination Title IX Report Discrimination or Harassment © Florida International University | Website by Digital Communications | Website Feedback | Web/Accessibility Log in Log in with FIU Account"
    },
    {
      "url": "https://www.fairexpo.com/expo/request",
      "text": "Miami-Dade County Fair and Exposition - Fair Expo Center Request Form March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Fair Expo Center Fair Expo Center Request Form Fair Expo Center Request Form Interested in booking an event? We would love to talk to you! Fill out our Fair Expo Center Request Form and a member of our team will get back to you. FAIR EXPO CENTER REQUEST FORM FACILITIES ARNOLD HALL & REILLY COLISEUM EDWARDS HALL E. DARWIN FUCHS PAVILION BLUE RIBBON ROOM & CAROUSEL ROOM MAIN ENTRANCE BUILDING THE FAIRGROUNDS UPCOMING EVENTS VIDEO CONTACT Sira Camilo Director Fair Expo Center (786) 315-5266 scamilo@fairexpo.com Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://www.salezshark.com/company/miami-dade-county-fair-exposition-inc",
      "text": "Miami-Dade County Fair & Exposition, Inc. Email ID Format | Official Contacts Miami-Dade County Fair & Exposition, Inc. Email ID Format : name@fairexpo.com Communicating through official emails like name@fairexpo.com instead of generic emails like name@gmail.com enhances credibility, security, and professionalism. It reduces the risk of emails landing in spam and strengthens brand identity. Miami-Dade County Fair & Exposition, Inc. is one of the leading Media Production Companies in United States Of America. The Miami-Dade County Fair & Exposition, Inc. Email ID Format is name@fairexpo.com . This company has its headquarters in Miami, Northwest Territories , and has a strength of 1 - 50 employees. Here, you can explore the email IDs and phone numbers of the top 2 Miami-Dade County Fair & Exposition, Inc. employees. View Emails/Numbers Miami, Northwest Territories Overview Email & Phone Top Executives Similar Companies Competitor Companies FAQs Miami-Dade County Fair & Exposition, Inc. - Overview, Product/Services, Strength, Revenue & Address Have the complete details of Miami-Dade County Fair & Exposition, Inc., including the official website and all other relevant information. Company Name Miami-Dade County Fair & Exposition, Inc. Official Contact ******8777 Official Address Miami, Northwest Territories, United States Of Ame... More Industry Type Media Production Employees Range 1 - 50 Revenue Range 1 - 50 Company Type Public Company Official Website http://www.fairexpo.com Products/Services Get Detailed Info Miami-Dade County Fair & Exposition, Inc. Email Address - Top Working Professionals Check the Email and Phone Number List of the Top Management working at the Miami-Dade County Fair & Exposition, Inc. Name Designation Email Address Contact Number View Email & Phone ***die Cor*** Interim President and CEO ****@fairexpo.com ******2176 View Email & Phone ***ohn Tan*** maintainance manager ****@fairexpo.com ******3233 View Email & Phone View More Email & Phone Use Miami-Dade County Fair & Exposition, Inc. 's Contacts for Lead Generation Having access to Miami-Dade County Fair & Exposition, Inc.'s official emails and phone numbers boosts lead generation. Official emails like name@fairexpo.com build trust and credibility, making prospects more likely to engage and ensuring higher open rates. You can send emails to the Managing Director, Management, O Level, CEO, HR Head, CXO, Marketing Head , Admin, CFO Contact, Founder, Sales Head , and other Key Employees of Miami-Dade County Fair & Exposition, Inc. by using the Connect+ Email Marketing Tool . 1 - 50 employees are working at Miami-Dade County Fair & Exposition, Inc., to whom you can hit the emails. List of Top Video and Film Making Companies in United States Of America Video and Film Making Companies in United States of America Video and Film Making Companies in California Video and Film Making Companies in Columbia Video and Film Making Companies in Georgia Video and Film Making Companies in Los Angeles Video and Film Making Companies in New Jersey Video and Film Making Companies in New York Video and Film Making Companies in Pennsylvania Video and Film Making Companies in Virginia Video and Film Making Companies in Washington Key Players Like Miami-Dade County Fair & Exposition, Inc. in United States Of America If you’re looking for companies similar to Miami-Dade County Fair & Exposition, Inc., here are some from the Media Production Industry. All of these companies have businesses in various products, and you can pick any of them and get the company’s Email ID Format and even the corporate email address of employees working there, as these companies are similar to Miami-Dade County Fair & Exposition, Inc.. Name Industry Headquarters No. of Employees Eric Goldsmith MD Media Production Northwest Territories,United States Of America 2501 - 5000 Latin Food & Wine Media Production Northwest Territories,United States Of America 501 - 1000 Feld Entertainment Media Production Northwest Territories,United States Of America 501 - 1000 RealSimple.com Media Production Northwest Territories,United States Of America 501 - 1000 Anchor Glass Container Corp Media Production Northwest Territories,United States Of America 501 - 1000 View More Similar Companies Name Industry Headquarters No. of Employees Amazon Business Media Production Maharashtra,India 1 - 50 Final Cut Productions, Inc. Media Production Georgia,United States Of America 1 - 50 Your Family Entertainment AG Media Production Maharashtra,India 1 - 50 TV Visjon Norge Media Production Michigan,United States Of America 1 - 50 Media Manthan News Media Production Rajasthan,India 1 - 50 View More Competitors Companies Top Alternatives and Competitors of Miami-Dade County Fair & Exposition, Inc. Don't overlook Miami-Dade County Fair & Exposition, Inc.’s competitors, as they can be an excellent target for promoting your product via email marketing. While their products and services may differ from Miami-Dade County Fair & Exposition, Inc., they all share a similar employee size of 1 - 50, making them valuable prospects for your campaigns. Frequently Asked Questions Here are the Quick Solutions to Your Most Common Queries related to the Miami-Dade County Fair & Exposition, Inc. Email Format, Company, Employees, and Revenue. What is the Miami-Dade County Fair & Exposition, Inc. Email ID Format used by all the employees in the company? All the employees at Miami-Dade County Fair & Exposition, Inc. India have the Email ID Format as name@fairexpo.com . Where is the Headquarters of Miami-Dade County Fair & Exposition, Inc.? The headquarters of Miami-Dade County Fair & Exposition, Inc. is in Northwest Territories, United States Of America What is the Official Website of the Miami-Dade County Fair & Exposition, Inc.? The Official Website of the Miami-Dade County Fair & Exposition, Inc. is http://www.fairexpo.com What is the industry type of Miami-Dade County Fair & Exposition, Inc.? The Industry type of Miami-Dade County Fair & Exposition, Inc. is Media Production How many employees are there at Miami-Dade County Fair & Exposition, Inc.? The overall employees at Miami-Dade County Fair & Exposition, Inc. are 1 - 50 What is the yearly Revenue generated every month by Miami-Dade County Fair & Exposition, Inc.? Miami-Dade County Fair & Exposition, Inc. generates an income of 1 - 50 in a year What are the Products and Services offered by Miami-Dade County Fair & Exposition, Inc.? The products and services offered by Miami-Dade County Fair & Exposition, Inc. are ...Get Detailed Info Disclaimer: We incorporate several data points to give structure, flow, and efficacy to the information provided, and we use the best and most reliable sources (primary and secondary research, public information). © 2025 SalezShark.com. All rights reserved. Privacy Policy | Security Policy | Terms & Conditions"
    },
    {
      "url": "https://www.fairexpo.com/seedo/specialevents/5k",
      "text": "Miami-Dade County Fair and Exposition - 2025 BE THERE! 5K March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home THINGS TO SEE AND DO 2025 BE THERE! 5K 2025 BE THERE! 5K The Youth Fair’s Be There! 5K presented by Baptist Health BE THERE to celebrate the Youth Fair’s opening weekend and be a part of this FUN run/walk with your family and friends. Participants will get a one-time behind-the-scenes view of the fairgrounds, as they make their way from the parking lot and through the midways during closed hours. This event supports the Youth Fair’s Scholarship program. All participants will receive a race medal, race t-shirt, swag bag and one complimentary admission ticket to the March 15 or March 16. REGISTER NOW Race Day Information Date: Saturday, March 15, 2025 Time: 7:30 AM Location: Miami-Dade County Fair & Exposition Registration & Pricing Info Registration is now open! Register early to save. REGISTER NOW September 16, 2024, 12:00am EDT November 17, 2024, 11:59pm EST $30.00 Race Fee + $2.80 SignUp Fee November 18, 2024, 12:00am EST January 15, 2025, 11:59pm EST $35.00 Race Fee + $3.10 SignUp Fee January 16, 2025, 12:00am EST February 15, 2025, 11:59pm EST $40.00 Race Fee + $3.40 SignUp Fee February 16, 2025, 12:00am EST March 14, 2025, 11:59pm EDT $45.00 Race Fee + $3.70 SignUp Fee March 15, 2025, 12:00am EDT March 15, 2025, 8:00am EDT $50.00 Race Fee + $4.00 SignUp Fee Volunteers Calling all volunteers! We’re looking for energetic individuals to help us with this fun run/walk. Check out all race-related volunteer opportunities below. VOLUNTEER SIGN UP Course The BE THERE 5K begins at the main entrance of The Youth Fair. Participants will run through Tamiami Park then enter the fairgrounds to run alongside the rides, concessions stands, exhibits and cross the finish line on Main Street inside the fairgrounds. The course map will be emailed to participants. Finishers will Receive Finishers Medal Race Shirt (sizes selected are final) Race Bib One Admission to the 2025 Youth Fair for Opening Weekend (March 15 or 16) Race Packets & Pickup Race Packet & Pickup information to be provided at a later time. Schedule of Event Race Schedule of Events information to be provided at a later time. Spectators Do you have someone who would like to watch the race? Spectators are allowed however, those who want to watch the race will need to purchase an admission ticket to The Youth Fair. This ticket can be used to return to The Youth Fair later that day during regular operating hours. Spectator Tickets sales and information coming soon. Youth Fair Scholarship Program Proceeds from the Youth Fair's Be There! 5K will benefit the Miami-Dade County Fair and Exposition's scholarship program. The Miami-Dade County Fair & Exposition, Inc. is a not-for-profit organization dedicated to enriching the community by promoting education and South Florida agriculture while showcasing and rewarding youth achievement. We accomplish this by producing a first-class fair with quality entertainment and providing facilities for year-round events. Interested in becoming a sponsor? For more information on sponsorship opportunities, please contact us at info@fairexpo.com. Sponsors Presenting Sponsor Valued Sponsors Call 305-223-7060 or email info@fairexpo.com to request material in accessible format, information on access for persons with disabilities, or a sign language interpreter (7 days in advance). Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "http://18.232.173.33/about-contact.php",
      "text": "Miami-Dade County Fair & Exposition\r\n    - Contact Us An inherent risk of exposure to COVID-19 exists in any public place where people are present. View important details . Newsletter Directions Contact November 18 - December 5, 2021 Plan Your Visit COVID-19 Information Ticket Conversion Policy Getting Here Things To See & Do Rides, Food & Games Shop at The MarketPlace Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event – Get Started Upcoming Events About Mission Community Media & News Awards & Recognition Employment Contact Connect Privacy Statement Home About Contact Us Contact Us Miami-Dade County Fair & Exposition, Inc. 10901 Coral Way (SW 24 Street) Miami, FL 33165 Phone: (305) 223-7060 Fax: (305) 554-6092 Email: info@fairexpo.com Executive Eddie Cora President ecora@fairexpo.com Julie Blanco Director Administration & Compliance jblanco@fairexpo.com Exhibits Carol Douglass Director Competitive Exhibits cdouglass@fairexpo.com Fair Expo Center | Guest Relations Sira Camilo Director Fair Expo Center scamilo@fairexpo.com Information Technology David Olday Director Information Technology dolday@fairexpo.com Marketing & Entertainment Michelle V. Pretto Manager Marketing & Entertainment mpretto@fairexpo.com Iris Tunon Manager Creative Services itunon@fairexpo.com Operations Rosa Madruga Director Operations rmadruga@fairexpo.com Online Ticket Sales For questions about online ticket orders, contact Etix at 1-800-514-3849 Rental Facilities Media About Contact Employment Privacy Statement 10901 Coral way | miami, fl 33165 | 305.223.7060 Copyright 2020 Miami-Dade County Fair & Exposition, Inc. All rights reserved. Scan using Snapchat ×"
    },
    {
      "url": "https://www.fairexpo.com/expo/events",
      "text": "Miami-Dade County Fair and Exposition - Upcoming Events March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Fair Expo Center Upcoming Events Upcoming Events September 2025 12 Sep Celebration Luncheon Sep 12, 2025 Blue Ribbon Room 19 Sep Deltapalooza 2025 Sep 19, 2025 Edwards Hall Details Times:  7 PM to 1 AM 20 Sep 48th Annual IAS Tropical Plant Expo Sep 20 - Sep 21, 2025 Fuchs Pavilion Details Link: https://www.aroid.org/expo?gad_source=1&gad_campaignid=22653305170&gclid=Cj0KCQjw-NfDBhDyARIsAD-ILeATuAexXeGgjQxNhtiozKOh9ZU4j1EJWSCEC3eSiG4-1hlO4U1C8dgaAkwkEALw_wcB 20 Sep Liga Contra el Cancer 50th Anniversary Telethon Sep 20, 2025 Arnold Hall 23 Sep Teacher Workshop Day for Landscape Division Sep 23, 2025 Carousel Room Details Times: 9 AM to 1 PM 27 Sep St. Jude Children's Walk/Run to End Childhood Cancer Sep 27, 2025 Grounds Main Gate Details Link: https://fundraising.stjude.org/site/TR/Walk/Walk?fr_id=160942&pg=entry 28 Sep Pepsi Company Picnic (Private Event) Sep 28, 2025 Edwards Hall October 2025 3 Oct Float Build-out and Costume Distribution for Carnival Events Oct 3 - Oct 12, 2025 Fuchs Pavilion Edwards Hall 4 Oct Susan G. Komen's More than Pink Walk - NEW EVENT AT THIS VENUE Oct 4, 2025 Grounds Main Gate Details Link: https://www.komen.org/how-to-help/attend-events/ 11 Oct One Fete 2025 Oct 11, 2025 Arnold Hall Reilly Coliseum Details Link: https://www.eventbrite.com/e/one-fete-2025-tickets-1095738787209?msockid=16497e26ed7463df1d8f6c1becd362b0 12 Oct Miami Carnival Parade of Bands & Concert Oct 12, 2025 Grounds Main Gate Details Link: https://miamicarnival.org/ 17 Oct Miami Home Design & Remodeling Show Oct 17 - Oct 19, 2025 Arnold Hall Reilly Coliseum Fuchs Pavilion Main Gate Edwards Hall Fair Expo Grille Details Link: https://homeshows.com/home-show-dates-miami/ 21 Oct The Youth Fair's Liaison Dinner Oct 21, 2025 Blue Ribbon Room Details Start Time:  6 PM Free Praking 23 Oct PROS All Staff Meeting & Innovative Showcase Oct 23, 2025 Arnold Hall Fuchs Pavilion 25 Oct Ag Seminar – Poultry, Rabbits/Cavies Oct 25, 2025 Main Gate Details Main Gate, Sound end, 1st and 2nd Floors November 2025 1 Nov Florida Gun Shows Nov 1 - Nov 2, 2025 Arnold Hall Reilly Coliseum Fair Expo Grille Details Link: https://www.floridagunshows.com/ 8 Nov NAGA South Florida 2025 (Jiu Jitsu) - NEW EVENT AT THIS VENUE Nov 8, 2025 Fuchs Pavilion 8 Nov Jazz in the Heights - NEW EVENT AT THIS VENUE Nov 8, 2025 Grounds Blue Ribbon Room Carousel Room Main Gate Details More information coming soon! Free admission; Free parking. 13 Nov The Youth Fair's Superintendent Meeting Nov 13, 2025 Blue Ribbon Room Details DStart Time: 6 PM 13 Nov Garden Bros. Nuclear Circus Nov 13 - Nov 16, 2025 Grounds Details More info coming soon! 13 Nov South Florida Plumbing & Mechanical Trade Show - NEW EVENT Nov 13, 2025 Fuchs Pavilion Details Times: 3 PM to 8 PM 14 Nov The All Stars Tattoo Convention Nov 14 - Nov 16, 2025 Arnold Hall Reilly Coliseum Fair Expo Grille 21 Nov Feria Las Americas - ExpoNica Nov 21 - Nov 23, 2025 Arnold Hall Reilly Coliseum Blue Ribbon Room Edwards Hall Details Link: https://ferialasamericas.com/ 22 Nov Harvest in Miami Nov 22 - Nov 23, 2025 Fuchs Pavilion Details Link: https://harvestinmiami.com/harvest 28 Nov Nights of Lights Nov 28 - Jan 1, 2026 Grounds Details More info coming soon! December 2025 5 Dec Venezuela Legacy Tour - NEW EVENT Dec 5 - Dec 7, 2025 Arnold Hall Reilly Coliseum Fuchs Pavilion Details For more info: 561-947-4884 14 Dec More Info Coming Soon Dec 14, 2025 Fuchs Pavilion 19 Dec Commissioner Roberto J. Gonzalez's (District 11) Senior Holiday Event Dec 19, 2025 Blue Ribbon Room Carousel Room Details Times: 10 AM to 3 PM January 2026 3 Jan FGS - More Info Coming Soon! Jan 3 - Jan 4, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 6 Jan Fishing Gear Classes Jan 6, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 9 Jan The Vintage Mart - NEW EVENT Jan 9 - Jan 11, 2026 Fuchs Pavilion Details For more info:  info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 13 Jan Fishing Gear Classes Jan 13, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 16 Jan Tamiami International Orchid Festival Jan 16 - Jan 18, 2026 Fuchs Pavilion 20 Jan Early Check-In for Creative Writing, Child Development Books, World Languages & Fine Arts Jan 20, 2026 Arnold Hall Details North end of Arnold Hall, next to the Exhibits office. Times: 4 PM to 7 PM 20 Jan Fishing Gear Classes Jan 20, 2026 Main Gate Details Times:  7 PM to 9 PM Link: http://For Info: exhibits@fairexpo.com 24 Jan Volleyball Tournament Jan 24 - Jan 25, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Edwards Hall Fair Expo Grille 27 Jan Fishing Gear Classes Jan 27, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 31 Jan Volleyball Tournament Jan 31 - Feb 1, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Edwards Hall Fair Expo Grille February 2026 3 Feb Fishing Gear Classes Feb 3, 2026 Main Gate Details Times:  7 PM to 9 PM For info: exhibits@fairexpo.com 4 Feb Miami-Dade County Retired Educators Association Event (Private) Feb 4, 2026 Blue Ribbon Room Details Times:  11 AM to 1PM 6 Feb Miami Grit Classic (Gymnastic Competition) - NEW EVENT AT THIS VENUE Feb 6 - Feb 8, 2026 Arnold Hall Reilly Coliseum Edwards Hall Details Link: https://miamigritclassic.com/ 10 Feb Fishing Gear Classes Feb 10, 2026 Main Gate Details Times:  7 PM to 9 PM For info: exhibits@fairexpo.com 13 Feb ShowBiz Dance Competition Feb 13 - Feb 15, 2026 Fuchs Pavilion 14 Feb FGS - More Info Coming Soon! Feb 14 - Feb 15, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 17 Feb Fishing Gear Classes Feb 17, 2026 Main Gate Details Times: 7 PM to 9 PM For Info: exhibits@fairexpo.com 19 Feb M-DCPS Technical College Career Expo Feb 19 - Feb 20, 2026 Arnold Hall Reilly Coliseum 28 Feb The Youth Fair - Security Orientation for Parking Staff Feb 28, 2026 Main Gate Details Mian Gate, North end March 2026 1 Mar The Youth Fair - Security Orientation for Non-Parking Employees Mar 1, 2026 Blue Ribbon Room Details Blue Ribbon Room at the R. Ray Goode Bldg (2nd Fl) 4 Mar Fashion Show Pre-Judging of Garments & Sketch Designs Mar 4, 2026 Arnold Hall Details Jack Griffith Playhouse inside Arnold Hall Times: 4 PM to 6 PM 4 Mar The Youth Fair's Guest Relations Orientation #1 Mar 4, 2026 Board Room Details Start Time: 6:30 PM To join the 2026 Youth Fair's guest relations team, please send email to scamilo@fairexpo.com. 6 Mar The Youth Fair's Guest Relations Orientation #2 Mar 6, 2026 Blue Ribbon Room Details Start Time: 6:30 PM To join the 2026 Youth Fair's guest relations team, please send email to scamilo@fairexpo.com. 11 Mar The Youth Fair's Guest Relations Walk-thru Mar 11, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Grounds Main Gate Edwards Hall Details 1st Walk-thru: 2 PM 2nd Walk-thru: 6 PM (One walk through is mandatory for guest relations team.) For more info: scamilo@fairexpo.com 12 Mar Miami-Dade County Fair and Exposition (The Youth Fair) Mar 12 - Apr 5, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Grounds Blue Ribbon Room Carousel Room Main Gate Edwards Hall Board Room Fair Expo Grille Details The Youth Fair is ranked among the top 30 fairs in North America. In 2025, more than 540,000 guests attended the annual event. This adrenaline-filled 21-day event includes heart pounding rides, outrageous carnival food, livestock and agricultural competitions, concerts, blockbuster shows, student exhibits display and much more. Link: https://www.fairexpo.com/plan/tickets April 2026 18 Apr Great American Franchise Expo - NEW EVENT AT THIS VENUE Apr 18 - Apr 19, 2026 Fuchs Pavilion Details Link: https://www.franexpousa.com/ 24 Apr Maker Faire Miami - - NEW EVENT AT THIS VENUE Apr 24 - Apr 26, 2026 Fuchs Pavilion Details Link: https://miami.makerfaire.com/ 25 Apr FSG - More Info Coming Soon! Apr 25 - Apr 26, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille May 2026 1 May The Rare Plant Festival May 1 - May 3, 2026 Fuchs Pavilion Details Link: https://www.rareplantfestival.com/ 6 May Miami-Dade County Retired Educators Association Event (Private) May 6, 2026 Blue Ribbon Room Details Times:  11 AM to 1 PM 7 May PrimeTime Dance Competition May 7 - May 10, 2026 Fuchs Pavilion 30 May FGS - More Info Coming Soon! May 30 - May 31, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille June 2026 5 Jun The Vintage Mart - NEW EVENT Jun 5 - Jun 7, 2026 Fuchs Pavilion Details Fore more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 6 Jun MD-PROS Summer In-Service Training Jun 6, 2026 Blue Ribbon Room Details Times:  7:30 AM to 5 PM July 2026 18 Jul FGS - More Info Coming Soon! Jul 18 - Jul 19, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille August 2026 1 Aug The Children's Trust Family Expo Aug 1, 2026 Arnold Hall Grounds Details Free Admission. Free Parking. 7 Aug The Vintage Mart - NEW EVENT Aug 7 - Aug 9, 2026 Fuchs Pavilion Details For more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com September 2026 5 Sep FGS - More Info Coming Soon! Sep 5 - Sep 6, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 16 Sep MD-PROS Recreation Training Sep 16, 2026 Edwards Hall October 2026 30 Oct The Vintage Mart - NEW EVENT Oct 30 - Nov 1, 2026 Fuchs Pavilion Details For more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 31 Oct FGS - More Info Coming Soon! Oct 31 - Nov 1, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille The Miami-Dade County Fair & Exposition, Inc. is not affiliated, nor does it endorse, any activity on its fairgrounds when licensing the use of its fairgrounds to a third entity. FACILITIES ARNOLD HALL & REILLY COLISEUM EDWARDS HALL E. DARWIN FUCHS PAVILION BLUE RIBBON ROOM & CAROUSEL ROOM MAIN ENTRANCE BUILDING THE FAIRGROUNDS UPCOMING EVENTS VIDEO CONTACT Sira Camilo Director Fair Expo Center (786) 315-5266 scamilo@fairexpo.com Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://careerfairexpo.com/",
      "text": "careerfairexpo2025 × careerfairexpo2025 × Login Email: Cancel Login New user? Register now Are you sure you want to cancel your registration? Cancelling your registration will remove your access to the event. If you proceed, you will no longer be able to participate or access event-related materials. Keep My Registration Cancel Registration Are you sure you want to delete account? Deleting your account will remove your access to the event. Keep My Registration Delete Registration × Reset Password Email / Username: New password: Confirm password: Cancel Update × Reset Password Email / Username: Cancel Reset × careerfairexpo2025 (832) 626-4263 (832) 626-4263 Need Assistance? info@careerfairexpo.com Toggle navigation x Home Login Exhibitor Register Job Seeker Register ZOOM-Room Terms of Service Contact Us: (832) 626-4263 Cart Close"
    },
    {
      "url": "https://www.fairexpo.com/about/scholarships",
      "text": "Miami-Dade County Fair and Exposition - scholarship program March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home About scholarship program scholarship program The Miami-Dade County Fair & Exposition Scholarship Program was created to recognize and honor the youth of Miami for demonstrating a strong sense of commitment and participation in school and community activities. Multiple scholarships are awarded each year to students enrolling in a college, university or trade school. How to Apply Please request a Scholarship application from your High School CAP Advisor Frequently Asked Questions How much is the scholarship? The Scholarship winners each receive $1,000. Who is eligible? The scholarship targets college-bound senior high school students graduating from public, private and charter high schools. Are home-schooled students eligible to apply? Yes, all students who meet college admissions requirements and will enroll in a school of higher education are eligible. What about non-traditional students? The inclusive competitive scholarship program reaches students at alternative education and adult vocational programs. Also, Florida International University students who volunteer their time and talent to work at The Youth Fair's performing arts division are eligible to receive a scholarship. How does this program promote agriculture? Certain scholarships are earmarked annually for students planning a career in agriculture related fields. The Youth Fair is a traditional county fair, a concept that originated in the 19th century as a way to promote modern farming. How do I apply? Request an application from your high school's CAP Advisor, fill it out and submit the complete application to your high school's CAP Advisor. Who can I contact for more information? For questions about the scholarship, please email us at exhibits@fairexpo.com 2025 Miami-Dade County Youth Fair & Exposition Scholarship Program Recipients Alina M. Alonso George T. Baker Aviation Technical Melany A.  Alvarez Hialeah - Miami Lakes Senior High School Sofia Arango School for Advanced Studies Mariana Arboli Miami Arts Studio 6-12 @Zelda Glazer Amaya S. Baker Doctors Charter School Joseph Alexis Barrientos Homeschool Neven A. Barrios Keys Gate Charter High School Jacob S. Beard Arthur & Polly Mays Conservatory of the Arts Tiffany H. Beh Coral Gables Senior High School Darolie Blaise Miami Central Senior High School Eimi Blanco Medical Academy for Science & Tech Jania C. Burton COPE Center North Natalie R. Carranza William H. Turner Technical Arts High School Alessandro J. Catalano MAST Academy Shania C. Charles North Miami Senior High Helen Chivite Barbara Goleman Senior High Yanela Cid Westland Hialeah High School Trinity J. Cintron Robert Morgan Senior High Mia Cohen Dr. Michael M Krop Senior High School Andrew Crowther Miami Coral Park Adult Continuing Ed Emmy L. Da Silva Center for International Education Derek A. De Leon Hialeah Gardens Senior High School Natalia De Prisco Downtown Doral Charter Upper School Kellie Diaz Miami Springs Senior High Lucas A. Escobar Felix Varela Senior High Chloe N. Farreau iPreparatory Academy Ikesha R. Ferguson Miami Lakes Educational Center Andres A. Fernandez Don Soffer Aventura High School Arianna D. Freckleton Miami Lakes Educational Center Michelle Fridkin Alonzo & Tracy Mourning SHS Mia A. Gabriel American Senior High School Anabella Garcia Homeschool Allyson Z. Garrido Hialeah Gardens High School Annabelle M. Gonzalez Miami Southridge Senior High School Cristina I. Gonzalez Hialeah Gardens High School Roxana Y. Granados Dorothy M. Wallace COPE Center Sanhi J. Grant Miami Carol City Senior High School Jazmin M. Guzman-Petgrave South Dade Senior High School DeJaya E. Hardy Miami Norland Senior High School Nelissa A. Herrera Miami Senior HIgh School Julia O. Honniball International Studies Preparatory Academy Victoria E.  Jarquin Everglades Preparatory Academy Angelina J. Joseph Miami Northwestern Sr. High Nixon Joseph Lindsey Hopkins Technical College Sabina Khizroev Miami Palmetto Senior High School Maria F. Leon Miami Coral Park Senior High School Miranda M.  Lopez Miami Killian Senior High School Edward D. Lopez de Uralde Christopher Columbus High School Anabella Ludovic Coral Reef Senior High School Cindy G. Luna John A. Ferguson Senior High School Sophia Luo Young Women's Preparatory Academy Hillary Marrero Hialeah Senior High School Bibiana N. Mejia Ayala Miami Palmetto Adult Education Ctr Angeli  Mejia-Espinal Miami Jackson Senior High School Maricela V. Mesarina Miami Beach Senior High School Kiera S. Mezadieu Somerset Preparatory Academy Homestead Joel Mintze Young Men's Preparatory Academy Alexis M. Morales Saint Brendan High School Stella E. Nawyn Cutler Bay Senior High Jonathan B. Osborn Colonial Christian School Alexandrea J. Patten Coral Reef Senior High School Roudy Pierre William H. Turner Technical Adult Ed Ctr Yael D. Pilnik iPrep Academy North Emily I. Ramirez G. Holmes Braddock Senior High School Jayden Robinson Miami Dade Online Academy Patrick H. Robinson Robert Morgan Senior High School Joseph Rodriguez Booker T. Washington Senior High Michelle Saez Miami-Dade Virtual School Anita Salto South Dade Technical College Oakley M. Sever Terra Environmental Research Institute Jose Miguel Soler Hernandez JC Bermudez Doral Senior High School Miranda I. Souki New World School of the Arts Jayvyn R. Stewart Miami Edison Senior High Lounedia St Surin William H. Turner Technical Arts High School Ranyece M. Taylor North Miami Beach Senior High Paloma N. Vidarte Southwest Miami Senior High School Valeria V. Villarroel South Miami Senior High School Ava M. Ward Robert Morgan Educational Center Olivia S. Ward Robert Morgan Senior High School Angelina Williams MAST @FIU Biscayne Bay Photo Gallery Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://www.fairexpo.com/seedo-fair_food_drive_thru.php",
      "text": "Miami-Dade County Fair and Exposition - Upcoming Events March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Fair Expo Center Upcoming Events Upcoming Events September 2025 12 Sep Celebration Luncheon Sep 12, 2025 Blue Ribbon Room 19 Sep Deltapalooza 2025 Sep 19, 2025 Edwards Hall Details Times:  7 PM to 1 AM 20 Sep 48th Annual IAS Tropical Plant Expo Sep 20 - Sep 21, 2025 Fuchs Pavilion Details Link: https://www.aroid.org/expo?gad_source=1&gad_campaignid=22653305170&gclid=Cj0KCQjw-NfDBhDyARIsAD-ILeATuAexXeGgjQxNhtiozKOh9ZU4j1EJWSCEC3eSiG4-1hlO4U1C8dgaAkwkEALw_wcB 20 Sep Liga Contra el Cancer 50th Anniversary Telethon Sep 20, 2025 Arnold Hall 23 Sep Teacher Workshop Day for Landscape Division Sep 23, 2025 Carousel Room Details Times: 9 AM to 1 PM 27 Sep St. Jude Children's Walk/Run to End Childhood Cancer Sep 27, 2025 Grounds Main Gate Details Link: https://fundraising.stjude.org/site/TR/Walk/Walk?fr_id=160942&pg=entry 28 Sep Pepsi Company Picnic (Private Event) Sep 28, 2025 Edwards Hall October 2025 3 Oct Float Build-out and Costume Distribution for Carnival Events Oct 3 - Oct 12, 2025 Fuchs Pavilion Edwards Hall 4 Oct Susan G. Komen's More than Pink Walk - NEW EVENT AT THIS VENUE Oct 4, 2025 Grounds Main Gate Details Link: https://www.komen.org/how-to-help/attend-events/ 11 Oct One Fete 2025 Oct 11, 2025 Arnold Hall Reilly Coliseum Details Link: https://www.eventbrite.com/e/one-fete-2025-tickets-1095738787209?msockid=16497e26ed7463df1d8f6c1becd362b0 12 Oct Miami Carnival Parade of Bands & Concert Oct 12, 2025 Grounds Main Gate Details Link: https://miamicarnival.org/ 17 Oct Miami Home Design & Remodeling Show Oct 17 - Oct 19, 2025 Arnold Hall Reilly Coliseum Fuchs Pavilion Main Gate Edwards Hall Fair Expo Grille Details Link: https://homeshows.com/home-show-dates-miami/ 21 Oct The Youth Fair's Liaison Dinner Oct 21, 2025 Blue Ribbon Room Details Start Time:  6 PM Free Praking 23 Oct PROS All Staff Meeting & Innovative Showcase Oct 23, 2025 Arnold Hall Fuchs Pavilion 25 Oct Ag Seminar – Poultry, Rabbits/Cavies Oct 25, 2025 Main Gate Details Main Gate, Sound end, 1st and 2nd Floors November 2025 1 Nov Florida Gun Shows Nov 1 - Nov 2, 2025 Arnold Hall Reilly Coliseum Fair Expo Grille Details Link: https://www.floridagunshows.com/ 8 Nov NAGA South Florida 2025 (Jiu Jitsu) - NEW EVENT AT THIS VENUE Nov 8, 2025 Fuchs Pavilion 8 Nov Jazz in the Heights - NEW EVENT AT THIS VENUE Nov 8, 2025 Grounds Blue Ribbon Room Carousel Room Main Gate Details More information coming soon! Free admission; Free parking. 13 Nov The Youth Fair's Superintendent Meeting Nov 13, 2025 Blue Ribbon Room Details DStart Time: 6 PM 13 Nov Garden Bros. Nuclear Circus Nov 13 - Nov 16, 2025 Grounds Details More info coming soon! 13 Nov South Florida Plumbing & Mechanical Trade Show - NEW EVENT Nov 13, 2025 Fuchs Pavilion Details Times: 3 PM to 8 PM 14 Nov The All Stars Tattoo Convention Nov 14 - Nov 16, 2025 Arnold Hall Reilly Coliseum Fair Expo Grille 21 Nov Feria Las Americas - ExpoNica Nov 21 - Nov 23, 2025 Arnold Hall Reilly Coliseum Blue Ribbon Room Edwards Hall Details Link: https://ferialasamericas.com/ 22 Nov Harvest in Miami Nov 22 - Nov 23, 2025 Fuchs Pavilion Details Link: https://harvestinmiami.com/harvest 28 Nov Nights of Lights Nov 28 - Jan 1, 2026 Grounds Details More info coming soon! December 2025 5 Dec Venezuela Legacy Tour - NEW EVENT Dec 5 - Dec 7, 2025 Arnold Hall Reilly Coliseum Fuchs Pavilion Details For more info: 561-947-4884 14 Dec More Info Coming Soon Dec 14, 2025 Fuchs Pavilion 19 Dec Commissioner Roberto J. Gonzalez's (District 11) Senior Holiday Event Dec 19, 2025 Blue Ribbon Room Carousel Room Details Times: 10 AM to 3 PM January 2026 3 Jan FGS - More Info Coming Soon! Jan 3 - Jan 4, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 6 Jan Fishing Gear Classes Jan 6, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 9 Jan The Vintage Mart - NEW EVENT Jan 9 - Jan 11, 2026 Fuchs Pavilion Details For more info:  info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 13 Jan Fishing Gear Classes Jan 13, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 16 Jan Tamiami International Orchid Festival Jan 16 - Jan 18, 2026 Fuchs Pavilion 20 Jan Early Check-In for Creative Writing, Child Development Books, World Languages & Fine Arts Jan 20, 2026 Arnold Hall Details North end of Arnold Hall, next to the Exhibits office. Times: 4 PM to 7 PM 20 Jan Fishing Gear Classes Jan 20, 2026 Main Gate Details Times:  7 PM to 9 PM Link: http://For Info: exhibits@fairexpo.com 24 Jan Volleyball Tournament Jan 24 - Jan 25, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Edwards Hall Fair Expo Grille 27 Jan Fishing Gear Classes Jan 27, 2026 Main Gate Details Times: 7 PM to 9 PM For info: exhibits@fairexpo.com 31 Jan Volleyball Tournament Jan 31 - Feb 1, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Edwards Hall Fair Expo Grille February 2026 3 Feb Fishing Gear Classes Feb 3, 2026 Main Gate Details Times:  7 PM to 9 PM For info: exhibits@fairexpo.com 4 Feb Miami-Dade County Retired Educators Association Event (Private) Feb 4, 2026 Blue Ribbon Room Details Times:  11 AM to 1PM 6 Feb Miami Grit Classic (Gymnastic Competition) - NEW EVENT AT THIS VENUE Feb 6 - Feb 8, 2026 Arnold Hall Reilly Coliseum Edwards Hall Details Link: https://miamigritclassic.com/ 10 Feb Fishing Gear Classes Feb 10, 2026 Main Gate Details Times:  7 PM to 9 PM For info: exhibits@fairexpo.com 13 Feb ShowBiz Dance Competition Feb 13 - Feb 15, 2026 Fuchs Pavilion 14 Feb FGS - More Info Coming Soon! Feb 14 - Feb 15, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 17 Feb Fishing Gear Classes Feb 17, 2026 Main Gate Details Times: 7 PM to 9 PM For Info: exhibits@fairexpo.com 19 Feb M-DCPS Technical College Career Expo Feb 19 - Feb 20, 2026 Arnold Hall Reilly Coliseum 28 Feb The Youth Fair - Security Orientation for Parking Staff Feb 28, 2026 Main Gate Details Mian Gate, North end March 2026 1 Mar The Youth Fair - Security Orientation for Non-Parking Employees Mar 1, 2026 Blue Ribbon Room Details Blue Ribbon Room at the R. Ray Goode Bldg (2nd Fl) 4 Mar Fashion Show Pre-Judging of Garments & Sketch Designs Mar 4, 2026 Arnold Hall Details Jack Griffith Playhouse inside Arnold Hall Times: 4 PM to 6 PM 4 Mar The Youth Fair's Guest Relations Orientation #1 Mar 4, 2026 Board Room Details Start Time: 6:30 PM To join the 2026 Youth Fair's guest relations team, please send email to scamilo@fairexpo.com. 6 Mar The Youth Fair's Guest Relations Orientation #2 Mar 6, 2026 Blue Ribbon Room Details Start Time: 6:30 PM To join the 2026 Youth Fair's guest relations team, please send email to scamilo@fairexpo.com. 11 Mar The Youth Fair's Guest Relations Walk-thru Mar 11, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Grounds Main Gate Edwards Hall Details 1st Walk-thru: 2 PM 2nd Walk-thru: 6 PM (One walk through is mandatory for guest relations team.) For more info: scamilo@fairexpo.com 12 Mar Miami-Dade County Fair and Exposition (The Youth Fair) Mar 12 - Apr 5, 2026 Arnold Hall Reilly Coliseum Fuchs Pavilion Grounds Blue Ribbon Room Carousel Room Main Gate Edwards Hall Board Room Fair Expo Grille Details The Youth Fair is ranked among the top 30 fairs in North America. In 2025, more than 540,000 guests attended the annual event. This adrenaline-filled 21-day event includes heart pounding rides, outrageous carnival food, livestock and agricultural competitions, concerts, blockbuster shows, student exhibits display and much more. Link: https://www.fairexpo.com/plan/tickets April 2026 18 Apr Great American Franchise Expo - NEW EVENT AT THIS VENUE Apr 18 - Apr 19, 2026 Fuchs Pavilion Details Link: https://www.franexpousa.com/ 24 Apr Maker Faire Miami - - NEW EVENT AT THIS VENUE Apr 24 - Apr 26, 2026 Fuchs Pavilion Details Link: https://miami.makerfaire.com/ 25 Apr FSG - More Info Coming Soon! Apr 25 - Apr 26, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille May 2026 1 May The Rare Plant Festival May 1 - May 3, 2026 Fuchs Pavilion Details Link: https://www.rareplantfestival.com/ 6 May Miami-Dade County Retired Educators Association Event (Private) May 6, 2026 Blue Ribbon Room Details Times:  11 AM to 1 PM 7 May PrimeTime Dance Competition May 7 - May 10, 2026 Fuchs Pavilion 30 May FGS - More Info Coming Soon! May 30 - May 31, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille June 2026 5 Jun The Vintage Mart - NEW EVENT Jun 5 - Jun 7, 2026 Fuchs Pavilion Details Fore more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 6 Jun MD-PROS Summer In-Service Training Jun 6, 2026 Blue Ribbon Room Details Times:  7:30 AM to 5 PM July 2026 18 Jul FGS - More Info Coming Soon! Jul 18 - Jul 19, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille August 2026 1 Aug The Children's Trust Family Expo Aug 1, 2026 Arnold Hall Grounds Details Free Admission. Free Parking. 7 Aug The Vintage Mart - NEW EVENT Aug 7 - Aug 9, 2026 Fuchs Pavilion Details For more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com September 2026 5 Sep FGS - More Info Coming Soon! Sep 5 - Sep 6, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille 16 Sep MD-PROS Recreation Training Sep 16, 2026 Edwards Hall October 2026 30 Oct The Vintage Mart - NEW EVENT Oct 30 - Nov 1, 2026 Fuchs Pavilion Details For more info: info@thevintagemart.com Parking is FREE! Link: http://www.TheVintageMart.com 31 Oct FGS - More Info Coming Soon! Oct 31 - Nov 1, 2026 Arnold Hall Reilly Coliseum Fair Expo Grille The Miami-Dade County Fair & Exposition, Inc. is not affiliated, nor does it endorse, any activity on its fairgrounds when licensing the use of its fairgrounds to a third entity. FACILITIES ARNOLD HALL & REILLY COLISEUM EDWARDS HALL E. DARWIN FUCHS PAVILION BLUE RIBBON ROOM & CAROUSEL ROOM MAIN ENTRANCE BUILDING THE FAIRGROUNDS UPCOMING EVENTS VIDEO CONTACT Sira Camilo Director Fair Expo Center (786) 315-5266 scamilo@fairexpo.com Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://k-12.careerfairexpo.com/",
      "text": "Diversity in Ed Virtual Recruitment Fair ‹ › × Diversity in Ed Virtual Recruitment Fair × Login Email: Cancel Login New user? Register now Forgot Password? Are you sure you want to cancel your registration? Cancelling your registration will remove your access to the event. If you proceed, you will no longer be able to participate or access event-related materials. Keep My Registration Cancel Registration Are you sure you want to delete account? Deleting your account will remove your access to the event. Keep My Registration Delete Registration × Reset Password Email / Username: New password: Confirm password: Cancel Update × Reset Password Email / Username: Cancel Reset × Diversity in Ed Virtual Recruitment Fair Need Technical Assistance? k-12@getvfairs.io Toggle navigation HOME ABOUT US FAQs NEED HELP? JOB BOARD EMPLOYERS LOGIN Employer Register Job Seeker Register CONTACT US Virtual Teacher Recruitment Fair & Interview Portal Thursday, April 10, 2025, from 3pm to 6pm, Central Time. Employer Register Job Seeker Register Login DIVERSITY in Ed Virtual Recruitment Fairs & Interview portal Diversity in Ed is a leader in virtual teacher recruitment fairs, connecting educators from diverse backgrounds with school districts and other educational organizations looking to build inclusive and diverse teaching teams. Our virtual recruitment fairs provide an opportunity for educators and school districts to connect and learn more about each other in a convenient and accessible online format. These fairs are designed to make the recruitment process more inclusive and equitable. All virtual fairs include… * live video interviews *real-time job board, and * online “match” networking BENEFITS FOR EDUCATORS INCREASE YOUR VISIBILITY Our virtual job fairs provide teachers of color with more opportunities to connect with schools that are actively seeking to diversify their staff. REDUCE THE BARRIERS TO ENTRY Our job fairs will make the career search process more accessible for teachers of color who may face barriers to attending in-person fairs, such as geographical distance or financial constraints. RECEIVE EQUITABLE ACCESS TO INFORMATION Our virtual job fairs provide teachers of color with more comprehensive information about the schools and positions available, allowing you to make more informed decisions about their job search. JOIN A COMMUNITY OF INCLUSION AND MAKE A DIFFERENCE The teachers of color in our network feel more motivated to attend our virtual job fair because they know that the schools are committed to diversity and equity, they feel more confident in their abilities to make a positive impact in the school community. FOR SCHOOLS & DISTRICTS ATTRACT a diverse pool of candidates through a seasoned, credible source. We will work closely with you to understand your recruitment needs and match you with talented educators from diverse backgrounds, cultures and languages. RECRUIT on a platform where educators from underrepresented groups come to connect with schools, districts and organizations that are committed to diversity, equity and inclusion. HIRE qualified and credentialed teachers of color—as it is not only a moral obligation, but also a business advantage that results in more effective decision-making, heightened employee involvement, and greater creativity. RETAIN the teachers from our network by SHOWCASING your commitment of fostering a positive school culture, providing mentorship and support, offering opportunities for teachers to give feedback and share concerns, AND creating opportunities for teachers to earn leadership roles. The Ultimate Sourcing Solution Diversity Recruitment Partners connect career-seeking candidates of diverse backgrounds, cultures and experiences with employers committed to recruiting and hiring a diverse workforce. What Our School & District Partners Are Saying \"The (April 15, 2020) Diversity in Ed Virtual Recruitment Fair was like no other as I had the opportunity to meet and speak with teacher candidates from across the nation. Everything from the aesthetic of the virtual fair to the overall support from the Diversity in Ed team was outstanding. I had over 200 booth visitors, many of which expressed interest in our district! I definitely recommend this education fair to all school districts interested in recruiting teacher talent!” Jason Acosta NYC Men Teach Diversity Recruitment Manager, New York City Department of Education \"When we think about diversity in education, we often think about diversity in ethnicity first and foremost, but DIVERSITY in Ed is also committed to expanding what diversity in education recruitment means. Diversity is also about diversity in strengths, approaches, and experiences. At the DIVERSITY in Ed Virtual Fair, the candidates we were able to attract were diverse in multiple ways, and our principals are very satisfied with the caliber of candidates.” Najjah Thompson Recruitment & Engagement Specialist , Madison Metropolitan School District What Our Job-Seekers Are Saying \"DIVERSITY in Ed introduced me to the company I was interested in working for, which was Mastery Charter Schools. On the job posting for the position I was pursuing, they stated they would be at the DIVERSITY in Ed Job Fair. I figured it would be a great opportunity to meet the recruiters for that position. So I registered, attended, and got the job I was looking for!\" Brittany J. Teacher Candidate (Hired by Mastery Charter School) \"Having exposure to many different districts from all over was great! I got to speak with representatives in real time. I made many connections and set up interviews during and after event. Recruiters are still contacting me.\" Lauryn H. Teacher Candidate 18 Virtual Recruitment Fairs on April 15, 2023 10am — 1pm (State specific time zone) Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login Learn More CANDIDATE REGISTRATION EMPLOYER REGISTRATION Login 2024 PARTICIPATING SCHOOLS & DISTRICTS (Please check back regularly for new updates, as school districts are registering on a daily basis.) Tucson Unified Grossmont Oroville Aurora Public Schools Poudre School District St. Anne’s Episcopal School Westgate Community School Waterbury Public Schools St. Coletta of Greater Washington AppleTree Institute for Education Innovation Jacksonville KIPP Miami Pinellas Sun Prairie School District Cherokee County School Distric Douglas County School System Forsyth County Public Schools Gwinnett County Public Schools Henry County Schools Wesleyan School Griffin-Spalding Co. Schools DeKalb County School District Columbia County School District Joliet Public Schools Matchbook Learning Dubuque Dream Center Academy Clark County Public Schools Tangipahoa Boston County Public Schools Springfield Public Schools Framingham Public Schools Lynn Public Schools South Middlesex Joseph P. Keefe Nantucket Public Schools International School of Boston Assabet Valley Regional Technical High School Springfield Public Schools Howard County Public Schools Baltimore County Public Schools Garrett County Allegany County Public Schools Allegany Public Schools The Bryn Mawr School Bay City Public Schools Interlochen Center for the Arts Minnetonka Public Schools Eden Prairie Schools St. Louis Language Immersion School KIPP NJ / Miami Clark County School District Baychester Middle School Lockport City School District Schenectady City Schools Harlem Children's Zone New York City Public Schools Prep for Prep Nuasin Next Generation Charter School Uncommon Schools Harrison Central School District Lakewood City Schools Coatesville Fox Chapel Norristown Allentown School District Charleston Charter School for Math and Science Charleston County School Distric Rutherford County Schools Fayette County Public Schools Leander North Texas Collegiate Academy Burlington Northwest Sun Prairie School District Fairfax County Public Schools Loudoun County Public Schools Prince William County Public Schools Alexandria City Public Schools Louisa County Public Schools Fauquier County Public Schools Virginia Beach City Public Schools Caroline County Public Schools Spotsylvania County Public Schools Newport News Public Schools Specialized Educational Services Stride Catapult Learning Rocketship Public Schools Aclipse CA Anne Arundel County Public Schools MD Arlington Public Schools VA Baltimore County Public Schools MD Barrow County Schools GA Bay City Public Schools Michigan CalWest Educators Placement CA Charleston Charter School for Math & Science SC Charlotte Mecklenburg Schools NC Cherokee County School District GA Clark County Public Schools KY Clark County School District NV Community Academy of Philadelphia Charter School PA Duval County Public Schools FL+ DC Public Schools Washington, DC Fairfax County Public Schools VA Fauquier County Public Schools VA Forsyth County Schools GA Framingham Public Schools MA Garland ISD TX Gwinnett County Public Schools GA Hartford Public Schools CT Hopkinton Public Schools CT International School of Boston MA KIPP Colorado CO KIPP and Miami NJ, FL KIPP Public Schools Northern California CA KIPP Capital Region Public Schools New York Laurens 55 School District SC Lockport City School District NY Loudoun County Public Schools VA Lynn Public Schools MA Mendham Township School District NJ Norwalk Public Schools CT Novi Community School District MI New Story Schools Maryland Prodeo Academy Minnesota Palatine CCSD #15 IL Pendergast School District AZ Poudre School District CO Prince George's County Public Schools MD Prince William County Schools VA San Mateo Foster City School District CA Santa Maria-Bonita School District CA School District of Indian River FL St. Coletta of Greater Washington DC St. Johns County Public Schools FL St. Martin Parish Schools Louisiana St. Mary's County Public Schools MD St. Tammany Parish Public Schools Louisiana Wesleyan School GA Scholarus Learning MI AppleTree Early Learning Public Charter Schools DC Widefield School District 3 CO The Cannon School NC Baychester Middle School NY Issaquah School District WA New Hampton School NH Carney, Sandoe & Associates MA Cliffside Park School District New Jersey The Nueva School California Eden Prairie Schools MN Brooke Charter Schools MA UP Education Network MA Volusia County Schools FL Charleston County School District South Carolina KIPP Delta Arkansas Camino Nuevo Charter Academy California School District of Palm Beach County Florida Erie's Public Schools Pennsylvania Aurora Public Schools Colorado Academy of the Pacific Rim Charter School (Massachusetts) Appletree Institute (DC) Achievement First (Connecticut) Achievement Prep Public Charter School (DC) Amethod Public Schools (California) Alaska ALEXANDRIA CITY PUBLIC SCHOOLS (Virginia) Amber Charter Schools (New York) ALASKA Anoka-Hennepin School District (Minnesota) AURORA PUBLIC SCHOOLS (Colorado) BALTIMORE CITY PUBLIC SCHOOLS (Maryland) BALTIMORE COUNTY PUBLIC SCHOOLS (Maryland) Blackstone Valley Prep (Rhode Island) BRIARWOOD SCHOOL (Texas) Boston Public Schools (Massachusetts) BROOKE CHARTER SCHOOLS (Massachusetts) Camino Nuevo Charter Academy (California) Capital City Prep (Connecticut) Capital City Public Charter School (DC) Capital Preparatory School (NEW YORK) + Cushing Academy (Massachusetts) CAROLINE COUNTY PUBLIC SCHOOL (Virginia) Chapel Crossroads Charter School (Missouri) Charlotte CHARTER HIGH SCHOOL FOR LAW AND SOCIAL JUSTICE (New York) CHEROKEE COUNTY SCHOOL DISTRICT (Georgia) CHESHIRE ACADEMY (Connecticut) City on a Hill Charter School (Massachusetts) CLARK COUNTY PUBLIC SCHOOLS (Nevada) Coletta COLLEGE ACHIEVE PUBLIC SCHOOL (New Jersey) Department of Defenece Education Activity DC Public Schools Eden Fairfax County Public Schools (Virginia) Fayette County Fayette FLORIDA VIRTUAL SCHOOL (Florida) FORSYTH COUNTY PUBLIC SCHOOLS (Georgia) FRAMINGHAM PUBLIC SCHOOLS (Massachusetts) GARLAND ISD (Texas) GARRETT COUNTY PUBLIC SCHOOLS (Maryland) GRANADA HILLS CHARTER (California) GWINNETT COUNTY PUBLIC SCHOOLS (Georgia) HARLEM CHILDREN ZONE PROMISE ACADEMY (New York) HARRISON CENTRAL SCHOOL DISTRICT (New York) HARRISONBURG CITY PUBLIC SCHOOLS (Virginia) HARTFORD PUBLIC SCHOOLS (Connecticut) HUNTER COLLEGE HIGH SCHOOL (New York) Indian iLead California Issaquah k12 Kansas KEEFE TECHNICAL SCHOOL (Massachusetts) Kent KIPP DC KERN HIGH SCHOOL DISTRICT (California) KING PHILIP REGIONAL SCHOOL DISTRICT (Massachusetts) Kipp (Massachusetts) KIPP MIAMI_NJ KIPP REGIONAL (New York) Lakewood LEGACY TRADITIONAL SCHOOLS (Nevada) LOUDOUN COUNTY PUBLIC SCHOOLS (Virginia) LOWELL COMMUNITY CHARTER PUBLIC SCHOOL (Massachusetts) LOYOLA HIGH SCHOOL OF LOS ANGELES (California) MADISON METROPOLITAN SCHOOL DISTRICT (Wisconsin) MAPLE LEAF EDUCATIONAL SYSTEMS (International)-png1676264661 MENDHAM TOWNSHIP SCHOOL DISTRICT (New Jersey) Minnetonka NEW HEIGHTS ACADEMY CHARTER SCHOOL (New York) New Visions for Public Schools (New York) New York Department of Ed (New York) NEWTON PUBLIC SCHOOLS (Massachusetts) NOTRE DAME HIGH SCHOOL (NDHS) (California) Nassau County Schools (Florida) PA VIRTUAL CHARTER SCHOOL (Pennsylvania) PINELLAS COUNTY SCHOOLS (Florida) Pendergast School District (Arizona) PLATO ACADEMY SCHOOLS (Florida) POUDRE SCHOOL DISTRICT (Colorado) Prince George's County Public Schools (Maryland) Prince William County Public Schools (Virginia) PRINCETON CHARTER SCHOOL (New Jersey) REDWOOD CITY SCHOOL DISTRICT (California) Rooted Rutherford SAN MATEO FOSTER CITY SCHOOL DISTRICT (California) SCHOOL DISTRICT OF INDIAN RIVER (Florida) SCHOOL DISTRICT OF LEE COUNTY (Florida) Springfield Public Schools (Massachusetts) SOAR Elementary (Colorado) South ST. JOHN'S COUNTY PUBLIC SCHOOLS (Florida) ST. MARY'S COUNTY PUBLIC SCHOOLS (Maryland) Summit Public Schools (California) TEP Charter School (New York) Toledo Uncommon Schools (New York) WESTON PUBLIC SCHOOLS (Connecticut) Walnut Hill School for the Arts (Massachusetts) School District of Cudahy (Wisconsin) Bay City Public Schools (Michigan) Lighthouse Community Public Schools (California) Colonial Beach Public Schools (Virginia) Salem Academy (Massachusetts) Siena Catholic Schools of Racine (Wisconsin) AT EVERY EVENT Employer Exhibitors Live Professional Development Webinars Résumé Writing & Career Coaching Frequently Asked Questions Add Settings What is the Virtual Recruitment Fair? The Virtual Recruitment Fair is an online career fair platform that extends the opportunity for new and experienced job-seekers to connect with employers looking to recruit and hire diverse talent. (Mobile devices, tablets, laptops, and desktops are all compatible.) Am I eligible to attend the fair? Yes, every new and experienced, job seeking is welcomed. What are the benefits to job seekers? Find open career opportunities that match your interests and qualifications Upload resumes and other supporting documents for employers to review Review in-depth career and company information prior to virtual career fair to customize resumes Engage in real-time individual and group chats with recruiters Apply to jobs and schedule interviews It’s FREE to participate What can I do to prepare for a successful virtual recruitment fair? Review the organizations' profiles in advance. Develop a strategy - which employers do you most want to speak with? Prepare questions before joining a chat session, or if you prefer, you can review others' questions in the public chat. Write your elevator pitch, which you should strictly use in private interactions with employers (do not post these in the public chat room). Not all employers will send email invitations to their chat sessions so join the event and visit employers that interest you. You are welcome to visit any chat sessions during the fair. What does a successful career fair experience look like for a participant? Everyone's goals & outcomes will be different. Here are some possibilities: Research the employment market Determine which positions are a strong match for your background Submit job applications to employers' existing openings Secure an interview during or after the event Some employers use this forum for screening (and interviews take place afterward) while others conduct phone interviews, video interviews, or schedule in-person interviews during or after the event. Many employers make job offers to candidates found through the virtual career fairs. Important: Joining employers’ chat sessions is the first step in potentially securing a job offer. How do I register for the Virtual Recruitment Fair? Register at https://diversityined.vfairs.com or the state specific recruitment fair of your interest . Pre-registration is already open and will be open through the end of the day of the Career Fair. Register early to give yourself time to study the list of participating employers and opportunities. Upload your resume immediately after registering so employers will have access to it. Uploading your resume and/or cover letter is the first step in making your materials available to participating employers. After you upload your documents into the system, they are visible immediately for review by employers. Companies may begin screening resumes prior to the event and invite you to visit their specific chat sessions and/or schedule video interviews before, during, or after the event hours. What technology do I need to participate? Participants need only a computer and internet access to participate. Webcams, avatars, and photos are NOT required. Interactions between employers and participants will be primarily through text chatting. (Employers do have the ability to initiate one-on-one video chats with you. If this is the case, you should be dressed as if you were going on an interview. Make that first impression a good one! We also recommend you check what is visible behind you so that there is nothing to distract the recruiter.) Note: it is acceptable to indicate to an employer that you are unable to video chat, if this is not an option for you at the time of the request. For the best experience, participants should log on using an up-to-date version of Google Chrome (preferred) or Firefox from a desktop/laptop; these are required to be able to view/hear any multimedia broadcasts presented by employers. The most up-to-date versions of Safari, Internet Explorer 11, and Microsoft Edge will also work. What employers will attend the fair? Check out the list of registered employers. Employers will continue to register leading up to the Virtual Recruitment Fair, so make sure to check back for an updated list. Will there be job postings? Where can I find them? When logged into your account, click the Jobs tab. Review job postings and be informed about available positions and how to apply (and then you can formulate your questions for the chat room). Not all employers post positions. Who will be in the employer chat room? An employer will host a chat room where you and other participants can ask questions and converse. The organization representatives will be listed once you are in the room. Private chatting is also possible between participants and employers. Do actual interviews take place during the fair? Yes, but this is completely up to the employer. Some employers use this forum for screening (and interviews take place afterward) while others conduct phone interviews, video interviews, or schedule in-person interviews during or after the event. Many employers make job offers to candidates found through the virtual recruitment fairs. Important Note: Joining employers’ chat sessions is the first step in potentially securing an interview that may lead to a job offer. What if an employer wants to hold a video chat? You will need a webcam to participate in video chats or receive their audio/video broadcasts. If there are a number of attendees trying to chat at the same time, will there be a waiting list in order of who joined the session first? There is not a waiting list, just a natural ebb and flow of visitors. Recruiters may have a lot of traffic (just as in a live fair) and cannot reach everyone immediately. Remember that patience is highly appreciated by the recruiters and the right job is worth the wait! What are the benefits to employers and their Human Resources recruiters? Access a national pool of job-seeking candidates of bilingual and diverse backgrounds Manage your own company chat room and sessions with unlimited recruiters Interact with candidates as a group or privately Tool to conduct video interviews Access to search and screen resumes from database of registered candidates Company profile, logo, and job postings Technology to include pre-recoded video presentations and/or live presentations Save time, travel, and staff required to participate in all day, on-site events Eliminate transportation and overhead costs associated with booth design and production Is there a step-by-step guide for navigating the job fair platform? Yes, click Here to download the Detailed Navigation Guide Employer Registration Job Seeker Registration Login | | | | Privacy Policy | Terms of Service"
    },
    {
      "url": "https://www.wedding-spot.com/venue/5206/miami-dade-county-fair-and-expo-center/",
      "text": "Miami-Dade County Fair and Expo Center | Venue - Miami, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Miami Dade Country Fair and Exposition Report Miami-Dade County Fair and Expo Center 786-315-5266 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces BYO Valet parking Venue details Style: Banquet Hall/Restaurant, Event Center, Ballrooms, Outdoor Guest capacity: Accommodates up to 5000 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 10901 SW 24th Street Miami, FL 33165 Description: MIAMI'S BEST KEPT SECRET! Ideally located within Tamiami Park on Southwest 24 Street, the Miami-Dade County Fair and Exposition center offers blissful couples a diverse and lively setting to host a memorable wedding and reception. Located west of downtown Miami, this venue rises from the heart of South Florida as a spirited meeting place for local events. Constructed with several spacious spaces to tie the knot, every room within this venue is perfectly designed to meet your unique nuptial needs. For plenty of room to wed, dine, and dance into the evening, consider the Blue Ribbon Room, which includes audio and visual equipment for a spirited celebration. If you are planning an intimate gathering, consider the Carousel Room, best suited for a ceremony with your closest loved ones. For brides and grooms with large guest lists, this venue also features a variety of Hall type spaces to accommodate all your family and friends. A romantic and creative location to share your vows, the Miami-Dade County Fair and Exposition center is sure to exceed your expectations. Ample Free Parking. Three large air-conditioned halls are also available for events expecting over 400 guests. Lushly landscaped and immaculately maintained, the 86-acre site is available for rent and hosts a large variety of indoor and outdoor events. For more information or questions about bringing your event to the Fair Expo Center contact: Sira Camilo, Director of Sales & Business Development (se habla en español) at (786) 315-5266. READ MORE Additional details Service Options Venue notes The rental fee starts at $3,500  for a ceremony/reception and includes 5 hours of event time excluding set up and clean up time.  Additional event hours can be arranged for a fee of $150/hr. Amenities and Restrictions Amenities - Bride's dressing area - Dance floor - Podium and/or stage - Tables and chairs provided - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - BYO alcohol - Venue must approve all decorations - Catering provided by venue - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be served by licensed bartender/caterer - Music must end by 2:00AM - Approved caterers allowed Amenities - Bride's dressing area - Dance floor - Podium and/or stage - Tables and chairs provided - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot Restrictions - BYO alcohol - Venue must approve all decorations - Catering provided by venue - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be served by licensed bartender/caterer - Music must end by 2:00AM - Approved caterers allowed Links Miami-Dade County Fair and Expo Center 786-315-5266 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces BYO Valet parking STARTING AT $17,410 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 400 Max Outdoor capacity: 5000 Reception Indoor / Outdoor available Max Indoor capacity: 400 Max Outdoor capacity: 5000 STARTING AT $17,410 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://www.fairexpo.com/participate/performers",
      "text": "Miami-Dade County Fair and Exposition - performers March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Participate performers performers Interested in performing at The Youth Fair? The Jack Griffith Playhouse provides us with yet another platform to showcase local talent in the community. We also welcome school marching bands who want to perform for our guests. MARCHING BANDS CONTACT Sira Camilo Director, Fair Expo Center 786-315-5266 scamilo@fairexpo.com SHOWS CONTACT Michelle V. Pretto Director Marketing & Entertainment mpretto@fairexpo.com The Jack Griffith Playhouse Contact Claudia Hernandez Manager, Exhibits chernandez@fairexpo.com Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://www.fairexpo.com/participate/exhibits/students",
      "text": "Miami-Dade County Fair and Exposition - STUDENT EXHIBITS March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home Participate Exhibits STUDENT EXHIBITS STUDENT EXHIBITS ENTRY DEADLINES Entry Form Registration deadline is January 20, 2026. ARRIVAL DATES AND TIMES No pre-entry necessary for the following divisions. Please bring your completed entry form and completed works to Arnold Hall. No hand written forms will be accepted. All Creative Writing, all Child Development Books, including ESOL, World Languages and Fine Arts Tuesday, January 20, 2026 | 4-7 PM All Other Student Exhibit Divisions Check-In. Thursday, February 26, 2026 | 4-8 PM Saturday, February 28, 2026 | 10-4 PM RELEASE DATES AND TIMES All Student Exhibits Thursday, April 9, 2026 | 4-8 PM If you are unable to pick up your exhibits on April 9, 2026, please make arrangements to have someone else pick them up for you. Exhibits not picked up during check-out will be discarded on Friday, April 10, 2026, at 5:00 PM. All dates and times are subject to change without notice. ENTRY FORMS Download and complete fillable forms for hardcopy submissions. Email completed forms to exhibits@fairexpo.com . Entry forms may also be completed and submitted online. No hand written forms will be accepted. Apply Online Teacher Individual not to be used by teachers Club BSA Scouting, Girl Scouts and 4H ONLY Performing Arts Jack Griffith Playhouse Fashion and Sketch Design Culinary Fine Arts Resources DOWNLOAD STUDENT EXHIBITS HANDBOOK DOWNLOAD STEAM AT THE FAIR HANDBOOK ONLINE SUBMISSIONS ONLINE INSTRUCTIONS - INDIVIDUAL ONLINE INSTRUCTIONS - SCHOOLS CONTACT Claudia Hernandez Manager Exhibits chernandez@fairexpo.com Lisette Manzanares Administrator Exhibits lmanzanares@fairexpo.com Annie Febles-Vizcaino Assistant Exhibits afebles@fairexpo.com = Coming Soon Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    },
    {
      "url": "https://www.fairexpo.com/about/contact",
      "text": "Miami-Dade County Fair and Exposition - Contact Us March 12 - April 5, 2026 except March 16-17 & 30-31 Plan Your Visit Tickets Discounts and Deals Getting Here Schedule Field Trip Information Howdy Tours Things To See & Do Rides, Food & Games Entertainment Live Music Special Events Student & Community Showcase Participate Exhibits Sponsors Vendors Performers Volunteer Scholarship Fundraising Events Fair Expo Center Rental Facilities Book Your Event - Get Started Upcoming Events Pickleball About Mission Community Media & News Awards & Recognition Employment Contact Connect Refund and Privacy Statement Home About Contact Us Contact Us Miami-Dade County Fair & Exposition, Inc. 10901 Coral Way (SW 24 Street) Miami, FL 33165 Phone: (305) 223-7060 Fax: (305) 554-6092 Email: info@fairexpo.com Executive Eddie Cora President Julie Blanco Chief Operating Officer Sandra Rodriguez Executive Administrative Assistant Accounting & Finance Lori Penaloza Chief Financial Officer Livia Delgado Manager Finance Isabel Paulino Manager Accounting Business Development Ann Fernandez Manager Business Development Concessions Sylvia Cruz-Alvarez Manager Concessions Raquel Pozzoli Manager Food and Beverage Marjorie Suarez Manager Event Development Engagement & Development Claudia Uribe Senior Director Engagement & Development Exhibits Carol Douglass Director Exhibits Claudia Hernandez Manager Exhibits Lisette Manzanares Administrator Exhibits Anangely Febles Assistant Exhibits Fair Expo Center | Guest Relations Sira Camilo Director Fair Expo Center Information Technology David Olday Director Information Technology Marketing & Entertainment Michelle V. Pretto Director Marketing & Entertainment Iris Tunon Director Creative Services Nathalie Martinez Marketing Coordinator Operations Rosa Madruga Director Operations Pickleball Alex Mut Manager Pickleball Center Online Ticket Sales Etix For questions about online ticket orders, contact Etix at 1-800-514-3849 Rental Facilities Media About Contact Employment Refund and Privacy Statement Code of Conduct Minor Policy Sign up for our newsletter 10901 Coral way | miami, fl 33165 | 305.223.7060 © 2025 Miami-Dade County Fair & Exposition. All rights reserved. Scan using Snapchat"
    }
  ]
}