{
  "fuentes": [
    {
      "url": "https://www.falconfirepd.org/contact-us",
      "email": "falconfire@falconfirepd.org"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=1158863458763",
      "email": "proshop@falconsfire.com"
    },
    {
      "url": "https://www.golfpass.com/travel-advisor/courses/15371-falcons-fire-golf-club",
      "email": "info@hampton.golf"
    },
    {
      "url": "https://www.falconvalleygolf.com/contact/",
      "email": "fvalley@everestkc.net"
    }
  ],
  "mails": [
    "falconfire@falconfirepd.org",
    "fvalley@everestkc.net",
    "info@hampton.golf",
    "proshop@falconsfire.com"
  ],
  "nombre_sitio": "falconsfire.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.falconfirepd.org/contact-us",
      "text": "Contact Us - Falcon Fire Protection District Skip to main content Search: Go! Toggle navigation Home About Us Employment Stations and Apparatus Station 1 Station 2 Station 3 Station 4 Station 6 Administration District Map Staff FAQs Governance Notice of Cancellation Board Meetings Board Members Financial Documents Budget Documents Archive Financial Audits Transparency Accessibility Fire Safety Resources Current Burn Restrictions Burn Restriction Chart Wildfire Mitigation Builder/Developer Information Permit Information Hazardous Activity Permits Slash Pile Burning Recreational Fire Pits ISO Ratings Services Emergency Services Community Services Rural Address Sign Program Meeting Rooms Updates News Notices Calendar Contact Us Staff Links Contact Us Contact Us We look forward to hearing from you! You can reach us by filling out the form below: Your Name (required) Email (required) Message (required) There was a problem saving your submission. Please try again later. Please wait while your submission is being saved... Submitting... Submit Thank you, your submission has been received. Call us at: 719-495-4050 Our address is: 7030 Old Meridian Road, Peyton CO 80831 Email us at: falconfire@falconfirepd.org FFPD on Facebook Read more » Current Burn Restrictions Read more » Community Services The information in this section has a wide variety of resources available through the Falcon Fire Protection District and other organizations in El Paso County.  The Protection District offers classes… Read more » Copyright © 2025 Falcon Fire Protection District 7030 Old Meridian Road, Peyton CO 80831 Telephone (719) 495-4050 Privacy Policy District Transparency Website Accessibility Statement Powered by Streamline | Sign in × Search results Search: Go! Close"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=1158863458763",
      "text": "Falcon's Fire Golf Course | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Falcon's Fire Golf Course 3200 Seralago Boulevard 34746 Kissimmee, FL USA phone +1 407-239-5445 email proshop@falconsfire.com desktop_windows https://falconsfire.com Course: 18-hole course course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI Gold Blue Red White Par SI 1 4 -- 399 374 323 347 -- -- 2 4 -- 357 340 313 330 -- -- 3 3 -- 199 146 115 140 -- -- 4 5 -- 481 462 386 440 -- -- 5 4 -- 447 425 348 378 -- -- 6 4 -- 403 320 273 302 -- -- 7 5 -- 550 526 442 495 -- -- 8 3 -- 218 201 106 156 -- -- 9 4 -- 371 345 293 321 -- -- Out 36 3425 3139 2599 2909 36 10 5 -- 538 517 461 490 -- -- 11 3 -- 181 155 107 130 -- -- 12 4 -- 447 424 361 396 -- -- 13 4 -- 379 362 289 329 -- -- 14 5 -- 609 519 450 487 -- -- 15 3 -- 158 137 103 117 -- -- 16 4 -- 363 337 292 315 -- -- 17 4 -- 433 397 325 369 -- -- 18 4 -- 473 448 401 420 -- -- In 36 3581 3296 2789 3053 36 Total 72 7006 6435 5388 5962 72 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Falcon's Fire Golf Course in Kissimmee, USA. The golf course has 18 holes and its total par is 72 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://www.golfpass.com/travel-advisor/courses/15371-falcons-fire-golf-club",
      "text": "Falcon's Fire Golf Club in Kissimmee, Florida, USA | GolfPass Facebook Google Plus Bookmark Instagram Mail To LinkedIn Pinterest Tumblr Twitter Youtube magnify Bookmark Favorite greater than Quote Download Close Facebook Pinterest Google Plus Mail To LinkedIn Twitter Burger Menu Icon GP-badge-mobile Warning Arrow Pointing Right Golf Channel GolfNow COMPETE START FREE TRIAL Explore GolfPass Play Play Back Play GolfNow GolfNow Compete Member Benefits Learn Learn Back Learn Daily Video Tips School of Golf The Next Shot The Golf Fix Breaking Series Driving Iron Play Chipping Bunker Play Putting Fitness Instructors Tour Player Instruction Lessons with a Champion Golfer Top 100 Instruction Tips Watch Watch Back Watch Ask Rory 2025 Golf Gear Report Rory x Dude Perfect Perfect Fit My Roots My Daily Routine Ultimate Itinerary Travel Travel Back Travel Write A Review Golf Packages Gear News Golfers Choice 2025 Destinations Courses Near Me Course Directory Private Clubs Golf Resorts Member Benefits Free For You Earn $10 in Free Golf Partners Golf Channel GolfNow Compete Play GolfNow GolfNow Compete Member Benefits Learn Daily Video Tips School of Golf The Next Shot The Golf Fix Breaking Series Driving Iron Play Chipping Bunker Play Putting Fitness Instructors Tour Player Instruction Lessons with a Champion Golfer Top 100 Instruction Tips Watch Big Break Glam Golf with Blair O'Neal Ask Rory 2025 Golf Gear Report Rory x Dude Perfect Perfect Fit My Roots Travel Write A Review Golf Packages Gear News Golfers' Choice 2025 Destinations Courses Near Me Course Directory Private Clubs Golf Resorts Member Exclusives Get Daily Tips Sign In START FREE TRIAL Search Sign In START FREE TRIAL Search Official Sponsor Home / Courses / USA / Florida / Kissimmee Falcon's Fire Golf Club 3.6 2920 Reviews (2920) Facebook Twitter Email Facebook Twitter Email Facebook Twitter Email Facebook Twitter Email Rating Snapshot About Reviews Related Content Falcon's Fire Golf Club Book a Tee Time Rating Snapshot All Time Last 6 Months Last 12 Months Rating Index Rating 3.6 2920 Reviews (2920) 5 Stars 924 4 Stars 1060 3 Stars 558 2 Stars 228 1 Stars 150 Conditions 3.3 Value 3.6 Layout 4.3 Friendliness 4.1 Pace 3.8 Amenities 3.8 70.2% Recommend this course 2214 out of 2920 reviews Read Reviews Average Rating Avg Rating 2.9 166 Reviews (166) 5 Stars 24 4 Stars 35 3 Stars 40 2 Stars 37 1 Stars 30 Conditions 2.5 Value 3.0 Layout 4.1 Pace 3.6 Amenities 3.6 StaffFriendliness 3.9 45.8% Recommend this course 76 out of 166 reviews Read Reviews Average Rating Avg Rating 3.4 355 Reviews (355) 5 Stars 73 4 Stars 123 3 Stars 69 2 Stars 52 1 Stars 38 Conditions 3.0 Value 3.4 Layout 4.2 Pace 3.7 Amenities 3.8 StaffFriendliness 4.1 63.7% Recommend this course 226 out of 355 reviews Read Reviews About Holes 18 Type Public Par 72 Length 7006 yards Slope 135 Rating 73.2 The 18-hole Falcon's Fire Golf Club in Kissimmee, FL is a public golf course that opened in 1993. Designed by Rees Jones and Greg Muirhead, Falcon's Fire Golf Club measures 7006 yards from the longest tees and has a slope rating of 135 and a 73.2 USGA rating. The course features 4 sets of tees for different skill levels. The greens are tifdwarf bermuda and the fairways are bermuda grass. Falcon's Fire, a Rees Jones and Greg Muirhead signature masterpiece, is typically wide open, however, shot accuracy is essential. Fairways and greens are well bunkered, and water hazards are a common occurrence. Book a Tee Time at Falcon's Fire Golf Club Powered by GolfNow.com Book a Tee Time Satellite Layout Tees Tee Par Length Rating Slope Gold 72 7006 yards 73.2 135 Blue 72 6435 yards 71.0 130 White 72 5962 yards 68.5 126 Red 72 5388 yards 71.0 123 Track Rounds Scorecard Scorecard for Falcon's Fire Golf Club Metrics: yards meters Hole 1 2 3 4 5 6 7 8 9 Out 10 11 12 13 14 15 16 17 18 In Total Gold M: 74.1/138 399 357 199 481 447 403 550 218 371 3425 538 181 447 379 610 158 363 441 473 3590 7015 Blue M: 71.0/128 374 340 146 462 425 320 526 201 345 3139 517 155 424 362 519 137 337 397 448 3296 6435 White M: 68.9/121 W: 74.6/128 347 330 140 440 378 302 495 156 321 2909 490 130 396 329 487 117 315 369 420 3053 5962 Red W: 71.4/120 323 313 115 386 348 273 442 106 293 2599 461 107 361 289 450 103 292 325 401 2789 5388 Handicap 5 11 13 17 1 9 3 7 15 12 18 4 8 10 16 14 2 6 Par 4 4 3 5 4 4 5 3 4 36 5 3 4 4 5 3 4 4 4 36 72 Handicap (W) 3 5 13 17 7 9 1 15 11 12 18 10 8 4 16 14 6 2 Course Details Year Built 1993 Fairways Bermuda Grass Greens Ultradwarf Bermuda Golf Season Year round Architect Rees Jones (1993) Greg Muirhead (1993) Rentals/Services Carts Yes - included in green fees GPS Yes Clubs Yes Practice/Instruction Driving Range Yes Bunker Yes Golf School/Academy Yes Teaching Pro Yes Pitching/Chipping Area Yes Putting Green Yes Policies Credit Cards Accepted VISA, MasterCard, Amex Welcomed Metal Spikes Allowed No Food & Beverage Snacks, Restaurant Available Facilities Clubhouse, Banquet Facilities The Best Way To Book Is With GolfPass+ 10 rounds of waived fees $120 in tee time credits Tee Time Protection Redeem GolfPass points Reviews 3.6 2920 Reviews (2920) Reviewer Photos Beautiful club house. Photo submitted by 5SwBLytkb9x13btay2Vk on 04/03/2025 Photo submitted by MHKIDD on 11/27/2024 Photo submitted by MHKIDD on 11/27/2024 Photo submitted by MHKIDD on 11/27/2024 Photo submitted by MHKIDD on 11/27/2024 Photo submitted by DEEZ81 on 11/22/2024 Photo submitted by NaBar702 on 08/27/2024 Photo submitted by adrienmt on 07/07/2024 Photo submitted by adrienmt on 07/07/2024 Photo submitted by adrienmt on 07/07/2024 Photo submitted by u551149055 on 04/30/2024 Play to the left, anything to the right side will go into the water. Photo submitted by u000001200683 on 03/26/2024 Photo submitted by BByrnes66 on 08/23/2023 1st hole Photo submitted by rj1u81qXKl3Izw69Ej4C on 06/03/2023 1st hole view Photo submitted by rj1u81qXKl3Izw69Ej4C on 05/17/2023 Photo submitted by u3038493 on 05/08/2023 Near sunset on the 2nd tee Photo submitted by Djnazzaro on 04/03/2023 9th hole at dusk Photo submitted by Djnazzaro on 04/03/2023 Photo submitted by u3903913 on 02/04/2023 Photo submitted by soyburner911 on 01/01/2023 Photo submitted by u818203141 on 12/09/2022 Photo submitted by u000004020492 on 11/08/2022 Photo submitted by u000004020492 on 11/08/2022 Photo submitted by u000004020492 on 11/08/2022 Photo submitted by u000004020492 on 11/08/2022 Photo submitted by u000004020492 on 11/08/2022 Photo submitted by u000004020492 on 11/08/2022 Unbelievable! Photo submitted by u000001577005 on 03/22/2022 One of many greens! Photo submitted by u000001577005 on 03/22/2022 Photo submitted by GilBear on 02/09/2022 Photo submitted by u314162439811 on 01/16/2022 Photo submitted by u314162439811 on 01/16/2022 Photo submitted by u314162439811 on 01/16/2022 Photo submitted by u314162439811 on 01/16/2022 Photo submitted by Scarantinom on 01/07/2022 Photo submitted by Scarantinom on 01/07/2022 Photo submitted by Scarantinom on 01/07/2022 Photo submitted by gc1123433947 on 01/05/2022 Photo submitted by gc1123433947 on 01/05/2022 Photo submitted by gc1123433947 on 01/05/2022 Very green Photo submitted by rjbarabas on 07/04/2021 Nice hole Photo submitted by rjbarabas on 07/04/2021 Photo submitted by rjbarabas on 07/04/2021 Don't miss right... Photo submitted by thelandis on 02/22/2021 Photo submitted by u5077631 on 12/19/2020 Photo submitted by tviyaran on 11/21/2020 Photo submitted by gdacanuk on 10/01/2020 Photo submitted by Dewit2me69 on 09/24/2020 Photo submitted by Dewit2me69 on 09/24/2020 Photo submitted by Dewit2me69 on 09/24/2020 Photo submitted by soyburner911 on 09/19/2020 Photo submitted by u3331471 on 08/21/2020 Photo submitted by Baldybrown2 on 07/06/2020 Photo submitted by Baldybrown2 on 07/06/2020 Enjoying the round! Photo submitted by DanChristovich on 07/13/2018 8th hole par 3 Photo submitted by Suds3651 on 03/28/2015 Advanced Filters Overall Rating 5 Stars (924) 4 Stars (1060) 3 Stars (558) 2 Stars (228) 1 Stars (150) Recommended Yes (2214) No (696) Handicap 0-4 (53) 5-9 (243) 10-14 (366) 15-19 (299) 20-24 (106) 25+ (35) Don't Know (31) Age 18-24 (13) 25-34 (42) 35-44 (101) 45-54 (190) 55-64 (217) 65+ (328) Type of Golfer Beginner (69) Intermediate (1721) Advanced (802) Gender Male (720) Female (90) Clear Filters Filter Results Date of Play - Newest Date of Play - Oldest Review Date - Newest Review Date - Oldest Overall Rating - Highest Overall Rating - Lowest Helpful Review - Most RG392D6FD7961E55F357 Played On 08/24/2025 Reviews 2 Handicap 5-9 Skill Advanced Plays Once a week I Recommend This Course 3.0 Verified Purchaser First Time Playing Perfect weather Used cart Great layout This course could easily be a 5 star course with it's layout. Unfortunately the course needs to invest in a little thing called drainage. It was wet as expected considering it rained the night before. It's quite obvious they need to bring a drainage engineer into the fold. If they could do this, the course would be my favorite in the area. Conditions Fair Value Average Layout Excellent Friendliness Good Pace Average Amenities Good Difficulty Somewhat Challenging Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 09/01/2025 Good afternoon, Thank you very much for taking the time to provide feedback about your experience. Your comments and feedback are extremely important to us. We appreciate you pointing out the positive aspects of your experience, and appreciate even more your feedback on how we may improve. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are solely responsible. We are hard at work attending to your grievances, and hope to receive the opportunity to impress you in the future. Warmest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report oD6Ka5OQnIbA5JWBN8UR Played On 08/24/2025 Reviews 2 Skill Intermediate Plays A few times a week 2.0 First Time Playing Really rough shape I play a lot of cheap golf courses and was expecting a little upgrade from I’m used to, sadly it was the opposite. Most bunkers had knee deep puddles that looked they have been that way for a long time with grass growing it. Tons of weeds everywhere. The fairways were extremely sparse and muddy. Greens were better than fairways but not full with lots of sandy patches. Starter was sending out multiple groups of 2 behind a slow group of 4. All of the twosome’s were jammed up. Unless you can get a round for $15 I’d pass. Tons of better options. I wouldn’t play it again unless it hasn’t rained in the past 2 months. Conditions Fair Value Fair Layout Average Friendliness Good Pace Poor Amenities Poor Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/24/2025 Good afternoon, We apologize for any inconvenience caused by the course conditions during your visit. We are committed to maintaining high-quality playing surfaces and are actively addressing any issues to improve the overall condition of the course. Please email us at info@hampton.golf so we can discuss your experience and concerns in more detail. Your feedback is important to us. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report luisrafaelpr Played On 08/24/2025 Reviews 1 Skill Beginner Plays A few times a week 1.0 Previously Played Manager was Rude Shop was close when we arrived in the morning , no staff. The gentleman that had us go out without checking in said we’d be charged at the turn or the round would be free . No one informed us or gave us next steps . At the end of the round as I usually dominated home. Tyler call me rude and sarcastic treating me like a criminal. I proceeded to call him out on it and he said he would charge my card on file which I agreed to . He called me back in rude and sarcastic treating me like a non paying criminal when it was their fault that no one showed up to open up the pro shop. No apologies , just rude behavior and terrible customer service . He said he was the manager and he reported to no one , that I gave to reach out to the Hampton direction with any complaints. I have no problem paying for golf, I love golf and payed a lot of money playing… don’t need to be treated like a criminal . Dude has a superiority complex. Conditions Fair Value Poor Layout Good Friendliness Poor Pace Average Amenities Poor Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/24/2025 Good afternoon, We regret to hear about your experience with our staff. Providing exceptional customer service is a top priority for us, and we are disappointed to hear that we fell short of your expectations. We will address this internally to ensure that all our staff are providing courteous and attentive service to all our guests. Please get in touch with us at info@hampton.golf to discuss this matter in greater detail. We hope to resolve this matter promptly. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report Pierreperry14 Played On 08/23/2025 Reviews 2 Skill Intermediate Plays Once a week 1.0 Previously Played Absolute scam would not recommend this course to anyone in its current condition. The fairways were completely flooded, every bunker looked like a pond, and balls that were clearly hit in the fairway were getting lost in standing water. Honestly, the course was unplayable and should not have been open. On top of that, it was cart path only, which was never disclosed before arrival. We were only able to get through 8 holes before the rain made it impossible to continue. When I asked the manager about a refund, I was told they “knew it was going to be wet.” Instead of offering a proper rain check, they would only give a discount voucher that expires within the week, which is unreasonable for anyone who doesn’t live right around the corner. Overall, very disappointing experience, poor customer service, and a waste of money. Save yourself the frustration and play somewhere else until this course fixes both the conditions and the way they treat paying customers Conditions Poor Value Poor Layout Excellent Friendliness Fair Pace Poor Amenities Poor Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/24/2025 Good afternoon, Thank you for taking the time to provide feedback regarding your recent experience with us. We are saddened to learn of the challenges you encountered and would appreciate the opportunity to speak with you directly. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are responsible. Please reach out to us directly at info@hampton.golf . We look forward to hearing from you. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report erod12505 Played On 08/09/2025 Reviews 2 I Recommend This Course 4.0 First Time Playing Nice course when it’s dry Course was really nice but if it rained the night before it turns into a swamp in some places because of the poor drainage but other than that it was a nice course Conditions Average Value Average Layout Good Friendliness Average Pace Good Amenities Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/17/2025 Good morning, We are elated to hear that you had a satisfactory experience with us! We work tirelessly to ensure that our service and facilities are beyond your expectations upon arrival, as we believe in creating an environment that allows you to not only have a good time, but make lasting memories. Your positive feedback allows us to continue to build and grow with our consumer base so we can continue to optimize each special opportunity to make you happy. Thank you again for your business. Sincerely, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report u314161680526 Played On 08/05/2025 Reviews 6 Skill Intermediate Plays A few times a week 2.0 Verified Purchaser Previously Played Soggy track. Every time I play here it is the same problem. Course is always soggy. Some traps were filled with water. Small portions of the fairway are unplayable due to extremely wet conditions. The course layout is really nice and the staff are polite and friendly but I never seem to find the course in good playing condition. I live nearby and have tried different times of the year but the course is never up to par. Conditions Fair Value Fair Layout Good Friendliness Good Pace Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/10/2025 Good afternoon, Thank you very much for taking the time to provide feedback about your experience. Your comments and feedback are extremely important to us. We appreciate you pointing out the positive aspects of your experience, and appreciate even more your feedback on how we may improve. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are solely responsible. We are hard at work attending to your grievances, and hope to receive the opportunity to impress you in the future. Warmest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report u000004919039 Played On 08/04/2025 Reviews 1 Skill Advanced Plays A few times a week 2.0 Verified Purchaser Previously Played Beware You’re going to be hit into, there are no rangers out there. Also, played behind a 4-some including a 5yr old. It’s a tourist course where they buy 12 beers from the bar prior to their round. It’s not for the serious golfer. Conditions Fair Value Average Layout Fair Friendliness Average Pace Average Amenities Fair Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/10/2025 Good afternoon, Thank you for taking the time to provide feedback regarding your recent experience with us. We are saddened to learn of the challenges you encountered and would appreciate the opportunity to speak with you directly. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are responsible. Please reach out to us directly at info@hampton.golf . We look forward to hearing from you. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report Featured Find Out More >> Wcq3cwMJefqZqkzf14Kt Played On 07/29/2025 Reviews 3 I Recommend This Course 4.0 Previously Played Conditions Average Value Excellent Layout Excellent Friendliness Good Pace Good Amenities Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/03/2025 Good afternoon, Thank you for your review! We're thrilled to hear that you had a great time at our club. Our team works hard to create a memorable experience for all our guests, and we're glad we could make your visit special. We can't wait to see you again soon. Best regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report ocsportsnut Played On 07/29/2025 Reviews 33 Handicap 15-19 Skill Intermediate Plays Once a month I Recommend This Course 4.0 Previously Played Hot weather Used cart It's not horrible, but it's been in better shape Falcon's Fire is one of my favorite courses to play in Central Florida and it's usually in tip-top shape, but I was somewhat disappointed this time. I'm sure the issues had a lot to do with the weather, so I'm willing to give them a pass until Fall. The big issues were the greens as several are under repair. The greens were also incredibly slow and again, this could be because of the extremely hot weather and not wanting them to burn out. The only other thing that was really bad was, not refreshment cart on the course, luckily I'm always prepared for that now so I bring my own small cooler with Gatorade, but the two guys I was paired up with weren't prepared. Conditions Average Value Excellent Layout Excellent Friendliness Excellent Pace Good Amenities Good Difficulty Fairly Easy Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 08/03/2025 Good afternoon, Thank you very much for taking the time to provide feedback about your experience. Your comments and feedback are extremely important to us. We appreciate you pointing out the positive aspects of your experience, and appreciate even more your feedback on how we may improve. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are solely responsible. We are hard at work attending to your grievances, and hope to receive the opportunity to impress you in the future. Warmest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report gc1752041516 Played On 07/25/2025 Reviews 9 Skill Intermediate Plays Once a week 2.0 Verified Purchaser First Time Playing Poor conditions I am a 14 handicap and To start off range was closed. Our tee time was 9:15 we could tell the greens were cut but I have played many courses in Florida and I have seen fairways cut shorter. And 4 greens were ground under repair.Now the fairways were being cut so much grass clipping at times hard to find your ball in the fairway. The rough on the front 9 didn’t look like it had been cut in a week and could tell the last time the bunkers were raked. Lot better course to play in central Florida for 48.00 Conditions Poor Value Poor Layout Good Friendliness Good Pace Average Amenities Average Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/28/2025 Good morning, We're sorry to hear that you found the course conditions less than satisfactory. Maintaining excellent course conditions is a top priority for us, and we are actively working to address any issues to ensure a better experience for all our guests. If you could email us at info@hampton.golf, we would appreciate the opportunity to discuss your concerns further. Your satisfaction is our priority. Our Sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report NMLncrGqZzt3odND1PL8 Played On 07/25/2025 Reviews 1 I Recommend This Course 5.0 Verified Purchaser First Time Playing Conditions Excellent Value Excellent Layout Excellent Friendliness Excellent Pace Excellent Amenities Excellent Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/28/2025 Good morning, We're ecstatic to hear that you had a fantastic experience at our club! Our team strives to provide exceptional service and amenities, and it's wonderful to know that we hit the mark. We look forward to your next visit and another opportunity to impress you. Kind regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report u000003296543 Played On 07/25/2025 Reviews 16 Handicap 5-9 Skill Intermediate Plays Once a month I Recommend This Course 5.0 Previously Played Getting better Course is well on its way back. The problems are being addressed and I will be returning sooner than later. Greens are slow but smooth. Conditions Excellent Value Excellent Layout Excellent Friendliness Excellent Pace Good Amenities Excellent Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/28/2025 Good morning, Thank you very much for your wonderful review! We take great pride in our customer service and the experience we deliver. Receiving feedback of all kinds is very much appreciated by our staff as we strive to continue to maximize the opportunity you allow us to entertain, and satisfy our guests. However, receiving reviews like yours are the most rewarding, as they reinforce our tireless efforts to deliver an excellent product. Sincere thanks from our entire staff, and we hope to see you again soon. Kind regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report santipena1 Played On 07/19/2025 Reviews 3 Skill Intermediate Plays A few times a week I Recommend This Course 5.0 Verified Purchaser First Time Playing Conditions Good Value Excellent Layout Excellent Friendliness Excellent Pace Excellent Amenities Excellent Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/28/2025 Good morning, Thank you very much for taking the time to post this positive review. We place a premium on customer satisfaction. Receiving positive feedback like yours reinforces the investments we are proud to make in our phenomenal people and systems that we hope ensure the best possible experience for our guests. Thank you again, and we look forward to you visiting us again in the future. Warmest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report u000002161829 Played On 07/16/2025 Reviews 3 Skill Beginner Plays Once a week I Recommend This Course 5.0 Previously Played Conditions Excellent Value Excellent Layout Excellent Friendliness Excellent Pace Excellent Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/28/2025 Good morning, We are elated to hear that you had a satisfactory experience with us! We work tirelessly to ensure that our service and facilities are beyond your expectations upon arrival, as we believe in creating an environment that allows you to not only have a good time, but make lasting memories. Your positive feedback allows us to continue to build and grow with our consumer base so we can continue to optimize each special opportunity to make you happy. Thank you again for your business. Sincerely, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report Featured Find Out More >> H7IQ4KZQ5nC9N8Y5jGMP Played On 07/18/2025 Reviews 2 Handicap 15-19 Skill Intermediate Plays Once a week I Recommend This Course 4.0 Verified Purchaser Previously Played Well Worth It This course was a little rough last year but it seems to get better and better each time I play it. The staff is great. The marshal is very knowledgeable and the speed of play was great. I would love to see a cart girl though. It’s hot in Florida and we need hydration. Conditions Good Value Excellent Layout Excellent Friendliness Excellent Pace Excellent Amenities Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/21/2025 Good morning, Thank you for your review! We're thrilled to hear that you had a great time at our club. Our team works hard to create a memorable experience for all our guests, and we're glad we could make your visit special. We can't wait to see you again soon. Best regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report TWG12 Played On 07/19/2025 Reviews 1 Handicap 5-9 Skill Advanced Plays Twice a year I Recommend This Course 4.0 Verified Purchaser Previously Played Hot weather Used cart Conditions Good Value Good Layout Good Friendliness Excellent Pace Good Amenities Good Difficulty Fairly Easy Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/21/2025 Good morning, We're ecstatic to hear that you had a fantastic experience at our club! Our team strives to provide exceptional service and amenities, and it's wonderful to know that we hit the mark. We look forward to your next visit and another opportunity to impress you. Kind regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report t1835470635 Played On 07/17/2025 Reviews 1 Skill Intermediate Plays A few times a week 2.0 Verified Purchaser Previously Played Tired Great layout ! Unfortunately looking a bit tired Not the course that it used to be in previous years Conditions Fair Value Good Layout Excellent Friendliness Good Pace Excellent Amenities Average Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/21/2025 Good morning, Thank you for sharing your experience with us. We're sorry to hear that you found the course conditions below par. We understand how important course quality is to your enjoyment, and we are actively working to improve and maintain our course conditions to the highest standards. If you could please contact us directly at info@hampton.golf, we would appreciate the opportunity to discuss your concerns. Best regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report tonysue97 Played On 07/16/2025 Reviews 1 Skill Intermediate Plays Once a week 3.0 Verified Purchaser First Time Playing Course not up to standards The course was very dry, it had a lot of dead spots and the greens were very very slow, because they needed to be cut. The overall condition of the course was very poor. Conditions Fair Value Good Layout Excellent Friendliness Excellent Pace Excellent Amenities Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/21/2025 Good morning, We apologize for any inconvenience caused by the course conditions during your visit. We are committed to maintaining high-quality playing surfaces and are actively addressing any issues to improve the overall condition of the course. Please email us at info@hampton.golf so we can discuss your experience and concerns in more detail. Your feedback is important to us. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report emilad Played On 07/13/2025 Reviews 14 Skill Advanced Plays A few times a week I Recommend This Course 5.0 Conditions Good Value Excellent Layout Excellent Friendliness Excellent Pace Excellent Amenities Good Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/16/2025 Good morning, Thank you very much for your wonderful review! We take great pride in our customer service and the experience we deliver. Receiving feedback of all kinds is very much appreciated by our staff as we strive to continue to maximize the opportunity you allow us to entertain, and satisfy our guests. However, receiving reviews like yours are the most rewarding, as they reinforce our tireless efforts to deliver an excellent product. Sincere thanks from our entire staff, and we hope to see you again soon. Kind regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report danandags14 Played On 07/11/2025 Reviews 5 Skill Intermediate Plays Once a week 1.0 Verified Purchaser Previously Played Course OK customer service was shocking Paid fee all good asked for ice for ice bucket told not allowed own beverage you can buy from us or we have water station on course get a life it's a golf course back home in Scotland we would say who do you think yours are polite version found 3 water station on golf course plenty of water but no cups to drink from explain that ?and it was 104 degrees and to cap it all. After the round cart guy running after us for dollars first time I refused to tip, sorry forgot his name however starter was very professional and friendly. Playing providence tomorrow where I know I will be made to feel welcome and have plenty ice........ Conditions Average Value Fair Layout Fair Friendliness Poor Pace Excellent Amenities Fair Helpful (0) Not Helpful (0) Comment Share Report hamptongolf Commented on 07/13/2025 Good day, Thank you for taking the time to provide feedback regarding your recent experience with us. We are saddened to learn of the challenges you encountered and would appreciate the opportunity to speak with you directly. We place a premium on our staff’s attentiveness and diligence when it comes to each one of our customers and their individual experiences, for which we are responsible. Please reach out to us directly at info@hampton.golf . We look forward to hearing from you. Our sincerest regards, Hampton Golf Management Helpful (0) Not Helpful (0) Share Report 1 2 3 4 5 Next FAQ What is the address of Falcon's Fire Golf Club? Falcon's Fire Golf Club is located at 3200 Seralago Blvd, Kissimmee, Florida 34746, Osceola County. Is Falcon's Fire Golf Club open to the public? Yes, Falcon's Fire Golf Club is open to the public. What year did Falcon's Fire Golf Club open? Falcon's Fire Golf Club was built in 1993. Who designed Falcon's Fire Golf Club? Rees Jones (1993) and Greg Muirhead (1993) are the architects of Falcon's Fire Golf Club. What type of grass does Falcon's Fire Golf Club have? Falcon's Fire Golf Club has Ultradwarf Bermuda greens and Bermuda Grass fairways. What is the par of Falcon's Fire Golf Club The par of Falcon's Fire Golf Club is 72. What is the length of Falcon's Fire Golf Club The length of Falcon's Fire Golf Club is 7006 yards. What is the rating of Falcon's Fire Golf Club The rating of Falcon's Fire Golf Club is 73.2. What is the slope of Falcon's Fire Golf Club The slope of Falcon's Fire Golf Club is 135. What are the course conditions at Falcon's Fire Golf Club? Based on reviews, other golfers are saying that the course conditions at Falcon's Fire Golf Club are good. Business Tools for Golf Course Operators stars Add a GolfPass ratings badge to your website rss_feed Get RSS feed with the latest reviews for this course Nearby Courses View Tee Times Hawk's Landing Golf Club Orlando, Florida Resort 4.4637466457 1912 Write Review View Tee Times Waldorf Astoria Golf Club Orlando, Florida Public/Resort 4.4481028598 1926 Write Review View Tee Times Disney's Lake Buena Vista Golf Course Lake Buena Vista, Florida Resort 4.0788959878 1152 Write Review View Tee Times Celebration Golf Club Celebration, Florida Public 4.1855870104 3549 Write Review Grand Cypress Golf Club - Cypress Course Orlando, Florida Private/Resort 5.0 1 Write Review Tranquilo Golf Club at Four Seasons Resort Orlando Lake Buena Vista, Florida Resort 4.6396 222 Write Review View Tee Times Grande Vista Golf Club Orlando, Florida Resort 4.3142764706 1199 Write Review Grand Cypress Golf Club - Links Course Orlando, Florida Resort 3.6598833333 616 Write Review View Tee Times Disney's Palm Golf Course Lake Buena Vista, Florida Resort 4.3905397804 912 Write Review The Ritz-Carlton Golf Club, Orlando, Grande Lakes Orlando, Florida Resort 3.9381117647 466 Write Review The Legends at Orange Lake Resort Kissimmee, Florida Resort 4.4118833333 1221 Write Review View Tee Times Mystic Dunes Golf Club Celebration, Florida Public 3.7649539623 3183 Write Review Golf Packages Orlando Buddy Trip Golf Package FROM $97 (USD) ORLANDO, FL | Enjoy 3 nights' accommodation at The Fountains Resort Orlando and 4 rounds of golf at Celebration Golf Club, Orange County National, Shingle Creek Golf Club and Falcons Fire Golf Club. Hilton Vacation Club Mystic Dunes Orlando Stay & Play Package FROM $137 (USD) ORLANDO, FL | Enjoy 3 nights’ accommodations at Hilton Vacation Club Mystic Dunes Orlando and 2 rounds of golf at Mystic Dunes Golf Club. Reunion Resort Stay & Play Package FROM $207 (USD) KISSIMMEE, FL | Enjoy up to 5 nights’ accommodations at Reunion Resort and up to 4 rounds of golf at your choice of Reunion Resort – Nicklaus Course, Reunion Resort – Watson Course, Reunion Resort – Palmer Course, and Celebration Golf Course. Orlando Getaway Golf Package FROM $167 (USD) ORLANDO, FL | Enjoy 3 nights' accommodations at SpringHill Suites or TownePlace Suites and 3 rounds of golf at Celebration Golf Club, Orange County National, and Walt Disney World Golf. Best of Disney Golf Package FROM $107 (USD) ORLANDO, FL | Enjoy 2 nights' accommodation at Tuscana Resort Orlando and 3 rounds of golf at Disney’s Magnolia Golf Course, Palm Golf Course and Lake Buena Vista Golf Course. Featured Content Galleries The Watson Course thrills at the Reunion Resort & Club near Orlando, Florida A view from the 15th hole at Falcon's Fire GC Falcon's Fire Golf Club A view from the 15th hole at Falcon's Fire GC Like many golf courses in and around the Walt Disney World Resort area, Falcon's Fire has a stately clubhouse. No. 13 is not only Falcon's Fire Golf Club's most memorable, it may be the most dangerous. 4 Images Write Review 3200 Seralago Blvd, Kissimmee, Florida 34746, Osceola County (407) 239-5445 Course Website Course Layout Now Reading Facebook Twitter Email Facebook Twitter Email Ad Choices Privacy Policy CA Notice Terms of Use Contact Us FAQ Help Center Special Offers Stay Connected © Copyright 2025 GolfPass. All rights reserved. Sign In or Create Account Enter your email to continue Everything you need to golf Enjoy all these benefits with your account Unlock a free GolfPass account to earn GolfPass Points and instantly access curated video content Upgrade to GolfPass+ for tee time credits, waived fees, and ability to spend Points on qualifying tee times Fast, convenient tee time booking with the largest selection of tee times Access to our Golf family of brands including GolfNow and GolfNow Compete Home Search Memberships Library Account Clear Search Search Search Near Me"
    },
    {
      "url": "https://www.falconvalleygolf.com/contact/",
      "text": "Contact - Falcon Valley Golf Course Skip to main content Skip to footer Falcon Valley Golf Course Welcome To Falcon Valley Golf Course! Home Course Information About Us Course Video Course Photos FLYOVERS Scorecard Tee Times 2025 9-HOLE RATE INFORMATION Annual Passes Leagues Outings Outing ＆ Events Tournaments Contact Employment Application Course Phone : (913) 780-5976 Contact Contact Us Falcon Valley Golf Course 9801 Falcon Valley Dr Lenexa KS 66220 (913) 780-5976 fvalley@everestkc.net Paul McKeown Owner Dean Ralston Owner Employment application Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Phone Submit Footer Weather LENEXA WEATHER Visit Us Falcon Valley Golf Course 9801 Falcon Valley Dr. Lenexa KS 66220 Follow Us Contact Us Phone: (913) 780-5976 Email: fvalley@everestkc.net Copyright © 2025 Falcon Valley Golf Course All Rights Reserved. Powered by"
    }
  ]
}