{
  "fuentes": [
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "concertpa@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "courtney@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "darcie@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "finance@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "jill@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "lee@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "operations@prescottpark.org"
    },
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "email": "theatricalpa@prescottpark.org"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://www.childrensfestival.ca/about/staff-board/",
      "email": "info@childrensfestival.ca"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=13088",
      "email": "contactzapp@wearecreativewest.org"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=13088",
      "email": "zappsales@wearecreativewest.org"
    },
    {
      "url": "https://www.adelaidefestival.com.au/about/staff-and-board/",
      "email": "info@adelaidefestival.com.au"
    },
    {
      "url": "https://www.news-journalonline.com/story/news/2013/11/22/visual-arts-music-and-more-at-deland-fall-festival-of-the-arts/30644804007/",
      "email": "nrick.deyampert@news-jrnl.com"
    },
    {
      "url": "https://www.news-journalonline.com/story/news/2013/11/22/visual-arts-music-and-more-at-deland-fall-festival-of-the-arts/30644804007/",
      "email": "rick.deyampert@news-jrnl.com"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "aeaton-lewis@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "galdam@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "rdickie@mentalhealth.org.uk"
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "email": "smhaf@mentalhealth.org.uk"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "aeaton-lewis@mentalhealth.org.uk",
    "communications@communityartsmentorship.com",
    "concertpa@prescottpark.org",
    "contactzapp@wearecreativewest.org",
    "courtney@prescottpark.org",
    "culturalengagement@communityartsmentorship.com",
    "darcie@prescottpark.org",
    "finance@prescottpark.org",
    "galdam@mentalhealth.org.uk",
    "info@adelaidefestival.com.au",
    "info@childrensfestival.ca",
    "innovationliaison@communityartsmentorship.com",
    "jill@prescottpark.org",
    "lee@prescottpark.org",
    "managingdirector@communityartsmentorship.com",
    "nrick.deyampert@news-jrnl.com",
    "operations@prescottpark.org",
    "programcoordinator@communityartsmentorship.com",
    "rdickie@mentalhealth.org.uk",
    "rick.deyampert@news-jrnl.com",
    "smhaf@mentalhealth.org.uk",
    "sponsorship@communityartsmentorship.com",
    "theatricalpa@prescottpark.org",
    "zappsales@wearecreativewest.org"
  ],
  "nombre_sitio": "fallfestivaloftheartsdeland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.prescottpark.org/about/leadership",
      "text": "Leadership - Prescott Park Arts Festival FAQs For The Record My Account Cart Menu Events Concert Series Movies Theatre Camp ENCORE! Josie’s Family Jams Special Events Community Showcases All Events Season Passes Reservations How It Works Reserve a Spot Pre-Order Food Inclement Weather Policy Rain or Shine Series Season Program About Us Mission Our Timeline Leadership Join the Team Our Kitchen Theatrical Rentals Getting Here Contact Support Us Advertise Donate Get Involved Gift Cards People for the Park Sponsors Events Concert Series Movies Theatre Camp ENCORE! Josie’s Family Jams Special Events Community Showcases All Events Season Passes Reservations How It Works Reserve a Spot Pre-Order Food Inclement Weather Policy Rain or Shine Series Season Program About Us Mission Our Timeline Leadership Join the Team Our Kitchen Theatrical Rentals Getting Here Contact Support Us Advertise Donate Get Involved Gift Cards People for the Park Sponsors FAQs For The Record My Account Cart Prescott Park Arts Festival Leadership Prescott Park Arts Festival PO Box 4370 Portsmouth, NH 03802 Box Office Hours 10am to 4pm, Monday-Friday 603.436.2848 hello@prescottpark.org Staff Courtney Perkins Executive Director Lee Frank Director of Development Jill Pettigrew General Manager Darcie Champagne Marketing & Development Manager Alexa McNamara Site Manager Brock Piechota Operations Manager Ro Gavin Theatre Production Manager Tristan Law Concert Production Manager Kelsey Loomis Bookkeeper Board of Directors Tyler Goodwin Chair Goodwin Family Management CEO John Tabor Immediate Past PPAF Board Chair Portsmouth City Council Michael Harrison Co-Vice Chair Corporate Director & Advisor Elisabeth Robinson Co-Vice Chair Whole Life Health Care Board Certified Family Nurse Practitioner John P. Bohenko Treasurer City Administrator Saco, Maine Kelsey Kraus Secretary The Kane Company Director of Property Management Jack Blalock Civic Leader Caitlin Burke Boulos Company Partner Joseph Chase SCS Financial Managing Director, Private Client Group Michele Correnti Correnti Marketing Owner + Founder Mariah Erikson, Esq. Aland Realty Chief of Operations/Owner Andrew Hart Barrel One Collective Manager JoAnn Hodgdon PCGiT Founder, Vice President Jacob Levenson SNHU Business Process Manager Matt Marra Matt Marra Ventures & Advisory Angel Investor and Advisor Tod O’Dowd Avery Insurance Agency President Community Professionals Group Michele Correnti Chair, Community Professionals Group Correnti Marketing Owner + Founder Colton Cadarette Notoriot Founder & Producer Kelly Freitas A Good Pear Design Studio Co-Founder & Principal Designer Bryttnie Gillis Envision Group | Compass Real Estate NH & ME Real Estate Advisor Marta Robinson Sage Couch Counseling Owner Jessica Stack Stackable: Creative Marketing Collective Owner + Principal Liz Tosi Vital Design Senior Visual Designer & Department Manager Join our newsletter to keep up with all the Festival's offerings! Sign Up Events About Us FAQs Season Passes Support Us For The Record Reservations Box Office Hours: 10am to 4pm, Tuesday-Friday Call us: 603.436.2848 Send us a Message: hello@prescottpark.org Terms of Use Privacy Policy © 2025 Prescott Park Arts Festival. All rights reserved. | Prescott Park Arts Festival PO Box 4370 Portsmouth, NH 03802 Prescott Park Arts Festival is an independently operated 501(c)3 not-for-profit organization. This fiscally responsible festival is managed by a professional staff and volunteer Board of Directors. All contributions are tax deductible to the full extent allowable by law. Back to top."
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://www.childrensfestival.ca/about/staff-board/",
      "text": "Festival Event Staff & Board Members | Festival Team Members Skip to main content We notice that you’re using Internet Explorer, which is no\n\t\t\t\tlonger supported by Windows and may have difficulty displaying\n\t\t\t\tsome elements of our website. We recommend that you upgrade your browser . May 25 — May 31, 2026 Creatively Playful Menu Schedule and Shows Schedule and Shows On Site Activities Tickets Purchasing Tickets Planning Your Day Accessibility Location & Parking COVID Policy Schools First Time? Ticket Info School Ticket Festival Order Form Accessibility Planning Your Day at the Festival: For Teachers Location & Parking COVID Policy Spectacles Spectacles en français ABOUT About Us Contact Staff & Board Volunteer Info News Support Donate Sponsors and Partners Sponsorship Search Search Query Staff & Board Staff Members Katharine Carol Artistic and Executive Director She/Her/Hers Marika Kovalcikova Development Manager She/Her/Hers Joanne Da Silva Communications and Marketing Manager She/Her/Hers Leanne Zacharias Operations Manager She/Her/Hers Kelly Creelman Audience Services She/Her/Hers David Kerr (DK) Production Manager I celebrate all pronouns, my preference is DK Jessica Han Technical Director She/Her Lauren Palidwor Site Manager She/Her Alayna Y Volunteer Coordinator She/Her/Hers Vivian Qi Assistant Volunteer Coordinator she/her/hers Anika Vervecken Access Activator She/Her/Hers Jessica Hood Access Sidekick She/They elika mojtabaei Accessibility Sidekick She/Her Pengchao (Paul) Shao Deaf Consultant He/Him Tom Gatenyo Low Vision Youth Consultant He/Him Norah Gillen School & Information Administrator She/Her Marjolyn Dimapilis Digital Content Specialist She/Her Liam Taylor Operations Assistant He/She/They Ewa Borkowska Bookkeeper She/Her/Hers Wayne Stewart IT Consultant He/Him/His Board Members Natasha Jeshani Chair She/Her/Hers Kevin Campbell Treasurer He/Him/His Stewart McGillivray Secretary He/Him/His Cameron Wilson Member at large He/Him/His Clara Ruiz-Larrea Member at large She/Her Samad Raza Member at large He/Him/His Jason Dubois Member at large He/Him/His Grace Starke Member at large She/Her/Hers Christoph Clodius Member at large He/Him/His Rahima Kara Member at large Thank You To Our Sponsors Subscribe to our Newsletter Stay in the know! Subscribe to our email list today and get the latest news and updates. Name First Last Email (Required) I’d like to be subscribed to the following list (Required) General Public Info Teacher’s Info (K to 12) French Teacher’s Info (en français) Preschool Teachers Trivia Night Community Groups: Guides | Scouts | Camps | Clubs Email This field is for validation purposes and should be left unchanged. The Vancouver International Children’s Festival Society acknowledges that we create and work on the ancestral, traditional, stolen and unceded territories of the hən̓q̓əmin̓əm̓ speaking xʷməθkʷəy̓əm (Musqueam) and səlilwətaɬ (Tsleil-Waututh) people and the Sníchim speaking Sḵwx̱wú7mesh (Squamish) people. We acknowledge the on-going cultural genocides of Indigenous Peoples by Canada, particularly the atrocities committed against children. We commit to work with the Indigenous Peoples of this land to raise the voices of Indigenous children through creativity and play. Contact Info Monday to Friday, 8:30 am to 4:00 pm 604.708.5655 info@childrensfestival.ca Quick Links Schedule / Performers Tickets Support Us About Us Accessibility Statement Follow us! Facebook Instagram YouTube Read our Privacy Policy . Designed by Out-Smarts. Copyright 2025."
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=13088",
      "text": "ZAPP - Event Information - Fall Festival of the Arts - DeLand 2025 skip to content ZAPP - WHERE ARTISTS & ART FESTIVALS CONNECT MENU WHERE ARTISTS & ART FESTIVALS CONNECT Login Sign Up CLOSE WHERE ARTISTS & ART FESTIVALS CONNECT CLOSE Login Sign Up Events Calendar Events List Help Center About ZAPP ZAPP for Events ZAPP™ Software, LLC, powered by Creative West BACK TO EVENTS Event Information Fall Festival of the Arts - DeLand 2025 View Event Gallery BACK TO EVENTS View Event Gallery CONTACT EVENT Event Pages: (opens in a new tab) (opens in a new tab) (opens in a new tab) Location: {{location(event)}} (386) 734-4371 REQUIREMENTS: Accepted Application Types: Artist Images: 4 (a booth shot is required) Fee: (Application Fee): $45.00 Emerging Artists: This application accepts applications from emerging artists and has an emerging artist program or grant. This application accepts applications from emerging artists. This application does not accept applications from emerging artists. Time Remaining: The application deadline has passed. Favorite Event: Dates & Deadlines {{ event.application_start | moment(\"MMMM D, YYYY\") }} Open Date {{ event.jury_fee_early_end_date | moment(\"MMMM D, YYYY\") }} Early Bird Deadline {{ event.notify_date | moment(\"MMMM D, YYYY\") }} Notification Date {{ event.purchase_deadline | moment(\"MMMM D, YYYY\") }} Purchase Deadline {{ event.event_start | moment(\"MMMM D, YYYY\") }} Event Start {{ event.event_end | moment(\"MMMM D, YYYY\") }} Event End Select a link below to jump to that section GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS GENERAL RULES BOOTH REFUND JURY EVENT INFORMATION GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS Share (opens in a new tab) Share (opens in a new tab) View Legal Agreement Event Site Map Event Site Map Terms of Use Contact Us Help Center Commitment to Accessibility | Share Feedback 2004-2025© ZAPP™ Software, LLC | Creative West Events Calendar Events List Blog ZAPP for Events About ZAPP Help Center Contact Us 2025 ZAPP™ Software, LLC | Creative West | Terms of Use Commitment to Accessibility | Share Feedback Facebook icon and link for Zapplication Instagram icon and link for Zapplication Youtube icon and link for Zapplication Contact Email: contactzapp@wearecreativewest.org Your Name: Please enter your name. Email: Please enter a valid email address. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Subject: Please select a subject Image Upload Help Checkout Help Show Question Enhancement Suggestion Other Please select a subject Message: Please enter your message Close Send message Contact Email: zappsales@wearecreativewest.org Your Name: Please enter your name. Event Name: Please enter your name. Email: Please enter a valid email address. Phone: Please enter a valid phone number. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Message: Please enter your message Close Send message"
    },
    {
      "url": "https://www.adelaidefestival.com.au/about/staff-and-board/",
      "text": "Staff and Board - Adelaide Festival Please ensure Javascript is enabled for purposes of website accessibility First Release Tickets on sale now Close alert Skip to main content What's On Go to What's On page Donate Go to Donate page News Go to News page About Go to About page Go to your favourite events page What's On Go to What's On page Donate Go to Donate page News Go to News page About Go to About page Info Expand or collapse Info Request or download a program Youth & Education Digital Programs Open House Access Booking Info Support Expand or collapse Support Donate Festival Friends Chairman's Circle Opera Donor Circle Adelaide Festival Contemporary Commissioning Program Benefactors Arts Club The Literati Legacy Giving & Bequests Foundation Adelaide Festival Our Supporters Partners Expand or collapse Partners 2025 Partners AWW 2025 Partners Become a Partner About Expand or collapse About About the Festival About Writers' Week Archive Staff and Board Join our team Volunteer Sustainability About Adelaide Contact Us Staff and Board Staff and Board content Adelaide Festival Corporation Board Members Tracey Whiting AM (Chair) Alison Beare Tony Berg AM Leesa Chesser Councillor Mary Couros Brenton Cox Roy Yates (Government Observer) Staff Matthew Lutton OAM (2026 - 2028) Artistic Director Julian Hobba Executive Director Adelaide Writers' Week Louise Adler AM Director Brett McCallum Program Manager Programming Lesley Newton Head of Programming Kate Donnelly Senior Program Manager Kate Hillgrove Program Manager Toby Chadd Opera & Music Advisor Kylie King Producer, Classical Music Jess Thomas Program Executive, Opera Production Taren Hornhardt Head of Production Paige Goodwin Production Manager Mark Pennington Technical Manager Rohan Yates Production Logistics Manager Bruce Bolton Production Manager, Projects Paul McCarthy (PBM Enterprises Pty Limited) Risk Consultant Customer Experience Benita Healy Head of Customer Experience Carolina Rojas CRM & Data Manager Business Development Candice Arthur Head of Partnerships Hannah Bone Head of Philanthropy Alyssa Mason Sponsorship Manager Sheridan Borgas Sponsorship Executive Emanuel Auciello Donor Relations Executive Vee McGovern Philanthropy & Events Coordinator Marketing and Communications Michelle Reid Head of Marketing & Communications Kevin van der Zwaag Marketing Manager Charlie Pugsley Marketing Coordinator Julia McNab Graphic Designer Petrina Egan Publicist Sophie Gardner Publicist Finance and Corporate Services Karishma Reynolds Chief Financial Officer Michelle Tyson Clark Head of Governance & Strategy Zarina Yusop Finance & IT Manager Prue Miels Administration/Payroll Officer Kathryn McCloy Reception / Administration Assistant Subscribe to eNews Subscribe Subscribe Subscribe to get news, offers and more! First Name Last Name Email address Postcode Adelaide Festival News Writers' Week News SUBSCRIBE This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Thanks for subscribing! Adelaide Festival Facebook Adelaide Festival Twitter Adelaide Festival Instagram Instagram icon Adelaide Festival Tik Tok Adelaide Festival Youtube Adelaide Festival LinkedIn Contact Us Select a topic... Feedback Help Government Partners We acknowledge that the land we gather, work and learn on is the traditional land of the Kaurna Nation of the Adelaide Plains. We recognise their ongoing connection to place as the world's oldest continuous living culture and that this land has been a place of movement, music and storytelling for over 60,000 years. We take pride in honouring those traditions. Privacy Terms & Conditions Website design and development by Bravo! Subscribe to get news, offers and more! First Name Last Name Email address Postcode Adelaide Festival News Writers' Week News SUBSCRIBE This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Thanks for subscribing! Adelaide Festival Facebook Adelaide Festival Twitter Adelaide Festival Instagram Instagram icon Adelaide Festival Tik Tok Adelaide Festival Youtube Adelaide Festival LinkedIn"
    },
    {
      "url": "https://www.news-journalonline.com/story/news/2013/11/22/visual-arts-music-and-more-at-deland-fall-festival-of-the-arts/30644804007/",
      "text": "Visual arts, music and more at DeLand Fall Festival of the Arts Volusia's Carmen Balgobin named Superintendent of the Year by national organization News Sports Entertainment Opinion Advertise Obituaries eNewspaper Legals NEWS Visual arts, music and more at DeLand Fall Festival of the Arts RICK de YAMPERT rick.deyampert@news-jrnl.com More than 180 artists, 14 music acts, two stage performances and youth art activities will be part of the 21th annual DeLand Fall Festival of the Arts. The festival will be 10 a.m. to 5 p.m. Saturday Nov. 23 and Sunday Nov. 24 in downtown DeLand, mostly along Woodland Boulevard and West Indiana Avenue. Admission is free. For more information, call 386-738-5705 or go online at delandfallfestival.com. The festival will feature a juried fine art show with works in painting, glass, sculpture, jewelry, leather, photography, printmaking, wood, ceramics and fiber. “My Prodigal Child,” a comedic musical stage play by Andre Darby, will be presented at 7:30 p.m. Friday Nov. 22 at the Athens Theatre, 124 N. Florida Ave. Admission is free. The play tells the story of a woman who abandons her family for a life with her drug dealer boyfriend, while her prayerful mother refuses to give up on her. “Sacred Slave Stories,” performed by the Moore Dance Project of Winter Park, will be presented at 7:30 p.m. Saturday Nov. 23 at the Athens Theatre. Admission is free. The production’s modern dance vignettes were inspired by interviews of former African-American slaves, as documented by the Federal Writers’ Project from 1936-38. The performance will be followed by a dialogue with artistic director Dario J. Moore. A youth art exhibit will showcase more than 1,200 student artworks in the rotunda of Volusia County’s Thomas C. Kelly Administration Building, 123 W. Indiana Ave. Hands-on art activities for children will be held on the grounds of the administration building. Participation is free and children may keep what they make. Continuous dance and music performances by and-or for young people will be held at the Athens Theatre throughout the festival. Music artists, including folk, Americana and rock bands, will perform on two outdoor stages: the Main Stage at the courthouse on West Indiana Avenue, and the Pioneer Park Stage on East Rich Avenue. Here’s the schedule: Saturday Nov. 23 Pioneer Park 11 a.m. — Sam Pacetti 12:30 p.m. — The What Thing 2 p.m. — Good Graeff 3:30 p.m. — Beartoe Main Stage Noon — The Sh-Booms 1:45p.m. — Heckfire 3:30 p.m. — Thomas Wynn and the Believers Sunday Nov. 24 Pioneer Park 11 a.m. — The Rhapsody Wind Quintet 12:15 p.m. — The Cook Trio 1:30 p.m. — Passerine 3:30 p.m. — Canary in the Coal Mine Main Stage Noon — Paddington Ambush 1:30 p.m. — Beth Mckee 3:30 p.m. — Have Gun Will Travel The festival also will include music artists performing on the street throughout the event. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-journalonline.com. All rights reserved."
    },
    {
      "url": "https://www.mhfestival.com/about/contact/",
      "text": "Contact Us | Scottish Mental Health Arts Festival Skip to content Scottish Mental Health Arts Festival Home Events Explore News Get Involved About Join Newsletter About > Contact Us For general enquiries, please email us at smhaf@mentalhealth.org.uk or use the contact form below. Alternatively, if you know who you would like to contact, you can get in touch with the festival team using the contact details on this page. Arts and Events Manager Gail Aldam galdam@mentalhealth.org.uk 0141 226 9845 Arts and Festival Officer Rob Dickie rdickie@mentalhealth.org.uk 0141 226 9857 Arts Programme Officer Andrew Eaton-Lewis aeaton-lewis@mentalhealth.org.uk Contact Us Name (Required) First Last Email (Required) Enter Email Confirm Email Your Message (Required) Δ Events Explore News Get Involved About Contact Join Newsletter Scottish Mental Health Arts Festival © 2025 All rights reserved. Website by Pooka & Co Ltd. Cookie Policy (UK) Privacy Policy Terms of use Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    }
  ]
}