{
  "fuentes": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "hdadrass@chgboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "rchacon@mistralbistro.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "ainteriano@ostraboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "chunter@mistralbistro.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "ecalderon@moooburlington.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "eperez@mooobeaconhill.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "ibrooks@moooseaport.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "jgates@chgboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "jmarsal@ostraboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "kailee@lukendigital.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "larchambault@moooseaport.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "mdale@chgboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "mraffucci@sorellinaboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "mrandall@chgboston.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "nphelps@mistralbistro.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "pbaker@moooburlington.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "pchambers@mooobeaconhill.com"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "email": "tlamotte@sorellinaboston.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    }
  ],
  "mails": [
    "ainteriano@ostraboston.com",
    "chunter@mistralbistro.com",
    "ecalderon@moooburlington.com",
    "eperez@mooobeaconhill.com",
    "hdadrass@chgboston.com",
    "hero-contact@2x.jpg",
    "ibrooks@moooseaport.com",
    "info@rivervillegrill.com",
    "jgates@chgboston.com",
    "jmarsal@ostraboston.com",
    "kailee@lukendigital.com",
    "larchambault@moooseaport.com",
    "mdale@chgboston.com",
    "mraffucci@sorellinaboston.com",
    "mrandall@chgboston.com",
    "nphelps@mistralbistro.com",
    "pbaker@moooburlington.com",
    "pchambers@mooobeaconhill.com",
    "rchacon@mistralbistro.com",
    "tlamotte@sorellinaboston.com"
  ],
  "nombre_sitio": "fantasyroomfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    },
    {
      "url": "https://columbushospitalitygroup.com/about/who-we-are/",
      "text": "Who We Are - Columbus Hospitality Group | Boston, MA Skip to content Discover the newest Columbus Hospitality Group venture – serving up delicious, handcrafted pizzas, sandwiches, and more. Visit Gary’s Pizza to learn more! Home About Who We Are Community Press Our Concepts MISTRAL SORELLINA MOOO…. BEACON HILL OSTRA MOOO…. SEAPORT MOOO…. BURLINGTON XV BEACON THE INN @ ST. BOTOLPH Private Dining Gift Cards Donations Careers Jobs Contact Home About Who We Are Community Press Our Concepts MISTRAL SORELLINA MOOO…. BEACON HILL OSTRA MOOO…. SEAPORT MOOO…. BURLINGTON XV BEACON THE INN @ ST. BOTOLPH Private Dining Gift Cards Donations Careers Jobs Contact WHO WE ARE JAMIE MAMMANO Owner/ Chef From the day that Chef Jamie Mammano opened the doors to Mistral in 1997, his biggest culinary venture yet was destined to become a legend of the Boston dining scene. SEE MORE A graduate of the Culinary Institute of America in New York, Jamie established a reputation for himself amongst the country’s most highly-regarded chefs during stints at The Jockey Club and Le Pavillion Restaurant in Washington DC, as the chef for the United States Ambassador to Spain, and 10 years spent in the kitchens of the Four Seasons Hotel Company, where he honed his culinary skills at the company’s Washington DC, Seattle, Chicago and Boston properties. While serving as Executive Chef for the Four Seasons Hotel Boston, Jamie single-handedly catapulted its dining room, Aujourd’hui, to the #1 ranking in the Zagat Survey of Boston Restaurants in 1995, and soon after readers of Boston Magazine chose Aujourd’hui as the #1 restaurant in Boston and Condé Nast Traveler named it the #4 restaurant in the country. PAUL ROIFF Owner As one of Boston’s most acclaimed real estate developers, and known for pursuing projects that the real estate “establishment” has often deemed too daring SEE MORE Paul possesses a drive and vision for urban architectural splendor that has led to the renaissance of some of Boston’s most treasured communities. Paul, who has been working in the field of real estate since the age of 18, originally planned to pursue a career in music, but found himself being drawn towards a love for urban architecture. Throughout his career, Paul, who earned a baccalaureate and MBA from Boston University, and a JD degree from Suffolk Law School, has worked on the acquisition and renovation of Boston real estate in such diverse areas as historic rehabilitation, mill restorations, HUD projects, , the development of hundreds of residential lofts in Boston’s Leather district and the development of a luxury 28-acre beachfront cabana club in Florida In 1997, together with partners Jamie Mammano and Seth Greenberg, Paul built and became a co-owner of Mistral, a French/Mediterranean bistro located in one of his most successful developments, Boston’s Albert A. Pope Building. Quickly after the opening, Mistral was named one of the “Top 25 New Restaurants in America” by Esquire Magazine, “Sexiest Bar” by Food & Wine, and earned four “Best of Boston” awards from Boston Magazine. His first foray into the luxury hotel world, Paul renovated a 1903 Beaux Arts building to create XV Beacon in January of 2000. In developing the hotel, Roiff adhered to the vision of a classic and elegant environment combined with modern style that would provide an unforgettable service experience for travelers, as well as a culinary destination, The Federalist, with an atmosphere reminiscent of the world’s most prestigious private clubs. Paul followed up the success of Mistral and The Federalist, which is now Mooo, with three other restaurants: Sorellina in January 2006 and L’Andana in 2007, which he owns in conjunction with Jamie and The Columbus Hospitality Group. The latest additions to CHG are The Inn at St. Botolph, a limited service boutique hotel & the sister property of XV Beacon, and Ostra, a contemporary Mediterranean seafood restaurant. Serving as president of Heath Properties, a real estate development and finance company, Paul has also served on the board of directors of a professional software company, and as a director of Capitol Bancorp in Boston. SETH GREENBERG Owner With over twenty years of experience acquiring and developing high-end hotel, restaurant and nightlife properties in New York, Boston and Miami, Seth Greenberg is regarded as one of the premiere impresarios of today’s hospitality industries. SEE MORE Greenberg began his illustrious career at the age of seventeen as a promoter of fashionable private parties in nightclubs, ballrooms, and event facilities in the Boston area. Soon after graduating from Boston University, Greenberg purchased and successfully launched a number of the city’s most popular nightlife properties, including the Paradise, a venue credited with giving vital early exposure to then-up and coming acts such as U2 and the Red Hot Chili Peppers, and M-80 playing host to some of the city’s most fashion-forward socialites. Following a successful string of over twelve nightclub ventures along the East Coast, Greenberg shifted his focus to developing high-end hotels and restaurants. In 1997, Greenberg established himself as a respected restaurateur with the opening of Mistral, a French-Mediterranean inspired restaurant in Boston. He also participated in the development team for the award winning XV Beacon Hotel in 1999. In November 2002, Greenberg once again showcased his talent and vision by successfully debuting his first New York City venue, the resplendent Stanford White-designed ballroom and event space, Capitale. Through the purchase and renovation of the historic Bowery Savings Bank, a Beaux-Arts building constructed in the 1890s, Greenberg established Capitale as one of New York’s most distinguished fine dining and event spaces. Celebrities, fashion designers, models, socialites, entertainers and politicians alike have all congregated at Capitale to celebrate at one of the venue’s many exclusive parties. Clients and guests include Virgin Airlines, Elton John, Marc Jacobs, Louis Vuitton and Angelina Jolie. In 2007, Greenberg expanded his catering infrastructure in New York by developing Espace, a 20,000 sf. event space in the beautiful new Atelier Tower in midtown Manhattan. In 2009, Greenberg completed the development of the Ames Hotel located in the historic Ames Building in Boston with his longtime friend, Richard Kilstock. The Ames Hotel is a joint venture with Normandy Realty Partners. In 2010, Greenberg finalized an agreement with Marriott Hotels to develop restaurants in their properties. His first project, 1500 Degrees, a Farm to Table Dining Concept received the Esquire Magazine award for Best New Restaurant in America. Greenberg’s latest project, Bastille Kitchen, is slated to open in summer 2014 in Boston’s Innovation District. In addition to his hotel and restaurant ventures, Greenberg is co-founder of Boston Common; a magazine developed by Niche Media, LLC, a robust lifestyle publishing company whose other titles include Hamptons, Gotham, Aspen Peak and Los Angeles Confidential. Mr. Greenberg is the recipient of The Boston University Young Alumni Council Award (2002) for his achievements, character, and continued support of the University. He remains a sponsor of Boston University’s School of Management. Additionally, he is a co-founder of the Center for Jewish Discovery in Manhattan. Please visit the appropriate web link below for all current projects. JEFFREY GATES Chief Operations Officer Jeff Gates is a distinguished figure in Boston’s dynamic culinary scene, celebrated for his innovative approach to hospitality, commitment to fostering a vibrant staff culture, and expertise in successful restaurant operations. SEE MORE With a deep passion for crafting unforgettable dining experiences and a sharp focus on innovation, Jeff has made an enduring impact on the city’s gastronomic landscape. While pursuing a degree in mechanical engineering at Northeastern University in Boston, he developed a profound appreciation for staff culture, food, and hospitality through his part-time roles as a dishwasher, busboy, and server at Davio’s original Newbury Street location. Following his engineering studies, Jeff embarked on a remarkable 40-year career in hospitality, holding positions ranging from manager and general manager to director and group owner. Gates’ entrepreneurial spirit and unwavering pursuit of excellence led him to play integral roles in the development and launch of Mistral restaurant, as well as the founding and leadership of The Aquitaine Group of restaurants. More recently, he has provided consultancy services to GTI Properties for their hospitality holdings and to US Foods for restaurant operations. Through his focus on understanding the people, products, and financial aspects of each restaurant project, he has been instrumental in bringing innovative design, creative culinary offerings, and impeccable service to the greater Boston and New England dining scene. Throughout his career, Jeff has consistently pushed the boundaries of restaurant management, prioritizing product quality, staff development, guest service, and financial control. Whether overseeing quick-serve cafes or upscale steakhouses and bistros, each establishment under Gates’ guidance reflects his hallmark blend of operational excellence and genuine hospitality. In addition to his professional endeavors, he has been actively engaged in industry associations, having served as Chair of the Massachusetts Restaurant Association and a lifetime board member, as well as a board member of the National Restaurant Association. Jeff is also the founder of Ureserv, an online reservation system, and remains committed to supporting local charities and community groups. Residing in Newton, Massachusetts, with his wife Jennifer, Jeff is the proud parent of three adult children, Abigail, Madeline, and Clark, and lovingly cares for his devoted canine companions, Leo and Lily. MITCHELL RANDALL Chief Culinary Officer Executive Chef Mitchell Randall discovered his passion for the culinary arts during his childhood years, assisting his mother in the kitchen of his Scarborough, Maine home. SEE MORE Learning the fundamental skills at such a young age created a unique culinary foundation that was formally developed at Johnson & Wales University in Providence, Rhode Island. Following graduation, he returned to Maine and became Sous Chef at the Tides Inn at Goose Rock Beach. In 2005, Chef Randall joined Mistral as Sous Chef and spent four years learning and mastering French-Mediterranean cuisine under Chef/Owner Jamie Mammano. At the age of 25, Chef Randall became the youngest Executive Chef in the Columbus Hospitality Group. Chef Randall left Mistral in October 2013 to open Ostra Restaurant with Chef Jamie Mammano. Growing up by the sea, Chef Randall was excited to take on this new culinary endeavor. Showcasing the finest seafood available locally and globally, Chef Randall’s light preparation of seafood highlights the natural and fresh flavors of each dish. In 2023 Chef Randall became  Columbus Hospitality‘s Chief Culinary Officer. His knowledge & insight help mentor chefs company-wide. Chef Randall believes the key element to running a successful kitchen is always improving himself and his staff. He maintains a hardworking atmosphere in all the kitchens at  CHG by setting an example with his staff. Chef Randall’s ambitious perspective, complemented by unparalleled experience and training has enabled him to consistently develop award-winning cuisine. When Chef Randall is not busy  creating  impressive dishes he is hunting, fishing, and visiting family in Maine MARK D'ALESSANDRO Operations Personality and passion are the twin hallmarks of Mark’s hospitality style. The details of attentive and individualized service are key, he says, to successful interaction with every guest. SEE MORE And as for passion, there is no substitute for an employee’s true attitude of ownership and responsibility. Mark exhorts his staff to assume a top-to-bottom approach to guest service so as to make a lasting impression each and every time. These dual principles of personality and passion were imbedded early in Mark’s career. A succession of ‘name brand’ learning experiences molded his professional development. Mark got his first taste of the epicurean world at Cardoos International Foods, a gourmet food shop in Boston (MA). Selling exotic foods, spices and coffees from around the world was a superb training ground for later employment with such established businesses as Legal Sea Foods, Sheraton Hotels, Skipjack’s, and Caffe Lampara. The 1980s were spent working in both Florida and Massachusetts, and the heady experience of opening new locations added to his broad knowledge and management skills. The depth and breadth of his background moved Mistral to hire Mark in 1996, and he quickly advanced from Assistant General Manager to General Manager, then in 2006 to Director of Operations for not only Mistral but all of the properties in the Columbus Hospitality Group [Sorellina, Mooo, L’Andana and Ostra]. Mark believes in building strong and long-term relationships with guests. He enjoys meeting people, and has a knack for remembering each guest and putting him or her at ease. He strives to instill this trait in all 175 front-of-house employees under his supervision. Among the training highlights, Mark stresses consistency of execution, continual growth, and boundless commitment to guest service. He bookends each guest experience with a strong opening – “a real sincere welcome right at the door” – and a memorable finish – “that appreciative acknowledgement and farewell is crucial to guest retention. Those basic tenets of a good time at the dinner table were introduced at Mark’s own family gatherings in his childhood. His Irish-Italian upbringing in Dedham (MA) offered ample opportunity to enjoy good cooking, celebratory feasts, and shared laughter. Today, he brings those early lessons of warm hospitality to a new level of sophistication. Whether it’s having a regular guest’s habitual cocktail ready and waiting, or calling a customer at home to reveal that Mistral’s famous truffle macaroni is back on the menu, he makes every guest feel special and singled out for personal attention. That is the essence of true hospitality. HOSHANG DADRASS Director of Hospitality In 2006, if one asked Hoshang Dadrass what he thought of restaurant business and hospitality, he would shrug it off as a thankless and uninspiring career choice. SEE MORE Little did he realize that his acquired love to value a guest’s absolute satisfaction would entice him to make a drastic decision to accept a duty as central as the General Manager of L’Andana Grill, and then Ostra. Born and raised in the north of Afghanistan, Hoshang’s teenage dreams were to follow in his father’s footsteps of practicing medicine. After graduating high school, Hoshang chose to attend pre-medicine at Boston University, where he quickly realized that his passion for medicine was merely a reflection of his father’s dreams and not his own. He, thus, majored in Chemistry in the hopes of one day becoming a teacher. While attending school, he also accepted a back-server/food runner position at Teatro. Because this industry had nothing to do with his career goals, it took Hoshang almost a year to begin to admire the hospitality business, where he realized the considerable feeling of gratification when a hard night’s work would be equally appreciated by his colleagues as well as the guests. His punctuality, eagerness to learn, willingness to assist at any time, and growing love for making the guests feel at home were being recognized by the management at Teatro. He was quickly promoted to a server and then a bartender. After almost seven years in the restaurant, when opportunity arose, the Columbus Hospitality Group took an immense chance and offered the responsibility to Hoshang as the General Manager of Teatro. With full support from the upper management, Hoshang soon proved that the company could have complete reliance on his leadership qualities. As soon as six months later, Hoshang was given another opportunity to run L’Andana. At L’Andana is where Hoshang truly fell in love with the hospitality business. His passion to ensure that his guests feel as if they are dining in their own home, being served from their own kitchen by one of their own, has been an integral part of building and maintaining an exceptional relationship with the local businesses as well as families. After serving over four years as the General Manager of L’Andana in Burlington, Hoshang once again found his way back to the city, taking over the managerial responsibilities at our sister restaurant, Ostra. Ostra’s chic decor and Mediterranean influenced cuisine suit Hoshang’s personality and his approach to hospitality. His evolution in this industry—from a skeptic to a genuine ambassador—has been the only constant in Hoshang’s career with the Columbus Hospitality Group. LISA FLORES Director of Sales and Marketing Lisa joined the Columbus Hospitality Group in 2001, after traveling from her native state of Texas, and completing her bachelor’s degree in Business Management from Boston University. SEE MORE After impressing General Manager Mark D’Alessandro and Chef/Owner Jamie Mammano, Lisa was quickly promoted from being a hostess to the Reservations Manager. In 2004, she was elevated again, to Special Events Manager for Mistral’s private dining room, le Salon du Mistral. As the Events Manager, Lisa planned and executed all private events for the restaurant, including full restaurant buyouts. Her commitment to establishing relationships with guests and bringing visions of celebrations to life, has created long-lasting, successful partnerships, spanning two decades. In 2008, Lisa was promoted to Director of Sales and Marketing, and began spearheading campaigns for the opening of each new restaurant and venue. Today, this includes Mistral,  Sorellina, Mooo Beacon Hill, Ostra, and our newest restaurants, Mooo Seaport and Mooo Burlington, as well as two hotel properties: XV Beacon Hotel and the Inn at St. Botolph . Recognizing the need for a more formal network of event planners within the restaurant industry, Lisa founded the Society for Event Planners: Restaurant Venues (SERV), in 2016. SERV aims to establish connections for people in the industry, so they can learn from one another and enhance their businesses. Meeting quarterly, members discuss topics such as the value of private events to a restaurant’s bottom line, marketing and public relations, and various challenges. SERV quickly caught the attention of dozens of top restauranteurs and planners in the area, increasing membership and gaining accolades from The Boston Globe and Boston Common Magazine . In 2017, following SERV’s success in Boston, Lisa expanded her outreach and began a second chapter in New York City. Beyond Lisa’s dedication to the event and hospitality industry, she has devoted her personal time to supporting causes that connect her to the community and inspire others. For more than a decade, Lisa volunteered and fundraised for Helping Hands: Monkey Helpers for the Disabled , a national non-profit, serving quadriplegics and people with mobility impairment, where she helped raise close to one million dollars. Her commitment to serving others has also driven her involvement in The Women’s Lunch Place and other local Boston charities. Gaining further attention for her impressive style, Lisa was featured in Boston Common Magazine’s Women of Style issue, and in the spring of 2019, Lisa joined the Board of Advisors for the Boston Ballet and took on the role of Auction Chair for the Boston Ballet Gala in 2021 and 2022. Today, Lisa is returning to her hospitality roots as an adjunct professor for Boston University’s School of Administration, teaching the Introduction to Food and Beverage Management Course. She hopes her experience and expertise will continue to inspire and encourage the next generation of industry professionals during this increasingly challenging time. Additionally, Lisa continues to assist in the expansion of the Columbus Hospitality Group. From concept and design to flawless project management, every experience Lisa creates is a true marriage of CHG’s promise and the guests’ vision of excellence. MARIA MAYER Wine Director New Hampshire native, Maria Mayer, is a seasoned wine & hospitality professional who has had the pleasure of working in some of San Francisco and Boston’s most well-regarded dining rooms. SEE MORE As an 18-year old college student, Maria took her first restaurant job as a hostess at CHG’s Mistral, a job which ignited a passion for the hospitality industry that continues to fuel her career today. Inspired by the commitment to excellence shown by Chef Jamie Mammano and then, General Manager, Mark D’Alessandro, Maria continued to work for CHG throughout her studies before moving to California and pursuing wine full-time. Maria’s formal education in wine took place at the San Francisco Wine School under the direction of Master Sommelier, David Glancy. Prior to returning to Boston and rejoining CHG, Maria worked for San Francisco based Omakase Group, where she was listed in Wine Spectator for her contributions to Michelin-starred Niku Steakhouse’s ‘Best of Award of Excellence’ award-winning wine list. Maria feels grateful each day to be able to share her passion for wine with guests and colleagues alike. Maria is a certified sommelier and holds a Master’s degree in Integrated Marketing Communications from Emerson College. She resides in Boston with her husband, Max, her dog, Reggie, and believes firmly that any occasion is the right occasion for champagne. SUZANNE KRIEGER CP-FS-Director of Purchasing and Special Projects Suzanne Krieger is a multifaceted professional whose journey has been marked by a deep passion for both the arts and culinary excellence. SEE MORE After graduating Magna Cum Laude with dual degrees in English and Fine Arts from Emmanuel College, Suzanne realized her true calling lay within the realm of the arts. Following her heart, she pursued culinary education at the prestigious Cambridge School of Culinary Arts. In 2008, Suzanne embarked on a career with CHG, starting as a Pastry Chef at L’Andana. It was during her time in the kitchen that she developed a profound interest in food safety, leading her to achieve her CP-FS (Certified Professional in Food Safety) accreditation from the National Environmental Health Association. This expertise propelled her into the role of ServSafe teacher and Proctor, where she began overseeing CHG’s Food Safety program with dedication and precision. Continuing her ascent within CHG, Suzanne took on additional responsibilities, including overseeing Purchasing, while still spearheading special projects focused on food safety education and oversight. Her commitment to excellence led her to collaborate closely with the top vendors in Massachusetts, ensuring CHG consistently procures the finest products available. Suzanne Krieger’s career exemplifies a harmonious blend of artistic passion and culinary expertise, driven by a relentless pursuit of excellence and a dedication to the highest standards of quality and safety. LEANDRO BARRETO CHG Controller Leandro Barreto is the Financial Controller for Columbus Hospitality Group and Heath Properties. SEE MORE After attending Law School in his native Brazil, Leandro found that his passion did not lie in Brazilian law and decided to study accounting. His carrier started with first employment working as a staff accountant at an Agricultural Cooperative in Ubirata, PR Brazil. In 2001, Leandro left Brazil seeking the “American Dream” and landed in Boston shortly before the horrific events of September 11, 2001. In the days and months following those events, Leandro could feel his life change dramatically and could feel in his core what it meant to be an American. A few years later, Leandro was sworn in as an American citizen. In 2004, Leandro joined the Columbus Hospitality Group as the Assistant Controller and then promoted to the Financial Controller of Columbus Hospitality’s sister company, Heath Properties. In 2016 , having proved his talent and expertise in accounting, Leandro was promoted once again to Financial Controller overseeing accounting for both Heath Properties and Columbus Hospitality Group. Over his more than two decades with CHG and Heath Properties, Leandro has become an instrumental part of the CHG and Heath Properties family and is known for his dedication, professionalism, and teamwork. He is grateful and extremely proud to be part of such a dynamic group whose goal is to provide people with an incredible experience, not only in the dining room, but also in the workplace. STAY IN TOUCH Let us keep you informed of seasonal menu changes and events. Quick Links Our Concepts Private Events Gift Cards © COPYRIGHT 2025  • DESIGNED BY LUKEN DIGITAL HOME About CONCEPTS DONATION REQUESTS CONTACT APPLY TODAY First Name Last Name Email Telephone Position Your Applying For Location Mistral Sorellina Ostra Mooo.... Beacon Hill Mooo.... Seaport Mooo.... Burlington First Available Location Upload Cover Letter & Resume Message Email To SEND SEAPORT OPEN TABLE BEACON HILL OPEN TABLE BURLINGTON OPEN TABLE SORELLINA OPEN TABLE OSTRA OPEN TABLE MISTRAL OPEN TABLE OSTRA BACK OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT OSTRA FRONT OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT MISTRA BACK OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT MISTRA FRONT OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT MOO FRONT OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT MOO BACK OF HOUSE POSITION UPLOAD COVER LETTER & RESUME SUBMIT CONTACT THE INN @ ST. BOTOLPH This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT SORELLINA This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT MISTRAL This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT OSTRA This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT XV BEACON This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT BURLINGTON This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT BEACON HILL This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT CONTACT SEAPORT This is a general inquiry form. For reservations, please CLICK HERE First Name Last Name Email Phone Number Message SUBMIT Home About Who We Are Community Press Our Concepts MISTRAL SORELLINA MOOO…. BEACON HILL OSTRA MOOO…. SEAPORT MOOO…. BURLINGTON XV BEACON THE INN @ ST. BOTOLPH Private Dining Gift Cards Donations Careers Jobs Contact mdale@chgboston.com Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    }
  ]
}