{
  "fuentes": [
    {
      "url": "https://business.charlottecountychamber.org/events/details/music-bingo-80-s-edition-at-fedora-s-cigar-wine-bar-8450?calendarMonth=2025-06-01",
      "email": "askus@charlottecountychamber.org"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "email": "info@creeksidecigarco.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://founderscigarco.com/",
      "email": "info@founderscigarco.com"
    },
    {
      "url": "https://business.charlottecountychamber.org/hotdeals/info/fedora-s-cigar-wine-bar-10-off-for-chamber-members-06-06-2025",
      "email": "askus@charlottecountychamber.org"
    },
    {
      "url": "https://boardroomcigarlounge.com/",
      "email": "info@boardroomcigarlounge.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/fedoras-cigar-and-wine-bar-punta-gorda",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/fedoras-cigar-and-wine-bar-punta-gorda",
      "email": "merchants@giftly.com"
    }
  ],
  "mails": [
    "askus@charlottecountychamber.org",
    "corporate@giftly.com",
    "info@boardroomcigarlounge.com",
    "info@creeksidecigarco.com",
    "info@founderscigarco.com",
    "merchants@giftly.com",
    "sales@finewineliquors.com"
  ],
  "nombre_sitio": "fedorascigarbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.charlottecountychamber.org/events/details/music-bingo-80-s-edition-at-fedora-s-cigar-wine-bar-8450?calendarMonth=2025-06-01",
      "text": "Music Bingo 80's Edition at Fedora's Cigar & Wine Bar - Jun 14, 2025 - History - Charlotte County Chamber of Commerce The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory Get in touch 555-555-5555 mymail@mailservice.com JOIN TODAY! The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory Music Bingo 80's Edition at Fedora's Cigar & Wine Bar Let’s Shake it UP!! Music Bingo at Fedora's Cigar & Wine Bar - 80’s Edition! Wear your best 80’s costumes to win a prize! Music Bingo is Saturday June 14th, from 7-9pm! Every round the winner wins a free drink! Music Bingo 80's Edition Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Date and Time Saturday Jun 14, 2025 7:00 PM - 9:00 PM EDT Saturday June 14, 7-9pm Location Fedora's Cigar & Wine Bar 2117 Tamiami Trail Punta Gorda, Florida FL 33950 Fees/Admission FREE Website https://fedorascigarbar.com/ Contact Information Fedora's Cigar & Wine Bar Send Email Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Business Directory Events Calendar Hot Deals Member To Member Deals Job Postings Contact Us Share × Print Email Add to Calendar Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Select Calendar Type × Google Yahoo iCal (Outlook, Apple, or other) Close 2702 Tamiami Trail Port Charlotte, Florida 941-627-2222 Fax: 941-627-9730 QUICK LINKS Home Chamber News & Events Home Location Payment FOLLOW US © 2025 Charlotte County Chamber of Commerce. All Rights Reserved. Site by GrowthZone Share by: // CM00330356"
    },
    {
      "url": "https://creeksidecigarco.com/pages/contact-us",
      "text": "Get in Touch With Us – Creekside Cigar Co Skip to content Pause slideshow Play slideshow Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year Voted PCA Best of the Leaf 2025 – Cigar Lounge of the Year . . . Site navigation Search Search Close Creekside Cigar Co Search Account 0 Cart . . . Site navigation Close Search Search Close Cigars New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Latest Release: Frontier Limited Edition HVC Edicion Especiales LE Merch Hats Accessories Watch Our Content Visit the Lounge Hours & Location Membership FAQ Join the Club Search Search Close Goes great with Quick shop Add to cart Crowned Heads Premium Sampler $55 00 $55.00 Quick shop Add to cart Foundation Wise Man Lancero Sampler $60 00 $60.00 Quick shop Sold Out Espresso Pairing Sampler from $65 00 from $65.00 Quick shop Sold Out Best with Bourbon Sampler $70 00 $70.00 Add order note Close Subtotal $0.00 Check out Shipping, taxes, and discount codes calculated at checkout. Your cart is currently empty. Cigars Expand submenu Cigars New Arrivals Expand submenu New Arrivals Las Calaveras Sampler Foundation Wise Man Lancero Sampler Aganorsa Brand Sampler OZ Family Karatoba Warped Corto Maduro Rojas Blue Bonnet Samplers Expand submenu Samplers View all Crowned Heads Premium Sampler Connecticut Sampler Habano Sampler Maduro Sampler Espresso Pairing Sampler Shop All Samplers Boxes Expand submenu Boxes Las Calaveras 2025 Robusto Jeremy Jack El Chapo Warped La Colmena Rodriguez Reserva Privada Avowed 'The Vow' Creekside Customs Expand submenu Creekside Customs Latest Release: Frontier Limited Edition Expand submenu Limited Edition HVC Edicion Especiales LE Merch Expand submenu Merch View all Hats Accessories Watch Our Content Visit the Lounge Expand submenu Visit the Lounge Hours & Location Membership FAQ Join the Club Confirm your age Are you 21 years old or older? No Yes Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Hours Sunday: 12pm-9pm Monday: 11am-9pm Tuesday: 11am-9pm Wednesday: 11am-9pm Thursday: 11am-11pm Friday: 11am-11pm Saturday: 11am-11pm Contact 513-630-1044 1381 US-22 Maineville, OH 45039 info@creeksidecigarco.com Lounge Address 1381 US-22 Maineville, OH 45039 Creekside Cigar Co. Privacy Policy Creekside Cigar Co respects your privacy. If you sign up for any of our engagement and outreach programs, including those that use SMS text messaging, we ONLY use information you provide to transmit your mobile messages and, upon request, respond to you directly. This includes sharing information with our program partners, message content providers, phone companies, and vendors who assist us in the delivery of mobile messages. EXCEPT AS SET FORTH IN THIS SECTION, WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER FOR PROFIT ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH PROGRAMS TO ANY THIRD PARTY. We do reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information at point of sale, you agree to provide accurate, complete, and true information. Subscribe today to hear first about our sales Enter your email Subscribe Subscribe Shop Cigars Merch Visit the Lounge Watch our Content Join the Club Customer Care Manage Subscriptions Contact Us FAQ Return Policy Shipping Policy My account About About Us Visit the Lounge Get in touch Email us Follow us Facebook Instagram TikTok YouTube We accept American Express Apple Pay Diners Club Discover JCB Mastercard Visa © 2025\n              Creekside Cigar Co\nNamed Lounge of the Year by PCA Best of the Leaf Awards 2025, located in Cincinnati, Ohio Privacy Policy Terms of Service Get in Touch With Us"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://founderscigarco.com/",
      "text": "Founders | Founders Cigar Company | Veteran Owned Cigars + Accessories Skip to content Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting Home Shop Cigars Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Legacy Blends Find A Retailer About Us Blog Contact Us Corporate Gifting $ 0.00 0 Cart Premium Cigars from a Veteran Owned, Top-Rated Cigar Brand Discover Our Small-Batch Blends from a Veteran-Owned Premium Cigar Brand Crafted for Character: Premium Cigar Blends You Can Buy Online or at your Favorite Cigar Shop Our cigars are from the Dominican Republic, rolled with care, and ready for you to enjoy with your friends and family. Hamilton Candela Franklin Connecticut Signature Dual Wrap Douglass Habano Roosevelt Maduro Premium Cigars Paired with Cigar Education + Community At Founders Cigar Company, we’re here to equip both seasoned cigar enthusiasts and those new to the cigar world with premium cigars from a top cigar brand you can trust. Whether you’re looking to buy cigars online for a special occasion or to enjoy your everyday ritual, our collection delivers bold flavor, consistent craftsmanship, and a legacy of excellence. We’re also passionate about education— our blog is packed with helpful guides on how to cut a cigar , light a cigar , and navigate cigar culture and etiquette with confidence. From first light to final draw, Founders is your go-to veteran-owned cigar brand for quality, knowledge, and community. Gift a Custom Cigar Box At Founders Cigar Company, we’ve created the ultimate custom cigar box—a premium gift that’s as personal as it is unforgettable. Whether you’re shopping for corporate gifting, groomsmen gifts, bachelor parties, or Father’s Day, our cigar box is designed to leave a lasting impression. Each handcrafted box includes 16 premium cigars from a top cigar brand, along with a high-quality cutter and lighter—everything they need to enjoy a perfect smoke. What makes it truly special? You can customize the lid with your logo, name, date, or personal message, turning it into a keepsake that’s both stylish and meaningful. Whether you’re celebrating milestones or building client relationships, Founders’ custom cigar box delivers quality, character, and craftsmanship in every detail. Order yours today. Ask Your Local Cigar Shop for Founders Cigars​ We love when cigar enthusiasts shop local—there’s nothing like enjoying a premium cigar from your favorite hometown lounge or retailer. If your local cigar shop doesn’t carry Founders Cigars yet, ask them to! As a veteran-owned premium cigar brand, we’re proud to be featured in cigar shops across the country, and we’d be honored to be on the shelves of your favorite spot. Whether you’re looking to buy cigars locally or help introduce a top cigar brand to your community, your support helps us grow and share our passion for premium cigars with more enthusiasts like you. Find A Retailer Near You! We Believe In Supporting Veterans + Local Communities At Founders, We Support Our Veterans Cigars Donated 0 Cigars Donated 0 About Founders Cigar Company Founders began with a small group of friends who started meeting weekly for bonfires and cigars in the early days of the 2020 pandemic. At a time when the rest of the world was shut down, cigars served as a surprising catalyst for connection. Today, we’re here to provide you with premium cigars and the cigar education you’re looking for. Building stronger cigar communities Join Our Newsletter Facebook Instagram Youtube Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Our Story Our Founders Cigars Cigars 101 & Blogs Cigars For Warriors Contact Become a Dealer Buy Our Cigars Locally Shipping Return & Refund Policy Privacy Policy Warranty Policy Shipping Return & Refund Policy Privacy Policy Warranty Policy Copyright 2024 © Founders Cigar Company, LLC. Designed & Built by : Bearded Cigar Lover Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://business.charlottecountychamber.org/hotdeals/info/fedora-s-cigar-wine-bar-10-off-for-chamber-members-06-06-2025",
      "text": "Fedora's Cigar & Wine Bar - 10% off for Chamber Members - Hot Deal - History - Charlotte County Chamber of Commerce The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory Get in touch 555-555-5555 mymail@mailservice.com JOIN TODAY! The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory 10% off for Chamber Members Offer Valid: 06/06/2025 - 12/30/2025 Purchase cigars at 10% off at Fedora's Cigar & Wine Bar Come to Fedora's Cigar & Wine Bar let us know you are a chamber member and receive 10% off your cigars! Fedora's Cigar & Wine Bar 2117 Tamiami Trail Punta Gorda FL 33950 (941) 621-8732 Send Email Visit Website This Hot Deal is promoted by Charlotte County Chamber of Commerce, Inc.. Business Directory Events Calendar Hot Deals Member To Member Deals Job Postings Contact Us Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel 2702 Tamiami Trail Port Charlotte, Florida 941-627-2222 Fax: 941-627-9730 QUICK LINKS Home Chamber News & Events Home Location Payment FOLLOW US © 2025 Charlotte County Chamber of Commerce. All Rights Reserved. Site by GrowthZone Share by: // CM00330356"
    },
    {
      "url": "https://boardroomcigarlounge.com/",
      "text": "The Boardroom Cigar Lounge Alienum phaedrum torquatos nec eu, vis detraxit periculis ex, nihil expetendis in mei. Mei an pericula euripidis, hinc partem ei est. Eos ei nisl graecis, vix aperiri consequat an. Memberships Video Join the board Memberships Video Join the board Memberships Video Join the board Members Only Cigar Lounge A Tradition of Conversation, Culture, and Connection At The Boardroom , we don’t just create spaces—we craft experiences steeped in tradition, camaraderie, and class. A sophisticated luxury lounge where like-minded community of ladies and gentlemen tribute to centuries-old traditions where leaders, thinkers, and entertainers shape culture. The Boardroom Memberships SILVER $6,000 Invitations to complementary & ticketed Special Boardroom Events Limited Access to Lounge Guest Privileges; Bring 1 colleague per month Join Now GOLD $11,000 Invitations to complementary & ticketed Special Boardroom Events Limited Access to Lounge Guest Privileges; Bring 3 colleagues per month Personalized Locker 1 Box of PBD’s Limited Edition Cigar Join Now PLATINUM $17,000 Invitations to complementary & ticketed Special & Exclusive VIP Boardroom Events Secret Access to All Areas of the Lounge Guest Privileges; Bring 5 colleagues per month Personalized Locker Priority Reservations for Private Events and Meeting Rooms 2 Boxes of PBD’s Limited Edition Cigar Concierge Services Join Now join the board! Please complete the application if you’d like to be selected for a membership. You will be notified once our Membership Committee has reviewed your completed application. First name Last name Your email Phone Number Address City State Zip Code Job Title Industry Favorite Cigar Favorite Beverage Referral Name Tell us why you want to join The Boardroom: Please leave this field empty. Δ The Boardroom HOURS OF OPERATION Monday - Saturday 3:00 pm - 10:00 pm Sunday 4:00 pm - 10:00 pm Location Fort Lauderdale, Florida Contact info@boardroomcigarlounge.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/fedoras-cigar-and-wine-bar-punta-gorda",
      "text": "Browse & Buy Online Gift Cards | Giftly Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Search for Any Business, Gift a Place they Love Gift up to $1,000 with the suggestion to spend it at nearly any business. Every Giftly is delivered in a customized greeting card by email, mail, or printout. Parrilla Peña 4 star Argentine in Buenos Aires Rodríguez Peña 682, Buenos Aires 4.4 (225) • $$ • Argentine Any Place in Buenos Aires B Anything they want, wherever they choose Buenos Aires B Universal Gift La Brigada 4 star Steakhouse in Buenos Aires Estados Unidos 465, Buenos Aires 3.9 (139) • $$$ • Steakhouses Your Favorite Place in Buenos Aires B Anything they want, wherever they choose Buenos Aires B Universal Gift Camping 4 star Bar in Buenos Aires Av. Pueyrredón 2501, Buenos Aires 3.7 (125) • $$ • Bars Ricas Empanadas 4 star Argentine in Buenos Aires Viamonte 715, Buenos Aires 4.3 (3) • $ • Argentine search Trustpilot Popular in Buenos Aires, B Gift up to $1,000 for one of these great places Parrilla Peña 4 star Argentine in Buenos Aires Rodríguez Peña 682, Buenos Aires 4.4 (225) • $$ • Argentine La Brigada 4 star Steakhouse in Buenos Aires Estados Unidos 465, Buenos Aires 3.9 (139) • $$$ • Steakhouses Camping 4 star Bar in Buenos Aires Av. Pueyrredón 2501, Buenos Aires 3.7 (125) • $$ • Bars Ricas Empanadas 4 star Argentine in Buenos Aires Viamonte 715, Buenos Aires 4.3 (3) • $ • Argentine Chila 4 star Signature Cuisine Av. Alicia Moreau de Justo 1160, Buenos Aires 4.4 (39) • $$$$ • Signature Cuisine El Mosquito 4 star Argentine in Buenos Aires Tte. Gral J.D. Peron 4499, Buenos Aires 3.9 (31) • $$ • Argentine Vive Café 5 star Coffee & Tea in Buenos Aires Costa Rica 5722, Buenos Aires 4.6 (25) • $ • Coffee & Tea La Ferneteria 5 star Bar in Buenos Aires Serrano 1349, Buenos Aires 5.0 (3) • Bars Moebius 5 star Bookstore in Buenos Aires Bulnes 658, Buenos Aires 4.8 (4) • $$$ • Bookstores 1 2 3 Next The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a  gift card with the flexibility of money. See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize Easy to buy online. Delivered now or later Send with a personalized greeting card 3 easy ways to redeem the gift Business Categories Travel Seafood Restaurants Shopping Men's Clothing Activities Outdoors Going Out Nail Salons Spa & Beauty See More Universal Giftly's Any Restaurant Any Restaurant Gift up to $1,000 and let them choose where to spend it. The thoughtfulness of a gift card with the freedom and flexibility of a Giftly. Buy an Any Restaurant Gift Any Store Shop ‘til they drop, anywhere they want 248k stores nationwide Universal Gift Any Nail Salon A mani-pedi at their favorite spot 27k nail salons nationwide Universal Gift Any Bar Drinks on you! Wherever they choose 32k bars nationwide Universal Gift Any Place Their favorite place, or a new spot Any location nationwide Universal Gift Featured Businesses Restaurants Tatiana By Kwame Onwuachi 10 Lincoln Center Plz, New York, NY 4.4 (529) • $$$$ • Caribbean Rocca 323 W Palm Ave, Tampa, FL 4.4 (620) • $$$ • Italian THE LOT Liberty Station 2620 Truxtun Rd, San Diego, CA 3.6 (1.9k) • $$ • Bars House of Prime Rib 1906 Van Ness Ave, San Francisco, CA 4.2 (9.9k) • $$$$ • American Marietta Square Market 68 N Marietta Pkwy NW, Marietta, GA 4.1 (158) • $$ • Food Stands Wolf By Vanderpump 18 Hwy 50, Stateline, NV 3.9 (650) • $$$ • American Hal's The Steakhouse 30 Old Ivy Rd, Atlanta, GA 4.0 (984) • $$$$ • American Born & Raised 1909 India St, San Diego, CA 4.1 (3.2k) • $$$$ • Steakhouses Costco Wholesale 26610 Ynez Rd, Temecula, CA 3.1 (18) • Hot Dogs Semma 60 Greenwich Ave, New York, NY 4.1 (569) • $$$$ • Indian Golden Steer Steakhouse Las Vegas 308 W Sahara Ave, Las Vegas, NV 4.1 (2.8k) • $$$$ • Steakhouses Your Dekalb Farmers Market 3000 E Ponce De Leon Ave, Decatur, GA 4.2 (1.5k) • $$ • Seafood Markets Le Diplomate 1601 14th St NW, Washington, DC 4.3 (5.6k) • $$$ • Brasseries Chez Francois Restaurant 555 Main St, Vermilion, OH 4.3 (227) • $$$$ • French The Sun Dial Restaurant, Bar & View 210 Peachtree St NW, Atlanta, GA 3.3 (1.3k) • $$$$ • New American MDRD 187 Monroe Ave NW, Grand Rapids, MI 4.3 (186) • $$$ • Spanish Umi 3050 Peachtree Rd, Atlanta, GA 4.2 (819) • $$$ • Sushi Bars Primal By Mia 406 Beach Ave, Cape May, NJ 4.4 (179) • Seafood Spago Beverly Hills 176 N Canon Dr, Beverly Hills, CA 4.1 (2.6k) • $$$$ • New American Arnold Palmer's Restaurant 78164 Ave 52, La Quinta, CA 4.1 (453) • $$$ • American Capri Ristorante 324 Burr Ridge Pkwy, Burr Ridge, IL 3.7 (642) • $$ • Italian Gallaghers Steakhouse 228 W 52nd St, New York, NY 4.2 (2.1k) • $$$$ • Steakhouses Rok N Fondue 25 E State St, Redlands, CA 3.8 (1.1k) • $$$ • Fondue Wood Tavern 6317 College Ave, Oakland, CA 4.3 (2.3k) • $$$ • New American Scales 68 Commercial St, Portland, ME 4.3 (1.2k) • $$$ • Seafood Musaafer 5115 Westheimer Rd, Houston, TX 4.3 (936) • Indian Zahav 237 St James Pl, Philadelphia, PA 4.5 (3.6k) • $$$$ • Middle Eastern Shopping Watches Of Switzerland 1 Broadway Everett, Boston, MA 4.4 (5) • Watches Walmart 1320 Altamont Ave, Schenectady, NY 2.0 (20) • $$ • Department Stores 900 North Michigan Shops 900 N Michigan Ave, Chicago, IL 4.0 (107) • $$$ • Shopping Centers American Dream 1 American Dream Way, East Rutherford, NJ 3.5 (527) • $$ • Shopping Centers NorthPark Center 8687 N Central Expy, Dallas, TX 4.2 (648) • $$$ • Shopping Centers UCLA Store 308 Westwood Plz, Los Angeles, CA 3.7 (110) • $$$ • Sports Wear Golden Goose Deluxe Brand 30 Geary St, San Francisco, CA 3.7 (19) • Shoe Stores Glendale Galleria 100 W Broadway, Glendale, CA 3.5 (886) • $$ • Shopping Centers Aventura Mall 19501 Biscayne Blvd, Aventura, FL 4.2 (743) • $$$ • Shopping Centers Oakbrook Center 100 Oakbrook Ctr, Oak Brook, IL 4.5 (21) • Shopping Centers Country Club Plaza 4706 Broadway Blvd, Kansas City, MO 4.2 (178) • $$$ • Shopping Centers Westfield UTC 4545 La Jolla Village Dr, San Diego, CA 3.4 (872) • $$$ • Shopping Centers The Mall at University Town Center 140 University Town Center Dr, Sarasota, FL 3.6 (135) • $$ • Shopping Centers International Plaza and Bay Street 2223 N Westshore Blvd, Tampa, FL 4.2 (319) • $$$ • Shopping Centers Kenwood Towne Center 7875 Montgomery Rd, Cincinnati, OH 3.8 (186) • $$$ • Shopping Centers Scottsdale Fashion Square 7014 E Camelback Rd, Scottsdale, AZ 4.1 (701) • $$$ • Shopping Centers Tysons Corner Center 1961 Chain Bridge Rd, Tysons, VA 4.0 (578) • $$ • Shopping Centers Boca Center 5150 Town Center Cir, Boca Raton, FL 3.7 (14) • $$ • Shopping Centers Costco Wholesale 11700 Mezzo Dr, North Port, FL 3.8 (18) • Wholesale Stores Hotels & Travel Delta , American , Southwest And United Airlines 206 W 45th St, New York, NY 1.0 (1) • Tours MSC Cruises USA 6750 N Andrews Ave, Fort Lauderdale, FL 1.7 (419) • Travel Services The Standard Spa Hotel 40 Island Ave, Miami Beach, FL 3.6 (672) • $$ • Hotels Gaylord Opryland Resort 2800 Opryland Dr, Nashville, TN 3.0 (2.1k) • $$$ • Hotels Allegiant Airlines Spokane, WA 3.0 (2) • Airlines Posthotel Leavenworth 309 8th St, Leavenworth, WA 4.2 (191) • $$$$ • Hotels Hotel del Coronado, Curio Collection by Hilton 1500 Orange Ave, Coronado, CA 3.0 (2.6k) • $$$ • Hotels Pechanga Resort Casino 45000 Pechanga Pkwy, Temecula, CA 3.1 (2.5k) • $$ • Resorts The Omni Grove Park Inn & Spa 290 Macon Ave, Asheville, NC 3.5 (806) • $$$$ • Hotels Norwegian Cruise Line 24 Africa Way, Downtown Miami, FL 3.0 (97) • Tours Chateau Elan Winery & Resort 100 Rue Charlemagne, Braselton, GA 3.6 (665) • $$$ • Resorts Gaylord Texan Resort & Convention Center 1501 Gaylord Trl, Grapevine, TX 3.1 (1.3k) • $$$ • Hotels The Battle House Renaissance Mobile Hotel & Spa 26 N Royal St, Mobile, AL 4.0 (160) • $$$ • Hotels Six Flags Great Escape Lodge & Indoor Waterpark 89 Six Flags Dr, Queensbury, NY 2.3 (259) • $$ • Hotels Montauk Manor 236 Edgemere St, Montauk, NY 3.4 (190) • Resorts Gurney's Montauk Resort & Seawater Spa 290 Old Montauk Hwy, Montauk, NY 2.8 (425) • $$$$ • Hotels The St Regis Longboat Key Resort 1601 Gulf Of Mexico Dr, Longboat Key, FL 3.8 (22) • Hotels Food & Grocery Keens Steakhouse 72 W 36th St, New York, NY 4.2 (3.5k) • $$$$ • Steakhouses Walmart 14101-15799 Fwy, Mesquite, TX 1.0 (1) • Grocery Other Universal Studios Hollywood 100 Universal City Plz, Universal City, CA 3.7 (6.3k) • Amusement Parks The Spa At Séc-he 200 E Tahquitz Canyon Way, Palm Springs, CA 4.5 (168) • $$$ • Day Spas Sphere 255 Sands Ave, Las Vegas, NV 3.3 (1.6k) • Stadiums & Arenas Hollywood Pantages Theatre 6233 Hollywood Blvd, Los Angeles, CA 4.3 (1.9k) • Performing Arts The Ritz-Carlton Spa, Orlando, Grande Lakes 4012 Central Florida Parkway, Orlando, FL 4.4 (127) • $$$$ • Day Spas Madison Square Garden 4 Pennsylvania Plz, New York, NY 4.1 (1.3k) • $$$ • Stadiums & Arenas Bally's Twin River Lincoln 100 Twin River Rd, Lincoln, RI 2.2 (381) • Casinos Universal Orlando Resort 6000 Universal Studios Plz, Orlando, FL 3.4 (547) • Amusement Parks Cosm Dallas 5776 Grandscape Blvd, The Colony, TX 3.1 (189) • $$$ • Venues & Event Spaces CMX CinéBistro Siesta Key 3501 S Tamiami Trl, Sarasota, FL 3.5 (288) • $$$ • Cinema Grand Ole Opry 2804 Opryland Dr, Nashville, TN 4.4 (968) • $$ • Music Venues The Farmer's Dog Brooklyn, NY 3.6 (17) • Pet Services Knott's Berry Farm 8039 Beach Blvd, Buena Park, CA 3.3 (4.9k) • Amusement Parks The Spa at Encore Boston Harbor One Broadway, Everett, MA 3.8 (32) • $$$ • Day Spas Wrigley Field 1060 W Addison St, Chicago, IL 4.4 (1.8k) • Stadiums & Arenas The Spa at CIVANA 37220 Mule Train Rd, Carefree, AZ 4.3 (36) • Day Spas New York Philharmonic 10 Lincoln Center Plz, New York, NY 4.3 (70) • $$$ • Performing Arts Billy Sushi 116 N 1st Ave, Minneapolis, MN 4.3 (24) • Speakeasies Ryman Auditorium 116 Rep John Lewis Way N, Nashville, TN 4.3 (741) • $$ • Music Venues Lincoln Center 70 Lincoln Center Plz, New York, NY 4.5 (332) • $$$ • Performing Arts Wolf in the Woods 1920 Fort Stockton Dr, San Diego, CA 4.6 (461) • $$$ • Wine Bars New York City Ballet 20 Lincoln Ctr, New York, NY 4.3 (144) • Performing Arts The Spa at Claremont 41 Tunnel Rd, Berkeley, CA 3.1 (126) • $$$ • Skin Care The Salt Shed 1357 N Elston Ave, Chicago, IL 4.0 (107) • $$ • Music Venues Dodger Stadium 1000 Vin Scully Ave, Los Angeles, CA 3.8 (2.6k) • Stadiums & Arenas Chateau Elan the Spa 100 Haven Harbor Dr, Braselton, GA 3.5 (96) • $$$ • Massage The Phoenician Spa 6000 East Camelback Road, Scottsdale, AZ 4.0 (101) • $$$ • Day Spas CMX Cinebistro Hyde Park 1609 W Swann Ave, Tampa, FL 3.9 (559) • Cinema Yankee Stadium 1 E 161st St, Bronx, NY 4.0 (1.7k) • Stadiums & Arenas Beau Rivage Resort & Casino 875 Beach Blvd, Biloxi, MS 3.4 (710) • Casinos Universal Studios Florida 6000 Universal Blvd, Orlando, FL 3.5 (2.9k) • Amusement Parks New England Aquarium 1 Central Wharf, Boston, MA 3.5 (1.2k) • Aquariums Mountaineer Casino, Resort & Races 1420 Mountaineer Cir, New Cumberland, WV 2.4 (79) • Casinos Irvine Spa 2332 Barranca Pkwy, Irvine, CA 3.8 (1.6k) • $$ • Day Spas Gun Lake Casino Resort 1123 129th Ave, Wayland, MI 2.3 (166) • Casinos See More FAQ's What is the best way to purchase gift cards? The best way to purchase a gift card depends on whether you want to email or text the gift card to your recipient, give it to them in person, or mail a physical gift card to them. Here are some of the most popular methods to buy electronic and physical gift cards: On a third-party website In-person at the issuing store, restaurant, or other location On the issuing merchant's website On a bank-issued gift card website At a third-party store, such as Target Another option is to purchase a Giftly, which can be used in place of a gift card, and works for almost any national retailer or your favorite local business. How does Giftly work? You can send up to $1,000 to your recipient for any local or national merchant. Giftly will deliver your gift with a customized greeting card by email, text, mail, or printout. Your recipient will choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. While you can suggest a store, bar, restaurant, activity, or something else you think they'd like, your recipient can use the gift for anything they want. How do digital gift cards work? A digital gift card - also known as an electronic gift card (or e-gift card) - works just like a physical gift card but can be used for online purchases. Like a physical gift card, a digital gift card has some type of code or barcode that you can enter online when you're making online purchases. When you send a digital gift through Giftly, your recipient can choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Can you buy gift cards online? Yes. You can purchase a Giftly, which works just like an online gift card, for almost any national retailer or your favorite local business. When you buy a Giftly online at Giftly.com, you can send it to your recipient via text, email, or print. Your recipient can then use the Giftly for anything that they like best, whether it's in person at a store or restaurant, or for online purchases. You can also sometimes buy gift cards online through a specific business's website. However, unlike a Giftly, your recipient can usually only redeem it at that one place. What is the safest way to buy gift cards? The most important thing about sending someone a gift is that it gets delivered safely and securely. The safest way to buy gift cards is through a company that you trust and to store the gift card in a safe place before you give it to someone. At Giftly, you can purchase a Giftly - which works like a universal gift card - in any amount up to $1,000 and send it to your recipient via text, email, or print. Throughout the process, you never have to worry about losing a physical gift card or buying a gift from a company you don't trust. How does someone redeem a gift card from Giftly? When you send a digital gift through Giftly, your recipient can choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Giftly allows people to send monetary gifts to friends and family and suggest where to go and what to get with the gifted funds. Through Giftly, purchasers can suggest a specific business or business category to the recipient and include a personal note. While you can suggest a store, bar, restaurant, activity, or something else you think they'd like, your recipient can use the gift for anything they want. Can you send gift cards via email or text? Yes. You can buy a Giftly through an easy online process and send it to your recipient via email, text, or print. This works great because your recipient has the flexibility to redeem the gift as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Once the recipient has received the funds, they are free to spend them when and where they choose and can receive a Giftly Visa Gift Card to use in-store or online purchases. Do Giftly gifts expire? No. A Giftly gift never expires. You can buy a Giftly online at Giftly.com in any amount up to $1,000. Your recipient can then redeem the Giftly as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Then they can then use the Giftly for any purchases they want, whenever it is the most convenient for them. What are the most popular gift cards you can buy online? Sending someone an online gift card for a birthday, holiday, or another special occasion is a great way to celebrate them and show how much you care. Some of the most popular gift options from Giftly are: Target, Kohl's, Lululemon, Bath and Body Works, Ross. Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    }
  ]
}