{
  "fuentes": [
    {
      "url": "https://www.fernandinabeachgolfclub.com/outings-services/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/outings-inquiry/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.hjgt.org/blog/fernandina-beach-golf-club-raises-bar-junior-golf-florida/",
      "email": "info@hjgt.org"
    },
    {
      "url": "https://fbmga.com/about-us",
      "email": "astigma@astigmatic.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/special-events-at-fernandina-beach/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/instruction/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/tee-times/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.playeasy.com/facilities/08c0ae20-792d-4d81-b290-aad7aa135b1e",
      "email": "jhughes@playeasy.com"
    },
    {
      "url": "https://www.playeasy.com/facilities/08c0ae20-792d-4d81-b290-aad7aa135b1e",
      "email": "matt@raconteurs.us"
    },
    {
      "url": "https://gcnorthhampton.com/",
      "email": "blaze@gcnorthhampton.com"
    },
    {
      "url": "https://amelianationalgolf.com/",
      "email": "info@icihomes.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "golfinfo@fernandinabeachgolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "golfinfo@fernandinagolfclub.com"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "jbiggers@fbfl.city"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "klbenjamin@fbfl.org"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "mswope@fbfl.city"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "email": "pmcdonald@fbfl.city"
    }
  ],
  "mails": [
    "astigma@astigmatic.com",
    "blaze@gcnorthhampton.com",
    "golfinfo@fernandinabeachgolfclub.com",
    "golfinfo@fernandinagolfclub.com",
    "info@hjgt.org",
    "info@icihomes.com",
    "jbiggers@fbfl.city",
    "jhughes@playeasy.com",
    "klbenjamin@fbfl.org",
    "matt@raconteurs.us",
    "mswope@fbfl.city",
    "pmcdonald@fbfl.city"
  ],
  "nombre_sitio": "fernandinabeachgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fernandinabeachgolfclub.com/outings-services/",
      "text": "Outings Services - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Outings Services The Team You Trust The exceptional professional team of Fernandina Beach Golf Club would like to be your partner for your next golf event. From the moment you book your date, to the final wrap-up — we want to serve you. We present a number of complete hassle-free event packages to accommodate your guests, or we will customize one to fit your needs. Services that Deliver Success The standard outing package at Fernandina Beach Golf Club is built to ensure your guests experience a top-notch golf outing with our professional staff. It includes the following, but many options are available: Green fees, cart, and range balls On-course contest set-up Customized rule sheets, scorecards, cart signage Experienced cart staff Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/outings-inquiry/",
      "text": "Outings Inquiry - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Outings Inquiry Please complete the following to request information about golf outings at Fernandina Beach Golf Club. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Group/Organization * Number of Guests * Event Date & Time * Date Time Comments Message Submit Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.hjgt.org/blog/fernandina-beach-golf-club-raises-bar-junior-golf-florida/",
      "text": "Fernandina Beach Golf Club Raises The Bar For Junior Golf - Hurricane Junior Golf Tour (HJGT) Fernandina Beach Golf Club Raises The Bar For Junior Golf - Hurricane Junior Golf Tour (HJGT) Skip to content Menu Home Tournaments Tournaments 2025 Schedule Futures Tour Open College Prep Majors Invitationals Tournament Locations Junior Golf Membership Results & Rankings Results & Rankings Results POY Point Rankings Hurricane Cup Point Rankings Player Divisions Player Divisions Boys 10-11 Boys 12-13 Boys 14-15 Boys 16-18 Girls U13 Girls 14-18 Resources Resources How HJGT Works (Point Rankings) Tour Policies FAQs HJGT REWARDS HJGT PLAYER REFERRAL Our Blog Run Your Own Tour Tournament Assistance College Recruiting Junior Golf Hub HJGT College Signings About About Our Team HJGT Merch Photo Gallery Academy Partners Testimonials Corporate Partners Contact Us Latest News View Schedule Login Schedule Join HJGT Login Join HJGT Schedule Login Tournaments 2025 Schedule Futures Tour Opens College Prep Majors Invitationals Tournament Locations Membership Results & Rankings Results POY Points Rankings Hurricane Cup Rankings Junior Golf National Rankings Player Divisions Boys 10-11 Boys 12-13 Boys 14-15 Boys 16-18 Girls U13 Girls 14-18 Resources How it Works Tour Policies FAQs HJGT Rewards Player Referral Our Blog Run Your Own Tour Tournament Assistance College Recruiting Junior Golf Hub HJGT College Signings About Our Team HJGT Merch Latest News Photo Gallery Testimonials Academy Partners Corporate Partners Contact Us February 14, 2024 Preview Fernandina Beach Golf Club Raises The Bar For Junior Golf Fernandina Beach Golf Club The Fernandina Beach Golf Club was designed by Tommy Bird Songs and opened more than 100 years ago in 1920. It has long been a staple for golfers in the Southeast region of the country, as it is conveniently located within driving distance of Jacksonville and Georgia. Since its creation, the course has evolved into an incredible venue for junior golf competitions. In fact, Fernandina Beach Golf Club will play host to the Hurricane Junior Golf Tour at the end of March for the Northeast Florida Junior Open. How Fernandina Beach Golf Club Is Shaping Junior Golf Former Fernandina Beach Municipal Golf Course General Manager David DeMay has long been a part of the evolution of golf in the area. More than ten years ago, in 2013, DeMay joined the Golf Club of Amelia Island and later became its executive director. Then, in December 2022, DeMay was named GM of the city golf course and began transforming its image. “The city golf course has a lot of great momentum going forward. It has a bright future,” DeMay said . “We have a great staff in place. We purchased new golf carts, renovated the clubhouse banquet room and improved the conditions of the course.” It’s clear that the city is willing to invest in golf, as they’ve shown with the multitude of improvements over the years. With that being said, the course itself is not the only thing bringing people to the area. Just a hop, skip and a jump down the road is Amelia Island – a beautiful picturesque stretch of the Florida Atlantic coast that makes you feel like you’re on a postcard. Amelia Island Offers So Much More Than Golf With over 13 miles of awe-inspiring beaches and more than 90 independent restaurants, Amelia Island offers the perfect family getaway and a seamless compliment to your golf plans. The Main Beach – affectionately known as “The Family Zone” – features a pristine shoreline for beautiful views of the ocean on one side and tons of action-packed fun on the other. You can continue your golf excursions by partaking in some local putt-putt or delve into some extreme sports by taking surf lessons or enjoying the nearby skate park. Down that beach is an area known as Seaside Park – or “The Fun Zone” – and is the go-to spot for local festivals. Beyond the beach, you’ll find plenty of family-friendly restaurants, ice cream shops and other amenities and attractions to keep the party going. Fernandina Beach and Amelia Island are on a mission to enhance and celebrate junior golfers throughout the country. As a host and sponsor of our upcoming Northeast Florida Junior Open, we thank them for their commitment to the sport and our youth. We look forward to continuing our work together in providing the best experience for our young golfers on and off the course. Visit the event page to register for the Northeast Florida Junior Open today! Early-bird registration ends on February 19, 2024. SHARE POST Related Posts See All Blogs September 9, 2025 The Parent Edge: Behaviors That Help (Not Hurt) Your Child’s College Golf Recruiting September 3, 2025 30 Days to Stand Out in College Golf Recruiting September 3, 2025 More Than the Numbers: Why Results Shouldn’t Define a Young Athlete SEARCH BLOGS Search BLOG CATEGORIES Alumni Spotlight College Golf Recruiting How to Intern Spotlight JGGC Jr Golf Tips News Player Spotlight Press Release Preview Uncategorized RECENT POSTS The Parent Edge: Behaviors That Help (Not Hurt) Your Child’s College Golf Recruiting September 9, 2025 30 Days to Stand Out in College Golf Recruiting September 3, 2025 More Than the Numbers: Why Results Shouldn’t Define a Young Athlete September 3, 2025 The Truth About Division I, II, III, and NAIA College Golf: What Families Need to Know August 27, 2025 College Golf Recruiting: What High School Golfers Should Do in 2025 to Improve Scholarship and Roster Opportunities August 19, 2025 2025 HJGT MEMBERSHIP NOW ONLY $299 The Hurricane Tour annual membership is the best value in junior golf! Whether you are brand new to competitive junior golf or a seasoned veteran hoping to impress college coaches, HJGT’s exclusive membership will enhance your tour experience. BEGIN ACCOUNT REGISTRATION Name (Required) First Last Email Phone View Full Schedule Login Tournaments Open College Prep Major Championship Invitational Tournaments Near You Our Divisions Boys 10-11 Boys 12-13 Boys 14-15 Boys 16-18 Girls U13 Girls 14-18 Player Resources Become a HJGT Member Member Login FAQs Employment Opportunities Tournament Assistance Get Junior Golf Hub Results & Rankings Results 2025 Point Rankings Contact Us Send Us A Message info@hjgt.org HJGT Headquarters 7862 W Irlo Bronson Memorial Hwy Suite #457 Kissimmee , FL 34747 Call/Text Us Today (407) 614-2962 © 2025 Hurricane Junior Golf Tour | Website Design by Today's Business | Privacy Policy | Terms of Use | Sitemap"
    },
    {
      "url": "https://fbmga.com/about-us",
      "text": "About Us Home FBMGA Tournament Info Upcoming Tournment Mixer Policy Blitz Information Tournament Results 2 Man Points Mixer Results Club Championships Membership Application Board Members Meeting Minutes By-Laws & Constitution Tribute to Bruce Smyk About Us Contact Us FBMGA Scholarship Trust More Home FBMGA Tournament Info Upcoming Tournment Mixer Policy Blitz Information Tournament Results 2 Man Points Mixer Results Club Championships Membership Application Board Members Meeting Minutes By-Laws & Constitution Tribute to Bruce Smyk About Us Contact Us FBMGA Scholarship Trust Home FBMGA Tournament Info Upcoming Tournment Mixer Policy Blitz Information Tournament Results 2 Man Points Mixer Results Club Championships Membership Application Board Members Meeting Minutes By-Laws & Constitution Tribute to Bruce Smyk About Us Contact Us FBMGA Scholarship Trust About Fernandina Beach Men's Golf Association Our History The FBMGA was chartered in 1966 after completion of the 27 hole Fernandina Beach Golf Course. The Association was formed for any man who wished to enjoy the challenges, rewards and camaraderie of golfing to enjoy. The Association has grown exponentially since then with over 100 active members today. Management is conducted by an annually Show More The FBMGA was chartered in 1966 after completion of the 27 hole Fernandina Beach Golf Course. The Association was formed for any man who wished to enjoy the challenges, rewards and camaraderie of golfing to enjoy. The Association has grown exponentially since then with over 100 active members today. Management is conducted by an annually elected Board of Directors comprised of President, Vice President, Treasurer, Secretary, two Members-at Large, and a Tournament Director.Members enjoy multiple tournaments throughout the year, quarterly membership meetings with dinner and course updates from the Club’s management. As the Fernandina Beach Golf Club is a City owned entity, the Association is also actively involved in its oversight. Show Less Fernandina Men's Golf Association Copyright © 2025 Fernandina Men's Golf Association  - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/",
      "text": "Homepage - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Welcome to Fernandina Beach Golf Club Within a short distance of both Jacksonville and Georgia, Fernandina Beach Golf Club offers a welcome escape for residents and visitors, alike. Our facility is exemplary in its presentation of service and substance, through our 27 holes of fantastic golf and full-service restaurant and clubhouse. Come see us today! Book a Tee Time Members and nonmembers, alike, can reserve their rounds online! Book Now Memberships Learn about becoming a member at Fernandina Beach Golf Club today! Learn More Events Check out our events calendar for what’s coming up at Fernandina. See Events Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/special-events-at-fernandina-beach/",
      "text": "Special Events at Fernandina Beach - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Special Events at Fernandina Beach Fernandina Beach welcomes all types of special events — weddings, banquets, parties, meetings & more! Numerous local businesses, organizations, clubs and private groups choose Fernandina Beach Golf Club as the host of their annual golf events. Regardless of whether your event is to raise funds or to raise spirits, we guarantee the satisfaction of your participants and guests. We make you and your guests feel at home, and promise to make your event an enjoyable and successful experience. To receive a personalized proposal for your wedding or banquet, please complete the form here to contact us directly. View Our Banquet Menu Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/instruction/",
      "text": "Instruction - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Instruction Fernandina Beach Golf Club has partnered with Scott Womble to provide group and private instruction. To book an appointment, contact Scott directly at scottgc96@gmail.com or visit his website scottwomblegolf.com Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/tee-times/",
      "text": "Tee Times - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Tee Times Lowest rates are always available online! Walk-up or phone reservations are subject to higher prices than what is posted online. Fees Reserve Tee Time via Golf Now Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.playeasy.com/facilities/08c0ae20-792d-4d81-b290-aad7aa135b1e",
      "text": "Fernandina Beach Golf Club | Playeasy Search Find new event host Log in Sign up Fernandina Beach Golf Club Golf Course Like Destination Marketed Tournament Ready Home Events Photos Posts About Fernandina Beach Golf Club 2800 Bill Melton Rd, Fernandina Beach, FL 32034, USA Within a short distance of both Jacksonville and Georgia, Fernandina Beach Golf Club offers a welcome escape for residents and visitors, alike. Our facility is exemplary in its presentation of service and substance, through our 27 holes of fantastic golf and full-service restaurant and clubhouse. The Lighthouse Driving Range, powered by Toptracer, lets you compete against friends, play virtual courses, and receive instant shot feedback. The world’s best players use it—now you can, too. Contact the Amelia Island CVB staff for more information on hosting competitive golf tournaments on Amelia Island, FL! Quick Links Share this Facility View QR Code Card Visit Website Contacts JD John Doe Manager Contact Login to View Contacts"
    },
    {
      "url": "https://gcnorthhampton.com/",
      "text": "The Golf Club at North Hampton | Jacksonville Golf Courses | Fernandina Beach Golf Skip to main content Hit enter to search or ESC to close Close Search facebook phone email Menu Menu Golf Golf Tee Times Instruction Practice Facilities Golf Shop Play & Stay Tee Times Membership Outings Events Outings Weddings Events Calendar Dining Social Menus & Hours Weekly Menus Club Info Contact News This Is The Golf Club at North Hampton Book a Tee Time Play Video Arnold Palmer Design North Hampton is a classic risk reward golf course in the image of her designer, the legendary Arnold Palmer. Dream Wedding Awaits Planning your dream wedding is easy with our wedding consultants guiding you along every step of the way! Excellent Memberships We believe our memberships offer the best value anywhere in Fernandina Beach, Amelia Island area. A Unique Dining Experience Where setting, service, and cuisine add up to spectacular Fernandina Beach's Premier Public Golf, Dining, & Social Club The Golf Club at North Hampton offers a traditional Scottish links-style course in Fernandina Beach, Florida. Designed by Arnold Palmer, the layout meanders through dramatic elevation changes of over 40 feet and ten spring-fed lakes lined with coquina boulders. Sprawled across rolling hills and wild grasses, the golf course is sculpted from beautiful Florida woodlands, offering a round that is as scenic as it is challenging. Learn More Golf Arnold Palmer Design North Hampton is a classic risk reward golf course in the image of her designer, the legendary Arnold Palmer. Learn More Weddings Your Dream Wedding Awaits Planning your dream wedding is easy with our wedding consultants guiding you along every step of the way! Learn More What they've said about us Thank you for the kind reviews. We can't wait to see you out on the course! Contact Us “Great facility, course and staff. Always have a good time there. Course is challenging but fair. On the recommendation list for sure.” James Richardson Facebook Review “One of the ten most famous Golf Clubs in Florida. Amazing landscape and wildlife at the course, even alligators. Very challenging and some tricky greens! Highly recommended!!!” Peter Dieterich Google Review “Great Course! Good Value too. Everything was better than expected! Beautiful wood bridges that serpentine through the marsh land. We really enjoyed it! Thanks.” Mike K. Yelp Review “Excellent experience playing this course. The course is both challenging and fun to play. The greens were fast and rolled nicely. I highly recommend playing this course if you are in the area.” Randy Trip Advisor Book a Tee Time Book a tee time for North Hampton today! Membership We’re even better as a member! We believe our memberships offer the best value anywhere. Come see for yourself! Outings & Tournaments Find out why North Hampton is the number one choice for golf outings in Northern Florida. Upcoming Events From weekly Pub Nights to wine tastings and more, there’s always something to look forward to at North Hampton. The Golf Club at North Hampton 22680 N. Hampton Club Way Fernandina Beach, FL 32034 Golf Shop - (904) 548-0000 Restaurant - (904) 225-1075 twitter facebook google-plus instagram yelp tripadvisor phone email © 2025 The Club at North Hampton. Powered by foreUP Marketing Services Close Menu Golf Golf Tee Times Instruction Practice Facilities Golf Shop Play & Stay Tee Times Membership Outings Events Outings Weddings Events Calendar Dining Social Menus & Hours Weekly Menus Club Info Contact News"
    },
    {
      "url": "https://amelianationalgolf.com/",
      "text": "Amelia National Golf & Country Club - Fernandina Beach, FL Skip to content General: 904.274.6731 | Sales: 855.214.9967 | Member Login Menu Amelia National News & Events Latest News Event Calendars Location Directory Private Events Resident Referral Program Home Owners Association Careers at Amelia National Amenities Tom Fazio Golf Course Dining & Social Fitness Center Tennis Swimming Pool Fernandina Beach Homes Our Homes Amelia National Sitemap Schedule VIP Tour Discovery Tours Membership Contact General Inquiry Download a Brochure Amelia National Golf & Country Club Gated, Golf Course Community in Fernandina Beach, Florida Residents of the amenity-filled Fernandina Beach new home community of Amelia National Golf and Country Club experience a vacation-type lifestyle each and every day. This truly magnificent Tom Fazio golf course community embodies country club living at its best; from the Tom Fazio-designed, 18-hole golf course and championship-quality tennis courts to the luxurious fitness center and clubhouse facilities . Enjoy lounging by the pool and superb dining at the club located within Amelia National’s guard-gated access. Amelia National Golf and Country Club is situated in Fernandina Beach, which is often termed the gateway to the enchantingly quaint Amelia Island. The entire experience of Amelia National is geared to those well acquainted with the world’s finest private country club destinations in Florida. A charming, French provincial clubhouse will welcome you with a relaxing atmosphere of quality and elegance. Steeped in the traditions of the world’s most renowned golf clubs, fine dining as well as the casual camaraderie of a 19th hole bar and grill will be accompanied by superlative service and fabulous views of the course and grounds. With private meeting rooms and convivial gathering areas the clubhouse has been planned to cater to your every need. Outdoors a sparkling pool complex set among lushly landscaped gardens will be a delightful place to gather with friends and neighbors. Fernandina Beach Custom Home Builder – ICI Homes Amelia National Golf and Country Club features stunning, award winning floor plans from Fernandina Beach, Florida custom home builder, ICI Homes . Offering modest single-family homes to palatial estate homes with lake and golf course views, ICI Homes has been at the forefront of the home building industry and is consistently ranked among the top 100 home builders in the country. This is one of the best new home golf communities in Florida and one visit here will have you in love with the Florida golf community life style! Amelia National Facebook Posts Comments Box SVG icons Used for the like, share, comment, and reaction icons ICI Homes 2 weeks ago Amelia National & Plantation Bay by ICI Homes are named among @ideallivingmag’s 2025 Best Places to Live! 🏆 Discover what makes these Florida communities truly exceptional. 🌴🏡 ➡️ iciho.me/4odKH5Y #BestPlacesToLive #ICIHomes #FloridaLiving #GolfCommunity ... See More See Less ICI Homes Communities Among Ideal-LIVING Magazine’s 2025 Best Places To Live | ICI Homes - Florida Lifestyles iciho.me It’s always an honor to make best-of lists in any industry and the thrill is real for those of us in new-construction homebuilding. View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 2 Shares: 0 Comments: 0 0 Comments Comment on Facebook ICI Homes 3 weeks ago Amelia National is North Florida’s hidden gem: gated, elegant, and tailored to your lifestyle with ICI Homes. 👉 Learn more today: iciho.me/4bTqKLk #ICIHomes #AmeliaNationalLiving #FernandinaBeachFL #LuxuryLivingFL #CustomBuild #ResortLifestyle ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes love 8 Shares: 2 Comments: 0 0 Comments Comment on Facebook ICI Homes 1 month ago Live where every day feels like a vacation. Amelia National offers golf, tennis, a resort-style pool, and a custom home built just for you. 🏌️‍♂️ 👉 Discover the lifestyle: iciho.me/4bTqKLk #amelianationalfl #FernandinaBeachLiving #golfcommunityfl #ICIHomes #CustomLuxuryHomes #NorthFloridaLiving #buildoutsidethebox ... See More See Less View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email View Comments likes 0 Shares: 0 Comments: 0 0 Comments Comment on Facebook Latest News from Amelia National Golf and Country Club Amelia Island Among Travel + Leisure’s Top 15 Islands in the U.S. for 2025 August 18, 2025 No need to go to far-flung locales to enjoy island living! Plenty of picturesque islands dot the continental United States coastline and there’s an island style for all thanks to the country’s numerous geographic regions and climates.\nReaders of Travel + Leisure magazine concurred, recently choosing their favorites as part of the magazine’s 2025 “World’s Best Awards” survey.\nFlorida claimed five of the 15 top choices, among them Amelia Island, which ranked No. 2 overall, the highest-ranked Florida island.\nThe Amelia Island area also is home to Amelia National Golf & Country Club, the top master-planned community in northeast Florida and one of ICI Homes’ signature properties. Amelia National offers luxurious, resort-style living with outstanding resident amenities, plus it’s only 10 minutes west of Amelia Island and the historic town of Fernandina Beach.\nIf you’re considering a new custom Florida home here, consider that choice already validated by thousands of Travel + Leisure readers.\nHere’s more on the survey and why Amelia National is the perfect home for your island lifestyle.\nKey Takeaways\n\nAmelia Island ranked #2 in Travel + Leisure’s 2025 “World’s Best Awards”, the highest-ranked Florida island on the list, praised for its natural beauty, outdoor recreation, and charming Fernandina Beach.\nAmelia National Golf & Country Club, just 10 minutes from Amelia Island, offers a resort-style lifestyle in a gated community with luxury custom homes and top-tier amenities.\nTravel + Leisure’s rankings are based on reader feedback, including categories like natural attractions, dining, friendliness, and overall value, with nearly 180,000 participants in the 2025 survey.\nResidents of Amelia National enjoy access to a Tom Fazio-designed golf course, tennis center, resort-style pool, clubhouse, and the ability to custom-build or move in quickly.\nAmelia National and ICI Homes offer the ideal island lifestyle for those seeking custom Florida living near a nationally recognized destination.\n\nMethodology\nTravel + Leisure bases its annual “World’s Best Awards” on worldwide travel topics, including airlines, cities, cruise ships, hotels, islands, resorts, spas and more categories. Readers respond with experiences and feedback, which informs the magazine’s rankings.\nApproximately 180,000 readers weighed in for the 2025 survey. Per Travel + Leisure’s website, they rated islands on activities/sights, natural attractions/beaches, people/friendliness, restaurants/food, and value, using a scale of excellent, above average, below average, and poor. Magazine staffers used those ratings to calculate an average final score for each island.\nMount Desert Island in Maine was the top-rated 2025 island in the continental U.S.\nAmelia Island was second, followed by No. 3 Mackinac Island, Michigan, No. 4 Golden Isles, Georgia, No. 5 San Juan Islands, Washington, No. 6 Marco Island, Florida, No. 7 Kiawah Island, South Carolina, No. 8 Florida Keys, Florida, No. 9 Hilton Head Island, South Carolina, No. 10 Nantucket, Massachusetts, No. 11 Sanibel Island, Florida, No. 12 Outer Banks, North Carolina, No. 13 South Padre Island, Texas, No. 14 Martha’s Vineyard, Massachusetts and No. 15 Captiva Island, Florida.\nWhy Amelia Island ranked No. 2\nThirteen miles of Atlantic beaches are one reason, followed by natural beauty among marshes, rivers, state and natural parks, and endless outdoor recreation options.\nFernandina Beach is Amelia National’s hometown, hosting an energetic restaurant, shopping, nightlife and boating scene, plus special events year-round. Museums and historical sites document the island’s centuries-long history.\nCome home to Amelia National\nThis gated community features luxury custom homes of all sizes and the area’s only Tom Fazio-designed golf course.\nIts French Provincial clubhouse anchors dining and social activities along with a fully stocked fitness center, resort-style swimming pool and eight-court tennis center.\nBest of all, you can build from scratch, or buy a move-in-ready inventory home if you’d like to fast-track your permanent vacation.\nReady for your Amelia National lifestyle? Talk to ICI Homes here. [...] Read more... Amelia National Residents’ Guide to Indoor Fun June 23, 2025 Living at Amelia National Golf & Country Club, a signature ICI Homes master-planned community, means enjoying fabulous Florida weather year-round.\nBut, when that weather gets a bit extra? Amelia National’s prime northeast Florida location gives residents plenty of fun things to do indoors (we see you, heat, humidity, and summer showers).\nBegin at Amelia National’s stunning clubhouse, the community’s amenity anchor. Work up a sweat in the fitness center. Attend a trainer-led yoga or workout class. Meet friends and neighbors for a tasty meal and luscious drinks in the dining room or 19th hole bar and grill. Or, round up those friends and neighbors for a fun cookout on your covered lanai.\nAnd, when it’s time to seek indoor fun elsewhere, there’s no lack of activities and entertainment in Amelia National’s hometown of Fernandina Beach. Cruise through some options below.\nAdventures in Reading\nFernandina Beach offers several places to curl up with a good book or to find a new title for your reading list. Browsing a bookstore is also a rewarding indoor activity for kids and grandkids, a sure way to ignite young imaginations and conversations with adults.\nA Fernandina Beach branch of the Nassau County Public Library system is located downtown.  The Book Loft is another nearby option, as is Story & Song Bookstore Bistro on Park Avenue.\nPro tip: Don’t miss the annual Amelia Island Book Festival each February.\nArtistic Endeavors\nTaking an art class not only feeds our creativity, it’s also a unique way to have fun with folks you know, or to meet new friends indoors.\nSeveral Fernandina Beach-area art studios offer classes in different disciplines such as painting and drawing, plus popular “make-it” events where an instructor leads attendees step by step through the process of creating an original drawing, pottery piece or embellished sign.\nAmelia Makery and Paisley Grace Makery, both downtown Fernandina Beach-based, are two outlets that offer creative events and classes.\nIndoor Play\nAmelia National residents can still compete when it’s hot, humid or drizzly outside!\nTry Duck Pinz, a mini-bowling alley in downtown Fernandina Beach and Golf Pub Social on Sadler Road. Duck Pinz includes an second-floor bar that overlooks its lanes, and Golf Pub Social offers three playable Trackman golf simulators. A covered patio makes Golf Pub Social inviting even during those summer showers, with table tennis and corn hole boards available for additional competition. Expect pub fare and libations for sustenance.\nTour a Museum\nWhether you’re a current or prospective Amelia National resident, one of the many perks of living in the Fernandina Beach-Amelia Island region is its history. Centuries of major events and historical twists and turns occurred here, and there are multiple museums and conserved historical sites that tell you all about it.\nStart with the Amelia Island Museum of History, then branch out to others. Compile a museum checklist for regular comfy indoor outings with family and friends.\nReady for your Amelia National lifestyle? Talk to ICI Homes here. [...] Read more... Amelia National’s Golf Course Renovation Is Underway April 24, 2025 Crews are now hard at work on Amelia National Golf & Country Club’s renovation of its storied Tom Fazio-designed golf course.\nIt’s an exciting next step for the crown jewel amenity at Fernandina Beach’s best address. The multi-million-dollar renovation project began in mid-March, after the golf course closed following another active winter season. And although it won’t be an instantaneous process, the renovation — overseen by the course’s original architectural firm, FAZIO Designs — also won’t be a complete overhaul.\n“I would say this is more of a re-grassing and a refreshing of the current golf course and the current golf conditions,” said FAZIO Designs’ Gavin Fazio during a November presentation.\n\nAmelia National is one of ICI Homes’ signature properties in northeast Florida, nestled 10 minutes west of downtown Fernandina Beach and Amelia Island’s glorious Atlantic beaches.\nThe Fazio-designed golf course is the centerpiece here, winding throughout this gated community. It provides beautiful natural backdrops to residents’ homes and Amelia National’s French Provincial clubhouse, which also serves as the amenity hub.\n\n\nIf you’re a golfing enthusiast seeking a new custom luxury home in northeast Florida, Amelia National should be on your radar. Because soon, you’ll have a better-than-ever course to play!\nHere’s more information.\nDiving into details\nAmelia National and its golf course opened in 2006. After two decades of enthusiastic use, some tweaking and updating is necessary.\nA critical factor is the course’s original iteration. Tom Fazio designed Amelia National using the existing coastal-forested terrain, placing holes, greens and fairways into an already lovely place.\nThe current renovation builds off those good bones rather than uprooting everything from scratch. It prioritizes these five goals, as presented by Gavin Fazio and project manager Ron Smith in November:\n\nImprove course conditions with new turf and decrease shade issues.\nRenovate course to modern standards for more efficient maintenance.\nAt some holes, re-position bunkers and add tees for improved strategy and playability.\nImprove current practice facilities by re-positioning cart tracks and shifting vegetation, etc., to make a great entrance to the course even better.\nRestore greens back to original sizes to maximize hole locations.\n\nA few more deets\nAmelia National’s course will be outfitted with one of the golfing industry’s cutting-edge turf choices.\nFAZIO Design crews will use a technology called Bunker Solution to update bunkers and minimize washout problems. Per Gavin Fazio and Smith, this ensures Amelia National’s bunkers will contain less square footage and provide better visibility.\nTrees will be trimmed and/or removed in select areas to improve vistas and turf growth, and drainage issues will be tackled and solved.\nHalf of the project’s multi-million-dollar budget will fund a new golf maintenance facility.\nAs with any natural site work and terrain processes, a golf course renovation takes time. Amelia National’s golf professionals are helping residents find golfing resources during the renovation. And don’t hesitate to enjoy local mini-golf courses.\nStay tuned for updates!\nReady for your Amelia National lifestyle? Talk to ICI Homes here. [...] Read more... Contact Us Today General Inquiry - 904.274.6731 Sales Inquiry - 855.214.9967 Download Our Brochure Sitemap | Membership Info | And More I want to receive text messages reCAPTCHA helps prevent automated form spam. The submit button will be disabled until you complete the CAPTCHA. By opting into the ICI Homes text program, I understand and agree that message frequency will vary by use from ICI Homes including transactional alerts & special offers. I understand that these messages may be sent via autodial text message to the phone number I provided. I understand I can opt-out at any time by texting STOP to 69983, and can get more information about the program by texting HELP to 69983. I understand that message and data rates may apply. Terms & Conditions Amelia National Golf and Country Club, an ICI Homes - 95211 Clubhouse Road, Fernandina Beach, FL 32034 CBC1264300, CBC1262120, CRC1333091, CBC1262114, CBC1257263, CBC1265743, CBC1267313, CBC1256683, CBC057851, CBC1261237 Terms and Conditions"
    },
    {
      "url": "https://www.fernandinabeachgolfclub.com/contact-us/",
      "text": "Contact Us - Fernandina Beach Golf Course Skip to primary navigation Skip to main content Skip to footer Fernandina Beach Golf Course Book Tee Times Home Golf Tee Times Instruction Course Events Clubhouse Join Membership Inquiry Outings Outings Services Outings Inquiry Weddings & Banquets Special Events at Fernandina Beach Banquet Menu Weddings & Banquet Inquiry Dining Contact Us Lighthouse Driving Range Contact Us Address 2800 Bill Melton Road Fernandina Beach, FL 32034 Phone (904) 310-3175 Email golfinfo@fernandinabeachgolfclub.com Staff Jeffery Biggers General Manager Pam McDonald Administrative Coordinator Mark Swope Superintendent Kristy Benjamin Food and Beverage Manager Footer Contact Us (904) 310-3175 golfinfo@fernandinabeachgolfclub.com Follow Us Facebook Find Us 2800 Bill Melton Road Fernandina Beach, FL 32034 Copyright © 2025 Fernandina Beach Golf Course All Rights Reserved. Powered by"
    }
  ]
}