{
  "fuentes": [
    {
      "url": "https://ffoviedo.com/buttercrust-pizza/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/buttercrust-pizza/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://www.theploughoxford.co.uk/contact",
      "email": "info@theploughoxford.co.uk"
    },
    {
      "url": "https://ffoviedo.com/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/faq/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "bloomingdale@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "brandon@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "carrollwood@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "landolakes@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "lutz@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "newtampa@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "seminoleheights@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "info@concertsunderthestars.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "lakeland@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "orlando@patch.com"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "plantcity@patch.com"
    },
    {
      "url": "https://ffoviedo.com/oviedoparkpub/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/oviedoparkpub/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://www.gottagoorlando.com/post/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "email": "info@gottagoorlando.com"
    },
    {
      "url": "https://www.realoviedo.es/en/club",
      "email": "oas@realoviedo.es"
    },
    {
      "url": "https://ffoviedo.com/contact-us/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/contact-us/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/contact-us/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/the-experience/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/kai-asian-street-fare/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://ffoviedo.com/kai-asian-street-fare/",
      "email": "social@ffoviedo.com"
    },
    {
      "url": "https://oviedocommunitynews.org/2024/09/04/oviedo-park-pub-opens-plus-football-and-live-music/",
      "email": "your@address.com"
    },
    {
      "url": "https://ffoviedo.com/about-the-food-factory/",
      "email": "social@ffoviedo.com"
    }
  ],
  "mails": [
    "bloomingdale@patch.com",
    "brandon@patch.com",
    "carrollwood@patch.com",
    "info@concertsunderthestars.com",
    "info@gottagoorlando.com",
    "info@theploughoxford.co.uk",
    "lakeland@patch.com",
    "landolakes@patch.com",
    "lutz@patch.com",
    "newtampa@patch.com",
    "oas@realoviedo.es",
    "orlando@patch.com",
    "plantcity@patch.com",
    "seminoleheights@patch.com",
    "social@ffoviedo.com",
    "your@address.com"
  ],
  "nombre_sitio": "ffoviedo.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ffoviedo.com/buttercrust-pizza/",
      "text": "Buttercrust Pizza - Handcrafted Pies & Unique Flavors Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event PIZZA Buttercrust Pizza Home Buttercrust Pizza PIZZA The Buttercrust Experience Buttercrust Pizza is not just about pizza; it’s about a pizza experience unlike any other. With a variety of crusts and an endless array of toppings, we cater to all tastes and preferences. Join us for a meal where quality and flavor are always top priorities. Monday 11 AM–11 PM Tuesday 11 AM–11 PM Wednesday 11 AM–12 AM Thursday 11 AM–12 AM Friday 11 AM–1 AM Saturday 11 AM–1 AM Sunday 11 AM–11 PM VIEW MENU VIEW MENUThe Buttercrust Experience Buttercrust Creations CELEBRATE WITH US Host Your Event with Us! Whether you’re planning an intimate gathering, a birthday bash, a corporate meeting, or a special celebration, our unique setting ensures an experience your guests will talk about for years to come. HOST YOUR EVENT CONTACT US Email Us Social@FFOviedo.com Visit Us 888 City Walk Lane Oviedo, FL 32765 About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://www.theploughoxford.co.uk/contact",
      "text": "Get in Touch | The Plough Skip to main content Home About Menus Summer Menu Sunday sample menu Sample specials Dessert menu Children's menu Funeral Packages Gallery Events Functions Contact us 01865 556969 info@theploughoxford.co.uk The Green Upper Wolvercote Oxford OX2 8BD Home About Menus Summer Menu Sunday sample menu Sample specials Dessert menu Children's menu Funeral Packages Gallery Events Functions Contact us Get in Touch For Enquiries, Events and Bookings, Contact us With: This email address is being protected from spambots. You need JavaScript enabled to view it. This email address is being protected from spambots. You need JavaScript enabled to view it. Contact Info 01865 556969 This email address is being protected from spambots. You need JavaScript enabled to view it. The Green Upper Wolvercote Oxford OX2 8BD Opening Hours Monday Closed Tuesday Closed Wednesday 11am – 3pm / 5.45pm – 11pm Thursday 11am – 3pm / 5.45pm – 11pm Friday 11am – Late Saturday 11am – Late Sunday 12pm – 7.30pm Food Hours Wednesday 12pm – 2pm / 6pm – 9pm Thursday 12pm – 2pm / 6pm – 9pm Friday 12pm – 2pm / 6pm – 9pm Saturday 12pm – 2.30pm / 5.30pm – 9pm Sunday 12pm – 3pm / 5pm – 7.30pm Copyright © 2025 The Plough, Wolvercote. All Rights Reserved. Website Development by Beyond Your Brand . Site Map • Privacy Policy • Cookie Settings Quick Links Home About Menus Gallery Events Functions Contact Opening Hours Monday Closed Tuesday Closed Wednesday 11am – 3pm / 5.45pm – 11pm Thursday 11am – 3pm / 5.45pm – 11pm Friday 11am – Late Saturday 11am – Late Sunday 12pm – 7.30pm Food Serving Hours Wednesday 12pm – 2pm / 6pm – 9pm Thursday 12pm – 2pm / 6pm – 9pm Friday 12pm – 2pm / 6pm – 9pm Saturday 12pm – 2.30pm / 5.30pm – 9pm Sunday 12pm – 3pm / 5pm – 7.30pm Find us 01865 556969 This email address is being protected from spambots. You need JavaScript enabled to view it. The Green Upper Wolvercote Oxford OX2 8BD Parking We have had a parking system installed, customers will be able to park free of charge, we will just require you to come in and provide your number plate."
    },
    {
      "url": "https://ffoviedo.com/",
      "text": "The Food Factory - Where Flavor Meets Great Company Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event The Food Factory Where Flavor Meets Great Company Come discover a world of flavors! About Us See Micro-Restaurants The Food Factory Savor the Scene at  The Food Factory Join us for Happy Hour every Monday-Friday 4-7 PM! About Us See Micro-Restaurants The Food Factory Where Flavor Meets Community- Oviedo's Culinary Gem Dive into a world where community and flavor collide, creating unforgettable experiences. About Us See Micro-Restaurants MICRO-RESTAURANTS The Food Factory Experience The Food Factory is more than a dining destination; it's a place where culinary delights meet community spirit. Enjoy our covered outdoor and open-air courtyard spaces, perfect for socializing, dining, and creating memories. BAR Oviedo Park Pub Oviedo Park Pub is your neighborhood bar, where you can comfortably sit back and relax in leather seats, sipping on specialty cocktails or a bourbon from our growing collection. Crack open a beer and watch the NFL ticket or UCF games on our 15 tv’s and 140-inch projector screen. Can’t decide on what to eat? Dine inside with any food option located within the Food Factory plaza. Keep an eye out for live music and adult-friendly events! LEARN MORE PIZZA Buttercrust Pizza Buttercrust Pizza is not just about pizza; it’s about a pizza experience unlike any other. With a variety of crusts and an endless array of toppings, we cater to all tastes and preferences. Join us for a meal where quality and flavor are always top priorities. learn more AMERICAN COMFORT The Local Hen The Local Hen offers a comforting taste of Southern hospitality right in the heart of Oviedo on the Park. Savor our contemporary take on classic Southern dishes, made with locally sourced ingredients and a lot of love. It’s where good food and good times come together. LEARN MORE MEXICAN Tacos My Guey Since 2015, we started as a food truck in Orlando with one clear mission: to bring the essence of Mexican street tacos into a modern, vibrant space. Today, Tacos My Guey is more than a restaurant - it's a place where tradition and innovation meet in every bite. Our commitment is to deliver quality, hospitality, and an atmosphere that makes every moment worth celebrating. LEARN MORE ASIAN | VIETNAMESE | THAI Kai Asian Street Fare Experience the vibrant and bold flavors of Asia with Kai Asian Street Fare. Our menu is a curated selection of street food favorites from across the continent, made with fresh ingredients and authentic techniques. It’s a culinary adventure that’s sure to delight. LEARN MORE Waffle Press Waffle Co. Press Waffle Co. specializes in fully customizable authentic Belgian waffles, savory waffle creations, and locally roasted coffee. Perfect for breakfast, brunch, or dessert, any time is the right time to waffle! Come try the best waffle you've never had today! LEARN MORE Sandwiches Grilled Cheezus Your neighborhood grilled cheese shop, visit us today! LEARN MORE Experience The Food Factory Testimonials What Our visitors say Discover what our customers have to say about their Food Factory Experience! \" ★ ★ ★ ★ ★ The food choices and drinks are awesome! Love the atmosphere and the food choices and drinks are awesome! The spicy margarita was delicious!!! TAMARA JONES 03-29-2024 \" ★ ★ ★ ★ ★ Perfect place to unwind after a long day. Love love love this place. The food is great. The staff is amazing! Perfect place to unwind after a long day. ANNE STARK 02-27-2024 \" ★ ★ ★ ★ ★ There are different food options for everyone The Food Factory is a great place for family and friends to gather. There are different food options for everyone, and the service is great. JULIA M. 03-16-2024 \" ★ ★ ★ ★ ★ Love this spot!! Love this spot!! Service and food is great! MELISSA SIVER 03-11-2024 \" ★ ★ ★ ★ ★ Love hanging at the bar Love hanging at the bar and being able to pick from the various foods while enjoying a good drink. MITCH EUBANKS 03-11-2024 Watch More Slider navigation REACH OUT Contact Us Description Send a message Δ About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://ffoviedo.com/faq/",
      "text": "FAQ - The Food Factory Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event FAQ Home FAQ What is The Food Factory? The Food Factory is a collection of smaller (what we call micro-restaurants) encompassing approximately 14,500 square feet of well-designed indoor, covered outdoor, and open-air courtyard spaces for fabulous food, drink, games, and entertainment. It consists of seven 800 sf micro-restaurants run by local chefs. Each micro-restaurant has its own full kitchen and menu reflecting imaginative and high caliber fast-fine dining offerings unlike a food hall. Kid friendly. Outside courtyards are dog-friendly! What's the Story of the Food Factory? The Food Factory, nestled in the heart of Oviedo at the Oviedo on the Park, is a creative culinary initiative by Michael Collard Properties (MCP), a distinguished commercial real estate development firm with over 25 years of experience. This unique food hub is designed as an experiential gathering space, hosting eight chef-owned micro-restaurants and Oviedo Park Pub, your neighborhood bar, embodying MCP's vision of creating purposeful, interactive spaces that foster community engagement and offer an alternative to digital interaction. Through The Food Factory, MCP seeks to celebrate local culinary talent, encourage social connections, and contribute to the vibrant tapestry of Oviedo. For more details on MCP’s innovative projects and The Food Factory’s story, visit www.CollardProperties.com . Why are the restaurants called \"micro-restaurants\"? We call them “micro” because each is an 800 square foot restaurant with a full kitchen and its own seating, unlike a food hall with stalls, a commissary kitchen and warmed over food. Restrooms for the entire Collective are located next to Oviedo Park Pub to give the micro-restaurants added kitchen space. Why is there a rocket in the courtyard? The rocket in the courtyard serves as a vibrant tribute to our close connections with the University of Central Florida (UCF) and the iconic Space Coast. Located within a stone's throw of both, our establishment draws inspiration from the spirit of exploration and innovation that defines the area. These rockets symbolize our dedication to reaching new heights in culinary excellence and community gathering. Moreover, on select nights, our patio becomes the perfect spot for guests to witness the awe-inspiring rocket launches from Kennedy Space Center, making every visit to The Food Factory a potentially out-of-this-world experience. Have a question? Write us a message Send a message Δ About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://patch.com/florida/orlando/calendar/event/20240906/8184db62-7385-4a4f-94b2-b51c0cc35130/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "text": "Orlando Events Calendar for September 10, 2025 - Orlando, FL Patch Skip to main content Orlando, FL Subscribe News Feed Events Local Businesses Classifieds Post Advertise Nearby Lakeland News Plant City News New Tampa News Land O' Lakes News Brandon News Bloomingdale-Riverview News Temple Terrace News Lutz News Seminole Heights News Carrollwood-Northdale News Local News Community Corner Crime & Safety Politics & Government Schools Traffic & Transit Obituaries Personal Finance Neighbor News Best Of Seasonal & Holidays Weather Arts & Entertainment Business & Tech Health & Wellness Home & Garden Sports Travel Kids & Family Pets Restaurants & Bars Real Estate Events Local Businesses Classifieds See all communities Advertise Promote on Patch Nearby Communities Lakeland, FL Plant City, FL New Tampa, FL Land O' Lakes, FL Brandon, FL Bloomingdale-Riverview, FL Temple Terrace, FL Lutz, FL Seminole Heights, FL Carrollwood-Northdale, FL State Edition Florida National Edition Top National News See All Communities Events and Things to Do in Orlando, FL Saturday, September 13 Storytime LIVE at Kiddie Academy of Orlando-Conway SEP 13 2:00 PM 3215 Conway Rd, Orlando, FL Kiddie Academy of Orlando-Conway will host Storytime LIVE on Saturday, Sept. 13 from 2 p.m.- 4 p.m. Families of children ages 2... Share Make your event the talk of the town. Post your event on Patch Also around town... Please confirm event details with the organizers before attending Wednesday, September 10 Habitat U Community Engagement Class 6:00 pm Habitat for Humanity Greater Orlando & Osceola County, 4116 Silver Star Rd, Orlando Thursday, September 11 OCLS Masterpiece Junior: Frida Kahlo 4:00 pm Orlando Public Library • 101 E. Central Blvd., Orlando, FL 32801 Kristin Key 7:00 pm Funny Bone Comedy Club, 9101 International Dr, Orlando Friday, September 12 Candlelight: Queen vs. ABBA 2:30 pm Azalea Lodge at Mead Botanical Garden, 1300 S Denning Dr, Winter Park Candlelight: Best of Hip-Hop on Strings 4:45 pm The Azalea Lodge at Mead Gardens 1300 S Denning Dr Orlando, Florida 32789 Rafi Bastos 7:00 pm Funny Bone Comedy Club, 9101 International Dr, Orlando Saturday, September 13 Storytime LIVE at Kiddie Academy of Orlando-Conway 2:00 pm 3215 Conway Rd, Orlando 17th Annual UNCF Orlando 5K Walk/Run for Education 8:00 am Blue Jacket Park, 2501 General Rees Ave, Orlando Florida National Guard Armory, 2809 S. Fern Creek Ave., Orlando 9:00 am El Car Wash Casselberry Grand Opening Event 11:00 am 2699 CASSEL CREEK BLVD, Casselberry, FL  32707 Sunday, September 14 Paws Around the Pier Bridal Showcase 11:00 am Caribe Royale Orlando, 8101 World Center Dr, Orlando Celebrating Morimoto Asia’s 10 Year Anniversary Event! 11:00 am 1600 E Buena Vista Dr, Lake Buena Vista Piano Men: An Elton John & Billy Joel Tribute at Enzo's on the Lake 4:00 pm Enzo's on the Lake, 1130 S US Hwy 17 92, Longwood Tuesday, September 16 OCLS Mexican Folk Art 5:15 pm Windermere Branch • 530 Main ST., Windermere, FL 34786 Anthony Rodia 7:00 pm Funny Bone Comedy Club, 9101 International Dr, Orlando Wednesday, September 17 Preserving Your History Series: Oral History 1:00 pm Orange County Regional History Center, 65 E Central Blvd, Orlando, FL, 32801 OCLS Tween Art Adventures: Folk Art Arpilleras 3:30 pm South Trail Branch • 4600 S. Orange Blossom Tr., Orlando, FL 32839 Kevin James Thornton 7:00 pm Funny Bone Comedy Club, 9101 International Dr, Orlando Thursday, September 18 ScaleUp Orlando: A One-Day Conference for Founders and Small Biz Owners 8:00 am UCF Downtown, 500 W Livingston St, Orlando OCLS Crochet T-Shirt Yarn Baskets 3:30 pm Orlando Public Library • 101 E. Central Blvd., Orlando, FL 32801 Featured Events Sep 13, 2025 Storytime LIVE at Kiddie Academy of Orlando-Conway + Add your event Featured Businesses Got Balloons We make Orlando pop with custom balloon setups for events! Healthugo Find Your Affordable Healthcare Plan + Promote your business Find out what’s happening in your community on the Patch app Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://ffoviedo.com/oviedoparkpub/",
      "text": "Oviedo Park Pub - The Food Factory Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event BAR Oviedo Park Pub Home Oviedo Park Pub BAR A Neighborhood Pub Oviedo Park Pub is your neighborhood bar, where you can comfortably sit back and relax in leather seats, sipping on specialty cocktails or a bourbon from our growing collection. Crack open a beer and watch the NFL ticket or UCF games on our 15 tv’s and 140-inch projector screen. Can’t decide on what to eat? Dine inside with any food option located within the Food Factory plaza. Keep an eye out for live music and adult-friendly events! Monday 11:30 AM–12 AM Tuesday 11:30 AM–12 AM Wednesday 11:30 AM–12 AM Thursday 11:30 AM–2 AM Friday 11:30 AM–2 AM Saturday 11:30 AM–2 AM Sunday 11:30 AM–12 AM VIEW MENU VIEW MENUA Neighborhood Pub Email Us Social@FFOviedo.com Visit Us 888 City Walk Lane Oviedo, FL 32765 About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://www.gottagoorlando.com/post/oviedo-park-pub-announces-two-day-grand-opening-celebration-sept-6-and-7",
      "text": "Oviedo Park Pub announces two-day Grand Opening Celebration Sept. 6 and 7 top of page Search News Orlando News Space Coast News Daytona Beach News Tampa Bay News Travel & Tourism News Orlando International Airport News Weather News Hotel & Resort News Retail News Deals & Special Offers Theme Parks Theme Park News Walt Disney World News Universal Orlando News Seaworld Orlando News Busch Gardens Tampa News Legoland Florida News Attractions Attraction News Water Park News Dinner Show News Entertainment Entertainment News Events & Festival News Concerts & Live Music News Stand-Up Comedy News Bar & Nightlife News Theater & The Arts News Museum & Gallery  News Film &  Movie Theater News Sports News Weekend Guide Events & Things To Do This Weekend Free  &  Cheap Things To Do This Weekend Food & Drink Events Event Calendar Submit Event Things To Do Top 10 Things To Do In Orlando Monthly Events Guide Theme Park Guide Attractions Guide Water Park Guide Dinner Show Guide Concerts & Music Guide Theater & The  Arts Guide Events & Festival Guide Restaurant Guide Bars & Nightlife Guide Movie Theater Guide Museums & Gallery Guide Shopping Guide Seasonal Valentine's Day Guide St Patrick's Day Guide Easter Guide Mother's Day Guide Father's Day Guide Memorial Day Guide 4th Of July Guide Halloween Guide Thanksgiving Guide Holiday & Christmas Guide New Year's Eve Guide What's New Contact Contact Us Newsletter About Us Advertise More Use tab to navigate through the menu items. The Latest News Oviedo Park Pub announces two-day Grand Opening Celebration Sept. 6 and 7 Alastair Mac Aug 26, 2024 2 min read Oviedo Park Pub offers craft cocktails, non-alcoholic drinks, craft beer and wine. Oviedo Park Pub serves as an event space and a place for customers of any micro-restaurant to gather and enjoy their meals. Pop the cork and raise a glass — Oviedo Park Pub is celebrating its grand opening with a two-day extravaganza on Friday, Sept. 6 and Saturday, Sept. 7, 2024. Oviedo Park Pub is under entirely new ownership, and the former Factory Bar space received an overhaul to become more inviting and vibey, with Oviedo Park Pub encouraging guests to meet, mingle and stay awhile. The latest bar, club and nightlife news from Orlando and throughout Central Florida. On Friday, Sept. 6 Oviedo Park Pub will officially open at 4 pm, kicking off two days of grand opening festivities including the following specials: One hour of free Michelob Ultra Drafts, select specialty cocktails and house wine from 5 - 6 pm., complimentary light bites, live entertainment, happy hour, and late-night happy hour specials all weekend long. Discover more of the latest events and things to do in Orlando with Gotta Go Orlando! Oviedo Park Pub is now owned by Brianna Feldman, owner of Buttercrust Pizza. A hospitality industry veteran, Feldman revitalized the event-friendly space to create a welcoming atmosphere with a full liquor bar for bourbon sippers, whiskey lovers, sports viewers and those who enjoy a friendly neighborhood pub. Enhancements to the newly renovated space include 15 new TVs and a 140-inch projector to watch the NFL Ticket, cushy tufted leather seating throughout and a central racetrack bar, perfect for enjoying a glass of wine or a cold beer. The specialty beverage menu features a rotating offering of unique whiskeys, bourbons, craft beer selections and hand-crafted seasonally changing drinks. As guests sip and socialize, they have the ability to order food from any of the six restaurants at The Food Factory and enjoy it within Oviedo Park Pub. For more information: https://ffoviedo.com/oviedoparkpub/ . We encourage you to be part of the local conversation, comment on this latest news below, and feel free to share this article on your social media channels. All the latest feel good news and more from Orlando and throughout Central Florida . Gotta Go Orlando offers the best and most up to date entertainment news, together with all the latest events and things to do throughout Central Florida. We feature the latest entertainment news daily, including concerts, theater, culture, nightlife, food & drink. theme parks, attractions, festivals, events, and more. With news and information being released on a daily basis, we encourage you to sign up for our newsletter and stay in the loop with all the latest exciting news from our local community. Yo can also join the local conversation on X , Facebook , Instagram , and YouTube . Contact Us Got a story to tell Orlando? Contact us now . To advertise with us, click here , and to list your upcoming event with us, submit it here . We love to help spread the word on whats happening in our local community! Tags: Oviedo Orlando Bar,  Club & Nightlife News Florida News Central Florida News Meet The GGO Team Emma Walton News Producer Contact Shane Walton News Producer Contact Alastair Mac News Editor Contact The Latest Headlines Popcorn Flicks in the Park is back with a free outdoor screening of Disney’s Encanto! The action-packed excitement of Monster Jam returns to Orlando's Camping World Stadium on January 10 The phantom awaits… Check out Helena Modern Riviera's Phantom of the Opera Halloween Overlay! Florida State University and Texas A&M to face off in 'The Battle in the Bay' in Tampa on November 28 Sparrow Wine Bar and Lounge officially opens in Downtown Orlando Your Orlando Plans Are Here Orla n do Events This Weekend​ Orlando Events This Month Things To Do In Orlando Gotta Go Orlando is your local source for the latest entertainment news , events and things to do throughout Central Florida. We feature concerts , theater, arts & culture , nightlife , food & drink . theme parks & attractions, festivals, events , and more. © 2025  Gotta Go Orlando  -  All Rights Reserved Privacy Policy bottom of page"
    },
    {
      "url": "https://www.realoviedo.es/en/club",
      "text": "Club | Real Oviedo | Web Oficial Skip to main content Club Real Oviedo was founded in the capital of the Principality of Asturias on March 26th, 1926 by the union of Real Stadium Club Ovetense and Real Club Deportivo de Oviedo. The new organization appeared in society with a friendly match in Oviedo against Arenas de Guecho May 1st, 1926. Real Oviedo soon became one of the top teams in Spanish soccer. At the end of the 1932-33 season, they became the first club of the Principality of Asturias to get promoted to First Division. They achieved this recognition at home, at the Buenavista stadium, that had been inaugurated with a match between Spain and Yugoslavia April 24th,1932. Their debut in First Division was extraordinary, since they prevailed Barcelona by 7 goals to 3, which today is still recognized as the best start in the highest category of a team promoted from Second Division in the history of Spanish soccer. Real Oviedo was a candidate for the league title on some occasions, with the famous \"electric forwards\" that were some of the highest scoring in the country. The Spanish civil war truncated their possibilities when they were one of the main favorites to be champions in the 1936-37 season, which was not disputed by the war. Real Oviedo achieved several top category classifications in the history of Spanish football. They qualified in third place, three times in three different seasons, the last one in the 1962/1963 season. Real Oviedo managed in the 1991/1992 season to qualify to compete for their first time in a European competition: UEFA Cup. Throughout decades players like Oscar, Zabala, Lángara, Herrerita, Emilín, Sánchez Lage, Tensi, Galán, Marianín, Carlos, Jokanovic, Duvobský have worn the Real Oviedo blue jerseys .... Football players of international prestige have made the name of Real Oviedo more visable. Real Oviedo plays their home matches at the Carlos Tartiere Stadium. Its auxiliary facilities of El Requexón, patrimony of the own club, are located in the outskirts of the city. The first team and its subsidiary team carry out training there, while the 14 teams with more than 280 children in the youth academy teams carry out their activities in the Tensi facilities. These facilities are located in the sports complex La Pixarra in Oviedo. The number of Real Oviedo season ticket holders reached its peak in the 2015-2016 season with about 21,000. The average of the last decade, in which the team stayed away of the professional soccer, exceeded the 12,000 season ticket holders. Real Oviedo also boasts more than a hundred official supporters clubs spread over three continents and around 50,000 shareholders from more than 125 countries after the club's last capital increase in 2015. Skip to next section Download the app now Legal notice and conditions of use Privacy Policy Cookies Policy PAGINA OFICIAL © Real Oviedo 2022"
    },
    {
      "url": "https://ffoviedo.com/contact-us/",
      "text": "Contact Us - The Food Factory Oviedo Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event REACH OUT Contact Us Home Contact THE FOOD FACTORY OVIEDO Contact Us We are located in the mixed-use community of Oviedo on the Park down the street from Center Lake Park, the Cultural Center & Amphitheatre, Dog Park and other area attractions. Email Us Social@FFOviedo.com Visit Us 888 City Walk Lane Oviedo, FL 32765 1 Step 1 First Name Last Name Phone Email email Message 0 / Submit keyboard_arrow_left Previous Next keyboard_arrow_right FormCraft - WordPress form builder About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Take a Virtual Tour Take a Virtual TourAbout Us Quick Links ABOUT US VIRTUAL TOUR PLAN YOUR EVENT MICRORESTAURANTS VENDOR APPLICATION LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email social@ffoviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://ffoviedo.com/the-experience/",
      "text": "The Experience - The Food Factory Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event MICRO-RESTAURANTS The Food Factory Experience Home The Experience MICRO-RESTAURANTS The Food Factory Experience DescriptionThe Food Factory is more than a dining destination; it's a place where culinary delights meet community spirit. Enjoy our covered outdoor and open-air courtyard spaces, perfect for socializing, dining, and creating memories. BAR Oviedo Park Pub At the heart of The Food Factory lies Oviedo Park Pub, a neighborhood bar. You can find craft cocktails, craft beer, wine, bar games, and lots of TV's in here! Oviedo Park Pub also doubles as an event space, submit an inquiry with us today! LEARN MORE PIZZA Buttercrust Pizza Buttercrust Pizza is not just about pizza; it’s about a pizza experience unlike any other. With a variety of crusts and an endless array of toppings, we cater to all tastes and preferences. Join us for a meal where quality and flavor are always top priorities. learn more AMERICAN COMFORT The Local Hen The Local Hen offers a comforting taste of Southern hospitality right in the heart of Oviedo on the Park. Savor our contemporary take on classic Southern dishes, made with locally sourced ingredients and a lot of love. It’s where good food and good times come together. LEARN MORE MEXICAN The 1 Cantina Inspired by the bustling cantinas of Mexico City, The 1 Cantina brings a slice of Mexican culture to Oviedo. Enjoy our signature dishes, crafted with love and authenticity, and immerse yourself in an atmosphere filled with live music and familial warmth. LEARN MORE ASIAN | VIETNAMESE | THAI Kai Asian Street Fare Experience the vibrant and bold flavors of Asia with Kai Asian Street Fare. Our menu is a curated selection of street food favorites from across the continent, made with fresh ingredients and authentic techniques. It’s a culinary adventure that’s sure to delight. LEARN MORE waffle Press Waffle Co. Press Waffle Co. specializes in fully customizable authentic Belgian waffles, savory waffle creations, and locally roasted coffee. Perfect for breakfast, brunch, or dessert, any time is the right time to waffle! Come try the best waffle you've never had today! Sandwiches Grilled Cheezus Your neighborhood grilled cheese shop, visit us today! LEARN MORE Testimonials What Our visitors say Discover what our customers have to say about their Food Factory Experience! \" ★ ★ ★ ★ ★ The food choices and drinks are awesome! Love the atmosphere and the food choices and drinks are awesome! The spicy margarita was delicious!!! TAMARA JONES 03-29-2024 \" ★ ★ ★ ★ ★ Perfect place to unwind after a long day. Love love love this place. The food is great. The staff is amazing! Perfect place to unwind after a long day. ANNE STARK 02-27-2024 \" ★ ★ ★ ★ ★ There are different food options for everyone The Food Factory is a great place for family and friends to gather. There are different food options for everyone, and the service is great. JULIA M. 03-16-2024 \" ★ ★ ★ ★ ★ Love this spot!! Love this spot!! Service and food is great! MELISSA SIVER 03-11-2024 \" ★ ★ ★ ★ ★ Love hanging at the bar Love hanging at the bar and being able to pick from the various foods while enjoying a good drink. MITCH EUBANKS 03-11-2024 Slider navigation About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://ffoviedo.com/kai-asian-street-fare/",
      "text": "Kai Asian Street Fare - Bold Flavors, Fresh Ingredients Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event Kai Asian Street Fare Home Kai Asian Street Fare ASIAN | VIETNAMESE | THAI Bold Flavors, Fresh Ingredients Experience the vibrant and bold flavors of Asia with Kai Asian Street Fare. Our menu is a curated selection of street food favorites from across the continent, made with fresh ingredients and authentic techniques. It’s a culinary adventure that’s sure to delight. Monday 4:30 PM-9:00 PM Tuesday 4:30 PM–9:00 PM Wednesday 4:30 PM–9:00 PM Thursday 4:30 PM–9:00 PM Friday 11:30 AM–10:00 PM Saturday 11:30 AM–10:00 PM Sunday 11:30 AM-9:00 PM VIEW MENU VIEW MENUBold Flavors, Fresh Ingredients GALLERY Kai Creations CELEBRATE WITH US Host Your Event with Us! Whether you’re planning an intimate gathering, a birthday bash, a corporate meeting, or a special celebration, our unique setting ensures an experience your guests will talk about for years to come. HOST YOUR EVENT CONTACT US Email Us Social@FFOviedo.com Visit Us 888 City Walk Lane Oviedo, FL 32765 About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Quick Links ABOUT US PLAN YOUR EVENT MICRORESTAURANTS LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email Social@FFOviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    },
    {
      "url": "https://oviedocommunitynews.org/2024/09/04/oviedo-park-pub-opens-plus-football-and-live-music/",
      "text": "Oviedo Park Pub opens, plus football and live music – Oviedo Community News Skip to content Search… ♥ Donate Login News Local Guides Menu Toggle Local disaster resource guide Parks guide Landmark guide Oviedo Mural Tour Local Little Libraries Guide Community Favorite Things List Voter Guide Local Events Sept. 11-17 and beyond Newsletter Deep Dives Menu Toggle Sleeping Behind Bars Preserve or Develop? The Race Against Time to Protect Florida’s Wildlife Corridor Housing About Us Menu Toggle Our story Our Mission and Values Our Team Community Advisory Board Editorial Independence and Financial Disclosure Policy Ethics Policy Contact Us OCN in the news More Menu Toggle Classifieds Obituaries Standards for Letters to the Editor Submitted letters to the editor Impact reports Grants, Major Donors and Founding Members Sponsor Us Search… Support Us Support Us Main Menu Oviedo Park Pub opens, plus football and live music It’s a grand opening for Oviedo Park Pub, plus a unique art class, butterfly garden class and more this weekend. By Jenna Greaves ● Events , Oviedo , Seminole County , Winter Springs ● September 4, 2024 The Food Factory Oviedo hosts a grand opening for the Oviedo Park Pub, plus lots of sports and entertainment options locally this weekend. Thursday Watch Oviedo High School’s boys varsity golf team compete against Lake Brantley High School at 3:30 p.m. on Thursday, Sept. 5 at Twin Rivers Golf Club, 2100 Ekana Drive in Oviedo. Learn more . Watch Hagerty High School’s boys varsity golf team compete against Lake Mary High School at 3:30 p.m. on Thursday, Sept. 5 at Twin Rivers Golf Club, 2100 Ekana Drive in Oviedo. Learn more . Get free local news sent to your inbox every Thursday morning. Sign me up! Subscribe to our newsletter! Focus on fitness by going on a run through Oviedo with My Soxy Feet at 6 p.m. Thursday, Sept. 5 at Irish 31 Pub House and Eatery Oviedo, 65 W. Mitchell Hammock Road in Oviedo. Learn more . Friday Celebrate the grand opening weekend of Food Factory’s newest restaurant, Oviedo Park Pub, from 3-11 p.m. Friday, Sept. 6 at 888 City Walk Lane in Oviedo. Listen to Sunglasses at Night perform live from 7-11 p.m. at the event. The festivities will continue from 5-11 p.m. Saturday, Sept. 7. Learn more . Enjoy a night of live music by Thomas Watkins from 7-10 p.m. Friday, Sept. 6 at Spill Wine Bar, 1196 Tree Swallow Drive, Suite 1314, in Winter Springs. Learn more . Cheer on Oviedo High School’s boys varsity football team as they go head-to-head with Lake Brantley High School from 7-10 p.m. Friday Sept. 6 at Oviedo High School’s John Courier Field, 601 King St.. Learn more . Dance the night away with a live DJ and discount drinks at a late-night happy hour from 7-11 p.m. Friday, Sept. 6 at Pepe’s Cantina Mexican Grill, 3100 Alafaya Trail in Oviedo. Learn more . Saturday The Oviedo Farmers Market is this Saturday. (Photo by the Oviedo Photo Club) Shop until you drop for fresh produce from 8 a.m. to 1 p.m. Saturday, Sept. 7 at the Oviedo Farmers Market, 200 W. Broadway St. Learn more . Make your own butterfly garden from 10-11 a.m. Saturday, Sept. 7 at Lukas Nursery, 1909 Slavia Road in Oviedo. Tickets are $40 for participants and $10 for non-participants. Learn more . Practice self defense with a three–part series on Hanshi Kelley’s knife form that will cover the detailed movements of martial arts from 10 a.m. to 1 p.m. Saturday, Sept. 7 at North Wind Martial Arts Academy, 1753 W. Broadway St. in Oviedo. The series costs $40 for each part. Learn more . Create your own mini clay pig from 11 a.m. to 1:30 p.m. Saturday, Sept. 7 at Songbirds Music, Art, & Dance Center, 181 E. Mitchell Hammock Road in Oviedo. Tickets are $20 to craft. Learn more . Make a splash at the Lake Monroe Sailing Association pirate-themed pool party from 1-8 p.m. at Live Oak Pool and Clubhouse, 1901 Live Oak Reserve Blvd. in Oviedo. Learn more . Cheer on the University of Central Florida’s football team as they face the Sam Houston State Bearkats for Family Weekend at 6:30 p.m., Saturday, Sept. 7 at the FBC Mortgage Stadium, 4465 Knights Victory Way in Orlando. Learn more . Listen to live music by Clint and Laila from 7-10 p.m. Saturday, Sept. 7 at Spill Wine Bar, 1196 Tree Swallow Drive, Suite 1314, in Winter Springs. Learn more . Sunday Challenge friends and family to a board game night from 12:30-7 p.m. Sunday, Sept. 8 at Oviedo Brewing Company, 1280 Oviedo Mall Blvd., Suite 1095. Tickets cost $5. Learn more . Learn the mental healing power of acupuncture from 4-5:30 p.m. Sunday, Sept. 8 at Sacred Moments Massage & Healing Center, 995 Westwood Square in Oviedo. It costs $35 to attend. Learn more . Enjoy breakfast and learn about Temple Israel Sisterhood at 10 a.m. Sunday, Sept. 8 at Temple Israel Orlando, 50 S. Moss Road in Winter Springs. Learn more . Future Events Pay tribute to those affected by 9/11 with a remembrance ceremony from 8:30-9 a.m. Wednesday, Sept. 11 at the Winter Springs Police Department, 300 N. Moss Road in Winter Springs. Learn more . Honor the lives lost in the 9/11 tragedy with a commemoration ceremony and flag retirement from 12-12:30 p.m. Wednesday, Sept. 11 at American Legion Oviedo Memorial Post 243, 491 W. Broadway. Learn more . Sip on something sweet at Tuscany Wines’ wine tasting from 7-9 p.m. Thursday, Sept. 12 at Spill Wine Bar, 1196 Tree Swallow Drive, Suite 1314, in Winter Springs. The event is free for club members and $15 for non-members. Learn more . Enjoy a symphony of sounds at the opening night of St. Luke’s Concert Series from 7-9 p.m. Friday, Sept. 13 and 2-4 p.m. Saturday, Sept. 14 at St. Luke’s Lutheran Church, 2021 W. State Road 426 in Oviedo. Learn more. Grow your knowledge about tomatoes at the All About Tomatoes Seminar from 10-11 a.m. at Lukas Nursery, 1909 Slavia Road in Oviedo. Tickets cost $10 for attendees. Learn more . Play trivia with the Oviedo Community News team and celebrate three years of public service journalism in the community from 6-9 p.m. Tuesday, Sept. 17 at Spill Wine Bar, 1196 Tree Swallow Drive, Suite 1314, in Winter Springs. Space is limited. Learn more . Enjoy a three-day celebration of Oktoberfest from 5-9 p.m. Thursday, Sept. 26; 4-9 p.m. Saturday, Sept. 27; and 5-9 p.m. Saturday, Sept. 28 at Center Lake Park, 299 Center Lake Lane in Oviedo. The event is free to attend, with beer punch cards available for $25. Learn more . Regular Events Dementia-Friendly Dining is every Tuesday from 2-5 p.m. at Perkins Restaurant, 701 E. State Road 434 in Winter Springs; every Wednesday from 2-5 p.m. at the Town House Restaurant, 139 N. Central Ave. in Oviedo; and every Monday, Tuesday, Wednesday and Thursday from 2-4 p.m. at Pepe’s Cantina, 3100 Alafaya Trail in Oviedo. Families and friends may bring their loved ones who are living with dementia to a friendly, safe, and enjoyable meal. Learn more . Mondays Enjoy “Mingle Mondays” with varied activities every Monday from 10 a.m.-noon at Palm Medical Centers, 220 Alafaya Woods Blvd. in Oviedo. Anyone aged 65 and older can participate in a different activity every week, such as rock painting, charades, bingo, trivia and more. Learn more. Take part in four rounds of live pub-style trivia with the Five Minute Professor from 7-9 p.m. every Monday at Rock & Brews, 7131 Red Bug Lake Road in Oviedo. Questions cover topics such as history, geography, pop music, TV shows, science, nature, movie stars and space travel. Prizes are given every week, and a raffle takes place on the last Monday of every month. Enjoy happy hour before and after trivia. Learn more . Take part in twice-a-week yoga sessions at 9 a.m. every Monday and 3 p.m. every Thursday at Oviedo Woman’s Club, 414 King St. Learn more . Tuesdays Take a yoga class every Tuesday morning at 10 a.m. with Don Cross at the Rural Heritage Center, 101 E. Main St. in Geneva. The class meets in the Lake Jessup Room. Text Don at 407-415-3809 for more information. Take a run through Oviedo’s historic downtown every Tuesday night with Oviedo Run Club. Most folks who attend this casual social run start the run just before 6 p.m. Participants start in the parking lot of the Historic Celery Precooler, located at 159 N. Central Ave. and run the distance of their choice along the Cross Seminole Trail. New members get a free T-shirt. Learn more . Join Oviedo Brewing Run Club’s Tuesday Night Run from 6:30-10 p.m. at 1280 Oviedo Mall Blvd. Participants gather at the front of Oviedo Brewing Company every Tuesday evening and start the run at 6:30 p.m. Adventure Cycling offers two night bicycle rides a week. Enjoy a No Rider Left Behind ride for the whole family from 6:30-9:30 p.m. on Tuesday nights. Learn more . Practice calming yin meditation on Tuesdays from 6-7:15 p.m. at Our Suite Village, 1750 W. Broadway St., Suite 112, in Oviedo. The first class is $5 and regular classes are $15. Text Cathy at 786-520-6736 to reserve a spot and learn more. Wednesdays Join The Geneva Village Homemakers at 10 a.m. the second Wednesday of every month at the Geneva Community Center, 161 First St. in Geneva. The all-age group has a book club, a cards and games club, and a dinner club. Learn more, call 407-349-0040. Make unique greeting cards during card classes from 2-4 p.m. or 6-8 p.m. every Wednesday at BeauQCreations, 1327 W. Broadway St. in Oviedo. Learn more . Sing your heart out at Open Mic Nite every Wednesday from 6-9 p.m. at Spill Wine Bar, 1196 Tree Swallow Drive in Winter Springs. Enjoy drink specials, food options and live music. Learn more . Enjoy live traditional Irish music sessions every Wednesday from 6-9 p.m. at Irish 31 Oviedo, 65 W. Mitchell Hammock Road. Learn more . Experience community acupuncture on Wednesdays from 9 a.m. to 5 p.m. at Zen Space Wellness, 1945 W. County Road 419, Suite 1111, in Oviedo. Prices range from $25-50. Pay what you can afford for 30-60 minutes. Call Melanie at 407-488-8830 to schedule an appointment and learn more. Test your skills at a weekly chess meetup with Seminole County Chess from 6-9 p.m. every Wednesday at the Oviedo Mall Food Court, 1700 Oviedo Mall Blvd. Learn more. Pub-style trivia with the Five Minute Professor takes place from 7-9 p.m. every Wednesday at Gator’s Dockside, 167 E. Mitchell Hammock Road in Oviedo. Prizes are given every week, and a raffle takes place the last Wednesday of every month. Enjoy an all-you-can-eat boneless wings special on Wednesday. Learn more . Thursdays Get an intense workout at Adventure Cycling’s Throwdown ride from 6:30-9:30 p.m. every Thursday. Learn more . It starts at 1491 E. State Road 434, Suite 110, in Winter Springs. Join local veterans every Thursday for a Burger Night event from 5-7 p.m. at the Winter Springs Veterans of Foreign Wars Post 5405, 420 N. Edgemon Ave. Learn more . The Irish 3.1 Run Club meets every Thursday at 6:30 p.m. at Irish 31, 65 W. Mitchell Hammock Road in Oviedo. Learn more . Attend Oviedo Jeep Club’s monthly meetup from 6-8 p.m. on the second Thursday of each month at varying locations. Mingle with other Jeep owners while enjoying food and drinks. Learn more . Play trivia from 7-9 p.m. every Thursday at Oviedo Oyster House, 1340 Alafaya Trail. Learn more . Race your radio controlled car at a Seven Tails Circuit event at 7 p.m. every Thursday at the Oviedo Mall, hosted by the Orlando Mini Z Club. The event invites folks to come “test, tune and race.” Learn more . Fridays Join the “Fabulous Fridays” tea party every Friday from 10 a.m. to noon at Palm Medical Centers, 220 Alafaya Woods Blvd. in Oviedo. Anyone aged 65 and older can play games while enjoying music, pastries and tea. Enjoy Free Bingo Night at District Eat and Play Oviedo every Friday night from 6-7 p.m. at 1395 Oviedo Mall Blvd. Learn more . Saturdays Attend karaoke night at Oviedo Oyster House at 9 p.m. every Saturday at 1340 Alafaya Trail. Learn more . Get ready to cycle with a Breakfast Ride every Saturday from 8-11 a.m. at Adventure Cycling, 1491 E. State Road 434, Suite 110 in Winter Springs. Ride either 8 or 20 miles and enjoy a potluck-style breakfast afterward at this free event. Learn more . Be a bookworm with storytime at B. Dalton Bookseller at 1 p.m. every Saturday and Sunday at Oviedo Mall, 1700 Oviedo Mall Blvd. Kids can enjoy snacks and activities while improving their literary skills. Learn more . Sundays Attend breakfast by the river every Sunday from 10 a.m. to noon at Barr Trail, 851 Barr St. in Oviedo. This is a family-and-dog-friendly event that offers fruit, tea and more. Learn more . Get up on stage and share your talent for open mic night from 8 p.m. to midnight every Sunday at Muldoon’s Saloon, 7439 Aloma Ave. in Winter Park. Learn more . Bring your differently abled child to Special Needs Open Gym from 2-3 p.m. monthly on Sundays at United Gymnastics Academy Oviedo, 542 S. Econ Circle. The cost is $5. Learn more . The Museum of Geneva History is open from 2-4 p.m.  every second and fourth Sunday at 165 First St. Admission is free, but donations are appreciated. See local archaeological finds, pioneer crafts, family records and Civil War information. Learn more by calling 407-349-5697. Sorry for the interruption but please take 1 minute to read this. The news depends on it. Did you know each article on Oviedo Community News takes anywhere from 10-15 hours to produce and edit and costs between $325 and $600? Your support makes it possible. We believe that access to local news is a right, not a privilege, which is why our journalism is free for everyone. But we rely on readers like you to keep this work going. Your contribution keeps us independent and dedicated to our community. If you believe in the value of local journalism, please make a tax-deductible contribution today or choose a monthly gift to help us plan for the future. Thank you for supporting Oviedo Community News! With gratitude, Megan Stokes, OCN editor-in-chief SUPPORT OVIEDO COMMUNITY NEWS Thank you for reading! Before you go... We are interested about hearing news in our community! Let us know what's happening! Reach out Share a story! Author Jenna Greaves Jenna is a senior print/digital journalism major with a political science/pre-law minor at the University of Central Florida. The journalist in her lives for exploring the world and learning as she goes. She loves getting to know people and absorbing knowledge. Over the years, she has written for multiple publications such as UCF’s student newspaper NSM Today , the Sanford Herald , Central Florida Lifestyle magazine and Z88.3 F.M. Related Articles Oviedo hears proposals for new events, increased Independence Day funding By Kathryn Brudzinski ● News ● September 3, 2025 New Oviedo events could be coming, but a profitable summer cookout event may be cut to help pay for them. Read More » Seminole County expected to increase property taxes next week By Abe Aboraya ● News ● September 3, 2025 Oviedo and Winter Springs also to set millage rates, but keep them flat. Seminole County tax hike trying to make up for a $35M shortfall. Read More » Oviedo mayoral race challenger candidate withdraws from election By Kathryn Brudzinski ● Oviedo ● August 27, 2025 After a candidate dropped out, Oviedo may not have an election at all unless someone qualifies to be a candidate by Sept. 4. Read More » Subscribe to our newsletter Sign up You can unsubscribe from the newsletter at any time. Have a question? Contact us or review our privacy policy for more information. Local Little Libraries Guide By Makayla Gray , Juergen Boehmer & Jenna Greaves ● News ● January 2, 2025 Now you can find the little libraries dotting Greater Oviedo and Winter Springs, and learn the stories behind them. Parks guide By Lily Kyle ● News ● January 4, 2023 Overlook Park. Photo by Lily Kyle. There are so many parks in Oviedo, Winter Springs, Geneva and Chuluota that OCN wanted to create a guide to help our readers more easily find and enjoy them. Get details on each park, including whether or not there’s a playground or picnic tables, bathroom availability, whether the park […] Oviedo Mural Tour By Taylor McManus & Maria Panicheva ● News ● December 13, 2023 Colorful dogs, a rainbow backdrop, cascading pasta and an artful history lesson await on OCN's 11-stop Mural Tour. News Local Guides Menu Toggle Local disaster resource guide Parks guide Landmark guide Oviedo Mural Tour Local Little Libraries Guide Community Favorite Things List Voter Guide Local Events Sept. 11-17 and beyond Newsletter Deep Dives Menu Toggle Sleeping Behind Bars Preserve or Develop? The Race Against Time to Protect Florida’s Wildlife Corridor Housing About Us Menu Toggle Our story Our Mission and Values Our Team Community Advisory Board Editorial Independence and Financial Disclosure Policy Ethics Policy Contact Us OCN in the news More Menu Toggle Classifieds Obituaries Standards for Letters to the Editor Submitted letters to the editor Impact reports Grants, Major Donors and Founding Members Sponsor Us Support Us Support Us Login Search for: News Local Guides Menu Toggle Local disaster resource guide Parks guide Landmark guide Oviedo Mural Tour Local Little Libraries Guide Community Favorite Things List Voter Guide Local Events Sept. 11-17 and beyond Newsletter Deep Dives Menu Toggle Sleeping Behind Bars Preserve or Develop? The Race Against Time to Protect Florida’s Wildlife Corridor Housing About Us Menu Toggle Our story Our Mission and Values Our Team Community Advisory Board Editorial Independence and Financial Disclosure Policy Ethics Policy Contact Us OCN in the news More Menu Toggle Classifieds Obituaries Standards for Letters to the Editor Submitted letters to the editor Impact reports Grants, Major Donors and Founding Members Sponsor Us Oviedo Community News informs and connects Greater Oviedo and Winter Springs through independent, public-service journalism. As your nonprofit newsroom, we focus on issues that you tell us matter to you. Oviedo Community News was incorporated as Central Florida Community News Inc to build toward a larger goal of finding solutions for as many local news deserts as possible. Read us on Google News Sign up for The Early Bird Wake up to all the Greater Oviedo and Winter Springs news you need to know every Thursday morning. Subscribe You can unsubscribe at any time.  Have a question? Contact us or review our privacy policy for more information. Contact Us Login Notices Planned Gifts Sponsor Us Donate Today Oviedo Community News is a member of Copyright © 2025 Oviedo Community News | Powered by Indiegraf Media Privacy Policy | Subscription Agreement | Terms of Use | Editorial Independence and Financial Disclosure Policy Username or Email Address Password Remember Me Scroll to Top"
    },
    {
      "url": "https://ffoviedo.com/about-the-food-factory/",
      "text": "About Us - The Food Factory Home About Us Plan Your Event FAQ Micro-Restaurants Oviedo Park Pub Buttercrust Pizza The Local Hen Tacos My Guey Kai Asian Street Fare Press Waffle Co. Grilled Cheezus Live Entertainment Join Our Team Contact Us Terms & Conditions Privacy Policy Host Your Event About Us Our Story and Vision Home About Us ABOUT US The Food Factory Story and Vision Crafting Culinary Experiences in the Heart of Oviedo Welcome to The Food Factory, not just a place to eat, but a community hub nestled in the vibrant Oviedo on the Park. Our story begins with a vision to create a unique dining destination that celebrates the diversity of flavors, cultures, and culinary talents. We're more than a collection of restaurants; we're a gathering place where families, friends, and food lovers can come together to share meals and create memories. Visit us at The Food Factory and experience the joy of shared meals and the warmth of community dining. Our Mission To offer an unparalleled dining experience by hosting a diverse array of micro-restaurants under one roof, each bringing its own unique flavor and flair to the table. We aim to support local chefs and entrepreneurs, providing a platform for them to showcase their culinary creations to the wider community. Our Community At The Food Factory, community comes first. We are committed to creating a welcoming, inclusive atmosphere where every guest feels at home. Our location in Oviedo on the Park underscores our dedication to being an integral part of the local fabric, contributing to the area's vibrancy and charm. Our Culinary Philosophy Quality, creativity, and diversity drive our culinary philosophy. From authentic Mexican cuisine and Asian street fare to Southern comfort food and artisanal pizzas, our micro-restaurants cater to a wide range of tastes and dietary preferences. We believe in using fresh, locally-sourced ingredients to craft dishes that delight the senses and nourish the soul. Looking Ahead As we look to the future, The Food Factory is excited to continue expanding our culinary offerings, hosting events, and strengthening our ties to the Oviedo community. We're not just building a food destination; we're fostering a space where culture, cuisine, and community meet. CELEBRATE WITH US Host Your Event with Us! Whether you’re planning an intimate gathering, a birthday bash, a corporate meeting, or a special celebration, our unique setting ensures an experience your guests will talk about for years to come. HOST YOUR EVENT Contact Us Testimonials What Our Visitors Say Discover what our customers have to say about their Food Factory Experience! \" ★ ★ ★ ★ ★ The food choices and drinks are awesome! Love the atmosphere and the food choices and drinks are awesome! The spicy margarita was delicious!!! TAMARA JONES 03-29-2024 \" ★ ★ ★ ★ ★ Perfect place to unwind after a long day. Love love love this place. The food is great. The staff is amazing! Perfect place to unwind after a long day. ANNE STARK 02-27-2024 \" ★ ★ ★ ★ ★ There are different food options for everyone The Food Factory is a great place for family and friends to gather. There are different food options for everyone, and the service is great. JULIA M. 03-16-2024 \" ★ ★ ★ ★ ★ Love this spot!! Love this spot!! Service and food is great! MELISSA SIVER 03-11-2024 \" ★ ★ ★ ★ ★ Love hanging at the bar Love hanging at the bar and being able to pick from the various foods while enjoying a good drink. MITCH EUBANKS 03-11-2024 More about us Slider navigation About Us Discover Oviedo's culinary gem - where flavors meet and memories are made. Welcome to The Food Factory, your local hub for diverse dining and vibrant gatherings. Read More Take a Virtual Tour Take a Virtual TourAbout Us Quick Links ABOUT US VIRTUAL TOUR PLAN YOUR EVENT MICRORESTAURANTS VENDOR APPLICATION LIVE ENTERTAINMENT JOIN THE TEAM The Food Factory Email social@ffoviedo.com ADDRESS 888 City Walk Ln, Oviedo, FL 32765 HOURS SUN: 11:30AM-12AM MON: 4PM-12AM TUES: 4PM-12AM WED: 4PM-1:30AM THUR: 4PM-1:30AM FRI: 11:30AM-1:30AM SAT: 11:30AM-1:30AM © Your Brand Voice 2024 . All rights reserved. Back to Top Table Reservation Submit Δ"
    }
  ]
}