{
  "fuentes": [
    {
      "url": "https://fiddlersgreen.pub/menu-1",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://fiddlersgreen.pub/menu-1",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.fiddlersgreen.com.au/",
      "email": "fiddlersdarwin@bigpond.com.au"
    },
    {
      "url": "https://fiddlers-moers.com/about-us/",
      "email": "info@fiddlers-moers.com"
    },
    {
      "url": "https://fiddlers-moers.com/about-us/",
      "email": "info@fritzpatricks.com"
    },
    {
      "url": "https://fiddlers-moers.com/about-us/",
      "email": "info@solidground-media.com"
    },
    {
      "url": "https://fiddlers-moers.com/about-us/",
      "email": "magnifier@2x.png"
    },
    {
      "url": "https://fiddlersgreenbar.com/",
      "email": "matt@pixelspread.com"
    }
  ],
  "mails": [
    "fiddlersdarwin@bigpond.com.au",
    "filler@godaddy.com",
    "info@fiddlers-moers.com",
    "info@fritzpatricks.com",
    "info@solidground-media.com",
    "magnifier@2x.png",
    "matt@pixelspread.com",
    "team@latofonts.com"
  ],
  "nombre_sitio": "fiddlersgreen.pub",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fiddlersgreen.pub/menu-1",
      "text": "MENU PUB FOOD DRINKS Beers Spirits Wines FIDD'S TOUR BOOK EVENT 5K CHARITY RUN OPPORTUNITIES CONTACT US More PUB FOOD DRINKS Beers Spirits Wines FIDD'S TOUR BOOK EVENT 5K CHARITY RUN OPPORTUNITIES CONTACT US Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com PUB FOOD DRINKS Beers Spirits Wines FIDD'S TOUR BOOK EVENT 5K CHARITY RUN OPPORTUNITIES CONTACT US Account My Account Sign out Sign In My Account LUNCH  |  BRUNCH  |  DINNER Brunch  11am - 3pm  Saturday & Sunday At our Irish pub, every meal celebrates tradition, flavor, and hospitality. From classic fish and chips to hearty shepherd’s pie, our menu offers a delicious mix of authentic Irish dishes, made with fresh, local ingredients. Enjoy great food, warm company, and a taste of Ireland’s rich culinary heritage. Sláinte! Whole menu served during Brunch PLUS Lunch Specials! Serving Hours: Mon - Thu   11:30am - 11:00pm Fri   11:30am - Midnight Sat   11:00am - Midnight Sun   11:00am - 10:00pm *Limited late night menu available each day Food Menu Download Brunch Menu Download Daily Specials – A Taste of Tradition, Freshly Prepared Craving something new? Our daily specials feature fresh, seasonal ingredients and classic Irish flavors. From hearty stews to lighter bites, there’s always a tasty surprise. Ask your server about today’s offerings—your new favorite dish might be waiting! Feel free to call or ask your waiter for details. Appetizers IRISH EGG ROLLS $10.95 Three large spring rolls of Corned Beef & Cabbage, with Thousand Island sauce for dipping SCOTCH EGG $9.50 Hard-boiled egg encased in Irish-style sausage meat SMOKED FISH DIP $9.95 House-Made delicately-smoked fish served with crackers, veggie sticks jalapeños DUBLIN BAY SHRIMP COCKTAIL $12.95 Five jumbo shrimp served over a bed of shredded lettuce and our homemade Irish-style cocktail GALWAY MUSSELS $17.95 10 large mussels in a white wine cream sauce, served with dinner rolls SLICED SMOKED SALMON* $19.95 With minced shallots, capers, chopped hard-boiled egg, assorted crackers, and homemade garlic boursin WEXFORD WINGS Jumbo chicken wings, fried crisps, served with celery, carrots & house m a d e blue cheese dressing. 6 wings...$12.50 8 wings...$15.50 Tossed in your choice of our house-made sauces, add $1.25 - Original Buffalo - Buffalo Honey - Bombay Curry - BBQ Guinness CHICKEN TENDERS $13.95 Three large, battered, fried plump chicken tenders served with celery, carrot sticks and our house made blue cheese Tossed in your choice of our house-made sauces, add $1.25 - Original Buffalo - Buffalo Honey - Bombay Curry - BBQ Guinness CHIPS & SALSA $5.95 Yellow corn tortilla chips, salsa with chopped onion and fresh cilantro LOADED POTATO WEDGES $12.50 Our Famous potato wedges covered in melted cheese, bacon and sour cream BOXTY POTATO PANCAKES $5.95 Irish-style potato pancakes - with sour cream & chives $11.50 - with melted cheddar $12.50 - with smoked salmon* $19.95 SPINACH AND CHEESE DIP $9.50 Steamed spinach lightly seasoned and blended with four cheeses; served with tortilla chips WEDGE SALAD $7.95 Traditional favorite w e d g e of Iceberg lettuce topped with bacon bits, chopped tomatoes & blue cheese Sides & Such Add a description about this category FAMOUS FIDDS POTATO WEDGES $7.50 Award-winning potato wedges CEILI CHIPS $7.95 Homemade thin-sliced deep fried potato crisps CHAMP $5.95 Belfast recipe for mashed potatoes with chives FRESH VEGGIE MEDLEY $5.95 Consisting of sautéed yellow squash, zucchini, red onions and red and green peppers COLCANNON $5.95 Mashed potatoes mixed with cabbage, a Dublin favorite APPLESAUCE $2.95 SAUTÉED MUSHROOMS $4.50 Soups Cup $4.50   |  Bowl $6.50  |  Add cup of soup or side salad with any entree $3.95 POTATO & LEEK Our own special recipe and a pub favorite! topped with bacon, chives scallion & crumbled cheddar SOUP OF THE DAY $7.95 Ask your server about our chef's creation! Traditional Irish Fare FISH AND CHIPS $20.95 Three large center-cut filets of Atlantic Cod dipped in beer-batter, fried golden brown and served with our award-winning potato wedges and home made remoulade sauce HEN IN A POT $16.50 Tender chicken breast, carrots, celery, and onions seasoned in thick gravy and served in a crock pot with pastry crust and champ SHEPHERD'S PIE $15.95 Tender chicken breast, carrots, celery, and onions seasoned in thick gravy and served in a crock pot with pastry crust and champ - add grated cheddar topping for $1 IRISH STEW $22.95 Lean corned beef served o n a bed of steamed shredded cabbage with carrots, potatoes, a n d caramelized pearl onions, with parsley sauce o n the side BANGERS AND MASH $18.95 Three large Irish-style pork sausages, grilled and served with champ caramelized pearl onions and brown gravy STEAK TIPS* $19.95 Tender bites of grilled ribeye in a rich wine sauce, served with fresh vegetables and choice of potato GAELIC STEAK $23.95 8 oz. Grilled Salmon filet, served with mixed grilled vegetables, mashed potatoes and a side of paisley sauce Fiddler's Burgers An 8 oz. prime Angus patty cooked to your liking, with lettuce, tomato, and onion on the side, served with our famous potato wedges *see consumer advisory. CONNAUGHT BURGER $14 Served perfectly plain LEINSTER BURGER $15.50 Topped with your choice of Swiss or Cheddar cheese MUNSTER BURGER $15.50 Topped with bbq Guinness sauce and beer battered onion rings ULSTER BURGER $17.50 Our premium burger topped with Irish-style bacon and cheddar cheese PATRICIO BURGER $17.50 Topped with chili and cheddar cheese 32 BURGER $18.50 Topped with Swiss or Cheddar, Irish-style bacon, beer-battered onion rings and bqq Guinness sauce Sandwiches All sandwiches are served with a side of our famous potato wedges. FLAGSTONE CHICKEN $12.95 Grilled chicken breast on a ciabatta roll, with lettuce, tomato and onion - add $1 for swiss or cheddar cheese BOOKMAKER SANDWICH $19.95 The Irish version of a ribeye steak sandwich, with sweet grilled onions and peppers. A Galway Races favorite! IRISH REUBEN $12.95 Thin-sliced corned beef on marble rye, with sauerkraut a n d swiss, served with Thousand Island dressing on the side FIDD'S FISH SANDWICH $18.50 Atlantic Cod blackened or fried, served on a ciabatta roll with lettuce, tomato, onion and a side of homemade remoulade sauce CORNED BEEF SANDWICH $11.50 Thin-sliced a n d piled high on a ciabatta roll - add $1 for melted swiss or cheddar BUFFALO CHICKEN $12.95 Two large, breaded chicken tenders tossed in buffalo sauce and served on a ciabatta roll with lettuce, tomato, onion and a side of bleu cheese Salads Extra dressings or sauces add $1 per serving. HOUSE SALAD $11.95 Field greens, romaine, cucumber, tomato, red onions, shredded cheddar and crumbled bacon, served with your choice of Bleu Cheese, Buttermilk Chive, Honey Mustard, Balsamic Vinaigrette, Raspberry Vinaigrette or Thousand Island dressing on the side CAESAR SALAD $11.95 Romaine, fresh parmesan, homemade croutons, tossed in Caesar dressing House or Caesar Salad available with: - grilled chicken add $4 - fried chicken add $4 - blackened cod add $6 - smoked salmon add $10 - grilled salmon add $12 Extra dressings or sauces add $1 per serving DESSERTS BREAD AND BUTTER PUDDING $7.95 Homemade fresh bread and raisins baked in a custard, and served with a whiskey caramel sauce. An Irish country favorite JACK DANIELS CHOCOLATE CAKE $8.95 Dark chocolate whiskey cake, topped with chocolate frosting *Consumer Advisory: There is a risk associated with the consumption o f raw or undercooked beef, poultry & fish, including smoked salmon. PUB FOOD FIDD'S TOUR BOOK EVENT 5K CHARITY RUN OPPORTUNITIES CONTACT US Fiddler’s Green Irish Pub & Eatery 📞 407.645.2050 |  📧 fiddspub@gmail.com © 2025 Fiddler’s Green Irish Pub & Eatery - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.fiddlersgreen.com.au/",
      "text": "Fiddler's Green - Darwin | Family Friendly Irish Restaurant fiddlersdarwin@bigpond.com.au 3A & 3B Building 1, 19 Kitchener Drive, Darwin Waterfront NT, 0800 Our Menus Order via phone About Menus Contact Us Fiddler's Green Takeaway Now Available Fiddler’s Green Darwin Contact Us View Our Menus Call Us: 08 8981 2222 2 Happy Hours from 4pm Daily Gift Voucher Find Out More Company Information ﻿ D3A & 3B Building 1, 19 Kitchener Drive, Darwin Waterfront NT, 0800 08 8981 2222 fiddlersdarwin@bigpond.com.au Monday to Thursday: 11:00 am – Late Saturday & Sunday: 8:00 am - Late (Kitchen closes 9pm Sunday to Thursday & 9.30pm Friday & Saturday) Delivery available via Uber & DoorDash Company Information ﻿ D3A Building 1, 19a Kitchener Drive, Darwin Waterfront NT, 0800 08 8981 2222 fiddlersdarwin@bigpond.com.au Monday to Friday: 11:00 am – Late Saturday & Sunday: 8:00 am - Late (Kitchen closes 9pm Sunday to Thursday & 9.30pm Friday & Saturday) Delivery available via Uber & Doordash Site Links About Menus Contact Us Find out More © 2025 All Rights Reserved | Fiddlers Green Share by:"
    },
    {
      "url": "https://fiddlers-moers.com/about-us/",
      "text": "About Us - Fiddlers Irish Pub Toggle navigation About us Live Events Celtic Saal Food & Drinks Speisekarte Getränkekarte Kontakt About Us: We first opened our doors in September 1999. We are an irish owned with an irish management team. We pride ourselves by being authentic – bringing a touch of Ireland to the heart of Moers. We have made great friends here who have remained loyal customers throughout the years. We provide seating to up to approximately 160 guests indoors. Our Biergarten in Summer has approximately seating for 85 guests. Our Kitchen: Food plays a great role in our daily business.  We are extremely proud of our kitchen.  Our dishes are homemade and from fresh ingredients.  We receive our  goods from local suppliers and has also been involved in Moers receiving its FairTrade Town recognition. Take a look at our food menu.  It has been carefully chosen to suit every taste bud but with an added irish note! Our ``Draughts``: Als echter „irischer Pub“ bieten wir Ihnen natürlich eine große Auswahl von GUINNESS, Kilkenny und internationalen Bieren, sowie diversen irischen und schottischen Whiskys an. Our Events: Bei unseren beliebten Partys zu Karneval, St. Patricks Day, Halloween und natürlich unserer jährlichen Geburtstagsfeier spielen wir immer die TOP100 mit einer Auswahl von irischen Folk-Songs. Our Staff: We are an international team of up to 25 staff.  Perhaps many people have noticed that our team ‘Sprache’ is bilingual. This provides a great opportunity for both local & oversea / international staff members to work in such an English / German environment. Our current irish staff population is growing on a yearly basis.  We are proud of this authenticity that we offer our guests. Merken Merken Merken Fiddlers Moers Am Kastell 1 47441 Moers Tel.: 02841 / 178 858 Fax: 02841 / 178 857 info@fiddlers-moers.com www.fiddlers-moers.com Fiddlers auf Facebook Fiddlers auf Instagram Unsere Öffnungszeiten: So-Fr: \t\tab 12:00 Uhr Samstag:\tab 11:30 Uhr Unsere Küche hat täglich ab 12:00 Uhr durchgehend geöffnet. Fritzpatricks Essen: Girardet Straße 2 45131 Essen Tel.: 0201 / 79 888 77 Fax: 0201 / 79 888 76 info@fritzpatricks.com www.fritzpatricks.com Fritzpatricks auf Facebook Fritzpatricks auf Facebook Unsere Öffnungszeiten: Pub: ab 11:00 Uhr Küche:\tab 12:00 Uhr Website/virtuelle 360°-Tour: SOLIDGROUND MEDIA 47441 MOERS info@solidground-media.com www.solidground-media.com SOLIDGROUND MEDIA auf Facebook SOLIDGROUND MEDIA auf Instagram Unsere Öffnungszeiten: Mo.-Fr. 10:00 -18:00 Uhr Interessante Seiten: About us Live Events Celtic Saal Food & Drinks Speisekarte Getränkekarte Kontakt Rechtliches: Datenschutzerklärung Impressum Copyright ©2025 Fiddlers Moers Gaststätten GmbH. Alle Rechte vorbehalten. X"
    },
    {
      "url": "https://fiddlersgreenbar.com/",
      "text": "Fiddlers Green bar a Home Contact Photos Menu Stamford’s Best Kept Secret Stamford’s Best Kept Secret Stamford’s Best Kept Secret Stamford’s Best Kept Secret Come enjoy a drink with us! 2033560906 Home Contact Photos Menu About Us Happy Hour We all need a place to relax after work, so why not do it with a drink in your hand? Join us for Happy Hour every weekday from 5pm-7pm! Live Music Our local music scene is popping and we wanted to showcase some of the best talent around. Come by on Thursday & Sunday evenings to enjoy Karoke and live music on Saturdays. Who knows, maybe you'll find your new favorite band! Pool and Darts What bar would be complete without a few games to blow off steam? After you grab a drink, feel free to ask any of our staff to borrow a pool cue or set of darts and play away! Outdoor Seating Enjoy the beautiful weather on our outdoor patio! We offer comfortable seating and a relaxed atmosphere, perfect for dining and drinks. Fiddlers Green bar a in Pictures: A Delicious Look at Our Restaurant 1/3 Welcome to Fiddlers Green bar a Bar and Grill Social Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Get on down to the pub for a drink and some pub grub! Fiddlers Green 280 Shippan Avenue, Stamford, Connecticut 06902, United States 2033560906 Hours Mon 09:00 am – 01:00 am Tue 09:00 am – 12:30 am Wed 09:00 am – 12:30 am Thu 09:00 am – 12:30 am Fri 09:00 am – 02:00 am Sat 09:00 am – 02:00 am Sun 09:00 am – 11:45 am Get directions Copyright © 2023 Fiddlers Green bar a - All Rights Reserved. Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}