{
  "fuentes": [
    {
      "url": "https://www.fiestapensacola.org/",
      "email": "bridget@fiestapensacola.org"
    },
    {
      "url": "https://www.fiestasportsfoundation.org/staff-directory/founders-department/7",
      "email": "tickets@fiestabowl.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "email": "iepsconsultation@projectaccessnow.org"
    },
    {
      "url": "https://www.fiestapensacola.org/other-events",
      "email": "fiesta@fiestapensacola.org"
    },
    {
      "url": "https://printersofpensacola.com/contactus.html",
      "email": "rayh@printersofpensacola.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "ahendrickson@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "bhowerton@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "dschaefer@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "ecooper@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "enews@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "hpinson@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "jsaba@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "kman@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lmalaise@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lorvis@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lsteck@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "mbailey@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "nstacey@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "sbrown@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "trobbins@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "wsamuel@visitpensacola.com"
    },
    {
      "url": "https://www.fiestapensacola.org/other-events?lightbox=dataItem-k62idt0b",
      "email": "fiesta@fiestapensacola.org"
    },
    {
      "url": "https://sailpensacola.org/fiesta-five-flags-2023/",
      "email": "vmg@sailpensacola.org"
    },
    {
      "url": "https://sailpensacola.org/fiesta-five-flags-2023/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.pnj.com/story/entertainment/dining/2023/08/31/pensacola-seafood-festival-2023-heres-everything-we-know-so-far/70565361007/",
      "email": "volunteer@fiestapensacola.org"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "ana.perez@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "april.marquez@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "bruce.humphrey@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "chris.chun@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "christina.diaz@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "cyber.alvarez@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "darrell.parsons@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "desiree.caudill@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "diana.cain@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "gideon.delrio@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "info@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "keira.dibrell@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "linda.bove@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "matthew.salomon@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "miriam.hunt@fiesta-youth.org"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "email": "stacy.speedlingonzalez@fiesta-youth.org"
    },
    {
      "url": "https://www.fiestacommunities.com/contact",
      "email": "marketing@fiestacommunities.com"
    },
    {
      "url": "https://www.fiestapensacola.org/seafood-festival",
      "email": "mcleidner@fiestapensacola.org"
    }
  ],
  "mails": [
    "ahendrickson@visitpensacola.com",
    "ana.perez@fiesta-youth.org",
    "april.marquez@fiesta-youth.org",
    "bhowerton@visitpensacola.com",
    "bridget@fiestapensacola.org",
    "bruce.humphrey@fiesta-youth.org",
    "chris.chun@fiesta-youth.org",
    "christina.diaz@fiesta-youth.org",
    "cyber.alvarez@fiesta-youth.org",
    "darrell.parsons@fiesta-youth.org",
    "desiree.caudill@fiesta-youth.org",
    "diana.cain@fiesta-youth.org",
    "dschaefer@visitpensacola.com",
    "ecooper@visitpensacola.com",
    "enews@visitpensacola.com",
    "fiesta@fiestapensacola.org",
    "flags@2x.png",
    "gabe@journeysherwood.org",
    "gideon.delrio@fiesta-youth.org",
    "hpinson@visitpensacola.com",
    "iepsconsultation@projectaccessnow.org",
    "info@fiesta-youth.org",
    "info@journeysherwood.org",
    "info@reception-plus.de",
    "jsaba@visitpensacola.com",
    "keira.dibrell@fiesta-youth.org",
    "kman@visitpensacola.com",
    "leadershipboard@journeysherwood.org",
    "linda.bove@fiesta-youth.org",
    "lmalaise@visitpensacola.com",
    "lorvis@visitpensacola.com",
    "lsteck@visitpensacola.com",
    "marketing@fiestacommunities.com",
    "matthew.salomon@fiesta-youth.org",
    "mbailey@visitpensacola.com",
    "mcleidner@fiestapensacola.org",
    "miriam.hunt@fiesta-youth.org",
    "nstacey@visitpensacola.com",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "rayh@printersofpensacola.com",
    "sales@finewineliquors.com",
    "sbrown@visitpensacola.com",
    "scott@journeysherwood.org",
    "stacy.speedlingonzalez@fiesta-youth.org",
    "tickets@fiestabowl.org",
    "trobbins@visitpensacola.com",
    "vmg@sailpensacola.org",
    "volunteer@fiestapensacola.org",
    "wsamuel@visitpensacola.com"
  ],
  "nombre_sitio": "fiestapensacola.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fiestapensacola.org/",
      "text": "Fiesta Pensacola top of page Home About Crawfish Festival Seafood Festival Other Events Volunteer Court of DeLuna Endowment Fund Community Partners News Contact More... Use tab to navigate through the menu items. Cart Crawfish Festival Sponsored by The Pensacola Ice Flyers Find Out More April 24, 25 & 26, 2026 Seafood Festival Sponsored by The Pensacola Ice Flyers Find Out More September 26, 27 & 28, 2025 Volunteer With Us Find Out More Help us provide ultimate festival fun! 1/5 Flavors of Fiesta is HERE! Introducing the inaugural Fiesta cookbook, featuring over 400 recipes from hundreds of Fiesta Family members, as well as local Pensacola restaurant favorites! Featured restaurants include: Angelena's Ristorante Italiano, Carmen's Lunch Bar & Tapas, Garden & Grain, J.W. Renfroe Pecan Co., Pensacola Blue Wahoos, Seville Quarter, The Fish House and so much more! *SOLD OUT* Restock Coming Soon NEWS 47th Annual Pensacola Seafood Festival! FOR IMMEDIATE RELEASE Bridget Middleton, Executive Director Fiesta Pensacola bridget@fiestapensacola.org 850-433-6512 Pensacola Seafood... Fiesta Pensacola Jul 22, 2024 2 min read Fiesta Pensacola Welcomes New Partners for 2023 Pensacola, Fla. (February 7, 2023) - Fiesta Pensacola is excited to announce three new partnerships for the 2023 event and festival... Fiesta Pensacola Feb 7, 2023 2 min read IceFlyersShieldLogo_CB LBC 2024 NEW LOGO Fasig Brooks Law Offices-Logo (1) (1) IceFlyersShieldLogo_CB 1/19 Fiesta Pensacola 125 S. Alcaniz Street, Suite 1 Pensacola, FL 32502 850.433.6512 2020 Fiesta Pensacola | Terms of Use | Privacy Policy bottom of page"
    },
    {
      "url": "https://www.fiestasportsfoundation.org/staff-directory/founders-department/7",
      "text": "Staff Directory - Fiesta Sports Foundation Skip To Main Content Pause All Rotators Fiesta Sports Foundation Main Navigation Menu 2025-26 CFP Semifinal at Vrbo Fiesta Bowl Tickets Premium Tickets & Hospitality Fiesta Legacy Membership Parking 2025 Rate Bowl Ticket Deposit Fiesta Legacy Membership Premium Seating Group Tickets Parking Ticket Office: 480.350.0911 or tickets@fiestabowl.org My Account Login Mobile Ticketing Headquarters Ticket Interest Form Home 2025-26 CFP Semifinal at Vrbo Fiesta Bowl Tickets Seating Map Premium Seating Hospitality Experiences A-Z Guide Fan Fest Pregame Party Club '71 Pregame Party History Records Game Program News Photos Video Shop 50/50 Raffle Commemorative Tickets About the Area Home 2025 Rate Bowl Ticket Deposit Seating Map Premium Seating Group Tickets A-Z Guide History Records Game Program News Photos Video Shop 50/50 Raffle Community Champions Commemorative Tickets About the Area About Fiesta Sports Foundation Events UMB Bank Fiesta Sports Foundation Football Kickoff presented by Fairmont Scottsdale Princess PNC Bank Fiesta Sports Foundation Par 3 Challenge presented by Chapman Automotive National Quarterback Club Awards Dinner & Hall of Fame Induction Ceremony presented by Fiesta Bowl Vrbo Fiesta Bowl Parade presented by Lerner & Rowe Vrbo Fiesta Bowl Fan Fest Pregame Party Club ’71 Pregame Party Volunteer Calendar About Fiesta Sports Foundation Palo Verde Fiesta Sports Foundation Wishes for Teachers Grant Cycle Information Kindness Arizona Empowering Diversity Scholarship NACDA Community Service Award Community Champions Arizona Milk Producers Fiesta Sports Foundation Youth Football Clinic Fiesta Bowl High School Football Showdown Fiesta Bowl Flag Football Showdown Community Impact Report Interest Forms Donation and Sponsorship Requests Ellie & Michael Ziegler Fiesta Bowl Museum Get to Know Spirit News Photos Sign Up for Mailing List Staff Our Mission Contact Us Ellie & Michael Ziegler Fiesta Bowl Museum Founders Governance SMS Compliance Board of Directors Yellow Jacket Committee Fiesta Futures Ambassadors Life Members Life Directors Yellow Jacket Committee Application Yellow Jacket Portal Volunteer Job Opportunities Seasonal Associate Program Vendors Our Partners Staff Directory Print Keyword Search: Filter By: All Categories Founders Board of Directors Yellow Jacket Committee Ambassadors Staff Fiesta Futures Life Members Life Directors Staff Directory Members By Category/Department Name Title Founders Don Dupont Karl Eller Glenn Hawkins George Isbell Jim Meyer Don Meyers Bill Shover Jack Stewart George Taylor Board of Directors Judy Bernas Chair of the Board; Senior Associate Dean and Chief Strategy and Communication Officer, TCU Burnett School of Medicine Brian Bednar Member Jeff Beyersdorfer Managing Director, Franklin Mountain Capital Tim Brown President and CEO, Donor Network of Arizona Greg Byrne Director of Athletics, University of Alabama Dave Dorward Managing Director, Investments, Merrill Lynch Ed Erhardt Member Mark Fast Executive Director, Morgan Stanley Wealth Management Judy Ferreira Executive Director, Arizona Indian Gaming Association Dan Filby CEO, AccusourceHR Marchelle Franklin Member Harry Garewal President and CEO, Trin and Associates Ryan  Hatch SVP/Market Manager, Bonneville Phoenix Randle House Founder, Metier Pharmacy & Clinical Services Katia Jones Chief Executive Officer, Women’s Foundation for the State of Arizona Randal Norton Lead Client Service Partner and Global Client Services Managing Director, Deloitte, LLP Tom O'Malley Member Ramey Peru Senior Vice President, Colliers International John Rawicz Partner, Womble Bond Dickinson (US) LLP Don Reese Member Dawn Rogers Deputy Director of Athletics for Internal Affairs, Southern Methodist University Rachel Sacco CEO, Experience Scottsdale Denise Seomin Owner, DS Public Relations Gene Smith Athletic Director Emeritus, Ohio State University Jeff Smith Member Nick Smith Executive Vice President, National PEO Brent Stoddard Deputy City Manager, City of Glendale Mike Wilcox Chairman and CEO, Wilcox Financial and Wilcox Sports Management Glenn Wong Distinguished Professor of Practice, Sports Law, former Executive Director of the Allan “Bud” Selig Sports Law and Business Program, Sandra Day O’Connor College of Law, Arizona State University Yellow Jacket Committee Kelly Peru 2025-26 Yellow Jacket Committee Chair Bob Aggarwal Alliance Bank - VP, Commercial Banking Jonathan Amato The Westin Kierland Resort & Spa - Director of Sales and Marketing Jeffrey Anderson BCG 401(k) Advisors - President Eric Barkyoumb Dignity Health Foundation - Philanthropy Manager Warren Black Merrill Financial Solutions Advisor - Assistant Vice President Bryan Boyer Solstice Benefits - Regional Vice President of Sales Damon Boze Drivetime - Assistant Director of Sales Justin Bretag Busey Bank - Managing Director, Commercial Lindsey Brist MMR Constructors, Inc. - Business Development Manager, SW Region Taylor Burgoon Fennemore Craig, P.C. - Attorney Benjamin Burke Van Wagner - Vice President College Division Ben Calacci Team Velocity - Vice President, OEM Walker  Crowson Snell & Wilmer, LLP - Managing Partner Patrick Davis Urban Luxe Real Estate - Real Estate Agent Steven Davis RD Enterprises - Managing Partner Brian  Debnam NIKE, Inc - Director & Chief of Staff, Global Footwear Product Creation Ryan Delaney Sunflower Bank - Senior Vice President David Dobrusin Dobrusin Financial LLC - President DJ Downs Barrett-Jackson - Sr. Director of Marketing Vince Ewing Hype Athlete Network - Founder/CFO Adam Fielding Platinum Dermatology Partners - Chief Compliance Officer Kirk  Fonfara Chicago Title Agency Arizona - Commercial Sales Executive Michael Fossum NobilityRCM - Founder/CEO Ben Fredlake Mission Management & Trust - Senior Portfolio Manager Brian Garcia-Larson Self - Life Insurance Agent / Business Guide Darius Green KEYSER - Co-Founder & Partner Brian Gubernick PLACE - Chief Real Estate Officer Stephen Gubernick Chiro 360 - Owner Kirk  Harbaugh Bausch + Lomb - Territory Sales Manager Gabriel Hartsell Dorsey & Whitney - Attorney/Partner Amy Harvath Meadows Bank - Vice President Business Relationship Manager Renee Higgs Salt River Project (SRP) - Sr. Marketing Strategist Joe Hourigan Petti and Briones - Attorney Karen Howard Land Resources - Real Estate Development (Vice President) Chad Hunter BMO Financial Group - Director, Commercial Bank William Jaffe Abrazo Biltmore Cardiology - Preventative Cardiologist Daniel Johnson Yelp - National Sales Manager Justin Johnson Dunlop Sports Americas - Regional Sales Manager JJ Joppru Lovitt & Touche Marsh McLennan - Producer / Sales Executive Jim Kebert LUV Car Wash - CFO John  Knebel Influence Sports & Media - SVP, Business Development Casey Koziol Colliers International - Associate Steven Kruczek AeroGuard Flight Training - Chief Financial Officer James Kuykendall IBG Fox & Fin - Investment Banker/Managing Director David Lane EY - Assurance Manager Jonathan Levin Zeta Beta Tau Foundation - Vice President of Development Mike Lindsley BlueFox Group - Partner Tim Martin Sharks Sports & Entertainment - Vice President, Premium Sales & Service Ty  Martin Grand Canyon University - Sr. Director of Corporate Partnerships Elroy Masters Raymond James - Financial Advisor Kirk  McClure JE Dunn Construction - Vice President Michael McLeran Sack Tierney P.A. - Attorney - Construction Litigation Kyle  McMillian UMB Bank - Senior VP, Commercial Banking Officer John  Meza Arizona Department of Economic Security - Inspector General Tim Miller Sun Pharmaceutical Industries - Senior Territory Manager Brian Moll Dorsey & Whitney LLP - Partner Brad Morin R.R. Donnelly - Digital Media Consultant Michael Muraco On-Air Sports Marketing/R-Entertainment - Owner/Strategic Partnerships Justin  Naber L Keeley Construction - West Coast VP Gary Naquin MidFirst Bank - SVP, Corporate Banking Suzanne Nelson Coreslab Structures - Business Development Jameson Neuhoff Palm Canyon Development - Owner Tim Newquist Newquist Investments - Owner/Real Estate Investor/Consultant Brian Nuestro Marc & Rose Hospitality - VP of IT & Cybersecurity Jerry Pence Balanced Capital Partners - Private Equity / Managing Partner Ryan Penniman CAPTRUST - Principal | Financial Advisor Shane Peterlin Century 21 Seago - Realtor Chip Pray McLane Company, Inc. - General Manager Carlos Ramirez J.P. Morgan Private Bank - Banker Kyler Robinson Crest Insurance Group - Commercial Insurance Broker Bryan Royal Self; Royal Document Review & Services - Founder and CEO Grant Sanders Arcadia Sports Complex - President Katelyn Saunders Metrix Masterminds - Head of Growth and Operations Richie Schmock Rockefeller Capital Management - Sr. Vice President Logan  Senoski Salt River Project (SRP) - Senior Project Origination Consultant Jared Shahon Launch Powered by Compass - Realtor Andrew Sheridan Sherwood Schools LLC - Owner/CFO Andrew Shultz Newrez - Senior Learning Consultant Brad Smidt Greater Phoenix Economic Council - Senior VP Samantha Spadaro Melissa Stack Deloitte LLP - Sr. Manager Risk and Brand Protection Greg  Stark Raymond James - Financial Advisor, CFP® Max Starks SiriusXM - On-Air Talent Joe Strening Microsoft - Azure Solutions Sales Lead David Tatko Insperity - Business Performance Advisor Danny Thielen Axon Enterprise - Strategic Account Executive Oye Waddell Hustle PHX - CEO Sean  Ward BNC National Bank - Senior VP, Business & Commercial Banking Josh  Wein Home Smart - Residential Real Estate Sales Professional David Weissman Davis Miles - Partner Andrew Western Osborn Maledon - Partner Antone  White Chase, Carson & White LLC - Managing Director Larry White LKW Consulting, LLC - CEO Carter Wood Crest Insurance Group - Commercial Insurance Broker Rick Zieglowsky American Arbitration Association - Lawyer/Director Frank Zimmerman RBW Companies/R.B. White - COO Ambassadors Laura Hardy 2025-26 Ambassadors Chair Tammy White 2025-26 Ambassadors Chair-Elect Pauline Argeros Active Ambassador Kim Bruck Active Ambassador Donna Cooper Active Ambassador Jennifer Doan Active Ambassador Vicki Fiorelli-Starkovich Active Ambassador Julia Fischer Active Ambassador Mary Gleason Active Ambassador Leslee Herzstein Active Ambassador Jodi Kavis Active Ambassador Kim Kennedy Active Ambassador Stacy Lincoln Active Ambassador Wendy Manning Active Ambassador Ambreiah Mims Active Ambassador William Ng Active Ambassador Ronda Parker Active Ambassador JaBond Perkins-Hutchins Active Ambassador Kathy Promberger Active Ambassador Camille Ridley Active Ambassador Deborah Ross-Carter Active Ambassador Alethea Sessions Active Ambassador Anna Silva Active Ambassador Jasmine Singleton Active Ambassador Ginger Smith Active Ambassador Tammie Armeni Emerita Ambassador Nicole Barrington Emerita Ambassador Marilyn Bechtold Emerita Ambassador Kyla Braker Emerita Ambassador Marisa Calderon Emerita Ambassador Karen Casassa Emerita Ambassador Ellen Casey Emerita Ambassador Kathleen Casey-Walker Emerita Ambassador Allison Chafin Emerita Ambassador Sally Clements Emerita Ambassador Josefina Comstock Emerita Ambassador Lora Dal Bo Emerita Ambassador Laura Davis Emerita Ambassador Dennice Dunaway Emerita Ambassador Lei Lani Forrest Emerita Ambassador Vicki Frailey Emerita Ambassador Lorraine Gentile Emerita Ambassador Judy Greene Emerita Ambassador Terri Hall Emerita Ambassador Janey Haugen Emerita Ambassador Carolyn Holden Emerita Ambassador JoAnn Holland Emerita Ambassador Shelly Huckfeldt Emerita Ambassador Simone Janssen Emerita Ambassador Vera Kelly Emerita Ambassador Monica Kruck Emerita Ambassador Marie Larson Emerita Ambassador Kathy Leazotte Emerita Ambassador Sheryl Long Emerita Ambassador Hillary Mackowski Emerita Ambassador Deborah Maloney Emerita Ambassador Suzy Martinez Emerita Ambassador Kathie May Emerita Ambassador Erin McCormick Emerita Ambassador Kelly McCormick Emerita Ambassador Elaine Molski Emerita Ambassador Val Nikolaus Emerita Ambassador Jan Nowell Emerita Ambassador Sheila Perkins Emerita Ambassador Amy Peters Emerita Ambassador Connie Peters Emerita Ambassador Carol Piowarsy Emerita Ambassador Irma Prescott Emerita Ambassador Gail Reed Emerita Ambassador Linda Rondeau Emerita Ambassador Stephanie Ruiz Emerita Ambassador Amy Schapira Emerita Ambassador Sandra Searle Emerita Ambassador Melanie Smith Emerita Ambassador Chantri Sukpon Emerita Ambassador Gayle Tanber Emerita Ambassador LaBertha Umbreit Emerita Ambassador Stephanie Van Gorder Emerita Ambassador Molly Weiss Emerita Ambassador Anna Williams Emerita Ambassador Brittany Wilson Emerita Ambassador Judith Wodash Emerita Ambassador Ardell Daniels Associate Ambassador Staff Erik A. Moses Executive Director and Chief Executive Officer Holden Axtell Community Engagement Coordinator Sandra Avila Director of Community Engagement Kristina Chumpol Chief Impact Officer and Chief of Staff Liz Clifford Game & Event Operations Manager Saira Costo Creative Coordinator Mason Donkersley Corporate Partnership Activation Coordinator Anthony Econ Premium Sales Manager Tim Gleason Senior Manager, Ticket Operations Nickell Grant Game & Event Operations Coordinator Bryce Hancock Chief Financial Officer Marie Keeler Vice President of Brand & Marketing Scott Leightman VP of Communications, Media & Industry Relations Conor McCarvel Volunteer Engagement Coordinator Allison Mertz Manager of Community Engagement Jared Miller Senior Accountant Chris Montgomery Senior Director of Volunteer Engagement Dan Newhart Vice President of Ticketing Lenny Paoletta Director of Event Development & Operations Kyle Schwulst Corporate Partnership Activation Coordinator Bret Scroggins Director of Football Engagement Hope M. Sharett, Esq. Chief Legal & Strategy Officer Johnny Torres Game & Event Operations Coordinator Pete Vazquez VP of Finance & Accounting Suzie Warren Business Operations Assistant Billy Welsh Director of Ticket Operations Cindy Whippo Sr. Executive Assistant to Executive Director/CEO Jennifer Williams Receptionist Makayla Wolf Creative Manager Tanner Zambito Game & Event Operations Coordinator Christian Dempster Christian Dempster Sarah Shewan Fiesta Futures Kerri Cummiskey Alumus - Sr. VP of Network Development and Strategic Partnerships Isaiah Dowdell Assured Partners - Sales Executive, Commercial Lines Ethan Freedman Burt, Feldman & Grenier - Attorney Josh Guinn Eide Bailly - Director of Business Development Michael Jackson Mya Kai Creative - CEO & Chief Creative Officer Lane Klastow FCC - Partner Chet McBee The Mahoney Group - Benefits Advisor Damien Meyer Engelman Berger, PC - Shareholder Catherine Mulkerin C/M Development & Design - Owner Will Nation MT Builders - President Justin Pierce Valley Spinal Care - Owner Aaron Wiese Prospect Recruiting - Founder & Principal Life Members Aaron Muth Adam Fullerton Adam Turner Akira Boreham Sr. Alan Gildersleeve Alan Hyde Alan Nelson Alfred Molina Alyssa Samuelson Amy Leroy-Gelb Andre Fournier Andrew Carey Andrew Jordan Andrew Monaghan Annie Mooney Andy Spillum Ari Spiro Arte Moreno Arthur Othon Barbara Herriot Barry Aarons Barry Carter Barry Wong Baxter Baldwin Ben  Smith Bill Shover Bill Taylor Blake Edwards Bob Banning Bob Hart Bob Whitehouse Brad Mayer Brad Tennison Bradley Brittain Brannon Bartley Brett Hansen Brian Franklin Brian Wilder Brooke Todare Bruce Frank Bruce Partridge Bruce Sedlak Bryan Beverly Bryan Neddoff Budd Peabody Buddy Jobe Cabby Conti Calvin Platten Candy Greff Carol Friedl Carol Poore Carol Walker Carolyn Johnson Carolyn Pendergast Charles Bogar Charles Buri Charles Garner Charles Krewson Chelsey  Golightly Chet Jaehnig Chris Fox Chris  Gracey Chris Mallory Chris Shields Chrissa Michelle Christin Valentini Christina Carfagno-Harrison Christopher Hahn Christopher Krewson Christopher Sullivan Cindy Slick Colleen Goodrich Connie Peters CR Duley Craig Mercure Cynthia Ketcherside Damon Gross Dan Cash Dan Hobaica Daniel Laux Daniel Wachtler Darius Nickerson David Arriola David Bird David Castelveter David Franklin David Howell David Huebner David Ralls David Soble David Watkins David Wood Davina  Seville Dean Rennell Debbie Moore Debra Hartland Debra Hill Dewey Schade Don Ameche Don Burton Don Dupont Don Meyers Donald Burnes Jr. Donald Cline Donald Liem Donald Ruff Doyle Royer Ed Aaronson Ed Olsen Edward Lutz Edward Tobin Erik Jensen Frank Divers Frank Kush Frank Ziska Fred Corey Gannon Thiel Gary Brown Gene Carl George Isbell George Rubelsky George Taylor George Weisz Glenn Hawkins Greg Pollack Gregg Buchanan Gregory Kruger Gregory Miskovsky Gordon Samuel Heather Cook Ian Wist Jack Renshaw Jack Stewart Jake  Logan James Blaine James Heidler James Marshall James Watson Jamie Fields Janie Riddle Jason Malito Jason Moore Jay Jennings Jay Mohr Jay Spector Jeanne Marie Bucknell Jeffery Freed Jeffrey Golner Jeffrey Meshey Jennifer Cannon Jim Clements Jim Hebets Jim Meyer Jim Reid Joe Cafferelli Joe Garagiola Jr. Joel Johnson John Alvarez John Bechtold John Craiger John Damiris John Dawson John Driggs John Ferens John Galasieski John Gonzales John Harmon John Lefkowitz John Levy John Mistler John Pierson John Rafferty John Rogers Jon Frank Jon Richardson Joseph Callaway Joseph Forster JW Wight Karl Eller Karolyn Kiburz Kate Moore Kelly O’Neill Ken Koziol Kerry Dobric Kevin Canterbury Kevin Lewis Kieron Flint Kim Zieser Kip Sullivan KJ Wagner Larry Colton Laurie Dawson Lee Rosenthal Lei Lani Cortez Lei Lani Forrest Letha Lefkowitz Linda Arters Lisa Dykman Lloyd Lopez Lucas Kraut Lynn Ashton Marc Blonstein Marc Hertzberg Marci Zimmerman Mark Garlieb Mark Schonau Mark Young Marlene Klotz-Collins Martin Harban Mary Jane Rogers Matt Hobaica Matthew Kleifield Matthew Montgomery Matthew Stys Mehdi Mazaheri Mel Moss Michael Bradley Michael Cook Michael Fitzgerald Michael Kitlica Michael Leichtfuss Michael McAtamney Michael Pulos Michael Pylman Michael  Rossman Michael Silver Michael Stoffey Michael Thorell Michael Tully Mike Comstock Mike Reina Nancy Vaughan Nate Dominguez Neil Barna Nelson Burns Nick Kieffer Pat Thielen Patricia Boreham Patrick Fleming Patrick Joyce Paul Petelin Paul Steingard Peter Eberle Peter Langenhorst Peter Klute Peter Moolenaar Phil Knall Phillip Smyser Raj Kapur Ralph Hunsaker Ramiro Peru Randolph Wilcott Reed Johnson Reggie Fowler Rhett Cooney Richard Cadriel Richard Campbell Richard Clark Richard Collins Richard Kemp Richard Kerley Richard Lawrence Richard Perry Richard Rizzo Richard Savagian Richard Strand Richard Tarnopolski Rick Benoit Rick Elder Rick Galasieski Rick Lee Rick Warren Rick Zimmerman Rob Drake Rob Kubisiak Robert Bridge Robert Connolly Robert Dicandia Robert Galbo Robert Matthews Robert Rutila Robert Simmons Robert Simpson Robert Taunton Robert Yeoman Rod French Rory Kelley Russ Hayworth Russell Posorske Samuel Ariaratnam Sandy Arnold Sandy Hecomovich Sarah Shneider Scot Asher Scott  Bernstein Scott Essex Scott Harkey Scott Liem Scott Jenkins Scott Murray Scott Schaefer Scott Steingard Scott Weisenburger Sean  McElenney Sharon Perry-Gibson Sharon Steele Shirley Garner Shonna James Stephanie Nowack Stephen Glucksman Stephen Lee Stephen Scardello Steve Bruns Steve Schwarz Steven Beeghley Stuart Smith Sue Black Susan Baker T R. Lawson Tamara Weaver Tammy Kingston Tad Nowlin Ted Warner Terrence Ormsbee Terry Martin Terry Ricketts Thomas Donohue Thomas Jennings Thomas Rietz Thomas Smith Tim Matykiewicz Timothy Burns Timothy Kerrigan Todd Bankofier Todd Feltus Todd Webb Tom Kaupie Tony Alba Tony Kingsbaker Travis Leach Troy Hoberg Tyler Hanson Victor Ostrow Wayne Anderson Wells Hampton Wes Freas William Bohannon William Frazier William Mack William Mallender William Phelps William Stevenson Woodrow Johnson Zach Snickles Life Directors Alan Young Alex Cruthfield Alfred Aldridge Jr. Andy McCain Ann Barker Ann Wallack Ann Damiano Armando Flores Art Grandpre Benjamin Campbell Bill Shover Bradley Nilsen Brett Benton Brian Hall C.A. Howlett C.R. Stewart Charles Thompson Chuck O’Connor Colleen Jennings-Roggensack Craig Ankeney Darryl Jones Dave Tilson Dee Toci Dennis Edwards Derek Kerr Donald Dupont Donald Fleischer Donald Meyers Duane Woods Edward Carson Ellen Ziegler Eugene Smith Evan Paoletti Gary Hanson George Frost George Isbell George Kalil George Taylor Gerald Carbonari Gonzalo de la Melena Harlan Loffman Herman Frazier Dr. Javier Cardenas Jay Perry John Currie James Hatfield James Meyer Jim Bruner Jim Livengood Jim Tighe John Fung John Lewis John Marks John Vandevier Joseph Mooney Karl Eller Kelly Mero Kemp Ellis Ken Blewett Kevin Hickey Kevin Warren Larry Gunning Larry Johnson Leon Levitt Leonard Huck Manny Molina Marcus Sipolt Mark Vinciguerra Marv Nyren Matt Winter Michael Allen Michael Doherty Michael Donnelly Michael Fisher Michael Hoffman Michael Wall Mike Hecomovich Neilson Bertholf Jr. Nicholas Balich Nikki Balich Patrick Barkley Phil Motta Ramiro G Peru Raphael Bear Ray Artigue Ray Cox Reid Southern Richard Holtzman Richard Stemple Rick Dircks Rick Horn Rob Longo Robert Aylesworth Jr. Robert Davies Sherry Henry Sheryl Long Steve Horrell Jr. Steve Leach Steven Wheeler Steven Whiteman Thomas Murphy Thomas Odisho Thomas Taradash Tom Fridena Wally Kelly Warren Goodrich Wesley Little William Peltier Win Holden Footer Newsletter Sign up for our Newsletter to get the latest info on Fiesta Sports Foundation happenings! Sign Up First Name Last Name Email Sign Up © 2025 Fiesta Sports Foundation. All Rights Reserved. Terms of Service , opens in new window Privacy Policy , opens in new window Accessibility Do Not Sell or Share My Personal Information Sidearm Sports, opens a new window Ad Blocker Detected Thanks for visiting ! The use of software that blocks ads hinders our ability to serve you the content you came here to enjoy. We ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here. Thank you for your support! Learn More About Ad Blockers Close"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "text": "Project Access NOW Staff: Leadership & Dedicated Team Members | Portland, OR About Mission Learn about how and why we do what we do. People Get to know our staff, leadership, and board. Partners Learn who partners with us to achieve our mission. Impact Stories of success from clients and partners. News Keep up with the latest from Project Access NOW. View our Strategic Plan Click Here Get Involved Donate Your donations will support our efforts. Volunteer Give your time and energy to help people receive care they need. Board &Â Committee Service Become a core member of the leadership team. Employment Find out about current employment opportunities. Contact Get in touch with Project Access NOW. Seeking services? Click Here Refer a client Get Help About Mission People Partners Impact News Programs Donated Care Insurance Support Community Health Community Assistance Advocacy Get Involved Donate Volunteer Board & Committee Service Employment Contact In need of services? Click here Our Staff Leadership Executive Team Greg Sutliff âVice President Finance they/them Omar Al Rais, MBA, MBChB Senior Vice President Operations he/him/his Rebecca Raab, MS Vice President Development and Communications she/her/hers Tracy Carver, MPA President and CEO she/her/hers Leadership Joseph Nicoletti Director IT and Strategic Projects he/him/his Myrna Valdez Director Programs and People she/her/hers/ella Program Management Brennan Universe Manager Executive Assistant and Board Affairs they/them Chloe Dominguez Manager Program and Office Logistics she/her/hers Emma Holland Manager Operations she/her Erika Valdez Manager Donated Care (DC) she/her/hers Jina Kalberg Manager Finance she/her/they/them Julie Chu, PMP Senior Project Manager Strategic Projects (SP) she/her/hers Peter Merritt Manager Impact and Advocacy he/him Ranisha Isom, BS, CAC, CHW Manager Insurance Enrollment and Payment Support she/her/hers Sandra Rivera Manager Community Assistance Program (CAP) she/her/hers/ella We're hiring! Check out our employment opportunities now View Open Positions Subscribe to Updates Join our newsletter to stay up-to-date on news and events. About Mission People Partners Impact Annual Reports News Get Involved Donate Volunteer Employment Contact Resources Social Services Insurance Appointment Client Referral Follow us Facebook Instagram LinkedIn © Project Access NOW. All rights reserved. Privacy Policy Terms of Service Cookies Policy Site Map"
    },
    {
      "url": "https://www.fiestapensacola.org/other-events",
      "text": "Other Events | Fiesta Pensacola top of page Home About Crawfish Festival Seafood Festival Other Events Volunteer Court of DeLuna Endowment Fund Community Partners News Contact More... Use tab to navigate through the menu items. Cart FIESTA CELEBRATION Our Mission CHILDREN’S TREASURE HUNT Presented by International Paper EVENT INFO:​ Saturday, April 5 , 2025 Downtown Pensacola at Museum Plaza 11:00am to 3:00pm ​ FREE! FREE! FREE! The Fiesta Pensacola Children's Treasure Hunt is a FREE event for Pensacola. Registration begins at 11:00am at Museum Plaza in Downtown Pensacola. Registration is required for entry for prize drawings, THERE WILL BE NO PREREGISTRATION. Food service will begin at 11:30am, and the Prize Ceremony will begin at 2:00pm. ​ ​ All registered children will be entered into grand prize drawings, based upon age: 0-2 years old, 3-4 years old, 5-7 years old, and 8-10 years old, with multiple prizes per group. Prizes include: bicycles, tricycles, summer camp sessions, water activities, art easels, sporting event tickets and so much more, all located down at our Prize Zone! ​       This FREE event will include fun for the whole family! FREE registration is from 11:00AM-2PM. The day will include games for children and families, face painting, snow cones, interactive museum scavenger hunt, and visits from various community organizations. There will be special appearances by some of our favorite local friends, Kazoo of the Pensacola Blue Wahoos, Don Tristan DeLuna the 75th and more! All families in attendance will receive FREE lunch, chips, snow cones, Coca-Cola products and water. ​ ​ ​ Emmanuel Sheppard & Condon FIES TA DAYS CELEBRA TION EVENT INFO: ​ Wednesday, May 27, 2026 ​ Be sure to join the Surrender of the City in Phineas Phoggs at 7:15 p.m. as local dignitaries such as the Mayor, Fire Chief, Supervisor of Elections, Escambia County Sheriff and Pensacola Naval Air Station Commanding Officer surrender the City of Pensacola and its citizens to DeLuna and his Queen for the Fiesta Season. ​ ​ ​ If purchasing tickets through the EventBrite link above, you will not receive a physical ticket. We will have a spreadsheet at the event with the purchaser's name. Additionally, please bring a copy of your emailed receipt. If you are purchasing multiple tickets and do not attend to arrive to the event with the other guests, please email fiesta@fiestapensacola.org the additional names to be added to the event entry spreadsheet. ​ T ickets may be purchased at the Fiesta office or at the door. T icket sales on the evening of the event will begin at 6:00PM at Seville Quarter . ​ With each ticket, guests receive access to all rooms and their themed food offerings and signature beverages. Guests will also receive two drink tickets and a custom designed annual commemorative medallion upon arrival. ​ ​ Tickets are not yet available. ​ GRAND FIESTA PARADE Presented by Kia Autosport APPLICATIONS ARE CLOSED! ​ EVENT INFO: ​ Friday, May 29, 2026 ​ ​ ​ Come catch some beads, hear the sounds of local high school marching bands, and enjoy watching beautiful floats parade through downtown beginning at 7:00 p.m. Bring the entire family to one of Pensacola’s favorite Fiesta events. In addition to the dozens of local krewes parading, special appearances will be made by a masked DeLuna , his Queen and their court. PARKING: Parade parking is available throughout the downtown area on a first-come first serve basis. All downtown lots are owned by private businesses and will likely charge a parking fee. These fees are not associated with or controlled by the Grand Fiesta Parade or Fiesta Pensacola. Handicap parking will be available in the Smart Bank parking lot at the corner of Gregory and Palafox Streets after 5:00 pm on Friday. There will be a sign at the parking lot entrance indicating “Handicap Parking.” ​ ​ FIESTA BOAT PARADE Sponsored by Centennial Imports AHOY! Join us as DeLuna's court, crew an d parade of vessels set sail on the beautiful Pensacola Bay ​ EVENT INFO: Saturday, May 30, 2026 To watch the colorful cruise from land, the best views will be from Sanders Beach-Corinne Jones Resource Center or Plaza de Luna in Downtown Pensacola FIESTA ALL KREWE BALL ​ EVENT INFO: ​ Thursday, June 4, 2026 ​ ​ ​ ​ CALLING ALL KREWES! Join Fiesta, DeLuna LXXVI , his Queen and the 2026 Court of DeLuna for this annual celebration! ​ ​ ​ ​ ​ ​ Each ticket includes event entry, live entertainment, and light bites throughout the evening ​ PLEASE NOTE: Tickets will NOT be available for sale upon entry, all tickets must be purchase through the link below, or in person at our office. ​ ​ If you are purchasing multiple individual tickets, please include the name of each person you are purchasing for, so they will be included on the event spreadsheet at event check-in. ​ ​ ​ Ticket Purchases are not yet available. Royalty Applications are closed. ​ IceFlyersShieldLogo_CB LBC 2024 NEW LOGO Fasig Brooks Law Offices-Logo (1) (1) IceFlyersShieldLogo_CB 1/19 Fiesta Pensacola 125 S. Alcaniz Street, Suite 1 Pensacola, FL 32502 850.433.6512 2020 Fiesta Pensacola | Terms of Use | Privacy Policy bottom of page"
    },
    {
      "url": "https://printersofpensacola.com/contactus.html",
      "text": "Printers of Pensacola contact Printers of Pensacola Homepage All Products Business Cards Envelopes Brochures Color Copies B&W Copies Signs & Banners Calendars Catalogs Flyers Folders Letterhead Postcards Multi-forms Invitations Promotional Large Format Direct Mail Our location Web Design & SEO Design Services About Us Contact Check out our new location. 1207 west garden st, Pensacola, FL New state of the art equipment. New Showroom. Same Great Service. 850-434-2588 Read More Monthly Specials & Events Ramping up for summer time business and getting your business POP Tuned Up !. Read More Products Brochures BnW Copies Business Cards Calendars Catalogs Color Copies Direct Mail Envelopes Flyers Folders Invitations Letterhead Forms Postcards & Services Promotional Signs Banners Graphics Web Design Location About Us Contact Us Newsletter Specials Upload Art Contact Us: Ph: 850-434-2588 rayh@printersofpensacola.com (owner) www.printersofpensacola.com 1207 west garden street * Pensacola,FL 32502 Twitter Facebook Instagram Tumblr Dribbble © Untitled. All Rights Reserved."
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "text": "Meet The Staff | Visit Pensacola Skip to content logo 0 Saved 72 ° F Plan Your Way to Beach™ Navigation logo Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Home About Visit Pensacola Meet The Staff Meet The Staff Meet the Visit Pensacola team. Darien Schaefer President/​CEO Hometown: Milwaukee, Wisconsin Born in Milwaukee, WI and growing up in the resort community of Wisconsin Dells, Darien has been involved in the hospitality and tourism industry for over 40 years. Send An Email Read Bio Hometown: Milwaukee, Wisconsin Born in Milwaukee, WI and growing up in the resort community of Wisconsin Dells, Darien has been involved in the hospitality and tourism industry for over 40 years. A graduate from the University of Wisconsin-Stout with a degree in Hotel/Restaurant Management, Darien has worked for Holiday Inn Corporation, Marriott Hotels, and Tharaldson Lodging. It was with Tharaldson Lodging, as an Area Director responsible for 13 hotels in 8 different markets, that Darien began working closely with destination marketing organizations. Darien eventually left Tharaldson Lodging to become the Executive Director for the Janesville Area Convention & Visitors Bureau in 1998. In April of 2000, Darien joined the Wausau/Central Wisconsin Convention & Visitors Bureau. During his 13 years as the Executive Director, Marathon County rose from 17th to 9th out of 72 counties in Wisconsin for Economic Impact from traveler spending. Darien expanded the role of the CVB by creating a Sports Authority function that was responsible for developing new sporting events. Darien joined the Lake Geneva Chamber of Commerce and Convention & Visitors Bureau in November 2013. Under Darien’s leadership, the two organizations were merged into Visit Lake Geneva in 2016. Darien joined Visit Big Bear in 2017 as President & CEO to promote the resort community of Big Bear Lake, CA. In addition to growing tourism receipts by 83% in three years, Darien directed the purchase and renovation of a 5,000 sq. ft. building for a new Visitor Center and offices. Darien and his wife, Karen, moved to Pensacola in April of 2020 when he accepted the position of President & CEO for Visit Pensacola. Nicole Stacey Vice President of Destination Development Hometown: Fort Walton Beach, Florida Trendsetter. Coffee addict. Travel enthusiast Born and raised on the beaches of Northwest Florida, Nicole has an innate love for the Sunshine State, its pristine beaches, and the thrill of travel. Cultivating over 15 years of marketing and communications expertise, Stacey has over 20 years in the tourism and hospitality industry..... Send An Email Read Bio Born and raised on the beaches of Northwest Florida, Nicole has an innate love for the Sunshine State, its pristine beaches, and the thrill of travel. Cultivating over 15 years of marketing and communications expertise, Stacey has over 20 years in the tourism and hospitality industry. As Visit Pensacola's Vice President of Destination Development, Stacey leads the marketing and sales departments. She is responsible for identifying market opportunities, developing short- and long-term marketing and sales plans and strategies, directing all communications and public relations functions, and ensuring community-wide destination development investments increase and travel-related strategies are connected and aligned. Throughout her career, she has spearheaded numerous successful initiatives, marking significant achievements in the industry. Notable highlights include transforming Visit Pensacola's public relations efforts with out-of-market activations at prestigious events like the Country Music Awards in Nashville, Chicago Air and Water Show, several in-market television productions, and media-related opportunities in New York, Canada, and London, UK. Stacey has played a pivotal role in several multi-rebranding campaigns, including the development of Visit Pensacola's latest brand, \"The Way to Beach.\" Additionally, she has been an integral part of the evolved Tourism Works for Pensacola campaign—an initiative to communicate tourism's invaluable impact in Escambia County. Actively engaging with professional and travel industry associations and dedicated to the Pensacola community, Stacey serves as a Board Member for Destinations Florida and contributes to the Destinations International PR Task Force. Additionally, she is a part of the NWFL Beaches Coalition Brand Team. She has assumed several leadership roles over her tenure, such as Chairing the 2023 Leadership Pensacola Class, being Past President of the University of West Florida Alumni Association, Fiesta Pensacola Board of Governors, Florida Public Relations Assoc past president and state board member, and the Foo Foo Festival Curator to name a few. Recognized as a rising star by InWeekly in 2013 and honored with the 2022 Florida Public Relations Association Communicator of the Year award. Stacey was recently named the 2023 Emerging Leader for the Greater Pensacola Chamber PACE Awards. She takes pride in representing her community worldwide and showcasing Pensacola as a premier travel destination. The proud graduate of her master's degree in strategic communications and leadership and a B.A. in public relations and marketing from the University of West Florida – Go Argos! In her spare time, Nicole finds joy in her role as \"Auntie Coco,\" cherishing moments spent with family and friends, indulging in her community like a local should and booking her next plane ticket to fulfill her love and passion for travel and experiencing new places and cultures around the world. Wandy Samuel Director of Finance and Administration Hometown: Addis Ababa, Ethiopia Numbers guy. Super dad. Wandy entered the tourism industry in 2013 as a staff accountant for Premier Island Management Group... Send An Email Read Bio Wandy entered the tourism industry in 2013 as a staff accountant for Premier Island Management Group before joining the Visit Pensacola team in 2016. Previously, he served as the operations manager for Dollar Rent a Car of which he was responsible for effective and successful management of labor, productivity, quality control, safety measures and standard business operating procedures. He holds a degree in accounting from Pensacola Christian College.Outside of work, he enjoys spending time with his daughter. The two enjoy riding bikes, going shopping and Skyzone. He is an active member of Big Brothers Big Sisters of Northwest Florida. Kaya Man Director of Sales & Services Hometown: Kailua-Kona, Hawaii Fishin’ chick. Chef. Beach bum Kaya Man joined Visit Pensacola in 2018 as the Partner Relations Manager... Send An Email Read Bio Kaya Man joined Visit Pensacola in 2018 as the Partner Relations Manager. She was responsible for partnership development and maintenance for the organization. In 2021 promoted to Destination Sales Manager, serving as the sales representative to the group and leisure market to generate a positive economic impact for Escambia County. In 2023 promoted to Director of Sales and Service, overseeing all sales efforts in group, trade and leisure markets, partner relations and the visitor centers. She has also taken on the role as the Northwest Florida Beaches Sales Representative to the Council. Kaya brings over 20 years of hospitality experience to the Visit Pensacola team. Man spent the last eight years prior to joining the team, serving, managing, and the head trainer at The Grand Marlin on Pensacola Beach. Previously, she owned an event planning company and Elephant Seasoning, a catering and seasoning business started by her father. She holds a bachelor’s degree in restaurant and hospitality management from the Pensacola Junior College and University of West Florida. Man is actively involved in the community, serving as UWF Women in Leadership Conference hospitality co-chair, Sun Belt Conference Team host committee, Sea Grant Advisory Team, donating time to the Children’s hospital, served as the Greater Pensacola Tennis Ladies League captain for 8 years, and a part owner/ operations manager to Tighten up Tennis. Outside of the office, she enjoys cooking, playing tennis, fishing, traveling, and spending time at the beach with her family. Ashley Hendrickson Administration Assistant Hometown: Pace, FL Book connoisseur. Athletics enthusiast. Bonding aficionado Ashley joined Visit Pensacola in 2023 as the Administration Assistant... Send An Email Read Bio Ashley joined Visit Pensacola in 2023 as the Administration Assistant. She is responsible for coordinating calendars between Darien, Staff and the Board, various office projects, and all things related to board meetings. Bottomline, Ashley will ensure the office runs smoothly and cohesively. She has spent the last seven years in New York City, most recently as the Executive Assistant to the owners of Team Epiphany, a marketing and creative agency. Her strengths include project support, process improvement, relationship development, and strategic communication. A Pensacola native, Ashley is a graduate of The University of West Florida with a bachelor's degree in Organizational Communication and a minor in Hospitality. While she is not in the office, she finds joy in various hobbies such as reading, attending theatre performances, engaging in sports, and relishing the great outdoors. Lana Malaise Staff Accountant Hometown: Pensacola, FL Devoted and passionate Mom. Numbers gal. Concert lover. Lana Malaise joined Visit Pensacola in April of 2024 as the Staff Accountant. She is responsible for assisting the Director of Finance in the processing of all things accounting related to Visit Pensacola. Send An Email Read Bio Prior to joining our team, Lana worked in the private sector as a Bookkeeper and Accounting Manager in various businesses in various locations to include Kentucky, Illinois and Florida. Lana originally moved to Pensacola in 1978 when her family moved here as a duty station of her father’s at USN Saufley Field Base, Pensacola. Upon graduating from UWF in 1988 as one of the school’s first class of freshman in 1983, she began her career in accounting at various local CPA firms. She left the area in 1993 to move to central Kentucky and finally returned ‘home’ to Pensacola/Pace area in 2016 after expanding her family with four beautiful daughters. Lana considers her greatest accomplishment to being a Mom. In her spare time, she enjoys playing tennis, playing cards with her family, and enjoying listening to live music along the Gulf Coast as much as she has time to do. Marketing and Communications Shawn Brown Digital Marketing Manager Hometown: Gulf Breeze, Florida IT Guy. Outdoor Aficionado. Family Guy. As the digital marketing manager, Shawn Brown joined the Visit Pensacola team in 2013... Send An Email Read Bio Shawn Brown joined the Visit Pensacola team as the digital marketing manager in 2013. He is responsible for managing the website, assisting partners with listings and supporting internal team members. He is experienced in search engine optimization, creative design and data analysis. Before Visit Pensacola, Brown served as a webmaster for Cox Communications for 13 years. There, he developed applications for internal communications and focused on web design. After college, he was self-taught in web design, coding, and information technology. Shawn earned a bachelor’s in biblical studies from Calvary Chapel Bible College. A true outdoorsman, Shawn and his wife Lindy own Outdoor Gulf Coast, an adventure equipment rental company. In his spare time, he enjoys windsurfing, paddling, hiking and more. The two have two children, Sarah and Sam. Lindsey Steck Marketing & Communications Manager Hometown: Pensacola, Florida Experience chaser. Content curator. NFL buff Lindsey Steck joined the Visit Pensacola team in 2017 and is responsible for copywriting, writing for press, public relations... Send An Email Read Bio Lindsey Steck joined the Visit Pensacola team in 2017 and is responsible for copywriting, writing for press, public relations, integrated marketing, content curation and social media management. Prior to Visit Pensacola, Steck served as a corporate communications assistant for the Kansas City Chiefs where she served as a public relations contact for community outreach events. She was responsible for writing for press and publication, press conference facilitation, public relations, football communications support, assisting club executives and game day support. Throughout her time in college, she served in athletic communications as the public relations contact for men and women’s cross country and additionally assisted with 13 other sports. Steck began her journey in the tourism industry working for Florida House on Capitol Hill, the country’s only state embassy in Washington, D.C. There, she supported events, assisted administration and welcomed guests from across the globe. She holds a bachelor’s degree in communications with an emphasis in public relations from the University of West Florida. Outside of the office, Steck is actively involved in the community. She currently volunteers with Big Brothers Big Sisters of Northwest Florida, Junior League of Pensacola and serves on the Board of Directors for the Florida Public Relations Association. In her free time, you can find her scouring farmer’s markets, watching NFL football and working on her East Hill cottage. Elliott Cooper Digital and Creative Manager Hometown: Pensacola, Florida Gamer. Drone Flier. Digital Guy. Elliott Cooper joined Visit Pensacola in 2021 as the Digital & Creative Manager and is responsible for inhouse graphic and video creation... Send An Email Read Bio Elliott Cooper joined Visit Pensacola in 2021 as the Digital & Creative Manager and is responsible for inhouse graphic and video creation. Prior to Visit Pensacola, Elliott worked as a Digital Marketing Coordinator for Innisfree Hotels and Keep Pensacola Beautiful. Raised in Gulf Breeze, Elliott is a true local and spent most of his time growing up on Pensacola Beach. Elliott earned a bachelor's degree in communications from the University of West Florida. Elliott enjoys technology and loves tinkering with electronics and computers in his free time. He has two cats and two dogs and he loves taking the dogs on long walks on the nature trails around UWF. Blake Howerton Social Media & Content Associate Hometown: Pensacola, Florida Pensa-local. Creative being. Old soul. Blake Howerton joined Visit Pensacola in 2022 as the social media and content associate and is responsible for planning... Send An Email Read Bio Blake Howerton joined Visit Pensacola in 2022 as the social media and content associate and is responsible for planning, creating, and implementing social media content across eight platforms. Blake is a Pensacola native. After receiving a bachelor’s degree in communications with a focus in advertising from the University of North Florida in Jacksonville in 2018, Blake moved back home to begin his marketing career. Before joining the Visit Pensacola team, he served as the communications coordinator at Studer Family Entertainment & Retail for 3 years, and as the marketing and communications coordinator at Big Brothers Big Sisters of Northwest Florida for over a year. Blake has a passion for sharing Pensacola’s story with others. Off the clock, Blake enjoys photography, cooking, watching the sunset on the beach with his friends, and dining at Pensacola’s many restaurants. He is actively involved with Big Brothers Big Sisters of Northwest Florida serving on the Big Gala Committee. Hannah Pinson Website Associate Hometown: Navarre, Florida Sunset Lover. Ocean Enthusiast. Cat Mom. Hannah Pinson joined the Visit Pensacola team in 2023 as the Website Associate. She is responsible for creating and maintaining website content... Send An Email Read Bio Hannah Pinson joined the Visit Pensacola team in 2023 as the Website Associate. She is responsible for creating and maintaining website content, writing email newsletters, creating/editing blog posts, and more. Prior to Visit Pensacola, Pinson worked as an IT recruiter. She earned a Bachelor of Science in Information Technology and a minor in Marketing Applications from the University of West Florida. She has experience in software development, digital marketing, public relations, and content creation. Outside of work, she enjoys creating videos and taking photos. She also loves to shop, go to Disney World, hang out with family, and play with her two cats. A proud UWF Alum, Hannah serves on the UWF IT Alumni Advisory Board. Growing up in the Florida panhandle, she has a huge appreciation for the beach and will never pass up an opportunity to catch a good sunset or go for a swim in the Gulf. Sales & Services Melissa Bailey Partner Relations Manager Hometown: Pensacola, Florida Foodie. Optimist. Baseball Mom. Melissa Bailey joins the Visit Pensacola team with over 20 years of industry experience.... Send An Email Read Bio Melissa Bailey joins the Visit Pensacola team with over 20 years of industry experience. For the past 17 years, she has served Great Southern Restaurants as the director of catering and private events. With experience in both the front and back of house operations, she thrives in making connections with community partners and stakeholders. A native of Pensacola — and planning to stay that way by continuing to build roots with friends, family, and loyal customers, she is the perfect person to trust with your business needs. Tia Robbins Destination Sales Manager Hometown: Omaha, Nebraska Visionary. Connector. Boy Mom Tia Robbins joined the Visit Pensacola team as the Destination Sales Manager in February 2023.... Send An Email Read Bio Tia Robbins joined the Visit Pensacola team as the Destination Sales Manager in February 2023. In her role, she is responsible for facilitating leads and inquiries for group sales, attending trade shows, developing relationships with clients promoting Escambia County, and more. Prior to joining Visit Pensacola, Tia began her career in public relations and marketing in the music and entertainment industry in New York City. After relocating to the Pensacola area in 2012 she became deeply committed to, and passionate about serving the Pensacola community. In 2014, Robbins and her husband co-founded Mr. Robbins’ Neighborhood, a 501(c) 3 non-profit organization that serves underserved student athletes in Escambia and Santa Rosa Counties in Florida, by positioning, preparing and developing program participants for success beyond high school sports. In addition to working in the non-profit sector, Tia found a passion in entrepreneurship and supporting small businesses and in 2020 founded, Taste of Pensacola, LLC., a unique online gifting service that partners with local area makers and artisans to feature in a selection of curated and themed gift boxes. In her free time, Robbins enjoys traveling, being a sports mom, and making memories with her husband, Fred and two sons, Tre’ and Troi. Larry Orvis Facilities Manager Hometown: Pensacola, Florida Building gate keeper. Veteran. Bookworm Larry Orvis currently serves as the facilities manager for Visit Pensacola. He is responsible for building maintenance, beautification... Send An Email Read Bio Larry Orvis currently serves as the facilities manager for Visit Pensacola. He is responsible for building maintenance, beautification, and office management. Orvis joined the team in 1998 as a tourism ambassador and served for two years before moving into his current role. Prior to Visit Pensacola, Larry was a member of the U.S. Army for 28 years working in logistics. He retired to Pensacola in 1992 because he enjoys all of the activities. Outside of work, he enjoys reading. Jennifer Saba Sales and Services Associate Hometown : Hattiesburg, MS Boy Supermom. Holiday Extraordinaire. Steel Magnolia. Jennifer joined the team in December of 2024 as the Sales and Services Associate. Jennifer’s role is... Send An Email Read Bio Jennifer joined the team in December of 2024 as the Sales and Services Associate. Jennifer’s role is directly involved with destination sales, partner relations, organizing community tourism events, and more. Prior to joining Visit Pensacola, Jennifer served as the Executive Director of the Pensacola Mardi Gras Foundation, where she created impactful community experiences through PMG events. Before joining Pensacola Mardi Gras, Jennifer served as the Annual Giving Coordinator at the Ascension Sacred Heart Foundation, where she organized Pensacola's largest Mardi Gras Ball, the Cordova Mall Ball, successfully raising funds to benefit the Studer Family Children's Hospital. She also worked closely with Children’s Miracle Network Hospital initiatives, partners, and events. Before moving to Pensacola in 2015, Jennifer worked as a Marketing and Communication Specialist for Spirit of Women, coordinating events, marketing programs, and outreach campaigns. She mentored hundreds of teenage women, leading enrichment programs and creating community service opportunities. She was honored as the 2013 Junior Professional of the Year by the Mississippi Hospital Association’s Society for Health Care Marketing and Public Relations. Jennifer’s career has been centered around what she calls 'fun' work! She worked at Walt Disney World, gaining expertise in Resort Operations at Disney Vacation Club Resorts. She also served as a Program Leader, worked in Convention Services, became a Certified Disney Trainer, and was awarded the 'Cricket of the Quarter' Cast Member Excellence Award, along with numerous 'Great Service Fanatic' awards for outstanding guest service. During her time in Central Florida, Jennifer also worked with the Orlando Magic NBA Team, ensuring a top-tier experience for VIP season ticket holders. Jennifer is passionate about creating memorable experiences, fostering relationships, and having fun while doing so. With a minor in Tourism Management, she is excited to be fully immersed in the world of tourism and help showcase Pensacola. In her free time, Jennifer loves being with her family and embracing all the fun 'boy mom' adventures! Whether it's hanging out with loved ones and friends, enjoying our beautiful beaches, sipping a bushwhacker, traveling, or cheering from the T-ball field, she’s all about embracing the fun and joy life brings! She also treasures simple moments, like staying home, snuggling up, and watching movies with her boys. Visitor Services Debbie Keegan Tourism Ambassador Hometown: Atlanta, Georgia Estate Sale Guru. Dog Mom. Brunch-a-holic. Anita Spicer Tourism Ambassador Hometown: Montevallo, Alabama Rock painter. Flower lady. Sandcastle Builder. Michelle Schwaiger Tourism Ambassador Hometown : Pensacola, Florida Coffee Geek. Sea Life Painter. Avid Boater. Terri Hansell Tourism Ambassador Hometown: Dania Beach, Florida Foodie. Shell Collector. Gardening Buff. Adine Roberts Tourism Ambassador Hometown : Pensacola, Florida Grammie. Wordle Gamer. Crocheter. Paula Huntzinger Tourism Ambassador Hometown: Morristown, New Jersey Beach Lover. Dog Mom. Pensacola Explorer. Michelle Zwiers Tourism Ambassador Hometown: Big Rapids, Michigan KC Chiefs Fan. Retired Pre-K teacher. Thalassophile. Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Visit Pensacola 1401 E. Gregory Street Pensacola, Florida 32502 Visitor Center Locations Contact Us (800) 874-1234 enews@visitpensacola.com logo Request Guide Email Signup Blog Get the App Become A Partner Advertising Opportunities Partner Login Privacy Policy ©2025 Visit Pensacola Florida. All Rights Reserved. This website uses cookies to enhance your user experience on the website. Learn more. Accept Experience Builder Quick Search logo Expanded Search Location Map"
    },
    {
      "url": "https://www.fiestapensacola.org/other-events?lightbox=dataItem-k62idt0b",
      "text": "Other Events | Fiesta Pensacola top of page Home About Crawfish Festival Seafood Festival Other Events Volunteer Court of DeLuna Endowment Fund Community Partners News Contact More... Use tab to navigate through the menu items. Cart FIESTA CELEBRATION Our Mission CHILDREN’S TREASURE HUNT Presented by International Paper EVENT INFO:​ Saturday, April 5 , 2025 Downtown Pensacola at Museum Plaza 11:00am to 3:00pm ​ FREE! FREE! FREE! The Fiesta Pensacola Children's Treasure Hunt is a FREE event for Pensacola. Registration begins at 11:00am at Museum Plaza in Downtown Pensacola. Registration is required for entry for prize drawings, THERE WILL BE NO PREREGISTRATION. Food service will begin at 11:30am, and the Prize Ceremony will begin at 2:00pm. ​ ​ All registered children will be entered into grand prize drawings, based upon age: 0-2 years old, 3-4 years old, 5-7 years old, and 8-10 years old, with multiple prizes per group. Prizes include: bicycles, tricycles, summer camp sessions, water activities, art easels, sporting event tickets and so much more, all located down at our Prize Zone! ​       This FREE event will include fun for the whole family! FREE registration is from 11:00AM-2PM. The day will include games for children and families, face painting, snow cones, interactive museum scavenger hunt, and visits from various community organizations. There will be special appearances by some of our favorite local friends, Kazoo of the Pensacola Blue Wahoos, Don Tristan DeLuna the 75th and more! All families in attendance will receive FREE lunch, chips, snow cones, Coca-Cola products and water. ​ ​ ​ Emmanuel Sheppard & Condon FIES TA DAYS CELEBRA TION EVENT INFO: ​ Wednesday, May 27, 2026 ​ Be sure to join the Surrender of the City in Phineas Phoggs at 7:15 p.m. as local dignitaries such as the Mayor, Fire Chief, Supervisor of Elections, Escambia County Sheriff and Pensacola Naval Air Station Commanding Officer surrender the City of Pensacola and its citizens to DeLuna and his Queen for the Fiesta Season. ​ ​ ​ If purchasing tickets through the EventBrite link above, you will not receive a physical ticket. We will have a spreadsheet at the event with the purchaser's name. Additionally, please bring a copy of your emailed receipt. If you are purchasing multiple tickets and do not attend to arrive to the event with the other guests, please email fiesta@fiestapensacola.org the additional names to be added to the event entry spreadsheet. ​ T ickets may be purchased at the Fiesta office or at the door. T icket sales on the evening of the event will begin at 6:00PM at Seville Quarter . ​ With each ticket, guests receive access to all rooms and their themed food offerings and signature beverages. Guests will also receive two drink tickets and a custom designed annual commemorative medallion upon arrival. ​ ​ Tickets are not yet available. ​ GRAND FIESTA PARADE Presented by Kia Autosport APPLICATIONS ARE CLOSED! ​ EVENT INFO: ​ Friday, May 29, 2026 ​ ​ ​ Come catch some beads, hear the sounds of local high school marching bands, and enjoy watching beautiful floats parade through downtown beginning at 7:00 p.m. Bring the entire family to one of Pensacola’s favorite Fiesta events. In addition to the dozens of local krewes parading, special appearances will be made by a masked DeLuna , his Queen and their court. PARKING: Parade parking is available throughout the downtown area on a first-come first serve basis. All downtown lots are owned by private businesses and will likely charge a parking fee. These fees are not associated with or controlled by the Grand Fiesta Parade or Fiesta Pensacola. Handicap parking will be available in the Smart Bank parking lot at the corner of Gregory and Palafox Streets after 5:00 pm on Friday. There will be a sign at the parking lot entrance indicating “Handicap Parking.” ​ ​ FIESTA BOAT PARADE Sponsored by Centennial Imports AHOY! Join us as DeLuna's court, crew an d parade of vessels set sail on the beautiful Pensacola Bay ​ EVENT INFO: Saturday, May 30, 2026 To watch the colorful cruise from land, the best views will be from Sanders Beach-Corinne Jones Resource Center or Plaza de Luna in Downtown Pensacola FIESTA ALL KREWE BALL ​ EVENT INFO: ​ Thursday, June 4, 2026 ​ ​ ​ ​ CALLING ALL KREWES! Join Fiesta, DeLuna LXXVI , his Queen and the 2026 Court of DeLuna for this annual celebration! ​ ​ ​ ​ ​ ​ Each ticket includes event entry, live entertainment, and light bites throughout the evening ​ PLEASE NOTE: Tickets will NOT be available for sale upon entry, all tickets must be purchase through the link below, or in person at our office. ​ ​ If you are purchasing multiple individual tickets, please include the name of each person you are purchasing for, so they will be included on the event spreadsheet at event check-in. ​ ​ ​ Ticket Purchases are not yet available. Royalty Applications are closed. ​ IceFlyersShieldLogo_CB LBC 2024 NEW LOGO Fasig Brooks Law Offices-Logo (1) (1) IceFlyersShieldLogo_CB 1/19 Fiesta Pensacola 125 S. Alcaniz Street, Suite 1 Pensacola, FL 32502 850.433.6512 2020 Fiesta Pensacola | Terms of Use | Privacy Policy bottom of page"
    },
    {
      "url": "https://sailpensacola.org/fiesta-five-flags-2023/",
      "text": "Fiesta Five Flags 2023 - SAIL PENSACOLA 850-462-3545 VMG@SailPensacola.org Facebook X Instagram Facebook X Instagram 0 Items Home About SAIL! Race Jobs Events Conditions Blog Gallery DONATE Select Page Fiesta Five Flags 2023 Sep 12, 2023 | Education , Events May 28-June 30, 2023 The Spanish Naval Training ship Juan Sebastian De Elcano was dockside at Pensacola Pier, kicking off a week of Fiesta celebrations for the founding of Pensacola! The Fiesta lasts for a week each June and in 2023, the Spanish Navy kicked off the celebrationb with a grand entrance on Monday morning, May 29, 2023. Traditional fanfare, parties and greetings were coordinated courtesy of Pensacola Yacht Club ! All Posts Foiling Week Pensacola Details Un-Regatta 2025 Cabrinha | Dakine America’s Cup 37 – Louis Vuitton Cup Sail Pensacola Social Media Marketing Internship EcoGulf Waydoo Evo HydroFlyer NYYC 2024 Resolute Cup America’s Cup 37 – Prelim #3 Barcelona! Pensacola Sailing: How we got to 2024! American Magic Welcomes Patriot! Foiling Week Pensacola iFly 15 Cam Farrah More Funds For American Magic Pensacola HQ American Magic and Pensacola FLo1 Foiling Dinghy Birdyfish Sail Pensacola Business Ecosystem Conference Cabrinha | Dakine Oct 16, 2024 | Boards , Sailing Footprint Accelerator , Wing Sail Pensacola Presents: Demo Weekend - Cabrinha Wings & Dakine Wind!  Experience the fastest growing watersport in the world! Join Us for an Epic Weekend on the Water! Mark your calendars for our Demo Weekend featuring the latest equipment from... #SailingIsOurBusiness  +1-850-462-3545  VMG@SailPensacola.org  Sailing Tech Hub Share This https://www.facebook.com/sailpensacola https://www.twitter.com/sail_pensacola https://www.linkedin.com/company/90481155/admin/"
    },
    {
      "url": "https://www.pnj.com/story/entertainment/dining/2023/08/31/pensacola-seafood-festival-2023-heres-everything-we-know-so-far/70565361007/",
      "text": "Pensacola Seafood Festival 2023: Here's everything we know so far News Sports Play Opinion Advertise Obituaries eNewspaper Legals DINING Pensacola Seafood Festival 2023: From restaurant rosters to parking - find the info here. Brittany Misencik Pensacola News Journal Get your lobster bib ready, the Pensacola Seafood Festival is gearing up to return Sept. 29 through Oct. 1. The fan-favorite festival hosted by Fiesta Pensacola is celebrated annually with guests from near and far. The festival has put Pensacola on the map as one of the largest arts and crafts fairs in Northwest Florida and for headlining award-winning artists such as Chris Stapleton, Moon Taxi and Brothers Osbourne. Here’s everything you need to know to start planning your weekend. When and where is Pensacola Seafood Festival? The Pensacola Seafood Festival will take place in Seville Square, located at 301 S. Alcaniz St., during the last weekend of September. On Friday, the festival will be held from 11 a.m. to 11 p.m. On Saturday, the festival will be held from 10 a.m. to 11 p.m. and Sunday the festival will kick off at 11 a.m. and wrap up at 5 p.m. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Live entertainment will be held on the mainstage of Bartram Park with several concert times throughout each day. On Friday, there will be live entertainment at 3 p.m., 5 p.m., 7 p.m. and 9 p.m. On Saturday, there will be live entertainment at 3:30 p.m., 5:30 p.m., 7 p.m. and 9 p.m. On Sunday, there will be live entertainment at 12:30 p.m. and 3 p.m. Specific performing artists are scheduled to be announced next week on the Fiesta Pensacola social media pages and Pensacola Seafood Festival website. What will be different about the festival this year? Executive Director of Fiesta Pensacola Bridget Middleton said that the biggest change people will notice this year is a more curated food vendor selection as opposed to an overabundance of fair food. “We have been recruiting more food trucks and less of the larger festival-food type vendors. More specialty seafood vendors,” Middleton said. “So that’s going to be a big difference this year than in the previous years.” She said this will allow them to feature more food trucks and smaller restaurants to “showcase what they can do with seafood.” Check out these photos from last year: Crowds enjoy crafts, food, and music during Pensacola Seafood Festival | PHOTOS What kind of food can I expect? The festival prides itself in its “seafood eats and other treats,” guaranteeing that even if you’re not a seafood fan, you won’t go hungry. The event draws a variety of food trucks and carts that guarantee you’ll be able to try something new if you choose to but can also still fall back on a tried-and-true burger. This year, there will be about a dozen local restaurants in the “Gulf to Table” section and 12 to 15 vendors in the general food area. Will there be local seafood options? Yes! The separate “Gulf to Table” section of the event located in Fountain Park features well-renowned local Pensacola restaurants and caterers. Local chefs will be on standby, preparing tapas-sized portions of their best-selling signature dishes. Even though the “Gulf to Table” area is located a little off the path of the main vendor strip, you will want to make a special trip. This year, local favorites will be making a return such as Flounder’s, Fisherman’s Corner, Fishing Hole, Café NOLA, Restaurant NOLA and Crabs on the Beach. “For instance, when The Fish House has done it in the past, they do Grits a Ya Ya, but they do a small version of that,” Middleton said. The Fiesta Seafood Grille area, sponsored by Pensacola Energy, also brings in local chefs for live cooking demonstrations. This year will feature chefs Ed Lordman of Southern Grit Culinary, Rusty Strain of A Rustyc Spoon, Keith Pardue of Pensacola Smokehouse and Daniel Watts of Classic City Catering among others. Where do I park for the Pensacola Seafood Festival? There is no designated parking for the festival aside from handicapped parking at the Port of Pensacola (700 South Barracks Street) after 5 p.m. on Friday through Sunday. All other parking will be available in the downtown area on a first-come, first-served basis. Different parking lots will vary in price, but the fees are unaffiliated with the Pensacola Seafood Festival or Fiesta Pensacola. Reference PNJ’s downtown parking guide to plan where you will be parking, how to pay your fee and how much it will likely cost you. PNJ’s Pensacola parking guide: What you need to know about parking in downtown Pensacola Will there be alcohol for sale at the event? Yes. There will be various booths set up around the event to sell beer, wine and cocktails. The beer garden in Fountain Park will be the place to find craft beer, draft beers and bottled varieties. The Bartram Park booth near the entertainment area will serve as a more of a sports bar with full-service cocktails. Fiesta Pensacola will also have a specialty cocktail booth set up near Seville Quarter with their best-selling rum punch, mimosas and margaritas. There will also be booths with Coca-Cola products and water available throughout the festival for purchase. What kind of retail vendors will there be? There will be over 150 vendors to choose from. For the arts and crafts category, 100% of the items for sale are handmade. Examples include handmade jewelry, pottery, art, soaps, woodcrafts, glassware and more. There will also be commercial vendors with brand-names such as LulaRoe, Pampered Chef and Scentsy. Although most vendors accept cards and cash, ATMs will be available to use on-site. Will there be VIP wristbands? Yes. Fiesta Pensacola will be selling VIP wristbands closer to the actual event that allow for added amenities, such as an open bar and preferred seating. Follow along on their social media for updates on pricing and availability. Can I bring my dog with me? No, dogs are not permitted at the Pensacola Seafood Festival. Due to a city ordinance in the park, there are no pets allowed except for service dogs. Can I bring a cooler? No. Coolers are prohibited for the festival, as well as outside food and drinks. What other events does Fiesta Pensacola host? The Fiesta Pensacola nonprofit organization was formed to celebrate the founding of Pensacola, \"America’s First Settlement,\" according to the Fiesta Pensacola website. The group hosts over 20 events a year with the help of its volunteers and sponsors. Some of the major events include the Pensacola Crawfish Festival, Fiesta Children’s Treasure Hunt and Fiesta Celebration. Can I volunteer at the Pensacola Seafood Festival? Yes! Fiesta Pensacola is still searching for volunteers to join their “Fiesta Forces.” You can either email volunteer@fiestapensacola.org or join the free sign-up party from 5:30 p.m. to 7:30 p.m. on Aug. 17 at 125 S. Alcaniz St. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Nachricht Surname First First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.fiesta-youth.org/board-of-directors",
      "text": "Board of Directors and Staff — Fiesta Youth 0 Skip to Content Home About Mission Board of Directors and Staff History Community Partners Proud Beneficiary Of.. Contact Press Inquiries Financials Programs Young Adult Meetings Youth Meetings Discord Chat/Game Night Kids Meetings Parent Meetings Robotics Team End HIV Stigma - Sexual Health San Antonio Public Library (SAPL) LGBTQ+ Awareness Training FY Cyberbullying Policy Events Calendar 11th Annual Midnight in the Garden of Good and Evil LGBTQ+ Prom Back to School Bash! Ponyboi Volunteer Volunteer Application Scholarships General Information General Scholarship Application Hector Bove Scholarship Award Application Testimonials Sponsors Resources Local/State Resources National Resources Important Resource Numbers Texas Name and Gender Marker Change LGBTQ College Scholarships Best Trade Schools Photo Album Youth Events Midnight in the Garden of Good & Evil Hocus Pocus Prom Pride Bigger Than Texas Back to School Bash Bat Conservation International Partnership NOH8 Campaign San Antonio SUPPORT Open Menu Close Menu Home About Mission Board of Directors and Staff History Community Partners Proud Beneficiary Of.. Contact Press Inquiries Financials Programs Young Adult Meetings Youth Meetings Discord Chat/Game Night Kids Meetings Parent Meetings Robotics Team End HIV Stigma - Sexual Health San Antonio Public Library (SAPL) LGBTQ+ Awareness Training FY Cyberbullying Policy Events Calendar 11th Annual Midnight in the Garden of Good and Evil LGBTQ+ Prom Back to School Bash! Ponyboi Volunteer Volunteer Application Scholarships General Information General Scholarship Application Hector Bove Scholarship Award Application Testimonials Sponsors Resources Local/State Resources National Resources Important Resource Numbers Texas Name and Gender Marker Change LGBTQ College Scholarships Best Trade Schools Photo Album Youth Events Midnight in the Garden of Good & Evil Hocus Pocus Prom Pride Bigger Than Texas Back to School Bash Bat Conservation International Partnership NOH8 Campaign San Antonio SUPPORT Open Menu Close Menu Home Folder: About Back Mission Board of Directors and Staff History Community Partners Proud Beneficiary Of.. Contact Press Inquiries Financials Folder: Programs Back Young Adult Meetings Youth Meetings Discord Chat/Game Night Kids Meetings Parent Meetings Robotics Team End HIV Stigma - Sexual Health San Antonio Public Library (SAPL) LGBTQ+ Awareness Training FY Cyberbullying Policy Folder: Events Back Calendar 11th Annual Midnight in the Garden of Good and Evil LGBTQ+ Prom Back to School Bash! Ponyboi Folder: Volunteer Back Volunteer Application Folder: Scholarships Back General Information General Scholarship Application Hector Bove Scholarship Award Application Testimonials Sponsors Folder: Resources Back Local/State Resources National Resources Important Resource Numbers Texas Name and Gender Marker Change LGBTQ College Scholarships Best Trade Schools Folder: Photo Album Back Youth Events Midnight in the Garden of Good & Evil Hocus Pocus Prom Pride Bigger Than Texas Back to School Bash Bat Conservation International Partnership NOH8 Campaign San Antonio SUPPORT Board of Directors 2024 President - Chris Chun , COL US Army (Retired) Vice President - Matthew Salomon , Caregiver Treasurer - April Marquez , IT Manager Secretary - Stacy Speedlin Gonzale z , Owner and Executive Director, Luz Counseling and Consulting Director - Darrell Parsons , LCSW, Owner/President, State of Mind Counseling Center Director - Dr. Ana Perez-Potthast , PhD LCSW & LCDC Psychoanalyst Director - Desiree Caudill , Health Aide Director - Miriam Hunt , SAHM Director - Linda Bove , International Sales Manager (Retired) Director - Christina Diaz , PhD Student Director - Bruce Humphrey , Former President/CEO & Head of Government Affairs Chamber of Commerce Fiesta Commissioner - Darrell Parsons , LCSW *Board meetings are on the 2nd Thursday of the month, starting at 6:30pm, and are open to the public. Please contact Chris Chun for more information on meeting location. GIDEON DEL RIO - YOUTH FACILITATOR  (HE/HIM/HIS PRONOUNS) Gideon joins the Fiesta Youth organization as our part-time Youth Facilitator effective January 2, 2020.  Gideon has served as an active member in the LGBTGIA+ community for many years and served as the President of the San Antonio Gender Association (SAGA).  He received his Bachelors of Liberal Arts from Grand View University. Gideon lends his experience to our programming activities and helps foster a sense of pride in our youth as they explore their identities and connect with our ever growing community. DIANA CAIN - YOUTH FACILITATOR  (THEY/THEM/THEIR PRONOUNS) Diana is a student at the University of Texas at San Antonio for Music education and has been an active member of the LGBTQIA+ community  for many years. They hope to make their classroom a safe place for their students one day and is very excited to begin their work with Fiesta Youth Keira Dibrell - YOUTH & KIDS GROUPS FACILITATOR (SHE/HER/THEY/THEM PRONOUNS) Hello! My name is Keira Dibrell. I am non-binary and my pronouns are she/her/they/them. I just finished my 8th year of teaching. My wife and I have been married for about a year and a half. We have two little dogs named Mona and Midnight. I am excited to be embarking on this new journey in joining Fiesta Youth and being with kids outside of the classroom. I came out about 24 years ago and I remember how scary it was. It feels amazing to now be part of an organization that helps our community, especially kids feel safe, seen, and heard. So excited to work with the community to make this world better for our LGBTQIA youth. Cyber Alvarez - YOUTH & KIDS GROUPS FACILITATOR (HE/THEY PRONOUNS) Cyber is an advocate and creative professional with over 7 years of experience in queer advocacy. They studied psychology at NYU Steinhardt and earned a master’s in entrepreneurship from MICA. He is also a licensed esthetician. Cyber has taught queer studies at Columbia Teachers College and worked with the Pride Center for Trans Allies. Currently working in public safety, they’re also reconnecting with their roots as a retribalizing member of the Lipan Apache. Cyber is a visual artist who loves sharing intentional art spaces in San Anto. Fiesta Youth, 1761 Northwest Loop 410, San Antonio, TX, 78213, United States   210-390-0730   info@fiesta-youth.org Fiesta Youth Office/Meeting Address: 1761 Northwest Loop 410, San Antonio, TX 78213 Mailing Address: 2186 Jackson Keller Rd, #331, San Antonio, TX 78213 Tax ID 46-3737851 Subscribe Sign up to receive emails on events, programming, or other information! Email Address Sign Up We respect your privacy and your email information will not be shared. Thank You! Please check your inbox to confirm your subscription. like us on facebook for updates & announcements! All Rights Reserved | Copyright © Fiesta Youth Powered by Squarespace"
    },
    {
      "url": "https://www.fiestacommunities.com/contact",
      "text": "Contact Us :: Fiesta Communities, Inc. Communities Easy Home Acquisition Events & Promotions Blog Contact Us Magpa-FREE Site Tripping Hello, ako po si at gusto kong magpaschedule for a site tripping. Request Free Tripping Fiesta Communities search search Communities Easy Home Acquisition Events & Promotions Blog Contact Us menu Contact Us We're here to listen. Please use the form below to get in touch about any questions or comments you might have – we'll reply as quickly as we possibly can. Name Email -- Select a community you're interested in -- Fiesta Communities Calulut Fiesta Communities Mining Fiesta Communities Asinan Fiesta Communities Porac II Fiesta Communities Mabalacat Fiesta Communities Dapdap Fiesta Communities Calulut Fiesta Communities Mexico Fiesta Communities San Rafael Fiesta Communities Castillejos Other Message Send Messsage send textsms Call or Text Us +63956.447.9275 (Main Office) +63943.433.6461 (Main Office) email Email marketing@fiestacommunities.com (Main Office) room Visit Us HLDC Corporate Center, 43-35 Don Bonifacio Pulung Maragul, Angeles City, Pampanga, PH 2009 Get Our Balitang Fiesta Stay on top of the latest updates on news and promotions play_arrow Sign up now Maki-Saya sa Fiesta! follow us on: #AskFIESTA Copyright © 2019-2020 Fiesta Communities Inc. All rights reserved. Made by Emerge ↑"
    },
    {
      "url": "https://www.fiestapensacola.org/seafood-festival",
      "text": "Seafood Festival | Fiesta Pensacola top of page Home About Crawfish Festival Seafood Festival Other Events Volunteer Court of DeLuna Endowment Fund Community Partners News Contact More... Use tab to navigate through the menu items. Cart Pensacola Seafood Festival Sponsored by The Pensacola Ice Flyers Sept. 26, 27 & 28, 2025 Please visit www.PensacolaSeafoodFestival.com for more information FESTIVAL INFO Savor delicious seafood, enjoy live music by bay all weekend and immerse yourself in historic downtown Pensacola during the Annual Pensacola Seafood Festival, produced by Fiesta Pensacola. This festival is one of the largest arts and crafts fairs in northwest Florida with more than 150 artisans and craftsmen who travel from around the country to participate. ​ Friday, September 26 | 11AM-11PM Saturday, September 27 | 10AM-11PM Sunday, September 28 | 11AM-5PM ​ ​ Congrats to Our Poster Winner! Marygrace House \"Seafood Social\" LET'S EAT! Our festival features a variety of food and cart vendors that offer a multitude of seafood dishes: fried, grilled and blackened, burgers, chicken, fried fair food options, ice cream, shaved ice and much more! ​ GULF TO TABLE: This area features local restaurants and caterers will serve tapas sized portions of their signature dishes. Past participants include: Flounder’s Chowder House, Chet’s Seafood, Grayton Seafood Co., Fisherman’s Corner, Bonehead’s Fire Grilled, The Fish House, Nick’s Boathouse and more! ​ Interested in becoming a Gulf to Table Vendor? Click here to apply! ARTS & CRAFTS VENDORS With over 150 artisans and craftsmen, we have a variety of offerings throughout the festival, including: jewelry, metal, glass, gourmet, pottery, ceramics, soaps, candles, woodcraft, paintings, drawings, photography, clothing, outdoor and so much more! ​ Additional Vendor opportunities include: Commercial Vendors, Corporate Vendors and Festival Sponsors. Become a Vendor For more information and vendor applications, please visit www.PensacolaSeafoodFestival.com. APPLICATION ARE NOW Closed! Please check www.pensacolaseafoodfest.com for updates! ​ ​ Questions? Please call the Fiesta office - 850-433-6512 ENTERTAINMENT Past performers at our festival have gone on to become Grammy award-winning artists. Say you saw them when... Past artists that have taken the stage include: Brothers Osbourne, Chris Stapleton, Smithfield, Jordan Davis, The Revivalists, Ashley McBryde, Moon Taxi and more! We bring you these acts free of charge, and we only ask that you not bring in coolers or pets. ​ Interested in becoming a Friend of Fiesta, and gaining access to our VIP area adjacent to the Music Stage? Please email mcleidner@fiestapensacola.org for more information! PARKING Festival parking is available throughout the downtown area on a first-come first serve basis. All downtown lots are owned by private businesses and will likely charge a parking fee. These fees are not associated or controlled by the Pensacola Seafood Festival or Fiesta Pensacola. Handicapped parking will be available after 5:00PM on Friday through Sunday evening at the Port of Pensacola parking lot (700 South Barracks Street). Pet Information We are animal lovers too. However, pets are not allowed on festival grounds  - City of Pensacola Code, Section 4-2-33B. Although, service animals are welcome!  \"Service animals are defined as dogs that are individually trained to do work or perform tasks for people with disabilities. Examples of such work or tasks include guiding people who are blind, alerting people who are deaf, pulling a wheelchair, alerting and protecting a person who is having a seizure, reminding a person with mental illness to take prescribed medications, calming a person with Post Traumatic Stress Disorder (PTSD) during an anxiety attack, or performing other duties. Service animals are working animals, not pets. The work or task a dog has been trained to provide must be directly related to the person’s disability. Dogs whose sole function is to provide comfort or emotional support do not qualify as service animals under the ADA.\" -  U.S. Department of Justice,  Civil Rights Division - https://www.ada.gov/service_animals_2010.htm IceFlyersShieldLogo_CB LBC 2024 NEW LOGO Fasig Brooks Law Offices-Logo (1) (1) IceFlyersShieldLogo_CB 1/19 Fiesta Pensacola 125 S. Alcaniz Street, Suite 1 Pensacola, FL 32502 850.433.6512 2020 Fiesta Pensacola | Terms of Use | Privacy Policy bottom of page"
    }
  ]
}