{
  "fuentes": [
    {
      "url": "https://www.ticketmaster.com/the-fillmore-miami-beach-at-jackie-tickets-miami-beach/venue/107452",
      "email": "claimsinquiry@allianzassistance.com"
    },
    {
      "url": "https://www.fillmore-miami.com/private-events",
      "email": "fillmoremiamievents@livenation.com"
    },
    {
      "url": "https://www.fillmore-miami.com/accessibility",
      "email": "fmbboxoffice@livenation.com"
    },
    {
      "url": "https://www.fillmore-miami.com/accessibility",
      "email": "u003efmbboxoffice@livenation.com"
    },
    {
      "url": "https://www.780fillmore.org/about-us/board-and-staff/",
      "email": "info@780fillmore.org"
    },
    {
      "url": "https://specialevents.livenation.com/venues/the-fillmore-miami-beach",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/the-fillmore-miami-beach",
      "email": "fillmoremiamibeachevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/the-fillmore-miami-beach",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://www.fillmore-miami.com/visit",
      "email": "fmbboxoffice@livenation.com"
    },
    {
      "url": "https://www.fillmore-miami.com/visit",
      "email": "fillmoremiamievents@livenation.com"
    },
    {
      "url": "https://www.fillmore-miami.com/visit",
      "email": "u003efmbboxoffice@livenation.com"
    }
  ],
  "mails": [
    "claimsinquiry@allianzassistance.com",
    "fillmoremiamibeachevents@livenation.com",
    "fillmoremiamievents@livenation.com",
    "fmbboxoffice@livenation.com",
    "info@780fillmore.org",
    "specialevents@livenation.com",
    "u003efmbboxoffice@livenation.com"
  ],
  "nombre_sitio": "fillmore-miami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ticketmaster.com/the-fillmore-miami-beach-at-jackie-tickets-miami-beach/venue/107452",
      "text": "The Fillmore Miami Beach at Jackie Gleason Theater - Miami Beach, FL | Tickets, 2025-2026 Event Schedule, Seating Chart Your browser is not supported. For the best experience, use any of these supported browsers: Chrome , Firefox , Safari , Edge . Skip to main content US United States selected, change country Hotels Sell Gift Cards Help VIP Ticketmaster Home page Concerts Sports Arts, Theater & Comedy Family Cities More Toggle search bar Search Search Sign In/Register Home Miami, FL The Fillmore Miami Beach at Jackie Gleason Theater Tickets The Fillmore Miami Beach at Jackie Gleason Theater Tickets 1700 Washington Ave, Miami Beach, FL 33139, US Get Directions (Opens in new tab) Events & Add-Ons Venue Details Seating Chart Discover More Related Links All Events and Add-Ons 25 Results All Events and Add-Ons 25 Results Tickets Parking Club Access Special Entry VIP Filter by category All Categories Arts & Theatre Music Miscellaneous Dates All Dates Dates. Change date range: All Dates September 13, 2025 Sep 13 Saturday 09:00 PM Sat 9:00 PM Open additional information for Gad El Maleh \"lui Meme\" 9/13/25, 9:00 PM Gad El Maleh \"lui Meme\" Find Tickets Gad El Maleh \"lui Meme\" 9/13/25, 9:00 PM Add-Ons Parking Valet Parking - Gad El Maleh - Not a Concert Ticket Lineup Gad Elmaleh Adame September 19, 2025 Sep 19 Until 9/20/25 Until Sep 20 Open additional information for R&B ONLY LIVE - Miami, FL (10 Year Anniversary) 9/19/25, 7:45 PM R&B ONLY LIVE - Miami, FL (10 Year Anniversary) On partner site Find Tickets R&B ONLY LIVE - Miami, FL (10 Year Anniversary) 9/19/25, 7:45 PM On partner site Lineup R&B ONLY September 19, 2025 Sep 19 Friday 08:00 PM Fri 8:00 PM R&B ONLY LIVE - Miami, FL (10 Year Anniversary) On partner site Find Tickets R&B ONLY LIVE - Miami, FL (10 Year Anniversary) 9/19/25, 8:00 PM On partner site September 20, 2025 Sep 20 Saturday 08:00 PM Sat 8:00 PM Open additional information for berlioz (live) 9/20/25, 8:00 PM berlioz (live) Find Tickets berlioz (live) 9/20/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - Berlioz (Live) - Not a Concert Ticket** Special Entry Fast Lane Access - Berlioz (Live) - Not a Concert Ticket Parking Valet Parking - Berlioz (Live) - Not a Concert Ticket Lineup berlioz September 27, 2025 Sep 27 Saturday 08:00 PM Sat 8:00 PM Open additional information for Se Regalan Dudas - Se Puso Rara La Vida Tour USA 9/27/25, 8:00 PM Se Regalan Dudas - Se Puso Rara La Vida Tour USA Find Tickets Se Regalan Dudas - Se Puso Rara La Vida Tour USA 9/27/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - Se Ragalan Dudas - Not a Concert Ticket** Parking Valet Parking - Se Ragalan Dudas - Not a Concert Ticket Lineup Se Regalan Dudas October 4, 2025 Oct 04 Until 10/5/25 Until Oct 05 Open additional information for Trap Karaoke: Miami Beach 10/4/25, 7:00 PM Trap Karaoke: Miami Beach On partner site Find Tickets Trap Karaoke: Miami Beach 10/4/25, 7:00 PM On partner site Lineup Trap Karaoke October 6, 2025 Oct 06 Monday 08:00 PM Mon 8:00 PM Open additional information for Lil Tecca: The Dopamine Experience Tour 10/6/25, 8:00 PM Lil Tecca: The Dopamine Experience Tour Find Tickets Lil Tecca: The Dopamine Experience Tour 10/6/25, 8:00 PM Add-Ons Parking Valet Parking - Lil Tecca  - Not a Concert Ticket Club Access Stardust Lounge Access - Lil Tecca  - Not a Concert Ticket** Special Entry Fast Lane Access - Lil Tecca - Not a Concert Ticket Lineup Lil Tecca October 30, 2025 Oct 30 Thursday 08:30 PM Thu 8:30 PM Open additional information for Eden Ben Zaken 10/30/25, 8:30 PM Eden Ben Zaken Find Tickets Eden Ben Zaken 10/30/25, 8:30 PM Add-Ons Parking Valet Parking - Eden Ben Zaken - Not a Concert Ticket Lineup Eden Ben Zaken October 31, 2025 Oct 31 Friday 08:00 PM Fri 8:00 PM Open additional information for The Mars Volta 10/31/25, 8:00 PM The Mars Volta Find Tickets The Mars Volta 10/31/25, 8:00 PM Add-Ons Parking Valet Parking - The Mars Volta - Not a Concert Ticket Club Access Stardust Lounge Access - The Mars Volta - Not a Concert Ticket** Lineup The Mars Volta November 6, 2025 Nov 06 Thursday 08:00 PM Thu 8:00 PM Open additional information for Sasha Colby: Stripped II (18+) 11/6/25, 8:00 PM Sasha Colby: Stripped II (18+) Find Tickets Sasha Colby: Stripped II (18+) 11/6/25, 8:00 PM Add-Ons Parking Valet Parking - Sasha Colby - Not a Concert Ticket Club Access Stardust Lounge Access - Sasha Colby - Not a Concert Ticket** Lineup Sasha Colby November 20, 2025 Nov 20 Thursday 08:00 PM Thu 8:00 PM Open additional information for PLUTO World 11/20/25, 8:00 PM PLUTO World Find Tickets PLUTO World 11/20/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - PLUTO World - Not a Concert Ticket** Special Entry Fast Lane Access - PLUTO World - Not a Concert Ticket Parking Valet Parking - PLUTO World - Not a Concert Ticket Lineup Pluto November 21, 2025 Nov 21 Friday 08:00 PM Fri 8:00 PM Open additional information for SARAH MILLICAN: LATE BLOOMER 11/21/25, 8:00 PM SARAH MILLICAN: LATE BLOOMER Find Tickets SARAH MILLICAN: LATE BLOOMER 11/21/25, 8:00 PM Add-Ons Parking Valet Parking - Sarah Millican - Not a Concert Ticket Club Access Stardust Club Access - Sarah Millican - Not a Concert Ticket** Lineup Sarah Millican November 22, 2025 Nov 22 Saturday 08:00 PM Sat 8:00 PM Open additional information for Clara Ulrich - Yo Quiero Ser Mi Marido (18+) 11/22/25, 8:00 PM Clara Ulrich - Yo Quiero Ser Mi Marido (18+) Find Tickets Clara Ulrich - Yo Quiero Ser Mi Marido (18+) 11/22/25, 8:00 PM Lineup Clara Ulrich November 23, 2025 Nov 23 Sunday 08:00 PM Sun 8:00 PM Open additional information for Men I Trust - Equus Tour 2025 11/23/25, 8:00 PM Men I Trust - Equus Tour 2025 Find Tickets Men I Trust - Equus Tour 2025 11/23/25, 8:00 PM Add-Ons Special Entry Fast Lane Access - Men I Trust - Not a Concert Ticket Club Access Stardust Lounge Access - Men I Trust  - Not a Concert Ticket** Parking Valet Parking - Men I Trust  - Not a Concert Ticket Lineup Men I Trust Evan Wright November 28, 2025 Nov 28 Friday 08:00 PM Fri 8:00 PM Open additional information for ELENA ROSE - Alma US Tour 2025 11/28/25, 8:00 PM ELENA ROSE - Alma US Tour 2025 Find Tickets ELENA ROSE - Alma US Tour 2025 11/28/25, 8:00 PM Add-Ons Parking Valet Parking - Elena Rose - Not a Concert Ticket Club Access Stardust Lounge Access - Elena Rose - Not a Concert Ticket** Lineup Elena Rose December 3, 2025 Dec 03 Wednesday 08:00 PM Wed 8:00 PM Open additional information for J.I.D - God Does Like Paradise Tour 12/3/25, 8:00 PM J.I.D - God Does Like Paradise Tour Find Tickets J.I.D - God Does Like Paradise Tour 12/3/25, 8:00 PM Add-Ons Parking Valet Parking - J.I.D - Not a Concert Ticket VIP Young Nudy Meet & Greet Upgrade (TICKET NOT INCLUDED) J.I.D VIP Upgrades (Event ticket not included) Special Entry Fast Lane Access - J.I.D- Not a Concert Ticket Club Access Stardust Lounge Access - J.I.D - Not a Concert Ticket** Lineup J.I.D Young Nudy December 4, 2025 Dec 04 Thursday 08:00 PM Thu 8:00 PM Open additional information for Juvenile 12/4/25, 8:00 PM Juvenile Find Tickets Juvenile 12/4/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - Juvenile - Not a Concert Ticket** Parking Valet Parking - Juvenile - Not a Concert Ticket Special Entry Fast Lane Access - Juvenile - Not a Concert Ticket Lineup Juvenile December 5, 2025 Dec 05 Friday 08:00 PM Fri 8:00 PM Open additional information for An Evening With David Byrne - Who is the Sky Tour 12/5/25, 8:00 PM An Evening With David Byrne - Who is the Sky Tour Find Tickets An Evening With David Byrne - Who is the Sky Tour 12/5/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - David Byrne - Not a Concert Ticket** Parking Valet Parking - David Byrne - Not a Concert Ticket Lineup David Byrne December 6, 2025 Dec 06 Saturday 08:00 PM Sat 8:00 PM Open additional information for An Evening With David Byrne - Who is the Sky Tour 12/6/25, 8:00 PM An Evening With David Byrne - Who is the Sky Tour Find Tickets An Evening With David Byrne - Who is the Sky Tour 12/6/25, 8:00 PM Add-Ons Club Access Stardust Lounge Access - David Byrne - Not a Concert Ticket** Parking Valet Parking - David Byrne - Not a Concert Ticket Lineup David Byrne December 14, 2025 Dec 14 Sunday 08:00 PM Sun 8:00 PM Open additional information for Manuel Medrano 12/14/25, 8:00 PM Manuel Medrano Find Tickets Manuel Medrano 12/14/25, 8:00 PM Add-Ons Parking Valet Parking - Manuel Medrano - Not a Concert Ticket VIP Manuel Medrano Meet & Greet (does not include main event ticket) Club Access Stardust Lounge Access - Manuel Medrano - Not a Concert Ticket** Lineup Manuel Medrano Page 1 of 2 Next page 2 Last page 2 Advertisement Venue Details The Fillmore Miami Beach at Jackie Gleason Theater , 1700 Washington Ave, Miami Beach, FL 33139, US Get Directions (Opens in new tab) What are the box office phone numbers? (305) 673-7300 - Press option two to reach a Fillmore representative during normal business hours and extended hours for concerts and most events. This is a general information line and is not a charge by phone number. When is the box office open? Tuesdays and Thursdays from 11am-6pm EST On Show Days: 2 hours prior to door time and closes when the headliner takes the stage What payment types are accepted? MasterCard, Visa, Discover, American Express. No checks accepted (personal, business or money orders). Box Office does not accept Ticketmaster gift cards. Box Office reserves the right to refuse gift cards. What are the will call rules? Available for pickup starting the day of the event when box office opens until approximately 30 minutes after scheduled start of show. Certain restrictions may apply for various tour/artist packages. Photo identification of the purchaser or guest list attendee required for all will call collections. What are the parking options at The Fillmore Miami Beach at Jackie Gleason Theater? VALET - $35.00 plus gratuity - Entrance is on Washington Ave. Pull into the circle driveway (Jackie Gleason Dr) to the valet stand. Valet opens approximately 2.5 hours prior to show scheduled start time and closes after the show concludes. Valet is open for most ticketed concerts on the main stage, however valet parking may not be available for all events at The Fillmore Miami Beach. Please check directly with the venue a few days prior to the scheduled event. There are large municipal parking garages located nearby. Prices vary from one lot to the next. Is there accessible seating? This is an accessible venue. for general admission shows, please purchase a general admission ticket and the venue will make best accommodations at the time of arrival to the venue. The Fillmore Miami Beach is equipped with elevators and escalators as well as ramps on some levels of the venue. The Fillmore Miami Beach does not have wheelchairs available for patrons to use/borrow. The Fillmore Miami Beach does not have assisted hearing devices at this time. For inquiries into a sign interpreted show, please contact the venue at 305-673-7300 during regular business hours at least 3 weeks prior to any performance to inquire about sign interpreted availability. What are the general rules of The Fillmore Miami Beach at Jackie Gleason Theater? Customer Safety Live Nation and House of Blues Entertainment are committed to providing a safe and secure environment for our guests to enjoy their visit to our Theaters and Clubs. We encourage you to review our safety and security information below prior to arriving at the venue. -Please arrive early to the venue to allow enough time for you and your guests to move through the queue and enter the venue. - Prior to entering the venue, guests will be searched (patted down or mag wanded) to ensure that nothing on the restricted list of items enters the building. You may be asked to empty your pockets of all items so that they can be examined. - All alcohol and narcotic laws will be strictly enforced. - All bags will be searched, and no large bags or backpacks will be allowed. We reserve the right to refuse entry to anyone. If you see something that concerns you, please say something to our management or Security so we can ensure the best experience possible. Restricted Items: - Fans, artists, and employees are not permitted to bring firearms or weapons of any kind into the venue. - No guns, knives, pepper spray, or any other item that could be used to inflict harm. - Replicas of weapons also are NOT permitted. - No drugs or drug paraphernalia, illegal substances of any kind. - No Outside food or drinks - No video cameras, GoPros, selfie sticks, professional recording equipment - photo, video or audio (no detachable lenses, tripods, big zooms or commercial use rigs) On all EDM shows the following list of additional restricted items will be followed: - No eCigs, open packs of cigarettes. - No outside food or beverages of any kind (including alcohol, candy, gum, etc) unsealed tampons, eyedrops. - No massagers, laser pointers, LED Gloves, LED Microlights, glowsticks, pacifiers - No masks, large chains or spiked jewelry, open lip gloss or chapstick, candy bracelets, candy necklaces, Camelbacks, Bota bags, large purses/bags (anything over 10\"x10\"), fanny packs, backpacks, stuffed animals or dolls (including plush backpacks), no pets. - No glass, cans, cups, coolers, markers, pens, spray paint, stickers, fliers, balloons, balls, inflatable balls, frisbees, tents, large umbrellas, chairs, blankets Acceptable Items: - Small Bags & Purses (maximum 10\"x10\") - Non-Professional Flash/Still Cameras - Cell Phones - Hats - Lighters - Sealed packs of Cigarettes - Sealed/Wrapped Tampons - Earplugs - Sealed Chapstick and lip gloss - Sunglasses Zero Tolerance For Drug Use or Possession The use or possession of any illegal drugs will not be tolerated anywhere inside or outside the venue. Security personnel and narcotics officers will be working and enforcing all drug related laws. Do not bring any illegal substances to the event as violators will be prosecuted to the fullest extent of the law. If you are found inebriated at the door, security will not allow you to enter the venue. Event staff reserves the right to refuse entry to anyone. Please come with a smile and be prepared to enjoy a fun filled night of music and dancing. Safety and Medical Live Nation is dedicated to providing a safe environment. Public and private security will be present throughout the entire event. The Security Staff will be available to assist your needs including any medical requests. clear bag policy: To reduce staff contact with guest belongings, we have implemented the following bag policy: we will allow clear plastic, vinyl or PVC tote bags no larger than 12in x 6in x 12in and/or small clutch bags (4.5in x 6.5 in) Are children allowed? May I bring my children? Children of all ages are welcome (with an admission ticket) at family oriented concerts and performances. Appropriate adult supervision may be required. Non-family oriented concerts and performances may not suitable for young children, and venue management reserves the right to refuse admission for any reason, including concerns about safety. Children of any age may NOT attend a \"18+\" or \"21+\" concert or performance. Check the \"Please Note\" information located on each event page for any age restrictions. Seating chart Select the event to see the seating chart. Check availability above or on the event page. The Fillmore Miami Beach at Jackie Gleason Theater Sarah Millican Gad Elmaleh berlioz Se Regalan Dudas Lil Tecca Eden Ben Zaken The Mars Volta Sasha Colby Pluto Clara Ulrich Men I Trust Elena Rose J.I.D Juvenile David Byrne Manuel Medrano Mobb Deep NUTCRACKER! Magical Christmas Ballet Carmina Burana / Serenade Classical Arts Entertainment Verka Serduchka Sarah Millican This map doesn't reflect availability Discover More in Miami Beach Concerts Theater Sports Family Comedy Rock Pop Hip-Hop/Rap Country R&B Latin Baseball Related Links Official Website (Opens in new tab) Athletic Brewing (Opens in new tab) OLIPOP (Opens in new tab) Bacardi (Opens in new tab) Everything Legendary (Opens in new tab) Owen's Craft Mixers (Opens in new tab) Chateau Ste Michelle (Opens in new tab) White Claw (Opens in new tab) Skimmers (Opens in new tab) Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Our Policies Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://www.fillmore-miami.com/private-events",
      "text": "The Fillmore Miami Beach: Multi-Use Venue for Private Events in Miami Beach Skip to content Shows Visit Our Story Upgrades Private Events Private Events With a seamless blend of Miami Beach art deco and rock and roll ambiance, this classic 1950 theater is the perfect location to host your next corporate event, private concert, award ceremony, cocktail reception, product launch, fundraiser or business meeting. Its grand entrance, complete with a porte-cochere, an expansive front lawn and 12 custom poster boxes, are perfect for showcasing your brand. Located adjacent to the Miami Beach Convention Center, the Fillmore Miami Beach accommodates 25 to 2,713 guests. Our talented staff handles every detail, so you don't have to! Let’s plan your event First name * Last name * Email * Phone number * Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military / Government Religious Tour & Travel Other Event type Event date Company name Number of attendees Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other How did you hear about us? Promo code Get special events updates, highlights and exclusive offers from Live Nation Special Events. Submit This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Contact our Sales Team Phone : 305.938.2517 Email : fillmoremiamievents@livenation.com Address : 1700 Washington Ave, Miami Beach, FL 33139 One-Sheet Capacities Floorplans Virtual Tour More Details Event Spaces Lobby Party Music Hall Stardust Club View of Stage View From Stage Lobby Follow Us Be The First To Know About Live Music and Specials Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get in touch The Fillmore Miami Beach at Jackie Gleason Theater 1700 Washington Ave Miami Beach, FL 33139 305.938.2509 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.fillmore-miami.com/accessibility",
      "text": "The Fillmore Miami Accessibility Skip to content Shows Visit Our Story Upgrades Private Events Accessibility The Fillmore Miami Beach strives to make our venue and live experiences inclusive and accessible. For any questions or information not mentioned below, please don’t hesitate to contact us at 305-938-2509 or FMBBoxOffice@livenation.com . Our box office is open Tuesdays and Thursdays from 11 AM to 6 PM, and on show days, it opens two hours before doors and closes once the headliner takes the stage. Arrival & Accessible Entrances: We’re committed to making your experience at The Fillmore Miami Beach as smooth as possible. Our main entrance is fully accessible, and if you require any additional assistance, our team is here to help. Simply approach any team member at the main entrance, and they’ll be happy to assist you. Restrooms: All restrooms at the venue are accessible. Ticketing: Accessible seating tickets can be purchased online at livenation.com . There’s no need to contact the box office, as all accessible tickets are available on the website. To find tickets in The Fillmore’s Accessible Seating Area, select the Filters icon in the upper right corner of the ticket page. Then, scroll down to \"Show accessible tickets\" and toggle it on. While we aim to offer accessible seating at all price levels, please note that some sections may sell out quickly. To ensure you secure a spot, we recommend purchasing your accessible tickets as early as possible. Accessible Parking: The Fillmore does not operate its own parking; there is limited street parking available nearby. For easier access, we recommend the parking garage at 17th St & Convention Center Dr, just a block from the venue. This garage offers accessible parking with elevators, and we kindly ask that you follow the signs to the designated accessible spots. Please refer to posted signage for any payment instructions. If you prefer, you are welcome to drop off guests at our main entrance. Valet parking is also available for purchase either in advance or upon arrival. Medication Needs: For guests who require medication during the event, please bring it in its original container with a name that matches your photo ID. We ask that you bring only what is necessary for the event, as we are unable to store any medication on site. Over-the-counter medication must also remain in its original packaging. Unexpected Needs: If an injury or illness prevents you from using the seat you originally purchased, we recommend exchanging your tickets for accessible seating in advance through www.livenation.com . While we do our best to accommodate unexpected needs on the day of the show, accessible seating is limited, and we cannot guarantee availability. Please note that accessible seating is provided for the guest in need and one companion. Dietary Needs: We offer a variety of food options at The Fillmore Miami Beach. Should you have specific concerns or requests, please feel free to speak with a member of our Food & Beverage team during your visit. While we strive to meet all requests, we kindly ask for your understanding if we are unable to fulfill certain requirements. Service Animals: We welcome service animals at The Fillmore Miami Beach in accordance with the ADA. Service animals must be harnessed, leashed, or tethered unless this interferes with their work or the handler’s disability prevents it. In such cases, the handler must maintain control of the animal through voice, signal, or other means. Service animals are defined by the ADA as dogs or miniature horses trained to perform tasks directly related to a person’s disability. Please ensure that your service animal is housebroken and behaves appropriately during the event. If your service animal behaves in a disruptive manner, we kindly ask that corrective action be taken. Please note that comfort animals, emotional support animals, and therapy dogs do not qualify as service animals under the ADA. Service animals must remain on the floor and are not allowed on chairs or tables in dining areas. Our staff is not responsible for the care or supervision of service animals. We reserve the right to deny entry to any animal that disrupts venue operations. Sign Language Interpretation: We are pleased to offer sign language interpretation upon request. To ensure we can meet your needs, please submit your request at least two weeks before the event. When you arrive, your tickets can be collected at will call, where we will introduce you to your interpreter and guide you to your seats. Please contact us at 305-938-2509 or FMBBoxOffice@livenation.com to make arrangements. Interpreter availability is subject to confirmation. Assistive Listening Devices: We want to ensure every guest has a great listening experience. We currently offer the Listen Everywhere assistive listening app. How to Use the Listen Everywhere App: 1. Connect to the Venue’s Wireless Network – Scan the QR code below while onsite, this is required for the app to function properly. 2. Download the Listen Everywhere App – You can download the app via the App Store or Google Play. 3. Select Your Audio Channel – Once you’re connected, simply open the app, select the correct audio channel, and enjoy the show with enhanced audio! For overall assistance or help with setting up and using the app, please visit the Box Office upon arrival or contact us in advance at 305-938-2509 or via email at FMBBoxOffice@livenation.com Mobility Device Storage: While we are unable to provide storage for wheelchairs, canes, walkers, or other mobility devices, we encourage you to contact us prior to your visit for further information and assistance. Follow Us Be The First To Know About Live Music and Specials Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get in touch The Fillmore Miami Beach at Jackie Gleason Theater 1700 Washington Ave Miami Beach, FL 33139 305.938.2509 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.780fillmore.org/about-us/board-and-staff/",
      "text": "Broadway Fillmore NHS Board and Staff 0 Shopping Cart Services All Services Rental Opportunities Home Repair Program Development Assistance Vacant Rental Improvement Program Commercial District Program About Us About BFNHS Broadway-Fillmore Historic District Map Board and Staff Latest News Contact Contact Us Become a Contractor Search Menu Menu Meet Our Team Our Staff Stephen Karnath Executive Director 716-852-3130 ext 6 Lynnette Gospodarski Chief Operating Officer 716-852-3130 ext 1 Construction Analyst 716-852-3130 ext 2 Anne Perry Office Manager 716-852-3130 ext 0 Ralph Overton Property Maintenance Manager 716-852-3130 ext 5 Brandi Barrett Senior Program Officer 716-852-3130 ext 4 CONTACT US Board of Directors Bradley J. Dossinger President James L. Rykowski Treasurer Jonathon Ling Secretary Roxanne M. Chase Paul V. Harris Lisa M. Akers Anthony O. James Atiqur Rahman Leah Angel Daniel Stephanie Mejia Broadway Fillmore NHS Inc. 780 Fillmore Avenue Buffalo, NY 14212 CONTACT US 716.852.3130 info@780fillmore.org QUICK LINKS Rental Opportunities Home Repair Program Commercial District Program Vacant Rental Improvement Program Development Assistance About Us Latest News Contact Website sponsored by generous support from the M&T Foundation Copyright ©2024 Broadway Fillmore NHS Inc. All rights reserved. Site design by OtherWisz Creative Scroll to top"
    },
    {
      "url": "https://specialevents.livenation.com/venues/the-fillmore-miami-beach",
      "text": "The Fillmore Miami Beach | Live Nation Special Events Javascript must be enabled for the correct page display Skip to Content menu home venues events services about press blog Privacy Policy Terms & Conditions search search opener Submit LiveNation special events p l a n y o u r e v e n t p l a n y o u r e v e n t Work (310) 360-3077 Fax (310) 360-3077 Contact Us national sales icon mail Book this Venue background image Book this Venue background image Book this Venue background image Menu Details Gallery Spaces Exclusives Services FAQs Contact The Fillmore Miami Beach Legendary Venue, Epic Events! With a seamless blend of Miami Beach art deco and rock and roll ambiance, this classic 1950 theater is the perfect location to host your next corporate event, private concert, award ceremony, cocktail reception, product launch, fundraiser or business meeting. Its grand entrance, complete with a porte-cochere, an expansive front lawn and 12 custom poster boxes, are perfect for showcasing your brand. Located adjacent to the Miami Beach Convention Center, the Fillmore Miami Beach accommodates 25 to 2,713 guests. Our talented staff handles every detail, so you don’t have to! view floor plan view venue one sheet Venue Space Overview Lobbies Stardust Club Main Hall Venue Space Overview Previous Next Venue Space Overview With access to the world’s greatest musical entertainment, full-service event production, state-of-the-art lighting and sound, custom menus and mixology, our 41,000 square-foot venue will exceed expectations of even the most discerning guest. The historic art deco space features an elegant Main Hall, three lobbies and two smaller club rooms, all offering versatile design space for soirées of every description. View Venue Capacities Lobbies Previous Next Lobbies Three lobbies feature 13 bars, TV screens and 12 poster frames to showcase your brand. Boasting more than 10,000 square feet of pre-function space on three different levels, these sophisticated gathering spaces serve as the primary access point to our Main Hall, where guests can enjoy cocktail receptions, activations or networking events pre or post-event. View Venue Capacities Stardust Club Previous Next Stardust Club With its private patio entrance, flexible furniture configurations and full stage, this intimate space provides guests with the ultimate VIP experience. Often the beginning and end of every great night, Stardust Club can accommodate up to 100 guests for receptions and 60 for a seated event. View Venue Capacities Main Hall Previous Next Main Hall Modeled after The Fillmore in San Francisco, this spectacular space features a state-of-the-art sound and lighting system, portable bars and grand chandeliers that are sure to wow every guest. The Music Hall is a great space for receptions, seated lectures, cocktail parties, awards shows and events of all occasions. View Venue Capacities × venue capacities location reception banquet theater Entire Indoor Venue 2713 680 2462 Stardust Club 125 60 60 Stage 500 250 300 Orchestra Pit 700 400 516 Lower & Upper Lobby 800 150 50 Third Level Lobby 200 80 50 event types url corporate events Make your corporate event the talk of the town. Host an exclusive roundtable meeting or company reception in a unique setting that offers custom culinary experiences and mixology with unparalleled event services. Learn More Learn More url Company Picnics Bring your team together at one of our outdoor event venues and spacious amphitheaters. Elevate your company events, company picnics, employee gatherings or daytime meetings to the next level with an outdoor setting. Learn More Learn More url FILMING & PHOTOSHOOTS Make your vision a reality! Plan your next photoshoot with Live Nation Special Events. Our versatile venues and photoshoot locations curate a unique setting. Our venues offer sound and lighting to enhance your next filming location. Learn More Learn More url private concerts Amplify your event experience at our venue with a private concert featuring world-renowned artists, full-service event production and state-of-the-art lighting and sound. Learn More Learn More url FUNDRAISERS & GALAS Live Nation Special Events is ready to amplify your next fundraiser, gala, charity concert or non-profit event at our private event venues. Our experienced event team can assist with producing large-scale fundraisers allowing you to focus on your cause. Learn More Learn More url Social Gatherings Celebrate your social events in style! Whether you are gathering guests for a stylish dinner or hosting a celebratory function – our talented staff is here to handle every detail from custom menus, hand-crafted cocktails, décor, themes and entertainment that fits any occasion. Learn More Learn More url Convention Receptions Whether you're planning a welcome party, closing reception, VIP luncheon or conference after-party, our reception halls, conference spaces, and our full-service event production will elevate your guests’ experience. Learn More Learn More url Holiday Parties Rock out during the holidays with Live Nation Special Events! From lively company parties to festive private gatherings and themed events, let us create holiday memories that last a lifetime. Host the most iconic party of the season at the best locations and event venues. Learn More Learn More url UNIQUE WEDDINGS Celebrate your love story with us! Our one-of-a-kind event spaces offer a memorable backdrop from custom floral centerpieces and gorgeous accents to the post-wedding champagne brunch with decadent sweets. Let our wedding specialists make your special occasion one to remember. Learn More Learn More world-renowned artist packages From headlining artists to local talent and keynote speakers, Live Nation Special Events provides unlimited access to entertainment and our in-house team can assist you with producing large-scale events, including booking local bands, DJs headlining artists, or keynote speakers. learn more amenities Food & Beverage Custom Menus & Offerings Craft Beer Bars & Mixology Traditional & Unique Presentations Exclusive Culinary Partners Entertainment & Production Personalized Event Planning Full-Service Event Production Unlimited Entertainment Access State-of-the-Art Lighting & Sound Event Enhancements Experiential Branding Video Mapping Interactive Entertainment Creative & Customized Décor EVENT GALLERY Check out some of our most memorable events! view galleries Red Bull 12.10.15 photo by Ian Witlen Bar Mitzvah 1.27.14 Miami Heat 2.10.18 Kit Kat Divas Show 10.29.14 Mendelson Bar Mitzvah 01.19.19 Jimmie Jam 11.16.12 Miami Heat Gala 2019 02.24.19 NBC Universal 12.12.12 Premios Tumundo Wedding 1.2013 Televisa Dinner 1.22.15 NBC Universal 12.12.12 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Bar Mitzvah 1.27.14 Aspect 3.03.15 Televisa Dinner 1.22.15 Craft Beer Tasting 1.30.15 Splashion - July 14 2015 7.14.15 Splashion - July 16 2015 7.16.15 Miami Heat 2.10.18 Open House 9.30.15 Bar Mitzvah 1.27.14 Battioke 2014 5.20.14 NBC Universal 12.12.12 Miami Heat Gala 2019 02.24.19 Mendelson Bar Mitzvah 01.19.19 Battioke 2014 5.20.14 Burger King 2013 Battioke 2014 5.20.14 Splashion - July 14 2015 7.14.15 Miami Heat 2.10.18 Battioke 2015 3.03.15 Open House 9.30.15 Coldwell Banker 10.19.16 Miami Heat 2.10.18 NBC Universal 12.12.12 NBC Universal 12.12.12 Televisa Dinner 1.22.15 Jodar Bar Mitzvah 11.16.12 Little Dreams Foundation Gala 12.06.14 Little Dreams Foundation Gala 12.06.14 Splashion - July 14 2015 7.14.15 Justin Timberlake Premios Tumundo Jodar Bar Mitzvah 11.16.12 Miami Heat 2.10.18 Premios Tumundo Splashion - July 14 2015 7.14.15 Battioke 2014 5.20.14 Burger King 2013 Burger King 2013 Televisa Dinner 1.22.15 Aspect 3.03.15 Little Dreams Foundation Gala 12.06.14 Burger King 2013 Nascar Event 11.13.14 Splashion - July 14 2015 7.14.15 Jimmie Jam 11.16.12 Open House 9.30.15 Battioke 2014 5.20.14 Justin Timberlake Bar Mitzvah 1.27.14 Jimmie Jam 11.16.12 Miami Heat 2.10.18 Premios Tumundo Televisa Dinner 1.22.15 Wedding 1.2013 Digital Bond S4X18 1.8.18 Miami Heat 2.10.18 Hispanic Flamenco Day 2.04.15 NBC Universal 12.12.12 Splashion - July 14 2015 7.14.15 Justin Timberlake Bar Mitzvah 1.27.14 Bar Mitzvah 1.27.14 Splashion - July 14 2015 7.14.15 Bar Mitzvah 1.27.14 Open House 9.30.15 Bar Mitzvah 1.27.14 Bar Mitzvah 1.27.14 Kit Kat Divas Show 10.29.14 NBC Universal 12.12.12 Wedding 1.2013 Red Bull 12.10.15 photo by Ian Witlen Nascar Event 11.13.14 Nascar Event 11.13.14 Jimmie Jam 11.16.12 Televisa Dinner 1.22.15 Premios Tumundo Battioke 2015 3.03.15 Battioke 2015 3.03.15 Red Bull 12.10.15 photo by Ian Witlen Miami Heat 2.10.18 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Televisa Dinner 1.22.15 Open House 9.30.15 Battioke 2014 5.20.14 Burger King 2013 Wedding 1.2013 Splashion - July 14 2015 7.14.15 Televisa Dinner 1.22.15 Jodar Bar Mitzvah 11.16.12 Televisa Dinner 1.22.15 NBC Universal 12.12.12 Splashion - July 14 2015 7.14.15 Televisa Dinner 1.22.15 Splashion - July 14 2015 7.14.15 Aspect 3.03.15 Battioke 2015 3.03.15 Digital Bond S4X18 1.8.18 Battioke 2014 5.20.14 Miami Heat 2.10.18 Splashion - July 14 2015 7.14.15 Wedding 1.2013 Little Dreams Foundation Gala 12.06.14 Burger King 2013 Splashion - July 14 2015 7.14.15 Splashion - July 16 2015 7.16.15 Televisa Dinner 1.22.15 Burger King 2013 Miami Heat 2.10.18 Digital Bond S4X18 1.8.18 Splashion - July 14 2015 7.14.15 Hispanic Flamenco Day 2.04.15 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Aspect 3.03.15 Wedding 1.2013 Televisa Dinner 1.22.15 Red Bull 12.10.15 photo by Ian Witlen Premios Tumundo Little Dreams Foundation Gala 12.06.14 Burger King 2013 Miami Heat 2.10.18 Miami Heat 2.10.18 Wedding 1.2013 Splashion - July 16 2015 7.16.15 NBC Universal 12.12.12 Miami Heat Gala 2019 02.24.19 Red Bull 12.10.15 photo by Ian Witlen NBC Universal 12.12.12 Proposal 6.20.16 Splashion - July 14 2015 7.14.15 Splashion - July 14 2015 7.14.15 Jodar Bar Mitzvah 11.16.12 Jimmie Jam 11.16.12 NBC Universal 12.12.12 Televisa Dinner 1.22.15 Little Dreams Foundation Gala 12.06.14 Battioke 2014 5.20.14 Jimmie Jam 11.16.12 Hispanic Flamenco Day 2.04.15 Battioke 2014 5.20.14 Miami Heat 2.10.18 Bar Mitzvah 1.27.14 Hispanic Flamenco Day 2.04.15 Battioke 2014 5.20.14 Craft Beer Tasting 1.30.15 Battioke 2015 3.03.15 Miami Heat Gala 2019 02.24.19 Red Bull 12.10.15 photo by Ian Witlen Digital Bond S4X18 1.8.18 Hispanic Flamenco Day 2.04.15 NBC Universal 12.12.12 Kit Kat Divas Show 10.29.14 Splashion - July 14 2015 7.14.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Jimmie Jam 11.16.12 Burger King 2013 Kit Kat Divas Show 10.29.14 Miami Heat Gala 2019 02.24.19 Open House 9.30.15 Jodar Bar Mitzvah 11.16.12 Red Bull 12.10.15 photo by Ian Witlen Digital Bond S4X18 1.8.18 Mendelson Bar Mitzvah 01.19.19 Premios Tumundo Little Dreams Foundation Gala 12.06.14 NBC Universal 12.12.12 NBC Universal 12.12.12 Jodar Bar Mitzvah 11.16.12 Miami Heat 2.10.18 Bar Mitzvah 1.27.14 Battioke 2015 3.03.15 Open House 9.30.15 Digital Bond S4X18 1.8.18 Battioke 2014 5.20.14 Battioke 2015 3.03.15 Miami Heat 2.10.18 Splashion - July 14 2015 7.14.15 Open House 9.30.15 Open House 9.30.15 NBC Universal 12.12.12 Hispanic Flamenco Day 2.04.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Wedding 1.2013 Burger King 2013 Battioke 2015 3.03.15 Little Dreams Foundation Gala 12.06.14 Televisa Dinner 1.22.15 Premios Tumundo Miami Heat 2.10.18 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Premios Tumundo Premios Tumundo Jodar Bar Mitzvah 11.16.12 Splashion - July 14 2015 7.14.15 Bar Mitzvah 1.27.14 Nascar Event 11.13.14 Nascar Event 11.13.14 Kit Kat Divas Show 10.29.14 Wedding 1.2013 Hispanic Flamenco Day 2.04.15 Jimmie Jam 11.16.12 Aspect 3.03.15 Aspect 3.03.15 Open House 9.30.15 Aspect 3.03.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Open House 9.30.15 Splashion - July 14 2015 7.14.15 Justin Timberlake Open House 9.30.15 Wedding 1.2013 Televisa Dinner 1.22.15 Aspect 3.03.15 Bar Mitzvah 1.27.14 NBC Universal 12.12.12 Battioke 2015 3.03.15 Bar Mitzvah 1.27.14 Aspect 3.03.15 Miami Heat 2.10.18 NBC Universal 12.12.12 Nascar Event 11.13.14 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Televisa Dinner 1.22.15 Little Dreams Foundation Gala 12.06.14 Televisa Dinner 1.22.15 Hispanic Flamenco Day 2.04.15 Premios Tumundo Mendelson Bar Mitzvah 01.19.19 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Little Dreams Foundation Gala 12.06.14 Televisa Dinner 1.22.15 Miami Heat 2.10.18 Open House 9.30.15 Hispanic Flamenco Day 2.04.15 Battioke 2014 5.20.14 Jodar Bar Mitzvah 11.16.12 Justin Timberlake Kit Kat Divas Show 10.29.14 Open House 9.30.15 Bar Mitzvah 1.27.14 Miami Heat 2.10.18 Craft Beer Tasting 1.30.15 Battioke 2014 5.20.14 Battioke 2015 3.03.15 Televisa Dinner 1.22.15 NBC Universal 12.12.12 Splashion - July 14 2015 7.14.15 Miami Heat 2.10.18 Miami Heat 2.10.18 Bar Mitzvah 1.27.14 Battioke 2014 5.20.14 Craft Beer Tasting 1.30.15 Miami Heat 2.10.18 close Aspect Bar Mitzvah Battioke 2014 Battioke 2015 Burger King Coldwell Banker Craft Beer Tasting Hispanic Flamenco Day Jimmie Jam Jodar Bar Mitzvah Justin Timberlake Kit Kat Divas Show Little Dreams Foundation Gala Nascar Event NBC Universal Open House Premios Tumundo Proposal Red Bull Splashion - July 14 2015 Splashion - July 16 2015 Televisa Dinner Wedding Digital Bond S4X18 Miami Heat Mendelson Bar Mitzvah Miami Heat Gala 2019 close Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Battioke 2014 1.27.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Aspect 5.20.14 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Battioke 2015 3.03.15 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Burger King 2013 Coldwell Banker 10.19.16 Craft Beer Tasting 1.30.15 Craft Beer Tasting 1.30.15 Craft Beer Tasting 1.30.15 Craft Beer Tasting 1.30.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Hispanic Flamenco Day 2.04.15 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jimmie Jam 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Jodar Bar Mitzvah 11.16.12 Justin Timberlake Justin Timberlake Justin Timberlake Justin Timberlake Justin Timberlake Kit Kat Divas Show 10.29.14 Kit Kat Divas Show 10.29.14 Kit Kat Divas Show 10.29.14 Kit Kat Divas Show 10.29.14 Kit Kat Divas Show 10.29.14 Kit Kat Divas Show 10.29.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 LittleDreamsFoundationGala 12.06.14 Nascar Event 11.13.14 Nascar Event 11.13.14 Nascar Event 11.13.14 Nascar Event 11.13.14 Nascar Event 11.13.14 Nascar Event 11.13.14 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 NBC Universal 12.12.12 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Open House 9.30.15 Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Premios Tumundo Proposal 6.20.16 Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Red Bull 12.10.15 photo by Ian Witlen Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion 7.14.15 Splashion - July 16 2015 7.16.15 Splashion - July 16 2015 7.16.15 Splashion - July 16 2015 7.16.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Televisa Dinner 1.22.15 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Wedding 1.2013 Digital Bond S4X18 1.8.18 Digital Bond S4X18 1.8.18 Digital Bond S4X18 1.8.18 Digital Bond S4X18 1.8.18 Digital Bond S4X18 1.8.18 Digital Bond S4X18 1.8.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Miami Heat 2.10.18 Mendelson Bar Mitzvah 01.19.19 Mendelson Bar Mitzvah 01.19.19 Mendelson Bar Mitzvah 01.19.19 Mendelson Bar Mitzvah 01.19.19 Miami Heat Gala 2019 02.24.19 Miami Heat Gala 2019 02.24.19 Miami Heat Gala 2019 02.24.19 Miami Heat Gala 2019 02.24.19 Miami Heat Gala 2019 02.24.19 Previous Next current slide number / total slides count prev prev exclusive offers url making corporate cool Get down to business at one of our legendary venues! Host your next meeting or event with us and receive a complimentary coffee station. Learn More Learn More url make your vision a reality Take your event to the next level! Host your event and receive up to $500 in credit for event enhancements. Learn More Learn More url rock your wedding Celebrate your love story with us! Book your ceremony or reception with us and receive a complimentary confetti cannon blast. Learn More Learn More join our newsletter I'd like to receive special events updates from The Fillmore Miami Beach. Plus, get highlights and exclusive offers from Live Nation Special Events. sign up FAQs What event spaces are available to rent for meetings or private events? The Fillmore Miami Beach offers a variety of event spaces that can accommodate different capacities for your next meeting or private event. This allows you to choose the space that best fits your event's size and needs from Lobbies, Stardust Club, and Main Hall. What event services can I expect, including catering and vendor partnerships? We offer exceptional full-service event planning services with an experienced in-house team and established partnerships with premier vendors. Our event planning team will handle every detail including world-renowned artists packages, décor, custom branding, state-of-the-art lighting, A/V equipment and sound. Let our culinary experts create an unparalleled dining experience with custom catering menus and bar packages. Contact us today to learn more about our services and how we can make your event a one-of-a-kind experience. Can the venue team book entertainment, bands, DJs, and keynote speakers for my event? Yes, The Fillmore Miami Beach's in-house venue team has relationships with a variety of artists and DJs that they can recommend for your unique event. Live Nation is the largest entertainment company in the world, which gives us access to an extensive network of world-renowned artists and keynote speakers. What parking options are provided by the venue? The Fillmore Miami Beach's event team can provide parking and valet options for your meeting or private event when applicable. We recommend contacting us directly for more information on parking and availability. Our team is happy to assist you with any questions regarding parking arrangements. Is this venue accessible to those with disability needs? The Fillmore Miami Beach prioritizes accessibility and strives to make our venue accessible to everyone. If you have specific accessibility needs, inform our event specialists in advance with your requirements and the date assistance will be needed. On the day of the event, our staff will be ready to support you. Contact us today to learn more about our accessibility options and how we can ensure your experience is inclusive and enjoyable. What is the event scheduling process, and how early should I start planning? Don't miss out on securing your preferred dates, contact us today to start planning! Whether you need to plan a corporate event, daytime meeting, filming, photoshoot, fundraiser, and private concert, our event specialists are here to assist you. While we can accommodate quick turnarounds, it's always best to book as soon as possible to ensure your desired date is available. Our team will help schedule a site tour and provide a comprehensive overview of our venue's floor plans, amenities, event venue specs, and address any inquiries you may have. As the leading provider of live entertainment, we are committed to efficiently working with you to create a successful event. Contact The Fillmore Miami Beach at the Jackie Gleason Theater 1700 Washington Avenue Miami Beach, FL 33139 fillmoremb.com/ work 305.938.2517 @FillmoreMiami @FillmoreMB @fillmoremb Explore Nearby Venues special event inquiries National Sales LiveNation special events SpecialEvents@livenation.com work 310.360.3077 facebook instagram linkedin copyright © 2025 live nation all rights reserved read our privacy policy or terms & conditions Do Not Sell or Share My Personal Information venues by close prev step personal details event details next step let's gather some info. Please fill out the form below to get started. First Name Last Name Your email Your number Get special events updates, highlights and exclusive offers from Live Nation Special Events. Please fill out the required fields. continue By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy and a bit more information. We will be in touch shortly. First Name Last Name Your number Your email Event Type Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military/Government Religious Tour & Travel Other How did you hear about us? Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other + Please fill out the required fields. Please complete the Captcha to proceed. submit or go back Select venue(s) from below Select a State Select a State Multi-Venue Arizona California Colorado Connecticut D.C. Delaware Florida Georgia Illinois Indiana Kentucky Louisiana Massachusetts Maryland Michigan Minnesota North Carolina Nevada New York Ohio Pennsylvania South Carolina Texas Wisconsin Utah Vancouver, BC venues input Please select at least one venue to proceed. submit or go back Thank you. Not to brag but... press & clients Back to top close By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy"
    },
    {
      "url": "https://www.fillmore-miami.com/visit",
      "text": "Plan Your Visit: Parking, Amenities & Policies | The Fillmore Miami Beach Skip to content Shows Visit Our Story Upgrades Private Events Plan Your Visit Get Here 1700 Washington Ave, Miami Beach, FL 33139. Located adjacent to the Miami Beach Convention Center. There is limited street parking in the area that is within walking distance to the theater. In addition, there is a large municipal parking garage nearby (at the corner of 17th Street and Convention Center Drive - 1 block from the theater). Directions Day of Show Coming to a show? Here's a few things to know before you go! Learn More Stardust Lounge Get access to the Stardust Lounge! Includes early entry, exclusive bar, private restrooms, a separate entrance, appetizers and one (1) beverage. VIEW UPGRADES FAQ Accessibility Services The Fillmore Miami Beach strives to make our venue and live experiences inclusive and accessible. For any questions or information not mentioned below, please don’t hesitate to contact us at 305-938-2509 or FMBBoxOffice@livenation.com . Our box office is open Tuesdays and Thursdays from 11 AM to 6 PM, and on show days, it opens two hours before doors and closes once the headliner takes the stage. To learn more about our accessibility services, please click here . I have a GA Ticket. What does that mean? GA Tickets stand for General Admission. This means there are no assigned seats. These areas are on a first come, first served basis. These areas include both standing and seated areas. Once the General Admission standing areas (Pit) have reached capacity, guests will be directed to seated areas in the orchestra. The Fillmore suggests early arrival for all general admission shows for best opportunity to have a spot in standing areas (Pit). COME EARLY! Depending on the show Early Entry (Fast Lane) may be available. Can I bring a camera to the show? Photography is not permitted at the majority of shows at the Fillmore Miami Beach at the Jackie Gleason Theater. Some bands permit non-professional point and shoot cameras, provided that they are used without a flash. Professional photography equipment (with detachable or zoom lenses) is never permitted without an appropriate media or photo pass. Can I buy tickets to upcoming shows at the Fillmore Miami Beach box office? Yes! The Fillmore Miami Beach Box Office Hours: Tuesdays and Thursdays from 11AM-6PM. On Show Days, we open 2 hours prior to door time and closes when the headliner takes the stage. All tickets sold at the box office have a $5 service charge per ticket. Tickets obtained from unauthorized sources may be invalid, refunded, lost, stolen or counterfeit, and if so are void. Is free water available at The Fillmore Miami Beach? Yes! Free water is available at every show. You’ll find large water jug stations with cups throughout the first floor, as well as water fountains located around the venue for your convenience. Can I purchase alcohol at The Fillmore Miami Beach? Yes, we have many full service bars located inside the facility. Patrons of legal drinking age are welcome purchase alcoholic beverages after showing a photo ID for age verification. Can I smoke inside the Fillmore Miami Beach Theater? This is a smoke free facility. An outdoor smoking section is available during most shows. Vaping is not allowed indoors. Do you offer valet parking? Yes, valet parking is offered for every show at the Fillmore Miami Beach at a cost of $35. This is available for purchase online at Ticketmaster.com prior to the show. Due to these pre sales, drive up valet is subject to availability. We suggest pre-purchasing this to ensure a valet spot for your vehicle. How can I get a job at The Fillmore Miami Beach at the Jackie Gleason Theater? Visit the Live Nation Careers website and search for jobs in Miami. How can I rent the Fillmore Miami Beach for a private event? For private bookings or corporate events, please email The Fillmore Miami Beach Sales Team or call (305) 938-2505. I am a diabetic can I bring in a snack? Yes, guests who have a small amount of UN-OPENED snacks such as a snack size pack of cookies, etc. are allowed to bring this item in. I am hearing impaired, can I schedule an interpreter to be on site? We can provide interpreters for the hearing impaired at no charge. However, we need to be contacted in advance. Please contact out box office to schedule one. I have a GA Ticket. What does that mean? GA Tickets stand for General Admission. This means there are no assigned seats. These areas are on a first come, first served basis. These areas include both standing and seated areas. Once the General Admission standing areas (Pit) have reached capacity, guests will be directed to seated areas in the orchestra. The Fillmore suggests early arrival for all general admission shows for best opportunity to have a spot in standing areas (Pit). COME EARLY! Depending on the show Early Entry (Fast Lane) may be available! If I leave the building during a show, can I return? No. Once inside the building there is no exit and re-entry. What are your box office hours? Normal Business Hours: Tuesdays, Wednesdays, and Thursdays from 11AM-6PM. On Show Days: 2 hours prior to door time and closes when the headliner takes the stage. What items are not allowed inside the Fillmore Miami Beach Theater? The following items are prohibited for all shows: any bags that are outside of our Clear Bag Policy, weapons, alcohol, drugs, selfie sticks, lawn chairs, laser pointers, skates, animals, wallet chains, spiked jewelry/belts, banners, backpacks, flyers, beach balls, Frisbees, fireworks, sparklers, video equipment laptops and tablets. Any item deemed dangerous by the venue General Manager or Law Officer. Recording equipment is prohibited at most shows, at the performer's discretion. What methods of payment are accepted for purchasing tickets at the box office? The Box Office at the Fillmore Miami Beach at the Jackie Gleason Theater accepts the following forms of payment: Visa, MasterCard, American Express and Discover. Cash is currently not being accepted. A photo ID is required for all credit card payments. Where is the lost and found? Items recovered from shows are collected at the administrative office at The Fillmore Miami Beach at the Jackie Gleason Theater. If you notice you are missing an item during a show, please check with our ushers for assistance. To check on the status of a lost item, please contact our box office. Where should I park at the Fillmore Miami Beach Theater? There is limited street parking in the downtown area that are within walking distance to the theater. In addition, there is a large municipal parking garage nearby (at the corner of 17th Street and Convention Center Drive - 1 block from the theater). For most shows, cash only valet parking is available at our front drive for $35.00 per car, plus gratuity. Follow Us Be The First To Know About Live Music and Specials Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Get in touch The Fillmore Miami Beach at Jackie Gleason Theater 1700 Washington Ave Miami Beach, FL 33139 305.938.2509 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    }
  ]
}