{
  "fuentes": [
    {
      "url": "https://finsswimming.com/contact-us/",
      "email": "kevin@thundergunprinthouse.com"
    },
    {
      "url": "https://www.news-press.com/story/life/food/jean-le-boeuf/2017/04/13/fins-seafood-dive-bar-cape-coral-fl-restaurant-review-menu-hours-patio-tiki-outdoor-seating-tropical-drinks-cocktails-jlb-crab-cake/100366688/",
      "email": "jleboeuf@news-press.com"
    }
  ],
  "mails": [
    "jleboeuf@news-press.com",
    "kevin@thundergunprinthouse.com"
  ],
  "nombre_sitio": "finsdivebar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finsswimming.com/contact-us/",
      "text": "Contact Us - FINS Swimming Skip to content FINS Weather Updates Current Families Employment Private Lessons Log In Register Primary Menu Groups Tiny Turtles 3-6 Little FINS 4-7 Seahorses 5-8 Marlins 7-10 Swordfish 11-15 Sharks 10-14 Dolphins 13-18 FINS Training Group 9-18 (FTG) Coaches FINS Programs Programs Overview 2025-26 – Georgetown Prep Indoor Season Fall 2025 Adult Programming Schedule GP Indoor Practice Times 2025-’26 Georgetown Prep Indoor Calendar 25-26 Friday Schedule 25-26 Saturday Schedule 25-26 Sunday Day Schedule 25-26 Sunday Evening Schedule 25-26 Private Lessons Contact Us Locations Employment About About FINS Coaches FAQ’s Videos Contact Us Locations Rockville Locations Bethesda Locations Search for: Contact Us Contact Us We would love to hear from you! If you have any questions at all please let us know in the form below. Please enable JavaScript in your browser to complete this form. Parent Name * Parent Email * Swimmer Name Message * Name Submit Helpful Links Contact Us Register Current Families Coaches Portal Readers' Pick, Finalist, Best Kids Swim Lessons Rockville Locations Old Farm Pool 1 Swim Club Way Rockville MD, 20852 Fallsgrove 400 Casey Ln Rockville, MD 20850 Bethesda Locations Georgetown Prep School 10900 Rockville Pike North Bethesda, MD 20852 Seven Locks Swim Club 9929 Seven Locks Rd Bethesda, MD 20817 Wildwood Manor Pool 10235 Hatherleigh Drive Bethesda, MD 20814 FINS Swimming - Copyright All right reserved | Designed by THUNDERGUN"
    },
    {
      "url": "https://www.news-press.com/story/life/food/jean-le-boeuf/2017/04/13/fins-seafood-dive-bar-cape-coral-fl-restaurant-review-menu-hours-patio-tiki-outdoor-seating-tropical-drinks-cocktails-jlb-crab-cake/100366688/",
      "text": "FINS Seafood & Dive Bar, Cape Coral: JLB restaurant review News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals JEAN LE BOEUF FINS Seafood & Dive Bar, Cape Coral: JLB review At FINS Seafood & Dive Bar in Cape Coral, a massively meaty crab cake helps make up for this all-over-the-place menu. JEAN LE BOEUF JLEBOEUF@NEWS-PRESS.COM The crab cake came at just the right time. It was, let’s just say, a slow start for my party at the 2-months-old FINS Seafood & Dive Bar in Cape Coral. The appetizers — a dry take on ahi-tuna nachos, and a lackluster, slightly mushy bowl of peel-and-eat shrimp — had sent our table into an awkward silence. A slurp of sangria here. An adjusting of plates there. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. A clear-your-throat cough to fill the dead air. I hate to say I’d written the place off after just those two dishes. But I wasn’t optimistic. And then the clouds parted and the angels sang and — crab cake. I didn’t even recognize it as a crab cake at first, more as a mound of jumbo-lump crab held together by the faintest hint of — is that remoulade? — and some inexplicable magic. It was just one “cake,” but it was at least ⅓-pound of crab, the meaty kind plucked carefully from under the shell. I ogled it, photographed it (as good 21st century food critics do), then dove in thinking I may never resurface. It’s dishes such as this one that make me wonder about FINS. The restaurant opened in early February in the former Carmine Street NY Pizza & Mussels building on Del Prado Boulevard a few blocks south of Cornwallis Parkway. The formerly dark and low-ceilinged space has been brightened and opened and thoroughly beach-ified, in a kitschy (there’s a scuba diving mannequin), tiki-hut (there’s one of those, too) sort of way. Cape eats: On Del Prado, a dining renaissance The chef is formerly of Ford’s Garage. The owners are from Maryland — hence said crab cake, and, another day, my thick burger charred to medium perfection on a lightly toasted brioche bun (I thought it tasted familiar). But, as we’ve learned here, such perfection can be fleeting. For every great burger I had there was a sad flatbread, its crust doughy and not-quite crisp.  Or a beige plate of seafood enchiladas that looked like some kind of Red Lobster-Taco Bell mashup (but that tasted far better than it looked, to be fair). Many of FINS’ dishes just don’t make sense: the cheesesteak, the turkey Reuben, the Bucket (yes, Bucket) of Ribs. Your hope fades again, but is renewed by a bracing ceviche brimming with seafood in a limey, pale yellow marinade. And by a crisp side of pineapple-flecked slaw that flickers with jalapenos, and an old-school smoked fish dip that’s served in that velvety, easy-to-spread style I love. JLB Picks: 5 SWFL places serious about seafood FINS knows its way around a cocktail, as well. The bar, which can get a little too umbrella-froufrou for me at times, crafts a mean Bloody Mary, and an even meaner Matlacha Mule made with grapefruit vodka, ginger beer and mango puree. The waitress guided my friend to a refreshing pineapple cider one lunch, then to a citrusy IPA from the lengthy list of craft drafts. I found FINS’ service to be far more even than its food; knowledgeable and quick, friendly but not smothering. And while not every plate was a knockout, the seafood basket toppling with fried grouper, shrimp, oysters, and crisp, hand-cut fries (a flat out bargain at $16.95) gave that crab cake a run for its cloud-parting money. As did the flaky, forearm-length fillet of Atlantic cod in the fish and chips. On my most recent visit to FINS, the server mentioned they were making changes to the menu, “streamlining,” I think was the word she used. She also said the crab cakes, currently only available at dinner, would soon be offered all day long. Music to my ears. SUBSCRIBE : Jean Le Boeuf's weekly newsletter Jean Le Boeuf is the pseudonym used by a local food lover who dines at restaurants anonymously and without warning, with meals paid for by The News-Press. Follow the critic at facebook.com/jeanleboeufswfl or @JeanLeBoeuf on Twitter and Instagram FINS Seafood & Dive Bar 3422 Del Prado Blvd., Cape Coral • Food: ★★½ ☆ • Atmosphere: ★★★ ☆ • Service: ★★★☆ • Price: $$-$$$ • Call: 984-5449 • Web: facebook.com/finsseafooddivebar • Hours: 11 a.m.-10 p.m. Sunday to Thursday, 11 a.m.-midnight Friday and Saturday • Noise level: Moderate, louder on the patio due to Del Prado traffic • Etc.: Full bar, kids menu, outdoor seating, takeout available Unmasking Jean Le Boeuf, a look at JLB over 35 years Sample menu Starters • Empanadas, $6.95 • Coconut shrimp, $9.95 • Blue crab fingers, $10.95 Entrees • Paradise cheeseburger, $9.95 • Shrimp & grits, $16.95 • Diver scallops, $18.95 What the symbols mean ★ - Poor ★★ - Fair ★★★ - Good ★★★★ - Excellent $ - Average dinner entree is under $10 $$ - $10-$15 $$$ - $15-$20 $$$$ - $20-$25 $$$$$ - $25 and up More from JLB JLB review: Che Tito's Steakhouse North Fort Myers JLB review: Doug's Seafood gets bigger, better in Bonita JLB review: Cape Coral's Point 57 isn't perfect, just great Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    }
  ]
}