{
  "query": "fionnmacs.com email",
  "fuentes": [
    {
      "url": "https://fionnmacs.com/private-events/",
      "email": "pglaser@fionnmacs.com"
    },
    {
      "url": "https://www.discoveringireland.com/fionn-mac-cumhail/",
      "email": "info@discoveringireland.com"
    }
  ],
  "mails": [
    "info@discoveringireland.com",
    "pglaser@fionnmacs.com"
  ],
  "nombre_sitio": "fionnmacs.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://fionnmacs.com/private-events/",
      "text": "Private Events | Fionn MacCool's (904) 217-7021 Facebook Instagram Facebook Instagram Home Menu Food Menu Drinks & Draughts News & Specials Private Events Contact Gift Cards Employment Order Online Select Page Private Events at Fionn MacCool's Request Information 7 Let Us Host Your Next Gathering! Looking to plan an event? Fionn MacCool’s offers several different menu options to choose from or you can create a personalized menu to fit any occasion. Please click on our options below. Party Bars Fionn’s Party Bars – Choose from Beer & Wine Well Brands, Beer & Wine Full Open Bar Heavy Appetizers Fionn’s Heavy App Buffet Menus Menu #1 (3 choices) Menu #2 (4 choices) Menu #3 (5 choices) Menu #4 (6 choices) SELECTIONS: 3 Cheese Dip and Boxty Chips Chicken Wings (Choose any 2 sauces: Guinness BBQ, Buffalo, Sweet Thai Chili, Dry Rub & Guinness Honey Mustard) Spinach Dip and Boxty Chips Reuben Spring Rolls Chicken Tenders Mini Burgers Soft Pretzel Bites BBQ Meatballs Crab Cakes or Bacon Wrapped Scallops (extra charge per person) Contact us for pricing. Fionn's Pub Party Fionn’s Traditional Pub Party Menu CHOICE OF ENTRÉE: Lamb Shank Tender fall off the bone lamb shank, carrots, celery and potatoes, slowly simmered in our lamb broth. Fish and Chips A Giant piece of Atlantic Cod deep fried in beer batter, served with chips (fries) and peas. Corned Beef and Cabbage Juicy and tender corned beef, braised cabbage, and redskin potatoes served in a broth. Shepherd’s Pie Ground lamb with diced carrots, onions, celery, and peas in a rich sauce, topped with mashed potatoes, cheddar cheese, and then stuffed in a pie crust and baked. All entrées are served with house salad or Caesar salad. Fionn's Giant Pub Party Fionn’s Giant Pub Party Menu APPETIZERS Three Cheese Dip and Spinach Dip Appetizers served Family style CHOICE OF ENTRÉE County Cork Salad Mixed greens, ham, turkey, hard-boiled egg, cheddar cheese, bacon, tomatoes, and onions, served with croutons NY Strip 10 oz premium NY Strip grilled to order, topped with house made Irish Whiskey butter, served with roasted rosemary potatoes and sauteed haricots verts (green beans). Fish and Chips Our bestseller, and “The best fish and chips in town!” Traditional beer battered cod served with chips (fries), peas, and of course, malt vinegar. Chicken Pot Pie Chunks of chicken and fresh vegetables simmered in cream sauce and topped with puff pastry. Contact us for Pricing! Fionn's Finest Feast Fionn’s Finest Feast APPETIZERS Spinach Dip, Reuben spring rolls, and Crab Cakes Appetizers served Family style CHOICE OF ENTRÉE: Filet Mignon Grilled 8oz choice tenderloin, Parmesan and mushroom risotto, sautéed spinach, and veal demi-glace Duck Breast Pan seared Duck Breast, Roasted Corn and White Truffle risotto, Sautéed Haricot Verts and a Strawberry Balsamic Reduction Chilean Sea Bass Grilled Sea Bass served with Sautéed Fresh Vegetables All entrees are served with spring salad and house dressing DESSERT Whiskey Cake or Cheese Cake Fionn's Dublin Delights Dublin Delights APPETIZERS Spinach Dip, Reuben Spring Rolls, And Scotch Eggs Appetizers served Family style CHOICE OF ENTRÉE: Pecan Bourbon Salmon 8oz salmon filet with pecan crust, pan seared, topped with WIlliam Wolf Pecan Bourbon glaze. Served with whipped potatoes and haricot verts. Guinness Rib Eye Ten ounces of hand cut ribeye, marinated in Guinness beer and spices then grilled to perfection, served with Whipped potatoes, and Sautéed Haricot Verts. Pan Seared Chicken Pan seared chicken breast with mushrooms and herb Gravy. Served with Sautéed Haricot Verts and Whipped Potatoes All entrees are served with a house salad or Caesar salad DESSERT Cheesecake or Whiskey Cake Contact us for pricing. Fionn's Lunch Pub Party Fionn’s Lunch Pub Party Menu MacCool’s Burger Eight ounce Black Angus burger, grilled and served on a Kaiser bun with lettuce, tomato, and onion. All Burgers served Medium Well for large parties. Chicken Sandwich Grilled Chicken breast with lettuce, tomato and onion on a Kaiser roll. Fionn’s Fish Sandwich Atlantic cod served fried, with lettuce, onion and tomato on a Kaiser bun, with tartar sauce. County Cork Salad Mixed greens, ham, turkey, hard-boiled egg, cheddar cheese, bacon, tomatoes, and onions, served with croutons The Dubliner Hot corned beef, Swiss cheese, sauerkraut, and Thousand Island dressing on grilled rye bread. May substitute Turkey for Corned beef. All Sandwiches are served with French Fries Soda and Tea included. Fionn's Dinner Buffet Menus Fionn’s Dinner Buffet Menus Menu 1 (2 entrée selections) | Menu 2 (3 entrée selections) | Menu 3 (4 entrée selections) ALL BUFFETS INCLUDE: Tossed Salad Roasted Rosemary Potatoes or Garlic Mashed Potatoes Fresh Sautéed Seasonal Vegetables Dessert Trays of cheesecake or whiskey cake ENTRÉE CHOICES Beef Shepherd’s Pie Grilled Steak with Mushroom Demi-glace Tenderloin Medallions with Peppercorn and Brandy Cream Sauce (add $5 per person) Prime Rib or Corned Beef Carving Station (add $5 per person) Chicken Whiskey Chicken Chicken Picatta or Pot Pie Chicken and Vegetable Pasta in an Alfredo Sauce Seafood Shrimp and Vegetable Pasta in an Alfredo Sauce Blackened Mahi Mahi Salmon Filet Bacon Wrapped Scallops (add $5 per person) Contact for Pricing & Availability Bar Fionn MacCool’s features the highest quality draught beer, bottled beer, wine, whiskeys, scotch, other spirits, and specialty cocktails. We can customize the beverage portion of your event to fit any budget or occasion. Arrangements can also be made for specific products or labels. Additionally, we are happy to accommodate customized services such as beer and whiskey tastings during your event. Semi-Private & Private Events Fionn MacCool’s can serve groups of 10 to 200, with many seating options.  We have successfully accommodated everything from casual pre-selected menus to group buffets to formal sit-down dinners. Come on In! Sunday - Thursday 12 PM - 10 PM Friday & Saturday 12 PM - 12 AM Reserve a table Order Online Contact Phone 904-217-7021 Address 145 Hilden Road Ponte Vedra, FL  32081 Terms & Conditions Privacy Policy Contact Facebook Instagram © 2023 Fionn MacCool's | Irish Pub & Restaurant - Ponte Vedra, FL"
    },
    {
      "url": "https://www.discoveringireland.com/fionn-mac-cumhail/",
      "text": "Fionn Mac Cumhail - The Story | Discovering Ireland Enjoy 2026 Vacation Packages packages at 2025 prices AND 15% off all Self Drive Packages - Book by 15th Sept! Toggle navigation EUR € US Dollars $ Euro € GB Pounds £ Australian Dollar AU$ Canadian Dollar CA$ USA TollFree 1800 963 9260 AUS TollFree 1800 823 578 UK FreeFone 0800 041 8833 International +353 (0)69 77686 Self Drive Escorted Tours Chauffeur Tours Ireland Honeymoon Rail Tours Knitting Tours Special Offers Group Vacations Blog Fionn Mac Cumhail Home Ireland History of Ireland Fionn Mac Cumhail Page Menu In This Section Special Offers Ireland Vacation Information Vacation Reviews Map of Ireland About Ireland Bed and Breakfast Events Flying to Ireland Food History of Ireland People Practical Information Travel Tools Activities & Sports Fionn Mac Cumhail Fionn Mac Cumhail or Finn MacCool was the legendary Irish warrior/hunter who led the band of Irish warriors known as the Fianna and created the Giants Causeway . Fionn is connected to many of the legends of the Fenian Cycle. He first came to prominence after catching and eating the Salmon of Knowledge. Another important legend tells how Fionn met his first wife Sadbh while hunting. She had been transformed into a deer by a druid and after Fionn, caught her she turned into a beautiful woman. She bore Fionn a child, Oisin , before befing transformed again into a deer and separating Fionn from his son for many years. Another tale tells of how Fionn in a jealous rage, pursued the lovers Grainne and Diarmuid across Ireland after they had eloped together. But the most famous legend of Fionn Mac Cumhail surrounds the Giants Causeway in Country Antrim . The story goes that Fionn built the causeway to get to Scotland and battle with a rival giant called Benandonner. When he got there he found that the Scottish giant was asleep but also far bigger than himself, so Fionn returned back across the causeway. When Benandonner woke up he came across the causeway intent on fighting Fionn. Fionn's wife dressed up her husband as a baby and when Benandonner arrived she said Fionn wasn't home and to be quiet not to wake up the baby. When Benandonner saw the ‘baby' he decided that if the baby was that big, Fionn must be massive. So he turned tail and fled back across the causeway ripping it up as he went. All that remains are the ends, here at the Giant's Causeway and on the island of Staffa in Scotland where similar formations are found. If you would like more information on Ireland , on our suggested Ireland Vacation Packages or guided Ireland Bus Tours please contact one of our Ireland based Guides who can provide you with a free quote . Get discounts and updates for Discovering Ireland Vacations Sign up now for the official Discovering Ireland Vacations Update e-newsletter, designed to keep you up-to-date on what's new and exciting at Discovering Ireland and indeed in Ireland travel itself! You will also be among the first to know about our great special offers, vacation in Ireland deals and trip to Ireland cost! Sign Up for News and Offers Email Address Submit Help Me Plan My Trip Close Let's Start Planning Your Dream Trip! Email Address* All our packages are fully customisable. No pressure, no commitment, just a friendly custom quote to get you started! First name Please enter your name Email address Please enter a valid email address Phone Preferred Travel Style * Please select one Self-Drive Chauffeur Rail Undecided Please select your Preferred Travel Style Who's Travelling * Please select one Solo Couple Friends Family Group Please select Who's Travelling Travel Dates I don't have set dates yet Select Dates Tell us about your ideal trip! Any must sees or ideas you have in mind? Yes I would love to receive travel tips and special offers for Ireland! Submit Thanks! One of our friendly travel experts will be in touch within 48 hours to help plan your unforgettable Ireland vacation Resources Ireland Vacations Ireland Fly Drive Packages Escorted Coach Tours Ireland Chauffeur Tours of Ireland Group Vacations Ireland Golf Vacations in Ireland Ireland honeymoon packages Rail Tours of Ireland Guided Tours of Ireland The Irish Tourism Group Sustainability Policy Travel Tools Events Golf Hotels in Ireland All Inclusive Trips to Ireland About Us Ireland Knitting Vacations Terms & Conditions Ireland Travel Guide Flights to Ireland Ireland golf courses Ireland Vacation Deals Visit Cork Frequently Asked Questions Follow Us on Discovering Ireland Vacations, St. Mary's Road, Newcastle West, County Limerick, Ireland. USA TollFree 1800 963 9260 AUS TollFree 1800 823 578 UK FreeFone 0800 041 8833 International +353 (0)69 77686 1800 963 9260 (toll free) info@discoveringireland.com © 2025 Discovering Ireland Vacations  | Website by Granite Digital Start planning your vacation... Enquire Now Email Address* First Name * Last Name * Email Address * Phone Number * Arrival Date * * Nights Select 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 My dates are flexible Yes No If so, by how long No. of Adults Select 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 Children (2 to 11yrs) Select 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 Infants (under 2 years) Select 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 Accommodation Type **Please Select** B&Bs Mid Range 3*** Hotels Superior 4**** Hotels Luxury 5***** Hotels Castles Accommodation Specified in Tour Other (Please Specify) If other, please specify # Rooms required Other information Promotional Code How did you find us Select Bing Chicago Tribune Dunhill Travel Deals Facebook Google Ireland.com Linkedin MSN Other Pinterest Recommendation Sherman Travel Travel Spike \r\nTravelZoo Twitter Yahoo JavaScript is required in order fully to use this site. Please enable it now and reload the page."
    }
  ]
}