{
  "fuentes": [
    {
      "url": "https://www.biography.com/activists/betty-friedan",
      "email": "editor@biography.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://joangarry.com/how-to-fire-a-board-member/",
      "email": "joan@joangarry.ue1.rapydapps.cloud"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "acorona@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "ajaworowski@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "amatkus@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "asayfie@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "aselzer@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "bblalock@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "bkallgren@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "bkwatnez@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "cblair@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "cheisinger@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "clopez@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "colson@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "dmcgill@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "elavarnway@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "emontelongo@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "eparker@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "gocasio@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "hhassler@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "hhudson@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jartikova@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jcreber@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jhelmus@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jpatel@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jpatrick@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jperenick@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jtomaszewski@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "jugaz@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "kargomaniz@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "krichards@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "lmarquez@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "lposillico@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "mclynes@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "mcoyne@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "mlentine@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "myaphe@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "nmorse@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "nobrien@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "nsegal@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "pcrumb@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "rlaureano@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "rlopez@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "sblen@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "scortez@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "sgiordano@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "sguerrero@chicagofirefc.com"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "email": "sshotkoski@chicagofirefc.com"
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "email": "info@secureitsecurities.com"
    },
    {
      "url": "https://www.thefire.org/about-us/our-team",
      "email": "fire@thefire.org"
    },
    {
      "url": "https://tallahasseearts.org/organization/fire-bettys-arcade-bar/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://tallahasseearts.org/venue/fire-bettys-music-room/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "fema-netclibrary@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "fema-nfirshelp@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "hotelmotel@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "nfaonlinehelp@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "census@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "fema-nfa@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "fema-usfacontentreview@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "netcadmissions@fema.dhs.gov"
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "email": "usfa-publications@fema.dhs.gov"
    }
  ],
  "mails": [
    "acorona@chicagofirefc.com",
    "ajaworowski@chicagofirefc.com",
    "amatkus@chicagofirefc.com",
    "asayfie@chicagofirefc.com",
    "aselzer@chicagofirefc.com",
    "bblalock@chicagofirefc.com",
    "bkallgren@chicagofirefc.com",
    "bkwatnez@chicagofirefc.com",
    "cblair@chicagofirefc.com",
    "census@fema.dhs.gov",
    "cheisinger@chicagofirefc.com",
    "clopez@chicagofirefc.com",
    "colson@chicagofirefc.com",
    "dmcgill@chicagofirefc.com",
    "editor@biography.com",
    "elavarnway@chicagofirefc.com",
    "emontelongo@chicagofirefc.com",
    "eparker@chicagofirefc.com",
    "fema-netclibrary@fema.dhs.gov",
    "fema-nfa@fema.dhs.gov",
    "fema-nfirshelp@fema.dhs.gov",
    "fema-usfacontentreview@fema.dhs.gov",
    "fire@thefire.org",
    "gocasio@chicagofirefc.com",
    "hhassler@chicagofirefc.com",
    "hhudson@chicagofirefc.com",
    "hotelmotel@fema.dhs.gov",
    "info@secureitsecurities.com",
    "info@tallahasseearts.org",
    "jartikova@chicagofirefc.com",
    "jcreber@chicagofirefc.com",
    "jhelmus@chicagofirefc.com",
    "joan@joangarry.ue1.rapydapps.cloud",
    "jpatel@chicagofirefc.com",
    "jpatrick@chicagofirefc.com",
    "jperenick@chicagofirefc.com",
    "jtomaszewski@chicagofirefc.com",
    "jugaz@chicagofirefc.com",
    "kargomaniz@chicagofirefc.com",
    "krichards@chicagofirefc.com",
    "lmarquez@chicagofirefc.com",
    "lposillico@chicagofirefc.com",
    "mclynes@chicagofirefc.com",
    "mcoyne@chicagofirefc.com",
    "mlentine@chicagofirefc.com",
    "myaphe@chicagofirefc.com",
    "netcadmissions@fema.dhs.gov",
    "nfaonlinehelp@fema.dhs.gov",
    "nmorse@chicagofirefc.com",
    "nobrien@chicagofirefc.com",
    "nsegal@chicagofirefc.com",
    "pcrumb@chicagofirefc.com",
    "rlaureano@chicagofirefc.com",
    "rlopez@chicagofirefc.com",
    "sales@finewineliquors.com",
    "sblen@chicagofirefc.com",
    "scortez@chicagofirefc.com",
    "sgiordano@chicagofirefc.com",
    "sguerrero@chicagofirefc.com",
    "sshotkoski@chicagofirefc.com",
    "usfa-publications@fema.dhs.gov"
  ],
  "nombre_sitio": "firebettys.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.biography.com/activists/betty-friedan",
      "text": "Betty Friedan: Biography, Women's Rights Activist, Feminine Mystique Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Lainey Wilson Rupert Murdoch Howard Stern Elvis & Tom Parker’s Feud Famous Activists Womens Rights Activists Betty Friedan Betty Friedan Writer, feminist and women's rights activist Betty Friedan wrote 'The Feminine Mystique' (1963) and co-founded the National Organization for Women. By Biography.com Editors Updated: Mar 08, 2024 12:48 PM EST Photo: Fred Palumbo/Underwood Archives/Getty Images // Getty Images We may earn commission from links on this page, but we only recommend products we back. (1921-2006) Jump to: Who Was Betty Friedan? Quick Facts Early Life and Career 'The Feminine Mystique' Other Betty Friedan Books Co-Founding NOW, NARAL and the National Women's Political Caucus Later Works and Death Who Was Betty Friedan? In 1963, writer, feminist and women's rights activist Betty Friedan published The Feminine Mystique, which explores the idea of women finding fulfillment beyond traditional roles. Friedan co-founded the National Organization for Women in 1966 and served as its first president. She published The Second Stage in 1982 and The Fountain of Age in 1993. Quick Facts FULL NAME: Bettye Naomi Goldstein Freidan BORN: February 4, 1921 BIRTHPLACE: Peoria, Illinois SPOUSE: Carl Friedan (m. 1947–1969) CHILDREN: Daniel Friedan Early Life and Career Friedan was born Bettye Naomi Goldstein on February 4, 1921, in Peoria, Illinois. With her book The Feminine Mystique (1963), Friedan broke new ground by exploring the idea of women finding personal fulfillment outside of their traditional roles. She also helped advance the women's rights movement as one of the founders of the National Organization for Women. A bright student, Friedan excelled at Smith College, graduating in 1942 with a bachelor's degree in psychology. Although she received a fellowship to study at the University of California, Berkeley, she only spent a brief time there before relocating in the mid-1940s to New York City. In New York, Friedan worked for a short time as a reporter. In 1947, she married Carl Friedan. The couple went on to have three children: Daniel, who was born in 1948; Jonathan, born in 1952; and Emily, born in 1956. 'The Feminine Mystique' After the Friedans' first child was born in 1948, Friedan returned to work. She lost her job, however, after she became pregnant with her second child.  Friedan then stayed home to care for her family, but she was restless  as a homemaker and began to wonder if other women felt the same way she did — that she was both willing and able to be more than a stay-at-home mom. To  answer this question, Friedan surveyed other graduates of Smith College.  The results of her research formed the basis of her book The Feminine Mystique , published in 1963, throughout which Friedan  encourages women to seek new opportunities for themselves. The book quickly became a sensation, creating a social revolution by dispelling  the myth that all women wanted to be happy homemakers and marking the start of what would become Friedan's incredibly significant role in the women's rights movement. The work is also credited with spurring second-wave feminism in the United States. Other Betty Friedan Books Besides The Feminine Mystique (1963), Friedan authored It Changed My Life: Writings on the Women's Movement (1976), The Second Stage (1982) , The Fountain of Age (1993), Beyond Gender (1997) and her autobiography Life So Far (2000). Co-Founding NOW, NARAL and the National Women's Political Caucus Friedan did more  than write about confining gender stereotypes — she became a force for  change. Pushing for women to have a greater role in the political process, she co-founded the National Organization for Women in  1966, subsequently serving as its first president. She also fought for abortion  rights by establishing the National Association for the Repeal of  Abortion Laws (now known as NARAL Pro-Choice America) in 1969. Additionally, with other leading feminists such as Gloria Steinem and Bella Abzug , Friedan helped create the National Women's Political Caucus in 1971. Later Works and Death Seeking to help women wrestle with the demands of work both inside and outside of the home, Friedan published The Second Stage (1982), in which she presents a more moderate feminist position from  her earlier work. Friedan later explored the later stages of  a woman's  life in The Fountain of Age , which was published in 1993, when she was in her 70s. Friedan died of heart failure on February 4, 2006, in  Washington, D.C. Today, Friedan is remembered as one of the leading voices of the women's rights movement of the 20th century. Furthermore, the  work that she started is still being carried by the three  organizations she helped to establish. Fact Check: We strive for accuracy and fairness. If you see something that doesn't look right, contact us ! QUOTES It is better for a woman to compete impersonally in society, as men do, than to compete for dominance in her own home with her husband, compete with her neighbors for empty status, and so smother her son that he cannot compete at all. Man is not the enemy here, but the fellow victim. Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below Womens Rights Activists Alice Paul Which Historical Figures Are on U.S. Money? 51 Inspiring Famous Women in History 10 Groundbreaking Women in U.S. Politics Advertisement - Continue Reading Below Janelle Monáe Tammy Duckworth Christine de Pisan Sor Juana Inés de la Cruz Elizabeth Cady Stanton Hillary Clinton Gloria Steinem 30 Civil Rights Leaders of the Past and Present Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://joangarry.com/how-to-fire-a-board-member/",
      "text": "How to Fire a Toxic Board Member Skip to content Menu Start Here About Work With Us About Joan Diversity, Equity, and Inclusion Services Executive Coach & Strategic Advisor Keynotes & Live Events Virtual Workshops Nonprofit Leadership Lab Blog Executive Directors Board Leaders Fundraising Podcast Book Membership Board of Directors How To Fire A Toxic Board Member by Joan Garry A toxic board member is one thing, but if your entire board is dysfunctional that's quite another.If you'd like help with your board, come to my free workshop, \" How to Overcome a Dysfunctional Board \". I’m able to speak freely here because the board member you want to fire ain’t reading my blog. This board member needs no resources, no tools and no advice on how to approach board service. S/he’s got this. The problem is this board member is toxic. In fact, that’s the board member’s name. Toxic Board Member, or TBM for short . Harsh? Yes, but I see it often and that’s the word lots of people use – not just me. I know you’re anxious for my “ten easy steps that a board chair or a nonprofit CEO can follow to fire toxic board members.” I’m really sorry to disappoint you. I don’t have any steps. You know how to fire a board member? If you do, please comment below because I’m dying to know your recipe. So why am I bothering with this post? Because you can make TBM go away. Here’s how. HOW DO YOU KNOW THE BOARD MEMBER IS TOXIC? You might be laughing. I don’t need a list, you’re thinking. Anyone can see that this board member is toxic. Not so. Here’s how to know if TBM is bringing you down. TBM rolls his eyes at least once at every meeting (i.e. wildly disrespectful of other board members and staff) TBM interacts regularly with the staff in order to bad mouth the CEO TBM cares more about power than the mission TBM complains loudly about fundraising obligations and would make a motion to eliminate the board’s give/get if he felt he had the votes. You have board members who are MIA and you often pray that TBM would be. OK, so you have now established that TBM really is toxic. How do we make TBM go away? HOW TO MAKE TOXIC BOARD MEMBER GO AWAY So I’m sorry to report that you can’t actually fire a board member. It can damage the reputation of the board member and by extension, the organization. However, you do have two options. First, you can secure TBM’s resignation or second (the more common strategy) you can manage TBM out. SECURING A RESIGNATION This happens only in the most egregious of situations. Egregious situations may include (but are certainly not limited to): Fraudulent activities as Treasurer. Revealing confidential information to the public. Anything that would have significant implications on the credibility or viability of the organization. Now board members “leak” stuff all the time (and shouldn’t) but here I’m talking about egregious leaking – say, revealing the board vote on the hiring or firing of the CEO. Sexual advances to any staff members. In any of these situations, revealing the egregious action to the board would be an extreme embarrassment to TBM and securing a resignation should be fairly straightforward. It is important for people to know about the consequences of bad decisions. I didn’t say easy. I said straightforward. MANAGING TOXIC BOARD MEMBER OUT Here’s how I think of it. Instead of dumping the whole bucket of water on the Wicked Witch of the West, just pour slowly. In an intentional and strategic way, the Board Chair and the CEO must work steadily to reduce Toxic Board Member’s power, minimizing his influence step by step until he disappears (resigns). How? Board Chair and CEO on exactly the same page. TBM must go and they both agree that it will take longer than either of them will like. They also must agree that each of them will have an extra burden of work to get it done. Board Chair connects with Governance Committee. If your board is large enough to have one, you don’t want to leave them out. You want the buy-in of this group. Be sure everyone is on the same page. Secure Other Allies. Board Chair and CEO go through the board list. Find a good handful (3-4-ish) that feel exactly the same way they do. Secure their buy-in around the plan and their commitment to speak up so that the Board Chair and the CEO are not the only bad guys when TBM goes off. What’s happening here is that the Board Chair is building a support team. Also, the balance of power is shifting. Give Additional Power to the Allies. I like the idea of some kind of ad hoc committee with an ally as Chair – it could be around board recruitment or fundraising – something where TBM is on the wrong side of the issue. See what happens here? The power dynamics continue to shift. TBM ‘s melting away. Board Meeting Agenda: Roles and Responsibilities. Now that support has been built, the Board Chair can add some discussion to a board meeting either reminding folks of their roles and responsibilities or better yet, adding one or two that TBM will completely hate. It has to be something that will pass without him – ideally, something like raising the give/get – but anything that shows to TBM that he is terribly out of step and no one is listening to him. TBM has no allies. TBM melts. TBM resigns. THE SIDE BENEFIT A few more board members have stepped up and assumed new responsibilities and power. The right kind. The Board Chair can feel enormous pride that she/he took real responsibility for the effectiveness of the board. Every board member will understand what happened and every single board member will be thankful for the outcome. AND REMEMBER TO LEARN A VALUABLE LESSON Have a meal – Board Chair and CEO. Dissect how TBM got onto the board to begin with. Meet with the chair of your Nominations or Recruitment Committee. Share the lessons and adjust your recruitment process to minimize the likelihood of it happening again. And by all means, avoid any board prospects wearing ruby slippers. Next: How to Add Board Members That Are NOT Toxic 16 thoughts on “How To Fire A Toxic Board Member” Bob Witeck July 9, 2013 at 3:20 pm Joan, once I was reassured this blog did not highlight my past board performances, I found the advice spot on. I’ve seen the behaviors you’ve described, and witnessed some constructive strategies that isolate the toxic person and behavior. In some instances, of course, I’ve also witnessed these individuals getting frustrated and walking out on their own — which is a very satisfying outcome. Regrettably, however, some former board members stay or become more critical and vocal off the board than when serving within it. However, that outcome demands different ways to understand and to manage. Pat Hanberry July 9, 2013 at 3:46 pm Joan – I’m a little surprised you didn’t mention the Governance Committee in this blog.  I view one of their roles as keeping the board functioning smoothly, and helping to escort a toxic board member out seems to fall under this category. Joan Garry July 10, 2013 at 7:13 am Bob. That’s a post for another day. “Dealing With FORMER Toxic Board Members.” I have also checked around and you’ve never been green nor held anyone hostage.  So you’re safe.  And as mentioned, the person I describe has not subscribed to my blog.  Thanks for the comment. Joan Garry July 10, 2013 at 7:15 am Pat. I think you are absolutely right and you make a most excellent point.  If your board is large enough to have a governance committee, they should absolutely be roped in.  I may in fact edit the post to make note of this.  Thank you so much for your constructive feedback. Craig July 10, 2013 at 9:26 am Another helpful subject, thanks so much.  I’ve consulted with non-profits for my entire career and I’ve served on boards for 20+ years and I’m currently an ED, so I have a broad understanding and experience with Toxic Board Members, former Toxic Board Members, etc. One tactic that I’ve found helpful is having the President (or somebody the person connects with) take the individual aside and having a direct conversation.  “I know you love this organization, and I know you’re committed to the mission.  We so appreciate all of your support.  Do you know that in board meetings when you roll your eyes or grunt or …. that it prevents the rest of the board from exploring opportunities.”  I find that the gentle, but direct calling of people on their behavior often becomes a jump-starter for larger issues.  In nearly all cases the person either stepped up to the plate or we worked together to find a committee that they felt more “heard” and fulfilled with. As others have said – a clear and consistent board member job description is the best preventative medicine for this. Thanks Joan – you’re fabulous! Abby July 12, 2013 at 10:56 am hi Joan, nice article.  Just wondering:  do boards include anything in the bylaws about how they will handle “non-helpful” board members?  Also, I see an opportunity to focus on the group dynamics and the skills of the (other) board members during meetings;  for example, what’s the culture of the team in terms of people speaking up?  How does the facilitator/chair deal with the contributions of the toxic board member?  I think that US culture and US business culture indicate that it’s impolite to challenge someone, even when they’re disrupting the group, so the whole group suffers because of one person.  Just focusing here on behavior in meetings –  sometimes the facilitator can attend to the  comments from the toxic person, and ask something in a diplomatic way.  But I also think that the board members – and all of us as participants in a board or a group  – have a role to play in diplomatically speaking up to this person;  for example, if they’re complaining about something – “If you could turn your complaint into a request, what would you be asking for?”  or “I wonder what need/wish is not being met for you?”  or “This person’s comments seem to be taking us off-track; how do you all want to handle that” – or, “can we set that aside and get back on track?”  Would these be helpful in the situations/toxic members you’re thinking of? Abby Yanow http://www.skillfulfacilitation.com Joan Garry July 12, 2013 at 12:38 pm Abby. Thanks for weighing in. Maybe other readers know better but all I have seen as it relates to ‘non-helpful’ board members is about attendance at board meetings. Some by laws state that missing X number of board members automatically take you off the board.  We had this at GLAAD. We would then vote back in board members who really were ready to re-commit.  Sadly, toxic board members actually show up!   As for the role of other board members, you are so write. The challenge is that so few actually will speak up and out.  They silently roll their eyes and complain later over cocktails.  And lastly, I really love your questions and I think they are terrific tools to highlight things and may in fact be easier ways for fellow board members to “raise concerns” without feeling confrontational.  Thanks again. Joan Garry July 12, 2013 at 12:39 pm Craig. Thanks for your great comments.  Wish more Board Chairs were willing to have those difficult conversations.  It’s one of the reasons I do a lot of work with leadership teams on how to have an effective difficult conversation so they feel constructive and less difficult. David April 7, 2014 at 7:10 am Hi, Sorry I’m not any good in reading long comments, but I have a problem with a non profit cultural center were the director is the toxic board member brining the organization to the ground. How would I, as a community member and constant volunteer go about chopping of the head of the organization (the director) while preserving the body to have a transplant (before its too late)? Lori Abrams March 27, 2015 at 3:24 pm Hi Joan, While I see the most recent comment is a year ago, the beauty of this subject matter is that it is ageless! If only boards would enforce terms of service, some of this could be ameliorated by letting terms lapse. Some organizations do and others don’t, which in my opinion is a huge mistake.  Same with committee and event chairmanships. I’m not saying that the preferable way isn’t for someone to have a conversation but let’s be honest, most people just won’t do it.  But that’s a whole other story, and a whole other blog posting! Thanks for listening! Lori Joan Garry March 27, 2015 at 3:52 pm Lori. You are totally right. Term limits are key to minimizing the long term effect of a toxic board member. AND the key to building a leadership pipeline. There is no incentive to build that pipeline when you have leaders (good or bad) who never leave.  Not sure I’ve written about the critical nature of term limits. Just added it to the list.  Thanks. Annie September 22, 2016 at 11:39 am I know this is an older blog, but… What do you do when the TBM is the President? He does not perform any of the duties of the President because he doesn’t like them, except to say no to everything. He hates change, he will not call a meeting, will not chair a meeting, will not sign documents, will not fund-raise, will not go to meetings to represent our organization. He does perform valuable work for the organization and he is well known and well liked in the community. We want him to continue doing the work he does so well, but let someone else do the work he hates to do. He threatens to, but will not resign. He’s been president for years. So far others have filled in for him, but things have reached a point that we need him to support our program (I don’t want to go into details, he does not search the internet much, but others might). If he doesn’t it could be a major problem and affect our future, negatively, for the next few years, not to mention lose community confidence in us. Talking to him doesn’t work, we’ve tried, a close friend of his tried. Joan Garry September 22, 2016 at 3:14 pm shoot me an email at joan@joangarry.ue1.rapydapps.cloud and cut and paste this. i will offer some brief specific advice. Bill C March 28, 2017 at 3:14 pm “So I’m sorry to report that you can’t actually fire a board member. It can damage the reputation of the board member and by extension, the organization.” Speaking from experience, I have to respectfully disagree. Usually, TBMs have reputations well beyond your board for being toxic. Having them ON your board is what is hurting your organization’s reputation. Aree Paymai October 12, 2017 at 2:36 pm Once a board members resign, are they obligated to share documents related to the non profit organization?  And what are the rights of the new board if the old members refuse to share organization related documents and information.  For example, access to organization related websites, fundraising data, previous list of donors, etc. Kim November 20, 2017 at 3:47 pm Joan, we are dealing with same, the toxic board member is also the wife of the President, who is also toxic but less so, and only serving because his wife wants him to.  He doesn’t care one bit about the organization and had freely admitted so. My question is this:  can the remainder of the board call an informal non-meeting in order to freely discuss the issues without the toxic people in the room?   There is a rule in our by laws that say a board member can be voted out by the board if there is a 2/3 vote.  Help! Leave a Comment Comment Name Email Website Related posts A Simple Way to Conduct an Executive Director Performance Review (Free Template) How a CEO and Board Chair Can Build an Amazing Partnership Dear Joan: The Board Fired the CEO and Took Over! About Joan Garry Joan Garry is an internationally recognized champion for the nonprofit sector and a highly sought after executive coach for CEOs of some of the nation’s largest orgs. She is called upon by large organizations to tackle substantial change management / crisis management / leadership transitions requiring a compassionate truth-teller, a hands-on strategy advisor, a communications expert, and a focus on strong internal and external messaging. She is also the founder of the Nonprofit Leadership Lab. CONTACT ME © Joan Garry Consulting 2025 Privacy Policy"
    },
    {
      "url": "https://www.chicagofirefc.com/club/staff/",
      "text": "Official Chicago Fire FC Website Skip to main content New Stadium Tickets Schedule Club News Matchday Play Soccer Foundation Supporters Video Standings Press Facilities Chicago Fire II Academy Shop Español Careers New Stadium Tickets Schedule Club News Matchday Play Soccer Foundation Supporters Video Standings Press Facilities Chicago Fire II Academy Shop Español Careers New Stadium Tickets Schedule Club News Matchday Play Soccer Foundation Supporters Video Standings Press Facilities Chicago Fire II Academy Español Careers Shop CFFC Front Office Staff Roster Football Operations Front Office Front Office Staff DEI Council Supporters Media Kit Statistics Standings Club Partnerships Partners Associate Partners Performance Center Partners Ownership Joe Mansueto Owner and Chairman, Chicago Fire Football Club Executive Chairman, Morning Star, Inc. Executive Leadership Dave Baldwin President, Business Operations Pawel Szynalik Chief Financial Officer and Senior Vice President, Program Revenue Laura Warren Chief Legal and Administrative Officer Dan Moriarty Chief Marketing Officer Ted Glick Chief Ticketing Officer and SVP, Stadium Programming & Events Paul Cadwell Senior Vice President, Community Programs, Engagement & Facilities Goyo Perez Senior Vice President, Corporate Partnerships Minerva Ruiz Vice President, People & Culture Joey Colby-Begovich Vice President, Matchday Operations and Guest Experience Jake Winowich Vice President, Ticket Sales, Services & Operations Nate Engel Chief of Staff and Vice President, Strategy Finance & Administration Finance Martrice Caldwell Controller Matthew Goulding Director, Financial Planning & Analysis Haley Oxley Senior Manager, Financial Planning & Analysis Roberto Aragon Accounting Manager Emma Cabral Manager, Program Revenue & Strategy Anthony Maitland Staff Accountant Jeric Williams Financial Analyst Trey Angel Accounts Payable Specialist Legal Shelby Klose Deputy General Counsel Elina Doolabh Counsel Information Technology Dan Waite Director, Information Technology Chris O'Neal Manager, Information Technology Logan Cradick IT Support Specialist Austin Walker IT/AV Support Specialist Administration Maria Gabino Receptionist / Administrative Assistant People & Culture Angelo Vicario Director, People & Culture Haley Miller Specialist, People & Culture Communications Business Strategy & Analytics Dan Cohen Senior Director, Communications Elizabeth Sanchez Manager, Sporting Communications Carlos Rodriguez Specialist, Sporting Communications Sean Kearns Senior Manager, Business Strategy & Analytics Axel Rodas Data Analyst Katharine Stephens CRM Analyst Integrated Marketing Marketing Maissah Amin Director, Brand and Marketing Andrew Grahovec Director, Digital Marketing Katie Hunt Manager, Email Marketing Ashley Sullivan Manager, Brand and Marketing Jacqueline Oiga Specialist, Digital Marketing Kaeja Garner Coordinator, Email Marketing Social Media & Digital Content Emily Simanskis Senior Manager, Digital Content & Social Media Joey Perez Specialist, Photography & Digital Content Ty Van Duyn Coordinator, Social Media Video Production Connor Nichols Director, Video Emily Burdett Specialist, Video Max Knipstein Specialist, Video Jasper Howell Specialist, Video Creative Karl Hudson Creative Director Royce Tolledo Senior Graphic Designer Sara Aldridge Graphic Designer Claire Durkin Junior Graphic Designer Partnership Development Partnership Sales Michael Lienert Vice President, Partnership Sales Blake Delgado Ryan Director, Partnership Sales Pete Thompson Director, Partnership Sales Jenna Johnson Director, Partnership Sales Partnership Marketing & Strategy Julia Tesoro Hull Vice President, Partnership Marketing & Strategy Christine Giordano Director, Partnership Marketing Christian Smith Director, Partnership Marketing Brad West Director, Partnership Marketing Paige LaPlante Account Manager, Partnership Marketing Sutton Macinnes Account Manager, Partnership Marketing Jarrett Varsik Specialist, Partnership Strategy Matchday Experience & Events Kevin Brewer Senior Director, Operations Aaron Cox Director, Match Presentation & Entertainment Maci Hill Director, Events Oscar Tapia Senior Manager, Operations Makenzie Wilson Manager, Retail Operations & Merchandise Marketing Ryan McCollum Specialist, Operations Jessica Ragucci Specialist, Events Roberto Diaz Coordinator, Supporter Relations Chicago Fire Foundation & Community Relations Fire Pitch Jessica Yavitz Vice President of Community Relations Executive Director, Foundation Stacy Tsihlopoulos Director, Community Relations Tim Mack Manager, Foundation Programs & Events Roland Hahn Facilities Director, Fire Pitch Brendan Sanderson Facilities Manager, Fire Pitch Faith Enenbach Manager, Events & Program Sales James Foster Facilities Coordinator, Fire Pitch Community Soccer Lee Hannant Executive Director, Community Soccer Dean Arrowsmith Manager, Soccer in the Community Ty Iannone Manager, Adult Soccer Jake Bruce Coordinator, Soccer In The Community Daniel Cuautle Coordinator, Chicago Fire Rec Soccer Chicagoland Indoor Soccer League Hannah Berregaard Director, League Operations Stokely Davis Coordinator, Chicago Fire Rec Soccer Charlie Guggemos Coordinator, Chicago Fire Rec Soccer Danny Hernandez Coordinator, Soccer In The Community Pablo Rodriguez Coordinator, Chicago Fire Rec Soccer Damian Rojas Coordinator, Soccer In The Community Youth Soccer Development Matt Bond Director of Coaching, Chicago Fire Youth Soccer Club Luke Blakely Director of Operations, Chicago Fire Youth Soccer Club Christy Schumaker Club Manager, Chicago Fire Youth Soccer Club Fabio Suarez Head of Performance Phase, Chicago Fire Youth Soccer Club Nic Quiroga Head of Foundation Phase, Chicago Fire Youth Soccer Club Jules Sackeyfio Head of Development Phase, Chicago Fire Youth Soccer Club Will Stroud Specialist, Youth Competitions & Training Programs Ticket Sales & Service Leadership Cameron Badgett Senior Director, Ticket Operations Zac Pallissard Director, Premium Sales Tyler Maisonet Manager, Premium Sales Mick Dell'Orco Director, Membership Services Aaron Klein Director, Group Sales John Kim Director, Membership Sales Sam Bocken Manager, Membership Sales Ryan Mantel Manager, Inside Sales Ticket Operations Patrick Crumb Specialist, Ticket Operations Email Andrew Matkus Coordinator, Ticket Operations Email Membership Services Sydney-Ellen Blen Account Executive, Membership Services Email | 872-710-0461 Adrian Corona Account Executive, Membership Services Email | 872-710-0778 Maddie Coyne Account Executive, Membership Services Email | 872-710-0564 Stella Shotkoski Account Executive, Membership Services Email | 872-710-0464 Membership Sales Hudson Hassler Account Executive, Membership Sales Email Erin Parker Account Executive, Membership Sales Email | 872-710-0556 Jay Patel Account Executive, Membership Sales Email | 872-710-0579 Jake Perenick Account Executive, Membership Sales Email Luigi Posillico Account Executive, Membership Sales Email | 872-710-0584 Noah Segal Account Executive, Membership Sales Email | 872-710-0551 Maddie Yaphe Account Executive, Membership Sales Email | 872-710-0465 Premium Sales Jacob Helmus Senior Account Executive, Premium Sales Email | 872-710-0592 Jorge Ugaz Senior Account Executive, Premium Sales Email | 872-710-0586 Jimmy Creber Account Manager, Premium Sales Email | 872-710-0593 Marina Lentine Account Manager, Premium Service Email | 872-710-0543 Alexandra Ibarra Account Manager, Premium Service Email | 872-710-0762 Alex Sayfie Account Manager, Premium Sales Email Alan Selzer Account Manager, Premium Sales Email | 872-710-0779 Group Sales Sergio Guerrero Manager, Group Sales Email | 872-710-0581 Bailey Blalock Senior Account Executive, Group Sales Email | 872-710-0594 Mason Clynes Account Executive, Group Sales Email | 872-710-0548 Carter Heisinger Account Executive, Group Sales Email | 872-710-0527 Brandon Kwatnez Account Executive, Group Sales Email | 872-710-0739 Christina Lopez Account Executive, Group Sales Email | 872-710-0583 Devon McGill Account Executive, Group Sales Email | 872-710-0568 Edgar Montelongo Account Executive, Group Sales Email | 872-710-0585 Nathan Morse Account Executive, Group Sales Email | 872-710-0526 Nolan O'Brien Account Executive, Group Sales Email | 872-710-0578 Connor Olson Account Executive, Group Sales Email | 872-710-0763 Kelsey Argomaniz Coordinator, Group Sales Email | 872-710-0520 Inside Sales Representatives Jasmine Artikova Email Connor Blair Email | 872-710-0557 Sarah Cortez Email Siena Giordano Email Holden Hudson Email Anna Jaworowski Email Ben Kallgren Email Rey Laureano Email | 872-710-0549 Ethan LaVarnway Email Ricardo Lopez Email | 872-710-0563 Liliana Marquez Email | 872-710-0565 Gabriel Ocasio Email Jaye Patrick Email Kevon Richards Email | 872-710-0569 Jan Thomaszewski Email | 872-710-0553 Club Sites Atlanta Atlanta Austin Austin Charlotte Charlotte Chicago Chicago Cincinnati Cincinnati Colorado Colorado Columbus Columbus Dallas Dallas D.C. United D.C. United Houston Houston LAFC LAFC LA Galaxy LA Galaxy Miami Miami Minnesota Minnesota Montreal Montreal Nashville Nashville New England Revolution New England New York City New York City NY Red Bulls NY Red Bulls Orlando Orlando Philadelphia Philadelphia Portland Portland Real Salt Lake Salt Lake San Diego San Diego San Jose San Jose Seattle Seattle Sporting KC Sporting KC St. Louis St. Louis Toronto Toronto Vancouver Vancouver Tickets Single Match Tickets Season Memberships Premium Seating Group Tickets Terms & Conditions Club New Stadium News Video Roster Schedule Corporate Partners Careers Stay Connected Get the Official Mobile App Subscribe to Our Emails Contact Us Soldier Field Directions Stadium Policies Safety Information Amenities & Guest Services MLS Fan Code of Conduct Competition Guidelines Roster Rules & Regulations MLS Fantasy Shop Men Women Kids Jerseys Accessories Tickets Single Match Tickets Season Memberships Premium Seating Group Tickets Terms & Conditions Club New Stadium News Video Roster Schedule Corporate Partners Careers Stay Connected Get the Official Mobile App Subscribe to Our Emails Contact Us Soldier Field Directions Stadium Policies Safety Information Amenities & Guest Services MLS Fan Code of Conduct Competition Guidelines Roster Rules & Regulations MLS Fantasy Shop Men Women Kids Jerseys Accessories Terms of Service Privacy Policy Do Not Sell or Share My Personal Information Cookie Settings ©2025 MLS. The Major League Soccer and MLS name and shield are registered trademarks of Major League Soccer, L.L.C. (“MLS”). The names and logos of MLS teams are registered and/or common law trademarks of MLS or are used with the permission of their owners. Any unauthorized use is forbidden."
    },
    {
      "url": "https://www.secureitsecurities.com/contact-us",
      "text": "Contact Us - Get In Touch With Our Security Systems Company 24/7 845-445-6446 info@secureitsecurities.com 24 Hour Emergency Service About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Buy Now About Us About Us Blog Service Areas View All Nanuet Stony Point The Fire Alarm Insider's Podcast Services Interactive Home Security Security Cameras The Fire Alarm Business Blueprint Fire Alarm & Life Safety Pearl River, NY Palisades, NY Haverstraw, NY Access Control System 24/7 Professional Monitoring Fire Alarm Monitoring Jobs at SIS SIS CORP Training Center Government Government Clients Commercial Clients Our Secured Community Smart Home Store Contact Us Login Register | Login | My Cart 0 24 Hour Emergency Service Contact Us for Security Services in Rockland County, NY Home › Contact Us for Security Services in Rockland County, NY Contact Us for Security Services in Rockland County, NY Contact Secure IT Securities for Security Solutions in Rockland County Whether you're a homeowner in Pearl River or a business owner in Rockland County, Secure IT Securities\nCorp. offers security solutions to meet your specific needs. Reach out to us for a security consultation or to request a security quote . Our staff will work closely with\nyou to understand your needs and provide the best possible security solution. You can also schedule a\nsecurity assessment, to have our experts evaluate your property and recommend the most suitable\nsecurity measures. To get started, give us a call at (845) 445-6446 or fill out form below, and we'll be in touch with you. 24 Hour Emergency Service 1 Blue Hill Plaza, Suite 1509 Pearl River, NY 10965 845-445-6446 info@secureitsecurities.com Hours Monday - Friday: 8:00 AM - 5:00 PM Saturday : 9:00 AM - 3:00 PM Sunday : CLOSED Leave A Message Contact First Name: * Last Name: * City: * Phone Number : * Email: * Message: Contact Us Secure IT Securities Corp. 1 Blue Hill Plaza #1509 Pearl River, NY 10965 info@secureitsecurities.com 845-445-6446 About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Return Policy Standard Service Agreement Accessibility Statement Privacy Policy Our Partners Terms Of Services Smart Home Store Contact Us Blog About Us Services Interactive Home Security Security Cameras Fire AlarmLife Safety Access Control System 24-Hour Monitoring Government Commercial Clients Blog Our Partners Return Policy Cookie Policy Contact Us New York State Fire & Security License #12000295002 | Smart Home Security Solutions in Pearl River, NY My Cart 0 By using our website, you agree to the use of cookies as described in our Cookie Policy Accept × Shopping Cart × Your cart is empty. Continue Shopping"
    },
    {
      "url": "https://www.thefire.org/about-us/our-team",
      "text": "Our Team | The Foundation for Individual Rights and Expression Skip to main content Member Portal Students Faculty Alumni K-12 Educators College Administrators Store About Us Submit a Case Donate Home Store Donate Defending Your Rights What We Do Individual Rights Advocacy Reforming College Policies Legal Support Legislative Policy Reform Our Impact What we defend Free Speech Academic Freedom Religious Liberty Due Process Press Freedom Freedom of Assembly Freedom of Conscience Title IX Have your rights been violated? If you face retaliation over protected speech, reach out to FIRE to learn more about how we can protect your rights. Submit a Case Get Involved Make a difference Get FIRE Updates Take Action Donate Attend an Event Host a FIRE Speaker Be an Advocate Join Our Team Subscribe to FIRE Updates Subscribe to receive emails and texts about FIRE's work and upcoming events. Subscribe Take Action Across the nation, free speech rights are under attack. Join us in defending this essential quality of liberty. Make your voice heard and join a campaign. Protect Free Speech Research & Learn Resources Resource Library Reports Issue Pages Databases Campus Guides Toolkits Books Supreme Court Cases College Free Speech Rankings Presented by FIRE and College Pulse, the 2026 College Free Speech Rankings is the largest survey of campus free expression ever performed. Explore Rankings National Speech Index The National Speech Index is a new quarterly component of America’s Political Pulse, an ongoing weekly survey that will allow researchers to track shifting free speech sentiment in America over time. Learn More Colleges News Cases About Us Submit a Case Home Explore This Section About Us History Mission Our Team Join Our Team Frequently Asked Questions Share Share with Email Share on Bluesky Share on Twitter Share on Facebook Print Meet Our People FIRE is a mission-driven organization of hardworking, dedicated team members committed to defending and sustaining the individual rights of all Americans to free speech and free thought. Executive Admin Campus Advocacy Communications Development Legislative Litigation Policy Reform President's Staff Public Advocacy Research Events and Partnerships Fellows Board of Directors Advisory Council Legal Advisory Council Select Team Executive Admin Campus Advocacy Communications Development Legislative Litigation Policy Reform President's Staff Public Advocacy Research Events and Partnerships Fellows Board of Directors Advisory Council Legal Advisory Council Executive Carolyn Iodice Legislative and Policy Director Molly Nocheck Vice President of Student Development Matthew Harwood Vice President of Communications Greg Lukianoff President and CEO Lindsie Rank Director of Campus Rights Advocacy Daniel Burnett Senior Director of Communications Will Creeley Legal Director Angela Erickson Vice President of Research Molly Fratianne Director of Strategic Partnerships Robert Corn-Revere Chief Counsel Hannah Abbott Staff Attorney Jessie Appleby Program Counsel Sara Berinhout Attorney Charlotte Arneson Program Counsel Alisha Glennon Chief Operating Officer Laura Beltz Director of Policy Reform Tyler Coward Lead Counsel, Government Affairs Ryne Weiss Director of Research Khalia Abner Creative and Design Manager Justin Amash Member, Advisory Council Ryan Ansloan Senior Program Counsel Isabelle Brito Program Officer Ronald K. L. Collins Editor in Chief of First Amendment News Perry Fein Senior Executive Assistant & Office Manager Gail Lucas Director of Finance and Accounting Daniel Mrazik Director of Data Strategy and Innovation Nico Perrino Executive Vice President Harvey Silverglate Co-Founder of FIRE; Member, Board of Directors Ronnie London General Counsel David Goldberger Member, Legal Advisory Council Ari Cohn Lead Counsel, Tech Policy Dominic  Coletti Program Officer Ashley Adams Senior Director of Development Joe Antonelli Manager, Finance & Accounting Ronald Baez Director of Video Talia Barnes Multimedia Designer Nicholas A. Christakis Member, Advisory Council John Coleman Legislative Counsel Aaron Corpora Program Officer Angel Eduardo Senior Writer/Editor Adam Goldstein Vice President of Strategic Initiatives Mary Griffin Senior Program Counsel Kurt Jaggers Chairman, Board of Directors Roger Lowenstein Member, Legal Advisory Council Aaron Terr Director of Public Advocacy Jon Ashken Grants Manager Anthony Dick Member, Advisory Council Greg Gonzalez Legislative Counsel Nathan Honeycutt Research Fellow Ken Paulson Member, Legal Advisory Council Robert Ruggeri Member, Legal Advisory Council Samuel J. Abrams Member, Board of Directors Alyssa Bennett People Operations Specialist Charlie Birge Development Writer Jackson Fleagle Graphic Designer Karith Foster Member, Advisory Council Bridget Glackin Chief Development Officer Haley Gluhanich Senior Program Counsel Michael Hurley Government Affairs Counsel Trent DeCorte Help Desk Technician Barrett Fife Legal Secretary Chapin Lenthall-Cleary Data Analyst Nerida Brownlee Chief of Staff John Campione Senior Philanthropy Officer Conor Fitzpatrick Supervising Senior Attorney Alex Griswold Communications Campaign Manager Ariel Hochhauser Finance and Development Associate Emily Nayyer Research Associate Jim Grant Deputy Chief Counsel Garrett Gravley Program Counsel Ira Glasser Member, Advisory Council Zach Greenberg Faculty Legal Defense/Student Association Counsel Greg Harold Greubel Senior Attorney Chris Harris Marketing Manager William Harris Strategic Campaigns Specialist Sean Stevens Chief Research Advisor Joshua House Amicus Attorney Colin McDonell Attorney Dylynn Lasky Program Associate Brynn Lintner Campus Rights Advocacy Intern Marie McMullan Student Press Legal Associate Connor Murnane Campus Advocacy Chief of Staff John Ellis Member, Board of Directors Katie Di Pane Events Specialist Jackie Farmer Learning and Development Specialist Kmele Foster Member, Board of Directors Erica Goldberg Member, Advisory Council Allison Hayward Member, Board of Directors Jordan Howell Digital Editor Stephanie Jablonsky Senior Program Counsel Zoe Kuenstler Manager of Foundation Relations Ross Marchand Program Counsel Jacob Mchangama Senior Fellow JT Morris Supervising Senior Attorney Amanda Nordstrom Strategic Campaigns Counsel John B. Henneman III Member, Board of Directors Mahnoor Haq Events Specialist Jimmy Lewis Philanthropy Officer Ellie Herman Email Marketing and Analytics Specialist Sallie James Member, Advisory Council Sarah McAvoy Development Officer Graham Piro Faculty Legal Defense Fund Fellow Melissa Shane Program Associate Kat Parker Paralegal Sandy Leong Member, Board of Directors Samuel Li Executive Assistant/Podcast Producer Bobby Ramkissoon Program Manager, Alumni Outreach David Rubin Staff Attorney Joseph Maline Member, Board of Directors Suleyman Gokyigit Chief Information Officer Wendy Kaminer Member, Advisory Council Virginia Postrel Member, Board of Directors Malvi Shah Director of Events Robert Shibley Special Counsel, Campus Advocacy Elizabeth Holley Program Manager, Strategic Partnerships Tyler MacQueen Director of Multimedia Timur Kuran Member, Advisory Council Bobby Mairone Multimedia Video Producer Chris Maltby Multimedia Production Manager Keith Whittington Member, Board of Directors Ty Stillerman Philanthropy Officer Sam McBee Data Associate Sophia McKean Social Media Copywriter David Lat Member, Advisory Council Sarah McLaughlin Senior Scholar, Global Expression John Merigliano Web Operations Manager Nadine Strossen Senior Fellow Janell Watkins Annual Giving Director John McWhorter Member, Advisory Council Peter Malkin Member, Advisory Council Maddy Noble Office Services Associate Joe Shanley Program Officer, Strategic Partnerships Zach Silver Staff Attorney Jack Povilaitis Student Development Associate Aaron Ramirez AI Specialist Adam Steinbaugh Senior Attorney Scott Rogers IT Manager Cait Scanlan Chief People Officer Tyler Tone Executive Litigation Assistant Gabe Walters Attorney Anna Simpson Data Management and Analytics Officer Liz Peek Member, Advisory Council Daniel Zahn Staff Attorney Katie Stalcup Communications Campaign Manager Steven Pinker Member, Advisory Council David Volodzko News Editor & Senior Writer Jeff Zeman Staff Attorney Karl de Vries Director of Media Relations Carrie Robison Operations and Strategy Lead Steven Shapiro Member, Advisory Council Jack Whitten Communications Campaign Specialist Daniel Shuchman Member, Advisory Council Ben Zabelshansky Marketing Strategist Lawrence Summers Member, Advisory Council Chuck Taylor Member, Advisory Council Brennen VanderVeen Program Counsel Become a Free Speech Insider! Subscribe to receive emails and texts about FIRE's work and upcoming events. Email © 2025 Foundation for Individual Rights and Expression P.O. Box 40128 Philadelphia, PA 19106 fire@thefire.org 215-717-FIRE About Us Contact Us Careers Submit a Case Privacy Statement Terms and Conditions Facebook Twitter Instagram Bluesky YouTube TikTok Donate Share Share this selection on Twitter Share this selection via email"
    },
    {
      "url": "https://tallahasseearts.org/organization/fire-bettys-arcade-bar/",
      "text": "Fire Betty’s Arcade Bar English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Organization Type Arts Council/Alliance Association/Club/Group/Guild Business/Retail Corporation Dance Diversity, Equity, & Inclusion -- BIPOC Owned/Operated -- LGBTQIA+ Friendly -- LGBTQIA+ Owned -- Persons with Disabilities Education Educational Environmental Faith Based/Religious Festivals/Markets Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Retail School Special Events Sports/Outdoors Theatre Travel Visual Art/Fine Craft State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 SEARCH Advanced Filters Home Organization Fire Betty's Arcade Bar Comment Facebook Twitter Linkedin Print Fire Betty's Arcade Bar “We are the first and only arcade bar in Tallahassee, Fl with a full bar offering Happy Hour everyday 5pm-7pm. We offer live music, shows, and entertainment on our stage.  Our arcade games range from vintage Pinball machines to Air Hockey, life size Jenga, and Corn Hole.. Some of the games we have include Star Wars, Jurassic Park, Ms. Pac Man, Skee Ball, Street Fighter, Mortal Kombat 4, The Simpsons, Southpark, and Teenage Mutant Ninja Turtles.” “We are the first and only arcade bar in Tallahassee, Fl with a full bar offering Happy Hour everyday 5pm-7pm. We offer live music, shows, and entertainment on our stage.  Our arcade games range from vintage Pinball machines to Air Hockey, life size Jenga, and Corn Hole.. Some of the games we have include Star Wars, Jurassic Park, Ms. Pac Man, Skee Ball, Street Fighter, Mortal Kombat 4, The Simpsons, Southpark, and Teenage Mutant Ninja Turtles.” View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Food/Drink ; Music ; Special Events PAST EVENTS Fired Up Queens | A Drag Show Presented by Fire Betty's Arcade Bar at Fire Betty's Music Room Jan 18, 2025 Facebook Twitter Linkedin GET TICKETS Contact information Facebook / Primary address: 1122 Thomasville Road, Tallahassee, FL 32303 (850) 727-8224 COMMENTS 1 comment Add yours Christina November 12, 2022 Hi is there a charge for Karaoke Hi is there a charge for Karaoke View less Reply Leave a comment Your email address will not be published. Required fields are marked * * Email address is required! * This is not email address! * Author name is required! * Comment content is required! Your name * Your email * Comment * You may use these HTML tags and attributes : <a href=\"\" title=\"\"> <abbr title=\"\"> <acronym title=\"\"> <b> <blockquote cite=\"\"> <cite> <code> <del datetime=\"\"> <em> <i> <q cite=\"\"> <s> <strike> <strong> * Please check the box to prove you are not a robot Find An Organization Search by Keyword Organization Type Arts Council/Alliance Association/Club/Group/Guild Business/Retail Corporation Dance Diversity, Equity, & Inclusion -- BIPOC Owned/Operated -- LGBTQIA+ Friendly -- LGBTQIA+ Owned -- Persons with Disabilities Education Educational Environmental Faith Based/Religious Festivals/Markets Film/Video Food/Drink Foundation Gallery/Museum Government History/Heritage Kids/Family Library Literature/Poetry Media Music Nonprofit Retail School Special Events Sports/Outdoors Theatre Travel Visual Art/Fine Craft State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://tallahasseearts.org/venue/fire-bettys-music-room/",
      "text": "Fire Betty’s Music Room English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access SEARCH Advanced Filters Home Venue Fire Betty's Music Room Facebook Twitter Linkedin Print Fire Betty's Music Room LOCATION Fire Betty's Music Room 1122 Thomasville Road #1, Tallahassee, FL 32303 View in Google Maps MAKE IT A NIGHT View map Don’t see your business listed here? Email us to add it! Expand [+] ALBUQUERQUE LITTLE THEATRE FOOD Cheese Coffee Caf Downtown Liu Chinese Fast Food Vinaigrette Garcias Kitchen The Original Route 66 Malt Shop Bottger Mansion of Old Town Accommodation Bottger Mansion of Old Town Liu Chinese Fast Food Drink Bottger Mansion of Old Town Liu Chinese Vinaigrette PAST EVENTS Fired Up Queens | A Drag Show Presented by Fire Betty's Arcade Bar at Fire Betty's Music Room Jan 18, 2025 Facebook Twitter Linkedin GET TICKETS Pin Up Power Hour at Fire Betty's Presented by Crypt Tease Productions at Fire Betty's Music Room Mar 1, 2024 Facebook Twitter Linkedin GET TICKETS Contact information 1122 Thomasville Road #1, Tallahassee, FL 32303 Find A Venue Search by Keyword Venue Type Amusement Park Arena/Stadium Bar/Tavern Bookstore Business/Company Campground Church Community Center Concert Hall Cultural District Fairgrounds Farm Gallery Government Historic Building/Landmark Hotel/Inn Library Museum Nightclub Online/Virtual Park/Garden Performing Arts Center Restaurant/Cafe School Shopping District Studio Theater State / Province AL FL GA City/Town Ashford Bellwood Black Chancellor Coffee Springs Columbia Cottonwood Cowarts Dothan Five Points Geneva Gordon Hartford Headland Malvern Newville Pansey Samson Shorterville Slocomb Webb Alford Apalachicola Bascom Bonifay Branford Bristol Campbellton Carrabelle Chattahoochee Chipley Cottondale Crawfordville Cross City Cypress Day Eastpoint Ebro Fort White Fountain Graceville Grand Ridge Greensboro Greenville Greenwood Gretna Havana Highland City Horseshoe Beach Jasper Jennings Lake City Lamont Lee Live Oak Lloyd Lulu Lynn Haven Madison Malone Marianna Mayo Mc Alpin Mexico Beach Midway Monticello Noma Old Town Panacea Panama City Panama City Beach Perry Pinetta Ponce de Leon Port Saint Joe Quincy Rosemary Beach Saint Marks Sneads Sopchoppy Steinhatchee Tallahassee Trenton Vernon Wausau Wellborn Westville Wewahitchka White Springs Woodville Youngstown Adel Alapaha Albany Arlington Baconton Bainbridge Barney Barwick Berlin Blakely Bluffton Boston Brinson Brookfield Cairo Camilla Cecil Chula Climax Coleman Colquitt Cuthbert Damascus Dixie Doerun Edison Ellenton Enigma Fort Gaines Funston Hahira Iron City Jakin Lake Park Lakeland Leary Leesburg Lenox Meigs Morgan Morven Moultrie Nashville Naylor Newton Norman Park Ochlocknee Omega Pelham Poulan Quitman Ray City Rebecca Sale City Shellman Smithville Sparks Statenville Stockton Sumner Sycamore Sylvester Thomasville Tifton Ty Ty Valdosta Warwick Whigham Zip/Postal Code 31601 31602 31603 31604 31605 31606 31620 31622 31625 31626 31627 31629 31632 31635 31636 31637 31638 31639 31641 31643 31645 31647 31648 31649 31698 31699 31701 31702 31703 31704 31705 31706 31707 31708 31716 31720 31721 31722 31727 31730 31733 31744 31747 31749 31753 31757 31758 31763 31765 31768 31771 31773 31775 31776 31779 31781 31783 31784 31787 31788 31789 31790 31791 31792 31793 31794 31795 31796 31799 32008 32013 32024 32025 32038 32052 32053 32055 32056 32059 32060 32061 32062 32064 32066 32094 32096 32301 32302 32303 32304 32305 32306 32307 32308 32309 32310 32311 32312 32313 32314 32315 32316 32317 32318 32320 32321 32322 32324 32326 32327 32328 32329 32330 32331 32332 32333 32336 32337 32340 32341 32343 32344 32345 32346 32347 32348 32350 32351 32352 32353 32355 32358 32359 32362 32395 32399 32401 32402 32403 32404 32405 32406 32407 32408 32409 32410 32411 32412 32413 32417 32420 32423 32425 32426 32428 32431 32432 32437 32438 32440 32442 32443 32444 32445 32446 32447 32448 32449 32452 32455 32456 32457 32460 32461 32462 32463 32464 32465 32466 32628 32648 32680 32693 33846 36301 36302 36303 36304 36305 36312 36313 36314 36316 36318 36319 36320 36321 36340 36343 36344 36345 36349 36353 36370 36373 36375 36376 36477 36855 39813 39817 39818 39819 39823 39824 39825 39827 39828 39834 39836 39837 39840 39841 39846 39851 39859 39861 39862 39866 39870 39886 39897 Accessibility Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://www.usfa.fema.gov/contact.html",
      "text": "Contact the U.S. Fire Administration Skip to main content An official website of the United States government Here's how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( ) or https:// means you've safely connected to the .gov website. Share sensitive information only on official, secure websites. Menu Hotels Library Publications Blog Image Gallery About Contact Fire Academy Fire Academy Home Courses Distinctive Programs Admissions On-Campus Students About NFIRS NFIRS Home NFIRS Sunset eNFIRS Applications Documentation Training Coding Help Reporting Guidelines Vendor Information Data Quality Access Data About NFIRS NERIS Prevention Fire Prevention Home Home Fires Arson & Youth Firesetting Hotels & Vacation Rentals Outdoor Fires/Wildfires Vehicle Fires Workplace Fires Life Safety Hazards Fire Is Everyone’s Fight ® Fire Prevention Officials Statistics Statistics Home Reports Death and Injury Risk Residential Fires Nonresidential Fires Outside and Vehicle Fires Firefighter Fatalities Fire Department Registry State Statistics Data Sets Home Fire Fatalities EMS Wildfire Wildfire Home What is the WUI? Training Fire-Adapted Communities Outreach Materials Healthy Landscapes Data Research and Technology Wildfire and WUI Blog A-Z Index Menu Fire Academy ... Fire Academy Home Courses Distinctive Programs Admissions Campus Life About NFIRS ... NFIRS Home NFIRS Sunset eNFIRS Applications Documentation Training Coding Help Reporting Guidelines Vendor Information Data Quality Access Data About NFIRS NERIS Fire Prevention ... Fire Prevention Home Home Fires Arson & Youth Firesetting Hotels & Vacation Rentals Outdoor Fires/Wildfires Vehicle Fires Workplace Fires Life Safety Hazards Fire Is Everyone’s Fight ® Fire Prevention Officials Statistics ... Statistics Home Reports Death and Injury Risk Residential Fires Nonresidential Fires Outside and Vehicle Fires Firefighter Fatalities Fire Department Registry State Statistics Data Sets Home Fire Fatalities EMS Wildfire ... Wildfire Home What is the WUI? Training Fire-Adapted Communities Outreach Materials Healthy Landscapes Data Research and Technology Wildfire and WUI Blog A-Z Index Hotels Library Publications Blog Image Gallery About Contact Home Contact USFA Contact the U.S. Fire Administration Share on: Please use the contact information below to ask a question or send a comment to us. See also: USFA staff directory Email us Admissions Office Hotel-Motel National Master List Library National Fire Academy (NFA) NFA Online National Fire Department Registry National Fire Incident Reporting System (NFIRS) Help Desk Publications Center Other question or comment Call us The best time to reach us is Monday – Friday between 8 a.m. – 4 p.m. Eastern time. Contact information Admissions Office: 301-447-1035 , 301-447-1441 (fax) Housing/Transportation: 301-447-1048 Library: 800-638-1821 or 301-447-1030 National Fire Incident Reporting System (NFIRS) Help Desk: 888-382-3827 Write to us U.S. Fire Administration 16825 South Seton Ave. Emmitsburg, MD 21727 Contact fire service agencies in your state Our state points of contact directory includes telephone numbers for the: Fire Marshal’s office. Fire training office. NFIRS program manager. Page last reviewed: May 22, 2025 Be prepared. Be informed. Be safe. Contact USFA Information for College/university educators On-campus students Off-campus students Online students NFA instructors Public information officers Public fire educators Researchers State training officials Volunteer fire service Wildland firefighters About USFA Leadership Events Position statements Job announcements Doing business with us Subscribe to email lists https://www.usfa.fema.gov U.S. Fire Administration 16825 S. Seton Ave. Emmitsburg , MD 21727 USA Fire Is Everyone’s Fight ® USFA.FEMA.gov An official website of the Federal Emergency Management Agency Accessibility Accountability Careers Civil Rights Contact FEMA FOIA Glossary No FEAR Act Plug-Ins Privacy Report Disaster Fraud Website Information DHS.gov USA.gov Inspector General Current Advisories"
    }
  ]
}