{
  "fuentes": [
    {
      "url": "https://www.ffvcnc.org/",
      "email": "info@ffvcnc.org"
    },
    {
      "url": "https://www.ffvcnc.org/",
      "email": "info@ffvnc.org"
    },
    {
      "url": "https://keywest.floridaweekly.com/articles/how-damian-deangelis-took-flight-in-key-west/",
      "email": "jdickerson@floridaweekly.com"
    },
    {
      "url": "https://firstflightkw.com/",
      "email": "info@keysrestaurantsgroup.com"
    },
    {
      "url": "https://firstflightkw.com/dinner",
      "email": "info@keysrestaurantsgroup.com"
    },
    {
      "url": "https://firstflightkw.com/drinks",
      "email": "info@keysrestaurantsgroup.com"
    },
    {
      "url": "https://firstflightkw.com/happy-hour",
      "email": "info@keysrestaurantsgroup.com"
    },
    {
      "url": "https://firstflightkw.com/contact",
      "email": "info@keysrestaurantsgroup.com"
    },
    {
      "url": "https://thekeywester.com/blog/first-flight-island-restaurant-brewery/",
      "email": "islandgenn@me.com"
    },
    {
      "url": "https://www.ffvcnc.org/meet-our-team",
      "email": "info@ffvcnc.org"
    },
    {
      "url": "https://www.ffvcnc.org/meet-our-team",
      "email": "info@ffvnc.org"
    },
    {
      "url": "https://www.snapchat.com/place/first-flight-island-restaurant-brewery/61c81cc0-9993-11e8-b886-176ca5208911",
      "email": "brewery_glyph_dark@2x.png"
    },
    {
      "url": "https://www.snapchat.com/place/first-flight-island-restaurant-brewery/61c81cc0-9993-11e8-b886-176ca5208911",
      "email": "restaurant_glyph_dark@2x.png"
    }
  ],
  "mails": [
    "brewery_glyph_dark@2x.png",
    "info@ffvcnc.org",
    "info@ffvnc.org",
    "info@keysrestaurantsgroup.com",
    "islandgenn@me.com",
    "jdickerson@floridaweekly.com",
    "restaurant_glyph_dark@2x.png"
  ],
  "nombre_sitio": "firstflightkw.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ffvcnc.org/",
      "text": "First Flight Venture Center About Programs Hangar6 Membership Graduates Resources for Startups Signature Events Sponsorships News AgBio + AgTech Events Member Portal Contact Donate Back Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Meet Our Navigators Meet Our Resident Companies Back Our Programs 2024/25 FAST SBIR Funding Program BARDA DRIVe: Health Security Innovation Funding Business Incubator Captain's Circle Itineraries: Science Talk LiftOff: Strategic Non-dilutive Funding Navigators: Advisors and Business Mentoring Pilots Lounge Propeller Pre-Accelerator: Finding the Business Value in New Ideas Test Flight: Pitch Practice WheelsUP Accelerator Wingspan Back 2025 High Flyer Award Luncheon 2025 BBQ, Brews & Band 2025 March Madness Open House 2024 High Flyer Award Luncheon 2024 Boil, Brews & Band 2024 March Madness Open House Back Meet Our Sponsors Become a Sponsor About Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Meet Our Navigators Meet Our Resident Companies Programs Our Programs 2024/25 FAST SBIR Funding Program BARDA DRIVe: Health Security Innovation Funding Business Incubator Captain's Circle Itineraries: Science Talk LiftOff: Strategic Non-dilutive Funding Navigators: Advisors and Business Mentoring Pilots Lounge Propeller Pre-Accelerator: Finding the Business Value in New Ideas Test Flight: Pitch Practice WheelsUP Accelerator Wingspan Hangar6 Membership Graduates Resources for Startups Signature Events 2025 High Flyer Award Luncheon 2025 BBQ, Brews & Band 2025 March Madness Open House 2024 High Flyer Award Luncheon 2024 Boil, Brews & Band 2024 March Madness Open House Sponsorships Meet Our Sponsors Become a Sponsor News AgBio + AgTech NC PREMIER RESEARCH INCUBATOR Events Member Portal Contact Donate Scroll Develop. Launch. Succeed. Develop your idea, create your prototype, secure grants, launch your business, and in doing so, we create jobs and grow the economy of North Carolina. DISCOVER MORE WELCOME TO FIRST FLIGHT The Home of \"High Science, High Impact\" Technological Innovation First Flight is one of the nation's largest, most stable incubators with a proven record of success. We've hosted more than 400 companies, launched businesses that have commercializing and impactful new technologies, and created thousands of jobs. We have the experience and ecosystem you need for success. ACHIEVEMENTS Our Impact The numbers tell the story better than we ever could. First Flight is proud to say that since 1991, our companies have accumulated a market capitalization of $20 billion, a truly remarkable number. Additionally, in 2024, First Flight companies filed over 28 patents and raised over $4,454,000 million in grants. 20 BILLION Market Cap for First Flight Grads 420+ COMPANIES In 33 years 323 MILLION Investment Funds raised by equity since inception by 2023 Companies 34.6 MILLION Grants Awarded to Companies while at First Flight in 2023 119 Patents currently held 50 Minority/ Women employed by current First Flight companies CONTACT US Our community supports your work. Our community is an inspiring mix of start-ups, serial entrepreneurs, advisors and alumni. A collaborative spirit is part of our makeup, so you’ll have plenty of resources willing to share, advise or just talk. OUR PROGRAMS Our programs meet you where you are at First Flight propels early-stage science companies through the delivery of comprehensive resources and empowers innovators to transform good ideas into great successes. We use our Runway to Success to meet our companies where they are in their business life cycle to improve their probability of success Download Runaway to success Propeller Pre-Accelerator: Finding the Business Value in New Ideas BARDA DRIVe: Health Security Innovation Funding Pilots Lounge: Elevating New Heights WheelsUP Accelerator Hangar6: Design, Prototype, Take Flight Wingspan: Your Gateway to a Landing in North Carolina LiftOff: Strategic Non-dilutive Funding Navigators: Advisors and Business Mentoring 2022/23 FAST SBIR Funding Program Test Flight: Pitch Practice Learn more about our programs LET’S GET STARTED We have labs, office spaces, programs, and so much more! We are not a real estate company with long term leases. We’re a non-profit with a mission to help you develop your idea, create your prototype, secure grants, launch your business, and in doing so, we create jobs and grow the economy of North Carolina. Our focus is on creating the support you need, not square foot pricing or occupancy rates. Our spaces are affordable and customizable wet labs, offices, power drops, sinks whatever you need. And our flexible leases evolve with you. 25,000 SQUARE FEET OF CONFIGURABLE SPACE LEARN MORE SUPPORT JOB CREATION Support our work. First Flight is a non-profit. We don’t use federal or state funding for sustaining daily operations. Our residents benefit from the expertise and services of a community comprised of corporate service providers for early stage companies, foundations, and individual donors. With our generous supporters, we’re able to meet the ongoing needs of our startups. You can support our mission to advance game-changing technologies and create jobs with donations of time, equipment, resources, and financial gifts. DONATE Click Here to Watch Testimonials Fred Hutchison, Founding Member, Hutchison PLLC We at Hutchison PLLC have been a long-term sponsor of First Flight Venture Center for a variety of reasons. We believe that First Flight is an incredibly important building block… Sunil Mehta, CEO AthemBio AthemBio's path wouldn't have been as seamless if it weren't for the support provided by First Flight Ventures. This organization has offered unparalleled resources to budding… Founder & CEO Michael Shain, President & CEO, OxiHealth Founder & CEO The Propeller program was a great program for OxiHealth at just the right stage in our company’s development. In addition to providing basic business and marketing skills… Founder & CEO OUR PARTNERS FIRST FLIGHT CHAMPIONS OF INNOVATION Without the generous support of these companies and individuals, we would not be able to create & maintain services and programs for early stage companies. DONATE main_banner Welcome To First Flight Our Impact Our community OUR PROGRAMS offices and laboratory our work Lab Space Testimonials CHAMPIONS DONATE Programs WheelsUP Accelerator 2022/23 FAST SBIR Funding Program Propeller Pre-Accelerator Hangar6 LiftOff BARDA DRIVe Navigators Test Flight About Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Navigators Membership Graduates Resources for Startups Sponsorship Meet Our Sponsors Become A Sponsor News Events Member Portal Contact Newsletter Brand Guide First Flight Venture Center 2 Davis Drive, RTP, NC 27709 Hours: Mon- Fri: 8:00-5:00 919.990.8558 | info@ffvcnc.org © Copyright 2025 First Flight Venture Center. All Rights Reserved. Privacy First Flight Venture Center 2 Davis Dr, Durham, NC, 27703, United States 919.990.8558 info@ffvnc.org Hours Mon 8:00-5:00 Tue 8:00-5:00 Wed 8:00-5:00 Thu 8:00-5:00 Fri 8:00-5:00 Sat Closed Sun Closed Newsletter Links Contact donate Privacy"
    },
    {
      "url": "https://keywest.floridaweekly.com/articles/how-damian-deangelis-took-flight-in-key-west/",
      "text": "How Damian DeAngelis took Flight in Key West - Key West Florida Weekly Search for: Search Submit Key West Florida Weekly Key West Home News A&E Events Real Estate Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Obituaries Place An Obituary Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Popular Categories Dining and Entertainment (168) Real Estate (35) Shopping (23) Health and Beauty (20) Professional Services (18) Automotive and Marine (6) Select search type Places Events Search for City or Zip Search Search Search Search {\"hide_search_input\":\"\",\"hide_near_input\":\"\",\"show\":\"\",\"filters_pos\":\"\",\"input_size\":\"\",\"bar_flex_wrap\":\"\",\"bar_flex_wrap_md\":\"\",\"bar_flex_wrap_lg\":\"\",\"input_border\":\"\",\"input_border_opacity\":\"\",\"input_rounded_size\":\"\",\"btn_bg\":\"\",\"btn_rounded_size\":\"\",\"btn_rounded_size_md\":\"\",\"btn_rounded_size_lg\":\"\",\"bg\":\"\",\"mt\":\"\",\"mr\":\"\",\"mb\":3,\"ml\":\"\",\"pt\":\"\",\"pr\":\"\",\"pb\":\"\",\"pl\":\"\",\"border\":\"\",\"rounded\":\"\",\"rounded_size\":\"\",\"rounded_size_md\":\"\",\"rounded_size_lg\":\"\",\"shadow\":\"\",\"css_class\":\"\"} Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Wednesday, September 10, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News A&E What To Do, Where To Go Key West Happy Hours Cuisine Events Add Event Real Estate Special Sections Staycations & Getaways 2024 Breast Cancer 2024 Veterans 2025 Pet Obituaries Place An Obituary How Damian DeAngelis took Flight in Key West By Florida Weekly Staff on December 16, 2021 BY KEVIN ASSAM Florida Weekly Correspondent DEANGELIS You might guess from the style and presentation that the award-winning Bagatelle and Nine One Five restaurants are connected. Still, many may not know that one name in particular unifies both, plus First Flight Island Restaurant and Brewery: Damian DeAngelis. He is a modern success story out of the Key West food and beverage gauntlet. It’s impressive to steadily run one establishment here. But three? And three widely frequented ones at that. In this interview, DeAngelis talks about steadily advancing through the industry, his rationale for acquiring some of the best known island eateries, and creating his increasingly popular and upcoming “Gatsby”-themed New Year’s Eve celebration. What was the most memorable meal you had on the island when you first moved here? DeAngelis: When I moved to town, I was only 21 years old, very new to the restaurant scene, and by no means even close to a foodie. So, what I remember most is just being overwhelmed by the amount of good fresh food, especially seafood, that was available. New food I hadn’t heard of, but is now almost commonplace 19 years later. Things like mahi-mahi, swordfish and conch fritters. It was just so fun to try new things, especially items I knew were from the Keys waters. It really inspired me to get out on the water and explore. I was quick to get dive certified when I moved here. There was just so much to experience. Patrons raise a glass at First Flight, situated in the original Pan Am building in Key West. What prompted the move? How did you make it work early on? DeAngelis: That’s a fun story really. Myself and three friends got an old RV back home in New Hampshire. We did a little work to it — changed the tires and spark plugs, packed up, and decided to head as far south as we could. So, down Route 95 all the way to U.S. 1 and ended up in Key West a few days later. What was supposed to just be a quick few weeks turned into a four-month trip. All four of us lived out of the RV and found odd jobs in Key West. My first job was renting jet skis. What a perfect job for a young kid from New Hampshire. I had never even ridden a jet ski before that. Damian DeAngelis focuses on locally sourced seafood at First Flight. LEFT: Pan-seared diver scallops, chorizo-pesto risotto, sweet corn salsa. RIGHT: Grouper. After the four months in the RV we decided to take it back to New Hampshire. It wasn’t even a year later that three out of the four of us decided to make the permanent move back down and see what Key West had to offer. At what point did you start thinking about working in food and beverage? What were your favorite spots back then? DeAngelis: After taking the RV back to NH, then deciding to officially make the move to Key West, when I returned, my jet ski job was no longer available. I had no interest really in getting a food and beverage job. However, I was young and needed some money. So, I saw a brewery on the corner of Whitehead and Caroline Street, which I now own. Back then it was called Kelly’s Caribbean. They took me in as a green server, totally new to the restaurant business. I fell in love! And quickly excelled to bartender, then manager. My friends and I were still so new to the restaurants, so we liked the casual atmospheres. We liked Caroline’s Café, right on Duval. Jack Flats for sporting games and good bar food. There used to be an Irish restaurant called Finnegan’s Wake. That was a great hangout, too. How difficult was it to make the jump from manager to owner here? Brick and mortar business owners in particular often talk about how challenging that process can be in Key West. DeAngelis: The process to acquire your own place in Key West is definitely not easy. But if you are determined and put you mind to it, anything can be done. After running the food and beverage program at the Southernmost Hotel for about seven years, I realized it was time to move on. I was confident in all I had learned and was ready for a place of my own. I was lucky enough to get some word of mouth insight that Bagatelle was available. First Flight will host a 1920s Gatsby-style New Year’s Eve party this year. COURTESY PHOTOS Again really anything can be done. I have a great friend who is also my business partner, Tom Boles. He and I reached out to Bagatelle ownership, and through a few months of back and forth negotiations we were able to strike a deal. As the operating partner, once I was in there, I knew there was a lot of work ahead. Buying a restaurant isn’t cheap, especially in Key West. So, there was a lot to lose for sure. But hard work, focusing on quality food and beverage as well as upgrading décor, advertising, and of course exceptional customer service [made] Bagatelle a quick success. Is opening a restaurant or small business in Key West anything you would advise someone to do today given the past few years? DeAngelis: Easily said. Absolutely! It won’t be easy. There are staffing issues, real estate is expensive, and food costs are higher than they have ever been. But, if someone feels confident and they are following their dreams, I would never want someone to hold back. How did you decide that one restaurant was not enough? What came next? DeAngelis: It just kind of came naturally. I had been running Bagatelle for about two years. I had a great management team in place. I knew if something came up, I would be able to dedicate time without Bagatelle suffering. I had heard through word of mouth that Nine One Five may be available for purchase. I called the owner Stuart Kemp. It took a few months, but we were able to work out a great deal. I also felt like Nine One Five was a great fit, complementing Bagatelle without competing directly. That brings us to First Flight. How much of a departure is it from the other two restaurants? Is it the one you always had your eye on? DeAngelis: I wouldn’t say any of the restaurants cause a departure from the others. But it, too, is a great complement to the trio. I definitely have always loved the First Flight property, from way back when I worked there. I also have a natural connection, with it being the first property I ever worked in the restaurant industry. So, yes it has always been on my radar for sure! Were you ever at serious risk of losing one or more of your restaurants during the pandemic and subsequent shut downs? How did you keep your businesses afloat? DeAngelis: The onset of COVID was without a doubt the toughest and scariest time of my 15-plus years running restaurants with the shut down and so much unknowns. When will we reopen? How long will the roadblock at the top of the Keys stay in place? Will we ever have mass tourist events again and so on. So, of course along with those thoughts, comes how much can we withstand before considering closing for good. But, luckily, Florida bounced back quick. My restaurants have a pretty solid reputation so, once the doors were open, guests were there and ready to dine. We kept the businesses afloat by just being smart. Running limited menus with limited staff so we could reopen with cost controls. We then grew our staff and menus as we saw volume increase. Why develop First Flight into a New Year’s Eve destination? DeAngelis: My team and I came up with that concept. Key West has an abundance of great parties. Where you can stand shoulder to shoulder. Or in the street with a drink in a plastic cup. But there really is not a party, where you can dress up, feel exclusive and have a throwback style formal New Year’s Eve party to ring in the new year. We thought that with the history of Pan Am in the ’20s and the layout of our property with the two-story balconies and the large garden, let’s bring a roaring ’20s Gatsby-style party to Key West. Where the guest list is limited to allow plenty of elbow room. Space for guests to dress up and feel special. As well as excellent food and beverage, like oysters and filet mignon. Then we thought, let’s add a throwback band and décor, and have ourselves Key West’s only Gatsby party. On top of that, guests are a few steps away from Duval to keep the party going after midnight should they choose. Additionally, with the history of Pan Am, we thought, we needed to drop something at midnight. So, we had a local artist design a replica Pan Am plane that we attach to a lift and land at midnight. It all came together to create a one of a kind party! Any particularly memorable moments from past NYE events at First Flight? DeAngelis: Lots of great memories! We have a photo booth, so there are lots of fun people taking pictures. We put a ‘stewardess’ in the plane when it lands and that’s really fun. But the best memory is definitely the very first year we did it. I got a call from CNN and they wanted to feature us on the newscast. So, I waited with the news anchor watching the TV as Anderson Cooper introduced us! We then got to show the world First Flight’s very first Gatsby party! Sides The Atlantic or Gulf side of Key West? Both are beautiful. Gulf side if boating or joy riding. Atlantic for fishing. Favorite local cause? Sister Season is great! It supports the service industry when they fall on hard times like an injury causing [unemployment]. Best advice for new residents of the island? Enjoy and explore. So much to do in this beautiful town. Don’t get stuck at the same old watering holes. Dish you crave the most from New Hampshire? Lobster! Nothing beats fresh Maine Lobster. ¦ — Interview has been edited and condensed for clarity. 2 responses to “How Damian DeAngelis took Flight in Key West” Jeannine Hamel says: December 20, 2021 at 10:34 am Great people, Awesome food, Good times!!! Reply Bob and Lynda Frechette says: July 23, 2022 at 6:02 am Damian is the quintessential restaurant owner to his core and makes each of his restaurants a excellent place for food and fun. Best of the best in Key West! Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty Δ Loading Contact Us! Click Here for Our Offices Home Map It Out Arts and Entertainment News What To Do Where To Go Events Real Estate Business Directory Past Print Editions Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://firstflightkw.com/",
      "text": "First Flight Island Restaurant & Brewery 0 Skip to Content Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Folder: Menus Back From The Kitchen Happy Hour Drinks Online Ordering Brewery Folder: Events Back Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop The Brewery Try our original beers brewed right on the property. Learn More Weddings & Events There are a variety of private event venue options for groups of all sizes at First Flight. Book Today Menus Open Daily for Lunch & Dinner, including Happy Hour from 4-6pm. View Menus Order Online for Pickup First Flight Island Restaurant & Brewery Located at 301 Whitehead St., on the corner of Whitehead and Caroline, stands one of Key West’s most impressive and historic buildings – First Flight. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Pan Am was the principal and largest international air carriers in the United States from 1927 until its collapse on December 4, 1991. Founded in 1927 as a scheduled air mail and passenger service operating between Key West, Florida and Havana, Cuba, the airline became a major company credited with many innovations that shaped the international airline industry, including the widespread use of jet aircraft, jumbo jets and computerized reservation systems. Garden Canopy Dining First Flight's main level includes soaring trees that arch and create a living canopy in the main garden by day and sparkle with lights at night. Off the main red-bricked garden and behind French doors lies the Southernmost Brewery in the USA. The famous Crash Bar, so named for the Sikorsky sea plane plunging through the ceiling, provides a unique drinking surface – an aluminum wing – and is located off the main garden. The second floor Tree-Top Deck is nestled in the tree-tops, it provides a view of the lower Main Garden dining area and of Whitehead Street. Both areas are great for celebrations of all kinds – your wedding party or travel group are welcome! Slide 1 Slide 1 (current slide) Slide 2 Slide 2 (current slide) Slide 3 Slide 3 (current slide) About First Flight Island Restaurant & Brewery is located in the heart of downtown Key West, Florida. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Accessibility Location + Hours 305-293-8484 301 Whitehead St Key West, FL 33040 Open Daily Lunch 11am - 4pm Dinner 4 - 10pm Happy Hour 4 - 6pm (Must be 21 or older in bar area.) Visit Our Sister Restaurants © 2024 First Flight Island Restaurant & Brewery | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://firstflightkw.com/dinner",
      "text": "From The Kitchen — First Flight Island Restaurant & Brewery 0 Skip to Content Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Folder: Menus Back From The Kitchen Happy Hour Drinks Online Ordering Brewery Folder: Events Back Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Kitchen Creations 11am - 10pm Daily Make A Reservation HAPPY HOUR DRINKS * Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs, may increase your risk of food borne illness About First Flight Island Restaurant & Brewery is located in the heart of downtown Key West, Florida. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Accessibility Location + Hours 305-293-8484 301 Whitehead St Key West, FL 33040 Open Daily Lunch 11am - 4pm Dinner 4 - 10pm Happy Hour 4 - 6pm (Must be 21 or older in bar area.) Visit Our Sister Restaurants © 2024 First Flight Island Restaurant & Brewery | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://firstflightkw.com/drinks",
      "text": "Drinks — First Flight Island Restaurant & Brewery 0 Skip to Content Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Folder: Menus Back From The Kitchen Happy Hour Drinks Online Ordering Brewery Folder: Events Back Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Drinks Menu 11am - 10pm  Daily  |  Brewery Open Until 10pm  |  Garden Dining Until 10pm Make A Reservation DINNER HAPPY HOUR LUNCH Wine availability and prices are subject to change. Brut Charles Lafitte - France Rosé Charles Lafitte - France Prosecco La Marca - Split - Veneto - Italy Rosé Studio by Miraval - France Chardonnay “A” by Acacia - Unoaked - California Chardonnay Wente - Central Coast - California Sauvignon Blanc Emmolo - Central Coast - California Sauvignon Blanc The Crossings - Marlborough - New Zealand Albarino Atlantik - Rios Baixas - Spain Pinot Grigio Tiziano - Delle Venezia - Italy Riesling Kung Fu Girl - Washington Pinot Noir Parker Station - California Pinot Noir Growers Guild - Willamette Valley - Oregon Tempranillo Campo Viejo - Spain Merlot Frei Brothers - Dry Creek Valley - California Malbec Tinto Negro - Mendoza - Argentina Cabernet Silver Palm - North Coast - California Cabernet Wente - Napa Valley - California 10oz   /  16oz Sunset Clipper - Citrus Wheat Clean & crisp with aromas of grapefruit & coriander. Using fresh Florida citrus peels to create a perfectly Old Havana Red - Amber Ale A rich amber ale in color, yet refreshing on the palate, with hints of roasted chocolate Captain Maverick IPA A medium pale ale, using our specialty blend of unique malts, grains and hops, to create a perfect Beer-A-Rita First Flight Wheat, on the rocks, Sauza Silver Tequila, Splash of lime, Salt rim Brass Monkey Muddled orange and lemon, Jim Beam, First Flight Wheat beer, orange bitters Summer Shandy First Flight Endless summer wheat, muddled lemonade, sprits of club soda Bermuda Triangle Hendrix gin, St Germain elderflower, lemon, sparkling rose Woodford Wingman Woodford Reserve, Chamboard, cranberry juice, bitters The \"Mile High\" Stoli Elit, perfectly dirty, blue cheese olives Espresso House espresso, Sobieski vanilla vodka, Kahlua Banana Daiquiri Rum Haven coconut rum, banana liqueur, coconut puree, pineapple juice, squeeze of lime Key Lime Sobieski vanilla vodka, key lime liqueur, fresh lime, vanilla cream Salty Stewardess Titos handmade vodka, grapefruit, salted rim The 007 Deep Eddy orange vodka, orange juice, 7up Havana Mojito Havana club anejo blanco rum, muddled mint & lime, simple syrup, club soda Pilots Paloma Milagro silver tequila, grapefruit, club soda Tennessee Tea Jack Daniels, fresh lemon, peach puree, home brewed tea Grapefruit Cooler Ford's gin, muddled cucumber, fresh squeezed grapefruit juice, splash of club soda Strawberry Lime-Ade Absolut vodka, lime juice & muddled strawberry Pusser's Painkiller An island original! Pusser's british navy rum, cream of coconut, orange juice, pineapple juice, shaved nutmeg Queens Mule Whitley Neill ginger-rhubarb gin, lime juice, ginger beer Margaritas The First Flight Barrel aged Herradura reposado, agave, fresh lime, orange slice, salt or no salt Key Lime Sauza tequila, key lime liqueur, agave, lime juice The Skinny Milagro silver tequila, agave, fresh lime, hold the salt Spicy Sunrise Dolce Vida pineapple-jalapeno tequila, agave, fresh lime, splash of grenadine Craft Bottles / Cans Grapefruit Radler Stiegl - Austria - 2.5% ABV Perry Hard Cider ACE - California - 5% ABV Tropical Pale Ale Boulevard - Missouri - 5.9% ABV All Day IPA Founders - Michigan - 4.7% ABV La Rubia Blonde Ale Wynwood Brewing - Florida - 5.0% ABV 60 Minute IPA Dogfish Head - Delaware - 6% ABV Pops Porter Wynwood Brewing - Florida - 6.2% ABV Additional Favorites on Tap Spearfish Amber FL Keys Brewing - Florida Keys - 5.5% ABV Iguana Bait FL Keys Brewing - Florida Keys - 5.1% ABV Tampa Style Lager Cigar City Brewing - Tampa - Florida - 4.5% ABV Hop Gun IPA Funky Buddha Brewing - Oakland Park - Florida - 7% ABV Floridian Wheat Funky Buddha Brewing - Oakland Park - Florida - 5.2% ABV Breakfast Stout Founders Brewing - Michigan - 8.3% ABV Dales Pale Ale Oskar Blues Brewing - Colorado - 6.5% ABV Classic Bottles Yuengling Lager - Pennsylvania - 4.5% ABV Stella Artois Pale Lager - Belgium - 5% ABV Corona Extra / Light Pale Lager - Mexico - 4.5% / 4.3% ABV Menu selection and prices are subject to change. About First Flight Island Restaurant & Brewery is located in the heart of downtown Key West, Florida. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Accessibility Location + Hours 305-293-8484 301 Whitehead St Key West, FL 33040 Open Daily Lunch 11am - 4pm Dinner 4 - 10pm Happy Hour 4 - 6pm (Must be 21 or older in bar area.) Visit Our Sister Restaurants © 2024 First Flight Island Restaurant & Brewery | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://firstflightkw.com/happy-hour",
      "text": "Happy Hour — First Flight Island Restaurant & Brewery 0 Skip to Content Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Folder: Menus Back From The Kitchen Happy Hour Drinks Online Ordering Brewery Folder: Events Back Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Happy Hour Happy Hour 4-6pm Daily at the Crash Bar (Must be 21 or older in bar area.) Make A Reservation DINNER LUNCH DRINKS $4 / Pint Premium Well Spirits 6 Strawberry Limeade 6 Captain’s Punch 6 Classic Margarita 6 Key Lime Margarita 6 $6 / Glass Sparkling – Brut or Rose Pinot Grigio Sauvignon Blanc Chardonnay Pinot Noir Malbec Cabernet Pretzel Bites 7 toasted bites with warm beer cheese Chef’s Daily Hummus 6 chef selection with veggies and tortilla Deviled Eggs with Fried Jalapeños 6 Cone of Fries with Cajun Aioli 6 House Smoked Fish Dip 9 veggies and tortilla Fried Ravioli 8 hand battered, warm marinara Beef Brisket Mac & Cheese 9 cavatappi pasta, three cheese blend, braised beef brisket Confit Chicken Wings (breaded or not)  8 Choice of: Buffalo / Thai Chili / Old Bay Butter / Jamaican Jerk About First Flight Island Restaurant & Brewery is located in the heart of downtown Key West, Florida. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Accessibility Location + Hours 305-293-8484 301 Whitehead St Key West, FL 33040 Open Daily Lunch 11am - 4pm Dinner 4 - 10pm Happy Hour 4 - 6pm (Must be 21 or older in bar area.) Visit Our Sister Restaurants © 2024 First Flight Island Restaurant & Brewery | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://firstflightkw.com/contact",
      "text": "Contact — First Flight Island Restaurant & Brewery 0 Skip to Content Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Menus From The Kitchen Happy Hour Drinks Online Ordering Brewery Events Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Open Menu Close Menu Home Folder: Menus Back From The Kitchen Happy Hour Drinks Online Ordering Brewery Folder: Events Back Fantasy Fest Viewing Party 2025 NYE Great Gatsby Party Brews & Bites Weddings & Private Events Gallery Contact Shop Visit Us 301 Whitehead Street Key West, FL 33040 305-293-8484 Open Daily  11am - 10pm Happy Hour  4 - 6pm Limited Menu. Bar is now open! Book Your Next Event at First Flight About First Flight Island Restaurant & Brewery is located in the heart of downtown Key West, Florida. Well known for being the birthplace of Pan American World Airways, Pan-Am’s first tickets were sold out of this very building in 1927. Accessibility Location + Hours 305-293-8484 301 Whitehead St Key West, FL 33040 Open Daily Lunch 11am - 4pm Dinner 4 - 10pm Happy Hour 4 - 6pm (Must be 21 or older in bar area.) Visit Our Sister Restaurants © 2024 First Flight Island Restaurant & Brewery | Design & Development by Wonderdog Studios"
    },
    {
      "url": "https://thekeywester.com/blog/first-flight-island-restaurant-brewery/",
      "text": "First Flight Island Restaurant & Brewery - The Key Wester Skip to content The Key Wester Things To Do Sandbar Trips Sunset Sailing Key West Fishing Fish Species Calendar Deep Sea Fishing Backcountry Fishing Snorkel Fish Combo Flats Fishing Split Charters Dry Tortugas Watersports Places To Stay Top Ten Places Events Restaurants Top Ten Restaurants Restaurant Reviews Key West Recipes Best Restaurants Best Bars Toggle website search Menu Close Things To Do Sandbar Trips Sunset Sailing Key West Fishing Fish Species Calendar Deep Sea Fishing Backcountry Fishing Snorkel Fish Combo Flats Fishing Split Charters Dry Tortugas Watersports Places To Stay Top Ten Places Events Restaurants Top Ten Restaurants Restaurant Reviews Key West Recipes Best Restaurants Best Bars Toggle website search First Flight Island Restaurant & Brewery Home > Key West Restaurant Reviews > First Flight Island Restaurant & Brewery First Flight Island Restaurant & Brewery November 14, 2018 Island Genn The outside of First Flight original home to Pan American Airways My husband and I had some business downtown to deal with the other day, and being close to dinner time, we decided to grab a bite someplace. Since we on Whitehead Street and had not been to Kelly’s Caribbean since it changed hands and became First Flight, we decided to give it a try. When we entered the restaurant, we were told that there would be an event later on that evening so they only had seating available upstairs. We followed the greeter up the steep stairs, past the bar, and onto a patio overlooking the area being set up for the event later on that evening. While I had been upstairs before for other events, the area was now quite lacking and the music was very loud. However, we thought that we would make a go of the evening there anyway. Looking over the menu, we were very surprised by the pricing. Everything was very pricey, and while I do not mind paying for great food, service, and atmosphere, the atmosphere and so far was lacking. And the waitress was quite pushy, so they already had two strikes. We were hoping the food would be worth it. Upstairs dining area of First Flight We finally placed our order. My husband ordered the chicken wings to start and the seafood linguine for his main meal. I ordered the fries and the black and blue salad. While we were waiting, two groups of people were seated near us. I think that they too did not dig the vibe as they were visually upset. One lady even said, “this is not the atmosphere that I was expecting here.”  Both groups ended up leaving without ordering anything. Just before they brought out our appetizers, the music went berserk, the sound system obviously being tested for the event. It was extremely annoying and not good for a relaxing dinner experience. At this point, we decided that we had had enough and we asked the waitress to please cancel the rest of our order as we really were not enjoying ourselves at all and we wanted to try and salvage our evening out. Since the waitress had just brought out our appetizers, we did eat those. My fries were delicious, but the wings were horribly overcooked and the sauce that came with them was awful tasting. I really cannot even describe it. Since we only had water and the two appetizers, we paid the $20 bill and headed out for ice cream to lift our spirits. This was such a disappointing Key West dining experience that I do not think that we will come back here again, even if there is no event happening. I would say that if you only wanting a beer and some fries and are into history, it may not be a bad place to visit. After all, it was run by Top Gun actress Kelly McGillis for years and many years before that it was the home to Pam Am Airlines. But I would avoid for a nice meal out on the town. Before deciding where to eat while you are visiting Key West or the rest of the Florida Keys, be sure to read my restaurant reviews ; check out our restaurant review section of this blog. To see what is happening on the island during your visit, check out our Key West Events Calendar to see other upcoming special events. And for more information about the fun side of Key West… things to do and see in our island city, go to our Key West Web Site . Feel free to Email Me if you have any questions about Key West!! Island Genn – Your Key West Concierge Island Genn See Full Bio Previous Next Share the Post: Related Posts Lolita’s Coastal Cocina Recently opened at the Opal Key West Resort & Marina, Lolita’s Coastal Cocina menu is filled with Mexican fare and Read More Broil – Restaurant Review 2025 Update Our Broil restaurant review 2025 update is here! Since our first visit back in 2022, my husband and Read More Join Our Newsletter Full Name Email Submit Text Us 1-786-847-3808 Blog Categories Blog Categories Select Category Activities Fishing History Island Genn’s Key West Recipes Key West Events Key West General Information Key West Restaurant Reviews Food Trucks Hook And Cook Your Catch Key West Ethnic Restaurant Reviews Key West Fine Dining Restaurant Reviews Key West Pizza Restaurants Key West Seafood Restaurant Reviews Steak Houses Uncategorized Our Latest Posts Lolita’s Coastal Cocina Broil – Restaurant Review Key West Restaurant Vacation Closures 2025 Key West Museums A&B Lobster House: Review Visit Key West Things To Do Sandbar Trips Sunset Sailing Key West Fishing Fish Species Calendar Deep Sea Fishing Backcountry Fishing Snorkel Fish Combo Flats Fishing Split Charters Dry Tortugas Watersports Places To Stay Top Ten Places Events Restaurants Top Ten Restaurants Restaurant Reviews Key West Recipes Best Restaurants Best Bars About Key West Activities Fishing Charters Fishing Reports Gens Restaurant Reviews Key West Events Key West Information Water Sports Older Posts Older Posts Select Month September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 September 2022 August 2022 July 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 March 2020 February 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 April 2019 February 2019 January 2019 December 2018 November 2018 October 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 July 2017 June 2017 May 2017 April 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 Activities History All Images and Text are property of The Keys To Key West Inc."
    },
    {
      "url": "https://www.ffvcnc.org/meet-our-team",
      "text": "First Flight Venture Center — Meet Our Team About Programs Hangar6 Membership Graduates Resources for Startups Signature Events Sponsorships News AgBio + AgTech Events Member Portal Contact Donate Back Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Meet Our Navigators Meet Our Resident Companies Back Our Programs 2024/25 FAST SBIR Funding Program BARDA DRIVe: Health Security Innovation Funding Business Incubator Captain's Circle Itineraries: Science Talk LiftOff: Strategic Non-dilutive Funding Navigators: Advisors and Business Mentoring Pilots Lounge Propeller Pre-Accelerator: Finding the Business Value in New Ideas Test Flight: Pitch Practice WheelsUP Accelerator Wingspan Back 2025 High Flyer Award Luncheon 2025 BBQ, Brews & Band 2025 March Madness Open House 2024 High Flyer Award Luncheon 2024 Boil, Brews & Band 2024 March Madness Open House Back Meet Our Sponsors Become a Sponsor About Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Meet Our Navigators Meet Our Resident Companies Programs Our Programs 2024/25 FAST SBIR Funding Program BARDA DRIVe: Health Security Innovation Funding Business Incubator Captain's Circle Itineraries: Science Talk LiftOff: Strategic Non-dilutive Funding Navigators: Advisors and Business Mentoring Pilots Lounge Propeller Pre-Accelerator: Finding the Business Value in New Ideas Test Flight: Pitch Practice WheelsUP Accelerator Wingspan Hangar6 Membership Graduates Resources for Startups Signature Events 2025 High Flyer Award Luncheon 2025 BBQ, Brews & Band 2025 March Madness Open House 2024 High Flyer Award Luncheon 2024 Boil, Brews & Band 2024 March Madness Open House Sponsorships Meet Our Sponsors Become a Sponsor News AgBio + AgTech NC PREMIER RESEARCH INCUBATOR Events Member Portal Contact Donate MEET OUR TEAM First Flight is more than just office or lab space for early stage companies. Our in-house leadership and support staff, board, navigators, executives-in-residence advisors, resident companies, and First Flight alumni combine to create a unique community for science and technology innovation. Our Community Includes: -        Entrepreneurs with first-hand experience in launching a company. -        Strategic thinkers and marketers. -        Grant writing experts. -        Design experts for prototyping. -        Financial and legal experts. -        Program managers. Our doors are always open. There’s coffee in the pot, advice at the ready, and a sympathetic ear when you need one. FIRST FLIGHT VENTURE CENTER IN-HOUSE TEAM Featured CEO & President Krista Covey CEO & President CEO & President Ecosystem Development Director Andrea Conner Ecosystem Development Director Ecosystem Development Director Director of Hangar6 Ben Provan Director of Hangar6 Director of Hangar6 Director of Operations Emmit Owens Director of Operations Director of Operations Program Director Balaji Vasudevan, Ph.D. Program Director Program Director Program Manager Ashley Davis Program Manager Program Manager Community/Facility Manager Darlene Bascombe Community/Facility Manager Community/Facility Manager Marketing Colleen Lozano Marketing Marketing Controller Kathy Morris Controller Controller Program Facilitator Danielle Galmore Program Facilitator Program Facilitator Administration Support Anne Schwab Administration Support Administration Support Program Facilitator Jennifer Murray Program Facilitator Program Facilitator DONATE Programs WheelsUP Accelerator 2022/23 FAST SBIR Funding Program Propeller Pre-Accelerator Hangar6 LiftOff BARDA DRIVe Navigators Test Flight About Our Story Why First Flight? Impact Reports Meet Our Team Board of Directors Navigators Membership Graduates Resources for Startups Sponsorship Meet Our Sponsors Become A Sponsor News Events Member Portal Contact Newsletter Brand Guide First Flight Venture Center 2 Davis Drive, RTP, NC 27709 Hours: Mon- Fri: 8:00-5:00 919.990.8558 | info@ffvcnc.org © Copyright 2025 First Flight Venture Center. All Rights Reserved. Privacy First Flight Venture Center 2 Davis Dr, Durham, NC, 27703, United States 919.990.8558 info@ffvnc.org Hours Mon 8:00-5:00 Tue 8:00-5:00 Wed 8:00-5:00 Thu 8:00-5:00 Fri 8:00-5:00 Sat Closed Sun Closed Newsletter Links Contact donate Privacy"
    },
    {
      "url": "https://www.snapchat.com/place/first-flight-island-restaurant-brewery/61c81cc0-9993-11e8-b886-176ca5208911",
      "text": "First Flight Island Restaurant & Brewery Features Stories Spotlight Lenses Accounts Snapchat Plus Support Ads Download Cookie Policy Privacy Policy Consumer Health Privacy Privacy and Safety Your Privacy Choices Language العَرَبِية বাংলা(বাংলাদেশ) বাংলা (ভারত) Dansk Deutsch Ελληνικά English (UK) English (US) Español Español (Argentine) Español (España) Español (México) Suomi Filipino Français ગુજરાતી हिंदी Bahasa Indonesia Italiano 日本語 ಕನ್ನಡ (India) 한국어 മലയാളം मराठी Bahasa Melayu Norsk Nederlands ਪੰਜਾਬੀ Polski Português (Brasil) Português (Portugal) Română Русский Svenska தமிழ் తెలుగు ภาษาไทย (ประเทศไทย) Türkçe اردو Tiếng Việt 中文（简体） 中文（繁體） Explore More Sites Business For Business Ads Manager Snap Publisher Business Support Public Profiles for Business Snap AR Business Lens Studio Lens Web Builder Camera Kit Pixy Shop Pixy Pixy Support Snap Inc. Snap Inc. Investors Careers News Safety & Impact CitizenSnap Bitmoji Creators Creator Hub Post to Spotlight Developers For Developers PlayCanvas Marketing API Spectacles Spectacles Creators Spectacles Support Watch Snapchat Stories Historias Watch Snapchat Spotlight videos Spotlight Try the new Snapchat on web to chat Chatear Try out Lenses and Filters on Snapchat Lentes Try out Snapchat+ Snapchat+ Snapchat.com Resumen Cuentas Snapchat+ Ayuda Privacidad y seguridad Tus opciones de privacidad Privacidad de la salud de los consumidores Empresa Para empresas Administrador de anuncios Ayuda a empresas Snap AR Lens Studio Creador Para creadores Desarrolladores Para desarrolladores Playcanvas Spectacles Resumen Creador Spectacles Ayuda Descargar United States / Florida / Key West / First Flight Island Restaurant & Brewery First Flight Island Restaurant & Brewery $$ $ Cerrado 726 calificaciones 🥰 Date Night 🍸 Good Drinks 🍾 Special Occasions 🏠 Family Friendly Historias Arturo Robles 6/23/2025 6/15/2025 Brian Kell 5/31/2025 Brian Kell 5/31/2025 Brian Kell 5/31/2025 B 2/15/2025 10/23/2024 2/4/2024 Jessie hart 1/20/2024 Jessie hart 1/20/2024 Jessie hart 1/20/2024 1/11/2024 1/11/2024 1/11/2024 1/11/2024 1/11/2024 Dirección 301 Whitehead St, Key West, Florida Copiar enlace Llamar (305) 293-8484 Copiar enlace Sitio web firstflightkw.com Cerrado Monday - Saturday 11:00 - 23:00 Mon Tue Wed Thu Fri Sat Sun Reseñas Tripadvisor 07/14/2022 la cerveza es muy buena y barata. la comida es bastante buena teniendo en cuenta lo barato que era en la hora feliz. buen lugar para tomar una copa y un aperitivo sin pagar demasiado dinero. You May Also Like Sloppy Joe's Food Co. Restaurant Cerrado Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Dawn 9/7/2025 Hollie 9/1/2025 Hollie 9/1/2025 Hidden Jem 8/31/2025 8/29/2025 Blanca💖 8/28/2025 Momma Sandwisch 8/24/2025 Momma Sandwisch 8/24/2025 Courtney 8/23/2025 Sherry 8/10/2025 Sherry 8/10/2025 Sherry 8/8/2025 8/7/2025 Taco Express Mexican Restaurant Colby B 7/31/2024 Moondog Cafe & Bakery American Restaurant $$ $ Cerrado 8/14/2025 6/30/2025 Mary Alice Says 5/26/2025 Tammy 5/11/2025 Irene 🤘🏽 5/3/2025 Lauren Adamek Gibbons 3/7/2025 Lauren Adamek Gibbons 3/7/2025 2/23/2025 Mary Ellen's Bar & Kitchen Bar $ $$ Abierto ahora Fred Fontana 8/29/2025 yeppersshaw 6/29/2025 yeppersshaw 6/29/2025 yeppersshaw 6/29/2025 yeppersshaw 6/29/2025"
    }
  ]
}