{
  "fuentes": [
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "info@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "crown@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "exmoutharms@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "greenman@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "queenshead@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "roseandcrown@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "steamengine@publove.co.uk"
    },
    {
      "url": "https://www.publove.co.uk/contact",
      "email": "whiteferry@publove.co.uk"
    },
    {
      "url": "https://brewfactory.com.au/contact-us/",
      "email": "brewfactory@outlook.com"
    },
    {
      "url": "https://rivertrailbeerworks.com/about/our-team/",
      "email": "info@rivertrailbeerworks.com"
    },
    {
      "url": "https://wilmingtonbrewworks.com/about-wilmington-brew-works/who-we-are/",
      "email": "playfullyeasilyartboard-1@2x-e1596478082265.png"
    },
    {
      "url": "https://www.lovelanebrewery.com/",
      "email": "info@lovelanebrewery.com"
    },
    {
      "url": "https://www.lovelanebrewery.com/",
      "email": "rod@tjmbrewing.com"
    },
    {
      "url": "https://absolutebeer.com/breweries/first-love-brewing/",
      "email": "contact@absolutebeer.com"
    },
    {
      "url": "https://loveyourpub.co.uk/contact-us/",
      "email": "info@loveyourpub.co.uk"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/",
      "email": "applepodcasts-icon@2x.d8701eb5b99b.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/",
      "email": "castro-icon@2x.4b308ef39665.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/",
      "email": "rss-icon@2x.106f007438c6.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/",
      "email": "spotify-icon@2x.d6a55c3ea35a.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/about/",
      "email": "applepodcasts-icon@2x.d8701eb5b99b.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/about/",
      "email": "castro-icon@2x.4b308ef39665.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/about/",
      "email": "rss-icon@2x.106f007438c6.png"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/about/",
      "email": "spotify-icon@2x.d6a55c3ea35a.png"
    },
    {
      "url": "https://brewerschoice.net.au/contactus/",
      "email": "sales@brewerschoice.net.au"
    },
    {
      "url": "https://brewerschoice.net.au/contactus/",
      "email": "sales@brewerschoice.net.au"
    }
  ],
  "mails": [
    "applepodcasts-icon@2x.d8701eb5b99b.png",
    "brewfactory@outlook.com",
    "castro-icon@2x.4b308ef39665.png",
    "contact@absolutebeer.com",
    "crown@publove.co.uk",
    "exmoutharms@publove.co.uk",
    "greenman@publove.co.uk",
    "info@lovelanebrewery.com",
    "info@loveyourpub.co.uk",
    "info@publove.co.uk",
    "info@rivertrailbeerworks.com",
    "playfullyeasilyartboard-1@2x-e1596478082265.png",
    "queenshead@publove.co.uk",
    "rod@tjmbrewing.com",
    "roseandcrown@publove.co.uk",
    "rss-icon@2x.106f007438c6.png",
    "sales@brewerschoice.net.au",
    "spotify-icon@2x.d6a55c3ea35a.png",
    "steamengine@publove.co.uk",
    "whiteferry@publove.co.uk"
  ],
  "nombre_sitio": "firstlovebrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.publove.co.uk/contact",
      "text": "Get in Touch - Contact - PubLove Book a stay Book a stay Book a table Book a table Pubs Pubs Hostels Hostels Food & Drink Food & Drink Book a stay Book a stay Book a table Book a table pubs pubs Food & Drink Food & Drink Burger Craft Burger Craft Hostels Hostels Group Bookings Group Bookings Loyalty Loyalty Contact Contact Queens Head queenshead@publove.co.uk Head Office Info@publove.co.uk The Crown crown@publove.co.uk White Ferry House whiteferry@publove.co.uk Rose & Crown roseandcrown@publove.co.uk Steam Engine steamengine@publove.co.uk Exmouth Arms exmoutharms@publove.co.uk Green Man greenman@publove.co.uk Get in touch Weâre always happy to help. First, check our Frequently Asked Questions for quick answers. For further inquiries, contact us directly. Whether you have questions about our services or anything else, weâre here to assist. Contact* Link 1 Clear section Contact* This form collects your name, email and content so that we can keep track our visitors on the website. For more info, check out our privacy policy . I agree to the privacy policy. Thank you! Your message has been received! Oops! Something went wrong while submitting the form. Pubs Pubs Hostels Hostels Food & Drink Food & Drink Pubs Events & Offers Events & Offers Burger Craft Burger Craft Live Sport Live Sport Hostels Group Bookings Group Bookings Discover London Discover London FAQs FAQs Publove Loyalty Loyalty Careers Careers Contact Contact Feedback Feedback Cookie Preferences Cookie Preferences Terms & conditions Terms & conditions Privacy policy Privacy policy Â© 2024 PubLove"
    },
    {
      "url": "https://brewfactory.com.au/contact-us/",
      "text": "Contact Brew Factory | Get in Touch Today in Adelaide SA Skip to content Phone: (08) 8258 2337 Email: brewfactory@outlook.com Instagram Facebook Twitter Home About us The Brewing Process The Canning Process Kegging Systems Contact Us Home About us The Brewing Process The Canning Process Kegging Systems Contact Us Beer Range Beer Info Gallery MENU PDF Beer Range Beer Info Gallery MENU PDF Contact Us Commercial Quality Beer at Half the Price!! Growler Club We have a growler club on the second Thursday of every month. To join, please contact us on 82582337 to have your name added to the list Contact Us Get In Touch With Us Phone (08) 8258 2337 Mobile Allan: 0421 379 522 Moana: 0400 274 817 Email brewfactory@outlook.com Address 25 Beafield Road\nPara Hills West SA 5096 Contact Form Name Email Phone Subject Message Send Message Instagram Facebook Twitter Instagram Facebook Twitter Home About us Contact Us Menu PDF Home About us Contact Us Menu PDF Beer Range Beer Info Gallery MENU PDF Beer Range Beer Info Gallery MENU PDF Contact us (08) 8258 2337 brewfactory@outlook.com 25 Beafield Road Para Hills West SA 5096 © 2023 Brew Factory  All rights reserved.   Designed & Developed by Web Tech Mind Instagram Facebook Twitter Home About us The Brewing Process The Canning Process Kegging Systems Contact Us Beer Range Beer Info Gallery Home About us The Brewing Process The Canning Process Kegging Systems Contact Us Beer Range Beer Info Gallery Step 1: Choose your favourite beer style"
    },
    {
      "url": "https://rivertrailbeerworks.com/about/our-team/",
      "text": "Our Team | RiverTrail Beerworks Skip to content About Expand Our Team Photo Gallery Store Expand Beer Gift Card Golf Clothing Hats Glassware Stickers Gifts Beer Expand On Tap Carry Our Beer Menu Expand Menu On Tap Order Online Food Allergen Information Events Expand Event Schedule Host a private event Photo Gallery Book our Golf Simulator Contact Expand General Inquiry Donation Request Apply Today Toggle Menu Great People, Great Beer, Great Service. Our Team MORGAN McREYNOLDS General Manager Our General Manager is Morgan McReynolds. Morgan is originally from Wooster, Ohio. After living in 7 other states, she and her husband Logan landed in Lake Placid in 2015. Morgan has many years of hospitality experience, including 4 years working in her favorite place on earth, Yellowstone National Park. She loves being on the water, traveling and spending time with her cats Maize, Alfie, and Cooper as well as Bruce, the Shiba Inu. Morgan was part of the Big Slide Brewery team since day one, and has now moved to her hometown of Saranac Lake to head up RiverTrail Beerworks! STEVE KROHA COO Stephen started working at the The Lake Placid Pub & Brewery since 2002 and was promoted to General Manager in 2005, then to Chief Operating Officer at both The Pub and Big Slide Brewery in 2016. Stephen married his wife Katrina in the fall of 2014 and enjoy being the parents of an ‘UBU lookalike” chocolate lab named Cabot. He enjoys overseeing all aspects of the business and takes special pride in being able to fix almost any machine at the Pub and Big Slide Brewery. During the winter months when Stephen is not working, he enjoys cross country skiing in the endless forest that surrounds Lake Placid. During his free time in the summer, Stephen spends most of his free time out on one of the many rivers and lakes in the Adirondacks in search of big fish. He even catches one every now and then.. KEVIN LITCHFIELD Director of Brewing Operations Kevin began his brewing career right out of Paul Smith’s College, hired as the first brewer to take over for Owner/Brewmaster, Chris Ericson in the fall of 1999, when the company was only 3 years old. Growing with the company over the years, Kevin has had the pleasure of working with many very talented brewers, and has learned a great deal from each one of them, compiling a wealth of brewing knowledge that continues to grow every day. Currently, as the Director of Brewing Operations for both the Lake Placid Pub & Brewery and Big Slide Brewing Company, he manages all aspects of Production Brewing, including recipe formulation, quality assurance, brewery maintenance, and day to day production. His passion for craft beer and dedication to producing the highest quality beer, drive him to continue researching and learning within the brewing community. In his free time, Kevin enjoys living and playing in the Adirondack Wilderness, including hiking, camping, paddling, biking, and swimming. Kevin is a six time finisher of the Lake Placid Ironman Triathlon, an Adirondack 46er, and is currently on a lifelong quest of running a marathon in all 50 states, while stopping for a delicious local beer along the way. Cheers! BRANDON SCHATKO Executive Chef More info to come! JASON BARNETT Head Brewer Jason originally hails from Shawnee, Kansas. He began his brewing career while living abroad in the Middle East and has since had the privilege to brew award-winning beer across three continents. In 2021, Jason received his Brewmaster certification from the VLB in Berlin. Jason is a combat veteran and an Eagle scout. He and his wife, Talia, have recently made Saranac Lake their home and can’t wait to become part of the community! Jason enjoys sailing, hiking, and woodworking. He believes strongly in the catharctic act of enjoying a great beer with people from all walks of life. Jason believes deeply in the personal meaning of his chosen profession. In his words, “to brew is to tap into a rich history and tradition forged by those who came before us, and to blaze new trails for those that come after.” OLIVIA WYAND Manager Olivia has been with the Big Slide family since the Fall of 2020, and was promoted into management at RiverTrail Beerworks in the Fall of 2024.  She studied Hospitality and Tourism Management at the University of Massachusetts Amherst, graduating in 2017. After many travels, while living abroad in Dublin, Ireland she moved to Cambridge, Massachusetts where she found a passion within the brewery industry. While in Boston she got to work on the brew floor and beertend with Lamplighter Brewing CO.  She is certified in level one Cicerone and has a palate for all beer types, her favorite being a New England IPA with dank citrus and fruity notes. Originating from Plattsburgh, NY with a deep love for the mountains she moved back home to join the team and pursue working with beer. Olivia has an endless list of hobbies in the outdoor community of the Adirondacks which include skiing, hiking, biking, and paddling. COLLEEN CRAIG Manager More info to come! Dominic Muncil Manager More info to come! CHRISTOPHER & CATHERINE ERICSON FOUNDERS / OWNERS Christopher & Catherine Ericson officially opened RiverTrail in October of 2024. Previously, they opened Big Slide Brewery & Public House in Lake Placid in June of 2016, and have also owned and operated The Lake Placid Pub & Brewery since he founded the company in 1996 at the age of 24. He graduated from Williams College with degrees in History and Psychology in 1993 then decided to pursue microbrewing in his native Maine at Kennebunkport / Shipyard Brewing Company. He then was hired as Head Brewer at The Shed Restaurant & Brewery in Stowe, Vermont, where he worked for a year and a half. During that time, Christopher and a friend from Williams wrote a business plan and their search for a location led them to Lake Placid. In 2000, Chris & Catherine married, and Catherine began working as a crucial part of the ownership structure. Chris’s beers have received dozens of awards in both international and national competitions. He currently sits on the Executive Committee of the New York State Craft Brewers Association, and is one of the co-founders of the group. He is a member of the national trade group, the Brewers Association, and sits on the BA’s national committee for Brewpubs. He is a member of the Lake Placid / Essex County Regional Office of Sustained Tourism, and served on the Board of Directors, including two years as Chairman. He was the Chairman of the Branding Project for Lake Placid, a three year endeavor. For ten years he was on the Education Council and the Finance Council for St. Agnes Primary School in Lake Placid. Prior to moving to Lake Placid, he was a Charter Officer in the Vermont Brewers Association. Mr. Ericson has been a guest lecturer at Williams College, SUNY Plattsburgh, Paul Smith’s College, Lake Placid High School, and Northwood School, teaching classes in entrepreneurship, restaurant economics, food & beverage management, microbrewing, marketing, and social media. Chris & Catherine currently live in Lake Placid with their daughter, Grace, and their son, CJ. About About Us Our Team Beer Carry Our Beer Store Beer Gift Card Clothing Hats Glassware Stickers Gifts Food & Drink Beers On Tap Food Menu Order Online Our Hours Sun - Thu: 11:30am - 9:00pm Fri & Sat 11:30am - 10:00pm Visit Us 79 Woodruff St Saranac  Lake, NY 12983 Get Directions Contact Us info@rivertrailbeerworks.com 518-891-3765 Instagram Facebook X © 2025 RiverTrail Beerworks.  All Rights Reserved Web Design by: Suloff Designs Scroll to top Scroll to top About Toggle child menu Expand Our Team Photo Gallery Store Toggle child menu Expand Beer Gift Card Golf Clothing Hats Glassware Stickers Gifts My Account Menu Toggle child menu Expand Menu On Tap Online Orders Food Allergen Information Events Toggle child menu Expand Events Host a private event Photo Gallery Contact Toggle child menu Expand General Inquiry Donation Request Apply Today Beer Toggle child menu Expand Carry our beer On Tap Book our Golf Simulator"
    },
    {
      "url": "https://wilmingtonbrewworks.com/about-wilmington-brew-works/who-we-are/",
      "text": "Who We Are - Wilmington Brew Works Beer & Cider On Tap at Miller Road On Tap at Brew Works North Find Our Beer Every Beer We’ve Ever Made Order Online (Miller Rd Only) Taprooms Miller Road Flagship Taproom Brew Works North About Us Who We Are News Community Join Our Team Email List Sign up Form Events Events Calendar Regular and Recurring Fun at Miller Rd Brew Works North – Games & Leagues Alamo Room Store Checkout Cart Cellarman’s Circle Membership 2025 Arryved Online Store Contact and FAQ Search Who We Are Wilmington Brew Works, established in 2018, stands as the sole production brewery in Delaware’s largest city. Renowned for our innovative and award-winning Ales, Lagers, Sours, and Ciders, we self-distribute to great bars and restaurants throughout Delaware. Connect with friends at one of our two Wilmington taprooms, where each location offers a unique vibe and each visit offers memorable moments. We began in a 100-year old former laboratory in the old 9th Ward, and still keep the spirit of the building’s origins alive with new and innovative beer styles; something to fit every taste bud imaginable. Our lagers are brewed to for consistency, with special releases to meet seasonal expectations. Meanwhile our NE IPAs, fermented with a cultivated wild yeast strain, have become a signature style for us, while our fruited kettle sours are changing people’s perceptions of what a beer can be. We operate our second location as a dedicated Cidery, with fun and flavorful options that are naturally gluten free. Fear not – Beer and Cider are available at both locations. Our taprooms offer different and distinct experiences, united by great products. At the Miller Road Flagship Taproom, we are family-friendly with plenty indoor and outdoor seating for you to enjoy a drink with friends, and a multi-use space called the Alamo Room that is available for celebratory events like Birthdays and Weddings. Brew Works North, opened in 2025, is a 21-plus modern take on a retro pub, with traditional bar games such as Darts, Pool and Cornhole, in a vibrant atmosphere. No matter where you choose to enjoy Wilmington Brew Works, we raise a glass to you! Cheers! Ownership Team Craig Wensell CEO, CFO & MASTER BREWER Craig Wensell, Sanitizer in Chief, Brewing Operations Manager, CEO, CFO, and Janitor. Craig has degrees from Oklahoma State University and The Florida State University. Early in his career, he taught orchestra K-12 before moving on to teaching at different universities to include The Florida State University. Craig is an amateur Double Bassist and has played across the country with many different groups such as The Columbus Symphony, Tulsa Philharmonic, and The Delaware Symphony Orchestra. He has performed at The Oklahoma Music Hall of Fame for Barney Kessel and has performed music in Weil Hall in New York City. Craig also served in Afghanistan as a Blackhawk (UH-60 A/L) Crew Chief. During his service he reach the rank of E-5 and earned numerous commendation for outstanding performance including 1000 accident free flight hours. His family has a long rich history of home-brewing that goes back to the 1980s. Craig enjoys endless hours at the brew kettle, reading technical papers, and watching yeast make beer! John Fusco VP CREATIVE & BRAND MARKETING John got into graphic design, marketing and social media by accident. A Marine Engineer by trade, with a degree from the US Merchant Marine Academy, and a Masters from Temple University in Engineering Management, he’s a navy civilian in his day job, and spent 20 years as a Strategic Sealift Officer in the Navy Reserve. In 2004, after some après ski, he started a T-shirt company in Wilmington with some friends that eventually became WhizBang Concepts. He has drawn logos and artwork, and produced apparel, for a number of local businesses, charities and breweries, which is how he met Craig. John and his wife Lisa have chaired the Philadelphia Walk for Williams Syndrome thrice. He plays drums and guitar in a band called Double Down that rarely plays outside a basement in Glen Mills. He’s a New Yorker by birth, but has now lived in Delaware as long as he has in NY. He has three young girls, and will try any beer twice. Most more. Ryan Rice COO / CIDERMAKER Ryan, a Wilmington native, learned to make cider while working as an instructor at the North American Bushcraft School in Hedgesville, WV. After joining the team at WBW, he began learning the brewing process and worked his way up to Brewer. Now days, Ryan splits his time between brewing / cidermaking and managing the taproom. Official Hand Model of WBW. Dan “Beerman” Yopp BRAND AMBASSADOR Dan “Beerman” Yopp is the Master of the Custodial Arts at Wilmington Brew Works. As a Delaware native who has spent his entire life in the state, he graduated from Wilmington University with a B.A. in Business Management. Dan became interested in homebrewing from a neighbor and quickly realized he enjoyed it very much. As an avid gardener who enjoyed growing everything from sweet garlic to habanero peppers, he found the “Do it Yourself” method in homebrewing very rewarding. He joined the First State Brewers to enhance his skills, and along the way he met the esteemed gentlemen which would go on to being his business partners. Favorite beers styles are Stout, Porter, & Barleywine, especially if they are barrel aged. Derek “DJ Sudz” Berkeley BRAND AMBASSADOR Derek Berkeley, Beer Hunter, and Janitor In Training. Derek hails from Canada which helps explain his love for beer and hockey. Nomadic by nature, his travels have taken him from the snowy tundras of Montreal to the badlands of Boston, deserts of Charlotte, wilderness of Virginia and most recently the ‘burbs of Delaware. Having realized at an early age that earning a college degree would allow him to buy more beer, he embarked on his “Decade of Learning” at the University of Lowell where he almost became the first undergrad in history to get tenure. When not honing his Beer Hunting techniques, Derek enjoys racing tricycles, and refereeing Women’s Roller Derby. Keith Huges PARTNER Staff Lisa Fusco ALAMO ROOM COORDINATOR Lisa is a Mechanical Engineer by degree, but these days is more interested in the design aspect of spaces and how best to intersect modern and vintage styles. She helps to make the taproom look beautiful, especially during the holidays. Mom extraordinaire to her and John’s three daughters. She also tells John whenever his artwork doesn’t look good, which is a crucial role! Ashley SENIOR SHIFT LEAD/MUSIC BOOKING Ashley is a singer, actress, & Cicerone Certified Beer Server who recently moved back to her hometown of Wilmington, DE after spending many years living in NYC. She holds a Bachelor of Music in Vocal Performance: Music Theatre from New York University and is a proud member of the Actors’ Equity Association. Some of her favorite regional theatre credits include the Media Theatre, Flat Rock Playhouse, Depot Theatre, and Sharon Playhouse. Ashley performs locally with 2Step Acoustic as a singer and keyboardist. When she’s not working or enjoying delicious craft beer at WBW, she’s probably hanging out with her husband Zach, their two cats Michael & Lita, and goldendoodle puppy named Isla. David SENIOR SHIFT LEAD A military brat, David moved around a lot as a child before his family settled in Milford, DE. After graduating from High School, David headed up north to attend the University of Delaware. David and his wife moved to Wilmington, where they still reside. Having spent a portion of his formative years living in Germany, David holds a soft spot for German beer styles and lagers of all shapes and sizes. Despite falling head first into the IPA craze of the early 2000’s, this is the well he always goes back to. To this day David visits Germany whenever he is able. Holding degrees in both Fine Arts and Accounting, David spends his days as the Production Manager/Accounts Payable manager for a textile printing company in West Chester, PA. When not working David can be found drawing (including WBW’s Undelivered Mail and Distracted Thought’s can labels), playing disc golf, making music, or traveling the world with his wife Jess. Zach Schilling SALES & DELIVERY Production Team Alan Team Member Since: January 2024 Favorite WBW Product: Umlaut / Planetary Gears My Cool Hobby : Playing Music (Guitar, Banjo, Trombone) / Camping / Home Brewing Favorite WBW Moment: Very excited to be part of the team that brews some of the best beer in Delaware! Shift Leads Tom Team Member Since: September, 23 Favorite WBW Product: The one in my glass! I Daylight as a: OR Support for Medical Implants My Cool Hobby : Filling out Work Bio’s My Pets: Holland Lop rabbits, Poof & Odie Favorite WBW Moment: Getting to know the regular customers! Dakoda Team Member Since: June, 2023 Favorite WBW Product: Luau Punch I Daylight as a: School Constable My Cool Hobby : Avid Weightlifter Erin Team Member Since: March, 2020 Favorite WBW Beer: Lupulin Enlightenment I Daylight as a: IT Implementation Coordinator My Cool Hobby: I collect Bottle Caps My Pets: Boxer Jackson. My Favorite WBW Moment: When we reopened for Phase 1 after Covid, because that was the first time I worked with customers Front of House Bartenders Oliver Team Member Since: March, 2022 Favorite WBW Beer: International Incident I Daylight as a: Camping Equipment Salesperson My Cool Hobby: Backpacking! Favorite WBW Moment: Being here with my family for opening weekend in 2018! Drew Team Member Since: March, 2023 Favorite WBW Product: Umlaut I Daylight as a: Technical Support Engineer My Cool Hobby : I love to DJ. Favorite WBW Momemnt : Final training shift on St. Patrick’s Day! Alison Team Member Since: April, 2023 Favorite WBW Product: Polychromatic Dream I Daylight as a: Graphic Designer My Cool Hobby : Contradicting Myself My Family & Pets: Zero the Min Pin, Snoop Dogg the Chihuahua, & Chunk the Chonkey Cat. Pat Team Member Since: July, 2023 Favorite WBW Product: Delabear I Daylight as a: Project Manager My Cool Hobby : I grow Coral My Family & Pets: My Fiancé, and our dogs Mummer & Sinatra Favorite WBW Moment: Listening to Graham’s Beer adventures! Tommy Team Member Since: July, 2023 Favorite WBW Product: Helio Loop I Daylight as a: H.S. Social Studies Teacher My Cool Hobby : Mario Kart Champ! My Family & Pets: My Fiancé & our dogs Luna, Sonny & Stella Favorite WBW Moment: Working a pharmaceutical Vet party in the Alamo Room and learning way too much about Animal Blood. Trevor Team Member Since: April, 2024 Favorite WBW Product: Umlaut I Daylight as a: Production Assistant My Cool Hobby : Film Photographer & Electronic Musician My Pets: Rocco the Terrier Mix Favorite WBW Moment: Getting the most beautiful plate of soul food from the first party I ever worked in The Alamo Room Jen Team Member Since: April, 2024 Favorite WBW Product: Hazy Tang I Daylight as a: Graphic Designer & Painter My Pets: Husband – Rich   Dog – Duffy Bill Team Member Since: June, 2024 Favorite WBW Product: Delabear I Daylight as a: City Planner My Cool Hobby : Collecting VHS Tapes Favorite WBW Moment: The Debut of the AMAZING HUMMUS! Patricia Team Member Since: June, 2024 Favorite WBW Product: Cheeky Peaches! I Daylight as a: Forensic Scientist My Pets: I have a cute tabby named Rosemary Digital Team Ben Kaminski Website Development Ben was born in Pennsylvania and spent most of his childhood there. It wasn’t until 2000 that Ben landed in Delaware and, unbeknownst to him at the time, he would decide to stay in the first state permanently. Ben has been in the web development field for over 25 years and has worked on projects of all sizes. Ben’s love for craft beer came the first time he tried a New England IPA. He couldn’t believe that a beer could taste so good and be so fulfilling. Having tried only corporate beer previously, the taste of the NEIPA was so dramatically different and better; he discovered a whole new world of beer that would lead him on a road of discovery that continues to this day. Ben enjoys playing guitar, writing music, playing golf, and taking road trips to breweries. Visit his website for more information on his services. Laura McDonald Photographer Laura, aka Paparazzi, loves taking photos. You may see her around the brewery laying on the floor or climbing on a table to get the perfect photo of beer. Never before a “beer person” before discovering the brewery, she is now a full-on sour beer lover. Visit her website www.lauramcdonaldphoto.com for both family and commercial photography work. Jeff Kempista App Development Jeff is a man of mystery who made our menu display app. His app is awesome and makes it so you can see what’s on tap and we can change it on the fly. Related: teamwork makes the dream work , wbw staff , wilmington brew works Questions? You have questions, we have answers. Contact Wilmington Brew Works with any inquiries you may have. Contact Us Search WBW: × Search Close Email List: Subscribe to our emailing list and never miss an update. Leave this field empty if you're human: Wilmington Brew Works: Hours of Operation: Mon: 5pm - 9pm Tues: 5pm - 9pm Wed: 3pm - 10pm Thur: 3pm - 10pm Fri: 12pm - 10pm Sat: 12pm - 10pm Sun: 12pm - 6pm 3129 Miller Rd. Wilmington DE, 19802 (302) 722-4828 Map Brew Works North: Hours of Operation: Mon: 4pm - 9pm Tues: 4pm - 9pm Wed: 3pm - 10pm Thur: 3pm - 10pm Fri: 12pm - 11pm Sat: 12pm - 11pm Sun: 12pm - 9pm 1851 Marsh Rd. Wilmington DE, 19810 (302) 374-0027 Map Copyright © 2025 Wilmington Brew Works\n\t\t\t | Privacy Policy"
    },
    {
      "url": "https://www.lovelanebrewery.com/",
      "text": "Love Lane Brewery Skip to content Home Page Menu Drinks Brewery Tours What’s On Trade Love Lane Beers Higsons Beers Home Page Fully refurbished and now open we are ready to welcome you to Love Lane Brewery, Bar & Kitchen, where we blend the cosy ambiance of a traditional pub with exceptional food and beer brewed on site. View Our Food Menu What's on at Love Lane View Our Drinks Menu Book A Brewery Tour and Tasting Book A Table To book a table call us on 0151 317 8215 or book online below. If your preferred time is not available please call us and we will do our best to fit you in. For Groups of more than 10 please email info@lovelanebrewery.com Find Us Opening Hours Mon-Tue: CLOSED Wed-Thurs: 12pm-10pm Kitchen 12-3pm and 5-8pm Fri: 12pm-10pm  Kitchen 12-3pm and 5-9pm Sat: 12pm-10pm  Kitchen 12-9pm Sun: 12pm-8pm   Kitchen 12-6pm Location 62-64 Bridgewater Street Liverpool  L1 0AY Contact 0151 317 8215 info@lovelanebrewery.com Wholesale For wholesale enquiries and orders rod@tjmbrewing.com Email Sign up to hear about our latest news and offers Facebook Instagram"
    },
    {
      "url": "https://absolutebeer.com/breweries/first-love-brewing/",
      "text": "First Love Brewing - Absolute Beer Skip to content Absolute Beer Reviews News Beer 101 Contact Brewery Overview, Profile, and Related News First Love Brewing Fernandina Beach, FL • Est. 2020 First Love Brewing First Love Brewing is a Fernandina Beach, Florida-based microbrewery offering 20 rotating taps. We are driven by our community and life experiences to deliver the highest quality of education, products, and service to our customers. For more information, visit the brewery’s Facebook page . Is any of the info for this brewery incorrect or incomplete? Propose an Edit Tags: First Love Brewing , Florida First Love Brewing 22 S 8th St Fernandina Beach, FL 32034 United States (904) 310-9721 Connect Online Facebook Page Untappd Page Send an Email Proud to Support Independent Craft Brewers For years, small and independent U.S. craft breweries have been turning the beer world upside down. Their ability to take risks, innovate flavors and build better communities has made the U.S. the craft beer capital of the world. To proudly display that independent spirit, the Brewers Association created a symbol to unify U.S. craft breweries and those who want to support them. This certified mark gives beer lovers an easy way to identify independent craft beer. Learn more about what it means to be an Independent Craft Brewer by visiting the Brewers Association . Search Do You Love Craft Beer? Sign Up to Receive the Latest News & Reviews Reviews News Beer 101 Contact Your Destination For All Things Beer. Copyright © 2025 Absolute Beer Absolute Beer Subscribe to the Brewsletter! Do you love craft beer? Sign up to the Brewsletter and get the latest news, reviews, and content delivered to your inbox. X"
    },
    {
      "url": "https://loveyourpub.co.uk/contact-us/",
      "text": "Contact Us Love Your Pub Group for great pubs across Hampshire Skip to content Subscribe Venue Guide Pubs on the Market Venue News Pub Jobs Pub Support Brand & Trade Suppliers About LYP About us Meet the team Follow Pierre Our services Contact us Venue Guide Pubs on the Market Venue News Pub Jobs Pub Support Brand & Trade Suppliers About LYP About us Meet the team Follow Pierre Our services Contact us Contact Love Your Pub today JOIN THE LOVE YOUR PUB GROUP Do you run your own premises, offer premium services to pub owners or are you a supply or brand owner? Get in touch with our friendly team today to find out how could become part of “The Love Your Pub Group” community, be showcased on our site and across our social media groups. Phone: 02393 880220 Email: ku.oc.bupruoyevol obfsctd-911f37 @ofni Please fill in the form below and our team will be in touch shortly. Contact Form Name Pub Name Address City Postcode Telephone Email What services are you interested in? Pubs on the Market Pub Jobs Social Media Management Venue Guide Other Are you a Greene King Customer? Yes No Message I consent to have this website store my submitted information so they can respond to my enquiry. Submit The Love Your Pub Group & its subsidiaries are a trading name of Hardys Consultancy Ltd Units 1-2 Warrior Court, 9-11 Mumby Road, Gosport, Hampshire, United Kingdom, PO12 1BS Company number: 09604785 working in partnership with Happy clients The Love Your Pub group has been a pleasure to work with, they truly understand the local element of a business and execute this so well. The marketing campaigns, photography and videos tutorials of the venues, are of such high quality and are to a consistent standard (you would expect to spend a fortune to receive the end product you’re left with). Great first year working with LYPG and we will continue the partnership moving forward! Karl Bradford Prospect Account Manager Molson Coors From the minute I met Dave and he introduced me to his business love your pub I knew I was in great hands. Straight away the reach to the public had a positive impact. If ever I had an issue in any area of my business that I wanted some advice or just to chat through Dave was the person I would instantly turn to. Promoting my business and even providing the most amazing photos of our food and venue are no longer a worry as love your pub look after this for me. The love your pub group offer outstanding value for all the work they have done with my business. Thank you Dave for all the support. Simon Smith Managing Director Skylark Golf & Country Club Love Your Pub has been very helpful for us as a new business just starting out, providing us with extra support and helping us to get our brand and name out there. Personally I love the design of the website as its very easy to search for bars and see the main features of each venue. Dave is always there for any advice and new ideas always keeping in contact and prompting me to publish and advertise more which I find a “Godsend” as I sometimes find myself consumed in other tasks. The company have also taken some fantastic photos of our bar and dishes for the menus. We are very glad to be part of The Love Your Pub Group” Danny O’Brien Owner The Grapes “Working with Love Your Pub has proved to be an effective collaboration for Booker at a regional level. It enables us as a business to provide a solution to our clients in the world of marketing that we didn’t have before. We have a solid relationship now with The Love Your Pub team & look forward to continuing that relationship moving forward.” Martin Bigwood Catering Development Manager Booker Portsmouth “The Love Your Pub Group gives us the opportunity to get the word out about what’s going on within our Pub the way we want to. Love Your Pub can communicate about what’s happening in REAL time within our kitchens to a wider audience specifically in the city that we trade in which in turn enables customers to come visit us and try something new and exciting from our menus. Its been fantastic to have bookings as a result of The Love Your Pub Group particularly over the Christmas period.” Jack Preston, Patisserie Owner , Sweet Science Patisserie “The Love Your Pub Group’ is a fantastic way for people to find a place that is exactly right for their needs. Whether its Cask Ale or a dog friendly pub you are looking for, ‘The Love Your Pub Group’ will give you the best results from the local area.  Since joining with ‘The Love Your Pub Group’ we have been able to utilise their range throughout, including social media and the main website to reach out more especially to those looking for what we are offering in REAL time. A cracking idea!” Matt Chapman, The Marmion Bar & Kitchen Facebook Vimeo Instagram Love Your Pub is a multi service hospitality platform which includes a social media agency, pub recruitment channel, guide and much more. Listing your pub with Love your pub on the guide and taking advantage of our social media management service will boost your visibility as Love Your Pub is the biggest online hospitality guide there is. Alongside our guide and social media package we offer a range of pub support, pubs on the market and much more. about us meet the team venue news pub support brand & trade hospitality jobs pubs on market follow Pierre contact us our services SUBSCRIBE disclaimer terms & conditions The Love Your Pub Group ®, “Pierre The Pug” ® & Follow Pierre ® are licensed trademarks of Hardys Consultancy Ltd. All written content and imagery appearing on this website & third party social media pages which we provide services for remain the intellectual property of Hardys Consultancy Ltd both during & after any services we have provided to our clients. If you wish to use any of our material from this site and our archives, please contact us to obtain both permissions & rate cards for external use. Love Your Pub © All Rights Reserved 2025 | Website Designed & Developed by Capture Design Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Venue News, Popup - Newsletter sign up First Last Email Terms & Conditions I confirm that I am over the age of 18 I Agree with Terms & Conditions Subscribe"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/",
      "text": "Founder's Journal Sign up to get updates from us ... By signing up, you agree to receive email from this podcast. Subscribe Founder's Journal Home Episodes All Episodes 637 By Season Season 1 19 Season 4 2 About Reviews All Reviews Leave a Review Rate on Apple Podcasts Rate on Spotify Contact Follow Apple Podcasts Spotify Castro RSS Feed Search Follow Apple Podcasts Spotify Castro RSS Feed Founder's Journal Alex Lieberman, the co-founder and Executive Chairman of Morning Brew, gives you an insider’s look into building businesses. Alex explores the founder’s journey, from the painful challenges of 0-to-1 to the powerful frameworks that help you scale to millions in revenue as well as the emotional rollercoaster that is present throughout. Recent Episodes View all June 30, 2025 The secret business weapon Alex Lieberman (@businessbarista) talks about EOS, an operating system for running & scaling your business successfully. In 2019, Morning Brew used EOS to scale the business from 15 people and $3 million in revenue to 300 peo... Listen to the Episode June 25, 2025 How to Find Your Zone of Genius Alex Lieberman (@businessbarista) takes you through an exercise to recalibrate and focus on his zone of genius. The zone of genius is work that you do that brings out the best version of yourself. Follow this super easy, supe... Listen to the Episode June 23, 2025 How to Get Your First 1,000 Users Today’s read is by one of my favorite startup creators, Lenny Rachitsky. The essay, How To Kickstart & Scale a Consumer Business, breaks down the seven proven strategies to acquire your first 1,000 users as a B2C startup. I’m... Listen to the Episode June 18, 2025 13 Dangerous Psychological Biases In 1995, Charlie Munger gave a speech called the Psychology of Human Misjudgment, which contains 25 psychological tendencies by humans that can lead to bad decision making & bad outcomes. Today, Alex shares his 13 favorite & ... Listen to the Episode June 16, 2025 How to Crush a Quarterly Offsite On this episode of Founder’s Journal, I teach you how to crush a quarterly meeting. V/TO: https://www.eosworldwide.com/blog/whats-in-your-v-to Rocks 101: https://www.eosworldwide.com/blog/creating-the-best-rocks — Thanks to o... Listen to the Episode June 11, 2025 How to deal with imposter syndrome Today I share my experiences with imposter syndrome and some techniques I use to cope with it. — Thanks to our presenting sponsor, Gusto. Head to www.gusto.com/alex — Check Out Alex’s Stuff: • storyarb - https://www.storyarb.... Listen to the Episode View all Episodes Join the Email List Email has been submitted. By signing up, you agree to receive email from this podcast. Please complete the reCAPTCHA verification Subscribe Listen On Founder's Journal Alex Lieberman, the co-founder and Executive Chairman of Morning Brew, gives you an insider’s look into building businesses. Alex explores the founder’s journey, from the painful challenges of 0-to-1 to the powerful frameworks that help you scale to millions in revenue as well as the emotional rollercoaster that is present throughout. Episodes About Reviews Contact © 2025 Founder's Journal Podcast Website by Podpage"
    },
    {
      "url": "https://foundersjournalpod.morningbrew.com/about/",
      "text": "About | Founder's Journal Sign up to get updates from us ... By signing up, you agree to receive email from this podcast. Subscribe Founder's Journal Home Episodes All Episodes 637 By Season Season 1 19 Season 4 2 About Reviews All Reviews Leave a Review Rate on Apple Podcasts Rate on Spotify Contact Follow Apple Podcasts Spotify Castro RSS Feed Search Follow Apple Podcasts Spotify Castro RSS Feed About Hi, I'm Alex Lieberman, co-founder and Executive Chairman of Morning Brew. Founder's Journal is my personal audio diary where I give you, the business builder, the tools you need to think better, in order to build better, whether that’s building a business, a team, or a new product. Founder's Journal Alex Lieberman, the co-founder and Executive Chairman of Morning Brew, gives you an insider’s look into building businesses. Alex explores the founder’s journey, from the painful challenges of 0-to-1 to the powerful frameworks that help you scale to millions in revenue as well as the emotional rollercoaster that is present throughout. Episodes About Reviews Contact © 2025 Founder's Journal Podcast Website by Podpage"
    },
    {
      "url": "https://brewerschoice.net.au/contactus/",
      "text": "ContactUs - Brewers Choice Skip to content HOME PRODUCTS Beer & Cider Equipment and Brewing Gears Beer Brewing Ingredient Kits Malt Extract & Sugar Grain/Malt Spirit Making Stills Kit & Parts Flavouring Chips/Staves Yeast & Consumable Filter Carbon and parts Wine Making Wine Yeast Wine & Fruit Press Additivies Books Cheese Making Cheese Kit Equipment & Additives Cultures Mould Micro Brewry & Distillery Micron Brewry Craft Distillery Fermenting Vessel Fermenting General Equipment and parts Fermenting & parts Heating and Controlling Measuring Device Cleaning & Sterilizer Gift Card Account Menu HOME PRODUCTS Beer & Cider Equipment and Brewing Gears Beer Brewing Ingredient Kits Malt Extract & Sugar Grain/Malt Spirit Making Stills Kit & Parts Flavouring Chips/Staves Yeast & Consumable Filter Carbon and parts Wine Making Wine Yeast Wine & Fruit Press Additivies Books Cheese Making Cheese Kit Equipment & Additives Cultures Mould Micro Brewry & Distillery Micron Brewry Craft Distillery Fermenting Vessel Fermenting General Equipment and parts Fermenting & parts Heating and Controlling Measuring Device Cleaning & Sterilizer Gift Card Account $ 0.00 0 Cart Search Search Close this search box. ContactUs Please feel free to contact us via email with the web form below. Landline: (03)8799 2934 Mobile: 0481 152 322 Email address: Sales@brewerschoice.net.au Bayswater Store: Unit 5 / 810 Mountain High Way Bayswater Vic, 3153, Australia CONTACT INFO U5/810 Mountain High Way, Bayswater, VIC 3153 Phone: (03)8799 2934 Mobile: 0481 152 322 Email: sales@brewerschoice.net.au\nBrewerschoice.net.au INFORMATION Shipping & returns Privacy notice Conditions of Use About us Shipping & returns Privacy notice Conditions of Use About us MY ACCOUNT Customer Info Addresses Orders Cart Customer Info Addresses Orders Cart HELP Contact Us FAQ Help Rewards Contact Us FAQ Help Rewards TRADING HOURS Monday – Friday 9:30am – 4:30pm Saturday 9.30am – 12.30pm Sunday Closed Copyright © 2022 Brewers Choice Home Brew Supplies Shopping Cart"
    }
  ]
}