{
  "fuentes": [
    {
      "url": "https://www.fox35orlando.com/news/restaurant-owners-face-severe-staff-shortage-everybody-is-hunting-for-the-same-people",
      "email": "fox35news@fox.com"
    },
    {
      "url": "https://fishhabitat.org/about/staff-board",
      "email": "info@fishhabitat.org"
    },
    {
      "url": "https://ornamentalfish.org/about-us/oata-directors/",
      "email": "info@ornamentalfish.org"
    }
  ],
  "mails": [
    "fox35news@fox.com",
    "info@fishhabitat.org",
    "info@ornamentalfish.org"
  ],
  "nombre_sitio": "fishlipswaterfront.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fox35orlando.com/news/restaurant-owners-face-severe-staff-shortage-everybody-is-hunting-for-the-same-people",
      "text": "Restaurant owners face severe staff shortage: 'Everybody is hunting for the same people' | FOX 35 Orlando Live News Weather Good Day We Love Florida Contests More Watch Live Expand / Collapse search ☰ Search site News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests River Flood Warning is in effect, Lake County, Volusia County 3 Rip Current Statement until SAT 6:00 AM EDT, Coastal Flagler County Rip Current Statement until SAT 4:00 AM EDT, Coastal Volusia County Restaurant owners face severe staff shortage: 'Everybody is hunting for the same people' By Elina Shirazi Updated May 14, 2021 8:08am EDT News FOX 35 Orlando Share Copy Link Email Facebook Twitter LinkedIn Reddit Restaurant owners face severe staff shortage Michael Schwarz, the general manager of Port Canaveral’s gem, Fishlips Waterfront Bar & Grill, says they used to have 160 employees. Now, they are down to just 90. Another issue is keeping employees they have. PORT CANAVERAL, Fla. - Michael Schwarz, the general manager of Port Canaveral’s gem, Fishlips Waterfront Bar & Grill, says they used to have 160 employees.  Now, they are down to just 90. Another issue is keeping employees they have.  Schwarz says he has a bonus program that he hopes will help. That’s a tactic that other local business owners are trying out. \"So what we have done for all our non-tipped employees is, basically when they sign on, any of our cooks, they get a $200  bonus that goes into a savings account for them,\" said Albert Steiginga, a Long Doggers Co-Founder. Steiginga says all six of his restaurants have had to reduce their hours and cut back on their seating. Right now, he says they are short 24 cooks. His goal is to keep the employees he has happy. \"We want people to stay with us because everybody is hunting for the same people,\" Steiginga said. Economists say the shortage is driven by generous unemployment benefits, home-schooling demands for working couples, and simply the fear of catching COVID-19. \"If you are able to maintain a certain percentage of your income because of a $1,400 check, or this additional unemployment check, then I think it reduces the urgency that some people might feel about getting back to work,\" said Sean Snaith, the director of the Institute for Economic Forecasting at the University of Central Florida. But it’s not only a problem with shortages. There is also a problem with job retention. According to the latest data from the Bureau of Labor Statistics, April's unemployment rate is at 6.1 %. In April of this year, 824 people left their jobs. That is compared to 569 people who left at the same time last year. \"The types of jobs that are seeing the most difficulty in hiring, it is not like if you wait a month or two months or three months you are not going to be able to find work as a server somewhere in a restaurant or as a bus person. You know, those jobs will be available,\" Snaith said. \"I have only got rooms for so many people, and as long as I have the people to wait on them, we will wait on them,\" Schwarz said. Tune in to FOX 35 Orlando for the latest Central Florida news. News Brevard County COVID-19 and the Economy Economy Latest News Making Strides Against Breast Cancer Orlando 2025: Registration, parking, how to attend Live Now 'Potential bomb threat' at DNC Headquarters, Capitol Police responding Charlie Kirk's casket to be flown to Arizona Teen killed, 5 men hurt in shooting at Tampa apartment complex Live Now WATCH: 9/11 remembrance ceremony, annual reading of names Trending Orlando weather: Elevated rain, storm chances through mid-week could bring local flooding Volusia County mom charged after children found in roach-infested, unsafe home: Deputies National Hurricane Center: Tropical wave in Atlantic eyed for potential development Florida appeals court strikes down state’s open-carry gun ban Video shows Orange County deputy accidentally shoot man during call in Pine Hills Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . FOX LOCAL Stream FOX 35 Orlando for free with FOX LOCAL Watch local news, weather, and live events on Roku, Fire TV, and more — just search “FOX LOCAL” News Florida Headlines Central Florida Headlines National Headlines Brevard County Flagler County Lake County Marion County Orange County Osceola County Seminole County Volusia County Military May - Nominate a hero Military Appreciation Month Weather Live Weather Cameras Weather Alerts Orlando Weather Forecast 7 Day Forecast Theme Parks Forecast Beach Forecast Pollen Forecast FOX Weather Storm Team Weather App Snap The Sun Traffic Pump Patrol Current Traffic Conditions Freeway Traffic Incidents Florida Traffic Cameras Good Day We Love Florida FOX 35 Care Force Weather Babies AdventHealth House Calls Snap The Sun Garner's Garden Fur-Cast Weather Babies Stellar Senior 2025 Money Monday We Love Florida We Love Florida Features Theme Parks News Walt Disney World Sea World Orlando Universal Orlando Sports Orlando Magic Orlando City Soccer Club FIFA World Cup High School Sports Shows How To Stream FOX 35 TV Schedule Good Day Orlando Orlando Matters Late News at 11PM LIveNow from FOX Central Florida Eats Regional News Gainesville News - FOX 51 Gainesville Tampa News - FOX 13 News Atlanta News - FOX 5 Atlanta FOX Weather About Us How to stream FOX 35 FOX 35 TV Schedule Contact Us Personalities Work for Us Sign up for FOX 35 emails Download FOX 35 apps Advertise with Us FOX 35 Internships WRBW NEXTGEN TV WRBW/FOX 35 PLUS Closed Captioning FCC Public File FCC Applications News Tips Call: (407) 741-5027 Email: FOX35News@FOX.com Share videos and photos with FOX 35 FOX 35 Connect Contests facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://fishhabitat.org/about/staff-board",
      "text": "Top NFHP YouTube Channel About Staff and Board Board Meeting Archives National Fish Habitat Action Plans Board Endorsement Letter The Partnerships Partnership Resources Coordinator Bios Project Dashboard Habitat Assessments News Newsletter Sign-up Awards Contact Donate Staff and Board MEET THE STAFF Alex McOwen (NFHP Coordinator), NOAA, (National Marine Fisheries Service) Daniel Wieferich (Co-Chair Science and Data Committee), U.S. Geological Survey Gary Whelan (Co-Chair Science and Data Committee), Michigan Department of Natural Resources (Retired) Jason Olive (NFHP Partnership Coordinator), U.S. Fish and Wildlife Service Kate Sherman (Data Management and GIS Specialist), Pacific States Marine Fisheries Commission Ryan Roberts (Program Manager), National Fish Habitat Partnership (Association of Fish & Wildlife Agencies) MEET THE BOARD Adam Ringia (Tribal Representative), Southwest Tribal Fisheries Commission, Executive Director - Term exp. 2/28 Paul Wagner (Serves by virtue of office), U.S. Geological Survey, Associate Director, Ecosystems Ted Will (SEAFWA Representative), Georgia Wildlife Resources Division (DNR), Director - Term exp. 1/28 Bryan Moore (Habitat Conservation Organization), Trout Unlimited, Chief Intergovernmental Officer - Term exp. 2/26 Chris Horton (Marine Rec. Fishing Representative), Senior Director, Fisheries Policy, Congressional Sportsmen's Foundation - Term exp. 2/27 Carter Kruse (National Private Landowner Representative), Turner Enterprises, Director of Conservation - Term exp. 2/27 Chris Moore (Fishery Mgmt. Council Representative), Mid-Atlantic Fishery Management Council, Executive Director - Term exp. 2/27 Doug Austen (Science Based Fisheries Organization Representative), American Fisheries Society, Executive Director - Term exp. 2/27 Gene Gilliland (Freshwater Recreational Angling Representative), Bass Anglers Sportsman Society, Conservation Director - Term exp. 2/26 Ian Nakayama (Marine Rec. Fishing Representative), Theodore Roosevelt Conservation Partnership, Sr. Manager Gov. Affairs - Term exp. 2/27 Jake Slager (Corporate Industry Representative), Coca-Cola, Director, Colleges & Universities - Term exp. 5/26 Jesse Trushenski (Agricultural Production), Riverence, Chief Science Officer - Term exp. 2/27 John O’Keefe (Corporate Industry Representative), Yamaha Motor Company, Senior Specialist-Government Relations - Term exp. 2/27 Julie Carter (WAFWA Representative), Arizona Game and Fish, Aquatic Habitat Branch Chief - Term exp. 12/26 Charlie Wright (Tribal Representative), Tanana Chiefs Conference - Term exp. 2/28 Mike Leonard (Recreational Sportfishing Industry Representative), American Sportfishing Association, VP of Gov. Affairs- Term exp. 2/26 Pat Rivers (MAFWA Representative), Minnesota Department of Natural Resources, Deputy Director - Term exp. 2/28 Peter Micciche (Local Gov. Rep. in Fish Habitat Restoration), Kenai Penisula Borough, AK. - Term exp. 2/27 Steve Lohr (Serves by virtue of office), U.S. Forest Service, Director Natural Resources Dave Golden (NEAFWA Representative), New Jersey DEP Fish & Wildlife, Assistant Commissioner - Term exp. 2/28 Sam Rauch (Serves by virtue of office), NOAA (National Marine Fisheries Service), Deputy Assistant Administrator for Regulatory Programs Stan Allen (Fisheries Commissions Representative), Pacific States Marine Fisheries Commission, Sr. Program Manager - Term exp. 2/27 Dave Miko (Serves by virtue of office), U.S. Fish and Wildlife Service, Deputy Director (Acting) Steve Perry (Landowner Representative of an active Fish Habitat Partnership) Term exp. 2/27 Tim Schaeffer (AFWA Representative), PA Fish and Boat Commission, Executive Director (Board Chair) - Term exp. 2/28 Risa Shimoda (Sportfishing and Boating Partnership Council), River Management Society, Executive Director - Term exp. 11/27 Sarah Schumann (Commercial Fishing Industry Representative) Sharif Branham (Serves by virtue of office) Bureau of Land Management (BLM), Assistant Director for Resources and Planning This Project was funded by a Multistate Conservation Grant (F23AP00525), a program funded from the Wildlife and Sport Fish Restoration Program, and jointly managed by the U.S. Fish and Wildlife Service and the Association of Fish and Wildlife Agencies. Contact Us Phone: 202-838-3466 Fax: 202-350-9869 Email: info@fishhabitat.org 1100 First Street, NE Suite 825 Washington, DC 20002 Supported By Copyright © 2024 National Fish Habitat Partnership | Powered by Monstrous Media Group"
    },
    {
      "url": "https://ornamentalfish.org/about-us/oata-directors/",
      "text": "OATA Directors - Ornamental Aquatic Trade Association TRENDING: Channa under the spotlight for EU ban Say no to goldfish at fairs, says OATA Comprehensive CITES coral ID guide now available Latest News About Us Meet The Team OATA Directors Becoming a Board member Annual Reports What We Do Represent The Industry Set Standards Advice & Information Join Us Join Online Training International Training Form I Have Fish Customer Charter Hands off my hobby! Responsible pet ownership Useful Information Enhance Your Knowledge Find A Fish Vet Latest News About Us Meet The Team OATA Directors Join our Board Annual Reports Work with us Industry jobs What We Do Represent The Industry Fishing for facts Online trade Exotic Pets Scottish exotic pet review Wild caught fish CITES marine fish proposal Freshwater conservation Zoonoses Invasive Species Pet Shops Pets in Society Set Standards Code of Conduct Water Quality Selling fish Selling Fish Online Primary Authority scheme Biosecurity Caudata rules Animal Activities Licensing Invasive Species Illegal cyanide fishing Advice & Information Customer care sheets Videos Aquatic plants UK trade reports Water Quality Code of Conduct Pet Guides Find a Fish Vet for shops Report A Problem Join Us Training Invasive species training International training Local authority training Order online I Have Fish Responsible pet ownership Useful Information Enhance Your Knowledge Find A Fish Vet Customer Charter Contact Us Members Area Select Page Home >> About Us >> OATA Directors >> OATA Directors OATA’s Board of Directors represent the entire ornamental aquatic industry, from importers to retailers, wholesalers to manufacturers, and are elected by members at our Annual General Meeting, held each autumn. Directors must stand for re-election every three years.  Any of our members may be nominated to stand for election to the Board of Directors; if you would like to be considered for election, please contact the current OATA Chairman or find out more about what’s involved here . Laura Carlin Chair My experience covers a variety of sectors within the trade spanning the past 20 years and I have the grey hairs to prove it.  Initially I worked for a large multi-site chain whilst studying for my BSc in Marine Biology, then a public aquarium, a wholesaler/importer and lastly in independent aquatics store before setting up my own wholesale company, EcoMarines.  EcoMarines is driven by nothing other than my pure passion to improve our trade by focusing on sustainability and ethics.  Part of this has seen me work extensively on shutting down illegal coral imports, producing documents alongside OATA to help authorities spot and act on ‘fake mariculture’ as well as tirelessly working with exporters and like-minded companies on improving sourcing, quarantine procedures and shipping strategies. Dr Donna Snellgrove Incoming Vice Chair Dr Donna Snellgrove is the manager of the fish team at WALTHAM, the centre for pet research which is part of Mars Petcare. Donna has a BSc degree in biological sciences specialising in marine biology from the University of Plymouth, which she followed with an MSc in biological research methods from Exeter University.  She then returned to Plymouth to do a PhD in fish nutrition and physiology. Her research, sponsored by an Aquafeed company, investigated the availability and fate of minerals from various raw materials in diets for production rainbow trout.  Her post-doctoral research based at the University of Connecticut (US), involved culturing seaweed ( Porphyra sp.) for use in integrated aquaculture systems. www.waltham.com Matt Stevenson Outgoing Vice Chair I studied engineering specialising in aquarium filtration, gaining a 1st class degree. Previously I have been involved in helping many NGOs ranging from the National Lobster hatchery in Padstow, to Coral Awareness Projects. With a strong understanding of marketing, I am well aware of brand and modern communication technologies. Through my career, I have always been in the aquatic market segment and close to the retail trade. Using my knowledge and entrepreneurial flair to start biOrb aquarium in 1999. A strong believer in animal welfare I have more recently started Seneye who provide unique internet monitoring systems for aquatic welfare. My aim has always been to try and increase the numbers of fish keepers in the UK. I have kept fish since a small child and currently have a Koi pond along with Marine and tropical aquariums. I am also a keen surfer, diver, and motorcyclist combining these where possible with his passion for travel. www.seneye.com Rob Edgecock With his first job as a ‘fish importer’, Robert has been in the aquatic import and distribution business for twenty years. In 1999, Robert founded Independent Aquatic Imports Ltd with business partner Annie Biggerstaff and they are both as passionate about the business now as they were then. The company imports and distributes ornamental fish and aquatic plants across the UK. Married with three children, Robert enjoys relaxing with family and friends and the odd round of golf. “I joined OATA to offer my services and experience to assist the trade not only in matters directly relevant to our day to day business but also the whole trade.” www.aquaticimports.com Caroline Everett Caroline Everett runs Anglo Aquatic Plant Co Ltd, based in Enfield, Middlesex. She was born into the aquatics industry, as her parents, David and Rosalind, founded Anglo Aquatic plant (formerly Anglo Aquarium) over 50 years ago. She has been involved in the business from a very early age. After university, she worked at Mars confectionery, designing and building production lines, but returned to the family business in 2009. Using her knowledge and experience from the corporate world, she has taken Anglo from strength to strength, focusing on quality products and customer service. She has immense knowledge in aquatic plants and is regularly called upon to advise retailers, landscapers and consultants. She frequently hosts Capel Manor students at Anglo to enhance their knowledge of aquatics. www.angloaquatic.co.uk Jeremy Gay Jeremy is well known within the industry, having edited Practical Fishkeeping and more recently Reefbuilders.com. “Fishkeeping has been my passion for forty years – it is how I’ve earned a living for the last 25 years, and I want the aquatics industry to both survive and thrive so that I can continue my hobby as I always have done, (as well as my career). “OATA is the best way to make our voices heard right up to Government Department levels – the kind of levels that can have a huge impact on the ornamental aquatic trade as we know it. “I want to align with the Captains’ of our industry so that we are best equipped to deal with whatever threats are thrown at us, from legislation to regulation, and I want to do the best job I can to ensure high standards of welfare are maintained at all times. “Fishkeeping is more than just a hobby to me. It’s my life.” Neil Hardy Neil Hardy is a founder member of OATA, a member of the board and has served on a variety of sub-committees. He has 40 years experience of the aquatics industry having started out in his father’s company in his early teens. Neil runs Neil Hardy Aquatica Ltd with his brothers Peter and Jon and now has over 35 staff. The company has more than 3,000 aquariums and ponds and sells all types of tropical and coldwater fishes including a vast selection of the more specialist fishes which are imported and exported all over the world. The company has two additional fish farms producing and growing its own biosecure coldwater fishes. Neil has travelled the world extensively collecting and sourcing fishes and has considerable experience building and designing fish houses, setting up shipping stations etc. Other ventures include the distribution of professional aquatic products, including the popular New Life Spectrum range of high quality fish foods. www.neilhardyaquatica.co.uk Phil Jones Phil Jones has been a devoted fish enthusiast for a remarkable four decades, and his passion for the hobby remains just as strong today as it was in the beginning. With 35 years of experience in the aquatic industry, he’s delved into various aspects of the trade, from retail to wholesale livestock/dry goods and e-commerce. Part of Phil’s career was spent as the CEO of The Pet Shop, the largest online pet retailer in the GCC and MENA regions, based in Dubai, UAE. Upon returning to the UK, he took on the role of Managing Director at KKC Ltd, a wholesaler specializing in marine livestock. As well as this, he also assumed the position of CEO at Swell UK Ltd, the UK’s largest online retailer for aquatic and reptile products. With his extensive experience in the aquatic industry, Phil is eager to give back to the trade. What better way to do so than by serving as a board member on OATA. www.kkcltd.co.uk www.swelluk.com Simon Langdale Simon Langdale is a partner and director of Maidenhead Aquatics and has personally kept fish for almost 30 years. With over 100 stores nationwide Maidenhead Aquatics is one of largest UK retailers of livestock, plants and all aquatic hardware necessary for fishkeeping both in and outdoors. The success of these stores has been built on livestock expertise, high quality aquatic products and outstanding customer service. Simon’s role in the business now takes him worldwide sourcing ethical and sustainable livestock and innovative products to benefit the welfare of livestock and enhance the fishkeeping experience. Simon’s been a member of OATA for many years now and regards the role as vital to promote & protect the trade, to ensure standards of livestock welfare through the UK and identify and address issues within the aquatic industry, representing businesses on their behalf. www.fishkeeper.co.uk Philip Lawton Our family run business Kidsgrove Tropical’s and Water Garden Centre opened in 1983 and has been a member of OATA Since its founding in 1991. I have passed both OATA Advanced diplomas and enjoyed the studying aspect which was required for these courses. Having these diplomas has also assisted my further knowledge which has been helpful to enable me to inform my customers with good quality advice and customer service. Since we began trading in 1983 I have worked in all aspects of this trade from retail sales, stock control, preparing the necessary book work which is required. As a small independent retailer established in this industry for over 30 years I believe I can assist and encourage other smaller retailers to the board to make them aware of OATA and what they have to offer and I am committed to help the association in any way to help safeguard our members and the industry. I bring forward the views and opinions of the smaller independent bricks and mortar retail stores to the board to help secure the future of the aquatic industry. I’ve also worked with OATA towards tackling the inconsistency of local authorities issuing pet licenses throughout the United Kingdom. My hobbies include gardening and after all these years I am still a keen aquarist with a special interest in aquatic gardening and custom built aquarium installations. http://www.kidsgrovetropicals.co.uk/ Rob Peck Rob set up and manages The Coral Centre, a coral farming facility/retail store that also undertake scientific research for coral growth and reef restoration, bridging the gap between hobbyist and scientist.  “I have a real passion to make a difference in the hobby, as we get a better understanding of fish keeping and the impact this can have on the environment. My background is retail marketing and customer experience, learning the trade in the DIY industry, before moving into the aquatic trade. I’m keen to use these skills to help support the delivery of tools that’ll help traders deliver a high standard of customer experience within their shops and online stores. Outside of the trade, I’m a keen marine keeper and avid sports fan.” www.thecoralcentre.co.uk Max Pedley Max Pedley runs Ornamental Aquatics Wholesale. He has eight years of experience working in the aquatic trade, starting in retail positions before moving into an instructor/technician role in the education sector before becoming a Director at Ornamental Aquatics Wholesale. “I became a Director of OATA because I feel I can help the industry with my unique outlook and ‘boots on the ground’ approach to the trade. As a very passionate and active member of the freshwater hobby side of the industry, I also hope to bridge the gap between professionals and hobbyists. I look forward to working with other directors to help overcome challenges the trade faces.” Brian Schaff Brian has over 18 years of experience in the industry with its roots in marine ornamental aquaculture leading to various world firsts in rearing species at commercial scale. Over the years he has developed his experience from managing various departments in the business over various countries and various roles in other trade associations specifically in the Iberian peninsula (AEDPAC and APCPAC). Brian is now a partner and director for TMC. “As Managing Director of Tropical Marine Centre, I have responsiblity for the entire worldwide operations of our centres of excellence in fish as well as their supply lines and customer base, ensuring that TMC upholds its position as Europe’s leading supplier of the highest quality, ethically-sourced marine livestock to the trade.” www.tropicalmarinecentre.com Mark Smith Mark has 25 years’ experience within the pet trade, specialising in aquatics and reptile for the most part. He has been employed with Pets at Home for 22 years, starting in store, moving then to a field sales and welfare role combined. His current role is Pet Welfare Manager for the business. He has a bachelor’s degree in biology and a master’s in environmental sciences, with particular specialisation in introduced freshwater fauna. He has also kept fish for more than 35 years and still has fish, amphibians, reptiles and invertebrates at home, and has a particular interest for the less commonly kept ‘oddball’ species. Maurits van de Pol On the 1st December 1994 I started as a sales representative for Rob’s Shop Services, also known as Dutch Aquarium Supplies, selling tropical plants in the Netherlands. Over the years, Rob’s Shop Services has grown into one of the market leaders in the aquatics trade in Europe and the UK. In 2008 my family and I moved to the UK where I was  managing Aquadistri UK Ltd. I can communicate in several different languages and I have vast experience in Brexit matters both on the products as well as on the live food and ornamental plant sides. I look forward to working closely together with the other directors to tackle the various challenges we face and will face over the next few years. We Accept: Contact Us If you would like to get in touch our office hours are Monday to Friday from 9.00am to 5.00pm. Tel:: 07946 167121 Email: info@ornamentalfish.org Organisation Privacy Policy Cookie Policy Refund Policy We Support: Contact Us If you would like to get in touch our office hours are Monday to Friday from 9.00am to 5.00pm. Tel:: 07946 167121 Email: info@ornamentalfish.org Our Address Ornamental Aquatic Trade Association Ltd (OATA) 1st Floor Office Suite Wessex House 40 Station Road Westbury, Wiltshire  BA13 3JN Copyright The Ornamental Aquatic Trade Association (OATA)"
    }
  ]
}