{
  "fuentes": [
    {
      "url": "https://www.floridacrackercafe.com/about-us",
      "email": "floridacrackercafe@yahoo.com"
    },
    {
      "url": "https://floridacrackercookshack.com/pages/contact",
      "email": "productions@flacracker.com"
    },
    {
      "url": "https://www.tampabay.com/news/business/retail/brooksvilles-popular-florida-cracker-kitchen-aims-at-statewide-expansion/2324945/",
      "email": "ddewitt@tampabay.com"
    },
    {
      "url": "https://www.flacracker.com/contact",
      "email": "productions@flacracker.com"
    }
  ],
  "mails": [
    "ddewitt@tampabay.com",
    "floridacrackercafe@yahoo.com",
    "productions@flacracker.com"
  ],
  "nombre_sitio": "flacracker.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floridacrackercafe.com/about-us",
      "text": "About Us | | Florida Cracker Cafe |St. Augustine Fla. top of page ORDER ONLINE FLORIDA CRACKER CAFE Home Our Menu About Us Photos Post Card Fun Photos Our Shop Contact & Location More Use tab to navigate through the menu items. About Us Weekday Happy Hours Weekend Drink Specials Live Entertainment Kid Menus Family Friendly Pet-Friendly SEE OUR MENU In the mid 1700s pioneers came from other colonies to Florida while it was still an unsettled land handed off to Great Britain by Spain.  These people were woodsman, cow herders and frontiersmen from Virginia and Maryland; they could live off the land by hunting and fishing. ​ The term ' Florida Cracker ” is believed to come from the sound that their whips made as they cracked them while riding horses to herd the cattle.  Still, others say it comes from the crackling sound of dried corn as it was ground to make cornmeal which was a staple of their diet. Florida Crackers are the original Cracker Cowboys.  The term still remains to differentiate the pride of Floridians who were born and raised here for generations, as to those people who have come in from other states to live, and as they are better-known, the original Florida Crackers .  Many of them still live on farms in rural communities and are sprinkled throughout the peninsula’s wetlands as well. ​ Today, you may not be able to hear the cracking of rawhide whips or the stone grinding of the dried corn, but you can still taste famous recipes of yesteryear with our food prepared fresh daily, here at the Florida Cracker Café. What' s a Florida Cracker? Memorabilia Get A FCC Gift CArd FLORIDA CRACKER CAFE Casual Indoor & Patio Dining Hours of Operation Open 6 Days a Week Monday 11-4, Thursday 11-4 Friday 11-9, Saturday 11-9, Sunday 11-6 ​ CLOSED Tuesdays & Wednesday's ​ WEEKDAY HAPPY HOUR & WEEKEND DRINK SPECIALS (904) 829-0397 81 St. George Street Saint Augustine, FL 32084 | FloridaCrackerCafe@yahoo.com Web design by SSG Web Services Terms of Use Privacy Policy bottom of page"
    },
    {
      "url": "https://floridacrackercookshack.com/pages/contact",
      "text": "Contact\n – Florida Cracker Cook Shack Skip to content ORDER COOK SHACK TO-GO TODAY HOME OUR MENU ORDER GRUB TO-GO CATERING SHOP CONTACT Log in Facebook Instagram YouTube Vimeo HOME OUR MENU ORDER GRUB TO-GO CATERING SHOP CONTACT Search Log in Cart Item added to your cart Check out Continue shopping Contact Physical Address: 511 S. Broad Street Brooksville, FL 34601 Mailing Address: PO Box 385 Brooksville, FL 34605 You can reach us at: productions@flacracker.com 352-796-9197 Contact form Name Email * Phone number Comment Send Florida Cracker Cook Shack 511 S Broad St, Brooksville, FL 34601 | (352) 796-9197 Keep up with us & subscribe to our email list! Email Facebook Instagram YouTube Vimeo © 2025, Florida Cracker Cook Shack Powered by Shopify Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.tampabay.com/news/business/retail/brooksvilles-popular-florida-cracker-kitchen-aims-at-statewide-expansion/2324945/",
      "text": "Brooksville's popular Florida Cracker Kitchen aims at statewide expansion Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Business Brooksville's popular Florida Cracker Kitchen aims at statewide expansion Shrimp and grits is a signature dish at Florida Cracker Kitchen, which plans to open more restaurants in the state. By Times Staff Writer Published Times Staff Writer MORE FOR YOU British pub The Moon Under Water finally has a new home • Food Chassahowitzka River campground will likely stay in public hands • Environment Advertisement Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Florida is threatening local transportation like never before, leaders say • Business Former Water Street CEO will now head up Tampa’s Gasworx • Real Estate Florida launches its tax break on guns and ammo Monday • The Buzz on Florida Politics Should more Florida businesses have at-work daycare and other parent perks? • Florida Property insurance companies are thriving now. Are Floridians owed a refund? • Florida A Tampa Brightline could make me a Disney adult | Column • Viewpoints Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.flacracker.com/contact",
      "text": "Contact Us — FLORIDA CRACKER - The Original Floridian 0 Skip to Content Eat & Drink All Locations All Menus Kitchen Tap Room Monkey Bar Lunch On Limoges Cook Shack Fish Company Feed Lot BVL Oyster Bar (Bob's) Keystone Heights Shamrock's Events Jack Daniel's Amp Fishing Tournaments All Events Calendar Catering About Our Story The History Films Destinations All Locations Brooksville Homosassa Florida Cracker Vacation Rentals Real Estate SHOP ONLINE Open Menu Close Menu Open Menu Close Menu Eat & Drink All Locations All Menus Kitchen Tap Room Monkey Bar Lunch On Limoges Cook Shack Fish Company Feed Lot BVL Oyster Bar (Bob's) Keystone Heights Shamrock's Events Jack Daniel's Amp Fishing Tournaments All Events Calendar Catering About Our Story The History Films Destinations All Locations Brooksville Homosassa Florida Cracker Vacation Rentals Real Estate SHOP ONLINE Folder: Eat & Drink Back All Locations All Menus Kitchen Tap Room Monkey Bar Lunch On Limoges Cook Shack Fish Company Feed Lot BVL Oyster Bar (Bob's) Keystone Heights Shamrock's Folder: Events Back Jack Daniel's Amp Fishing Tournaments All Events Calendar Catering Folder: About Back Our Story The History Films Folder: Destinations Back All Locations Brooksville Homosassa Florida Cracker Vacation Rentals Real Estate SHOP ONLINE CONTACT FLORIDA CRACKER For media inquiries, please contact productions@flacracker.com Name * First Name Last Name Email * Phone (###) ### #### Location * Kitchen - Brooksville Cook Shack - Brooksville Tap Room - Brooksville Feed Lot - Webster Fish Company - Citrus Park Lunch On Limoges - Dade City Monkey Bar - Homosassa Oyster Bar & Grill - Keystone Heights Message * Thank you! QUICK LINKS: Home Eat & Drink Events About Destinations Real Estate Catering Menus MISC LINKS: Online Ordering Online Store Dealer Login Join Our Team Contact FAQs Privacy Sitemap Manager Portal MAIN ADDRESS: 966 E Jefferson St, Brooksville, FL 34601"
    }
  ]
}