{
  "fuentes": [
    {
      "url": "https://www.news-press.com/story/news/local/bonita-springs/2015/05/14/flamingo-island-flea-market-bonita-springs-sold/27323365/",
      "email": "sdoane@news-press.com"
    },
    {
      "url": "https://www.flamingoisland.com/covid-19",
      "email": "info@treasureaislesflea.com"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-about",
      "email": "info@treasureaislesflea.com"
    },
    {
      "url": "https://unitedfleamarkets.com/",
      "email": "inquiries@unitedfleamarkets.com"
    },
    {
      "url": "https://www.groupon.com/biz/bonita-springs-fl/flamingo-island-flea-market",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-contact",
      "email": "info@treasureaislesflea.com"
    },
    {
      "url": "https://www.flamingoisland.com/",
      "email": "info@treasureaislesflea.com"
    },
    {
      "url": "https://www.eventsfy.com/venue/flamingo-island-flea-market-11902-bonita-beach-rd-se",
      "email": "info@flamingoisland.com"
    },
    {
      "url": "https://unitedfleamarkets.com/news/united-flea-markets-acquires-south-floridas-flamingo-flea-market",
      "email": "inquiries@unitedfleamarkets.com"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-visit",
      "email": "info@treasureaislesflea.com"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-sell",
      "email": "info@treasureaislesflea.com"
    }
  ],
  "mails": [
    "info@flamingoisland.com",
    "info@treasureaislesflea.com",
    "inquiries@unitedfleamarkets.com",
    "sdoane@news-press.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "flamingoisland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.news-press.com/story/news/local/bonita-springs/2015/05/14/flamingo-island-flea-market-bonita-springs-sold/27323365/",
      "text": "Flamingo Island Flea Market in Bonita Springs sold Who's gonna win? SWFL previews, winner predictions for high school football Week 4 News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals BONITA SPRINGS Flamingo Island Flea Market in Bonita Springs sold STEVE DOANE SDOANE@NEWS-PRESS.COM Bonita Springs' largest flea market is coming under new ownership. The Flamingo Island Flea Market was sold this week to a Colorado-based management company for $8.5 million after being quietly marketed. \"There has been a lot of interest. It's a unique property and we wanted to find someone who could take it to the next level,\" said Dougall McCorkle, a senior sales associate with Premier Commercial. The market is located on 14.6 acres near Interstate 75 and Bonita Beach Road and has 170 vendors selling a wide variety of produce and goods from two buildings totaling 81,000 square feet. The facility opened in 1999. The property was assessed in 2014 for $3.2 million, according to Lee County land documents. The ownership group, Flamingo Island Market, Ltd., was the original developer. The buyer is identified on the deed as FIFM RE, LLC, but the company's address is associated with the Mile High Flea Market in Denver, one of the largest flea markets in the region. Attempts to contact the buyer were not returned. McCorkle and Michael Lynch of MLPA Realty brokered the sale as representatives for the sellers. The flea market is open from 8 a.m. to 4 p.m Friday-Sunday and last year attracted about 250,000 visitors, McCorkle said. The market is well-positioned in the region due to its proximity to two well-traveled roads and because vendors sell new goods, not used or cheaply made products. The new ownership is looking to capitalize on that and expand Flamingo Island's business. Connect with this reporter on Twitter: @Steve_Doane_ and facebook.com/SteveDoaneJournalist Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    },
    {
      "url": "https://www.flamingoisland.com/covid-19",
      "text": "Flamingo Island Flea Market - COVID19 (513)-539-4497 320 N Garver Rd, Monroe, OH 45050 Sat & Sun 9am-5pm Book Your Space COVID-19 Updates COVID-19 Updates COVID-19 Updates Home Visit Sell About Contact COVID-19 UPDATES TREASURE AISLES SELLER & BUYER RULES We are open and operating full business hours. We are monitoring and following all local government guidelines regarding COVID 19. All of our team members are encouraged to wear masks. We are cleaning all high traffic areas more often and have sneeze guards installed at all concession stands and flea market office and entry points. Please follow the below rules to help protect us all and keep the flea market open. SELLER RULES â¢ All vendors and vendor employees must maintain social distance requirement of 6 feet at all times. â â¢All vendors and vendor employees must wear a face mask at all times. â â¢All vendors and vendor employees must stay within designated selling area at all times. â â¢No cutting or sampling of any produce items. â â¢Do not come to the market if you are sick. â â¢Please wash your hands and avoid touching your face. â â¢We encourage all vendors to arrive at the market with personal hand sanitizer, use it often. BUYER RULES â¢All buyers must maintain social distance requirement of 6 feet at all times. â â¢All buyers are required to wear masks/face covering while at the marketÂ â â¢Do not come to the market if you are sick. â â¢Please wash your hands and avoid touching your face. â â¢Please use a tissue or the inside of your elbow when you cough and/or sneeze and discard of the tissue properly. â â¢Wash your hands. â â¢Follow all posted signage around the market. Content Home Visit Sell About Contact Contact (513)-539-4497 320 N Garver Rd, Monroe, OH 45050 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es NOW HIRING - APPLYÂ ONLINE"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-about",
      "text": "Flamingo Island Flea - About (239)-948-7799 11902 Bonita Beach Road SE, Bonita Springs, FL 34135 Fri, Sat & Sun 8am-4pm Book Your Space COVID-19 Updates Home Visit Sell About Contact COVID-19 Updates About Us Flamingo Island Flea Market Flamingo Island Flea Market Flamingo Island is a proud member of United Flea Markets Located in Bonita Springs exit 116 off I-75, near Naples, Florida, Flamingo Island Flea Market welcomes some 600 seller spaces, and is packed with bargains on anything from fresh tomatoes to new sunglasses, plus six restaurants, a tiki bar, small farmers market, live music and more. Open every Friday, Saturday and Sunday. United Flea Markets Flamingo Island Flea Market is a proud member of United Flea Markets. United Flea Markets was born out of a passion for the enduring, contemporary flea market business that always adds fun, affordability and local flavor to its communities. United Flea Markets understands that experience and diversity represent an important component of a market's value. We are on a mission to listen, relate and evolve to build on the past success of those who have come before us. United Flea Markets Career Center Check out our Career Center with United Flea Markets for job opening and to apply. Join the Fun Content Home Visit Sell About Contact Contact (239) 948-7799 11902 Bonita Beach Rd SE, Bonita Springs, FL 34135 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es"
    },
    {
      "url": "https://unitedfleamarkets.com/",
      "text": "United Flea Markets: Owners and Operators of community flea markets Menu × Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact Small-company agility. Large-company resources. Small-company agility. Large-company resources. Small-company agility. Large-company resources. United Flea Markets was born out of a passion for the contemporary flea market —an enduring business model that creates fun, affordability and local flavor in the communities we call home. As owners and operators of diverse community flea markets around the country, United Flea Markets is growing with intention. We’re helping our new markets soar by balancing on-the-ground experience, solid capital, corporate resources and best-of-class operations with a highly creative and flexible approach, structure and perspective. dots Our Nationwide Markets See all Markets We’re on a mission to listen, relate and evolve to build on the past success of those who have come before us. Blog Preview United Flea Markets Embraces the Cloud: 15 Markets Upgrade to Booth Tracker Cloud In partnership with E-SoftSys , our trusted technology provider, we’ve completed a seamless migration from the legacy Booth Tracker setup to Booth Tracker Cloud, a move that brings real benefits to our daily operations. Read more Featured Market Treasure Aisles Flea Market Monroe, OH Established: 1991 Visitors annually: 500,000 Vendors weekly: 500 Read more We're owners and operators first. Why sell your market? Keeping the culture! dots Have a question? We'd love to hear from you. Send Message Working with United Flea Markets was incredibly simple, and integrating our company has been seamless. UFM has made sure over the past couple of years to maintain our great culture and keep our employees happy and inspired. General Manager, Flamingo Island Flea Market selling spaces (combined UFM Family of Markets) states food establishments Millions of shoppers Hundreds of employees Countless kids rides and entertainment experiences Home About Markets News/Blog Contact inquiries@unitedfleamarkets.com • 720.592.0260 7007 E. 88th Ave., Henderson, CO 80640 ©2025 United Flea Markets. Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.groupon.com/biz/bonita-springs-fl/flamingo-island-flea-market",
      "text": "Flamingo Island Flea Market, 11902 Bonita Beach Road Southeast, Bonita Springs, FL - Groupon The Great Savings Event. Use code: SAVENOW & save up to 30%. Shop Now! Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Flamingo Island Flea Market, Bonita Springs Flamingo Island Flea Market, Bonita Springs 11902 Bonita Beach Road Southeast, Bonita Springs, FL 34135 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals Costco One-Year Costco Membership with $100 off $200 on Costco.com $65 Sam's Club Up to 50% Off on Sam’s Club Membership $50 $25 -50% 4.3 (112,081) Popular Gift HelloFresh Meal Kits - Fresh Ingredients Delivered $141.86 $89.99 -37% $71.99 Sign in to apply discount 4 (25,902) Sal's Beverage World ( 3 Locations ) Uncork a Deal: Up to 50% Off Wine at Sal's Beverage 695 West Saint Charles Road, Elmhurst 17.2 mi $50 $40 -20% $32 Sign in to apply discount Gobble: 1 or 2 Weeks of Easy Dinners for Two Gobble: One or Two Weeks of Classic, Lean & Clean, or Vegetarian Dinners for Two $150.87 $70 -54% $56 Sign in to apply discount 4 (2,001) Heybeck's Meat Market ( 2 Locations ) $15 For $30 Toward Any Store Purchase 333 West Northwest Highway, Palatine 27.6 mi $30 $15 -50% Own a Napa Vineyard 40% Off Annual Ownership of Two Vines at a Napa Vineyard 1003 Dealy Ln, Napa 1840.0 mi $198 $119 -40% $83.30 Sign in to apply discount 4.6 (156) Olive 'N Vinnies Market Explore Flavored Olive Oils and Balsamic Vinegars Selection 449 Main St., Glen Ellyn 22.8 mi $26 $13 -50% $10.40 Sign in to apply discount 4.9 (998) Join now and get 50% off a Club membership. That's only $25! How to reach us © MapTiler © OpenStreetMap contributors Flamingo Island Flea Market 1124.7 mi 11902 Bonita Beach Road Southeast, Bonita Springs, FL 34135 Open Closes at 4:00 PM Open Closes at 4:00 PM Call Directions Visit website +12399487799 http://flamingoisland.com About Flamingo Island Flea Market If you're looking for a way to switch up your tired routine, Bonita Springs's Flamingo Island Flea Market is the place for you. Flamingo Island Flea Market's patrons can find places to park in the area. Flamingo Island Flea Market is obviously the place to be, so get your calendar out and make plans to visit it soon. Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-contact",
      "text": "Flamingo Island Flea - Contact (239)-948-7799 11902 Bonita Beach Road SE, Bonita Springs, FL 34135 Fri, Sat & Sun 8am-4pm Book Your Space COVID-19 Updates Home Visit Sell About Contact COVID-19 Updates Contact Flamingo Island Flea Market Stay in Touch With Us Stay in Touch with Us Location 11902 Bonita Beach Rd SE Bonita Springs, FL 34135 Hours Flea Market Hours Friday, Saturday & Sunday 8am-4pm Office Hours Thursday - Sunday 8am-4pm Phone (239)-948-7799 Social Follow us on social media Send us a message We will respond as soon as possible Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Come See Us! 11902 Bonita Beach Rd SE Bonita Springs, FL 34135 (239) 948-7799 Content Home Visit Sell About Contact Contact (239) 948-7799 11902 Bonita Beach Rd SE, Bonita Springs, FL 34135 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es"
    },
    {
      "url": "https://www.flamingoisland.com/",
      "text": "Flamingo Island Flea - Home OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND OPEN YEAR ROUND HALLOWEEN EVENT SATURDAY, OCTOBER 25 EVENT INFO (239) 948-7799 11902 Bonita Beach Road SE, Bonita Springs, FL 34135 Fri, Sat & Sun 8am-4pm Book Your Space LIVE Market Map COVID-19 Updates Home Visit Sell About Contact COVID-19 Updates Open Year Round Flamingo Island Flea Market is OPEN all year round, every Friday, Saturday and Sunday from January â December. Visit Us Start Your Business Open a store front and sell at Flamingo Island Flea Market. Â Easy and flexible options for renting a space. Sell With Us Follow Us on Facebook Keep up with everything going on at Flamingo Island by connecting with us on Facebook. Facebook Amazing Finds at Flamingo Island Find everything from new items to collectables here at Flamingo Island. Visit Us Explore FLAMINGOÂ ISLAND Flea Market Sell Your Treasures Become a seller at Treasure Aisles Flea Market and hop aboard to make some extra cash.Â  We host thousands of barrrrgain hunters every weekend. Indoor and outdoor spaces available. Learn More Enjoy Some Grub Grub and BARRRRGAINS!Â  You can enjoy a drink and chow down on some good grub all while you shop! Enjoy the food at one of our many concessions: Pirate's Cove, Main Deck Grub ân Galley, and La Isla del Quetzal. Visit Us Explore Flamingo Island Flea Market Shop Flamingo Island If you love to shop, Flamingo Island Flea Market is the place for you. We host vendors from all over the world with items you won't find anywhere else at prices you can't beat. Visit Us Sell With Us Looking to start your own business? Flamingo Island Flea Market is the place for you. We host a wide mix of customer demographics, a clean and well maintained market with air conditioning for seller and buyer comfort. Sell With Us Great Eats While you shop, sell, and spend the day at Flamingo Island Flea Market you can grab a bite to eat at one of the many restaurants inside the market. You can enjoy tacos, nachos, coffee, ice cream, snacks and more! Don't forget to enjoy a beer or fresh squeezed lemonade! Visit Us Yo Ho Ho! Watch our video. Great Variety \"I was here on a weekend, great variety of everything! I love the homemade popcorn and the candlelight shop! Great deals on all items, live bands and to add they allow pets in a stroller ! I will be back again!!\" Wendy C. | Yelp Cool Items \"This place was super fun. Our family enjoyed checking out all the interesting items that are offered. Of course the fact that you can grab a beer and sangria and walk around and shop is also a bonus! We found a bunch of cool items for each member of the family! We will be back!\" Jessica M. | Google Review Vendors are Great \"The vendors are great and always relatively negotiable on their wares. They have the most unusual items for sale. Great rain day adventure to kill a couple hours.\" kdhill84 | TripAdvisor Come Join the Fun! If you love to shop, Flamingo Island Flea Market is the place for you. We host vendors from all over the world with items you won't find anywhere else at prices you can't beat. Join the Fun Content Home Visit Sell About Contact Contact (239) 948-7799 11902 Bonita Beach Rd SE, Bonita Springs, FL 34135 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es"
    },
    {
      "url": "https://www.eventsfy.com/venue/flamingo-island-flea-market-11902-bonita-beach-rd-se",
      "text": "Flamingo Island Flea Market in Bonita Springs, FL | Eventsfy we feedback Back home / venue / flamingo island flea market 0 Fans Track Review Edit Venue Report Add Images Add Event × Report problem for : Flamingo Island Flea Market Sign In SIGN IN SIGN UP Forgot password? 0 Fans Track Review Edit Venue Report Add Images Flamingo Island Flea Market info@flamingoisland.com flamingoisland.com/ (239) 948-7799 View on Map 11902 Bonita Beach Rd Se bonita springs, FL 34135 Show venue on map Like and Share this Venue Copy venue link Venue Information Flea market in Bonita Springs, Florida We have hundreds of local vendors with the best prices on the best stuff. Whether you are searching for that one of a kind antique find, or general goods we have it all. You can take a break from shopping and enjoy some tasty food and cook beverages at any of our great restaurants. If you are looking to make some money you can also sign up to sell your stuff at our market. Flamingo Island has it all. Add comment Upcoming Events (0) Flamingo Island Flea Market info@flamingoisland.com flamingoisland.com/ (239) 948-7799 View on Map 11902 Bonita Beach Rd Se bonita springs, FL 34135 Show venue on map Like and Share this Venue Copy venue link × Copy event link MORE INFO PROMOTE × Title for  :Flamingo Island Flea Market Sign In SIGN IN SIGN UP Forgot password? × Please provide your feedback How can we make Eventsfy better for YOU? * Email * Send Feedback"
    },
    {
      "url": "https://unitedfleamarkets.com/news/united-flea-markets-acquires-south-floridas-flamingo-flea-market",
      "text": "United Flea Markets Acquires South Florida’s Flamingo Flea Market | United Flea Markets Menu × Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact Home About Background Carrying on Legacies Approach Aquisitions Leadership/Ownership Team Markets Our Mission Mile High Flea Market Flamingo Island Flea Market T&W Flea Market Awesome Flea Market J&J Flea Market Ramona Flea Market Cooks Flea Market Mobile Flea Market Rubidoux Drive-in Theatre Swap Meet Keller's Flea Market Colorado Springs Flea Market Tanque Verde Swap Meet Fleamasters Flea Market Treasure Aisles Flea Market Cole's Flea Market News/Blog Contact United Flea Markets Acquires South Florida’s Flamingo Flea Market May 15, 2015, Denver – United Flea Markets, owners of the successful Mile High Flea Market in Denver, have recently the Flamingo Island Flea Market in Bonita Springs, Fla. for an undisclosed amount. United Flea Markets plans to continue the successful operation of this Florida-based market while improving and enhancing the experience overall. “We have a deep understanding of the flea market business and the ever-changing needs and desires of both buyers and sellers,” said Rob Sieban, co-partner of United Flea Market and a member of the National Flea Market Association. “We will work diligently to deliver top-notch service to today’s consumers and entrepreneurs while maximizing opportunities to growth.” In addition to today’s acquisition news, United Flea Market is actively seeking additional investments in its portfolio of successful flea markets. “We bring small-company agility with finely tuned business acumen to our markets, and owners can rest assured that we value and respect their businesses.” According to the National Flea Market Association there are more than 1,100 flea markets that are visited by more than 150 million customers each year, totally more than $30 billion in annual sales. With 10 unique markets, Florida is among the popular states for flea markets. Flamingo Island Flea Market will continue to operate normally during the transition. United Flea Markets is committed to preserving the culture, integrity and community aspect of Flamingo Island and each market it works with. Flea markets owners interested in learning more about investments from United Flea Markets can visit unitedfleamarkets.com or call 303-289-4656. dots Home About Markets News/Blog Contact inquiries@unitedfleamarkets.com • 720.592.0260 7007 E. 88th Ave., Henderson, CO 80640 ©2025 United Flea Markets. Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-visit",
      "text": "Flamingo Island Flea - Visit (239)-948-7799 11902 Bonita Beach Road SE, Bonita Springs, FL 34135 Fri, Sat & Sun 8am-4pm Book Your Space COVID-19 Updates Home Visit Sell About Contact COVID-19 Updates Visit Us Flamingo Island Flea Market Explore Flamingo Island Flea Market Plan Your Visit Come enjoy all the flea market fun at Flamingo Island every weekend all year long and shop with over 600 different vendors both indoor and outdoor. Visit Us Hours Friday, Saturday, & Sunday 8am - 4pm Open All Year Round Admission Free Admission Free Parking Grab a Bite Tacos, Mexican Food, Beer, Lemonade, Pho, Fries, Burgers, you name it, you can eat it here while you shop! Restaurants have seating so you can really relax while you eat and shop. Visit Us Shop. Shop. Shop. You can find everything at Flamingo Island Flea Market. Men and Women's fashion clothing, fishing gear, kitchen accessories, golf gear and accessories, wigs, makeup, jewelry, clocks, artwork, dog clothing and accessories, plants, fresh produce, lights, home decor and so much more! Visit Us Visit us! Event Calendar There is something always going on at Flamingo Island Flea Market. For a full list and details on Events, visit our Facebook Flamingo Island Facebook Content Home Visit Sell About Contact Contact (239) 948-7799 11902 Bonita Beach Rd SE, Bonita Springs, FL 34135 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es"
    },
    {
      "url": "https://www.flamingoisland.com/flamingo-island-flea-sell",
      "text": "Flamingo Island Flea - Sell (239)-948-7799 11902 Bonita Beach Road SE, Bonita Springs, FL 34135 Fri, Sat & Sun 8am-4pm Book Your Space COVID-19 Updates Home Visit Sell About Contact COVID-19 Updates Sell With Us Flamingo Island Flea Market Sell at Flamingo Island Flea Market Select Flamingo Red or Dolphin Blue Flamingo Red Dolphin Blue Aisle Space $225.57 10' x 14' or 20' Booth Season Rate Monthly Rental ONLY High Traffic Area Other Taxes & Fees Apply NOÂ REFUNDS $20 SELLERÂ RULES Request Your Space 10'x10' Space 10' x 14' Booth $421.27 Season Rate Monthly Rental ONLY High Traffic Area Other Taxes & Fees Apply NOÂ REFUNDS $25 SELLERÂ RULES Request Your Space 10'x20' Space $596.37 10' x 14' Booth Season Rate Monthly Rental ONLY High Traffic Area Other Taxes & Fees Apply NOÂ REFUNDS $22 SELLERÂ RULES Request Your Space Restaurants/Food &Â Beverage Looking to sell food at Flamingo Island? Flamingo Island welcomes restaurants and food and beverage vendors. All food vendors must be approved by the Market General Manager. Call us with questions at 239-948-7799 Request Your Space Pay Prior Balance Online If you are a current seller you can pay your prior balance online. Click the PAY NOW button and select \"Seller Login\" to pay your prior balance. Pay Now Daily &Â Weekend Online Booking Looking to book a space for the day or weekend only? You can book your space online. Super easy and convenient, click the BOOKÂ NOW button and select \"New Seller\". Book Now Freddie's Seller Resource Guide Check out our FREEÂ online guide with information and resources on selling at a flea market. Click below to be taken to the online resource guide. Seller Resource Guide Daily 10' x 14' or 20' Booth Sell by the Day Season Rates Aisle Space $18.54 10'x10' Space $33.99 10'x20' Space $47.38 Other Taxes & Fees Apply NOÂ REFUNDS $20 SELLERÂ RULES Request Your Space 10' x 14' Booth Weekly Sell by the Week Season Rates Aisle Space $49.44 10'x10' Space $93.73 10'x20' Space $130.81 Other Taxes & Fees Apply NOÂ REFUNDS $25 SELLERÂ RULES Request Your Space Monthly 10' x 14' Booth Sell by the Month Season Rates Aisle Space $194.67 10'x10' Space $369.77 10'x20' Space $513.97 Other Taxes & Fees Apply NOÂ REFUNDS $22 SELLERÂ RULES Request Your Space Outside Concessions Looking to sell food at Flamingo Island? Flamingo Island welcomes concession vendors. All food vendors must be approved by the Market General Manager. Call us with questions at 239-948-7799 Request Your Space Pay Prior Balance Online If you are a current seller you can pay your prior balance online. Click the PAY NOW button below to pay your prior balance. Pay Now Daily &Â Weekend Online Booking Looking to book a space for the day or weekend only? You can book your space online. Super easy and convenient, click the BOOKÂ NOW button and select \"New Seller\". Book Now Freddie's Seller Resource Guide Check out our FREEÂ online guide with information and resources on selling at a flea market. Click below to be taken to the online resource guide. Seller Resource Guide TOP 6 REASONS TO Sell at Flamingo Island # 1 Flexible Options You can sell for the day, weekend or the month. # 3 Affordable Start selling in an aisle space for as little as $24. # 2 No Long Term Commitment We do not require long term leases. # 4 Startup Business Have the ability to start your own business. # 6 Fun Fun Fun! Enjoy selling your stuff at Flamingo Island. # 5 Foot Traffic We welcome anywhere from 2,000-12,000 people a weekend. Vendor Info Rules / FAQ Know more about selling at Flaming Island Flea Market and check out our rules and regulations HERE. We require information to sell at the market, check out the required information HERE. WHEN CAN IÂ ACCESS MY INDOOR SPACE? Thursday 8a-4p and Fri/Sat/Sun 7a-8p CAN I SELL FIREARMS? No. CAN I SELL PETS? NO pet sales are allowed at the market at all. NO animals are allowed to be given away for FREE either. Only service animals are allowed on property. CAN I SELL FOOD AND DRINKS? Flamingo Island welcomes restaurants and food and beverage vendors. All food vendors must be approved by the Market General Manager. WHAT IS NOT PERMITTED TO BE SOLD AT THE MARKET? The following items are not permitted: dogs, cats, any other animals, baby food, infant formula, alcoholic beverages, illegal items, bootleg or counterfeit items, coin operated gumball or candy machines, petition signings, and any item deemed objectionable (at the sole discretion of Flamingo Island). Games of chance are not allowed. Adult and X-rated materials are not allowed. Additional rent may be required for certain items. The Market may not be used to further political agendas, parties, elections, issues, or candidates. HOW DO I BOOK A SPACE? You can call the office at 239-948-7799, go to the market Thursday - Sunday, 8am-4pm, show up the day of on the weekend OR fill out our Request to Book a Space form. \"I love being a vendor here at the market! My fellow vendors are very friendly and they are always being helpful to our customers. There are a large variety of items here and itâs great to shop in the rain!!!! you wonât get wet here at flamingo Island\" Beth M. | Google Review Frequently asked questions Duis aute irure dolor in reprehenderit in voluptate velit? Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. What is Legowerk? Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Wait, but why? Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. How does it work? Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ready to Start Selling? Request to Book Fill out the form below to request to book your space and we will be in touch with you shortly. Fields marked with an asterisk (*) are required. Name * Email * Phone number * Message * Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Content Home Visit Sell About Contact Contact (239) 948-7799 11902 Bonita Beach Rd SE, Bonita Springs, FL 34135 Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. En Es"
    }
  ]
}