{
  "fuentes": [
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "admissions@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "advisor@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "alumni@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "careers@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "info@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "email": "marketing@hiberniacollege.net"
    },
    {
      "url": "https://hiberniacollege.com/about-us/",
      "email": "info@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "aao@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "admissions@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "finance@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "helpdesk@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "pprimaryadmissions@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "primaryadmissions@hiberniacollege.net"
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "email": "studentadmin@hiberniacollege.net"
    },
    {
      "url": "https://www.hibernia.edu.au/about-us/",
      "email": "principal@hibernia.edu.au"
    },
    {
      "url": "https://north.hibernianpub.com/contact-us/",
      "email": "info@hibernianpub.com"
    },
    {
      "url": "https://www.littlerock.com/directory/hibernia-irish-tavern/",
      "email": "info@littlerock.com"
    }
  ],
  "mails": [
    "aao@hiberniacollege.net",
    "admissions@hiberniacollege.net",
    "advisor@hiberniacollege.net",
    "alumni@hiberniacollege.net",
    "careers@hiberniacollege.net",
    "finance@hiberniacollege.net",
    "helpdesk@hiberniacollege.net",
    "info@hiberniacollege.net",
    "info@hibernianpub.com",
    "info@littlerock.com",
    "marketing@hiberniacollege.net",
    "pprimaryadmissions@hiberniacollege.net",
    "primaryadmissions@hiberniacollege.net",
    "principal@hibernia.edu.au",
    "studentadmin@hiberniacollege.net"
  ],
  "nombre_sitio": "flemingislandgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hiberniacollege.com/contact-us/",
      "text": "Contact Us - Hibernia College Skip to content Student & Faculty Login Contact Us Facebook X LinkedIn Instagram MENU Request info Apply now MENU Study with Us Programmes PME in Primary Education PME in Post-Primary Education MA/PG Dip (Arts) in Inclusive and Special Education Master of Arts in Education BEd (Hons) in Early Childhood Education BSc (Hons) in Nursing in General Nursing MSc in Corporate Governance PG Dip (Science) in Business Data Analytics Continuing Professional Development Blended Learning Student Support Alumni Profiles Apply Now About Us About Us Key People School of Education School Placement Partner Resources School Placement Partner Resources PME (Primary) School Placement Partner Resources PME (Post-Primary) Meet the Faculty Nursing Partner Resources Adjunct Faculty Opportunities Careers Our Research Research at Hibernia College Student Research Digital Library IASC Events News Student and Faculty Login Contact Us MENU Study with Us Programmes PME in Primary Education PME in Post-Primary Education MA/PG Dip (Arts) in Inclusive and Special Education Master of Arts in Education BEd (Hons) in Early Childhood Education BSc (Hons) in Nursing in General Nursing MSc in Corporate Governance PG Dip (Science) in Business Data Analytics Continuing Professional Development Blended Learning Student Support Alumni Profiles Apply Now About Us About Us Key People School of Education School Placement Partner Resources School Placement Partner Resources PME (Primary) School Placement Partner Resources PME (Post-Primary) Meet the Faculty Nursing Partner Resources Adjunct Faculty Opportunities Careers Our Research Research at Hibernia College Student Research Digital Library IASC Events News Student and Faculty Login Contact Us Contact Hibernia College Get in Touch Want to study with us? Our Enrolment team is here to answer any questions about your programme of interest. Call us on +353 (0)1 661 0168 (Option 2). We make learning engaging and accessible so that people can fulfil their potential and realise their ambitions. Get in touch to see if one of our programmes is right for you. Applicants If you have a query about one of our programmes or are in the process of making an application, contact: advisor@hiberniacollege.net or call (01) 661 0168 (Option 2) If you are awaiting an interview or have received correspondence from the Admissions team, contact: admissions@hiberniacollege.net or call (01) 661 0168 (Option 3) Current Students If you are a current student, log in to your student portal to access your courses as well as tools and support. go to hibernia college home Alumni All recent graduates are automatically members of the Hibernia College Alumni Association (HCAA). If you are a Hibernia College graduate, we would love to hear from you. To share your alumni journey and connect with prospective and current students as well as fellow alumni, please contact: alumni@hiberniacollege.net Career Opportunities To view our current openings, visit our Careers page. view careers If you are interested in working for Hibernia College, please send your CV, cover letter and enquiry to: careers@hiberniacollege.net Media Enquiries If you are a member of the media, please contact: marketing@hiberniacollege.net Our Location DUBLIN Hibernia College Suite 3, The Academy Building, 42 Pearse Street, Dublin 2 WESTPORT Hibernia College Technical Hub James Street Westport Co. Mayo F28 PW83 Take the next step Schedule a Call APPLY NOW +353 (0)1 661 0168 info@hiberniacollege.net Facebook X LinkedIn Instagram Privacy Policy Intellectual Property Policy Learner Protection Insurance Careers © Hibernia College 2025. All rights reserved. Hibernia College is a private unlimited company registered in Ireland under number 328066 with its registered office at Hibernia College, Suite 3, The Academy Building, 42 Pearse Street, Dublin 2. Hibernia College, Coláiste Hibernia and the Hibernia College crest are trademarks of Hibernia College."
    },
    {
      "url": "https://hiberniacollege.com/about-us/",
      "text": "About Us - Hibernia College Skip to content Student & Faculty Login Contact Us Facebook X LinkedIn Instagram MENU Request info Apply now MENU Study with Us Programmes PME in Primary Education PME in Post-Primary Education MA/PG Dip (Arts) in Inclusive and Special Education Master of Arts in Education BEd (Hons) in Early Childhood Education BSc (Hons) in Nursing in General Nursing MSc in Corporate Governance PG Dip (Science) in Business Data Analytics Continuing Professional Development Blended Learning Student Support Alumni Profiles Apply Now About Us About Us Key People School of Education School Placement Partner Resources School Placement Partner Resources PME (Primary) School Placement Partner Resources PME (Post-Primary) Meet the Faculty Nursing Partner Resources Adjunct Faculty Opportunities Careers Our Research Research at Hibernia College Student Research Digital Library IASC Events News Student and Faculty Login Contact Us MENU Study with Us Programmes PME in Primary Education PME in Post-Primary Education MA/PG Dip (Arts) in Inclusive and Special Education Master of Arts in Education BEd (Hons) in Early Childhood Education BSc (Hons) in Nursing in General Nursing MSc in Corporate Governance PG Dip (Science) in Business Data Analytics Continuing Professional Development Blended Learning Student Support Alumni Profiles Apply Now About Us About Us Key People School of Education School Placement Partner Resources School Placement Partner Resources PME (Primary) School Placement Partner Resources PME (Post-Primary) Meet the Faculty Nursing Partner Resources Adjunct Faculty Opportunities Careers Our Research Research at Hibernia College Student Research Digital Library IASC Events News Student and Faculty Login Contact Us About Hibernia College Flexible, blended learning Hibernia College is a leader in pioneering new education technologies and embracing change in the ever-evolving world of education. We have developed a model of online education that continually builds on the interactions between students and faculty and helps people meet their academic and professional goals. REQUEST INFO LEARN MORE Our History Founded by Dr Seán Rowland in 2000, Hibernia College follows an ambitious and forward-thinking strategy in order to play a leading role in education for the future. Dr Rowland brought together colleagues from the corporate, education and technology communities to establish Hibernia College, Ireland’s first third-level institution to offer accredited courses online. We aspire to be a leading, high-quality educational institution of national and international importance, delivering distinctive technology-enhanced educational opportunities for our students to prepare them for complex professional roles in a rapidly changing technological world. Our Purpose and Vision Our purpose is to make learning easy, engaging and accessible so that people can fulfil their potential and realise their ambitions. Our vision is to be valued, respected and trusted as an organisation that, through outstanding learning experiences, enables people to reach their learning goals. About the College Hibernia College Quality Framework The Hibernia College Quality Framework (HCQF) reflects the College’s ongoing commitment to international best practice through a range of mechanisms that seek to continually monitor, review and enhance our programmes and our College. The HCQF is regularly reviewed for its effectiveness. Input from key stakeholders such as students, staff, employers and faculty is an important dimension of our Framework. This ongoing involvement of all internal and external stakeholders is emphasised throughout the policy and procedure documents. In line with the College’s commitment to quality, the HCQF has its own dedicated website . Sectoral Engagement Hibernia College is committed to engaging in the wider higher education community. Recent engagements, at sectoral level, include: European Distance and E-Learning Network (EDEN) HECA’s Academic Quality Enhancement Forum National Academic Integrity Network National Forum for the Enhancement of Teaching and Learning in Higher Education National Forum digital badge re-development working groups The Learnovate Centre in Trinity College Dublin The College also actively contributes and engages with public consultations and sectoral research including contributions to: QQI Reengagement Report Green Paper on Assessment Report The Impact of COVID-19 Modifications to Teaching, Learning and Assessment in Irish Further Education and Training and Higher Education SPARQS Engaging Students in Online Distance Learning AHEAD Charter Hibernia College fully adopts the AHEAD Charter for Inclusive Teaching and Learning . In line with the Charter, the College’s quality assurance procedures incorporate the voice, and reflect the requirements, of all students, including students with disabilities and those from other minority groups. The College actively encourages feedback and welcomes any recommendations and suggestions for further enhancement in this regard. Erasmus+ Hibernia College was first awarded the Erasmus+ Charter in October 2016. We have collaborated with Technische Universität Wien (Austria), West University of Timișoara (Romania) and Centro Autonómico de Formación e Innovación (Spain) on Erasmus+ mobility programmes, supporting educational collaboration across Europe. View our Erasmus Policy Statement here . Our Guarantee to You Hibernia College has approval, under s.65 (4) (b) of the Qualifications and Quality Assurance (Education and Training) Act 2012, to offer students Learner Protection Insurance. Learner Protection Insurance is only in place when each student receives their insurance policy. Each student should ensure that they receive a Learner Protection Insurance Policy in their name. Learner Protection Insurance is provided by Arachas and is underwritten by Aviva Insurance Ireland DAC. The Learner Protection Policy provides for a refund of fees, as specified in the 2012 Act. In some circumstances, it may be possible for a student to transfer to a similar programme with another provider. In such circumstances, the student may opt to receive the cost of an alternative similar academic programme. Transfer to another programme is always only a second option. The Learner Protection Insurance Policy is governed by s.65 (4) (b) of the Qualifications and Quality Assurance (Education and Training) Act 2012. For more details, read about Learner Protection . Lifelong professional support in fellow Hibernia College Alumni OUR ALUMNI A supportive community, online and offline Meet the Faculty Our faculty prioritise the interests of students and are experts in their fields. They actively engage in research and pursue wide-ranging research interests while creating a supportive learning environment. our FACULTY Key People at Hibernia College Our team has a combined wealth of experience across multiple sectors to provide the leadership Hibernia College has leveraged to consistently offer the best in blended learning. OUR PEOPLE Memberships and Accreditation Our academic programmes are validated by Quality and Qualifications Ireland (QQI) and are accredited by the relevant professional accreditation bodies, including The Teaching Council and the Nursing and Midwifery Board of Ireland. We are a proud member of the Higher Education Colleges Association (HECA) and the European Distance and E-Learning Network (EDEN), and we have held an Erasmus+ Charter since October 2016. The College undertook two major successful QA reviews in 2024, a review of the HCQF to ensure it is fit for purpose for full online delivery, this was successfully completed in November 2024. The second major review was a CINNTE Institutional Review, the College was pleased to host an external panel over the course of a week in October 2024 which culminated in a final review report published here and a follow up implementation plan . Take the next step Schedule a Call APPLY NOW +353 (0)1 661 0168 info@hiberniacollege.net Facebook X LinkedIn Instagram Privacy Policy Intellectual Property Policy Learner Protection Insurance Careers © Hibernia College 2025. All rights reserved. Hibernia College is a private unlimited company registered in Ireland under number 328066 with its registered office at Hibernia College, Suite 3, The Academy Building, 42 Pearse Street, Dublin 2. Hibernia College, Coláiste Hibernia and the Hibernia College crest are trademarks of Hibernia College."
    },
    {
      "url": "https://studenthelpdesk.hiberniacollege.net/en-ie/contact-us/",
      "text": "Contact Us\r\n\t\t · Hibernia College Helpdesk You’re offline. This is a read only version of the page. Toggle navigation Home Announcements Knowledge Base Search English Home Contact Us Contact Us For assistance with course-related queries, you can call our technical support and programme administration teams to open a case. You can also open a case by email or live text chat (Technical Support only). Technical Support Our Technical Support team can assist you with any IT-related queries, including: Accessing webinars and tutorials using ZOOM. TM Uploading and submitting your work Accessing and engaging with your course content Updating passwords and profiles Technical queries about MyHELMS and other College systems You can contact the Technical Support team as follows: Email Email helpdesk@hiberniacollege.net (This will automatically open a case with the Technical Support team.) Live Text Chat Select the Live help button at the end of any page in MyHELMS or the Helpdesk. (When this button is green, we're available.) Telephone Call +353 (0) 98 28382 and dial 1 for help connecting to a live event or dial 2 for all other technical queries. Hours of operation are Monday to Thursday 09:00 to 21:00 and on Friday 09:00 to 17:00 (excl. public holidays). You should always use the technical support telephone number for immediate assistance connecting to live events. Programme Administration The Programme Administration team is your main point of contact for student matters throughout the programme. Each cohort will have a dedicated programme administrator. Your programme administrator and the team can help you with a variety of queries, including: Assessments (non-academic queries) Professional placement Face-to-face classes and webinars General queries You can contact the Programme Administration team as follows: Email Email studentadmin@hiberniacollege.net (This will automatically open a case with the Programme Administration team.) Telephone +353 (0) 1 661 0168 Hours of operation are Monday to Friday 09:00-17:00 (excl. public holidays). We will endeavour to provide you with a prompt, quality service. You can open a case or email our teams at any time and expect a response within 2 working days. Get in touch Get in touch Chat with Technical Support Email Technical Support Email Programme Administration Email Admissions Email PME Primary Admissions Email PME Post-Primary Admissions Email Assessments & Awards Office Email Student Support Email Finance Telephone: 01 661 0168 ©2021 Hibernia College. All rights Reserved. hiberniacollege.com | Privacy Policy add chat to your website"
    },
    {
      "url": "https://www.hibernia.edu.au/about-us/",
      "text": "ABOUT US – HIBERNIA INSTITUTE PTY LTD | (612) - 8214 2513     | principal@hibernia.edu.au HOME ABOUT US HOW TO APPLY COURSES CERTIFICATE BSB40120 Certificate IV in Business DIPLOMA BSB50120 Diploma of Business BSB50420 Diploma of Leadership and Management ICT50220 Diploma of Information Technology ADVANCED DIPLOMA BSB60420 Advanced Diploma of Leadership and Management ICT60220 Advanced Diploma of Information Technology (Cyber Security) GRADUATE DIPLOMA BSB80120 Graduate Diploma of Management (Learning) E-LEARNING DOWNLOADS AGENTS CONTACT US PRIVACY HOME ABOUT US HOW TO APPLY COURSES CERTIFICATE BSB40120 Certificate IV in Business DIPLOMA BSB50120 Diploma of Business BSB50420 Diploma of Leadership and Management ICT50220 Diploma of Information Technology ADVANCED DIPLOMA BSB60420 Advanced Diploma of Leadership and Management ICT60220 Advanced Diploma of Information Technology (Cyber Security) GRADUATE DIPLOMA BSB80120 Graduate Diploma of Management (Learning) E-LEARNING DOWNLOADS AGENTS CONTACT US PRIVACY ABOUT US Hibernia Institute endeavours to provide high quality, relevant tertiary and vocational education to Australian and international students in Sydney by providing Australian Skills Quality Authority (ASQA) accredited programs at our Sydney campus. All the programs are nationally recognized and can be articulated to a selected Higher Education degree program, thus providing a pathway to further studies in Australia. We currently offer Vocational Education programs in Business Administration, Business Management and Leadership, along with the Diploma in Information Technology, Networking, These courses are designed to develop those business and technology skills in high demand in the modern workforce. Our dedicated team of trainers are experienced, qualified, and constantly in touch with current industry requirements and trends. They understand the needs of students and utilise innovative learning techniques to deliver the skills, knowledge and insights students need to achieve success in their chosen field. A team of qualified trainers is available to assist with studies and mentor students through to completion of their qualification. Hibernia Institute and the Australian Government anticipate that overseas students studying in Australia will have a safe, enjoyable and rewarding experience. Australia’s laws promote equality and consumer protection for overseas students. Hibernia Institute is a fully compliant Registered Training Organisation which meets the required standards and compliance under the Australian government legislation. Hibernia Institute Sydney campus is located in the City CBD precinct with convenient access to public transport. OUR MISSION Hibernia Institute seeks to provide innovative education programs that foster academic, cultural, and personal development and lay the foundation for students to become engaged global citizens. Hibernia Institute endeavours to provide high quality, relevant, tertiary and vocational education to Australian and International students in Sydney. OUR LOCATION Contact School HIBERNIA INSTITUTE PTY LTD ABN:74 127 456 017 Unit 102, 2-4 Holden St, Ashfield, NSW 2131 , Australia Phone: + 61 2 8214 2513 Email: principal@hibernia.edu.au RTO Code: 31680 CRICOS Provider Code: 03232D COURSES Certificate IV in Business Administration Diploma of Business Diploma in Information Technology Networking Diploma of Leadership and Management Advanced Diploma of Leadership and Management DOWNLOADS HIBERNIA BROCHURE APPLICATION FORM © Copyright 2000 - 2019. Powered by Nexus Business Technology"
    },
    {
      "url": "https://north.hibernianpub.com/contact-us/",
      "text": "Contact Us – Hibernian Pub Skip to content Menu Gift Cards Home Menu Cocktail Menu About Us Gallery Catering Contact Us Jobs [vc_row][vc_column][vc_column_text] Need more information or have a question the website didn’t answer? If so, contact us at info@hibernianpub.com and we’ll be back in touch shortly. Better yet, just come see us at the pub and we’ll answer your questions directly (over a pint, of course). [/vc_column_text][/vc_column][/vc_row] Try All Of Our Sister Restaurants & Concepts © 2023 Hibernian Irish Pub & Restaurant. All rights reserved. Go to Top Gift Cards Home Menu Cocktail Menu About Us Gallery Catering Contact Us Jobs Reservation"
    },
    {
      "url": "https://www.littlerock.com/directory/hibernia-irish-tavern/",
      "text": "Please ensure Javascript is enabled for purposes of website accessibility Hibernia Irish Tavern | Little Rock, AR Skip to content Meetings Media Trip Planner 77 ° F 0 Saved Navigation Events Annual Festivals & Events Submit An Event Things To Do Museums & Attractions Arts & Culture Theater & Performing Arts Black Culture LGBTQ+ Cycling Family Fun Outdoors & Recreation Nightlife & Entertainment Shopping Free Things to Do Tours Where to Stay Hotels Extended Stay Bed & Breakfasts Short Term Rentals Food & Drink Local Little Rock Dining Food Trucks Brunch Coffee, Bakeries & Desserts Breweries, Wineries & Distilleries Black-Owned Restaurants Women-Owned Restaurants LGBTQ+-Owned Restaurants Hispanic-Owned Restaurants Asian-Owned Restaurants Neighborhoods Entertainment Districts Downtown Midtown West Little Rock Airport District Southwest North Little Rock Central Arkansas Plan Your Trip Free Vacation Planning Guide Transportation Visitor Centers Weather & Average Temperatures Accessibility Newsletter Sign-Up Meetings & Events Why Little Rock Venues & Facilities Submit an RFP Talk To An Expert Destination Services Planning Guide Big Savings Program Group Tour Sports Planners About Us Blogs Home Share Hibernia Irish Tavern Website Save Irish and Southern food favorites and a broad beverage menu. Hibernia Irish Tavern 9700 Rodney Parham Rd Little Rock, Arkansas 72227 (501) 246-4340 Save Hibernia Irish Tavern 9700 Rodney Parham Rd Little Rock, Arkansas 72227 Details Open in Google Maps Map Cuisines Details European / Mediterranean 101 S Spring Street | Little Rock, AR 72201 (501) 376-4781 | info@littlerock.com Events Annual Festivals & Events Submit An Event Things To Do Museums & Attractions Arts & Culture Theater & Performing Arts Black Culture LGBTQ+ Cycling Family Fun Outdoors & Recreation Nightlife & Entertainment Shopping Free Things to Do Tours Where to Stay Hotels Extended Stay Bed & Breakfasts Short Term Rentals Food & Drink Local Little Rock Dining Food Trucks Brunch Coffee, Bakeries & Desserts Breweries, Wineries & Distilleries Black-Owned Restaurants Women-Owned Restaurants LGBTQ+-Owned Restaurants Hispanic-Owned Restaurants Asian-Owned Restaurants Neighborhoods Entertainment Districts Downtown Midtown West Little Rock Airport District Southwest North Little Rock Central Arkansas Plan Your Trip Free Vacation Planning Guide Transportation Visitor Centers Weather & Average Temperatures Accessibility Newsletter Sign-Up Meetings & Events Why Little Rock Venues & Facilities Submit an RFP Talk To An Expert Destination Services Planning Guide Big Savings Program Group Tour Sports Planners About Us Blogs Media Partners Privacy Policy Visitor Guide E-Newsletter © 2025 Little Rock Convention & Visitors Bureau. All Rights Reserved. We use cookies and other tracking technologies to improve your browsing experience on our website. By browsing our website, you consent to our use of cookies and other tracking technologies. Learn More Accept Experience Builder Quick Search Full Search Location Map Stay in Touch Get Little Rock’s best in your inbox! From local events to community news, our newsletter will keep you up to date and in the loop, or sign up for a FREE vacation planning guide! SIGN UP FOR OUR EMAIL NEWSLETTER REQUEST A FREE VISITORS GUIDE"
    }
  ]
}