{
  "fuentes": [
    {
      "url": "https://blackgold.beer/contact-us/",
      "email": "events@blackgold.beer"
    },
    {
      "url": "https://blackgold.beer/contact-us/",
      "email": "info@blackgold.beer"
    },
    {
      "url": "https://fletchernissanstore.com/contact",
      "email": "fletchernissan@dealer.calldrip.com"
    },
    {
      "url": "https://fletchernissanstore.com/contact",
      "email": "fletchernissan@leads.calldrip.com"
    },
    {
      "url": "https://fletchernissanstore.com/contact",
      "email": "sales@fletchernissan.edealerhub.com"
    },
    {
      "url": "https://fletcherlongstaff.com/get-in-touch/",
      "email": "info@fletcherlongstaff.com"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "ahurea@fbu.com"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "enquiry@computershare.co.nz"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "enquiry@computershare.com.au"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "fb-communication@fbu.com"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "fbcomms@fbu.com"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "email": "media@fbu.com"
    },
    {
      "url": "https://www.fletcher-group.com/contact",
      "email": "info@fletcher-group.com"
    },
    {
      "url": "https://thefletcherlab.co.uk/contact/",
      "email": "adam.fletcher@glasgow.ac"
    },
    {
      "url": "https://thefletcherlab.co.uk/contact/",
      "email": "adam.fletcher@glasgow.ac.uk"
    }
  ],
  "mails": [
    "adam.fletcher@glasgow.ac",
    "adam.fletcher@glasgow.ac.uk",
    "ahurea@fbu.com",
    "enquiry@computershare.co.nz",
    "enquiry@computershare.com.au",
    "events@blackgold.beer",
    "fb-communication@fbu.com",
    "fbcomms@fbu.com",
    "fletchernissan@dealer.calldrip.com",
    "fletchernissan@leads.calldrip.com",
    "info@blackgold.beer",
    "info@fletcher-group.com",
    "info@fletcherlongstaff.com",
    "media@fbu.com",
    "sales@fletchernissan.edealerhub.com"
  ],
  "nombre_sitio": "fletchersirishpub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://blackgold.beer/contact-us/",
      "text": "Contact Us - Black Gold Brewery Skip to content Home Menu Beer & Drinks Food Events Shop The Dirt About Us Contact Us Contact Us Address 395 Fletcher St. Petrolia, Ontario N0N 1R0 Phone 226-738-0665 Hours Monday – Wednesday 12pm – 10pm Thursday 12pm – 11pm Friday – Saturday 12pm – 12am Sunday 12pm – 8pm Write to Us Name Email Your Message Δ Back To Top HOME EVENTS SHOP DRINKS MENU FOOD MENU BGB 395 CLUB CARRY OUR BEER WHERE TO FIND US OUR HOURS Mon – Wed: Noon – 10pm Thu: Noon – 11pm Fri – Sat: Noon – 12am Sun: Noon – 8pm Email info@blackgold.beer events@blackgold.beer Phone 226-738-0665 Address 395 Fletcher Street Petrolia, ON N0N1R0 JOIN OUR MAILING LIST Leave this field empty if you're human: Copyright © 2020 Black Gold Brewery. All Rights Reserved. Let's Keep in Touch Join our mailing list to stay up-to-date on what’s happening at Black Gold Brewery and never miss out on our special offers. JOIN OUR MAILING LIST Leave this field empty if you're human: ×"
    },
    {
      "url": "https://fletchernissanstore.com/contact",
      "text": "Call Main Menu Accessibility Call Shop at Frank Fletcher Nissan Specials Get Financed Get Service About Frank Fletcher Nissan Resources menu Accessibility Service: (417) 622-5447 Sales: (417) 317-5179 2327 S Rangeline Rd New Shop New Inventory New Inventory Specials New Under $25k Trade Model Research Apply for Financing Used Shop Used Inventory Certified Pre-owned Used Under $25 Used Under 35k Used Vehicle Specials Trade Specials New Nissan Specials Used Vehicle Specials College Discount Military Discount Service Schedule Service Service Specials Service & Parts Financing Order Parts & Accessories Tire Center My Nissan Rewards Finance Apply for Financing Check Your Credit Contact General Inquiries Directions & Hours Who is Frank Fletcher? Resources EV Center EV Benefits Home Charging Nissan Ariya Nissan Leaf Model Research 2025 Nissan Altima 2025 Nissan Versa 2025 Nissan Frontier 2025 Nissan Pathfinder 2025 Nissan Sentra 2025 Nissan Rogue 2025 Nissan Kicks 2025 Nissan Leaf We're here to help. First Name Last Name Phone Number Email Address Message I have read and agree to the Privacy Policy Submit We're here to help with anything you need. Give us a shout using the contact form, call us, or stop by in person. Address 2327 S Rangeline Rd, Joplin, Missouri 64804 Get in touch Sales: (417) 317-5179 Service: (417) 622-5447 Sales Hours Sunday Closed Monday 8:30am - 7:00pm Tuesday 8:30am - 7:00pm Wednesday 8:30am - 7:00pm Thursday 8:30am - 7:00pm Friday 8:30am - 7:00pm Saturday 9:00am - 6:00pm Like this feature? See all vehicles with View Inventory Cancel Like this feature? See all vehicles with View Inventory Cancel Like this feature? See all vehicles with View Inventory Cancel Contact Frank Fletcher Nissan: Get in Touch for All Your Nissan Needs"
    },
    {
      "url": "https://fletcherlongstaff.com/get-in-touch/",
      "text": "Contact Us - Get In Touch - Fletcher Longstaff \\ Legal Services Conveyancing Efficient, professional and friendly advice for buyers and sellers of property. First Time Buyers Guiding you through the exciting process of buying your first home! New Build Properties We can lead you through the complex process of a New Build purchase. Help To Buy Redemption Looking to pay off your Help to Buy? We can help you through the process. Get a Quote 01522 712352 Can't find what you're looking for? Contact us FAQs FAQs Looking for information on the buying/selling process? Here are some answers past clients found useful. The Conveyancing Process Learn about the process of buying or selling a property, and discover what sets us apart in speeding it all up! Fee Schedule We always quote fixed fees for conveyancing, however, you may wish to view our full fee schedule. Useful Documents Looking for key resources like our Terms of Engagement or a list of lenders we can act for? Get a Quote 01522 712352 Can't find what you're looking for? Contact us Company About Us Learn more about the firm and our experience in residential conveyancing. Meet the Team Introducing our dedicated team of seasoned conveyancing experts. Contact Looking for our contact details? We're available via Phone, Email or Post. Get a Quote 01522 712352 Can't find what you're looking for? Contact us Clients Make a Payment Easily make small payments to Fletcher Longstaff using your credit or debit card. Check Bank Details Use this easy tool to check the details you have for us before making bank transfers. Client Portal Login Visit the InTouch portal to check the status of your case, upload documents and more. Get a Quote 01522 712352 Can't find what you're looking for? Contact us 01522 712352 Get a Quote Get a Quote Legal Services Conveyancing First Time Buyers New Build Properties Help To Buy Redemption FAQs FAQs The Conveyancing Process Fee Schedule Useful Documents Company About Us Meet the Team Contact Clients Make a Payment Check Bank Details Client Portal Login Get a Quote 01522 712352 Contact Get in touch with Fletcher Longstaff View our contact details below, or use our online form to send us an email. Looking for a Conveyancing Quote? 01522 712 352 The Regatta, Henley Way, Lincoln LN6 3QR Call 01522 712352 Email info@fletcherlongstaff.com Fax 01522 300177 Get in touch Name (Required) Phone Number (Required) Email (Required) Message (Required) Trustpilot info@fletcherlongstaff.com 01522 712352 The Regatta, Henley Way, Lincoln LN6 3QR Links Blog & News Lenders Referrers Careers Clients Make a Payment Check Bank Details Client Portal Login Download App Legal Terms of Service Client Care Terms Privacy Policy Social Linkedin Instagram Facebook Trustpilot © 2025 Fletcher Longstaff Limited |\n                            Regulated by the Council for Licensed Conveyancers, Practice Licence Number: 12262 Registered in England and Wales #12605294 | VAT number: 367596343"
    },
    {
      "url": "https://fletcherbuilding.com/about-us/contact-us",
      "text": "Contact us | Fletcher Building About us What's important to us Board and Management Our history Contact us Sustainability What we want to achieve Our journey so far How we're going to get there Sustainability reports, publications and policies Fletcher Building ESG World Profile Safety Our business Light Building Products Distribution Heavy Building Materials Residential and Development Construction Careers News Investor Centre Financial Results and Announcements Share price tracking Shareholder information Capital notes and ADRs Corporate governance Board and Management Financial calendar Contact us Share Price NZX NZD ASX AUD ABOUT US What's important to us Board and Management Our history Contact us SUSTAINABILITY What we want to achieve Our journey so far How we're going to get there Sustainability reports, publications and policies Fletcher Building ESG World Profile SAFETY OUR BUSINESS Light Building Products Distribution Heavy Building Materials Residential and Development Construction CAREERS NEWS INVESTOR CENTRE Financial Results and Announcements Share price tracking Shareholder information Capital notes and ADRs Corporate governance Board and Management Financial calendar NZX NZD $ - . -- -- ASX AUD $ - . -- -- Contact Us Get in touch with us About us Within the About us What's important to us Board and Management Our history Contact us Contact form * All fields are required Full Name Phone Number Email Company (If Applicable) Who do you want to contact? Please select which department you want to contact Manage your shareholding Media enquiries General Shareholder or customer feedback Other Comments / Message You must enable JavaScript to submit this form Please tick the box to prove you're a human and help us stop spam. Looking for a job? Visit our Careers page for more information and to search our latest vacancies. Head office Australia Phone: +61 2 8311 2588 Street address: Fletcher Building Australia Level 14 275 Alfred Street North Sydney NSW 2060 Email: fbcomms@fbu.com New Zealand Phone: +64 9 525 9000 Street address: Fletcher Building Limited 810 Great South Road Penrose Auckland 1061 New Zealand Postal address: Private Bag 92114 Auckland 1142 New Zealand Email: fbcomms@fbu.com Media enquiries Emily Winstanley Senior Group Corporate Affairs Manager Email: media@fbu.com Phone: +64 27 284 2343 This is for media enquiries ONLY . All other requests, please call +64 9 525 9000 . Shareholder enquiries Computershare Investor Services Limited Australia Email enquiry@computershare.com.au Phone: +61 (0)3 9415 4083 Fax: +61 (0)3 9473 2009 New Zealand Email: enquiry@computershare.co.nz Phone: +64 9 488 8777 Fax: +64 9 488 8787 Cultural enquiries Val Panui Kaitohutohu Ahurea Matua – Senior Cultural Advisor Email: ahurea@fbu.com Head office Contact us 810 Great South Road Penrose, Auckland 1061, New Zealand +64 9 525 9000 Share price NZX NZD ASX AUD Follow us © 2025 Fletcher Building Terms & Conditions Privacy Statement Sitemap"
    },
    {
      "url": "https://www.fletcher-group.com/contact",
      "text": "Contact Us | Fletcher Group | Get in Touch | Dundee & Aberdeen Menu About Us Our Fleet Supply Logistics Corporate Chartering Contact News Contact Fletcher | Make an enquiry To contact either our Dundee office or Aberdeen office, call +44 (0) 1224 785785 Dundee Office Fletcher Group Dundee ONE River Court 5 West Victoria Dock Road Dundee, DD1 3JT Tel: +44 1224 785785 Fax: +44 1224 785786 info@fletcher-group.com Click for link to google maps Aberdeen Office Badentoy Avenue, Badentoy Park, Portlethen, Aberdeen, AB12 4YB Tel: +44 1224 785785 Fax: +44 1224 785786 info@fletcher-group.com Click for link to google maps Make enquiry To comply with data protection regulations (2018), we are unable to store and use your information unless you give us your permission. Please select Yes to allow this. View our data protection policy for details. Please select one Yes No SEND ENQUIRY \"Fletcher's flexible and innovative approach to business and the professionalism of their crew has played an important role in helping us deliver a safe, reliable and cost-effective service to our clients. We look forward to building on this going forward as we continue to seek new and exciting opportunities in an exceptionally competitive marketplace.\" Oilchart, 2016 “[We would] like to thank you and the rest of the crew on the FS Aberdour for your assistance, positive attitude and total flexibility during the last 5/6 weeks since we started this Project. The communication has been invaluable with all the challenges that have faced us. Thank you very much for your assistance, you’re all a credit to your team on-board the FS Aberdour and also Fletcher Group.” Centrica, June 2017 “It was a pleasure to work with all of you, especially when the project is completed without any operation issue on the fluids / cement / waste management side. It was a great success to complete this.” Perenco, August 2017 “I cannot thank you enough for the work that you have done for us, all credit to you and your crew. I will be passing back some very positive comments. On behalf of both the Standard Princess and her crew and also the Standard Supplier, I appreciate all your help.” Centrica, November 2017 \"[We] would like to take the opportunity to thank you and your Team for the level of support that you have given us with both vessels through this campaign. The vessel Masters and crews have been an absolute credit to your organisation and I would look forward to working with Fletcher Group again in the future if this is the manner in which you conduct your business. I would like to wish you all every success and I am sure that we will work again in the not-too-distant future.\" Ineos, July 2018 It has been a please working with you! Thank you for your support the past few months and th flexible attitude of your crew. This was much appreciated by our team. Allseas, February 2019 Quick Links Home About Contact Corporate Join Our Team Leadership Team QHSE Offshore Bunkering Supply Logistics Platform Supply Drilling Supply Walk to Work Vessels Chartering News Accreditations Sitemap Privacy & Data Policy Vulnerability Disclosure Policy Terms and Conditions Like Us on Facebook Facebook Have questions? Let us answer them or give us a call +44 (0) 1224 785785 To comply with data protection regulations (2018), we are unable to store and use your information unless you give us your permission. Please select Yes to allow this. View our data protection policy for details. Please select one Yes No SEND ENQUIRY ©Registered Company Number SC546089 CONNECT WITH US Connect with Fletcher Group for all our latest news and events"
    },
    {
      "url": "https://thefletcherlab.co.uk/contact/",
      "text": "Contact – The Fletcher Lab The Fletcher Lab Our team Our Research Our Funders Our Collaborators Contact Contact Please get in touch at the email address below, or via the contact form. Get in Touch MRC-University of Glasgow Centre for Virus Research 464 Bearsden Road Glasgow , G61 1QH UK Adam.fletcher@glasgow.ac.uk 0141 330 4557 Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning! Submit Δ The Fletcher Lab Uncovering E3s that regulate infection Subscribe Subscribed The Fletcher Lab Sign me up Already have a WordPress.com account? Log in now. The Fletcher Lab Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"
    }
  ]
}