{
  "fuentes": [
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "bryan@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "rolando@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "andy@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "betsy@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "josh@adimetal.com"
    },
    {
      "url": "https://www.adimetal.com/contact-us/",
      "email": "sales@adimetal.com"
    },
    {
      "url": "https://fliff.com/press/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/press/",
      "email": "pr@fliff.com"
    },
    {
      "url": "https://fliff.com/press/",
      "email": "valerie@vzucker.com"
    },
    {
      "url": "https://fliff.com/rentals/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/rentals/",
      "email": "rentals@fliff.com"
    },
    {
      "url": "https://fliff.com/events/georgiaokeeffethebrightnessoflight/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/history/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://www.getfliff.com/careers",
      "email": "press@getfliff.com"
    },
    {
      "url": "https://fliff.com/contact/",
      "email": "volunteers@fliff.com"
    },
    {
      "url": "https://fliff.com/contact/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/contact/",
      "email": "publicity@fliff.com"
    },
    {
      "url": "https://fliff.com/contact/",
      "email": "rentals@fliff.com"
    },
    {
      "url": "https://warrenmiller.com/events/savor-cinema",
      "email": "warrenmiller@peterglenn.com"
    },
    {
      "url": "https://warrenmiller.com/events/savor-cinema",
      "email": "warrenmiller@peterglenn.comtickets"
    },
    {
      "url": "https://fliff.com/ourteam/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/Employment/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/cinema-paradiso-hollywood-owners-over-172700732.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://www.partyslate.com/venues/savor-cinema",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://fliff.com/events/soundofmusicsingalong/",
      "email": "hal@fliff.com"
    },
    {
      "url": "https://fliff.com/events/soundofmusicsingalong/",
      "email": "info@fliff.com"
    },
    {
      "url": "https://fliff.com/savorcinema/",
      "email": "info@fliff.com"
    }
  ],
  "mails": [
    "andy@adimetal.com",
    "betsy@adimetal.com",
    "bryan@adimetal.com",
    "contact@partyslate.com",
    "hal@fliff.com",
    "info@fliff.com",
    "josh@adimetal.com",
    "pr@fliff.com",
    "press@getfliff.com",
    "publicity@fliff.com",
    "rentals@fliff.com",
    "rolando@adimetal.com",
    "sales@adimetal.com",
    "u003ebillhimself@yahoo.com",
    "valerie@vzucker.com",
    "volunteers@fliff.com",
    "warrenmiller@peterglenn.com",
    "warrenmiller@peterglenn.comtickets"
  ],
  "nombre_sitio": "fliff.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.adimetal.com/contact-us/",
      "text": "Contact ADI Metal | Get in Touch with Our Team Search Skip To Content +1 954.523.6474 +1 954.779.7355 US Toll Free: 866.825.9271 Request a Quote +1 954.523.6474 sales@adimetal.com RFQ About Us Credit Application Testimonials Women Owned Business Team Catalog Aluminum Alloy Products 535 Cast Aluminum 1100 Alloy Aluminum 3003 Alloy Aluminum 5052 Alloy Aluminum 5083 Marine Grade Aluminum Alloy 5086 Marine Grade Aluminum Sheet, Plate & Extrusions 5454 Alloy Aluminum 5456 Alloy Aluminum 6005 Aluminum 6063 Architectural Aluminum 6463 Aluminum Bright Dip Anodized or Brushed Finish Pipe 6061 Structural Marine Grade Aluminum Stainless Steel Products Stainless Steel Sheets and Plate Stainless Polished Tubes Stainless Steel Round Tubes and Pipes Stainless Steel Square and Rectangular Tubes Stainless Steel Round Rods Aquamet 22 Boat Shafts Other Ferrous and Non-Ferrous Metals Armor Plate Brass Bronze Carbon Steel Copper Copper-Nickel Titanium Available Shapes and Forms Angles Flat and Square Bars Round Tubes and Pipes Square and Rectangular Tubes Round Rods Sheet and Plate Fittings, Flanges and Elbows Planks Gratings Moldings Hinges Channels Beams Tees Marine Grade Defense Profiles Tread Plate Perforated Flattened Expanded Armor Plate Zees Florida Industrial Metal Supplier Fort Lauderdale Industrial Metal Supplier Fort Lauderdale Aluminum Supplier Government Capability Statements Agencies Past Performances Resources Technical Information Resources FAQs Blog Statement of Liability – Disclaimer Contact Us Search Contact ADI Metal, INC. Home > Contact Us We’d be happy to help you with your metal needs, contact us! Hours: ADI Metal is open Monday to Friday 8:00 am – 3:30 pm U.S. Eastern Standard Time Address: ADI Metal, Inc. 2930 SW 2nd Ave. Fort Lauderdale, FL 33315 Toll Free: 866.825.9271 Phone: 954.523.6474 Fax: 954.779.7355 Email: sales@adimetal.com Website: www.adimetal.com Social Networks: View Large Map REQUEST INFORMATION We are conveniently located near the Fort Lauderdale International Airport and Port Everglades and many exporters. Close to major highways, such as 595, I-95, Federal Highway and State road 84 and 441. ADI Metals Professional & Knowledgeable Sales Team (Click on thumbnail to enlarge) Betsy McGee President betsy@adimetal.com Andy Rath General Manager andy@adimetal.com Rolando Diaz Export Manager Rolando@ADIMetal.com Josh Rivera Sales Consultant josh@adimetal.com Bryan Rath Sales Consultant Bryan@adimetal.com Aluminum Alloy Products 535 Cast Aluminum 1100 Alloy Aluminum 3003 Alloy Aluminum 5052 Alloy Aluminum 5083 Marine Grade Aluminum Alloy 5086 Marine Grade Aluminum Sheet, Plate & Extrusions 5454 Alloy Aluminum 5456 Alloy Aluminum 6005 Aluminum 6061 Structural Marine Grade Aluminum 6063 Architectural Aluminum 6463 Aluminum Bright Dip Anodized or Brushed Finish Pipe Stainless Steel Products Stainless Steel Sheets and Plate Stainless Polished Tubes Stainless Steel Round Tubes and Pipes Stainless Steel Square and Rectangular Tubes Stainless Steel Round Rods Aquamet 22 Boat Shafts Other Ferrous and Non-Ferrous Metals Armor Plate Brass Bronze Carbon Steel Copper Copper-Nickel Titanium Available Shapes and Forms Angles Flat and Square Bars Round Tubes and Pipes Square and Rectangular Tubes Round Rods Sheet and Plate Fittings, Flanges and Elbows Planks Gratings Moldings Hinges Channels Beams Tees Marine Grade Defense Profiles Tread Plate Perforated Flattened Expanded Armor Plate Zees ADI Metal, Inc. 2930 SW 2nd Ave. Fort Lauderdale, FL 33315 Phone: +1 954.523.6474 Tollfree: 866.825.9271 Fax: +1 954.779.7355 Email: sales@adimetal.com Contact Us Sitemap Terms of Service Privacy Policy © 2025 Aluminum Distributing, Inc. , All Rights Reserved  |  Site created by Thomas Marketing Services and powered by Navigator Platform"
    },
    {
      "url": "https://fliff.com/press/",
      "text": "Press – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Press Press Contact Email: pr@fliff.com Press Credential Application (please fill out a separate application for each publication in which you are affiliated) Your Name * Email * Phone * Media Outlet * Website * Medium Print (Newspaper) Print (Magazine) Radio TV Social Media Other (please list below) Other Your headshot (for Credentials) * Choose File No file chosen Delete uploaded file Job Title * Editor Reporter Freelance Photographer Producer Other Send Message Press Releases 2024 Festival Press Releases 39th Annual Fort Lauderdale International Film Festival Press Release FORT LAUDERDALE INTERNATIONAL FILM FESTIVAL TO UNVEIL POSTER AND SNEAK PREVIEWS FOR 39TH ANNUAL FESTIVAL 39 th Annual Fort Lauderdale International Film Festival Announces the 2024 Award Winners 2024 Festival Press Releases 39th Annual Fort Lauderdale International Film Festival Press Release FORT LAUDERDALE INTERNATIONAL FILM FESTIVAL TO UNVEIL POSTER AND SNEAK PREVIEWS FOR 39 TH ANNUAL FESTIVAL 2024 Press Releases World Showcase of Films at Cinema Paradiso SÉANCE WITH THE QUEENS Documentary Addresses LGBTQ Inequality in Florida World Theatrical Premiere August 18 at Savor Cinema JUNETEENTH MINI FILM FESTIVAL: Celebrating Hope & Resilience FLIFF’S Celebration Under the Stars: Sunday, March 10 at Savor Cinema Experience the 150th Kentucky Derby on a 30-ft Screen at Savor Cinema Saturday, May 4 USA TODAY NAMES FLIFF (FORT LAUDERDALE INTERNATIONAL FILM FESTIVAL) AMONG TOP 10 BEST FILM FESTIVALS IN THE US 2023 Film Festival Press Releases It’s A Wrap! (11.20.2023) ON THE RED CARPET AT FLIFF! (10.23.2023) Canada’s Justice Abella to Attend World Premiere of Without Precedent FLIFF38: Lights! Action! FLIFF! (9.26.2023) Volunteer Round-up FLIFF38 Rolls Out the Red Carpet 2023 FLIFF Cinema Press Releases Raise Your Glass and Celebrate Winterfest’s Parade Theme at the End of Summer Happy Hour Hosted by Savor Cinema (August 16, 2023 2024 FLIFF Film Images To obtain images for FLIFF 39 films (November 8 – 17), please contact Valerie Zucker at valerie@vzucker.com Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://fliff.com/rentals/",
      "text": "Venue Rentals – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Theater Rentals Rental Application Make Yourself At Home Located in the heart of downtown Fort Lauderdale, Savor Cinema is the perfect venue for a wide range of events. Its “old world” charm has a lot to offer. Built in 1926 as a church then later becoming the Vinnette Carroll Playhouse and now Savor Cinema. We have kept the wonders of old architecture and stained glass windows from the last century and modernized for a better entertainment experience for today’s audiences. The theater features 212 plush faux leathers covered rocker stadium seats (additional seating can be added to comfortably seat 234), a full proscenium stage 37 feet long by 20 feet deep, with a complete lighting system. The theatre also has full capability for showcasing quality films of various digital formats, using our NC900C DCI-certified Projector that features precise 2K DLP (2048 x 1080) resolution with 3D capabilities. We can show many formats, the most popular are DCP & MP4. We have 5.1 Dolby sound for Films and live performances. We also offer you the tools to digitally record your events sound on digital multitracks for live events. The fully covered Courtyard is the perfect place for cocktails and hors d’oeuvres before entering the theater for meetings, films, or live presentations. It is also spacious enough to have a red carpet experience, dancing, two outdoor bars, High Top tables, catering tables, bench seating, round dining table seating, and a vip section without feeling cramped into a small space. Besides having a DJ or live performances outside you can also watch movies or events outside. These can be tied to what is playing inside or something completely different. Contact Hal Axler via e-mail at rentals@fliff.com for more information or to reserve the theater. Savor Cinema and the Courtyard are smoke and Vape FREE. The programming expressed during theater rentals do not reflect the views or programming of the Broward County Film Society, its board, sponsors or members. Spaces Available Savor Cinema Theater The theatre is 100% wheelchair accessible and FREE parking for our events is located at the county courthouse parking garage (just to the west of our building). Parking is also available at any nearby city-metered spots. (FREE all day Sundays and Holidays) Our concessions area features traditional movie theater faire; popcorn, snacks, candy, hot dogs and beverages. Plus we feature a full liquor bar including beers and wines. CLICK HERE for a seating chart Rental Application John Mager Courtyard The theatre is 100% wheelchair accessible and FREE parking for our events is located at the county courthouse parking garage (just to the west of our building). Parking is also available at any nearby city-metered spots. (FREE all day Sundays and Holidays) Our concessions area features traditional movie theater faire; popcorn, snacks, candy, hot dogs and beverages. Plus we feature a full liquor bar including beers and wines. Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://fliff.com/events/georgiaokeeffethebrightnessoflight/",
      "text": "Georgia O’Keeffe: The Brightness of Light – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Georgia O’Keeffe: The Brightness of Light Academy Award-winning director Paul Wagner trains his lens onto one of the most influential American artists of the 20th-century. Weaving together a fascinating and complicated story of an artistic life lived to the fullest, this essential biography features narration by Hugh Dancy and Claire Danes. Academy Award-winning director Paul Wagner trains his lens onto one of the most influential American artists of the 20th-century. Prior to achieving her fame, Georgia O’Keeffe spent every summer from 1912-1916 taking art classes at the University of Virginia, where she rekindled her joy and desire to pursue painting, which she had considered giving up altogether. Spiritually replenished, “The Mother of Modernism” headed for New York, upending the 1920s art scene with groundbreaking paintings of flowers, bones, and the splendor of the natural world. Denying her work depicted sexual imagery, she also posed nude for controversial photographs taken by Alfred Stieglitz. In the 1970s, isolated in the New Mexico desert, O’Keeffe emerged as a second-wave feminist icon. Weaving together a fascinating and complicated story of an artistic life lived to the fullest, this essential biography features narration by Hugh Dancy and Claire Danes, and music by Emilie Levienaise-Farrouch ( All of Us Strangers, Living ). Let’s explore the world of Georgia O’Keefe through her art. Art session led by local artist Sylvie Anidjar. All levels  welcomed, $25 introductory fee, per person, for materials & tuition (2hours session) starting @4pm prior to showtime ,on Wed June 25th,2025. For information contact Syvlie Seabag at sebagsylvie@hotmail.com genres : Documentary | Fine Arts CREDITS DIRECTOR(S): Paul Wagner SCREENWRITER(S): Paul Wagner PRODUCER(S): Paul Wagner CAST: Claire Danes, Hugh Dancy Choose A Showtime To Purchase: BUY TICKETS NOW Become a Member Details YEAR: 2024 RUN TIME: 120 MIN LANGUAGE(S): en venues : Savor Cinema < BACK TO FILMS SHARE THIS: Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://fliff.com/history/",
      "text": "History of Savor Cinema – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Located in the heart of downtown Fort Lauderdale, Cinema Paradiso’s most unique feature (aside from it’s content) is that it’s housed in a renovated church building. Dating back to the earlier half of the century, the building was constructed as the First Methodist Church of Fort Lauderdale. Once the church moved to a bigger location, the building went under the charge of the County, where it functions reportedly ranged from a family-counseling center to narcotics storage for the courthouse. In the mid-1980’s the building was retrofitted as a stage theater for use by the actress, director, and playwright Vinnette Carroll, the first African-American woman to direct a Broadway show, and became the Vinnette Carroll Theater. In the late-1990’s, after Ms. Carroll fell ill and activity in the theater declined, the County handed management of the building over to the Broward County Film Society. A second renovation commenced, this time to fit the existing theater with film projection equipment. Around 2000, the movie theater opened as the Festival Arts Cinema, primarily used for the Fort Lauderdale International Film Festival. Eventually renamed Cinema Paradiso, in homage to the Oscar-winning film that featured a church turned movie house, the theater opened as a year-round art house cinema. A few years later the theater went through its third renovation, this time updating the projection and sound equipment, redoing the seating platform (eliminating the theater-in-the-round feature that wasn’t conductive to movie watching), installing plush velvet seats and cosmetically updating the theater and lobby. Today the theater is still operated by the Broward County Film Society, functioning as it’s headquarters, and is featured predominantly during the annual Fort Lauderdale International Film Festival. The theater specializes in foreign, American independent and retrospective films, but also periodically holds live theater performances. It has even gone far back enough to its roots where it has hosted wedding services. It was renamed Savor Cinema in 2016. Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://www.getfliff.com/careers",
      "text": "Careers | Social Sports Picks - Fliff Social Sportsbook and Sweepstakes Social Sportsbook About Us Careers Contact Us Download Fliff Sports Book About Us Careers Contact Us Weâre hiring! Join us in reimagining sports gaming and entertaining sports fans with our play-for-fun experience and innovative free-to-play games. Job openings Weâre forging a new path for sports gaming, with the emphasis on creating fun, social, and rewarding experiences. We foster a welcoming, respectful culture that stimulates and rewards those who play and those who make play possible. Our users are at the heart of everything we do. Together, we can elevate the fun within sports gaming with a new way to play that is more inviting, more social, and free to play. Who are we? Youâre intelligent, motivated and hard-working. You care about product excellence, user-centric design and being an integral part of a winning team. Job openings You do what moves you Youâre driven and passionate. Everybody loves to be part of something special. And work is easier when itâs fun. You love to collaborate Thereâs no such thing as someone elseâs job. The best work and creative problem-solving is done together. Youâre friendly and honest You like people and they like you too. But you donât sugarcoat things or shy away from speaking your mind. We are a remote working company with operations based in Philadelphia, USA, and development in Sofia, Bulgaria. Wherever we are in the world, we pride ourselves on being a close-knit, focused team. Welcoming and friendly We want to reflect the diversity of the cities we serve. By creating an inclusive culture where everyone can thrive, weâll make Fliff better for employees and customers alike. Lively and creative We respect and value each otherâs ideas, experience and expertise. There is no such thing as a bad idea; only ideas that are executed and ideas that are discarded after consideration. Stimulating and rewarding We know bright minds love a challenge, and we understand your desire to see your hard work pay off. Weâll make sure your daily tasks align with your career ambitions as we grow together. Job Positions Filter by Location Filter by Department Filter by Team Filter by Work Type Clear Filters No results Home About Careers Contact Terms of Use Privacy Policy Fliff Cash Sweepstakes Streaks Rules Sports Prediction Rules Responsible Social Gaming Help Center Media Inquiries Fliff Superstars Contest Rules Fliff Superstars Terms of Use *The sweepstakes accessible via the Fliff app is solely sponsored and administered by Fliff, Inc. Apple is not a sponsor of, affiliated with, or responsible for conducting, the sweepstakes. Â© Copyright 2025, Fliff Inc. All rights reserved."
    },
    {
      "url": "https://fliff.com/contact/",
      "text": "Contact – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Contact Sign up to receive our email newsletter Venue of Choice All Savor Cinema Cinema Paradiso Film Festival Name * Email * Favorite Genre of Movies * Please send me information on: Membership Facility Rentals Donations Upcoming Films Film Festival Submission Attending the Film Festival Comments Send Message Mailing Address 1314 East Las Olas Blvd #007 Fort Lauderdale, FL 33301 954-525-3456 (film) info@fliff.com Cinema Paradiso Hollywood 2008 Hollywood Blvd Hollywood, FL 33020 954-342-9137 info@fliff.com Savor Cinema 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-3456 (film) info@fliff.com General Information info@fliff.com Technical Questions techsupport@fliff.com Volunteer Opportunities Volunteers@fliff.com Public Relations publicity@fliff.com Facility Rentals rentals@fliff.com Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://warrenmiller.com/events/savor-cinema",
      "text": "Savor Cinema | Warren Miller Entertainment Warren Miller Entertainment Search form Search Film Tour Calendar Films Sponsor Outside+ Stream instagram facebook youtube Email Sign Up Savor Cinema November 13th Fort Lauderdale, FL About the Show Nov 13 7:00 pm Buy Tickets Location 503 SE 6th Street, Fort Lauderdale, FL 33301 Get Directions Event Description This event is hosted by an Indepdnent Promoter. Please contact Peter Glenn Ski & Sports for more information: warrenmiller@peterglenn.com Tickets can be purchased here . News From Basecamp SNO-CIETY Trailer and Presale Launch 2025 Tour Dates Out Now WARREN MILLER WORLD TOUR SWEEPSTAKES Tell us more about the film Our Partners Press Privacy Policy Terms & Cond. Contact Us Admin Login Film Tour Partnerships Stock Footage Work For Us instagram facebook youtube Site By E-Newsletter Signup First Name Last Name Email Zip Code Our Sister Sites Privacy Policy Terms of Use Do Not Sell or Share My Personal Data Your Privacy Choices WA Privacy Notice Manage Cookie Preferences © 2025 Outside Interactive, Inc."
    },
    {
      "url": "https://fliff.com/ourteam/",
      "text": "Our Team – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission This content is password protected. To view it please enter your password below: Password: Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://fliff.com/Employment/",
      "text": "Join Our Team – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Join Our Team Savor Cinema, operated by the Broward County Film Society have immediate opportunities for hard workers, especially those with an interest in film and the Arts, to join our team! Fill out the form below to apply Which Position are you interested? * Theater Staff Other Preferred Work Location Either Savor Cinema Cinema Paradiso Name * Email * Desired # of hours you wish to work per week 40+ 30 - 40 20 - 30 less then 20 I'm flexible Desired Shift(s) * Weekdays Weeknights Weekends Weeknights and Weekends Flexible Why would you like to work for FLIFF Cinemas? * Upload your resume here * Choose File No file chosen Delete uploaded file Send Message Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://www.yahoo.com/entertainment/articles/cinema-paradiso-hollywood-owners-over-172700732.html",
      "text": "Cinema Paradiso Hollywood: New owner to take over downtown arthouse theater on June 1 Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Entertainment: 'It Ends With Us' author's new novel Who is Taylor Frankie Paul? Photographing a celeb wedding 'The Summer I Turned Pretty' Orlando Bloom's transformation Body found in D4vd's car Bucket List Family's new chapter Vanilla Ice reflects 'Only Murders in the Building' Season 5 Lorde gets personal Cinema Paradiso Hollywood: New owner to take over downtown arthouse theater on June 1 Phillip Valys, South Florida Sun-Sentinel Tue, May 20, 2025 at 5:27 PM UTC 4 min read More cocktail-and-a-movie premieres with neighboring restaurants. More film festivals. And a striking new partnership with a contemporary art center four blocks east. These are some of the ambitious changes planned for Cinema Paradiso Hollywood, the 12-year-old downtown arthouse theater, which on Monday announced its new owner: the Hollywood Art and Culture Center. The center will take over operations on June 1, executive director Jennifer Homan told the South Florida Sun Sentinel, although the new two-year lease agreement is still “being finalized.” Advertisement Advertisement Advertisement Advertisement “It’s exciting because the timing was absolutely right,” Homan said. “We already run the contemporary art galleries and the Hollywood Central Performing Arts Center, and now we have a movie theater. This lets us activate all three spaces and cross-pollinate our programming while still hosting many movie premieres.” Programming from the current owner, the Broward County Film Society — which operates Savor Cinema in Fort Lauderdale and the Fort Lauderdale International Film Festival (FLIFF) — will continue through June 5, said Hal Axler, the society’s managing director. Then, on June 6, the first event under Homan’s leadership will be the wide-release premiere of Wes Anderson’s “The Phoenician Scheme,” according to a news release from the Hollywood Art and Culture Center. The Broward County Film Society board decided to transfer ownership of the theater to the art center earlier this year after Gov. Ron DeSantis vetoed $32 million in state arts and culture funding last summer, a wipeout that “took us by surprise,” Axler said. Advertisement Advertisement Advertisement Advertisement “We assumed we wouldn’t get funding this year, so we decided as a board to focus more on Savor Cinema and less on Cinema Paradiso Hollywood,” Axler said. “But this is totally a positive for us. It’s not a negative bailout thing. We’re thrilled [the art center is] managing it. We feel that an arts center in Hollywood is way more suited to marketing in Hollywood, to the crowds that live downtown.” Lisa Grigorian, the film society’s president and CEO, stressed that FLIFF’s partnership with Cinema Paradiso Hollywood as a host venue for premieres will “stay intact.” The festival will mark its 40th anniversary with screenings tentatively set for Feb. 20 to March 1, 2026, at multiple Broward County venues. In the meantime, the Art and Culture Center will continue honoring benefits for Broward County Film Society members, including free and discounted movie passes at Cinema Paradiso, she added. Lisa Liotta, operations manager for the Hollywood Community Redevelopment Agency, said she’s seen foot traffic declining at the theater for years. When the film society told her it no longer wanted to program the intimate 72-seater, she said she helped connect the nonprofit with Homan — and Homan liked the idea. Advertisement Advertisement Advertisement Advertisement “It’s a wonderful amenity for a historic downtown to have an arthouse cinema,” Liotta said. “But the location wasn’t always given a whole lot of love. Now everyone wins, and we’re excited for [the center] to broaden the scope of art and culture it brings to Hollywood.” Cinema Paradiso Hollywood was the brainchild of FLIFF director Gregory von Hausch, who left the nonprofit last year. In 2013, he opened the Hollywood theater at 2008 Hollywood Boulevard, a sister to Savor Cinema in downtown Fort Lauderdale, to grow the festival’s footprint farther south. In 2021, von Hausch also took over Fort Lauderdale’s Classic Gateway Theatre, then bowed out a year later because of mounting renovation expenses. The switch in Cinema Paradiso Hollywood operators now leaves the Broward County Film Society in charge of a single movie theater: the county-funded Savor Cinema. Homan, who took over the Hollywood Art and Culture Center in January 2024, said her new role as theater operator came at an ideal time. Her takeover dovetails with the gallery’s upcoming 50th anniversary and the debut of a new 5,000-square-foot extension wing in October. That education center, she said, will offer a green screen and a film-editing lab for local filmmakers to produce homegrown projects that will later premiere at Cinema Paradiso. In addition, exhibits at the art center will be paired with more performances and films, she said. Advertisement Advertisement Advertisement Advertisement Meanwhile, the theater will keep screening first-run premieres, with receptions taking place at nearby restaurants, she added. Another popular film festival, Popcorn Frights , will also host screenings there later this summer. “The way to stay successful is to cross-promote the theater with the art center with the tens of thousands of visitors we already reach,” Homan said. “That’s how we’ll make sure the theater stays the jewel that it is downtown.” A premiere party for “The Phoenician Scheme” will take place at 6 p.m. June 6 at The Vintage on Harrison, 1955 Harrison St. That will be followed by a 7 p.m. screening at Cinema Paradiso Hollywood, 2008 Hollywood Blvd. Visit fliff.com . Advertisement About Our Ads Solve the daily Crossword 22,504 people played the daily Crossword recently. Can you solve it faster than others? 22,504 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! Movies TV + Streaming How to Watch Music Celebrity Books The It List Interviews Yahoo Picks Help Suggestions About Our Ads Site Map Follow us on © 2025 Yahoo. All rights reserved."
    },
    {
      "url": "https://www.partyslate.com/venues/savor-cinema",
      "text": "SAVOR Cinema | Fort Lauderdale Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas SAVOR Cinema Find Venues / Florida / Fort Lauderdale / SAVOR Cinema Unclaimed SAVOR Cinema 503 SE 6th St, Fort Lauderdale, FL 33301, USA Max Seated 216 Max Standing 240 Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 0 About SAVOR Cinema Tell us your special needs and we will tailor an evening or afternoon just for your event: Parties, Social, Holiday, Birthdays, Weddings, Anniversary, Reunion or any celebration. Event Spaces 1 216 max seated • 240 max standing 3 Savor Cinema 216 Seated 300 Standing Theater Pricing Packages SAVOR Cinema hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms Preferred caterers only Preferred suppliers only Map 503 SE 6th St, Fort Lauderdale, FL 33301, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://fliff.com/events/soundofmusicsingalong/",
      "text": "The Sound of Music: Sing A Long – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission The Sound of Music: Sing A Long The happiest sound in all the world! Savor Cinema Come celebrate and be part of the most popular musical of them all, Rodgers & Hammerstein’s The Sound of Music Grab your lederhosen, practice your best Maria von Trapp impression and get ready to enjoy Rodgers & Hammerstein’s The Sound of Music Sing-A-Long! Join us at Savor Cinema om May 14th at 6pm for a screening of the smash-hit 1965 movie musical in glorious, full-screen technicolor, complete with onscreen lyrics. Based on the amazing true story of The Trapp Family Singers, The Sound of Music is a cinematic landmark and winner of five Academy Awards®, including Best Picture. Starring Julie Andrews and Christopher Plummer, the film features timeless songs by Rodgers & Hammerstein including “My Favorite Things,” “Do-Re-Mi,” “Edelweiss,” “Climb Ev’ry Mountain” and more. Enjoy the movie with your fellow attendees – costumed nuns, Maria look-alikes and von Trapp children – all singing their hearts out to the classic Rodgers & Hammerstein tunes. Costumes are not obligatory but highly recommended! As we want the next generation to experience this amazing musical, all students 18 years and younger are FREE. But, they have to sing their hearts out! To reserve student tickets, please contact hal@fliff.com This screening is made possible through the generosity of Rick and Flo Celender. CREDITS DIRECTOR(S): Robert Wise PRODUCER(S): Robert Wise CAST: Julie Andrews, Christopher Plummer, Eleanor Parker, Richard Haydn, Peggy Wood, Charmian Carr Choose A Showtime To Purchase: BUY TICKETS NOW Become a Member Details countries : United States of America YEAR: 1965 RUN TIME: 174 MIN LANGUAGE(S): en venues : Savor Cinema < BACK TO FILMS SHARE THIS: Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    },
    {
      "url": "https://fliff.com/savorcinema/",
      "text": "Savor Cinema – Fort Lauderdale Film Festival Skip to content Sign In Account Manage Membership Sign Out CART( ) Welcome! You're now logged out. Come back soon! Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Home Films Calendar Film Info Festivals FLIFFShorts FLIFF40 Popcorn Frights Rental Rental Information Venue Rental Application Membership Support Volunteer Sponsorships Our Sponsors Donate Gift Cards Info Contact Newsletter Sign Up Press Room FLIFF Photo Gallery Irwin’s Gallery About Join Our Team History of Savor Cinema Board of Directors Broward County Film Commission Upcoming Films Films Showtimes Ain’t No Back to a Merry-Go-Round This documentary tells the forgotten story of Blacks and Jews uniting to protest Echo Park, a segregated amusement park outside of DC in 1960. Dec 15, Dec 17, Dec 18 Buy Now Boys Go to Jupiter Animated A teenager in suburban Florida desperately hustles to make $5,000 in this dreamy and surreal animated coming-of-age story. Sep 11 Buy Now Checkpoint Zoo Checkpoint Zoo documents a daring rescue led by a heroic team of zookeepers and volunteers, who risked their lives to save thousands of animals trapped in a zoo behind enemy lines in the Russian Invasion of Ukraine. Sep 22, Sep 23, Sep 28 Buy Now FLIFF40 THE COUNTDOWN IS ON! Feb 20 - Feb 28 Buy Now FLIFFShorts THE COUNDOWN IS ON! Nov 6 - Nov 9 Buy Now FLIFFShorts: Late Night Shorts Nov 7 Buy Now Honey Don't! Comedy Honey O'Donahue, a small-town private investigator, delves into a series of strange deaths tied to a mysterious church. Sep 14, Sep 15, Sep 17 Buy Now John Lennon Birthday Celebration Comedy Join us as we celebrate John Lennon's 85th Birthday with a mini-concert, GIVE PEACE A CHANCE sing-a-long, collectables and a screening of the comedy HOW I WON THE WAR Oct 9 Buy Now Kerouac's Road: The Beat of a Nation Documentary KEROUAC'S ROAD: THE BEAT OF A NATION explores Jack Kerouac's legacy through stories of modern \"on-the-roaders\" and those who knew or were inspired by him. Oct 6, Oct 7, Oct 8 Buy Now Kinky Boots: The Musical Musical Direct from the London stage, the ‘freshest, most fabulous, feel-good musical of the decade’ (The Hollywood News) KINKY BOOTS, comes to U.S. cinema screens with this dazzling musical.    Come sporting your own most outrageous KINKY BOOTS for a free mixed drink at any screening. Sep 18 - Sep 25 Buy Now Laurence Gartel: Digital Titan: Digital Titan delves deep into the remarkable journey of Laurence Gartel, widely celebrated as the Father of Digital Art. The documentary offers an intimate and multidimensional portrait of the man behind the pixels—exploring his visionary spirit, groundbreaking innovations, and profound influence on the fusion of art and technology. Nov 2 Buy Now Photography as Art Documentary Presented by James Schot, Photography as Art takes you on a journey through pre-visualized narrative explorations—experiments in light, optics, and composition, all shaped by the precision of traditional photographic tools. Nov 15 Buy Now Savior-Faire Short Film Festival - Sunshine Celluloid #2 Nov 9 Buy Now Savoir-faire Shorts: Made in Broward 3 Nov 9 Buy Now Savor Cinema Will Be Closed this Evening for a Private Event Sep 13 Buy Now South Florida Greek Film Festival Presented by the Hellenic Cultural Society of South Florida. A celebration of film as art by presenting an eclectic selection of films from recent movies that introduce us to contemporary images of Greece, and looking back on classic works of Greek/Cypriot Diasporic cinematographers. Oct 11 - Oct 17 Buy Now SPOOKTACULAR SKELEBRATION Oct 31 Buy Now Sunfish (& Other Stories on Green Lake) Lives intertwine around Green Lake as a girl learns to sail, a boy fights for first chair, two sisters operate a bed-and-breakfast, and a fisherman is after the catch of his life. Sep 15 Buy Now Wisdom of Happiness Documentary A deeply intimate and highly cinematic documentary featuring the Dalai Lama, who, at nearly ninety year of age, offers practical advice for navigating the 21st century's challenges. Oct 27, Oct 28, Oct 30 Buy Now Follow Us Facebook-f Instagram Tiktok Youtube Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Home Sign Up for Our Newsletter Contact Us What’s On Membership Rentals About Box Office & General Information: 503 SE 6th Street Fort Lauderdale, FL 33301 954-525-FILM info@fliff.com ©2023 FLIFF, All rights reserved Ticketing and Site by Elevent Share on Facebook Share on Instagram Share on YouTube"
    }
  ]
}