{
  "fuentes": [
    {
      "url": "https://www.tallahasseearts.org/event/florida-state-bluegrass-festival/",
      "email": "info@tallahasseearts.org"
    },
    {
      "url": "https://www.floridastateparks.org/parks-and-trails/stephen-foster-folk-culture-center-state-park/florida-folk-festival-history",
      "email": "fsp.feedback@floridadep.gov"
    },
    {
      "url": "https://marathonflorida.com/florida-keys/baygrass-bluegrass-festival-founders-park-islamorada-florida-keys/",
      "email": "production@marathonflorida.com"
    },
    {
      "url": "https://bluegrasscountry.org/festivals/",
      "email": "calendar@bluegrasscountry.org"
    },
    {
      "url": "https://bluegrasscountry.org/festivals/",
      "email": "info@bluegrasscountry.org"
    }
  ],
  "mails": [
    "calendar@bluegrasscountry.org",
    "fsp.feedback@floridadep.gov",
    "info@bluegrasscountry.org",
    "info@tallahasseearts.org",
    "production@marathonflorida.com"
  ],
  "nombre_sitio": "floridastatebluegrass.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tallahasseearts.org/event/florida-state-bluegrass-festival/",
      "text": "Florida State Bluegrass Festival, Taylor County Tourism Office  at Forest Capital Museum State Park, Perry FL, Festivals English English French German Italian Portuguese Russian Spanish SUBMIT YOUR INFO LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. subscribe follow capture tweet watch connect access Submit an Event LOG-IN REGISTER LOGOUT MY ACCOUNT SEARCH MENU EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates EVENTS Art Camps Classes & Workshops Adult Classes Kids Classes Music Lessons Online Lessons Dance Family Film Free Heritage Literature Music Make Music Tallahassee 2025 Online Theatre PUBLIC ART Art in Public Places Exhibit with COCA GALLERIES Artport Gallery City Hall Gallery COCA Exhibition Online Galleries Outdoor Public Art Asphalt Art Great Art for Greater Bond History and Culture Trail Public Art Walks Sculpture Scape TLH Mural Makeover Voice of Trees – Tallahassee ARTS EDUCATION FUNDING OPPORTUNITIES Arts Education Grant Classroom Funding Lifelong Learning TEACHING RESOURCES COCA for Kids COCA in the Classroom Digital Resources Local, State, National Public Art Teachable Works School Mentoring Winterfest Winter Festival Student Artwork Form Winter Festival Teacher Participation Application GRANTS & RESOURCES Accessibility Directories Artists Businesses Organizations Outdoor Public Art Venues & Spaces Get Involved Grants Apply for a COCA Grant (FY26) Manage Your COCA Grant (FY25 and earlier) Grant-Related Marketing Material Submission Professional Development Resources MARKETING & SERVICES Advertising Opportunities Classifieds Marketing Assistance Media Guide Newsletters Services Artist Visa Support Technical Assistance MEMBERSHIP COCA Business Sponsors ABOUT COCA COCA’s 40th Anniversary Call for Musicians: 40th Anniversary  Local Music Playlist About COCA Bylaws & Policies COCA Staff and Board Mission, History & Values Join the COCA Team Cultural Plan Strategic Plan Arts Advocacy COCA SPOTLIGHT Contact COCA Economic Development License Plates Public Notices Tallahassee Creates Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Camps Culinary & Food Dance Festivals Film Free Gala History & Heritage Kids Lecture Literature Music -- Make Music Tallahassee 2025 Online/Streaming Theatre -- Stand-Up & Improv Visual Art Workshops & Classes -- Adult Classes -- Kids Classes -- Music Lessons -- Online Lessons Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select Accessibility Audio Description Closed Caption Open Caption Relaxed Performance Sign Language Accessible Parking Accessible Restrooms All Gender Restrooms Assisted Listening Braille Changing Stations Drop Off Elevator Family Restrooms Info Large Print Low Vision Service Animal TTD/TTY Volume Control Telephone Wheelchair Access Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH Advanced Filters Home Festivals Florida State Bluegrass Festival Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. Florida State Bluegrass Festival Presented by Taylor County Tourism Office at  Forest Capital Museum State Park , Perry FL Apr 05 - 06 2024 Join the Taylor County Tourism Council for the Florida State Bluegrass Festival and Chili Cookoff! GET TICKETS 21st Annual Florida State Bluegrass & Chili Cook-off Festival – Forest Capital State Park in Perry. Tickets are on sale now! This very popular event attracts thousands each year for bluegrass music, music workshops, arts and crafts, food vendors, chili cook-off and FREE Moon Pies! This event was chosen by the international Bluegrass Music Association as one of the best events in the entire country in 2006. 21st Annual Florida State Bluegrass & Chili Cook-off Festival – Forest Capital State Park in Perry. Tickets are on sale now! This very popular event attracts thousands each year for bluegrass music, music workshops, arts and crafts, food vendors, chili cook-off and FREE Moon Pies! This event was chosen by the international Bluegrass Music Association as one of the best events in the entire country in 2006. View less ADMISSION INFO Tickets range from $20.00 to $40.00. Get your tickets at the link or call the number below! Phone: 850-584-5366 LOCATION Forest Capital Museum State Park 204 Forest Park Dr., Perry, FL 32348 View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE Full\n        map and directions COVID-19 Protocols Indoor or outdoor activity: Outdoors MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! OUR PARTNERS COCA's programs are sponsored in part by the City of Tallahassee, Leon County, the State of Florida, Department of State, Division of Cultural Affairs, Community Foundation of North Florida, Knight Foundation, National Endowment for the Arts, and the Tallahassee Community Redevelopment Agency. COCA, the Council on Culture & Arts, is a non-profit organization that serves as the facilitator and voice for the arts and cultural industry in Florida's capital area. COCA provides information and promotes the arts and culture to both citizens and visitors. ABOUT US DIRECTORIES CLASSIFIEDS PARTNERS CONTACT US 114 S DUVAL STREET TALLAHASSEE, FL 32301 LOCAL NUMBER: (850) 224-2500 EMAIL: info@tallahasseearts.org © Copyright 2025 - Council on Culture & Arts | Contact Us | Site Map | Privacy Policy Powered by ARTSOPOLIS The COCA office currently has adjusted office hours to 1 PM – 5 PM to accommodate pickup for Winterfest. These hours will be adjusted from Tuesday, February 11, through Friday, February 28 . Regular office hours will return on Monday, March 3. For questions, feel free to contact staff via phone or email. In addition, access to Railroad Avenue between Gaines Street & FAMU Way is down to one lane heading south. For access to the COCA office, please take Gaines Street as currently, the COCA office is not accessible off of FAMU Way."
    },
    {
      "url": "https://www.floridastateparks.org/parks-and-trails/stephen-foster-folk-culture-center-state-park/florida-folk-festival-history",
      "text": "Florida Folk Festival History | Florida State Parks Skip to main content Florida State Parks Florida Department of Environmental Protection Main Menu Plan your visit Access for All FAQs Fees Rules & Regulations Camping & Lodging Find a Park Learn Resources Experiences & Amenities Educational Opportunities Programs Research & Collecting Get Involved Events Search Camping & Lodging Shop Breadcrumb Home Find a Park Stephen Foster Folk Culture Center State Park Florida Folk Festival History Back to Florida Folk Festival Initiative Menu Tickets & Lodging Performance Schedule Featured Performers Traditional Artists Sacred Steel Florida Remembered History Participant Information Sponsors FAQs Food Crafts Dancing Folklife Area Seminole Camp Children's Area Workshops Luthiers Banjo & Fiddle Contest Marketplace Environmental/Cultural Exhibitors In 1952, Mrs. Ada Holding Miller, President of the National Federation of Music Clubs was attending a Florida Federation of Music Clubs Spring Convention as guest speaker in White Springs. Following a tour of the Stephen Foster Memorial (now known as Stephen Foster Folk Culture Center State Park), Mrs. Miller suggested to Mrs. (W.A.) Lillian Saunders of White Springs that the grounds of the Stephen Foster Memorial would be an ideal setting to hold a folk festival. Mrs. W.A. Saunders speaking at the 1956 Folk Festival Mrs. Saunders presented the idea to the Stephen Foster Memorial Commission and they approved. The Commission contacted Sara Gertrude Knott of Princeton, Kentucky, who at that time was the most experienced individual in the United States on presenting folk festivals. Sara Gertrude Knott, founder of the National Folk Festival, met with the Stephen Foster Memorial Commission and agreed to come back to coordinate a festival the following year. She arrived in late December 1952, and worked long hours to bring together as many ethnic groups in Florida as possible. The Florida Folk Festival Association was organized in 1953. The officers were: J.L. McMullen, President; Helen Bixler, Secretary Cary A. Hardee, Treasurer. McMullen served four years as President and was succeeded by Aubrey Fowler of Live Oak. J.L. McMullen was active in many state organizations including President of the State Association of Court Clerks and President of the Florida Jaycees.  Helen Bixler was Executive Secretary of the Suwannee Chamber of Commerce.  Cary Hardee was Owner and President of a Live Oak bank. He also served as governor of the state of Florida from 1920-1924. The 1953 Florida Folk Festival was officially sponsored by the Florida Folk Festival Association for more than 10 years. Four months later the ring of the old school bell and the call of a town crier opened the festival against a backdrop of huge pines and moss-draped oaks and magnolias. By the time the last program ended at sunset, two and one-half days later, the festival had presented Minorcans, Seminole and Miccosukee Indians, Greek-Americans, Jewish-Americans, Czech-Americans, Spanish-Americans, African-Americans and Florida Crackers. School groups performed singing games, square-dancing, folk singing, Maypole dancing, rope skipping rhymes, and string band music. Individuals and groups of adults presented ballads, superstitions, fiddle and harmonica tunes, musical saw playing, folk tales and sacred harp songs. With the closing of the first Florida Folk Festival on May 10, 1953, Floridians had been introduced to themselves and to their visitors in a way they had never known before. When it was over, all agreed that the first Florida Folk Festival was a success to be repeated annually. As Miss Knott wrote for the 1969 program, \"Little did we dream when the first two years of the Florida Folk Festival had passed, with the young Festival roots in the soil of the state, that a few years hence, the Sunshine State would have developed a real Florida Folk Festival peculiar to that state alone.\" Miss Knott directed the first two Florida Folk Festivals, but she asked after the second that the commission begin searching for her replacement. The Florida Folk Festival Association met with the Stephen Foster Memorial Commission and stressed that they felt the Florida Folk Festival should be directed by a Floridian and presented the name of one of the performers, Miss Thelma A. Boltin of Gainesville, Director of Programs for the City's Recreation Department. Miss Boltin had been a participant in the first two festivals as a storyteller relating her famous Old Knocker family ghost tales and The Legend of the Spanish Moss. Miss Boltin was contracted in 1954 to direct the festival. She moved to White Springs in 1956, when she was employed full time as director of special events at the Stephen Foster Memorial and lived there until the late 1970s. Miss Boltin traveled countless thousands of miles, in-state and out-of-state seeking talent and ways to improve the festival. Dancing at the Folk Festival in 1957 Miss Boltin presented her program called Florida Lore in Song and Story to hundreds of school children and civic organizations throughout Florida and South Georgia. Over the years she became the first lady of the Florida Folk Festival, affectionately known as `Cousin Thelma' to the thousands of people who attended the festival from 1955 to 1986. It was evident to all who attended that Thelma Boltin was a legend at the Florida Folk Festival, as she introduced every act with homespun sincerity for each performer or group who appeared on the stage. In 1986 Miss Boltin began sharing her Mistress of Ceremony duties with other long-time festival performers. After the Florida Department of State established the Bureau of Florida Folklife Programs in White Springs in 1976, they coordinated the festival until 1995.  At that time, the Florida Folklife Program was re-located to Tallahassee and general festival administration was undertaken by the Museum of Florida History though the Florida Folklife Program continued to coordinate the Folklife and Apprenticeship Areas. In 2002, the Florida Park Service assumed full responsibility for coordinating and producing the Annual Florida Folk Festival, beginning with the 50th anniversary presentation that year. The festival went virtual in 2020 and 2021 and returned to usual operations in 2022. The virtual events can be viewed on the Florida Folk Festival YouTube channel . Florida State Parks Main Menu Plan your visit Access for All FAQs Fees Rules & Regulations Camping & Lodging Find a Park Learn Resources Experiences & Amenities Educational Opportunities Programs Research & Collecting Get Involved Events Have Questions? Contact the Statewide Information Line: (850) 245-2157 Or send an email to: FSP.Feedback@FloridaDEP.gov Stay Connected Facebook Twitter Instagram Pinterest You Tube © Copyright 2025 © Copyright 2018 Florida Department of Environmental Protection. Customer Survey Disclaimer Privacy Policy Website Login"
    },
    {
      "url": "https://marathonflorida.com/florida-keys/baygrass-bluegrass-festival-founders-park-islamorada-florida-keys/",
      "text": "Baygrass Bluegrass & Bay Jam Festival – Founder’s Park- Islamorada, Florida Keys - Marathon Florida Keys MENU MENU HOME Community Real Estate Key Largo Real Estate Real Estate Professionals Key Largo Islamorada / Tavernier / Layton RE Real Estate Professionals Islamorada Middle Keys Real Estate Real Estate Professionals The Middle Keys Lower Keys Real Estate Real Estate Professionals in the Lower Keys Key West Real Estate Real Estate Professionals in Key West Keys Communities Places to visit Attractions List of Attractions & Places of Interest Municipalities Listing of all the governments and municipalities in The Florida Keys. Schools & Daycare Public & Private Schools and Daycare Places of Worship Churches and other places of worship Accommodations Hotels, Motels, Botels, Resorts, B&B's, Time Share Hotels, Motels, Botels, Resorts, and Bed & Breakfasts in The Florida Keys Camping Find places to go camping in The Florida Keys. on the Water Watersports Rent or Purchase kayaks, SUPs, & jet skies Boating Rent, Purchase, Repair motor boats & sailboats Diving & Snorkeling Rent or Purchase scuba, snuba, freediving & snorkel equipment in The Florida Keys Fishing Fishing charters & guides and Purchase fishing tackle, bait & other related fishing equipment Professionals Attorneys Lawyers in The Florida Keys. Accountants Accountants, CPAs, & Bookkeepers Financial Services Banks, Mortgage Bankers, Insurance Companies, & Financial Institutions. Health & Wellness Spas, salons, fitness & medical clinics. Construction Contractors & construction materials Eat & Drink Restaurants, Bars & Catering Restaurants, Bars & Catering. Alcohol Where to buy Alcohol in The Florida Keys. Brewed drinks Brewed coffee, tea & beer in The Keys. Wine Wine sellers in The Florida Keys. Locals Transportation Auto Sales & Rentals, Taxi, Bus, Shuttles, Motorcycles, Bicycles. Shopping Retail Stores in The Florida Keys. Office Equipment & Supplies Office supplies & equipment in The Keys. Locals in the Florida Keys Videos of residents in The Florida Keys. Weddings & Planners Music & Art Art, Artists, Studios, Galleries, & Supplies Click here to find out who the artists are and where the art studios & galleries are – and find a list of many of the artists who draw or paint in The Florida Keys. Musicians and Music Videos Click here to get a list of musicians who perform here in The Florida Keys, and music videos produced for them by Conch Records of the Florida Keys (www.ConchRecords.com) NonProfits Pet Care Cliff's ORIGINAL MUSIC The Marathon Games Conch Records TV88  MOVIE PRODUCTIONS \"The Marathon Games Round 1\" \"Dive the Keys\" \"The Marathon Pentathlon 2020\" \"Beating the Bus\" \"We are Friends of Old Seven\" CONTACT  TV88 (305) 587-9830 Contact Us Learn more about us, view testimonials & Contact Us Advertise with TV88 Search by name, category, or event Search Browse: Home » Listings » Florida Keys Attractions & Places to Visit, State Parks » Baygrass Bluegrass & Bay Jam Festival – Founder’s Park- Islamorada, Florida Keys Baygrass Bluegrass & Bay Jam Festival – Founder’s Park- Islamorada, Florida Keys Added by Admin 0 reviews Listed in Florida Keys Attractions & Places to Visit, State Parks , Florida Keys Festivals/Community Events Islamorada, FL, USA Follow: Facebook Add to Favorites Contact Listing Owner Contact the Listing Owner To inquire about this listing, complete the form below to send a message to the listing owner. Name * Email * Phone Number Website Message * Tags: Florida Keys Festival , Music Festival Florida Keys Updated: Nov 19, 2020 Overview Reviews Baygrass Bluegrass Festival is a music festival that occurs every year at Founder’s Park in Islamorada, Florida Keys. David Feder notes that Bay Jam was created more than two decades ago to provide scholarships to Keys high school students to pursue music, dance, voice or the arts. More Videos Below: Dave Feder talks to TV88 about the history of Islamorada Community Entertainment (I.C.E.) 10th Annual Baygrass Bluegrass Festival January 14-16, 2022 The Baygrass Bluegrass Festival is coming to Islamorada January 17-18, 2020 Jackii Kennedy Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Stephanie Quayle Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys The Good Thing Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Michael Allman Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Kat Hall Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Guitar Battle with Ric Bluesfuze Arra & Steve Miller at Bay Jam 25 Nag Champayons Perform at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Lower Mat Cats Perform at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Bill Todd Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys Pear Performs at Bay Jam 25 March 31, 2019 in Islamorada, Florida Keys The 7th Annual Baygrass Bluegrass Festival January 20, 2019 in Islamorada, Florida Keys Promo for The 7th Annual Baygrass Bluegrass Festival January 18-20, 2019 Usual Suspects & Coconut Cowboys Performing at Bay Jam April 8, 2018 in Islamorada, Florida Keys Pasta & The Lower Mat Rats Performing Live at Bay Jam April 8, 2018 in Islamorada, Florida Keys David Feder and ICE Live at Bay Jam April 8, 2018 in Islamorada, Florida Keys Promo for the Bay Jam Music Fest taking place April 8, 2018 in Islamorada, Florida Keys The 23rd Annual Bay Jam Took Place On March 26, 2017 In Islamorada, Florida Keys 4th Annual Baygrass Bluegrass Festival 2016 4th Annual Baygrass Bluegrass Will Be At Founder's Park, 2016 Baygrass Bluegrass 2015 At Founder's Park - Islamorada, Florida Related Add Your Review Please login or register to add your review. Welcome to TV88 WHO IS TV88 ?? (305) 587-9830 TV88 is a video Production & Distribution Company. It owns www.MarathonFlorida.com , where it posts the videos it produces. MarathonFlorida.com is an Informational Business & Video Directory of Marathon & the Surrounding Florida Keys. TV88 video productions are shown on The Marathon Florida Show at The Marathon Community Cinema and other venues in town, as well as postings on You Tube, Facebook, and Instagram. TV88 produces recap videos for: – Meet Our Keys Fisheries Neighbors – American Legion Post 154 Historian – Veteran’s Day Parade – Prodigy Dance Studios – The History of the Diving Museum – Monroe Count TSIC – Art Under the Oaks – Pigeon Key – Crane Point – K.A.I.R. Annual Sombrero Beach Run – KCB St. Patrick’s Day Parade – KCB Lighted Boat Parade – KCB’s Kids Fishing Derby – The Annual 7 Mile Bridge Run – The Marathon Community Theatre . . . and many other businesses, organizations, and associations . . . TV88 has many local businesses, associations, and organizations it produces commercials for: – The Tackle Box – Marathon Lumber – Marathon Ale House – Sunrise Studios – Porky’s BBQ – Marathon Yacht Club – Mallory Pinto – Time Out Magazine – Tyrone’s Mobile Car Wash – Coast to Coast Pizza Company – S.S. Wreck & Galley Grill TV88 also uses footage it takes throughout the Middle Keys, and produces local full-length movies, like: – The Marathon Games – Conch Records Music Video Fests – “ Beating the Bus” – “We are Friends of Old Seven” Add or Edit your Listing CLICK HERE Click here to Edit an existing Listing , or to Add a new Listing on MarathonFlorida.com. ADD YOUR EVENT CLICK HERE Click the link above to Add your EVENT on to the front page of MarathonFlorida.com Email Sign Up Form Once a week we send out an email of videos produced in The Florida Keys.  If you'd like to receive this email once a week, sign up below.  All we need is your email address and first name, although feel free to leave any other information asked for.  Your email address WILL NOT be shared or sold to anyone else, and you WILL NOT be put on any other email lists. Thank you for opting in.  You will be happy that you did. Translate Spanish / English » Close Button Close Button Accessibility by WAH “Beating the Bus” Destination for Information Marathon & The Florida Keys Add an Event to Marathon Florida . com Advertise at The Marathon Community Cinema Advertise at the Marathon Community Cinema with The Marathon Florida Show Advertise with TV88 Advertising with Florida Keys Television TV88 WORKS!! Advertise with MarathonFlorida.com – Florida Keys Television TV88 Advertise your product or service with VIDEO on Florida Keys Television TV88 advertise-on-marathonflorida-com-and-florida-keys-television-tv88Feature your Restaurant on MarathonFlorida.com Broadcast your event LIVE with multiple cameras to multiple locations at the same time Create your own videos with the help of Florida Keys Television TV88 Exposure on Television How to Sell your Product or Service in The Florida Keys Marketing Statistics in The Florida Keys Sell your product or service in The Florida Keys Alcohol in the Keys All pages of Real Estate Professionals Annual Events & Festivals – Florida Keys Appraisal Companies Art/Artists – Florida Keys Attractions and Places to Visit in the Florida Keys Attractions & Places to Visit in Big Pine Key & The Lower Florida Keys Attractions & Places to Visit in Marathon & The Middle Keys Attractions & Places to Visit in The Upper Florida Keys Attractions in The Keys Auditions for the 2021 – 2022 Show August – What’s Happening at Founders Park Blog Boat Sales, Rentals, Repairs & Storage in the Florida Keys Watersports, Boat Rentals, Jet Skis, Repairs & Storage, kayaks, SUP in The Lower Keys Watersports, Boat Rentals, Jet Skis, Repairs & Storage, kayaks, SUP in The Middle Keys Watersports, Boat Rentals, Jet Skis, Repairs & Storage, kayaks, SUP in The Upper Keys Boating the Florida Keys Branding your company in The Florida Keys Branding, Marketing, Promoting in The Florida Keys Brews in the Florida Keys Camping in the Keys Camping, Mobile Homes, RV, Campers, Parks – Florida Keys Cart Churches, and Other Places of Worship in The Florida Keys Churches, and Other Places of Worship in The Lower Keys Churches, and Other Places of Worship in The Middle Keys Churches, and Other Places of Worship in The Upper Keys CLASSIFIEDS – Help Wanted for TV88 Cliff Rydell Music Complete list of ALL vacation rentals in Marathon & Key Colony Beach Conch Records Music Fests – The Florida Keys Conch Records of The Florida Keys Construction – Florida Keys Contact Convenient Transportation Services in The Florida Keys The Lower Keys Transportation Services Transportation Services in The Middle Keys Transportation Services in The Upper Keys Create Listing Current Florida Keys Videos Directory Diving The Florida Keys Domain Names For Sale Driftwood Marina Edit Profile Email Signup Thanks Enjoy World Class Salons, Spas, Fitness, Wellness and Holistic Centers in the Florida Keys Enjoy World Class Wellness in The Lower Keys Enjoy World Class Wellness in The Middle Keys Enjoy World Class Wellness in The Upper Keys Events in The Florida Keys Experience Diving, Snorkeling and Water Sports in The Florida Keys Diving & Snorkeling in Big Pine & The Lower Florida Keys Diving & Snorkeling in The Middle Keys Diving & Snorkeling in The Upper Florida Keys Find Hotels, Motels, Resorts and Bed & Breakfasts in The Florida Keys Hotels & Resorts in Big Pine & The Lower Keys Hotels & Resorts in The Upper Keys Hotels, Motels, Resorts and Bed & Breakfasts in Marathon & The Middle Keys Hotels, Motels, Resorts and Bed & Breakfasts in The Florida Upper Keys Fishing the Florida Keys Florida Keys Accommodations Florida Keys Accountants Florida Keys Artists Florida Keys Attorneys Florida Keys Construction Contractors Florida Keys Financial Services Florida Keys Government Florida Keys Health & Wellness Florida Keys Office Florida Keys Shopping Florida Keys Television – TV88 in The Florida Keys Florida Keys Television . com  TV88  in The Florida Keys Florida Keys Television TV88 – Who we are Florida Keys Transportation Florida Keys Videos Florida Keys Visitor Information Florida Keys Wine Founders Park Summer Camp Get involved in the Festivals and Community Events in The Florida Keys Go LIVE with multi cameras Home Home Improvements- Key Largo Home Improvements- Key West & Lower Keys Home Improvements- Marathon Home Inspectors – Lower Keys Insurance Companies Insurance Companies- Islamorada Insurance Companies- Key West & Lower Keys Insurance Companies- Marathon IPN IRMA update Islamorada / Tavernier / Layton Real Estate Professionals Key Largo Real Estate Professionals Key West Real Estate Professionals Keys Mythology Learn More from TV88 about The Florida Keys Listing Page additions & edits Listings Locals Florida Keys Locals in the Florida Keys Log-In/Registration Login Maps of The Florida Keys Marathon / Middle Keys Real Estate Professionals MarathonFlorida.com  –  Marathon Florida . com Monroe County Schools & Daycare in The Florida Keys Schools & Daycare in Big Pine, Key West & The Lower Florida Keys Schools & Daycare in Islamorada, Tavernier, Key Largo & The Upper Florida Keys Schools & Daycare in Marathon & Middle Florida Keys Mortgage Bankers- Islamorada Mortgage Bankers- Key Largo Mortgage Bankers- Lower Keys Mortgage Bankers- Marathon Municipalities, Monroe County, City, and Villages Music in The Florida Keys Music Videos from The Florida Keys Musicians My account Non-Profits – Florida Keys Order Details Password Recovery Password Reset Payment Payment Confirmation Pet Care in The Florida Keys Places of Worship Prize for MarathonFlorida.com contests Process Payment Property Management Property Management- Duck Key Property Management- Islamorada Property Management- Key Largo Property Management- Key Largo Property Management- Key West Property Management- Key West & Lower Keys Property Management- Lower Keys Real Estate Agents Real Estate Agents in The Florida Keys- Islamorada Real Estate Agents in The Florida Keys- Key Largo Real Estate Agents in The Florida Keys- Marathon Real Estate Agents- Key West Real Estate Agents- Key West & Lower Keys Real Estate Information for The Florida Keys Real Estate in Marathon – Marathon, Florida Keys Real Estate Professionals in Big Pine & The Lower Florida Keys Real Estate Professionals in The Upper Keys of Key Largo, Tavernier, Plantation Key, Islamorada, Upper/Lower Matecumbe, and Layton Real Estate Professionals in Marathon, Key Colony Beach & The Middle Florida Keys Real Estate Inspectors- Key Largo Real Estate Inspectors- Lower Keys Real Estate Market in The Florida Keys for Buyers and Sellers Real Estate Photographers – Key West Real Estate Photographers- Key Largo Real Estate Professionals in The Florida Keys Real Estate Sales & Rentals Lower Keys Florida Rebekah in the Keys Biography Register Restaurants Florida Keys Restaurants, Bars, Food Trucks & Catering in The Florida Keys Restaurants, Bars, Food Trucks & Catering in The Lower Florida Keys Restaurants, Bars, Food Trucks & Catering in the Middle Keys, including Marathon Restaurants, Bars, Food Trucks & Catering in The Upper Keys, Islamorada, Tavernier & Key Largo Schools in The Florida Keys Shop Shopping, Grocery, Pharmacy, Clothing, Gift Stores in The Florida Keys Shopping in The Middle Florida Keys Shopping, Grocery, Pharmacy, Clothing, Gift Stores in Big Pine & The Lower Florida Keys Shopping, Grocery, Pharmacy, Clothing, Gift Stores in The Upper Florida Keys Showing at Marathon Community Theater & Cinema (Arts & Culture Guide) Sign Up Below! Sitemap Snorkel Florida Keys Store Checkout Thank You Your Account Testimonials Thank you for signing up The Florida Keys Fishing Charters and Boating are unlike any other Fishing and Boating Experience Fishing in The Middle Florida Keys Fishing in The Upper Keys Lower Florida Keys Fishing The Marathon Florida Show The Marathon Games The Marathon Games – home of The Marathon Pentathlon “The 2025 Marathon Pentathlon” is a world class sporting event How The Marathon Games are played in Modern Day Marathon, Florida Keys How to Register as a Pentathlete in The Marathon Pentathlon How your Non-Profit can apply with The Marathon Games The Marathon High School Football team The Dolphins Things to do in Marathon, Key Colony Beach, Islamorada, Key Largo, Big Pine & The Florida Keys Boat Rentals in The Florida Keys Dive the Florida Keys Fishing Florida Keys Title Agency Title Agency- Islamorada Title Agency- Key Largo TV 88 broadcasting in The Florida Keys Underwater Music Festival Upload Florida Keys videos to your Listing page Vacation Rentals in The Florida Keys Vacation Rentals in Big Pine, Key West & The Lower Florida Keys Vacation Rentals in Islamorada, Tavernier, Key Largo & The Upper Florida Keys Vacation Rentals in Marathon, Key Colony Beach & The Middle Florida Keys Video Gallery Video Production in The Florida Keys Watersports Florida Keys Watersports, Kayak, Jet Skis, SUP, Standup Paddleboards, Parasailing – Florida Keys Web Design & Branding Websites – Marathon & The Florida Keys Wedding Destinations & Wedding Packages in The Florida Keys Wedding Destinations in The Lower Florida Keys Wedding Destinations in The Middle Florida Keys Wedding Destinations in The Upper Florida Keys Weddings in the Florida Keys What’s Happening at Founders Park in April? Young Eagles Event YOUR channel on Florida Keys Television TV88 Skip to toolbar Login Username Password Remember Me Lost Password? Notifications Notifications How far is Marathon Florida from Key West and Key Largo Marathon, Florida is located in the middle of The Florida Keys and is referred to as ‘The Heart of The Florida Keys”. The Islands of Marathon stretch from mile marker 47, which is on the north side of the 7 Mile Bridge , and mile marker 59 in Grassy Key . Mile marker 106 is the first mile marker after crossing the 18 mile stretch at Key Largo and entering the Keys.  Mile marker 0 is located in Key West . Where is Marathon, Florida in The Florida Keys? Marathon, Florida is located in the middle of The Florida Keys.  It is a city spread over Knight's Key, Boot Key, Key Vaca, Fat Deer Key, Long Point Key, Crawl Key and Grassy Key islands in the middle of the Florida Keys.  It is in the County of Monroe in Florida. What’s Happening in Marathon & the Surrounding Florida Keys? Marathon Florida is a City made up of 13 islands located in the middle of The Florida Keys, about 50 miles north of Key West and about 50 miles south of Key Largo. Marathon Florida Keys boasts some of the best boating activities anywhere, including diving, snorkeling, and deep-sea, reef, and flats fishing. Add waterfront restaurants to a list of amenities, and you have a perfect vacation destination. production@MarathonFlorida.com (305) 587-9830 What is it like living in Marathon, Florida Keys? Marathon Florida is situated in Monroe County, in the middle of the Florida Keys, equally between Key Largo and Key West.  Marathon is one of the best places to live or vacation in Florida . Living in Marathon offers residents a dense suburban feel and most residents own their homes. Marathon offers a lot of bars, restaurants, coffee shops and attractions including the Turtle Hospital, Crane Point, The Dolphin Research Center, and the iconic 7 Mile Bridge. The public schools in Marathon are highly rated. Vacation Rentals in Marathon , Florida offer everything one needs for a stress free family get-away. HOME Community Cliff’s ORIGINAL MUSIC The Marathon Games Conch Records TV88  MOVIE PRODUCTIONS CONTACT  TV88 (305) 587-9830 TV88 – Powered by MarathonFlorida.com TV88 . Translate Spanish / English »"
    },
    {
      "url": "https://bluegrasscountry.org/festivals/",
      "text": "Bluegrass Festival Calendar – Bluegrass Country Skip to content Listener-supported radio playing American roots music 24/7 Donate Listen Facebook X YouTube Instagram Home About Bluegrass Country Radio Bluegrass Country Foundation History of Bluegrass on WAMU/Bluegrass Country Volunteer FAQ Program Guide Shows Schedule How to Listen Radio Replay Archive Player Festival Calendar Support Support Bluegrass Country Radio Be a Bluegrass Country Sustainer Be a Corporate Sponsor Donate a Vehicle Donate Real Estate Planned Giving Contact Donate Listen Search for: Home About Bluegrass Country Radio Bluegrass Country Foundation History of Bluegrass on WAMU/Bluegrass Country Volunteer FAQ Program Guide Shows Schedule How to Listen Radio Replay Archive Player Festival Calendar Support Support Bluegrass Country Radio Be a Bluegrass Country Sustainer Be a Corporate Sponsor Donate a Vehicle Donate Real Estate Planned Giving Contact Us Donate Listen Bluegrass Festival Calendar Updated August 15, 2025 Refresh this page to make sure you’re getting the latest updates. Welcome to the Bluegrass Country festival calendar.  We list bluegrass, old time and Americana festivals at date, in the US and around the world. This year we’re listing festivals outside the US on the same monthly pages as US festivals. If you know about a festival that isn’t on our list, please send us the information . “Bluegrass festival” is a broad category, encompassing old time fiddlers’ conventions, family weekends, street fairs, mega-music festivals and everything in between.  We’ve provided links to the festival websites so you can check the lineups, schedules, admission fees, facilities, whether there’s camping, jamming etc. Our calendar only lists events when we have confirmed dates, preferably from a current secure website or Facebook page .  Check back often, as we add new events when we find them. So pack up your instruments, load the camper and hit the road! UPDATES. Check the calendar for details.  Our online calendar starts with the current month. Click here to order a printable (PDF) copy of the calendar, listing over 560 festivals in 2025. August New listing: Lake Cumberland Bluegrass Festival in Kentucky September New listings: White Squirrel Bluegrass+ Festival in Illinois; Plymouth Frankly Bluegrass Music Festival in California; Moorestown Bluegrass Festival in New Jersey If you’d like to volunteer some time to help us keep this calendar up to date, we’d love to hear from you. E-mail calendar@bluegrasscountry.org . September October November/December September SEPTEMBER 4-6 Payson Fiddle & Food Truck Festival , Payson, AZ 4-6 Twin Oaks Fall Bluegrass Festival , Hoboken, GA 4-6 Watermelon Pickers’ Fest , Berryville, VA 4-6 Coal Miners Appreciation Music Festival , McClure, VA 4-7 Oldtone Music Festival North Hillsdale, NY 5-6 Mountain Song Festival , Brevard, NC 5-6 Bluegrass & Chili Festival, Wagoner, OK 5-6 Rockbridge Mountain Music & Dance Festival , Buena Vista, VA 5-7 Bluegrass on the Snake , Rigby, ID 5-7 Cameron Bluegrass Festival , Cameron, WI 6 White Squirrel Bluegrass+ Festival Olney, IL Facebook 7 Highlands Bluegrass Festival & Crafts Fair , Sloatsburg, NY 9-13 AmericanaFest , Nashville, TN 11-13 Buffalo River Bluegrass Festival Jasper, AR Facebook 11-13 Hoppin’ John Old-Time & Bluegrass Fiddlers’ Convention , Pittsboro, NC 11-13 Mohican Bluegrass Festival , Glenmont, OH 11-14 Jerusalem Ridge Bluegrass Celebration , Rosine, KY 12-13 Backyard Bluegrass Festival , Sullivan, IL Facebook 12-13 Walnut Hills Farm Bluegrass Festival Huber Heights, OH Facebook 12-13 Nine Mile Bluegrass Festival , Pikeville, TN 12-14 Pickin’ in the Pines , Flagstaff, AZ 12-14 Top of the Swan Bluegrass Camp and Jam-bo-ree Ferndale, MT 12-14 Silver Bay Mountain Music Festival , Silver Bay, NY 12-14 Bluegrass & Butterflies , Elkton, OR 12-20 Poppy Mountain Music Festival , Morehead, KY 13 Moorestown Bluegrass Festival Moorestown, NJ 13 Carolina Bible Camp Bluegrass Festival , Mocksville, NC 13 Red River Roots Bluegrass & Folk Festival Colfax, ND 13 Rock Castle Folk ‘n Bluegrass Fest , Hendersonville, TN 13-14 East Troy Bluegrass Festival , East Troy, WI 14 Pickin’ in the Rockies , Loma. CO 15-21 George, WA Bluegrass Festival , George, WA 16-20 IBMA World of Bluegrass Chattanooga, TN 17-21 Berkeley Old Time Music Co nvention , Berkeley, CA 17-21 Walnut Valley Festival , Winfield, KS 17-21 Upperco Music Festival , Upperco, MD 18-20 Uncle Pen Festival , Bean Blossom, IN 18-20 Cumberland River Bluegrass Festival , Burkesville, KY Facebook 18-20 Blazin’ Bluegrass Festival , Whitley City, KY 18-20 Starvy Creek Bluegrass Festival , Conway, MO 18-20 Skinnyfest Bluegrass Festival , West Union, OH 18-20 Dumplin Valley Bluegrass Festival , Kodak, TN 18-20 Nothin’ Fancy Bluegrass Festival , Buena Vista, VA 19-20 Berlin Fiddlers Convention , Berlin, MD 19-20 Livingston Bluegrass Festival Livingston, MT 19-21 Plymouth Frankly Bluegrass Music Festival Plymouth, CA 19-21 Two Rivers Bluegrass Festival , Durand, IL Facebook 19-21 FreshGrass , North Adams, MA 19-21 Miles City Bluegrass Festival , Miles City, MT 19-21 Bristol Rhythm & Roots Reunion , Bristol, TN/VA 20 MaupinFest Unionville, TN 20-21 Annapolis Baygrass Music Festival , Annapolis, MD 25-27 Dailey & Vincent Music Fest , Hiawassee, GA 25-27 First City Music Festival , Vincennes, IN 25-27 Vine Grove Bluegrass Music Festival , Vine Grove, KY 25-27 HOBA Fall Bluegrass Festival , West Plains, MO 25-28 American Mule and Music Festival Shelbyville, TN 25-28 Boats & Bluegrass , Winona, MN 26-27 Townsend Fall Heritage Festival , Townsend, TN 26-27 Virginia Bluegrass & Country Music Festival , Lawrenceville, VA Facebook 26-28 Sisters Folk Festival , Sisters, OR 26-28 Tygh Valley Bluegrass Jamboree ,  Tygh Valley, OR 26-28 Mountain Heritage Arts & Crafts Festival , Kearneysville, WV 27 Richmond East Moose Lodge Apple, Cider, Bluegrass Festival , Ashland, VA 27 Hammons Family Fiddle & Banjo Contests & World Class Jam , Marlinton, WV Facebook 27-28 George Portz Traditional Music Festival , Festus, MO CANADA 5-7 Keremeos Country & Bluegrass Jamboree , Keremeos, BC CZECH REPUBLIC 5-6 Bluegrass Marathon , Borovany, Tachov District 20 Babí léto festival , Kyselka ENGLAND 5-7 Sweet Sunny South American Oldtime Music Festival , Ashington, West Sussex PORTUGAL 13-15 Trafaria Bluegrass Festival , Trafaria Canceled for 2025 Grits ‘n Grass Music Festival , Pickens, SC October OCTOBER 1-4 Tennessee Valley Old Time Fiddlers Convention ,  Athens, AL 3-4 Ol’ Front Porch Music Festival , Oriental, NC 3-4 Raleigh Wide Open Bluegrass Festival , Raleigh, NC 3-4 Mason Dixon Music Festival, Delta, PA Facebook 3-4 3 Sisters Bluegrass Festival , Chattanooga, TN 3-4 Mountain City Fiddlers Convention , Mountain City, TN 3-4 Big Bend Bluegrass Festival , Alpine, TX 3-5 Huck Finn Jubilee, San Dimas, CA 3-5 Hardly Strictly Bluegrass , San Francisco, CA 4 Mayhaw Music Festival , Cottonwood, AL 4 Santa Barbara Old-Time Fiddlers’ Festival , Goleta, CA 4 Bascom Lamar Lunsford Festival , Mars Hill, NC 4 Spruce Pine BBQ Festival , Spruce Pine, NC 4 Mountain Magic in Fall Bluegrass, Antiques & Crafts Festival , Buchanan, VA 4 BirdFest & Bluegrass Festival , Ridgefield, WA 8-11 Turkey Track Bluegrass Festival Waldron, AR Facebook 8-12 Hillberry Harvest Moon Festival , Eureka Springs, AR 8-12 Blue Highway Fest, Big Stone Gap, VA 9-11 Oklahoma International Bluegrass Festival , Guthrie, OK 9-12 Suwannee Roots Revival , Live Oak, FL 10-12 The Ramble Festival , Darlington, MD 10-12 Cave Fest , Pelham, TN 10-12 Richmond Folk Festival , Richmond, VA 11 Moorefields Bluegrass Festival , Hillsborough, NC 11 Lester Flatt Celebration , Sparta, TN 12 Barbecue & Bluegrass Festival , Huntsville, AL 12 Nelson FFA Bluegrass Festival , Lovingston, VA 13-19 CBA Fall Campout , Lodi, CA 16-18 Holiday Hills Music Park Fall Bluegrass Festival , Laurel Hill, FL Facebook 16-18 Outer Banks Bluegrass Island Festival ,  Manteo, NC 16-20 Strawberry Music Festival Grass Valley, CA 17-18 Old Time Music Ozark Heritage Festival , West Plains, MO 22-26 Headin’ Home Fest, Hazlehurst, GA 23-25 Talladega Bluegrass & Fingerstyle Guitar Festival , Lincoln, AL 23-25 Salmon Lake Park Bluegrass Festival , Grapeland, TX Facebook 25 Stapleton Bluegrass Festival, Stapleton, AL 25 Smoky Mountains Bluegrass Festival , Maggie Valley, NC 25 Bluegrass by the Beach Festival , Ocean Isle Beach, NC 25 Blue Ridge Folklife Festival , Ferrum, VA 10/31-11/1 Sultana Downrigging Tall Ship and Bluegrass Festival , Chestertown, MD AUSTRALIA 10-12 String Valley Acoustic Festival Imbil, QLD Facebook 24-26 Dorrigo Folk & Bluegrass Festival , Dorrigo, NSW 25 Fleurieu Folk Festival , Willunga, SA GERMANY 18 Sulzbach Bluegrass Festival , Gaggenau-Sulzbach, Baden-Württemberg JAPAN 24-26 Fall Takarazuka Bluegrass Camp Discontinued Bloomin’ Bluegrass Festival , Farmers Branch, TX November/December NOVEMBER 10/31-11/1 Sultana Downrigging Tall Ship and Bluegrass Festival , Chestertown, MD 5-8 Fall Palatka Bluegrass Festival , Palatka, FL 6-8 Mountain View Bluegrass Festival , Mountain View, AR 6-8 Fall Forever Bluegrass Festival , Chickamauga, GA 6-9 CBA South State 48 Bluegrass by the Sea , Carlsbad, CA 7-8 Bluegrass Sampler Racine, WI 7-9 Minnesota Bluegrass Fall Jam , Plymouth, MN 13-15 Industrial Strength Bluegrass Festival, Wilmington, OH 13-16 Wickenburg Bluegrass Festival , Wickenburg, AZ 20-21 Withlacoochee Bluegrass Festival , Dunnellon, FL 20-22 Bluegrass Christmas in the Smokies Music Festival, Gatlinburg, TN 27-29 Thanksgiving Bluegrass Festival , Brooksville, FL AUSTRALIA 14-16 Mountaingrass Bluegrass and Old Time Music Festival , Beechworth, Victoria 21-23 Wirrina Bluegrass & Acoustic Roots Festival Wirrina Cove, SA SCOTLAND 4-16 Scots Fiddle Festival , Edinburgh SPAIN 6-9 Al Ras Bluegrass and Old Time Music Festival , Barcelona, Spain DECEMBER 4-6 Balsam Range Art of Music Festival , Lake Junaluska, NC 6 Honeymoon Island Bluegrass Festival , Dunedin, FL MEXICO 11-15 Strings & Sol , Puerto Morelos, Quintana Roo These festivals support Bluegrass Country 2025-09-08T17:23:05-04:00 Share This Story Facebook X Reddit LinkedIn WhatsApp Tumblr Pinterest Email On Air Now Radio Replay Free Smartphone Apps Supported by Bluegrass Country is a service of the Bluegrass Country Foundation 4401A Connecticut Avenue NW Box 137 Washington, DC 20008 info@bluegrasscountry.org Our Commitment to Diversity Equal Employment Opportunity Privacy Policy Copyright © Bluegrass Country Foundation | All Rights Reserved | Website design by Computer Engineering Group Facebook X YouTube Instagram Page load link Go to Top"
    }
  ]
}