{
  "fuentes": [
    {
      "url": "https://www.napleswinefestival.com/",
      "email": "info@napleswinefestival.com"
    },
    {
      "url": "https://wineauctioneer.com/learn/about/contact-us",
      "email": "whiskyauctioneer@whiskyauctioneer.com"
    },
    {
      "url": "https://wineauctioneer.com/learn/about/contact-us",
      "email": "whiskyauctioneerlondon@whiskyauctioneer.com"
    },
    {
      "url": "https://wineauctioneer.com/learn/about/contact-us",
      "email": "whiskyauctioneernl@whiskyauctioneer.com"
    },
    {
      "url": "https://www.guidestar.org/profile/65-0455486",
      "email": "info@floridawinefest.org"
    },
    {
      "url": "https://www.guidestar.org/profile/65-0455486",
      "email": "sandy@floridawinefest.org"
    },
    {
      "url": "https://swflwinefest.org/contact/",
      "email": "info@swflwinefest.org"
    }
  ],
  "mails": [
    "info@floridawinefest.org",
    "info@napleswinefestival.com",
    "info@swflwinefest.org",
    "sandy@floridawinefest.org",
    "whiskyauctioneer@whiskyauctioneer.com",
    "whiskyauctioneerlondon@whiskyauctioneer.com",
    "whiskyauctioneernl@whiskyauctioneer.com"
  ],
  "nombre_sitio": "floridawinefest.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.napleswinefestival.com/",
      "text": ""
    },
    {
      "url": "https://wineauctioneer.com/learn/about/contact-us",
      "text": "Contact Us | Wine Auctioneer Auction ends Monday 15th September. Sell With Us in our Next Auction. rgba(0,0,26,1) rgba(255,255,255,1) Auctions Live and Upcoming Auctions Past Auctions Log in or Register to bid. Interested in buying wine? Buyer's Guide Buy Wine In Bond Fees and Payment Terms UK vs EU Lot Guide Shipping Storage Bidding over £2000 Log in or Register to bid. Are you selling wine? Selling with Wine Auctioneer Seller's Guide Sell Wine In Bond Fees and Payment Terms Sell with Us Log in or Register to bid. Learn about wine Explore and learn more about the world of fine wine at Wine Auctioneer. Explore the World of Wine Producers Geography Grape Varietals Bottles Explore all wine › Log in or Register to bid. News and Articles About Us Log in or Register to bid. My account Log in or register to view buying and selling activity, manage your collection, or update your personal profile. Log in Log in Log in to place bids, view your selling activity, and manage your collection with ease. Email Password Lost your password? Register with us Log in or Register to bid. Register with us Log in or Register to bid. Log in or Register to bid. Open menu Close menu Auctions Auctions Live and Upcoming Auctions Past Auctions Live Monthly Auction September 2025 Auction Upcoming Monthly Auction October 2025 Auction Upcoming Monthly Auction November 2025 Auction Interested in buying wine? Buying with Wine Auctioneer Buyer's Guide Buy Wine In Bond Fees and Payment Terms Storage UK vs EU Lot Guide Shipping Bidding over £2000 Buying In Bond Buy, collect and trade exceptional wines in bond. Participate in our auctions Register an account with us today to take part in all our auctions. Are you selling wine? Selling with Wine Auctioneer Seller's Guide Sell with Us Fees and Payment Terms Sell Wine In Bond Complete our Seller Form Start with a free valuation and auction your bottles today. Our Global Locations Learn how we support wine lovers across the world. Learn about wine Explore our encyclopedia of wine knowledge Explore and learn more about the world of fine wine at Wine Auctioneer. Producers Grapes Geography Bottles Explore all wine › About Us Learn more about Wine Auctioneer and our mission to make incredible fine wines accessible for all. News and Articles Read the latest news, articles and interviews from our in-house wine experts. Search Live auction Past auctions Your saved searches My Account Cart Cart Cart empty Browse our live auctions to bid on lots of interest or preview our upcoming auctions. Log in Register with us Live Auction September 2025 Auction Ending 15.09.2025 Log in or Register to bid. Get In Touch Do you have questions about buying or selling with us? Or do you need advice from one of our experts? Feel free to get in touch with us, we're here to help. Sell with us Press and media enquiries Book a Collection or Drop Off If you'd like to visit us in person we have offices in central Scotland, London and the Netherlands.  Book an appointment at a time and location of your choosing and we'll look forward to welcoming you. Perth Office London Office Utrecht Office Perth Office Wine Auctioneer Ltd, West Building, Ruthvenfield Grove, Inveralmond Industrial Estate, Perth PH1 3FN ( Get Directions ) Book Appointment for Perth Office Opening Times: Mon-Sat 10am-5pm Tel: +44 1738 245576 London Office Wine Auctioneer Ltd, 12 Alliance Court, Alliance Rd, London W3 0RB ( Get Directions ) Book Appointment for London Office (Drop-off only) Opening Times: Mon-Fri 10am-5pm Tel: +44 1738 245576 Utrecht Office Wine Auctioneer Ltd, Zonnebaan 23, 3542 EB Utrecht, Netherlands ( Get Directions ) Book Appointment for Utrecht Office Opening Times: Mon-Fri 10am-5pm Tel: +31 (0)20 899 1167 Contact Our Team Enquiry Type - Select - Selling Enquiry Free Valuation Payment Enquiry Order Enquiry Lot Listing Change Bottle Pickup / Collection Enquiry Shipping Enquiry Feedback Other First name Last name Email address Contact number Message Leave this field blank Image Buyer's Guide Subtitle A step-by-step guide to buying wine at auction with Wine Auctioneer. Image Seller's Guide Subtitle A step-by-step guide to selling wine at auction with Wine Auctioneer. Image Auction Calendar Subtitle View our upcoming auctions to make sure you don't miss out on our bottle deadlines. Interested in Buying? Discover and bid on unique, highly limited and renowned wines in our online auctions each month. How to bid Interested in Selling? Our global wine auctions give your bottles the attention they deserve. Get started with a free valuation today. Sell with us Elsewhere in About us About Us Careers Contact Us FAQs Press and Media About Us About Us FAQs Careers Press and Media Contact Us Account Log in Register with us Buying Watchlist My Collection Searches Legal Privacy Policy Cookies Policy Counterfeit Policy Terms and Conditions Terms of Use Payment provided by We accept Stay updated one email at a time! Sign up for updates Follow us on Facebook Follow us on LinkedIn Follow us on Instagram © 2025 Wine Auctioneer. All rights reserved. Registered in Scotland. Company Number SC490586. Registration Number 197 5059 65. Confirm your bid Loading... Loading... All lots are\n            subject to 15% buyers commission (ex-vat) and by placing a bid you\n            agree to our terms and conditions and that\n            you are happy to purchase this lot in the condition shown. Cancel Bids 0 Values displayed below represent bid price and\n      do not include applicable fees calculated at checkout. Auction closed. You've won 0 lot(s). Please checkout to purchase your item(s). Total: Checkout to complete purchase(s) Auction closed You've won 0 lot(s)! Checkout to complete purchase(s)"
    },
    {
      "url": "https://www.guidestar.org/profile/65-0455486",
      "text": "Florida Winefest And Auction Inc - GuideStar Profile Search Update Nonprofit Profile Products Candid insights Support Create account Sign in GuideStar Florida Winefest And Auction Inc Sarasota, FL | www.floridawinefest.org Summary Programs + Results Financials Operations Mission PROVIDE FUNDING TO QUALIFIED  CHARITABLE ORGANIZATIONS FOR PROGRAMS ASSISTING DISADVANTAGED CHILDREN, YOUTH AND FAMILIES IN SARASOTA AND MANATEE COUNTIES. (FLORIDA)\n WE ARE THE FUND-RAISING ARM FOR CHARING FOR CHILDREN CHARITIES. Notes from the nonprofit Florida Winefest & Auction, Inc. is the fund-raising arm for Caring for Children Charities.  \n\nCaring for Children Charities (EIN # 93-3143149) is applying for a 501(c)(3) not-for-profit corporation and the application is in process. Ruling year info 1994 Principal Officer Mrs. Sandra W. Loevner Main address PO Box 4193 Sarasota, FL 34230 USA Show more contact info Contact Information × Contact Email contact available with a Pro subscription Physical Address PO Box 4193 Sarasota, FL 34230 Payment Address PO Box 4193 Sarasota, FL 34230 Donation Payable Legal name of organization: Florida Winefest And Auction Inc Close EIN 65-0455486 NTEE code info Raising & Fund Distribution (Oun) IRS filing requirement This organization is required to file an IRS Form 990 or 990-EZ. Sign in or create an account to view Form(s) 990 for 2023, 2022 and 2021. Register now Communication Is this your nonprofit? Login and update Why claim your profile? Learn about benefits Programs and results What we aim to solve This profile needs more info. If it is your nonprofit, add a problem overview. Login and update Our programs SOURCE: Self-reported by organization What are the organization's current programs, how do they measure success,\r\n            and who do the programs serve? Meaningful Grants to Local Not-for-Profit Organizations Florida Winefest & Auction, Inc.  is a group of dedicated volunteers who organize  first-class fun events to generate funds to help children in need. In the last 33 years, Florida Winefest & Auction has supported over 98 different charitable organizations and  awarding over $9.3 million in charitable grants. Each year grant applications are submitted to the Florida Winefest by qualified not-for-profit charities. The applications are reviewed by the Florida Winefest Grants Committee.  The website www.floridawinefest.org will give dates when applications may be submitted to received funds from upcoming events.  Florida Winefest & Auction is the fund-raising arm of Caring for Children Charities. Population(s) Served Where we work Manatee County, FL Sarasota County, FL Goals & Strategy SOURCE: Self-reported by organization Learn about the organization's key goals, strategies, capabilities, and progress. Charting impact Four powerful questions that require reflection about what really matters - results. What is the organization aiming to accomplish? What are the organization's key strategies for making this happen? Host multiple fund-raising events during the year to benefit local disadvantaged children's charities. Our staff is comprised of volunteers who donate their time to organize hold the events.  We have been hosting events since 1991.  Over $9.3 Million has been donated to 98 individual charities in Manatee & Sarasota Counties.  Events are scheduled for January 2025. What are the organization's capabilities for doing this? What have they accomplished so far and what's next? How we listen SOURCE: Self-reported by organization Seeking feedback from people served  makes programs more responsive and effective. Here’s how this organization is listening. done We shared information about our current feedback practices. How is your organization using feedback from the people you serve? Which of the following feedback practices does your organization routinely carry out? , , , , , What challenges does the organization face when collecting feedback? Financials Florida Winefest And Auction Inc lock Unlock financial insights by subscribing to our monthly plan. Subscribe Unlock nonprofit financial insights that will help you make more informed decisions.\r\n      Try our monthly plan today. Analyze a variety of pre-calculated financial metrics Access beautifully interactive analysis and comparison tools Compare nonprofit financials to similar organizations Want to see how you can enhance your nonprofit research and unlock more insights? Learn more about GuideStar Pro. Operations The people, governance practices, and partners that make the organization tick. menu Board of directors Officers, directors, trustees, and key employees Highest paid employees lock Connect with nonprofit leaders Subscribe Build relationships with  key people who manage and lead nonprofit organizations with GuideStar Pro.\r\n      Try a low commitment monthly plan today. Analyze a variety of pre-calculated financial metrics Access beautifully interactive analysis and comparison tools Compare nonprofit financials to similar organizations Want to see how you can enhance your nonprofit research and unlock more insights? Learn More about GuideStar Pro. lock Connect with nonprofit leaders Subscribe Build relationships with  key people who manage and lead nonprofit organizations with GuideStar Pro.\r\n      Try a low commitment monthly plan today. Analyze a variety of pre-calculated financial metrics Access beautifully interactive analysis and comparison tools Compare nonprofit financials to similar organizations Want to see how you can enhance your nonprofit research and unlock more insights? Learn More about GuideStar Pro. Florida Winefest And Auction Inc Board of directors as of\r\n\r\n              08/18/2024 SOURCE: Self-reported by organization Board co-chair Ms.                  Sandra                                    Loevner community volunteer Term:  2023 -   2024 Board co-chair Ms.\r\nCatherine\r\n                  Rustin Community volunteer Term:  2023 -   2024 David                                    Band Band, Gates Martha                                    Ballard Community Volunteer Margo                                    Bohaty Community Volunteer Carl                                    Cannova Community Volunteer Chris                                    Covelli Viking Culinary Center Chef Trey                                    Desenberg Community Volunteer Judy                                    Fiala Community Volunteer Sandra                                    Loevner Community Volunteer Paul                                    Mattison Mattison's Culinary Group Catherine                                    Rustin Rustin Print Group Jim                                    Shedivy Red Moon Solutions Lindy                                    Smith Aladdin Equipment Company Jack                                    McKissock Aladdin Equipment Company Beckie                                    Stoner Kerkering Barberio Jeff                                    Harris Community Volunteer Tom                                    Tomlinson Community Volunteer Board leadership practices SOURCE: Self-reported by organization GuideStar worked with BoardSource, the national leader\r\n        in nonprofit board leadership and governance, to create this section. Board orientation and education Does the board conduct a formal orientation for new board members and require all board members to sign a written agreement regarding their roles, responsibilities, and expectations? No CEO oversight Has the board conducted a formal, written assessment of the chief executive within the past year ? No Ethics and transparency Have the board and senior staff reviewed the conflict-of-interest policy and completed and signed disclosure statements in the past year? No Board composition Does the board ensure an inclusive board member recruitment process that results in diversity of thought and leadership? Yes Board performance Has the board conducted a formal, written self-assessment of its performance within the past three years? No You have profile views left. Create account or sign in to unlock more profile views. Create your free account Already subscribed to GuideStar? Sign in Discover the new, more powerful way to search nonprofits for free Candid search combines trusted data from GuideStar and Foundation Directory so you can access more nonprofit insights in one place. Your free registration on Candid's new application gives you access to: More profile views Up to three years of Forms 990 Revenue and expense data for the current fiscal year CEO, Board Chair, and Board of Directors information And more Get the nonprofit information you need at Candid . Take me to Candid to register Thanks for signing up! An email has been sent to the address you provided. Click on the link in that email\r\n              to get more GuideStar Nonprofit Profile data today! (Don't see an email in your inbox? Click here to resend it.) × Thanks. A verification email has been sent to you. Please check your inbox in order to proceed. GuideStar Pro Reports Report successfully added to your cart! Go To Cart Want more data? A GuideStar Pro report containing the following information is available for this organization: Email contact information Financial trends metrics for five most recent years 2023, 2022, 2021, 2020, 2019* Financial statements for , , , , Letter of Determination Officer and/or Employee data for 2023, 2022, 2021, 2020, 2019 Contractor and/or Paid Preparer data for 2023, 2022, 2021 Board of Directors data for 2024 *with the ability to download the data for 2023, 2022, 2021, 2020, 2019 Download it now for $125 . Sample Report Buy it now Report Added to Cart Need the ability to download nonprofit data and more advanced search options? Consider a Pro Search subscription. This information is only available for subscribers and in Premium reports. Close"
    },
    {
      "url": "https://swflwinefest.org/contact/",
      "text": "Contact Us - Southwest Florida Wine and Food Fest Skip to main content Hit enter to search or ESC to close Close Search Menu SWFL Wine & Food Fest SWFL Wine & Food Fest Since 2009, this premier fundraising event has donated over $29 million for three primary beneficiaries: Golisano Children’s Hospital of Southwest Florida, and scholarships for local students majoring in health sciences to Florida Gulf Coast University and Florida SouthWestern State College. SWFL Wine & Food Fest SWFL Wine & Food Fest Event Tickets Chef Vintner Dinners Auction Catalog 2025 Vintners 2025 Chefs Sponsors & Partners Vacation Auction Items ATTEND VINTNER DINNERS MEET YOUR AUCTIONEER SWFL Children’s Charities SWFL Children’s Charities SWFL Children’s Charities, Inc. is a local nonprofit organization that is dedicated to saving children’s lives by supporting the region’s growing pediatric health care system. Contact Us SWFL Children’s Charities Our Mission Board of Directors Trustees Beneficiaries Your Impact Testimonials BY THE NUMBERS – 46,000 children in SWFL have mental disorders today BY THE NUMBERS FAMILY STORIES Gallery Gallery View images from the Live auction. Vintner Dinners, Special Events and Check Presentations. gallery2 2025 SWFL Wine & Food Fest Grand Tasting & Live Auction gallery3 Live Auction Grand Tasting gallery4 Vintner Dinners Check Presentation News Donate info@swflwinefest.org Phone: 239.433.4260 Email: info@swflwinefest.org Address: 12811 Kenwood Lane Suite 110 Fort Myers, FL 33907 Contact: Heidi Davis, Executive Director Contact Us Name (Required) First Last Phone (Required) Email (Required) Address (Required) Street Address City Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah U.S. Virgin Islands Vermont Virginia Washington West Virginia Wisconsin Wyoming Armed Forces Americas Armed Forces Europe Armed Forces Pacific State ZIP Code Please Contact Me About (Required) Making a Donation Event Sponsorship Ticket Inquiry Vintner Participation Chef Participation Auction Participation Hosting a Dinner Event Volunteering General Information Other Comments / Questions (Required) Newsletter Sign up for our newsletter to get the latest on all of the Winefest Happenings. Name (Required) First Last Email (Required) SWFL Children’s Charities, Inc. is a local nonprofit organization that is dedicated to saving children’s lives by supporting the region’s growing pediatric health care system. The SWFL Wine & Food Fest is the signature annual event for SWFL Children’s Charities, Inc. Wine & Food Fest Event Tickets Vintners Chefs Auction Items Chef Vintner Dinners SWFL Children’s Charities Our Mission Board of Directors Trustees Testimonials Contact Us © 2025 SWFL Children’s Charities, Inc. Privacy Policy | Accessibility Statement This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Close Menu SWFL Wine & Food Fest SWFL Wine & Food Fest Since 2009, this premier fundraising event has donated over $29 million for three primary beneficiaries: Golisano Children’s Hospital of Southwest Florida, and scholarships for local students majoring in health sciences to Florida Gulf Coast University and Florida SouthWestern State College. SWFL Wine & Food Fest SWFL Wine & Food Fest Event Tickets Chef Vintner Dinners Auction Catalog 2025 Vintners 2025 Chefs Sponsors & Partners Vacation Auction Items ATTEND VINTNER DINNERS MEET YOUR AUCTIONEER SWFL Children’s Charities SWFL Children’s Charities SWFL Children’s Charities, Inc. is a local nonprofit organization that is dedicated to saving children’s lives by supporting the region’s growing pediatric health care system. Contact Us SWFL Children’s Charities Our Mission Board of Directors Trustees Beneficiaries Your Impact Testimonials BY THE NUMBERS – 46,000 children in SWFL have mental disorders today BY THE NUMBERS FAMILY STORIES Gallery Gallery View images from the Live auction. Vintner Dinners, Special Events and Check Presentations. gallery2 2025 SWFL Wine & Food Fest Grand Tasting & Live Auction gallery3 Live Auction Grand Tasting gallery4 Vintner Dinners Check Presentation News Donate"
    }
  ]
}