{
  "fuentes": [
    {
      "url": "https://www.visitflorida.org/about-us/who-we-are/florida-council-of-tourism-leaders/member-biography/?q=M30O2DsGTczEdGPpvyjZlhUGCnGg9DmxCXtk19kfQ/W4EWIg+x3rYscKLXxIbahoUVSxcSBry3f39ZET8iOlrPA0Wz9a46CT",
      "email": "partner@visitflorida.org"
    },
    {
      "url": "https://floridakeyclub.org/",
      "email": "editor@floridakeyclub.org"
    },
    {
      "url": "https://floridakeyclub.org/",
      "email": "executiveassistant@floridakeyclub.org"
    },
    {
      "url": "https://floridakeyclub.org/",
      "email": "governoreleanor@floridakeyclub.org"
    },
    {
      "url": "https://floridakeyclub.org/",
      "email": "secretary@floridakeyclub.org"
    },
    {
      "url": "https://floridakeyclub.org/",
      "email": "treasurer@floridakeyclub.org"
    },
    {
      "url": "https://www.flclubhomes.com/contact-us",
      "email": "info@floridaclubrealty.com"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "aaron@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "ben@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "brian@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "byurigan@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "cj@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "dchau@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "debby@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "dgreen@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "emily@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "henry@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "jackie@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "jeff@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "jon@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "jstein@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "kevin@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "kyled@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "lindsey@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "logan@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "mackenzie@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "madison@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "mark@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "matthew@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "mcote@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "rhaddow@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "ryan@fsga.org"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "email": "tracy@fsga.org"
    },
    {
      "url": "https://www.floridayouthclubofamerica.org/contact-us/",
      "email": "floridayouthclub@usa.com"
    },
    {
      "url": "https://www.floridayouthclubofamerica.org/contact-us/",
      "email": "proteam@mopro.com"
    },
    {
      "url": "https://www.floridaclubgolf.com/golf/book-tee-time/",
      "email": "info@floridaclubgolf.com"
    },
    {
      "url": "https://www.theforumclub.org/contactus.php",
      "email": "forumclub@theforumclub.org"
    },
    {
      "url": "https://www.theforumclub.org/contactus.php",
      "email": "forumclub@theforumclub.org"
    }
  ],
  "mails": [
    "aaron@fsga.org",
    "ben@fsga.org",
    "brian@fsga.org",
    "byurigan@fsga.org",
    "cj@fsga.org",
    "dchau@fsga.org",
    "debby@fsga.org",
    "dgreen@fsga.org",
    "editor@floridakeyclub.org",
    "emily@fsga.org",
    "executiveassistant@floridakeyclub.org",
    "floridayouthclub@usa.com",
    "forumclub@theforumclub.org",
    "governoreleanor@floridakeyclub.org",
    "henry@fsga.org",
    "info@floridaclubgolf.com",
    "info@floridaclubrealty.com",
    "jackie@fsga.org",
    "jeff@fsga.org",
    "jon@fsga.org",
    "jstein@fsga.org",
    "kevin@fsga.org",
    "kyled@fsga.org",
    "lindsey@fsga.org",
    "logan@fsga.org",
    "mackenzie@fsga.org",
    "madison@fsga.org",
    "mark@fsga.org",
    "matthew@fsga.org",
    "mcote@fsga.org",
    "partner@visitflorida.org",
    "proteam@mopro.com",
    "rhaddow@fsga.org",
    "ryan@fsga.org",
    "secretary@floridakeyclub.org",
    "tracy@fsga.org",
    "treasurer@floridakeyclub.org"
  ],
  "nombre_sitio": "floridaclubgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitflorida.org/about-us/who-we-are/florida-council-of-tourism-leaders/member-biography/?q=M30O2DsGTczEdGPpvyjZlhUGCnGg9DmxCXtk19kfQ/W4EWIg+x3rYscKLXxIbahoUVSxcSBry3f39ZET8iOlrPA0Wz9a46CT",
      "text": "Member Biography Join Partner Portal FAQ Log In Username Password Remember Me Forgot Your Password? Log In Toggle navigation Home Programs Marketing Planner Content Promotions Ticket Bank Public Relations Signature Events Social Media Travel Trade Welcome Centers Resources Crisis Preparation Events Calendar Event Insurance Image Library Vendor Partners Education Upcoming Webinars Past Webinars Small Business Toolkit Accessible Florida Florida Adventure Travel Network Order Maps & Magazines Research Research FAQ Visitor Study Skift Reports & Events STR Reports Data Dashboard Work Together Become a Partner Submit a Proposal Speaker Request Ambassador Program Targeted Marketing Assistance About Us What We Do Strategic Plan Marketing Plan Annual Reports Tourism Impact Who We Are Board of Directors Florida Council of Tourism Leaders Committees Award Programs Flagler Awards Iris D. Larson Awards Florida Tourism Hall of Fame Meeting Notices Careers Media News Releases Public Records Member Biography You are here: Home About Us Who We Are Florida Council of Tourism Leaders Member Biography Walter Banks Title: President Organization: Lago Mar Beach Resort and Club Committee Position: Member Walter Banks is the owner of Lago Mar Resort and Club in Fort Lauderdale, FL. In 2003, he was named as Florida \"Hotelier of the Year\" and has also received the Excalibur Award which is the top business award in Broward County. Banks served as Chairman of the VISIT FLORIDA Board of Directors and Vice Chair of Florida Commission on Tourism. In December of 2011, he concluded his term on the Federal Board of Miami, a Branch of the Federal Reserve Bank of Atlanta. Contact us 101 North Monroe Street Suite 900 Tallahassee, Florida 32301 United States partner@VISITFLORIDA.org VISIT FLORIDA® is accredited by the Destination Marketing Accreditation Program (DMAP) of Destinations International. Audience Sites Visitors Meeting Planners Media Travel Professionals Copyright (2025) VISIT FLORIDA®. | Privacy Policy"
    },
    {
      "url": "https://floridakeyclub.org/",
      "text": "Florida District Key Club Skip to Content Caring – Our Way of Life Home About District Board Divisions Club Directory and District Map Kiwanis Family International Updates Calendar Publications Key’p Up! Key’P Up Blog Suggestions The Sunshine Source DCON 2026 Resources District Administration Club Resources Membership Development Keymmunity and Reports Club Officer Resources ICON 2025 Dues & Financial FLOF and YOF Florida Key Club Endowment Fund Scholarships Projects Governor’s Project Major Emphasis Keymmunity Looking for Something? 24-25 Florida Website Banners (4) 24-25 Florida Website Banners (1) DONE DONE (6) DONE (2) DONE (8) DONE (8) DONE Florida District Key Club The Florida District is made up of 42 divisions throughout Florida, the Cayman Islands, and the Turks and Caicos Islands. Serving the mighty, mighty 22,500+ members since 1939. In fact, Key Clubbers are part of a global network of clubs and members who partner with each other and with organizations whose missions aligns with ours. All around the world – and in communities like yours – Key Club International is showing that caring is our way of life. For more information, click HERE to read more a bout us. clubs members divisions year establish Join the Florida District of Key Club today! Make a difference, develop your heart to serve, grow as a leader, and connect with thousands of passionate students across all of Florida. As part of the world’s largest student-led service organization, you’ll have to join a community dedicated to service, make a tangible impact in your local and global communities, and develop the skills that will set you apart as a leader. Take action now and become part of something bigger! Explore our initiatives, connect with your local club, and become part of a legacy of service! Please find your club HERE ! Keymmunity, a vital aspect of the Florida District program, empowers District Executives and Lieutenant Governors to oversee monthly reports and communicate with clubs through the completion of Officer Information Forms (OIFs). Access is limited to club presidents, secretaries, and advisors. It ensures efficient and confidential communication channels while strengthening collaboration and accountability within the district, fostering a cohesive and effective leadership network. Keymmunity Total Service Hours: Governor Project Hours: Membership: New Clubs Chartered: Service Hours Service Hours Governor's Project Hours Governor's Project Hours Membership Membership New Clubs Chartered New Clubs Chartered Articles The Sunshine Source flkeyclub Serving the mighty, mighty 23,500+ members of Florida, the Cayman Islands, and Turks and Caicos since 1939.🗝 #BeTheKey Join us in supporting Erika’s Lighthouse Give Vo Monthly Office Hours are LIVE! Any Key Clubber can If you’re looking for a club where you can build Hi Key Clubbers! Since Monday was a holiday, here Thank you to @gaitherhskeyclub for participating i Check out the Key’p Up Blog on our website, a ne Join our Executive Committee on September 3rd wher Hello Key Clubbers and welcome back to another Mem Thank you to @alexish_2008  for running a successf Shout out to @patelhskeyclub for helping animals i At the end of July, our district board came togeth 🎟️ Step right up, Key Club members!\n\nThe grea The summer edition of The Sunshine Source is offic Thank you to C. Leon King High School for supporti Hello Key Clubbers! Watch our Division One Lieuten Load More Follow on Instagram Facebook Twitter Youtube Instagram Whatsapp For District updates, stay in the loop: Explore our official publications and follow us on social media! If you have any questions or concerns, please do not hesitate to contact us. District Governor: Eleanor Koh governoreleanor@floridakeyclub.org District Secretary: Andrea Cabrera-Elguezabal secretary@floridakeyclub.org District Treasurer: Claudia Viamonte treasurer@floridakeyclub.org District Editor: Chloe Russ editor@floridakeyclub.org Executive Assistant: Emil Ilyich executiveassistant@floridakeyclub.org Please check out our Florida Key Club blog as there are many new and exciting posts to read! Learn more from our district leaders and clubs! / Chic Lite | Developed By Rara Themes . Powered by WordPress . Home About Calendar Key’p Up DCON 2026 Resources Dues & Financial Projects Keymmunity"
    },
    {
      "url": "https://www.flclubhomes.com/contact-us",
      "text": "Contact Us | Florida Club Homes, LLC top of page About Florida Club Homes, PA About The Florida Club About The Homes Contact Us More Use tab to navigate through the menu items. Contact Us Florida Club Homes, PA Eileen Simons, On-site Realtor                   Office: +1(561) 200-5105 9014 Old Royal Drive                                        Cell: +1(772) 200.5105 Stuart, FL  34997 info@floridaclubrealty.com Florida Club Homes - 9014 SW Old Royal Drive, Stuart, FL  34997 Office: (561) 200-5105 Cell:(772)200-5105 email: flhomeforme@gmail.com All information is deemed reliable but is not guaranteed . bottom of page"
    },
    {
      "url": "https://www.fsga.org/home/contactus",
      "text": "Contact us - Florida State Golf Association - FSGA Processing your payment, please wait. Create an Account Post A Score Store About Us Log in Search X TOURNAMENTS TOURNAMENTS Men's Championships Home Schedule Tee Times & Info Results Policies Rankings Players of the Year Past Results Men's Interclub SW Series Women's Championships Home Schedule Tee Times & Info Results Policies Rankings Players of the Year Past Results One-Days Women's Interclub The LinkUp USGA Qualifying Home Schedule Tee Times & Info Results FAQs Enter One-Day Events Home Schedule Tee Times & Info Results Rankings About Southwest Amateur Series Armed Forces Appreciation Hickory Golf Member Travel Juniors - FJT Home Schedule Tee Times & Info Results Path to College Golf Policies Rankings Players of the Year Past Results Records About Youth on Course Winter Series Home Schedule Tee Times & Info Results Player Rankings Points Champions About - Men About - Women Quick Links: All Tournaments Withdraw All Tee Times MEMBERSHIP My Account Join the FSGA Buy/Renew a Handicap Online About the FSGA Member Benefits FSGA Club Membership HANDICAPS Buy/Renew a Handicap Online Post a Score Course Handicap Calculator World Handicap System™ FAQ's 2024 World Handicap System™ Hub 2024 Rules of Handicapping Manual Handicapping & The Rules of Golf Handicap Committee Guide Stroke Index Allocation 2025 WHS Seminar Slides Four Ball Match Play off the Low (2024) Handicap Review Tool - Phase 2 CLUBS Search Clubs Course Rating & Measurement Services FSGA Club Membership Remote Access Support JUNIORS Florida Junior Tour 9-12 Division Player Grants College Scholarships Find a Junior Program High School Golf Junior Golf Links Junior Coordinator Resources College Golf Team Florida Youth on Course VOLUNTEER Volunteer Central Want to Volunteer? Committee Assignments Rules Officials Certified Rules Officials Rules Training and Certification USGA Rules Certification Test Rules of Golf Archived Stories Fall Volunteer Appreciation Days Course Raters Board of Directors Volunteers of the Year Volunteer Policies SEMINARS Introduction to Volunteering Fall Volunteer Appreciation Days USGA Rules Certification Test Rules of Golf Workshops Rules & Officiating Workshops Rules of Golf Resources World Handicap System™ FOUNDATION Give a Gift Now Planned Giving Future of Golf Foundation College Scholarships Barry Masters Golf Foundation Player Grants Executives & Board Team Florida Past Presidents Hall of Fame Annual Awards Contact us - Florida State Golf Association Florida State Golf Association Main: (813) 632-3742 Championships & Rulings: (813) 868-5850 Club Services: (813) 868-5855 12630 Telecom Drive Tampa, FL 33637 Printable Directions Office Tour For Championships and Rulings: (813) 868-5850 For GHIN, Golf Genius and Course Rating: (813) 868-5855 For current job openings, please click here . Senior Executive Team Tournament Operations Club Services Admin & Communications Senior Executive Team Jeff Magaditsch Executive Director jeff@fsga.org (813) 868-5801 Darin Green Senior Director, Rules & Competitions dgreen@fsga.org (813) 868-5810 Aaron Skoviera Senior Director, Club Services aaron@fsga.org (813) 868-5802 Tournament Operations Kyle DiGiacobbe Director of Men's Golf kyled@fsga.org (813) 868-5809 Ryanne Haddow Director of Women's Golf rhaddow@fsga.org (813) 868-5808 Brian Nichol Director of Junior Golf brian@fsga.org (813) 868-5812 Ryan Mehnert Tournament Director, One-Days ryan@fsga.org (813) 868-5818 Matt Cote Tournament Manager mcote@fsga.org (813) 868-5825 Logan Finlay Tournament Manager logan@fsga.org (813) 868-5814 Madison Robertson Tournament Manager madison@fsga.org (813) 868-5807 CJ Hollister Tournament Director cj@fsga.org (813) 868-5806 Matthew Marquez Tournament Manager matthew@fsga.org (813) 868-5813 Jon Lumley Tournament Manager jon@fsga.org (813) 868-5815 Mackenzie Puryear Tournament Manager mackenzie@fsga.org (813) 868-5815 Ben Schwartz Tournament Manager ben@fsga.org (813) 868-5824 Jackie Twitty Tournament Manager jackie@fsga.org (813) 868-5820 Ben Yurigan Tournament Associate byurigan@fsga.org (813) 868-5815 Club Services Mark Boyko Club Services Manager mark@fsga.org (813) 868-5821 Duncan Chau Director of Course Rating dchau@fsga.org (813) 868-5804 Kevin Kasubinski Director of GHIN Services & IT kevin@fsga.org (813) 868-5803 Henry Kogan Club Services Associate henry@fsga.org (813) 868-5822 Joe Stein Southwest Regional Manager jstein@fsga.org (941) 270-4021 Aministration & Communications Tracy Dachisen Director of Volunteers tracy@fsga.org (813) 868-5816 Debby Lamontagne Controller debby@fsga.org (813) 868-5811 Lindsey Spatola Director of Communications lindsey@fsga.org (813) 868-5823 Emily Stoker Director of Tournament Administration emily@fsga.org (813) 868-5819 Preserving & Protecting the Game Since 1913 TOURNAMENTS MEMBERSHIP HANDICAPS CLUBS VOLUNTEER SEMINARS FOUNDATION ABOUT US Copyright © 2025 Florida State Golf Association. All rights reserved. Powered by nopCommerce"
    },
    {
      "url": "https://www.floridayouthclubofamerica.org/contact-us/",
      "text": "Contact - Florida Youth Club Skip to main content 5104 N Orange Blossom Trail Orlando, FL  32810 5104 N Orange Blossom Trail Orlando, FL  32810 Home About About Us Mentoring Programs SPONSOR A TEEN Our Events Community Service COMMUNITY SERVICE 1 COMMUNITY SERVICE COMMUNITY SERVICE 3 Online Contributions Comments Testimonies Special Thanks Contact Us Fundraising  Alert Notice More Home About About Us Mentoring Programs SPONSOR A TEEN Our Events Community Service COMMUNITY SERVICE 1 COMMUNITY SERVICE COMMUNITY SERVICE 3 Online Contributions Comments Testimonies Special Thanks Contact Us Fundraising  Alert Notice Location 5104 N Orange Blossom Trail Orlando, FL  32810 800-764-4420 BE A MEMBER facebook twitter CONTACT US Hours Of Operation We are available anytime, from 9am to 5pm. 800.764.4420 Ext. 1 Coach Johnny 407-209-9559 floridayouthclub@usa.com Contact Us Leave Your Contact Information Below Name Email Phone Subject Message Send Message Form submitted successfully. × Please provide the required field. × Name Email Subject Message Submit ORGANIZATION SPONSOR THIS SITE SERVICED & MAINTAINED BY THE DR. Americanproductions2016@gmail.co M 2025 FLORIDA YOUTH CLUB © 2025 back to top a mopro website"
    },
    {
      "url": "https://www.floridaclubgolf.com/golf/book-tee-time/",
      "text": "Book a Tee Time in Stuart, FL | The Florida Club Call us at: 772-287-3680 BOOK A TEE TIME Home Golf Golf Rates Book a Tee Time Lessons and Practice Rental Clubs Golf Shop Rain Policy Summer Membership Tuesday League Outings Outings Request Outing Information Dining E-Gift Certificates Employment Contact E-Club Login Book a Tee Time at the Florida Club REGULAR GUESTS Book a tee time Use the link below to book a tee time at the Florida Club. BOOK NOW E-CLUB MEMBERS Book a Tee Time Use the E-Club Member portal link below to book a tee time at the Florida Club. BOOK NOW Cancellation & No Show Policy Below please find our Cancellation & No Show Policy. It is important that you read the terms & conditions carefully before booking your tee time. Specials listed are available online only and cannot be combined with any other offer! CANCELLATION POLICY: If you do not cancel your reservation 24 hours prior to your tee time, your credit card will be charged the full amount due. Furthermore, if you make a tee time reservation “within” 24 hours of the date/time of play and need to cancel for any reason, your credit card will be charged in full for the tee time reserved. No Exceptions. To cancel your reservation, please email us providing your name, date and time of the reservation at info@floridaclubgolf.com . NO-SHOW POLICY: If you arrive on the date of play with less participants than you reserved, you will be charged in full for the incomplete party(s). No Exceptions.* INCLEMENT WEATHER: If the Florida Club is closed due to inclement weather the reservation will not be subscribed to any cancellation/no-show charges. Proper Golf Attire is appreciated and required when playing at our facility. We thank you for your cooperation on this matter *A No-Show is defined as either a partial and or total. BOOK A TEE TIME AT THE FLORIDA CLUB JOIN OUR E-CLUB FOR EXCLUSIVE RATES Follow Follow  Call Us 772-287-3680  Visit Us 9005 SW Old Royal Drive, Stuart, FL 34997  Review Us We're rated 4.6/5 on GolfAdvisor The Florida Club © 2025. All rights reserved. Site by Legendary Marketing ."
    },
    {
      "url": "https://www.theforumclub.org/contactus.php",
      "text": "Forum Club of Southwest Florida, Inc. Contact Us CONTACT US * = Required Fields Name: * Address: Email Address: * City: Phone: State: Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington, D.C. West Virginia Wisconsin Wyoming Fax: Zip: Questions / Comments: Forum Club of Southwest Florida, Inc. 3200 Bailey Lane, Suite 199 Naples, FL 34105 Phone: 239-436-3574 Email: forumclub@theforumclub.org Forum Club of Southwest Florida, Inc. 3200 Bailey Lane, Suite 199 Naples, FL 34105 Phone: 239-436-3574 Fax: 239-262-0750 Email: ForumClub@TheForumClub.org SITE DESIGN & PROGRAMMING\n  BY: EXPLORITECH, INC. © COPYRIGHT\n  ALL RIGHTS RESERVED"
    }
  ]
}