{
  "fuentes": [
    {
      "url": "https://www.floridaairshow.com/",
      "email": "media@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/volunteer",
      "email": "abbywhite@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/blog",
      "email": "denisedull@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/blog",
      "email": "media@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/pyye9skmv99ku9zkfxvht4opfysdjt",
      "email": "denisedull@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/pyye9skmv99ku9zkfxvht4opfysdjt",
      "email": "media@floridaairshow.com"
    },
    {
      "url": "https://selectflorida.org/why-florida/industries/aviation-aerospace/",
      "email": "harry.jorgensen@commerce.fl.gov"
    },
    {
      "url": "https://selectflorida.org/why-florida/industries/aviation-aerospace/",
      "email": "mario.aleksic@selectflorida.org"
    },
    {
      "url": "https://flysnf.org/",
      "email": "dkalahar@flysnf.org"
    },
    {
      "url": "https://www.stuartairshow.com/",
      "email": "info@stuartairshow.com"
    },
    {
      "url": "https://www.stuartairshow.com/",
      "email": "operations@stuartairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/florida-international-air-show-set-to-soar-november-12-2025-blue-angels-f-16-viper-demo-and-family-attractions-headline-usa-today-10best-air-show",
      "email": "denisedull@floridaairshow.com"
    },
    {
      "url": "https://www.floridaairshow.com/florida-international-air-show-set-to-soar-november-12-2025-blue-angels-f-16-viper-demo-and-family-attractions-headline-usa-today-10best-air-show",
      "email": "media@floridaairshow.com"
    },
    {
      "url": "https://nautique.com/contact/",
      "email": "careers@nautique.com"
    },
    {
      "url": "https://nautique.com/contact/",
      "email": "customer.care@nautique.com"
    },
    {
      "url": "https://nautique.com/contact/",
      "email": "info@nautique.com"
    },
    {
      "url": "https://nautique.com/contact/",
      "email": "marketing@nautique.com"
    },
    {
      "url": "https://nautique.com/contact/",
      "email": "sales@nautique.com"
    },
    {
      "url": "https://teamfim.com/contact-us/",
      "email": "sales@teamfim.com"
    },
    {
      "url": "https://airtoairinc.com/contact/",
      "email": "service@airtoairinc.com"
    }
  ],
  "mails": [
    "abbywhite@floridaairshow.com",
    "careers@nautique.com",
    "customer.care@nautique.com",
    "denisedull@floridaairshow.com",
    "dkalahar@flysnf.org",
    "harry.jorgensen@commerce.fl.gov",
    "info@nautique.com",
    "info@stuartairshow.com",
    "mario.aleksic@selectflorida.org",
    "marketing@nautique.com",
    "media@floridaairshow.com",
    "operations@stuartairshow.com",
    "sales@nautique.com",
    "sales@teamfim.com",
    "service@airtoairinc.com"
  ],
  "nombre_sitio": "floridaairshow.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floridaairshow.com/",
      "text": "Airshow Event | Florida International Airshow | Florida ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT 2025 Florida International Airshow: November 1 & 2, 2025 ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT Buy Tickets Rent Chairs Buy Tickets Rent Chairs 2025 Florida International Airshow November 1 & 2, 2025 \" We’re incredibly proud to announce our finish in the USA TODAY 10Best Airshows Readers' Choice Awards. It’s a testament to the passion of our volunteers, the excitement of our performers, and the unwavering support from this amazing community.\" - Denise Dull, President, Florida International Airshow Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Video by Ric Peterson Button Button Button Button Button Button Button Button View more “We have not experienced the overall hospitality, at other air shows, as we received from the Florida International Air Show organizers and fans” Master Sgt. Brandon Baden, F-16 Viper Demo Maintenance Team Lead, USAF. Shaw AFB. MISSION To deliver a wholesome family entertainment event celebrating aviation past, present, and inspiring the future. VISION An unlimited passion for aviation and space drives FIAS to provide exciting military and civilian performances and displays for audiences of all ages. IMPACT The Florida International Air Show (FIAS) organization is a Florida 501c4 nonprofit corporation staffed entirely by volunteers. The air show is a multi-day event showcasing nationally known performers and exciting static displays of aircraft and vehicles. The air shows offer opportunities for attendees to learn more about aviation, space, and military services. READ MORE Warbird Thunder to Appear at the Florida International Air Show, November 1-2, 2025 September 8, 2025 Punta Gorda, FL —                                               The Florida International Air Show is thrilled to welcome                                              Warbird Thunder                                               to its 2025 lineup, scheduled for                                              November 1–2                                               at the Punta Gorda Airport. This marks an electrifying return of the North American SNJ Texan — also known as “Ol Growler” — to Southwest Florida’s skies.                                                                                                 Warbird Thunder promises an awe-inspiring aerial performance, featuring two SNJ Texans soaring in formation with their signature roar, smoke trails, and engaging aerobatic maneuvers like formation loops, aileron rolls, barrel rolls, and Cuban Eights. The show concludes with stunning opposing aerobatics as the planes separate and then reunite for a dramatic finale.                                                                                                  “Warbird Thunder brings a unique mix of history, heritage, and heart-stopping aerobatics,” said                                              Denise Dull, President of the Florida International Air Show                                  . “When those Texans thunder overhead, it’s not just entertainment — it’s a living tribute to the aviators who paved the way for modern flight. We are honored to share that experience with our community.”                                                                                     Highlights of the 2025 Florida International Air Show include:                                                                                 Dynamic performances by the                                                  U.S. Navy Blue Angels                                                   and the                                                  F-16 Viper Demo Team                                                                         A versatile roster of acts, including                                                  Aarron Deliu                                                   ,                                                  Doug Litton                                                   , and                                                  The Chuters                                                   Jump Team                                                                                      Exciting new experiences like the                                                  Innovators STEM Pavilion                                                   and the                                                  Family Aviation Experience                                     , both designed to engage and inspire audiences of all ages.                                                                                                              Tickets On Sale Now:                                              floridaairshow.com                                                                                                  For media inquiries, sponsorship opportunities, or vendor information, contact                                              media@floridaairshow.com                                               or call                                              941-626-0551                                  .                                                                                     Don’t miss the power, prestige, and family fun of this award-winning event. Join us for a weekend where aviation’s past, present, and future take flight! The Chuters Jump Team to appear at the 2025 Florida International Air Show, Punta Gorda Airport November 1 & 2, 2025 August 29, 2025 PUNTA GORDA, FL —                                               With precision, courage, and patriotic pride, The Chuters Jump Team will thrill thousands of spectators as they soar into Punta Gorda Airport for the Opening Ceremonies of the Florida International Air Show, November 1st and 2nd, 2025.                                                                                                 The Chuters Jump Team is a professional parachute demonstration team, veteran-owned and operated, known for their breathtaking aerial jumps and flawless timing. Their performance will include a dramatic descent carrying the American flag, set against the backdrop of the National Anthem — a moment designed to inspire goosebumps and unite the crowd.                                                                                     “Nothing compares to the silence before the jump and the roar of the crowd when we touch down,” said Keith Walter, Director of Operations and has completed over 6000 jumps. “Being able to open such an incredible event with the American flag is an honor we never take lightly. It’s about celebrating freedom, service, and the thrill of flight.”                                                                                     Organizers say The Chuters set the perfect tone for a weekend filled with world-class aviation.                                                      “The Opening Ceremonies are always a special part of the show, and this year we’re taking it to the next level,” said Denise Dull, President, Florida International Air Show. “When The Chuters come streaming out of the sky, you feel the energy of the entire crowd shift. It’s patriotic. It’s powerful. And it reminds us why we gather to celebrate aviation, service, and community.”                                                                                     The Florida International Air Show has been a tradition in Charlotte County for more than three decades, drawing families, veterans, and aviation enthusiasts from across the United States. This year’s lineup features the U.S. Navy Blue Angels as headliners, along with the Viper F-16 Demo Team, thrilling aerobatic acts, military aircraft demonstrations, and static displays. Food vendors, kids’ activities, and community exhibits will round out a weekend of high-flying fun.                                                                                     “This isn’t just a show — it’s an experience,” added Steve Lineberry, Media and Publicity Director                                  .                                    “The Chuters remind us that aviation is as much about people as it is about planes. Their performance embodies courage, teamwork, and a sense of pride that resonates with everyone in attendance.                                                                                     Event Details:                                              Dates: Saturday, November 1st & Sunday, November 2nd, 2025                        Location: Punta Gorda Airport, Punta Gorda, Florida                        Tickets: On sale now at www.floridaairshow.com Florida International Air Show Set to Soar November 1–2, 2025 Blue Angels, F-16 Viper Demo, and Family Attractions Headline USA TODAY 10BEST Air Show May 9, 2025 Punta Gorda, FL — May 7, 2025                                               — The skies over Southwest Florida will roar to life this fall as the                                              Florida International Air Show                                               returns to                                              Punta Gorda Airport on November 1–2, 2025                                               , with an exhilarating lineup headlined by the                                              U.S. Navy Blue Angels                                               and the                                              F-16 Viper Demo Team                                  .                                                                   This year’s show features a dynamic mix of aerial precision, vintage power, and heart-pounding stunts with performers including                                              Warbird Thunder                                               ,                                              Aarron Deliu                                               ,                                              Doug Litton                                               , and the thrilling parachute team                                              The Chuters                                  .                                                                                                  New for 2025, the Air Show proudly introduces two                                              family-friendly attractions                                  :                                                                   The                                              Innovators STEM Pavilion                                               – a hands-on zone to engage students and families with science, tech, and aviation.                                                                                                              The                                              Family Aviation Experience                                               – a fun, interactive area designed to inspire future aviators and entertain all ages.                                                                                                              Voted a                                              USA TODAY 10BEST Air Show in America for the second consecutive year                                  , this world-class event continues to attract aviation fans, families, and thrill-seekers from across the country.                                                      Tickets go on sale to the public at noon on May 23, 2025                                               . For performer updates, and opportunities to                                              sponsor                                               ,                                              vend                                               , or                                              exhibit                                  , visit www.floridaairshow.com or follow us on social media @florida_air_show.                                                                                     Don’t miss this high-flying celebration of aviation, innovation, and family fun!                                                      Media Contact:                                              Steve Lineberry                        941-626-0551                        media@floridaairshow.com                        Florida International Air Show                        www.floridaairshow.com SEE MORE NEWS PODCAST Stay in the Know with the Florida Air Show Sign up to receive the latest updates from The Florida International Air Show. Get exclusive offers & discounts and gain access to Air Show performer announcements & features – BEFORE they go public. Contact Us First Name Last Name Email Address Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. We respect your privacy. FRIENDS OF THE AIR SHOW Buy Tickets Florida International Air Show Hot Line 1.833.PGD-FIAS 1.833.743.3427 SPONSORS VOLUNTEER TEAM CONTACT The Florida International Air Show is a proud member of the ICAS International Council of Air Shows The Florida International Air Show is a proud member of the SECAS Southeast Council of Air Shows Charlotte County Chamber of Commerce Charlotte County, Florida Copyright © 2025 Florida International Air Show Website by: The Firm Advertising Agency Share by:"
    },
    {
      "url": "https://www.floridaairshow.com/volunteer",
      "text": "Volunteer Sign-Up | Florida ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT 2025 Florida International Airshow: November 1 & 2, 2025 ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT Buy Tickets Rent Chairs VOLUNTEER 2025 Volunteer Sign Up is NOW OPEN! Apply Now! Deadline for Volunteer Sign-Up is October. We appreciate your interest in working with us during the 2025 FIAS Air Show. This year for volunteer signup we are using an online program called VolunteerLocal for onboarding volunteers and assigning jobs. In this program Volunteer jobs and shifts will be available to choose closer to the Air Show. If you have any trouble navigating the website or finding the jobs you’d like to apply for, please contact the Director of Volunteers, Abby White abbywhite@floridaairshow.com Stay in the Loop, Volunteers & Future Volunteers! Want the latest updates on volunteer opportunities, event details, and behind-the-scenes action? Sign up for our Volunteer Newsletter and be the first to know how you can get involved. * indicates required Email Address * First Name Last Name Meet the Director of Volunteers Abigail White My name is Abigail “Abby” White. I was born and raised in Southwest Florida, growing up with a love for everything outdoors and adventurous. I’ve recently joined the wonderful world of aviation, getting my start with hobby drone flying. This encouraged me to pursue and earn my Part 107 commercial drone license in 2021. This opened a whole new world of opportunity for me. I have since become a private pilot, earning my license right before last year’s air show in November of 2023. I am also a member of our local 99s Women Pilots chapter. I plan on continuing my journey in aviation and making it my career in the future. 2023 was my first year involved with the Air Show, serving as Assistant Director of Volunteers alongside my flight instructor, mentor, and the previous Director of Volunteers Connie Hite. I had an incredible time seeing the show come together and being a part of its production. As Connie moves into another Director role, I am incredibly honored to take over as Director of Volunteers this year. I am looking forward to leading our volunteers through another fun and exciting air show! Feel free to contact me with any questions or concerns you have about volunteering for the 2024 Florida International Air Show! For questions, contact abbywhite@floridaairshow.com Newsletter Learn more about volunteering with FIAS Meet the Team - Vol 1 Button Women in Aviation - Vol 2 Button History of Volunteering - Vol 3 Button Reasons to Volunteer - Vol 4 Button Final Call - Vol 5 Button Stay in the know - Subscribe to the FIAS newsletter SUBSCRIBE Buy Tickets Florida International Air Show Hot Line 1.833.PGD-FIAS 1.833.743.3427 SPONSORS VOLUNTEER TEAM CONTACT The Florida International Air Show is a proud member of the ICAS International Council of Air Shows The Florida International Air Show is a proud member of the SECAS Southeast Council of Air Shows Charlotte County Chamber of Commerce Charlotte County, Florida Copyright © 2025 Florida International Air Show Website by: The Firm Advertising Agency Share by:"
    },
    {
      "url": "https://www.floridaairshow.com/blog",
      "text": "Airshow Updates | Florida ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT 2025 Florida International Airshow: November 1 & 2, 2025 ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT Buy Tickets Rent Chairs NEWS Warbird Thunder to Appear at the Florida International Air Show, November 1-2, 2025 September 8, 2025 Punta Gorda, FL —                                               The Florida International Air Show is thrilled to welcome                                              Warbird Thunder                                               to its 2025 lineup, scheduled for                                              November 1–2                                               at the Punta Gorda Airport. This marks an electrifying return of the North American SNJ Texan — also known as “Ol Growler” — to Southwest Florida’s skies.                                                                                                 Warbird Thunder promises an awe-inspiring aerial performance, featuring two SNJ Texans soaring in formation with their signature roar, smoke trails, and engaging aerobatic maneuvers like formation loops, aileron rolls, barrel rolls, and Cuban Eights. The show concludes with stunning opposing aerobatics as the planes separate and then reunite for a dramatic finale.                                                                                                  “Warbird Thunder brings a unique mix of history, heritage, and heart-stopping aerobatics,” said                                              Denise Dull, President of the Florida International Air Show                                  . “When those Texans thunder overhead, it’s not just entertainment — it’s a living tribute to the aviators who paved the way for modern flight. We are honored to share that experience with our community.”                                                                                     Highlights of the 2025 Florida International Air Show include:                                                                                 Dynamic performances by the                                                  U.S. Navy Blue Angels                                                   and the                                                  F-16 Viper Demo Team                                                                         A versatile roster of acts, including                                                  Aarron Deliu                                                   ,                                                  Doug Litton                                                   , and                                                  The Chuters                                                   Jump Team                                                                                      Exciting new experiences like the                                                  Innovators STEM Pavilion                                                   and the                                                  Family Aviation Experience                                     , both designed to engage and inspire audiences of all ages.                                                                                                              Tickets On Sale Now:                                              floridaairshow.com                                                                                                  For media inquiries, sponsorship opportunities, or vendor information, contact                                              media@floridaairshow.com                                               or call                                              941-626-0551                                  .                                                                                     Don’t miss the power, prestige, and family fun of this award-winning event. Join us for a weekend where aviation’s past, present, and future take flight! The Chuters Jump Team to appear at the 2025 Florida International Air Show, Punta Gorda Airport November 1 & 2, 2025 August 29, 2025 PUNTA GORDA, FL —                                               With precision, courage, and patriotic pride, The Chuters Jump Team will thrill thousands of spectators as they soar into Punta Gorda Airport for the Opening Ceremonies of the Florida International Air Show, November 1st and 2nd, 2025.                                                                                                 The Chuters Jump Team is a professional parachute demonstration team, veteran-owned and operated, known for their breathtaking aerial jumps and flawless timing. Their performance will include a dramatic descent carrying the American flag, set against the backdrop of the National Anthem — a moment designed to inspire goosebumps and unite the crowd.                                                                                     “Nothing compares to the silence before the jump and the roar of the crowd when we touch down,” said Keith Walter, Director of Operations and has completed over 6000 jumps. “Being able to open such an incredible event with the American flag is an honor we never take lightly. It’s about celebrating freedom, service, and the thrill of flight.”                                                                                     Organizers say The Chuters set the perfect tone for a weekend filled with world-class aviation.                                                      “The Opening Ceremonies are always a special part of the show, and this year we’re taking it to the next level,” said Denise Dull, President, Florida International Air Show. “When The Chuters come streaming out of the sky, you feel the energy of the entire crowd shift. It’s patriotic. It’s powerful. And it reminds us why we gather to celebrate aviation, service, and community.”                                                                                     The Florida International Air Show has been a tradition in Charlotte County for more than three decades, drawing families, veterans, and aviation enthusiasts from across the United States. This year’s lineup features the U.S. Navy Blue Angels as headliners, along with the Viper F-16 Demo Team, thrilling aerobatic acts, military aircraft demonstrations, and static displays. Food vendors, kids’ activities, and community exhibits will round out a weekend of high-flying fun.                                                                                     “This isn’t just a show — it’s an experience,” added Steve Lineberry, Media and Publicity Director                                  .                                    “The Chuters remind us that aviation is as much about people as it is about planes. Their performance embodies courage, teamwork, and a sense of pride that resonates with everyone in attendance.                                                                                     Event Details:                                              Dates: Saturday, November 1st & Sunday, November 2nd, 2025                        Location: Punta Gorda Airport, Punta Gorda, Florida                        Tickets: On sale now at www.floridaairshow.com Florida International Air Show Set to Soar November 1–2, 2025 Blue Angels, F-16 Viper Demo, and Family Attractions Headline USA TODAY 10BEST Air Show May 9, 2025 Punta Gorda, FL — May 7, 2025                                               — The skies over Southwest Florida will roar to life this fall as the                                              Florida International Air Show                                               returns to                                              Punta Gorda Airport on November 1–2, 2025                                               , with an exhilarating lineup headlined by the                                              U.S. Navy Blue Angels                                               and the                                              F-16 Viper Demo Team                                  .                                                                   This year’s show features a dynamic mix of aerial precision, vintage power, and heart-pounding stunts with performers including                                              Warbird Thunder                                               ,                                              Aarron Deliu                                               ,                                              Doug Litton                                               , and the thrilling parachute team                                              The Chuters                                  .                                                                                                  New for 2025, the Air Show proudly introduces two                                              family-friendly attractions                                  :                                                                   The                                              Innovators STEM Pavilion                                               – a hands-on zone to engage students and families with science, tech, and aviation.                                                                                                              The                                              Family Aviation Experience                                               – a fun, interactive area designed to inspire future aviators and entertain all ages.                                                                                                              Voted a                                              USA TODAY 10BEST Air Show in America for the second consecutive year                                  , this world-class event continues to attract aviation fans, families, and thrill-seekers from across the country.                                                      Tickets go on sale to the public at noon on May 23, 2025                                               . For performer updates, and opportunities to                                              sponsor                                               ,                                              vend                                               , or                                              exhibit                                  , visit www.floridaairshow.com or follow us on social media @florida_air_show.                                                                                     Don’t miss this high-flying celebration of aviation, innovation, and family fun!                                                      Media Contact:                                              Steve Lineberry                        941-626-0551                        media@floridaairshow.com                        Florida International Air Show                        www.floridaairshow.com Reaching New Heights: Florida International Air Show and conCHAIRto Team Up May 9, 2025 Cleveland, OH – May 2025 – conCHAIRto, the premier provider of premium seating solutions for outdoor music festivals and live events, is pleased to announce a new partnership with the Florida International Air Show (FIAS), scheduled for November 1-2, 2025 in Punta Gorda, Florida.                                                                                                            As a valued partner for this event, conCHAIRto will provide comfortable, convenient and sustainable seating solutions that will allow spectators to comfortably experience the speed, sound and scale that only these aircraft can provide. The schedule includes exciting military and civilian performances and displays for audiences of all ages.                                                                                                            “As we expand our business reach into air show events,\" said Brett Smiley, President and Founder of conCHAIRto. \"I cannot think of a better partner than the Florida International Air Show. They have been exciting audiences for over 43 years and are rated one of the top 10 air show events in the world. We are here to elevate that experience even more.”                                                                                                            The disruptions caused by Hurricanes Milton and Helene forced the cancellation of the 2024 event, the first in its 43-year history. The Florida International Air Show has come back with a bang…or is that a sonic boom? Beginning as a brief single-day event with only a few acts, the show has grown into a multi-day event with family and fan-friendly activities, a large variety of acts, interactive displays and much more. The Punta Gorda Airport plays an integral role in the Air Show’s history — it has hosted the event since its inception.                                                                                                            \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community,\" Denise Dull, President of the Air Show.                                                                                                            Tickets for the 2025 Florida International Air Show go on sale on May 23. For more information and to purchase tickets, visit their official website.                                                                                                            About conCHAIRto:                                                      conCHAIRto is a premier provider of high-quality seating solutions, dedicated to enhancing comfort and style for various events and venues. With a focus on innovative design and exceptional craftsmanship, conCHAIRto delivers products that meet the highest standards of excellence.                                                                                                            For more information about conCHAIRto and its range of premium seating solutions, please visit conCHAIRto.com or email us at info@conchairto.com. 2024 FIAS Canceled Due to Hurricanes Milton and Helene October 14, 2024 Air Show Canceled Due to Hurricanes Milton and Helene                                                      [Punta Gorda, FL] –  In light of the significant impacts of Hurricane Milton and Hurricane Helene on the community, organizers have made the difficult decision to cancel the 43rd Annual Florida International Air Show. The dual hurricanes have caused widespread damage and disruption across the region, making it impractical to proceed with the event.                                                                                     \"Our community is facing tremendous challenges as we recover from the destruction caused by these two powerful storms,\" said Denise Dull, President of the Air Show. \"The safety of our attendees, vendors, and volunteers is our highest priority, and at this time, it is clear that the best course of action is to focus on supporting our community’s recovery efforts.\"                                                                                     Both hurricanes have resulted in extensive damage to homes, businesses, and essential infrastructure, with many residents still experiencing the impact of these events. As the region continues its recovery efforts, event organizers believe the community’s attention and resources are best directed toward rebuilding and aiding those affected by the storms.                                                                                     While the Air Show is an annual tradition that brings joy and excitement to the area, the decision to cancel was made out of an abundance of caution and care for the community’s well-being. Organizers are committed to bringing the event back stronger once recovery efforts are complete and the community is ready to come together in celebration.                                                                                     \"We are incredibly grateful to our sponsors, volunteers, and vendors who have worked tirelessly in preparation for this year’s event. Our community partners, PGD, Charlotte County Sheriff, Fire & EMS, are all committed to the safety of Charlotte County and its residents and we would not want to do anything that would create a larger burden on their workload during post hurricane rebuild,\" added Dull. \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community.\" Tickets will be refundable or may be exchanged for the 2025 Air Show. *Note the lower ticket price will be honored as we expect ticket prices will increase.                                                                                     For more information on how to assist in relief efforts, please visit www.coadfl.org                                                                                                  About The Florida International Air Show                                                                  The Florida International Air Show’s mission is to deliver a wholesome family entertainment event celebrating aviation past, present, and inspiring its future.                                                                                                  ﻿                        For further information or media inquiries, please contact: Steve Lineberry 941-626-0551 media@floridaairshow.com Experience the thrill of aviation at our award-winning event! October 14, 2024 The Florida International Air Show - This is One Air Show You Do Not Want to Miss! October 1, 2024 Southeast Tourism Society Selects Florida International AirShow  as a  “Signature Event of the Southeast” Award Winner August 12, 2024 PUNTA GORDA, FL. (August 14, 2024) –  Southeast Tourism Society (STS) has named the Florida International Airshow one of the Signature Events of the Southeast for 2024.                                                                                     This year’s Florida International AirShow is November 2-3. 2024 held in Punta Gorda, FL. Signature Events of the Southeast, formerly known as “Top 20 Festival and Event Awards”, was launched as part of the 40th Anniversary celebration of Southeast Tourism Society in 2023. STS has recognized events and festivals around the Southeast since 1985.                                                                                     Travel industry experts select top events to be highlighted for the year, and STS publicizes them throughout the United States. The complete list is published on both the Travel Media Press Room and Escape to the Southeast® websites and recognized on all Southeast Tourism Society’s social media platforms.                                                                                     The AirShow will celebrate its 43rd year of presenting exciting entertainment to residents and visitors of Charlotte County on the grounds of the Punta Gorda Airport. Beginning as a single day event, the show has grown to a three day event with fan-friendly activities, a large variety of acts, interactive displays, and much more. “If you’ve not been to an AirShow before, it’s like taking Nascar, pizza, baseball, hotdogs, fireworks, football and Lynyrd Skynyrd and rolling it all into one giant rodeo “says Denise Dull, President of the Florida International AirShow. “There’s something for everyone in the family.” The Florida International Airshow also received a USA TODAY 10Best Readers Choice Award this year for their November 2023 AirShow, which featured the USAF Thunderbirds and was a record attendance year.                                                                                     “For more than 40 years, STS has been spotlighting the best festivals and events in the Southeast. Our goal is to highlight the efforts of devoted event organizers and provide additional media exposure and accolades for their events,” said Monica Smith, President and CEO of Southeast Tourism Society. “The Southeast offers so many unique, year-round, opportunities for tourists and festival goers to create memories and support the tourism industry-–a vital economic generator for communities.”                                                                                     Events considered for the STS Signature Events of the Southeast recognition must be at least three years old and have an attendance of at least 1,000. Nominations open in early spring. Members and non-members are eligible to apply. Winning submissions are automatically judged in the Festival or Event of the Year category for STS’s Shining Example Awards.                                                                                     About Southeast Tourism Society                                                                   The Southeast Tourism Society (STS) is a not-for-profit membership association dedicated to the development of travel and tourism professionals and organizations within the southeast region. The association’s mission is to empower a diverse network of tourism professionals through Education, Advocacy, Recognition, and Networking. Member states include Alabama, Arkansas, Florida, Georgia, Kentucky, Louisiana, Mississippi, Missouri, North Carolina, South Carolina, Tennessee, Virginia, and West Virginia, plus the District of Columbia.                                                                                                              About Florida International Air Show                                                                               The Florida International AirShow is a Florida 501(c) 4 nonprofit organization staffed entirely by volunteers. The Airshow is a multi day event showcasing nationally known performers and exciting static displays of aircraft and vehicles. The Airshow offers attendees the opportunity to learn more about aviation, space, and military service. FIAS events provide beneficial exposure to the community and Punta Gorda Airport as a significant economic asset has donated over $3.6 million in contributions to local Southwest charities since its inception. For more information visit www.floridaairshow.com                                                                                                              Florida International AirShow                                                                               Denise Dull, President                                                                               941-626-9439                                                                               denisedull@floridaairshow.com                                                                  www.floridaairshow.com Air show expected to bring millions in revenue to Charlotte County July 2, 2024 BY NANCY SEMON                                   | JULY 2, 2024 | PHOTO CREDIT:FLORIDA INTERNATIONAL AIR SHOW Patrick Fuller: Hometown Hero Takes to the Skies By UBU BRANDS • November 10, 2023 Meet Patrick Fuller, Punta Gorda's Emergency Management Director, who recently found himself soaring through the clouds with the United States Air Force Thunderbirds, marking a high-flying chapter in his illustrious career.  Having dedicated four years to the Marine Corps and an additional twenty ye Buy Tickets Florida International Air Show Hot Line 1.833.PGD-FIAS 1.833.743.3427 SPONSORS VOLUNTEER TEAM CONTACT The Florida International Air Show is a proud member of the ICAS International Council of Air Shows The Florida International Air Show is a proud member of the SECAS Southeast Council of Air Shows Charlotte County Chamber of Commerce Charlotte County, Florida Copyright © 2025 Florida International Air Show Website by: The Firm Advertising Agency Share by:"
    },
    {
      "url": "https://www.floridaairshow.com/pyye9skmv99ku9zkfxvht4opfysdjt",
      "text": "The Florida International AIr Show is Only Days Away. Here are details! — Florida International Air Show ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT 2025 Florida International Airshow: November 1 & 2, 2025 ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT Buy Tickets Rent Chairs UBU BRANDS • October 24, 2023 Important Event Details! FIAS 2023 The Florida International Air Show, November 4th & 5th, Punta Gorda FL Airport, (PGD) Florida International Air Show November 4th & 5th, 2023 Punta Gorda FL Airport - PGD Tickets On Sale Now: http://www.floridaairshow.com Air Show Hotline: Monday - Friday 9am-5pm 1.833.743.3427 The 2023 Florida International Air Show is only weeks away.  And we will be sending updates about all things 2023 FIAS AIr Show. Parking information, Schedule of Events and More!  Information that will make your 2023 FIAS Air Show Experience, Fun and Enjoyable. In This Newsletter: *Matt Younkin & Twin Beech 18 Added to the Performer's Lineup *Air Show Fun Family Video *Thursday Night November 2nd \"The Tiki Bar\" at Four Points by Sheraton Free Kick-Off Concert - \"Maverick & Goose\" Look a Like Contest; VIP SWAG BAG Raffle Giveaway - $800.00 value. The Drem Big F-18 Hornet Saturday Night, November 4th, 7pm Fishermen's Village \"Meet & Greet\"  The USAF Thunderbirds & 2023 FIAS Performers In the Next FIAS Newsletter Issue: Performer's Lineup Parking Directions What to Expect at the Main Gate Frequently Asked Questions FIAS Spotify Podcast And More! Matt Youkin added to the 2023 Performing Line-Up Matt Younkin is a third generation pilot. He is the son of legendary airshow pilot Bobby Younkin, who is famous for his amazing aerobatic displays in the AT-6, Beech 18, Learjet 23, Samson, and most recently, the Super Decathlon. Bobby is considered to be one of the greatest airshow pilots of all time. Matt is also the grandson of Jim Younkin who is well-known for designing the Century and Trutrak autopilots. Jim is also famous for his antique aircraft restorations, as well as building beautiful replicas of the 1930’s air racers such as the Howard “Mr. Mulligan” and the Travel Air “Mystery Ship.” Matt learned to fly at the age of 14 from family friend Ken Collier in a Piper J-3 Cub. At age 15, Chuck Irvin, the same instructor who taught Bobby how to fly, refined Matt’s piloting skills. On his sixteenth birthday, Matt soloed his grandfather’s 1928 Travel Air 4000 biplane. ﻿ Matt is now proficient in over 85 types of airplanes ranging from the Piper Cub to the Boeing B-29. He is also a fully rated flight instructor and now has almost 5,000 hours of total flying time and currently resides in Siloam Springs, AR. A CELEBRATION OF AIR SHOWS SEE VIDEO The 2023 Florida International Air Show Kicks Off with a FREE Concert at \"The Tiki Bar\" at the Four Points by Sheraton - Harborside, 5:30pm Thursday, November 2nd, 2023! Local Entertainment to be Announced. Order From the Menu. Your Chance to Win Air Show VIP Package! 2023 FIAS VIP Swag Bag Raffle - $800.00 Value!! 4 VIP Tickets - Complimentary Food and Drink in the VIP Tent; VIP Tent Seating on the Flightline; 4 FIAS Fishing Shirts; 4 FIAS Hats; 4 2023 FIAS Color Changing Tumblers! Drawing at 7pm. You Do Not Have To Be Present to Win. Don't Miss the Dream Big F-18 Hornet on Thursday Night at The Tiki Bar Button Button “HAVE YOU EVER WANTED TO BE A FIGHTER PILOT? EVER WONDERED WHAT IT’S LIKE TO CLIMB INSIDE A REAL FIGHTER JET?” Dewey Larson, Brings you the DreamBIG “F/A-18 Hornet (Topgun Maverick) Experience.” This TopGun F/A-18 is a REAL and Historical United States Navy Veteran. It actually Flew Combat Missions and was even part of the famed “Blue Angels”. Stop by for your Opportunity to hear Her Story, Touch History and create a Moment that will last a Lifetime. DreamBIG allows Visitors to Dress the Part and actually put on a Flight Helmet (from the Maverick Movie) and step inside the Cockpit. Dewey and the Crew will give you a brief tour, take your Picture, and then print it out in moments. Come hear the History and receive a Memory that will Last a lifetime. Come DREAMBIG, TOPGUN STYLE!!! \"Maverick & Goose\" Look Alike Contest - FIAS Swag Bag includes 2 General Admission Tickets for Each Winner. \"Meet the USAF Thunderbirds & 2013 FIAS Performers\" at the Fishermen's Village Center Court,  Punta Gorda FIAS Air Show \"Meet & Greet\" Saturday Night, 7pm.  Kids - \"Bring Your Earn Wings Certificate for an Autograph.\" Pick Up a FREE FIAS Coloring Book. Official 2023 FIAS Air Show Programs will be Available for Purchase.  Part of the Festivities of the 2023 Florida International Air Show. Thanks \"TROPICAL SMOOTHIE\" Presenting Sponsor for the 2023 FIAS Air Show. Thanks \"PUNTA GORDA AIRPORT\" Presenting Sponsor for the 2023 FIAS Air Show. ﻿ Thanks \"Florida Power & Light - FPL\" Presenting Sponsor for the 2023 FIAS Air Show. ﻿ < Older Post Newer Post > Warbird Thunder to Appear at the Florida International Air Show, November 1-2, 2025 September 8, 2025 Punta Gorda, FL —                                               The Florida International Air Show is thrilled to welcome                                              Warbird Thunder                                               to its 2025 lineup, scheduled for                                              November 1–2                                               at the Punta Gorda Airport. This marks an electrifying return of the North American SNJ Texan — also known as “Ol Growler” — to Southwest Florida’s skies.                                                                                                 Warbird Thunder promises an awe-inspiring aerial performance, featuring two SNJ Texans soaring in formation with their signature roar, smoke trails, and engaging aerobatic maneuvers like formation loops, aileron rolls, barrel rolls, and Cuban Eights. The show concludes with stunning opposing aerobatics as the planes separate and then reunite for a dramatic finale.                                                                                                  “Warbird Thunder brings a unique mix of history, heritage, and heart-stopping aerobatics,” said                                              Denise Dull, President of the Florida International Air Show                                  . “When those Texans thunder overhead, it’s not just entertainment — it’s a living tribute to the aviators who paved the way for modern flight. We are honored to share that experience with our community.”                                                                                     Highlights of the 2025 Florida International Air Show include:                                                                                 Dynamic performances by the                                                  U.S. Navy Blue Angels                                                   and the                                                  F-16 Viper Demo Team                                                                         A versatile roster of acts, including                                                  Aarron Deliu                                                   ,                                                  Doug Litton                                                   , and                                                  The Chuters                                                   Jump Team                                                                                      Exciting new experiences like the                                                  Innovators STEM Pavilion                                                   and the                                                  Family Aviation Experience                                     , both designed to engage and inspire audiences of all ages.                                                                                                              Tickets On Sale Now:                                              floridaairshow.com                                                                                                  For media inquiries, sponsorship opportunities, or vendor information, contact                                              media@floridaairshow.com                                               or call                                              941-626-0551                                  .                                                                                     Don’t miss the power, prestige, and family fun of this award-winning event. Join us for a weekend where aviation’s past, present, and future take flight! The Chuters Jump Team to appear at the 2025 Florida International Air Show, Punta Gorda Airport November 1 & 2, 2025 August 29, 2025 PUNTA GORDA, FL —                                               With precision, courage, and patriotic pride, The Chuters Jump Team will thrill thousands of spectators as they soar into Punta Gorda Airport for the Opening Ceremonies of the Florida International Air Show, November 1st and 2nd, 2025.                                                                                                 The Chuters Jump Team is a professional parachute demonstration team, veteran-owned and operated, known for their breathtaking aerial jumps and flawless timing. Their performance will include a dramatic descent carrying the American flag, set against the backdrop of the National Anthem — a moment designed to inspire goosebumps and unite the crowd.                                                                                     “Nothing compares to the silence before the jump and the roar of the crowd when we touch down,” said Keith Walter, Director of Operations and has completed over 6000 jumps. “Being able to open such an incredible event with the American flag is an honor we never take lightly. It’s about celebrating freedom, service, and the thrill of flight.”                                                                                     Organizers say The Chuters set the perfect tone for a weekend filled with world-class aviation.                                                      “The Opening Ceremonies are always a special part of the show, and this year we’re taking it to the next level,” said Denise Dull, President, Florida International Air Show. “When The Chuters come streaming out of the sky, you feel the energy of the entire crowd shift. It’s patriotic. It’s powerful. And it reminds us why we gather to celebrate aviation, service, and community.”                                                                                     The Florida International Air Show has been a tradition in Charlotte County for more than three decades, drawing families, veterans, and aviation enthusiasts from across the United States. This year’s lineup features the U.S. Navy Blue Angels as headliners, along with the Viper F-16 Demo Team, thrilling aerobatic acts, military aircraft demonstrations, and static displays. Food vendors, kids’ activities, and community exhibits will round out a weekend of high-flying fun.                                                                                     “This isn’t just a show — it’s an experience,” added Steve Lineberry, Media and Publicity Director                                  .                                    “The Chuters remind us that aviation is as much about people as it is about planes. Their performance embodies courage, teamwork, and a sense of pride that resonates with everyone in attendance.                                                                                     Event Details:                                              Dates: Saturday, November 1st & Sunday, November 2nd, 2025                        Location: Punta Gorda Airport, Punta Gorda, Florida                        Tickets: On sale now at www.floridaairshow.com Florida International Air Show Set to Soar November 1–2, 2025 Blue Angels, F-16 Viper Demo, and Family Attractions Headline USA TODAY 10BEST Air Show May 9, 2025 Punta Gorda, FL — May 7, 2025                                               — The skies over Southwest Florida will roar to life this fall as the                                              Florida International Air Show                                               returns to                                              Punta Gorda Airport on November 1–2, 2025                                               , with an exhilarating lineup headlined by the                                              U.S. Navy Blue Angels                                               and the                                              F-16 Viper Demo Team                                  .                                                                   This year’s show features a dynamic mix of aerial precision, vintage power, and heart-pounding stunts with performers including                                              Warbird Thunder                                               ,                                              Aarron Deliu                                               ,                                              Doug Litton                                               , and the thrilling parachute team                                              The Chuters                                  .                                                                                                  New for 2025, the Air Show proudly introduces two                                              family-friendly attractions                                  :                                                                   The                                              Innovators STEM Pavilion                                               – a hands-on zone to engage students and families with science, tech, and aviation.                                                                                                              The                                              Family Aviation Experience                                               – a fun, interactive area designed to inspire future aviators and entertain all ages.                                                                                                              Voted a                                              USA TODAY 10BEST Air Show in America for the second consecutive year                                  , this world-class event continues to attract aviation fans, families, and thrill-seekers from across the country.                                                      Tickets go on sale to the public at noon on May 23, 2025                                               . For performer updates, and opportunities to                                              sponsor                                               ,                                              vend                                               , or                                              exhibit                                  , visit www.floridaairshow.com or follow us on social media @florida_air_show.                                                                                     Don’t miss this high-flying celebration of aviation, innovation, and family fun!                                                      Media Contact:                                              Steve Lineberry                        941-626-0551                        media@floridaairshow.com                        Florida International Air Show                        www.floridaairshow.com Reaching New Heights: Florida International Air Show and conCHAIRto Team Up May 9, 2025 Cleveland, OH – May 2025 – conCHAIRto, the premier provider of premium seating solutions for outdoor music festivals and live events, is pleased to announce a new partnership with the Florida International Air Show (FIAS), scheduled for November 1-2, 2025 in Punta Gorda, Florida.                                                                                                            As a valued partner for this event, conCHAIRto will provide comfortable, convenient and sustainable seating solutions that will allow spectators to comfortably experience the speed, sound and scale that only these aircraft can provide. The schedule includes exciting military and civilian performances and displays for audiences of all ages.                                                                                                            “As we expand our business reach into air show events,\" said Brett Smiley, President and Founder of conCHAIRto. \"I cannot think of a better partner than the Florida International Air Show. They have been exciting audiences for over 43 years and are rated one of the top 10 air show events in the world. We are here to elevate that experience even more.”                                                                                                            The disruptions caused by Hurricanes Milton and Helene forced the cancellation of the 2024 event, the first in its 43-year history. The Florida International Air Show has come back with a bang…or is that a sonic boom? Beginning as a brief single-day event with only a few acts, the show has grown into a multi-day event with family and fan-friendly activities, a large variety of acts, interactive displays and much more. The Punta Gorda Airport plays an integral role in the Air Show’s history — it has hosted the event since its inception.                                                                                                            \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community,\" Denise Dull, President of the Air Show.                                                                                                            Tickets for the 2025 Florida International Air Show go on sale on May 23. For more information and to purchase tickets, visit their official website.                                                                                                            About conCHAIRto:                                                      conCHAIRto is a premier provider of high-quality seating solutions, dedicated to enhancing comfort and style for various events and venues. With a focus on innovative design and exceptional craftsmanship, conCHAIRto delivers products that meet the highest standards of excellence.                                                                                                            For more information about conCHAIRto and its range of premium seating solutions, please visit conCHAIRto.com or email us at info@conchairto.com. 2024 FIAS Canceled Due to Hurricanes Milton and Helene October 14, 2024 Air Show Canceled Due to Hurricanes Milton and Helene                                                      [Punta Gorda, FL] –  In light of the significant impacts of Hurricane Milton and Hurricane Helene on the community, organizers have made the difficult decision to cancel the 43rd Annual Florida International Air Show. The dual hurricanes have caused widespread damage and disruption across the region, making it impractical to proceed with the event.                                                                                     \"Our community is facing tremendous challenges as we recover from the destruction caused by these two powerful storms,\" said Denise Dull, President of the Air Show. \"The safety of our attendees, vendors, and volunteers is our highest priority, and at this time, it is clear that the best course of action is to focus on supporting our community’s recovery efforts.\"                                                                                     Both hurricanes have resulted in extensive damage to homes, businesses, and essential infrastructure, with many residents still experiencing the impact of these events. As the region continues its recovery efforts, event organizers believe the community’s attention and resources are best directed toward rebuilding and aiding those affected by the storms.                                                                                     While the Air Show is an annual tradition that brings joy and excitement to the area, the decision to cancel was made out of an abundance of caution and care for the community’s well-being. Organizers are committed to bringing the event back stronger once recovery efforts are complete and the community is ready to come together in celebration.                                                                                     \"We are incredibly grateful to our sponsors, volunteers, and vendors who have worked tirelessly in preparation for this year’s event. Our community partners, PGD, Charlotte County Sheriff, Fire & EMS, are all committed to the safety of Charlotte County and its residents and we would not want to do anything that would create a larger burden on their workload during post hurricane rebuild,\" added Dull. \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community.\" Tickets will be refundable or may be exchanged for the 2025 Air Show. *Note the lower ticket price will be honored as we expect ticket prices will increase.                                                                                     For more information on how to assist in relief efforts, please visit www.coadfl.org                                                                                                  About The Florida International Air Show                                                                  The Florida International Air Show’s mission is to deliver a wholesome family entertainment event celebrating aviation past, present, and inspiring its future.                                                                                                  ﻿                        For further information or media inquiries, please contact: Steve Lineberry 941-626-0551 media@floridaairshow.com Experience the thrill of aviation at our award-winning event! October 14, 2024 The Florida International Air Show - This is One Air Show You Do Not Want to Miss! October 1, 2024 Southeast Tourism Society Selects Florida International AirShow  as a  “Signature Event of the Southeast” Award Winner August 12, 2024 PUNTA GORDA, FL. (August 14, 2024) –  Southeast Tourism Society (STS) has named the Florida International Airshow one of the Signature Events of the Southeast for 2024.                                                                                     This year’s Florida International AirShow is November 2-3. 2024 held in Punta Gorda, FL. Signature Events of the Southeast, formerly known as “Top 20 Festival and Event Awards”, was launched as part of the 40th Anniversary celebration of Southeast Tourism Society in 2023. STS has recognized events and festivals around the Southeast since 1985.                                                                                     Travel industry experts select top events to be highlighted for the year, and STS publicizes them throughout the United States. The complete list is published on both the Travel Media Press Room and Escape to the Southeast® websites and recognized on all Southeast Tourism Society’s social media platforms.                                                                                     The AirShow will celebrate its 43rd year of presenting exciting entertainment to residents and visitors of Charlotte County on the grounds of the Punta Gorda Airport. Beginning as a single day event, the show has grown to a three day event with fan-friendly activities, a large variety of acts, interactive displays, and much more. “If you’ve not been to an AirShow before, it’s like taking Nascar, pizza, baseball, hotdogs, fireworks, football and Lynyrd Skynyrd and rolling it all into one giant rodeo “says Denise Dull, President of the Florida International AirShow. “There’s something for everyone in the family.” The Florida International Airshow also received a USA TODAY 10Best Readers Choice Award this year for their November 2023 AirShow, which featured the USAF Thunderbirds and was a record attendance year.                                                                                     “For more than 40 years, STS has been spotlighting the best festivals and events in the Southeast. Our goal is to highlight the efforts of devoted event organizers and provide additional media exposure and accolades for their events,” said Monica Smith, President and CEO of Southeast Tourism Society. “The Southeast offers so many unique, year-round, opportunities for tourists and festival goers to create memories and support the tourism industry-–a vital economic generator for communities.”                                                                                     Events considered for the STS Signature Events of the Southeast recognition must be at least three years old and have an attendance of at least 1,000. Nominations open in early spring. Members and non-members are eligible to apply. Winning submissions are automatically judged in the Festival or Event of the Year category for STS’s Shining Example Awards.                                                                                     About Southeast Tourism Society                                                                   The Southeast Tourism Society (STS) is a not-for-profit membership association dedicated to the development of travel and tourism professionals and organizations within the southeast region. The association’s mission is to empower a diverse network of tourism professionals through Education, Advocacy, Recognition, and Networking. Member states include Alabama, Arkansas, Florida, Georgia, Kentucky, Louisiana, Mississippi, Missouri, North Carolina, South Carolina, Tennessee, Virginia, and West Virginia, plus the District of Columbia.                                                                                                              About Florida International Air Show                                                                               The Florida International AirShow is a Florida 501(c) 4 nonprofit organization staffed entirely by volunteers. The Airshow is a multi day event showcasing nationally known performers and exciting static displays of aircraft and vehicles. The Airshow offers attendees the opportunity to learn more about aviation, space, and military service. FIAS events provide beneficial exposure to the community and Punta Gorda Airport as a significant economic asset has donated over $3.6 million in contributions to local Southwest charities since its inception. For more information visit www.floridaairshow.com                                                                                                              Florida International AirShow                                                                               Denise Dull, President                                                                               941-626-9439                                                                               denisedull@floridaairshow.com                                                                  www.floridaairshow.com Air show expected to bring millions in revenue to Charlotte County July 2, 2024 BY NANCY SEMON                                   | JULY 2, 2024 | PHOTO CREDIT:FLORIDA INTERNATIONAL AIR SHOW Patrick Fuller: Hometown Hero Takes to the Skies By UBU BRANDS • November 10, 2023 Meet Patrick Fuller, Punta Gorda's Emergency Management Director, who recently found himself soaring through the clouds with the United States Air Force Thunderbirds, marking a high-flying chapter in his illustrious career.  Having dedicated four years to the Marine Corps and an additional twenty ye 1 (current) 2 Buy Tickets Florida International Air Show Hot Line 1.833.PGD-FIAS 1.833.743.3427 SPONSORS VOLUNTEER TEAM CONTACT The Florida International Air Show is a proud member of the ICAS International Council of Air Shows The Florida International Air Show is a proud member of the SECAS Southeast Council of Air Shows Charlotte County Chamber of Commerce Charlotte County, Florida Copyright © 2025 Florida International Air Show Website by: The Firm Advertising Agency Share by:"
    },
    {
      "url": "https://selectflorida.org/why-florida/industries/aviation-aerospace/",
      "text": "Aviation & Aerospace Industry in Florida Grow Your Business in Florida Contact the Business Development Team Business Climate Workforce and Talent Development Major Industries Infrastructure Regions Quality of Life Buildings and Site Search Export From Florida Trade Offices Trade Grants Certificates of Free Sale Good Manufacturing Practices Certificates Research and Reports For International Companies SelectFlorida’s International Offices International Investment Resources Research and Reports News & Resources News Events About Our Board Archived Reports Toggle Navigation Button Toggle Navigation Button Bring your Business to Florida Why Florida Contact the Business Development Team Business Climate Workforce and Talent Development Florida’s Major Industries Infrastructure Quality of Life Buildings and Site Search Regions Industries Aviation & Aerospace Cleantech Defense and Homeland Security Financial and Professional Services Headquarters Information Technology Life Sciences Logistics and Distribution Manufacturing News & Resources News & Stories Events Archived Reports Export From Florida Trade Offices Trade Grants Certificates of Free Sale Research and Reports Trade & FDI Events For International Companies SelectFlorida’s International Offices International Investment Resources About Our Board Careers Our Offices Contact Us Follow Us Linkedin X Aviation & Aerospace Your business can soar in Florida’s cutting-edge aviation and aerospace industry. Cape Canaveral Air Force Station Home / Why Florida / Florida’s Major Industries / Aviation & Aerospace Where Aviation & Aerospace Companies Lift Off With a rich supply chain and top connectivity, Florida’s aviation and aerospace companies are shooting for the stars. Home to the renowned Kennedy Space Center , Cecil Spaceport and Cape Canaveral Air Force Station , Florida’s aviation and aerospace industry is the world’s gateway to space. As the birthplace of commercial aviation, Florida has 125 public-use airports and 19 commercial airports to seamlessly move goods and people around the globe. The Sunshine State is the undisputed air traffic hub of the Americas, a major hub for flight training and MRO and a leading location for manufacturing aircrafts and aircraft components. In addition, Florida has the rich supply chain and highly skilled workforce to support engineering, robotics, surveillance, technology and more. Downloads/Quick Links Space Florida Florida Defense Contractors Association The Aerospace Alliance Aviation & Aerospace Industry Profile View PDF Featured Image Cape Canaveral Air Force Station Rankings #4 Best Undergrad Aerospace Engineering Program Embry-Riddle Aeronautical University #2 Largest Aerospace Cluster in the U.S. with 640+ Aerospace Establishments as of 2023. The Gateway to Space Global Companies Reach for the Stars Florida’s Workforce The Gateway to Space The Gateway to Space Florida has long been the world’s premier gateway to space. No matter your company’s specialty, you can launch, manufacture, research and collaborate in Florida’s aerospace industry. Global Companies Reach for the Stars Global Companies Reach for the Stars Florida has cultivated a cutting-edge aviation and aerospace industry, so it’s no wonder why industry leaders have significant operations in Florida. Florida’s Workforce Florida’s Workforce Florida’s aerospace workforce is 41,800+ people strong with over 640 establishments in the sector. The aerospace workforce in Florida is molded through the state’s top education system and the Aviation and Aerospace wing of Florida’s High Tech Corridor . In addition, the Daytona Beach Campus of Embry-Riddle Aeronautical University has the largest Aerospace Engineering program in the nation, keeping the talent pipeline full with bachelor’s, master’s, and Ph.D. degree options. Contact Us Harry Jorgensen Business Development Manager 407-956-5640 Harry.Jorgensen@commerce.fl.gov Contact Us Contact Us Mario Aleksic Director, International Trade & Development 407-286-8055 Mario.Aleksic@SelectFlorida.org Contact Us Success Stories & News Aviation & Aerospace ICYMI: SelectFlorida Attends the 2023 Dubai Air and Trade Show Generating More Than $54 Million in Actual Export Sales ICYMI: SelectFlorida Attends the 2023 Dubai Air and Trade Show Generating More Than $54 Million in Actual Export Sales Tallahassee, Florida — Recently, SelectFlorida attended the 2023 Dubai Air and […] Aviation & Aerospace ICYMI: SelectFlorida Attends MRO Europe 2023 Trade Show in Amsterdam Producing More than $41 Million in Actual Export Sales Tallahassee, Florida — Recently, SelectFlorida attended MRO Europe 2023 in Amsterdam, generating more than $41 million in actual export sales and an estimated $95 million in export sales over the next […] Aviation & Aerospace Dassault Falcon Jet to Build Major Maintenance Facility in Melbourne TALLAHASSEE, Fla. – Today, Dassault Falcon Jet announced it will build a new maintenance facility at Melbourne Orlando International Airport as part of the company’s global expansion of its maintenance, […] Aviation & Aerospace Lieutenant Governor Jeanette Nuñez Leads Mission to United Kingdom for Farnborough International Airshow TALLAHASSEE, Fla. — Today, Lieutenant Governor Jeanette Nuñez highlighted her aerospace and aviation mission to the United Kingdom for the Farnborough International Airshow, which took place from July 16—20. During the […] Aviation & Aerospace Aviation Training Firm SIMCOM Expands Headquarters in Orlando SIMCOM investing $109 million in new headquarters and training facility Orlando, Fla. (August 4, 2020) – SIMCOM International, Inc. is expanding and building a new worldwide headquarters in Orlando. The […] Aviation & Aerospace New Space Company Lands at Embry-Riddle Aeronautical University’s MicaPlex DAYTONA BEACH, Fla. (May 27, 2020) – A company that has been supplying the space industry for more than 30 years has selected Volusia County, Fla., as the site from which […] Aviation & Aerospace Aerion Supersonic Will Move Global Headquarters to Florida Aerion Will Build a New State-of-the-Art Campus in Melbourne Tallahassee, Fla. (April 24, 2020) – Today, Governor Ron DeSantis announced Aerion Supersonic will construct a new state-of-the-art campus – Aerion […] Aviation & Aerospace Governor Ron DeSantis Announces Made In Space Corporate Headquarters Relocation from California to Florida Jacksonville, Fla. – Today, Governor Ron DeSantis announced that Made In Space has decided to relocate their corporate headquarters and satellite manufacturing operations from California to Florida. The headquarters relocation […] Aviation & Aerospace Governor Ron DeSantis and Lieutenant Governor Jeanette Nuñez Participate in Spirit Airlines’ Headquarters Groundbreaking Dania Beach, Fla. – Today, Governor Ron DeSantis joined Spirit Airlines in the groundbreaking ceremony of their new corporate headquarters. The Governor was joined by Lieutenant Governor Jeanette Nuñez, Spirit […] Aviation & Aerospace Lockheed Martin Celebrates FBM Headquarters Move To Florida’s Space Coast TITUSVILLE, Fla. (July 30, 2019) – Today Lockheed Martin celebrated the move of the Fleet Ballistic Missile (FBM) Headquarters from Sunnyvale, California to Florida’s Space Coast during an official flag-raising event. Establishing this […] Previous Button Next Button More Stories and News 201 Alhambra Circle, Suite 610\nCoral Gables, Florida 33134 Phone: 305-808-3660 Fax: 305-808-3586 Grow Your Business in Florida Export from Florida For International Companies News & Resources About Follow Us Linkedin X © 2025, SelectFlorida, All Rights Reserved | Privacy Policy Search Search"
    },
    {
      "url": "https://flysnf.org/",
      "text": "SUN 'n FUN Aerospace Expo - Lakeland, FL Skip to content ACE SUN ‘n FUN Museum Elevate | Venue Camping Volunteer Events News Shop April 14-19, 2026 Buy Tickets Buy Tickets Search for: Search Search Sign up for the Newsletter for the latest SUN 'n FUN Updates! Tickets Menu Toggle 2026 SUN ‘n FUN Admission Rates Auto Parking 9/27 Club The Bash Aerospace Expo Private Event Rentals Women ACES Breakfast Attend Menu Toggle Flying-In Driving-In Accommodations Guest Services Expo Maps Food & Drink FAQ Mobile App Shop Flying-In Menu Toggle NOTAMS Fly-In Style Pilot Program Flight Tracker Aircraft Safety Tips – Sheltair Pilot Welcome Tent The Island Share-A-Flight Aircraft Parking & Camping SUN ‘n FUN Fly-In Ambassadors Weather – Powered by Mesotech Camping Menu Toggle Camping Rates General Camping Info Aircraft Camping RV Camping Tent Camping Campground Entertainment Activities Menu Toggle Daily Schedule Future ‘n Flight Plaza CAF Aircraft Rides Aircraft Menu Toggle Aerobatic HQ Aircraft Judging Fly-By Showcase Bushwheel Basecamp Showplanes Homebuilt Vintage Seaplane Light Planes Warbirds Rotorcraft Static Displays Airshow Menu Toggle Airshow Schedule Performer Info Balloon Launch STOL Invitational Sunset Aerial Circus Author’s Corner Career Fair Forums Kids Activities Menu Toggle Junior ACEs Field Trips Family Oasis & Kids Club Military Menu Toggle Demo Flights Static Displays Veterans Plaza Victory’s Arsenal Theatre Evening Entertainment Other Activities Menu Toggle ACE’S Flyin’ Flix HAM Radio International Oasis Parts Exchange SUN ‘n RUN 5K Type Clubs Women ACES Teachers’ Pre-Flight Experience The Bash: A Night to Fuel the Future Workshops The Hangar Exhibitors Menu Toggle Innovation Showcase Why Exhibit Exhibitor Resources Current Exhibitors Exhibitor News Advertising Sponsorships Sponsor Menu Toggle Become A Sponsor Current Sponsors Advertising Become An Exhibitor Community Partners News/Media Menu Toggle Strategic Plan Narrative Media Resources News Press Releases Press Center & Media Credentials Media Waivers and Policy Press Conference Request Media Kits About Us Menu Toggle About SUN ‘n FUN Contact Us Volunteer The Team Board of Directors Donate Tickets 2026 SUN ‘n FUN Admission Rates Auto Parking 9/27 Club The Bash Aerospace Expo Private Event Rentals Women ACES Breakfast Attend Flying-In Driving-In Accommodations Guest Services Expo Maps Food & Drink FAQ Mobile App Shop Flying-In NOTAMS Fly-In Style Pilot Program Aircraft Safety Tips – Sheltair Pilot Welcome Tent The Island Share-A-Flight Aircraft Parking & Camping SUN ‘n FUN Fly-In Ambassadors Weather – Powered by Mesotech Camping Camping Rates General Camping Info Aircraft Camping RV Camping Tent Camping Campground Entertainment Activities Daily Schedule Future ‘n Flight Plaza CAF Aircraft Rides Aircraft Aerobatic HQ Aircraft Judging Fly-By Showcase Bushwheel Basecamp Showplanes Homebuilt Vintage Seaplane Light Planes Warbirds Rotorcraft Static Displays Airshow Airshow Schedule Performer Info Balloon Launch STOL Invitational Sunset Aerial Circus Author’s Corner Career Fair Forums Kids Activities Junior ACEs Field Trips Family Oasis & Kids Club Military Demo Flights Static Displays Veterans Plaza Victory’s Arsenal Theatre Evening Entertainment Other Activities ACE’S Flyin’ Flix HAM Radio International Oasis Parts Exchange SUN ‘n RUN 5K Type Clubs Women ACES Teachers’ Pre-Flight Experience The Bash: A Night to Fuel the Future Workshops The Hangar Exhibitors Innovation Showcase Why Exhibit Exhibitor Resources Current Exhibitors Exhibitor News Advertising Sponsorships Sponsor Become A Sponsor Current Sponsors Advertising Become An Exhibitor Community Partners News/Media Strategic Plan Narrative Media Resources News Press Releases Press Center & Media Credentials Media Waivers and Policy Press Conference Request Media Kits About Us About SUN ‘n FUN Contact Us Volunteer The Team Board of Directors Donate ACE Family Sites ACE SUN ‘n FUN Museum Elevate ————————— Venue Camping Volunteer Events News Shop Search for: Search Search Join Us April 14-19, 2026 | Lakeland, FL PURCHASE TICKETS What's Happening Airshow Schedule Learn More SUN 'n FUN Merchandise Learn More Daily Schedule Learn More FAQs Learn More Driving In Learn More Flying In Learn More Latest News September 9, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News Soaring Through September Like… Keep Reading September 4, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News SUN ‘n FUN Tickets on Sale Now!! Keep Reading August 7, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News Welcome Back to School! Keep Reading July 19, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News Come see SUN ‘n FUN at AirVenture! Keep Reading July 17, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News SUN ‘n FUN President & CEO Gene Conrad to Speak at AirVenture Keep Reading July 10, 2025 | Aerospace Expo , News , SUN ‘n FUN Event News Summer Vibes are in Full Swing! 😎 Keep Reading Home of SUN 'n FUN Dates 2026 – April 14-19 2027 – April 6-11 2028 – April 4-9 2029 – April 10-15 2030 – April 9-14 Company About Us Contact Us Advertising News Support Privacy Policy Terms of Service Stay Connected Home of SUN 'n FUN Dates 2026 – April 14-19 2027 – April 6-11 2028 – April 4-9 2029 – April 10-15 2030 – April 9-14 Company About Us Contact Us Advertising News Support Privacy Policy Terms of Service Stay Connected Home of SUN 'n FUN Dates 2026 – April 14-19 2027 – April 6-11 2028 – April 4-9 2029 – April 10-15 2030 – April 9-14 Company About Us Contact Us Advertising News Support Privacy Policy Terms of Service Stay Connected 4075 James C. Ray Dr., Lakeland, Florida 33811 | Lakeland Linder International Airport | (863) 644-2431 Aerospace Center for Excellence is a 501(c)(3) not-for-profit organization. A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-435-7352 OR CONTACT WWW.FLORIDACONSUMERHELP.COM . REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. ACE LICENSE #CH12713 AND SNF LICENSE #CH10802. © 2025 SUN 'n FUN Aerospace Expo. All Rights Reserved. | Brand Management Provided by Tinsley Creative 2025 STOL Forums Schedule Tuesday, April 1 – Kicking Off with Coffee & Aircraft Maintenance ☕✈️ 🔹 Airplanes & Coffee – FREE COFFEE Daily 🕗 8:00 AM – 12:00 PM 👤 Russ Keith – Founder, Airplanes & Coffee 📍 Bushwheel Basecamp ☕ Proudly serving Legendary Coffee. Start the day with coffee and conversation. 🔹 Where to Find Mechanics for Experimentals & LSA ✈️🌲 🕥 10:30 AM – 11:30 AM 👤 Bryan Walstrom – Host & Owner, The Experimental Aircraft Channel 📍 STOL Basecamp Forum 🔧 Learn where to find the right Experimental & LSA aircraft mechanics. 🎤 LIVE STOL Pilot Interviews by National STOL 🎥 🕛 12:00 PM – 1:00 PM 📍 National STOL Booth, Paradise City – LP-032 👥 Hosted by Ryan Dembroski & Cam Walton 🔹 STOL Invitational at the Grass Strip 🕖 7:00 PM 📍 Paradise City, Runway 8/26 🚀 Wednesday, April 2 – STOL & Partnership Talks + Community Dinner 🔹 Airplanes & Coffee – FREE COFFEE Daily 🕗 8:00 AM – 12:00 PM 👤 Russ Keith – Founder, Airplanes & Coffee 📍 Bushwheel Basecamp ☕ Proudly serving Legendary Coffee . Start the day with coffee and conversation. 🔹 RAF and the Power of Partnership 🕘 9:00 AM – 10:00 AM 👤 Matt Hofeldt (VP of Brand, Aviat Aircraft) & Lou (Georgia RAF Ambassador) 📍 STOL Basecamp Forum 🔹 STOL for Rookies – How to Get Started in STOL 🛩️ 🕙 10:15 AM – 11:15 AM 👤 Jon “Jughead” Counsell 📍 STOL Basecamp Forum 🎤 LIVE STOL Pilot Interviews by National STOL 🎥 🕛 12:00 PM – 1:00 PM 📍 National STOL Booth, Paradise City – LP-032 🍽️ Authentic Jambalaya Dinner & Craft Beer Social 🎶 🔹 Sponsored by Aviat HUSKY & The RAF 🕟 4:30 PM – 6:30 PM 📍 Bushwheel Basecamp 🍺 Craft Beer Sponsored by Swan Brewing Co. & Mastry’s Brewing Co 🔹 Basecamp Craft Beer & Chill Vibes 🍻 🎶 🕔 5:00 PM – 6:30 PM 📍 Bushwheel Basecamp 🍺 Beer Provided by Mastry’s Brewing Co. & Swan Brewing Co. 🍺 Wind down with craft beer, good company, and great vibes as we gear up for the EPIC Night Show! Thursday, April 3 – STOL Techniques & Off-Airport Flying 🔹 Airplanes & Coffee – FREE COFFEE Daily 🕗 8:00 AM – 12:00 PM 👤 Russ Keith – Founder, Airplanes & Coffee 📍 Bushwheel Basecamp ☕ Proudly serving Legendary Coffee . Start the day with coffee and conversation. 🔹 A Discussion on Safe Minimum Altitudes When Off-Airport Flying 🕙 10:00 AM – 11:00 AM 👤 Patrick McInteer 📍 STOL Basecamp Forum 🔹 Real World Off-Airport VS STOL Competition Flying 🕚 11:00 AM – 12:00 PM 👤 Jughead Counsell, Dan Reynolds, Keith Lange 📍 STOL Basecamp Forum 🎤 LIVE STOL Pilot Interviews by National STOL 🎥 🕛 12:00 PM – 1:00 PM 📍 National STOL Booth, Paradise City – LP-032 🔹 TL Sport Aircraft – Bringing Composites into the Backcountry 🕛 12:00 PM – 1:00 PM 👤 Trey Murdaugh – CEO TL Sport Aircraft / Justin Tisdale – STOL Pilot & Consultant 📍 STOL Basecamp Forum 🔹 STOL Invitational at the Grass Strip 🕖 7:00 PM 📍 Paradise City, Runway 8/26 🚀 Friday, April 4 – STOL Design & Humanitarian Flight 🔹 Airplanes & Coffee – FREE COFFEE Daily 🕗 8:00 AM – 12:00 PM 👤 Russ Keith – Founder, Airplanes & Coffee 📍 Bushwheel Basecamp ☕ Proudly serving Legendary Coffee . Start the day with coffee and conversation. 🔹 Zenith STOL Designs: Form Follows Function 🕤 9:30 AM – 10:30 AM 👤 Sebastien Heintz (CEO, Zenith Aircraft Co.) 🎙️ With special guest Sheldon Heatherington Driver of “Red Bird” Zenith 750 & STOL Invitational Pilot 📍 STOL Basecamp Forum 🎤 LIVE STOL Pilot Interviews by National STOL 🎥 🕛 12:00 PM – 1:00 PM 📍 National STOL Booth, Paradise City – LP-032 🔹 STOL Invitational at the Grass Strip 🕖 7:00 PM 📍 Paradise City, Runway 8/26 🚀 Saturday, April 5 – Backcountry Safety & Adventure 🔹 Airplanes & Coffee – FREE COFFEE Daily 🕗 8:00 AM – 12:00 PM 👤 Russ Keith – Founder, Airplanes & Coffee 📍 Bushwheel Basecamp ☕ Proudly serving Legendary Coffee. Start the day with coffee and conversation. 🔹 Beyond the Runway: Essential Safety in Backcountry 🕙 10:00 AM – 11:00 AM 👤 John Hartz, Patrick McInteer, Jay Stanford, Keith Lange, Dan Reynolds, Rick Ness 📍 STOL Basecamp Forum 🎤 LIVE STOL Pilot Interviews by National STOL 🎥 🕛 12:00 PM – 1:00 PM 📍 National STOL Booth, Paradise City – LP-032 🔹 Basecamp Craft Beer & Chill Vibes 🍻 🎶 🕔 3:00 PM – 6:00 PM 📍 Bushwheel Basecamp 🍺 Beer Provided by Mastry’s Brewing Co. & Swan Brewing Co. 🍺 Wind down with craft beer, good company, and great vibes as we gear up for the EPIC Night Show! 🔹 STOL Invitational at the Grass Strip 🕖 7:00 PM 📍 Paradise City, Runway 8/26 🚀 ✈️ Fly, Connect, and Experience the Bushwheel Basecamp! Don’t forget to tag us in your photos and videos! 📲 @STOL.flysnf | #BWBC #SNFSTOL #SNF25 Thank You to Our Sponsors! A huge thank you to the sponsors who help make the Bushwheel Basecamp possible! Bushwheel Basecamp 2025 Sponsors: HUSKY Aircraft The RAF PREMIER LUXURY RY RENTALS Cross Wired Electrical Services McFarlane Aviation Mastry’s Brewing Co Patriot Aircraft Swan Brewing Co TL Sport Aircraft Operation Airdrop Sky Cowboy Supply Co Slow Mo STOL Experimental Aircraft Channel Your partnership and support help us bring the backcountry aviation spirit to life at SUN ‘n FUN! × Aerobatic HQ Performer’s Schedule All meet and greets will be held at Aerobatic HQ (New location – South of Seaplanes) Airythmia Paramotor Team April 1st from 11 AM – 12 PM Greg Koontz April 2nd from 10 AM to 11 AM Bob Carlton – Vertigo Airshows: FoxJet SailPlane April 2nd from 11 AM to 12 PM Erik Edgren & T-Clips April 2nd from 12 PM to 1 PM Nathan Hammond – Ghostwriter Airshows April 3rd from 9 AM to 10 PM RJ Gritter April 3rd from 10 AM to 11 AM Melissa Burns April 3rd from 11 AM to 12 PM Redline Airshows April 3rd from 12 PM to 1 PM Aerobatic’s Golden Trio – Mike Goulian, Rob Holland, & Patty Wagstaff April 4th from 9 AM to 10 AM Doug Rozendaal – Mister Mulligan April 4th from 11 AM to 12 PM Greg Koontz April 5th from 11 AM to 12 PM × Light Plane Forum Schedule Day Event Name Start Time End Time Speaker Name Event Type Track Location Fri. April 4 AutoGyro Flying 1:30:00 PM 2:30:00 PM Bob Snyder: AutoGyro (LP-25) Light Plane Forum Education Credit Light Plane / Paradise City Fri. April 4 Technical Side Of The QuickSilver 3:00:00 PM 4:00:00 PM Bever Borne: Air-Tech (LP-19) Light Plane Forum Education Credit Light Plane / Paradise City Fri. April 4 Dacron Sail Cloth Install & Maintenance 10:30:00 AM 11:30:00 AM Malcolm Brewbaker: Great Sails Light Plane Forum Education Credit Light Plane / Paradise City Fri. April 4 Gaggle Flight Recorder 12:00:00 PM 1:00:00 PM Hennie Espere Brink: Gaggle Flight Recorder Light Plane Forum Education Credit Light Plane / Paradise City Sat. April 5 What You Need To Know About FAA 12:00:00 PM 1:00:00 PM Thomas Bhrem: FAA Light Plane Forum Education Credit Light Plane / Paradise City Sat. April 5 Powered Paragliders (PPG) – Let’s Talk! 1:30:00 PM 2:30:00 PM Paul Czarnecki: PlanetPPG Light Plane Forum Education Credit Light Plane / Paradise City Sat. April 5 Building & Registering Experimental Aircraft 3:00:00 PM 4:00:00 PM Paul Mather: M-Squared (LP-23) Light Plane Forum Education Credit Light Plane / Paradise City Sat. April 5 Gaggle Flight Recorder 10:30:00 AM 11:30:00 AM Hennie Espere Brink: Gaggle Flight Recorder Light Plane Forum Education Credit Light Plane / Paradise City Thu. April 3 Rotax 2-Stroke Maintenance Tips 10:30:00 AM 11:30:00 AM Phil Lockwood: Lockwood Aviation (N-23 N-31 NE-12) Light Plane Forum Education Credit Light Plane / Paradise City Thu. April 3 Let’s Talk About Powered Parachutes (PPC) 12:00:00 PM 1:00:00 PM Gailen Geigley: Powrachute (LP-14) Light Plane Forum Education Credit Light Plane / Paradise City Thu. April 3 Technology Advances In Ultralight Aircraft 3:00:00 PM 4:00:00 PM Chip Erwin: Aeromarine (LP-24) Light Plane Forum Education Credit Light Plane / Paradise City Thu. April 3 Flying A Weight-Shift Trike 1:30:00 PM 2:30:00 PM Larry Mednick: Evolution Aircraft (LP-16) Light Plane Forum Education Credit Light Plane / Paradise City Wed. April 2 Rotax 4-Stroke Maintenance Tips 10:30:00 AM 11:30:00 AM Phil Lockwood: Lockwood Aviation (N-23 N-31 NE-12) Light Plane Forum Education Credit Light Plane / Paradise City Wed. April 2 Ground Adjustable Propellers 3:00:00 PM 4:00:00 PM Richard Hayes: Ultra Prop (LP-61) Light Plane Forum Education Credit Light Plane / Paradise City Wed. April 2 Building & Registering Experimental Aircraft 12:00:00 PM 1:00:00 PM Paul Mather: M-Squared (LP-23) Light Plane Forum Education Credit Light Plane / Paradise City Wed. April 2 Build Your Bush Plane STOL 1:30:00 PM 2:30:00 PM Kris Griewahn: Just Stol-It (LP-09) Light Plane Forum Education Credit Light Plane / Paradise City × Don’t Miss Out, Tune In! – SUN ‘n FUN Radio Whether you are a first time visitor or long time SUN ‘n FUN guest, there is never enough time to take in all the activities at the fly-in. And, did you ever try to read a program book and walk? We have the solution—SUN ‘n FUN Radio! SUN ‘n FUN Radio Broadcasts locally on 1510 AM & audio streams worldwide on www.LiveATC.net/snf . Tune in… We will keep you updated on scheduled events as well as special activities, and guests for the day.Tune in to hear our RadioActive volunteer announcers & reporters bring you interviews with a variety of interesting pilots, builders, aviation enthusiasts, and SUN ‘n FUN exhibitors, sponsors & advertisers, as well as weather updates and major news stories. We also broadcast the daily airshow commentary & select evening programs. Please “Like” our Facebook Page www.Facebook.com/SnFRadio You can also follow us on Twitter www.Twitter.com/SnFRadio Or you can email us at SnFRadio@gmail.com × SUN ‘n FUN Media Productions and SUN ‘n FUN Aerospace Expo TV Media Productions at SUN ‘n FUN is the Aerospace Center for Excellence’s in-house media gathering team. Production facilities are wholly located within the company’s headquarters. Producing 4K and HD broadcast video assets promotes the organization’s activities across all areas, from the fly-in to education. Established in 2023 for SUN ‘n FUN, an all-volunteer team produces Live Streaming of television programming, short and long-form video features, and marketing assets for use by the Aerospace Center for Excellence. In 2024, the Media productions Team: Acquired more than 4.3 terabytes (TB) of video footage Produced more than 20 hours of Live Television Produced 249 video programs, features, or shorts While this is a volunteer team, members of Media Productions bring more than 70 years of broadcast production experience to the event. This spirit of volunteering and professionalism is the hallmark of the history of SUN ‘n FUN. Available Assets and Programming During the SUN ‘n FUN fly-in, Media Productions is actively videotaping multiple events that occur on campus. Requests for footage should be made to Dave Kalahar at dkalahar@flysnf.org Live Events can be captured via a Boxcast URL.  Contact Dave Kalahar for details. The ACE/SNF broadcast studio may be available for outside production. Our fully equipped multi-camera studio is capable of 4K and HD production. Contact Dave Kalahar for details and availability. Volunteer Opportunities Media Productions is always looking for volunteers to help with its work. We need video editors, field camera operators, studio production assistants, and on-camera hosts or reporters. Full details are available at https://volunteer.flysnf.org/volunteer-job-listings/ . We look forward to having you join the team. × 2025 STOL FORUMS Registration for presentations that are scheduled in the STOL Bushwheel Basecamp.  The STOL Forums have limited presentation space available. Register your interest in this forum opportunity by completing the submission form below. Your participation will be confirmed by the STOL Forums scheduler. \" * \" indicates required fields STOL Bushwheel Basecamp Forum Registration Forum Title: * Forum Presenter's Name: * Event Promotion Presenter's Bio ** 50 words or less ** Provide Presentation Photo/Graphic Max. file size: 256 MB. Provide a Brief Overview of this Presentation Your presentation may be chosen for event promotion. Forum Schedule Details Please remember that our forums experience is not a sales or promotional opportunity, education-based forums only.  You may select up to three presentation days.  Thank you! Preferred Day – First Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Day – Second Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Day – Third Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Time of Presentations: * 9:00 a.m. 10:00 a.m. 11:00 a.m. 12:00 p.m. Other Forum Information Equipment Needed: None Powerpoint Projector (VGA input or VGA adapter req.) Laptop (USB or VGA input) DVD Player Sound System Does this forum qualify for any of the aviation tracks listed below: (choose all that apply) * Backcountry Flying Backcountry Innovation & Education STOL Aircraft STOL Competitions Presenter's Contact Info Space provided for both Presenter and Submitter information, if different. Company Name (if representing a Company) Presenter's Name * Presenter's Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Primary Phone: * Presenter's Email: * Submitter's Name if different from Presenter Submitter's Cell Submitter's Email Schedule Changes We want to accommodate your STOL Forum schedule as requested. Please keep us informed of any schedule changes or cancellations. If you have to cancel, please let us know as soon as you can, so we have the opportunity to fill the schedule with another presentation. It is very important that we provide the most accurate event schedule information to our guests. Please send schedule changes to stol@flysnf.org. Comments: CAPTCHA Facebook This field is for validation purposes and should be left unchanged. Δ × 2025 FORUMS SPEAKER REGISTRATION \" * \" indicates required fields Are You Interested in Presenting a Forum during SUN ‘n FUN Aerospace Expo 2025? You are invited to contribute to the diverse offerings of aviation-related topics throughout the week of SUN ‘n FUN providing our guests with the opportunity to enjoy various educational opportunities.  Our presentations provide information on everything from A to Z. A presenter may not promote or sell any product or service during the scheduled presentation. EDUCATIONAL FORUMS cannot be used in place of an exhibit space purchase, this is strictly an educational opportunity for our guests to experience. If you are knowledgeable on an aviation topic and would like to share with your fellow aviators and SUN ‘n FUN guests, please complete the form below. Please do not use “quote marks” in your submission title. Once we begin compiling the schedule, we will contact you if we have questions regarding your topic or schedule request. Once you have submitted your registration successfully, you will receive an email confirming your submission. Please make sure the email provided on the registration is accurate.  If a confirmation email is not received, SUN ‘n FUN did not receive your submission. Please check your junk mail, try another browser or method to resubmit your registration. After trying all the above suggestions with no results, please contact us. Forum Speaker Registration Forum Title: * Forum Presenter's Name: * Event Promotion Presenter's Bio ** 50 words or less ** Provide Presentation Photo/Graphic Max. file size: 256 MB. Provide a Brief Overview of this Presentation Your presentation may be chosen for event promotion. Forum Schedule Details Please remember that our forums experience is not a sales or promotional opportunity, education-based forums only.  Thank you! Is this your first year presenting at SUN 'n FUN? * Yes No I would like to present this forum topic … times: * 1 2 3 4 5 6 Preferred Day – First Presentation * Tuesday Wednesday Thursday Friday Saturday Sunday Preferred Day – Second Presentation Tuesday Wednesday Thursday Friday Saturday Sunday Preferred Day – Third Presentation Tuesday Wednesday Thursday Friday Saturday Sunday Preferred Day – Fourth Presentation Tuesday Wednesday Thursday Friday Saturday Sunday Preferred Day – Fifth Presentation Tuesday Sunday Preferred Day – Six Presentation Tuesday Sunday Preferred Time of Presentations – First Choice: * 9:00 a.m. 10:00 a.m. 11:00 a.m. 12:00 p.m. 1:00 p.m. Preferred Time of Presentations – Second Choice: * 9:00 a.m. 10:00 a.m. 11:00 a.m. 12:00 p.m. 1:00 p.m. You may present this forum up to six times during the convention week, however if you choose to present more than four presentations, the two additional forums must be scheduled on either Tuesday and/or Sunday.  You are limited to four forums from Wednesday through Saturday. Other Forum Information Equipment Needed: None Powerpoint Projector (VGA input or VGA adapter req.) Laptop (USB or VGA input) DVD Player Sound System NOTE: Presenters are encouraged to bring their personal laptop computer if an electronic presentation is planned during your scheduled event. Does this forum qualify for any of the aviation tracks listed below: (choose all that apply) Aerobatic Alternate Engines Career Drones Innovations iPad Maintenance Sport Pilot / LSA Type Club Youth Will this forum qualify for any of the following?  (click all that apply) FAA Wings Credit FAA/IA Renewal Program Program Certificate Education Credit Presenter's Contact Info Space provided for both Presenter and Submitter information, if different. Company Name (if representing a Company) Presenter's Name * Presenter's Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Primary Phone: * Presenter's Email: * Submitter's Name if different from Presenter Submitter's Cell Submitter's Email Schedule Changes We want to accommodate your Educational Forum schedule as requested. Please keep us informed of any schedule changes or cancellations. If you have to cancel, please let us know as soon as you can, so we have the opportunity to fill the schedule with another presentation. It is very important that we provide the most accurate event schedule information to our guests. Please send schedule changes to educationalforums@flysnf.org. Comments: Name This field is for validation purposes and should be left unchanged. Δ × 2025 FUTURE ‘n FLIGHT FORUMS Registration for presentations scheduled in the Forums area in the Future ‘n Flight Plaza. \" * \" indicates required fields The Future ‘n Flight Forums have limited presentation space available.  Register your interest in this forum opportunity by completing the FUTURE ‘n FLIGHT FORUM submission below.  This Forums Tent is surrounded by our Career Fair, Innovations Showcase Tent, Flight Sim Experience Center and Junior ACES STEM Activity Tent. If you have a forum that focuses on one of those categories, the Future ‘n Flight Forums Tent is the perfect place to reach your audience. Presentation space will be limited. Your Future ‘n Flight Forum participation will be confirmed by the Future ‘n Flight Forums scheduler. Future 'n Flight Presentation Submission Forum Title: (Please limit to 50 total characters & spaces) * Forum Presenter's Name: (Please limit to 35 characters & spaces) * Event Promotion Presenter's Bio ** 50 words or less ** Provide Presentation Photo/Graphic Max. file size: 256 MB. Provide a Brief Overview of this Presentation. Your presentation may be chosen for event promotion. Forum Schedule Details Please remember that our forums experience is not a sales or promotional opportunity, education-based forums only.  You may select up to three presentation days.  Thank you! Preferred Day – First Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Day – Second Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Day – Third Presentation * Tuesday Wednesday Thursday Friday Saturday Preferred Time of Presentations: * 9:00 a.m. 10:00 a.m. 11:00 a.m. 12:00 p.m. Other Forum Information Equipment Needed: None Powerpoint Projector (VGA input or VGA adapter req.) Laptop (USB or VGA input) DVD Player Sound System Does this forum qualify for any of the aviation tracks listed below: (choose all that apply) * Career Flight Simulation Innovations Maintenance Youth Other: Define in Comments Below! Will this forum qualify for any of the following?  (click all that apply) FAA Wings Credit FAA/IA Renewal Program Program Certificate Education Credit Presenter's Contact Info Space provided for both Presenter and Submitter information, if different. Company Name (if representing a Company) Presenter's Name * Presenter's Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Primary Phone: * Presenter's Email: * Submitter's Name if different from Presenter Submitter's Cell Submitter's Email Schedule Changes We want to accommodate your Future ‘n Flight Forum schedule as requested. Please keep us informed of any schedule changes or cancellations. If you have to cancel, please let us know as soon as you can, so we have the opportunity to fill the schedule with another presentation. It is very important that we provide the most accurate event schedule information to our guests. Please send schedule changes to jschneider@flysnf.org. Comments: CAPTCHA Email This field is for validation purposes and should be left unchanged. Δ × test Δ × Preferred Airshow Seating (Purchase of SUN ‘n FUN Admission is also required.) Enjoy the airshow up close and personal… The Preferred Airshow Seating Area is north of the Manufactured Display exhibit area and west of the chalets along the airshow line. Your purchase will provide access to seating, restrooms, some shade (not all areas are shaded), bag storage, and complimentary water during the daily airshow. Food and beverages, including beer, will also be available for purchase! If you plan to experience the Preferred Seating area, there is no need to bring your chairs, they are provided. Umbrellas are NOT permitted. Single Day Preferred Airshow Seating can be purchased online, please make sure you choose the ticket for the day you intend to be at SUN ‘n FUN. Preferred Airshow Seating tickets are day-specific and will be honored for the day purchased only. Night Airshows: Purchase of a $35 ticket (per person) allows for all-day access to the Preferred Seating Area, including the night airshows on Wednesday and Saturday nights. Regular tram schedules are unavailable after 8 p.m. – Preferred Seating Area does not provide seating for the Tuesday night concert that will be held on the Warbird ramp. Entry to the Preferred Airshow Seating for Children 6 and under is free, however, all guests are required to have a convention admission wristband, including children 6 and under. × Preferred Photo Seating Purchase of SUN ‘n FUN Event Admission is also required.) New Location – Northeast side of Warbird Ramp Exclusive Photo Area with access to elevated bleachers providing unobstructed photo shooting opportunities. Preferred Photo Seating Area does not include any benefits for the Tuesday night concert. This Preferred Photo Seating area is for flightline and daytime airshow viewing only. × What’s Included In Your SUN ‘n FUN Single Day or Weekly Ticket? Opening Day Concert Daily Airshow Wednesday / Saturday Night Airshow & Fireworks Celebration Access to the Showplanes on the Flightline Over 500 Aviation-Focused Exhibitors Static Military Aircraft and Demonstration Flights Access to the Pilot Welcome Center Fly-By Showcase Educational & FAA Forums, Workshops, and Seminars Museum Lectures Evening Movies and entertainment programs Shuttle Transportation throughout the Campus Admission to the Florida Air Museum Access to the Jerry Holland Aviation Playground Daily aircraft parking × Member Admission Purchase SUN ‘n FUN provides general admission ticket discounts to individuals who are current members or belong to any of these Aviation Member Associations, Chapters, or Groups listed below. SUN ‘n FUN has provided each Aviation Member Association, Chapter or Group with a unique discount code for their members. This discount code is required to purchase member-discounted admission tickets online (this includes FAM and EAA). A member ID card is required at the ticket window for an on-site redemption or purchase. Members can purchase one additional single-day or weekly ticket at the member’s rate. Additional admission tickets are available for purchase at the non-member rate. This code will NOT discount camping or any upgraded ticket, discounts apply to general admission tickets only! Please review the list below to confirm your organization’s participation, then contact their member’s offce to request the member discount code. Discounts are also available to Licensed Pilots, Licensed Aircraft & Powerplant Mechanics, and Active/Retired members of the U.S. Military. Contact SUN ‘n FUN for discount information. Approved Member Organizations for General Admission Discounts Academy of Model Aeronautics – AMA Aircraft Owners & Pilots Association – AOPA Air Line Pilots Association Int’l – ALPA Allied Pilot Association – APA American Institute of Aeronautics and Astronautics – AIAA Antique Airplane Association – AAA Canadian Owners & Pilots Association – COPA Civil Air Patrol, Florida Wing – CAP Commemorative Air Force – CAF Experimental Aircraft Association – EAA Florida Air Museum (Support ACE/SNF) – FAM Florida Antique Biplane Association – FABA Florida Cub Flyers – FCF Florida Sport Aviation Antique and Classic Association – FSAACA International Council of Airshows – ICAS National Association of Flight Instructors – NAFI National Business Aviation Association – NBAA OX-5 Aviation Pioneers – OX5 Quiet Birdman, Inc. – QB’s Retired Airline Pilots of Canada – RAPC Seaplane Pilots Association – SPA Silver Wings Fraternity – SWF Society of Aviation and Flight Educators – SAFE The Ninety-Nines, Inc. / The Friends of the Ninety-Nines – 99’s Ultralight Pilots Association of Canada – UPAC U.S. Power Paraglider Association – USPPA U.S. Ultralight Association – USUA Warbirds of America – WBA Women in Aviation – WIA All members must be prepared to show proof of current membership (current membership card or I.D.) when redeeming an online ticket or when purchasing admission at any onsite ticket sales location. × Scroll to Top"
    },
    {
      "url": "https://www.stuartairshow.com/",
      "text": "Stuart Air Show Skip to Content Open Menu Close Menu About Our Mission Community Impact Meet the Team Newsletters Event Info Aerobatic Performers Tickets Static Performers Show Location FAQ Partners Sponsor Exhibitors and Vendors Scholarship Contact 0 0 TICKETS About Our Mission Community Impact Meet the Team Newsletters Event Info Aerobatic Performers Tickets Static Performers Show Location FAQ Partners Sponsor Exhibitors and Vendors Scholarship Contact 0 0 TICKETS Open Menu Close Menu Folder: About Back Our Mission Community Impact Meet the Team Newsletters Folder: Event Info Back Aerobatic Performers Tickets Static Performers Show Location FAQ Folder: Partners Back Sponsor Exhibitors and Vendors Scholarship Contact TICKETS November 7-9, 2025 Embrace the Skies: Celebrating 36 Years of the Stuart Air Show Support the Community and Elevate Your Brand: Become a Proud Partner of the Stuart Air Show MORE INFO Treasure Coast High School’s AFJROTC have been dedicated volunteers for the Stuart Air Show for years, and this donation will support their program—including this year’s military ball. HotShots, a youth shooting team and dedicated Stuart Air Show volunteers, receive a check in appreciation of their support! Subscribe Get the latest news out of the Stuart Air Show Email Address Sign Up We respect your privacy. Thank you! PLEASE BE AWARE! You have reached the official Stuart Air Show website. Please beware of Stuart Air Show impersonators creating fake events, groups, and comments on social media. Your go-to source for accurate info is this website, stuartairshow.com. Please do not click any links related to the air show that is not stuartairshow.com. THANK YOU TO OUR TITANIUM PARTNERS FOR YOUR SUPPORT: THANK YOU TO OUR GOVERNMENT PARTNERS FOR YOUR SUPPORT: SHOW LOCATION Witham Field  | 1895 Flying Fortress Ln  |  Stuart, FL 34996 Stuart Air Show Administrative Office 2440 SE Federal Hwy. Suite 200 | Stuart, FL 34994 | 772-781-4882 operations@stuartairshow.com Stuart Air Show Policies Copyright © 2025 Stuart Air Show. Photography by: Matt Haskell, Jackie Hernandez, Wayne King, Bill LaFlame, & Christopher E. Oliver. Video by: Kyle Newsom"
    },
    {
      "url": "https://www.floridaairshow.com/florida-international-air-show-set-to-soar-november-12-2025-blue-angels-f-16-viper-demo-and-family-attractions-headline-usa-today-10best-air-show",
      "text": "Florida International Air Show Set to Soar November 1–2, 2025 Blue Angels, F-16 Viper Demo, and Family Attractions Headline USA TODAY 10BEST Air Show ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT 2025 Florida International Airshow: November 1 & 2, 2025 ATTRACTIONS On The Ground Innovator 's Stem Pavilion US Navy Blue Angels F-16 Viper Demo Team Aaron Deliu Warbird Thunder The Chuters - Jump Team Doug Litton DREAM BIG ENTERTAINMENT GET INVOLVED SPONSORSHIP & VENDOR OPPORTUNITIES VOLUNTEER INNOVATOR'S STEM PAVILION SPONSORS ABOUT MISSION TEAM NEWS ACCOMMODATIONS & ATTRACTIONS FAQs CONTACT Buy Tickets Rent Chairs May 9, 2025 Florida International Air Show Set to Soar November 1–2, 2025 Blue Angels, F-16 Viper Demo, and Family Attractions Headline USA TODAY 10BEST Air Show Punta Gorda, FL — May 7, 2025 — The skies over Southwest Florida will roar to life this fall as the Florida International Air Show returns to Punta Gorda Airport on November 1–2, 2025 , with an exhilarating lineup headlined by the U.S. Navy Blue Angels and the F-16 Viper Demo Team . This year’s show features a dynamic mix of aerial precision, vintage power, and heart-pounding stunts with performers including Warbird Thunder , Aarron Deliu , Doug Litton , and the thrilling parachute team The Chuters . New for 2025, the Air Show proudly introduces two family-friendly attractions : The Innovators STEM Pavilion – a hands-on zone to engage students and families with science, tech, and aviation. The Family Aviation Experience – a fun, interactive area designed to inspire future aviators and entertain all ages. Voted a USA TODAY 10BEST Air Show in America for the second consecutive year , this world-class event continues to attract aviation fans, families, and thrill-seekers from across the country. Tickets go on sale to the public at noon on May 23, 2025 . For performer updates, and opportunities to sponsor , vend , or exhibit , visit www.floridaairshow.com or follow us on social media @florida_air_show. Don’t miss this high-flying celebration of aviation, innovation, and family fun! Media Contact: Steve Lineberry 941-626-0551 media@floridaairshow.com Florida International Air Show www.floridaairshow.com < Older Post Newer Post > Warbird Thunder to Appear at the Florida International Air Show, November 1-2, 2025 September 8, 2025 Punta Gorda, FL —                                               The Florida International Air Show is thrilled to welcome                                              Warbird Thunder                                               to its 2025 lineup, scheduled for                                              November 1–2                                               at the Punta Gorda Airport. This marks an electrifying return of the North American SNJ Texan — also known as “Ol Growler” — to Southwest Florida’s skies.                                                                                                 Warbird Thunder promises an awe-inspiring aerial performance, featuring two SNJ Texans soaring in formation with their signature roar, smoke trails, and engaging aerobatic maneuvers like formation loops, aileron rolls, barrel rolls, and Cuban Eights. The show concludes with stunning opposing aerobatics as the planes separate and then reunite for a dramatic finale.                                                                                                  “Warbird Thunder brings a unique mix of history, heritage, and heart-stopping aerobatics,” said                                              Denise Dull, President of the Florida International Air Show                                  . “When those Texans thunder overhead, it’s not just entertainment — it’s a living tribute to the aviators who paved the way for modern flight. We are honored to share that experience with our community.”                                                                                     Highlights of the 2025 Florida International Air Show include:                                                                                 Dynamic performances by the                                                  U.S. Navy Blue Angels                                                   and the                                                  F-16 Viper Demo Team                                                                         A versatile roster of acts, including                                                  Aarron Deliu                                                   ,                                                  Doug Litton                                                   , and                                                  The Chuters                                                   Jump Team                                                                                      Exciting new experiences like the                                                  Innovators STEM Pavilion                                                   and the                                                  Family Aviation Experience                                     , both designed to engage and inspire audiences of all ages.                                                                                                              Tickets On Sale Now:                                              floridaairshow.com                                                                                                  For media inquiries, sponsorship opportunities, or vendor information, contact                                              media@floridaairshow.com                                               or call                                              941-626-0551                                  .                                                                                     Don’t miss the power, prestige, and family fun of this award-winning event. Join us for a weekend where aviation’s past, present, and future take flight! The Chuters Jump Team to appear at the 2025 Florida International Air Show, Punta Gorda Airport November 1 & 2, 2025 August 29, 2025 PUNTA GORDA, FL —                                               With precision, courage, and patriotic pride, The Chuters Jump Team will thrill thousands of spectators as they soar into Punta Gorda Airport for the Opening Ceremonies of the Florida International Air Show, November 1st and 2nd, 2025.                                                                                                 The Chuters Jump Team is a professional parachute demonstration team, veteran-owned and operated, known for their breathtaking aerial jumps and flawless timing. Their performance will include a dramatic descent carrying the American flag, set against the backdrop of the National Anthem — a moment designed to inspire goosebumps and unite the crowd.                                                                                     “Nothing compares to the silence before the jump and the roar of the crowd when we touch down,” said Keith Walter, Director of Operations and has completed over 6000 jumps. “Being able to open such an incredible event with the American flag is an honor we never take lightly. It’s about celebrating freedom, service, and the thrill of flight.”                                                                                     Organizers say The Chuters set the perfect tone for a weekend filled with world-class aviation.                                                      “The Opening Ceremonies are always a special part of the show, and this year we’re taking it to the next level,” said Denise Dull, President, Florida International Air Show. “When The Chuters come streaming out of the sky, you feel the energy of the entire crowd shift. It’s patriotic. It’s powerful. And it reminds us why we gather to celebrate aviation, service, and community.”                                                                                     The Florida International Air Show has been a tradition in Charlotte County for more than three decades, drawing families, veterans, and aviation enthusiasts from across the United States. This year’s lineup features the U.S. Navy Blue Angels as headliners, along with the Viper F-16 Demo Team, thrilling aerobatic acts, military aircraft demonstrations, and static displays. Food vendors, kids’ activities, and community exhibits will round out a weekend of high-flying fun.                                                                                     “This isn’t just a show — it’s an experience,” added Steve Lineberry, Media and Publicity Director                                  .                                    “The Chuters remind us that aviation is as much about people as it is about planes. Their performance embodies courage, teamwork, and a sense of pride that resonates with everyone in attendance.                                                                                     Event Details:                                              Dates: Saturday, November 1st & Sunday, November 2nd, 2025                        Location: Punta Gorda Airport, Punta Gorda, Florida                        Tickets: On sale now at www.floridaairshow.com Reaching New Heights: Florida International Air Show and conCHAIRto Team Up May 9, 2025 Cleveland, OH – May 2025 – conCHAIRto, the premier provider of premium seating solutions for outdoor music festivals and live events, is pleased to announce a new partnership with the Florida International Air Show (FIAS), scheduled for November 1-2, 2025 in Punta Gorda, Florida.                                                                                                            As a valued partner for this event, conCHAIRto will provide comfortable, convenient and sustainable seating solutions that will allow spectators to comfortably experience the speed, sound and scale that only these aircraft can provide. The schedule includes exciting military and civilian performances and displays for audiences of all ages.                                                                                                            “As we expand our business reach into air show events,\" said Brett Smiley, President and Founder of conCHAIRto. \"I cannot think of a better partner than the Florida International Air Show. They have been exciting audiences for over 43 years and are rated one of the top 10 air show events in the world. We are here to elevate that experience even more.”                                                                                                            The disruptions caused by Hurricanes Milton and Helene forced the cancellation of the 2024 event, the first in its 43-year history. The Florida International Air Show has come back with a bang…or is that a sonic boom? Beginning as a brief single-day event with only a few acts, the show has grown into a multi-day event with family and fan-friendly activities, a large variety of acts, interactive displays and much more. The Punta Gorda Airport plays an integral role in the Air Show’s history — it has hosted the event since its inception.                                                                                                            \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community,\" Denise Dull, President of the Air Show.                                                                                                            Tickets for the 2025 Florida International Air Show go on sale on May 23. For more information and to purchase tickets, visit their official website.                                                                                                            About conCHAIRto:                                                      conCHAIRto is a premier provider of high-quality seating solutions, dedicated to enhancing comfort and style for various events and venues. With a focus on innovative design and exceptional craftsmanship, conCHAIRto delivers products that meet the highest standards of excellence.                                                                                                            For more information about conCHAIRto and its range of premium seating solutions, please visit conCHAIRto.com or email us at info@conchairto.com. 2024 FIAS Canceled Due to Hurricanes Milton and Helene October 14, 2024 Air Show Canceled Due to Hurricanes Milton and Helene                                                      [Punta Gorda, FL] –  In light of the significant impacts of Hurricane Milton and Hurricane Helene on the community, organizers have made the difficult decision to cancel the 43rd Annual Florida International Air Show. The dual hurricanes have caused widespread damage and disruption across the region, making it impractical to proceed with the event.                                                                                     \"Our community is facing tremendous challenges as we recover from the destruction caused by these two powerful storms,\" said Denise Dull, President of the Air Show. \"The safety of our attendees, vendors, and volunteers is our highest priority, and at this time, it is clear that the best course of action is to focus on supporting our community’s recovery efforts.\"                                                                                     Both hurricanes have resulted in extensive damage to homes, businesses, and essential infrastructure, with many residents still experiencing the impact of these events. As the region continues its recovery efforts, event organizers believe the community’s attention and resources are best directed toward rebuilding and aiding those affected by the storms.                                                                                     While the Air Show is an annual tradition that brings joy and excitement to the area, the decision to cancel was made out of an abundance of caution and care for the community’s well-being. Organizers are committed to bringing the event back stronger once recovery efforts are complete and the community is ready to come together in celebration.                                                                                     \"We are incredibly grateful to our sponsors, volunteers, and vendors who have worked tirelessly in preparation for this year’s event. Our community partners, PGD, Charlotte County Sheriff, Fire & EMS, are all committed to the safety of Charlotte County and its residents and we would not want to do anything that would create a larger burden on their workload during post hurricane rebuild,\" added Dull. \"We look forward to the November 2025 Air Show hosting the US Navy Blue Angels, where we can provide an amazing event in a way that reflects the strength and resilience of our community.\" Tickets will be refundable or may be exchanged for the 2025 Air Show. *Note the lower ticket price will be honored as we expect ticket prices will increase.                                                                                     For more information on how to assist in relief efforts, please visit www.coadfl.org                                                                                                  About The Florida International Air Show                                                                  The Florida International Air Show’s mission is to deliver a wholesome family entertainment event celebrating aviation past, present, and inspiring its future.                                                                                                  ﻿                        For further information or media inquiries, please contact: Steve Lineberry 941-626-0551 media@floridaairshow.com Experience the thrill of aviation at our award-winning event! October 14, 2024 The Florida International Air Show - This is One Air Show You Do Not Want to Miss! October 1, 2024 Southeast Tourism Society Selects Florida International AirShow  as a  “Signature Event of the Southeast” Award Winner August 12, 2024 PUNTA GORDA, FL. (August 14, 2024) –  Southeast Tourism Society (STS) has named the Florida International Airshow one of the Signature Events of the Southeast for 2024.                                                                                     This year’s Florida International AirShow is November 2-3. 2024 held in Punta Gorda, FL. Signature Events of the Southeast, formerly known as “Top 20 Festival and Event Awards”, was launched as part of the 40th Anniversary celebration of Southeast Tourism Society in 2023. STS has recognized events and festivals around the Southeast since 1985.                                                                                     Travel industry experts select top events to be highlighted for the year, and STS publicizes them throughout the United States. The complete list is published on both the Travel Media Press Room and Escape to the Southeast® websites and recognized on all Southeast Tourism Society’s social media platforms.                                                                                     The AirShow will celebrate its 43rd year of presenting exciting entertainment to residents and visitors of Charlotte County on the grounds of the Punta Gorda Airport. Beginning as a single day event, the show has grown to a three day event with fan-friendly activities, a large variety of acts, interactive displays, and much more. “If you’ve not been to an AirShow before, it’s like taking Nascar, pizza, baseball, hotdogs, fireworks, football and Lynyrd Skynyrd and rolling it all into one giant rodeo “says Denise Dull, President of the Florida International AirShow. “There’s something for everyone in the family.” The Florida International Airshow also received a USA TODAY 10Best Readers Choice Award this year for their November 2023 AirShow, which featured the USAF Thunderbirds and was a record attendance year.                                                                                     “For more than 40 years, STS has been spotlighting the best festivals and events in the Southeast. Our goal is to highlight the efforts of devoted event organizers and provide additional media exposure and accolades for their events,” said Monica Smith, President and CEO of Southeast Tourism Society. “The Southeast offers so many unique, year-round, opportunities for tourists and festival goers to create memories and support the tourism industry-–a vital economic generator for communities.”                                                                                     Events considered for the STS Signature Events of the Southeast recognition must be at least three years old and have an attendance of at least 1,000. Nominations open in early spring. Members and non-members are eligible to apply. Winning submissions are automatically judged in the Festival or Event of the Year category for STS’s Shining Example Awards.                                                                                     About Southeast Tourism Society                                                                   The Southeast Tourism Society (STS) is a not-for-profit membership association dedicated to the development of travel and tourism professionals and organizations within the southeast region. The association’s mission is to empower a diverse network of tourism professionals through Education, Advocacy, Recognition, and Networking. Member states include Alabama, Arkansas, Florida, Georgia, Kentucky, Louisiana, Mississippi, Missouri, North Carolina, South Carolina, Tennessee, Virginia, and West Virginia, plus the District of Columbia.                                                                                                              About Florida International Air Show                                                                               The Florida International AirShow is a Florida 501(c) 4 nonprofit organization staffed entirely by volunteers. The Airshow is a multi day event showcasing nationally known performers and exciting static displays of aircraft and vehicles. The Airshow offers attendees the opportunity to learn more about aviation, space, and military service. FIAS events provide beneficial exposure to the community and Punta Gorda Airport as a significant economic asset has donated over $3.6 million in contributions to local Southwest charities since its inception. For more information visit www.floridaairshow.com                                                                                                              Florida International AirShow                                                                               Denise Dull, President                                                                               941-626-9439                                                                               denisedull@floridaairshow.com                                                                  www.floridaairshow.com Air show expected to bring millions in revenue to Charlotte County July 2, 2024 BY NANCY SEMON                                   | JULY 2, 2024 | PHOTO CREDIT:FLORIDA INTERNATIONAL AIR SHOW Patrick Fuller: Hometown Hero Takes to the Skies By UBU BRANDS • November 10, 2023 Meet Patrick Fuller, Punta Gorda's Emergency Management Director, who recently found himself soaring through the clouds with the United States Air Force Thunderbirds, marking a high-flying chapter in his illustrious career.  Having dedicated four years to the Marine Corps and an additional twenty ye Important Event Details! FIAS 2023 By UBU BRANDS • October 24, 2023 The 2023 Florida International Air Show is only weeks away.  And we will be sending updates about all things 2023 FIAS AIr Show. Parking information, Schedule of Events and More!  Information that will make your 2023 FIAS Air Show Experience, Fun and Enjoyable. 1 (current) 2 Buy Tickets Florida International Air Show Hot Line 1.833.PGD-FIAS 1.833.743.3427 SPONSORS VOLUNTEER TEAM CONTACT The Florida International Air Show is a proud member of the ICAS International Council of Air Shows The Florida International Air Show is a proud member of the SECAS Southeast Council of Air Shows Charlotte County Chamber of Commerce Charlotte County, Florida Copyright © 2025 Florida International Air Show Website by: The Firm Advertising Agency Share by:"
    },
    {
      "url": "https://nautique.com/contact/",
      "text": "Contact Us | Nautique Boats Menu Dealer Download Brochure Design Your Nautique Models Why Nautique Company Careers Contact Us Find a Dealer Download Brochure Design Your Nautique Back All Models Wake & Surf Multi-Sport Ski Compare Boats G23 Paragon Explore | Design G25 Paragon Explore | Design Super Air Nautique G21 Explore | Design Super Air Nautique G23 Explore | Design Super Air Nautique G25 Explore | Design Super Air Nautique S21 Explore | Design Super Air Nautique S23 Explore | Design Super Air Nautique S25 Explore | Design Super Air Nautique GS20 Explore | Design Super Air Nautique GS22 Explore | Design Super Air Nautique GS24 Explore | Design Ski Nautique - New Explore | Design EXPLORE OUR MODELS Back The Nautique Difference Nautique Surf System Coastal Edition Engines JL Audio Overview Videos Awards New for 2026 Download Brochure Back Careers Press Releases History Timeline Made in America Book Team Nautique Nautique Network Nautique Cares Nautique Gear Nautique Events Stay Informed Contact Nautique Nautique Boat Company, Inc. 14700 Aerospace Parkway Orlando, FL  32832 USA Toll Free: 1-800-346-2092 Phone: 407-855-4141 Fax: 407-851-7844 Email: info@nautique.com Nautique Customer Care: Email: customer.care@nautique.com Direct: 689-837-0004 Marketing: Email: marketing@nautique.com Sales: Email: sales@nautique.com Human Resources: Email: careers@nautique.com Design Your Nautique Find a Dealer Download Brochure Stay Informed Overview Videos Desktop Images Newsletter MODELS Compare Boats Super Air Nautique G23\r\n                                            Paragon Super Air Nautique G25\r\n                                            Paragon Super Air Nautique G21 Super Air Nautique G23 Super Air Nautique G25 Super Air Nautique S21 Super Air Nautique S23 Super Air Nautique S25 Super Air Nautique GS20 Super Air Nautique GS22 Super Air Nautique GS24 Ski Nautique Discover New For 2026 The Nautique Difference Nautique Surf System Coastal Edition Engines JL Audio Awards Our Partners Factory Tours Owner Reviews Yacht Tender Company Careers Press Releases History Timeline Nautique Events Made in America Book Team Nautique Nautique Network Nautique Cares Nautique Gear Culture Pyramid Help & Support Owners Manuals Warranty Contact Us FAQ Find a Dealer Boat Safety Website Accessibility Privacy EULA Cookie Legal Access\r\n                        machine-readable files created and published by Anthem BCBS © 2025 Nautique Boat Company, Inc. All rights reserved."
    },
    {
      "url": "https://teamfim.com/contact-us/",
      "text": "Contact Us - Florida International Marketing Skip to content The Bridge Between Manufacturers, Distributors, and End Users About Us Who We Are Manufacturers We Represent Testimonials Contact Us Contact Us Reach Out to Us at Florida International Marketing Message FIM Contact Form Name * Phone * Email * Message * Fill out the form below with your name, phone, email, and brief message then click \"Send message to FIM\".  All messages are received by our inside sales team and will be responded to during normal business hours. Note: Messages by advertisers and phishing scams are typically ignored. Florida International Marketing Headquarters and Distribution Center 200 SW 12th Ave., Pompano Beach, FL 33069 Secondary Distribution Center 1201 NE 38 th St. Ste C1. Oakland Park, FL 33334 (954) 321-6643 (954) 321-1748 Monday - Friday: 8:00 AM - 4:30 PM (Office Hours) (954) 321-6643 (954) 321-1748 sales@teamfim.com Monday - Friday: 8:00 AM - 4:30 PM (Office Hours) Headquarters and Distribution Center 200 SW 12th Ave., Pompano Beach, FL 33069 Secondary Distribution Center 1201 NE 38 th St. Ste C1. Oakland Park, FL 33334 (954) 321-6643 (954) 321-1748 sales@teamfim.com Monday - Friday: 8:00 AM - 4:30 PM (Office Hours) Headquarters and Distribution Center 200 SW 12th Ave., Pompano Beach, FL 33069 About Us Who We Are Manufacturers We Represent Testimonials Contact Us © 2025 Florida International Marketing Scroll To Top"
    },
    {
      "url": "https://airtoairinc.com/contact/",
      "text": "Request a Quote – Air to Air – Jacksonville, FL - Air to Air, Inc. Skip to content Services Residential Replacement & Installation Commercial Replacement & Installation HVAC Service & Repair Custom HVAC for New Construction Air Purification Financing Contact Services Residential Replacement & Installation Commercial Replacement & Installation HVAC Service & Repair Custom HVAC for New Construction Air Purification Financing Contact 904-262-4279 Call us today Get A Quote Services Residential Replacement & Installation Commercial Replacement & Installation HVAC Service & Repair Custom HVAC for New Construction Air Purification Financing Contact Services Residential Replacement & Installation Commercial Replacement & Installation HVAC Service & Repair Custom HVAC for New Construction Air Purification Financing Contact AIR TO AIR INC. Save Thousands on a New System — Get Another Quote Today. We provide full-service HVAC and air conditioning solutions for residential and commercial properties throughout Jacksonville. Call Today  |  904-262-4279 Get a Free Quote Keep your home cool and AC at peak performance with expert service, installation, and repairs. Replacement & Installation Repair & Service Air Purification Custom HVAC New Construction Flexible Financing Get A Free Quote Licensed & Insured Family-Owned 23+ Years Experience Fast & Reliable HVAC Service and Repair Prompt, professional HVAC service to restore your comfort quickly. After-Hours Emergency Service & Repair Expert technicians available when you need them most—day or night. Filters + Replacement Equipment Quality filters and efficient HVAC equipment upgrades for cleaner air and greater savings. Don’t take our word for it. Hear what our customers are saying First Coast residents have trusted Air to Air inc for 23+ years to deliver reliable, outstanding service for their heating and air conditioning needs. Very grateful to get on the schedule same day, regardless of the window of time. Especially in this Florida heat!! Most companies are days to weeks out. The technician did a wonderful job with changing out my bad thermostat and he handled everything professionally. Now my house is cooling. Great job Air to Air team! Joyce McDonnell Quick service, great price and a quality system. They did everything they said they would on the quote. They had provided a great Carrier system for a great price – installed quickly and they set everything up right away. It is great when a company does exactly what they say they would. I appreciate having no worries upon completion. Tim Buist The air conditioning went out unexpectedly this morning. As someone who works from home, I’m greatly appreciative of the quick response and resolution. Chelsea got me scheduled for today, and Chris was amazing. He quickly diagnosed the problem, explained what happened, fixed the issue and the air-conditioning is working. Carl Naso Air to Air has got to be the most responsive A/C company I have ever dealt with since moving to Florida. I came home to find a huge water leak/backup late in the afternoon. They scheduled a service call for me and I received same day service. The technician was excellent. Sharon Clark Air to Air came out and got us all fixed up. They did not try to sell us anything, just got our problem fixed up and the house cooling again. I would highly recommend. Jason Daniels Our Story & Mission Air to Air started as a small two‑person shop on Jacksonville’s Southside. Founder Rick Howard believed homeowners deserved straight answers and quality craftsmanship—values he learned working on aircraft where shortcuts weren’t an option. Those principles shaped our mission: “Provide quality indoor air comfort for our Northeast Florida friends at competitive rates, respond promptly when called, and treat every customer with honesty, respect, and integrity.” Today the team serves Duval, St. Johns, Clay, and Nassau counties, bringing the same neighbor‑first attitude to every repair, replacement, and new‑construction project. Credentials & Differentiators State-Licensed\nHVAC Contractor (Florida) Techs trained on all major brands & current refrigerant safety standards Ongoing professional development keeps our crew up to date with evolving Florida codes Design‑Build  Expertise We handle load calculations, duct planning, and equipment sizing in‑house, simplifying coordination. Neighborhood Based Dispatch Technicians start the day in trucks assigned to key areas of Jacksonville for faster response. Community & Recognition BBB A+ Rating—a reflection of long‑term customer satisfaction. Hundreds of 5‑Star Google Reviews —thanks to homeowners across Northeast Florida. Proud supporter of local youth sports and seasonal community fundraisers. We’re your trusted air conditioning contractor near you — local, licensed, and ready when you are. Fast, reliable air conditioning service from Jacksonville’s local HVAC experts—fully licensed technicians who respond quickly, keep your system running smoothly, and ensure your home stays comfortable year-round. Call (904) 262-4279 AREAS We Serve Local HVAC Services in Jacksonville Whether it’s a repair in Riverside or a new system in Nocatee, we deliver tailored service with honest pricing and local reliability. Duval County Saint Johns County Clay County Nassau County Jacksonville & Beaches and surrounding areas Fernandina Beach and surrounding areas Orange Park and surrounding areas Fleming Island and surrounding areas Jacksonville & Beaches and surrounding areas Fernandina Beach and surrounding areas Orange Park and surrounding areas Fleming Island and surrounding areas Ponte Vedra & Nocatee and surrounding areas Saint Augustine & Beaches and surrounding areas Saint Johns & World Golf Village and surrounding areas Green Cove Springs and surrounding areas COMMON QUESTIONS Frequently Asked Questions Get expert answers about our HVAC service process, timeline, and service guarantees. What’s the average cost to replace an AC in Jacksonville? Expect $6,500–$12,000. We provide no-pressure estimates. Do you offer financing? Yes. Flexible plans, low-credit options, and fast approvals. Do you handle commercial HVAC? Yes — we install and service light commercial systems. Can I get a maintenance plan? Yes — annual service plans include tune-ups and scheduling priority. What are signs I might need AC replacement? High bills, uneven temps, or frequent repairs are key signals. Still have questions? Can’t find the answer you’re looking for? You can get in touch our friendly team. Get in touch with A Pro Keeping Jacksonville comfortable for 23 years. Request a free quote Email us (904) 262-4279 Locations we serve For 23 years, Air to Air has delivered dependable HVAC service and energy-efficient solutions, keeping Jacksonville homes comfortable year-round. What We Do Service & Repair Air Purification Residential Replacement Commercial Replacement Custom Homes New Construction Company About Financing Contact About Financing Contact Request a free quote Subscribe Privacy Policy Terms & Condition 2025 © Air to Air Inc. All Rights Reserved. \nLicense number: CAC1815206 [aioseo_local_business_info]\n[aioseo_local_opening_hours] Residential & Commercial HVAC Service & Repairs 🛠️ Installation & Replacement 🏘️ Custom HVAC & New Construction 🍃 Air Purification 🏦 Financing 💬 Contact Residential HVAC ⚙️ Service & Repairs 🛠️ Installation & Replacement Commercial HVAC ⚙️ Service & Repairs 🛠️ Installation & Replacement Need installation, service, or repair? 📞 Call (904) 262-4279 Get a free quote 👉"
    }
  ]
}