{
  "fuentes": [
    {
      "url": "https://www.riverbendcattlecompany.com/pages/contact",
      "email": "info@riverbendcattlecompany.com"
    },
    {
      "url": "https://floridasandmusicranch.com/contact-us/",
      "email": "office@willmcleanfacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/contact-us/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/sunshine-hootenanny-2/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/ems-spring-bluegrass-fest/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://floridasandmusicranch.com/camping-rates/",
      "email": "office@willmcleanfacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/camping-rates/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/ammenities/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/events-calendar/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/florida-winter-music-festival/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "administrativedirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "communications@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "culturalengagement@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "innovationliaison@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "managingdirector@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "programcoordinator@communityartsmentorship.com"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "email": "sponsorship@communityartsmentorship.com"
    },
    {
      "url": "https://floridasandmusicranch.com/",
      "email": "office@wmffacilities.com"
    },
    {
      "url": "https://floridasandmusicranch.com/history-of-the-ranch/",
      "email": "office@wmffacilities.com"
    }
  ],
  "mails": [
    "administrativedirector@communityartsmentorship.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "communications@communityartsmentorship.com",
    "culturalengagement@communityartsmentorship.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "info@riverbendcattlecompany.com",
    "innovationliaison@communityartsmentorship.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "managingdirector@communityartsmentorship.com",
    "office@willmcleanfacilities.com",
    "office@wmffacilities.com",
    "productions@diamondheadtheatre.com",
    "programcoordinator@communityartsmentorship.com",
    "rtandal@diamondheadtheatre.com",
    "sponsorship@communityartsmentorship.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "floridasandmusicranch.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.riverbendcattlecompany.com/pages/contact",
      "text": "Contact Us - Riverbend Cattle Company Skip to content Your cart is empty Continue shopping Have an account? Log in to check out faster. Beef Bundles & Beef Shares Beef Bundles & Beef Shares Your cart Loading... Estimated total $0.00 USD Taxes, discounts and shipping calculated at checkout. Check out SHOP OUR $149 NEW CUSTOMER INTRO BUNDLE JOIN THE RANCH CLUB - SUBSCRIBE  & SAVE $25 - CODE: RANCHCLUB10 FREE SHIPPING ON ORDERS OVER $249 - ACROSS THE SOUTHEAST EVERY TUES. SHOP OUR DRY-AGED BEEF HERE AT THE RANCH, OR HAVE IT SHIPPED EVERY TUES. TO YOUR DOOR! ASK US ABOUT QUARTER, HALF & WHOLE STEERS! Shop Online Shop Online Dry-Aged Beef Beef Bundles Subscriptions Quarter, Half & Whole Steer Pasture Raised Pork Spices & Honey Goods &  Apparel Gift Cards Shop The Ranch About Us About Us Our Story Photos & Videos Our News Resources Resources Antibiotic & Hormone Free Our Cattle Dry Aging Process Customer Reviews FAQs Shipping Recipes Contact Log in Facebook Instagram YouTube Shop Online Dry-Aged Beef Beef Bundles Subscriptions Quarter, Half & Whole Steer Pasture Raised Pork Spices & Honey Goods &  Apparel Gift Cards Shop The Ranch About Us Our Story Photos & Videos Our News Resources Antibiotic & Hormone Free Our Cattle Dry Aging Process Customer Reviews FAQs Shipping Recipes Contact Search Log in Cart Give Us A Hollar! Contact Us Have a question for us? Just let us know below and we will get back to you! (352)230-6147 Email Us Contact form Name Email * Phone number Comment Send Riverbend Cattle Co. 11225 E. Bushnell Rd. Floral City, Florida 34436 Directions Recent Articles View all The Ultimate Backyard BBQ Checklist – From Gril... There’s nothing quite like the sizzle of premium Riverbend Cattle Company beef on the grill, the aroma of smoky goodness in the air, and friends and family gathered together for... The Ultimate Backyard BBQ Checklist – From Gril... There’s nothing quite like the sizzle of premium Riverbend Cattle Company beef on the grill, the aroma of smoky goodness in the air, and friends and family gathered together for... Steak Smackdown: Grilling vs. Pan-Searing Debated When it comes to cooking Riverbend Cattle Company’s pasture-raised, dry-aged steaks, there’s no shortage of strong opinions. Some swear by the primal allure of grilling over open flames, while others... Steak Smackdown: Grilling vs. Pan-Searing Debated When it comes to cooking Riverbend Cattle Company’s pasture-raised, dry-aged steaks, there’s no shortage of strong opinions. Some swear by the primal allure of grilling over open flames, while others... Fridge vs. Counter: The Safe Way to Thaw Meat One of the most common questions we hear at Riverbend Cattle Company is, “Can I just thaw beef on the counter?” The short answer is a firm no. While it... Fridge vs. Counter: The Safe Way to Thaw Meat One of the most common questions we hear at Riverbend Cattle Company is, “Can I just thaw beef on the counter?” The short answer is a firm no. While it... 1 / of 3 View all Subscribe To Our Emails Subscribe to our mailing list for updates from around the farm, new recipes, and our weekly specials. Email 11225 E. Bushnell Rd., Floral City, FL 34436 Directions Quick Links Shop Online Shop The Ranch About Us Resources Recipes Contact Store Info. Confusion Disclaimer Shipping Information Privacy Policy Refund Policy Terms of Service & Use Facebook Instagram YouTube Payment methods American Express Apple Pay Diners Club Discover Google Pay JCB Mastercard PayPal Shop Pay Venmo Visa © 2025, Riverbend Cattle Company Privacy policy Refund policy Terms of service Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://floridasandmusicranch.com/contact-us/",
      "text": "Contact Us – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Contact Us To Contact Florida Sand Music Ranch Call 813.699.4096 Email us Location 85 Myers Rd Brooksville FL 34602 Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/sunshine-hootenanny-2/",
      "text": "Sunshine Hootenanny – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Sunshine Hootenanny April 10-12, 2025 .. Contact : Ticket Information Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/ems-spring-bluegrass-fest/",
      "text": "EMS Spring Bluegrass Fest – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program EMS Spring Bluegrass Fest Florida's Oldest Bluegrass Fest Contact Information www.evansmediasource.com . Phone  386-385-3500 Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://floridasandmusicranch.com/camping-rates/",
      "text": "Camping Rates – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Camping Rates Welcome to the Ranch. We are open 24 hours a day, 7 days a week. Reservations are not required, but recommended for groups of 20 or more. If you are a Youth Group or an Event inquiring on camping dates,  please call (813) 699-4096 .  or email office@wmffacilities.com Primitive Camping Site 4 persons max/per night: $20.00 * Additional Persons: $5.00 * Water & Electric Site 4 persons max /1 night: $35.00 * Additional Persons: $13.00 * *Taxes included Dump Station use is $15 Walk in/day use: per person: $5.00 * Camper Storage is at the discretion of the Florida Sand Music Ranch Campground Manager. All arrangements must be made through the Campground Manager no exceptions. Rates are $11 per night for non-electric and $22 per night for electric. Special Music Festivals Events are held here that are NOT Florida Sand Music Ranch events. These events are hosted by event companies. Most require advance registration for water & electric and are not at regular Ranch pricing. Please check the event calendar often as most are usually posted in advance. All other weekdays and weekends are for regular camping. Rentals *Large Pavilion Rental per day: $350.00 inlcudes tax( click for picture ) Small Pavilion Rental per day: $150.00 includes tax ( click for picture ) Kitchen Rental: please inquire *Our large pavilion is great for your weddings, events or family reunions! We have big demand for this, so if you want to rent it, plan in advance! Leases and Booking For full or partial park leases, Tammy at (813) 699-4096 or email office@willmcleanfacilities.com Please fill out this form Rental request form Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/ammenities/",
      "text": "Amenities – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Amenities Reservations for camping are not required, however festivals may rent the ranch. Please check the events calendar for open dates and for sites during festivals. To make reservations for group camping or other Florida Sand Music Ranch questions Ranch phone number (813) 699-4096. or email office@wmffacilities.com Our Facilities Include: Over 200 campsites with water and electric hookups Check here for pricing Primitive Sites Check here for pricing 60′ x 125′ pavilion with a stage Photo 30′ x 50′ enclose-able pavilion with patio-fire pit Photo Open Pavilion Photo Restrooms with hot showers (Handicapped available) Fire Rings throughout many campsites. 70+ picnic tables RV dump station (for a $15 fee) Playground Large grass field for sports activities - when not flooded Acres of woods with walking paths Spring fed creek Local Dump Station At Flying J at I-75 and SR 52/ Fee $10, Good Sams Member $7.50 Register Chevrolet,14181 Cortez Blvd, Brooksville Pitch a Tent? Set up your tent in our wilderness area or beside the creek which runs down to the lake. Experience camping like in the old days, but with the convenience of hot showers and indoor bathrooms. Check here for pricing Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/events-calendar/",
      "text": "Events Calendar – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Events Calendar Hurricane Milton Recovery Information and Donations Welcome to Florida Sand Music Ranch. We are open 24 hours a day, 7 days a week. Please check on the calendar below for special events. These events are not hosted by Florida Sand Music Ranch and are hosted by event companies. Most of these require advance registration for camping and are not at the Ranch pricing. Please click on the event in the event calendar for more information or Visit the page for the individual event.  Please direct any questions for the festivals to that event staff.  The event contacts are also listed below the calendar If your organization is interested in renting Florida Sand Music Ranch please FILL OUT THIS FORM All other weekdays and weekends are for regular camping. Reservations are not required for these open week days or weekends.  Please give us a ring at 352.754.3082 . FOR FESTIVALS AND EVENTS! NOTE: Florida Sand Music Ranch does not select or solicit for vendors. Vendors are chosen by the Festival promotors listed below. If you are solicited by someone else it is a SCAM September 5 -8, 2025 Labor Day Weekend at the ranch; discounted camping. NO FIREWORKS October 17-19, 2025 Camping with the Blues 941-758-7585 or info@campingblues October 24-25, 2025 Minimesarius November 6-9, 2025 Florida Winter Music Festival November 13-15, 2025 Sunshine Hootenany Novemebr 20-22, 2025 Cornucopia November 27-20, 2025 Thanksgiving Bluegrass Festival December 26 - Jan 1, 2026 Join the community, be part of the friends and family at the Ranch. January 15-18, 2026 Hangcon January 23-25, 2026 Annual Will McLean Membership Meeting Become a Member January 29-31, 2026 Antemesaris February 4-8, 2026 Florida Americana Music Festival February 18-21, 2026 Whippersnap March 13- 15, 2026 Will McLean Festival March 20-22, 2026 Blues Bash at the Ranch March 25-29, 2026 EMS Bluegrass April 9-11, 2026 Sunshine Get Down April 16-19, 2026 Rock & Roll Revival April 24-25, 2026 Gone Country at the Ranch To Learn more about The Soggy Bottom Bluegrass group. Visit the Facebook page . Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/florida-winter-music-festival/",
      "text": "Florida Winter Music Festival – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Florida Winter Music Festival Information Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://www.communityartsmentorship.com/our-team",
      "text": "OUR TEAM | CAMP top of page Home ABOUT OUR TEAM JOIN THE TEAM PROGRAMS TACT URBAN ARTS NORTHERN LIGHTS BLUEGRASS MUSIC CAMP GIRLS ROCK THE NORTH YOUTH MUSIC CAMPS RESIDENCIES CULTURAL FOUNDATIONS MUSIC IN SCHOOLS ARTS EXPLORATION TOUR SOA FIDDLE MENTORSHIP CURRICULUM DEVELOPMENT HIP HOP COLLABORATION MUSIC TEACHER MENTORSHIP CONTACT NEWS DOYLEFEST LINEUP AND TICKETS ABOUT GET INVOLVED GALLERY CONTACT PAST PERFORMERS DONATE Our Team. Rooted in the arts. Experts in various fields, working together to share their talents in communities across Saskatchewan. Eliza Doyle managingdirector@communityartsmentorship.com Co - Founder / Managing Director Eliza is a professional musician, songwriter and recording artist, teacher, community advocate, leader and is the co-founder behind Saskatchewan’s arts organization, C.A.M.P; Community Arts Mentorship Program. Her focus on fostering the arts while supporting local community capacity to deliver arts programming has been welcomed throughout communities in Saskatchewan. Offering services to remote and under-served communities presents new challenges, and all of CAMP programming serves to mitigate these obstacles. Familiar with the arts and music industry in Saskatchewan, she also aims to provide the opportunity and mentorship available to people with challenges in access due to location and lack of resources. Holly Rae Yuzicapi culturalengagement@communityartsmentorship.com Co - Founder / Cultural Consultant The co-founder of CAMP and a proud Dakota/Lakota from the Standing Buffalo Dakota Nation in Treaty 4 Territory, Saskatchewan.  Holly grew up in the beautiful Qu'Appelle valley.  Coming from a large family, Holly has been able to observe and learn from many generations of the Goodwill and Yuzicapi families.  The strength of her sense of identity was nurtured and shaped by her family and community.  Without realizing it at the time, Holly started doing cultural arts sharing from a young age which really is rooted in participating in powwow dancing and attending other cultural events on a regular basis.  She has evolved into an independent natural materials artist that loves to facilitate cultural arts engagement opportunities to all audiences.  Holly is proud of how she was raised and is very thankful for all that her family has taught her.  Respectfully representing the spirit and potential of those teachings is why Holly does the work that she does.  It is how she chooses to honour her family. LJ Tyson Kimbley innovationliaison@communityartsmentorship.com Innovation Liaison LJ Tyson is a singer-songwriter from Prince Albert, Saskatchewan. The has used his identity as inspiration for creating lyrics and melodies. LJ has had music played across Canada and beyond. His latest release Home On A Rainbow was critically acclaimed and awarded a prize from SOCAN TD Indigenous Songwriter Awards. LJ currently works as Innovation Liaison for Community Arts mentorship program, bringing music to remote and underserved communities. Steph Cameron administrativedirector@communityartsmentorship.com Administrative Director Saskatchewan-based artist Steph Cameron has gained recognition for her unique take on contemporary Americana music, lively instrumentation, and captivating lyrics. From her early days of busking, she has become an internationally touring professional recording artist. Her critically acclaimed debut album, Sad-Eyed Lonesome Lady, released on Pheromone Recordings in 2014, was nominated for the Polaris Music Prize and praised as the #1 Canadian album of that year by PopMatters, while No Depression called it \"a stunning debut.\" This success led her to join the Paquin Artist Agency and embark on national tours. Her expertise in performing is the real world experience CAMP participants benefit the most from . Zoe Slusar programcoordinator@communityartsmentorship.com Program Coordinator Zoe Slusar was the voice actress for Kid Goku in the English dubs of the Dragon Ball and Dragon Ball GT anime, done by Blue Water Studios. She also provided the voice of Sai Saici in Kidou Butouden G Gundam, as well as the video game Gundam: Battle Assault 2.\n\nZoe also voiced the character Jungo in the Flemish created series.\n\nZoe, also known by her stage name ZHE the Free, released her first rap EP album titled The Love EP in September 2020. This album charted #1 on 90.9 CJSW in Calgary, Alberta in November 2020. Mitchell Dureault programcoordinator@communityartsmentorship.com Program Coordinator Mitch Dureault is a seasoned professional music instructor and traditional musician, who comes from the Treaty 4 Territory of the southern Saskatchewan prairies. Currently sitting as a board member, and working instructor for C.A.M.P., Mitch is an advocate for the arts and has a strong focus on decolonizing his own music & teaching practices. He regularly draws from his B.A. in International Studies while working with and aiding organisations, communities, and schools in the development and implementation of equitable and continual art programming throughout the province. Mitch is also very passionate about the promotion and preservation of the local culture of Saskatchewan fiddling and has been making efforts to visit and interview as many fiddlers as possible from across the province for his Saskatchewan Fiddle History Project, a multi-year project in which he collects stories, tunes, and histories from these individuals in an attempt to preserve and document the ever evolving diverse intricacies of the provinces fiddling culture. Jille Shotton communications@communityartsmentorship.com sponsorship@communityartsmentorship.com​ Marketing and Communications Director\\ Sponsorship Jille Shotton joined the Community Arts Mentorship Program in 2024 as the Marketing and Communications Director, bringing a decade of experience in festival marketing, promotions, and community building within Saskatchewan's arts and culture sector. Her background includes managing marketing, communications, sponsorship, and onsite operations for events such as the Northern Lights Bluegrass & Old Time Music Festival, Winterruption, Ness Creek Music Festival, Fiddlyness, Shivering Strings and the Children's Festival of Saskatchewan. Jille is passionate about strengthening communities through the arts, having organized open jams, Bluegrass Brunch, radio shows, and various events and festivals. Her work focuses on creating inclusive, vibrant spaces where the community can connect and thrive. Lillanohna Naytowhowcon President LILI, an Indigenous singer, songwriter, and recording artist hailing from Sturgeon Lake First Nation in Saskatchewan, blends her passion for music and independent songwriting. She is actively engaged in community projects that celebrate and honour Indigenous culture through a fusion of traditional Cree songs, indie rock, folk, hip-hop, and dance music. In 2024, expect the release of her music under the esteemed blessed-street record label, marking a significant chapter in her musical journey. The album includes collaboration with recording artist Lancelot Knight in Six Underwater, showcasing her versatility. Proudly identifying as a nehiyaw iskwew, she seamlessly weaves her creative pursuits into a traditional lifestyle, contributing to a First Nation Healing Lodge under the guidance of elders and knowledge keepers. The past year has been a transformative period characterized by healing and growth, with her music echoing the spirit of loss, hope, and perseverance. Her vocal style is both distinctive and heartfelt, drawing inspiration from grassroots music festivals, independent artists, and the eclectic vibes of the city. A nomadic spirit with a touch of witchy charm, LILI invites all to partake in the enchantment of her melodies. Travis Beatty Board Member Travis Beatty is from Timber Bay, Saskatchewan and is instrumentalist. He has a studio in Saskatoon, Saskatchewan called Rez Rat Recording, and is passionate about helping community and youth in Saskatchewan. He joined the CAMP Sask Arts Board of Directors in October 2023, and we are very lucky to have him! JOIN THE MAILING LIST SIGN UP NOW Thanks to our supporting organizations Email: managingdirector@communityartsmentorship.com Tel: 306-774-5888 bottom of page"
    },
    {
      "url": "https://floridasandmusicranch.com/",
      "text": "Florida Sand Music Ranch – Saving Florida through Music ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program Florida Sand Music Ranch Florida Sand Music Ranch (formerly Sertoma Youth Ranch) is an 80 acre, wooded camping and event retreat located between Brooksville and Dade City, Florida. Experience old Florida camping under a natural hardwood canopy with the modern convenience of hot showers and indoor restroom facilities. Set up your tent in our primitive camping area or bring an RV / travel trailer, etc. and hook up with water and electric service. We also have an RV dump station on site (additional fee, not included with camping) for your convenience. Campfires are permitted in proper containment structures (subject to local restrictions as they may exist from time to time).  We are dog friendly and welcome your well-behaved, domestic pets though we require that they be on a leash at all times. We strive to maintain a family friendly environment in a natural outdoor setting.  The facility is open 365 days a year and portions of the facility may be rented for family gatherings, club events, camps, workshops, etc.  Independent promoters and organizations stage numerous multi-day music festivals at the Ranch each year that you don’t want to miss. Check the “Events Calendar” to see what is coming up. As a subsidiary of The Will McLean Foundation, Inc. , Florida Sand Music Ranch is a 501(c)(3) nonprofit entity.   We strive to make the facility available to a wide variety of youth groups and activities and welcome inquiries from nonprofit youth organizations.  We greatly appreciate donations and there are many opportunities to volunteer at the Ranch - check out our “Get Involved” page. Click here to Learn more about the History of the Ranch Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    },
    {
      "url": "https://floridasandmusicranch.com/history-of-the-ranch/",
      "text": "History of the Ranch – Florida Sand Music Ranch ↓ Skip to Main Content Main Navigation Menu Florida Sand Music Ranch Events Events Calendar Tree Planting Program Camping Amenities Camping Rates Ranch Rules Park Map Get Involved Rooted In Music – Growing In Memories Contact & Location Contact Us Google Map Donate Tree Planting Program History of the Ranch While Florida Sand Music Ranch became part of the Will McLean Foundation in late 2022, it enjoys a long and rich history.  Previously known as the Sertoma Youth Ranch, this facility is the product of nearly fifty years of tireless efforts by dedicated Central Florida Sertomans.  The Foundation is deeply grateful for their selfless service and for transferring this magnificent piece of old Florida to our care and stewardship.  What follows is a greatly condensed history of the origins of this wonderful facility. The concept of what would become Sertoma Youth Ranch was born in 1973 when three Sertomans from the Hillsborough Sertoma Club in Tampa, a state policeman, an insurance agent and an auto parts store owner, met in a hotel room during the Sertoma regional conference that year.  Jim Foster, Ralph Chancey and Jesse Brown hatched the idea of a youth ranch for kids to enjoy a natural, rustic, outdoor environment. Initially they called it the Sertobo Youth Ranch and envisioned a facility that could serve a variety of youth groups and organizations. An extensive search for suitable property began. The original, heavily treed, 62.5 acre portion of the property in Hernando County was identified and negotiations to acquire it began. The owner liked the idea of using his property to develop a place where children could come and enjoy the outdoors. A loose agreement was reached for $8,000 down and deferred payments for one year while terms and financing could be worked out on the remaining $60,000.  With an extraordinary leap of faith, Jim Foster and Jesse Brown made the down payment, hoping that they would recoup their money and be able to raise the rest of it with the assistance of neighboring Sertoma organizations. Sertoma Clubs throughout the Central Florida District were contacted for their help. An army of volunteers went to work with chain saws and lawn mowers, hauling them down a rugged, washed-out, dirt and gravel entry road and invested hundreds of hours clearing and improving the property to make it somewhat usable for the intended purposes. As is common in the early stages of philanthropic projects like this, the actual terms of a transfer of title and payment arrangements were not all together clear.  Disaster threatened when in the middle of this initial process of gathering the funding and making the property usable, the owner of the property died creating a great deal of uncomfortable uncertainty.  Fortunately, the family was on board.  Sertoma was contacted by the owner’s estate to keep the process going.  Since no final payment arrangements had been made and fundraising efforts were ongoing, a generous “pay what you can as you can” plan was established. In order to begin to generate some income, a small number of water and electric RV sites were installed.  Attempts at hosting a couple of country and western concerts were made without much success. An early board member of the Sertoma Youth Ranch organization, Steve Ditman, felt there was a strong following for bluegrass music events.  However, the first few attempts at hosting bluegrass concerts did not even cover the band fees. Nevertheless, the participating bands liked the youth ranch concept, could see the potential for the facility and accepted what Sertoma Youth Ranch could pay with the understanding that they would be asked to return.  The use of the Ranch as an outdoor music venue as a way to generate revenue began to slowly take root. Over the years other area Sertoma clubs joined the effort, and prominent Sertoman, Gilbert Turner, donated and installed an initial 30’ x 60’ pavilion.  A stage was later added to that pavilion and more RV spots were installed as events began to draw better attendance.  A mortgage burning party was held in the late 80’s to celebrate the retirement of the initial acquisition debt.  The Bluegrass Café, Soggy Bottom Pavilion, Youth Pavilion, children’s playground, a small bunk house building, shower facilities and infrastructure features, were all added over the years.  An additional 20 acres on the south edge of the property was acquired and put to use for primitive camping. To provide more volunteers and to better support Ranch activities, the Ranch Hands Sertoma Club (a formal, chartered Sertoma Club) was formed in 1991. Danny Schadt was the charter president of the Ranch Hands and was a longtime member of Tampa East Sertoma Club. The Ranch Hands meet on the property and are a source of support for various functions held at the Ranch.  Even after the facility was transferred and became part of the Will McLean Foundation, the Ranch Hands have remained active on site and continue to provide much appreciated support and assistance. What Sertoma Youth Ranch, Inc. accomplished on this property over the course of nearly fifty years of purely volunteer service is nothing short of miraculous.  It is tangible proof that great things can grow from the simple ideal of Service to Mankind - Ser to Ma - Sertoma!  The principles of Sertoma are, and will always be, the underlying foundation upon which this magnificent facility was built.  The Will McLean Foundation is eternally grateful to the dedicated men and women who served Sertoma Youth Ranch over the years and made this facility what it is today.  We are honored to be able to carry it forward under our own charitable mission. To learn more about the Will McLean Foundation, our history, our charitable mission, our programs and our efforts to Save Florida Through Music, please visit our website at https://willmclean.com/ Contact Us Florida Sand Music Ranch 85 Myers Rd. Brooksville, FL 34602 (813) 699-4096 Email: office@wmffacilities.com Check out the Events at the Ranch Volunteer with Us Facebook Copyright ©  2025 Florida Sand Music Ranch | Powered by Responsive Theme"
    }
  ]
}