{
  "fuentes": [
    {
      "url": "https://naturespath.com/pages/contact-us",
      "email": "wholesale@naturespath.com"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "email": "reservations@idahodunesrv.com"
    },
    {
      "url": "https://floridahikes.com/florida-trail-guide-third-edition-updates/",
      "email": "mcanada@pbcgov.org"
    },
    {
      "url": "https://www.gtrlc.org/recreation-events/preserve/arcadia-dunes/",
      "email": "icon_facebook@2x.png"
    },
    {
      "url": "https://www.gtrlc.org/recreation-events/preserve/arcadia-dunes/",
      "email": "icon_instagram@2x.png"
    },
    {
      "url": "https://www.gtrlc.org/recreation-events/preserve/arcadia-dunes/",
      "email": "icon_youtube@2x.png"
    },
    {
      "url": "https://www.gtrlc.org/recreation-events/preserve/arcadia-dunes/",
      "email": "info@gtrlc.org"
    },
    {
      "url": "https://dunevacationrentals.com/about-us/",
      "email": "reservations@dunerec.com"
    },
    {
      "url": "https://friendsofanastasia.org/event/ancient-dunes-hike/",
      "email": "friendsofanastasia@yahoo.com"
    }
  ],
  "mails": [
    "friendsofanastasia@yahoo.com",
    "icon_facebook@2x.png",
    "icon_instagram@2x.png",
    "icon_youtube@2x.png",
    "info@gtrlc.org",
    "mcanada@pbcgov.org",
    "reservations@dunerec.com",
    "reservations@idahodunesrv.com",
    "wholesale@naturespath.com"
  ],
  "nombre_sitio": "floridahikes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://naturespath.com/pages/contact-us",
      "text": "Contact Us | Nature's Path Skip to content Free shipping on orders over $59 Free shipping on orders over $59 Free shipping on subscriptions Contact Store Locator Shop Shop By Category Bestsellers Baby Cereal Granola Oatmeal Bulk Tortilla Chips Toaster Pastries For the Pantry Waffles Merchandise Shop By Dietary Vegan Low Sodium Gluten Free Low Sugar Fair Trade Grain Free Keto Friendly Superfoods Shop By Brand Nature's Path EnviroKidz Love Crunch Que Pasa Love Child Shop All Try our bestselling granola Pumpkin Seed & Flax About Our Brands Nature's Path EnviroKidz Love Crunch Que Pasa Love Child Organics Impact Our Path Always Organic Rooted in Sustainability Nourishing Communities Regenerative Organic Meet our Family Media Room Careers Career Opportunities Learn more Blog & Recipes Blog Better Planet Culture & Lifestyle Food & Health Kids & Families Business Bites Recipes Breakfast & On the Go Kid Friendly Vegan Friendly Easy Entrees Starters, Sauces & Sides Smoothie Bowls & Desserts Press Releases Awards Smoothie Bowl Summers Strawberry Smoothie Bowl Wholesale Rewards Country/region USD Canada (CAD) Mexico (USD) United Kingdom (USD) United States (USD) Search Loading... Log in Your bag Menu Shop Shop by Category Shop by Dietary Shop by Brand Impact Our Path Always Organic Rooted in Sustainability Nourishing Communities Regenerative Organic About Our Brands Nature's Path EnviroKidz Love Crunch Que Pasa Love Child Meet Our Family Media Room Careers Blog Lifestyle Recipes Press Releases Awards Wholesale Rewards Log in FIND A STORE Country/region USD Canada (CAD) Mexico (USD) United Kingdom (USD) United States (USD) Your bag Loading... Your bag is empty Already have an account? Log in to check out faster. Loading... Checkout $0.00 USD One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Taxes and shipping calculated at checkout CONTACT US General Product concern Website orders In-Kind Donation Request Wholesale General Please complete all required fields to send us a message. Estimated reply time is 1-2 business days. Your information will not be shared. See our Privacy Policy for details. To find products near you, click here . If you are under 18, please ask a parent or guardian to contact us on your behalf. Product concern Answers to commonly asked questions are listed here . If you would still like to send us a message, please complete the fields below. The more information you can provide, the faster we can resolve your product concern. Estimated reply time is 1-2 business days. Your information will not be shared. See our Privacy Policy for details. If you are under 18, please ask a parent or guardian to contact us on your behalf. Website orders Please complete all required fields to send us a message. Estimated reply time is 1-2 business days. Your information will not be shared. See our Privacy Policy for details. If you are under 18, please ask a parent or guardian to contact us on your behalf. In-Kind Donation Request Hello and thank you for thinking of us to support your event! We’re passionate lovers of food and always looking for ways to give back to our community. If you need food sponsorship for a socially responsible cause that promotes healthy living, organic farming and foods, non-GMO, or gluten-free leadership, then you’ve come to the right place. How Do I Qualify? Submit your request at least 10 weeks prior to event date for a product donation of deliciously organic goodies from Nature’s Path, Love Crunch, EnviroKidz, or Que Pasa Foods. Note: We do not provide monetary sponsorships, or catering services of milk, bowls, and utensils. This is the first donation your organization has received from Nature’s Path in the same year. You are a non-profit or community group without ties to a political party, religious group, or competing interest group. We receive a high volume of donation requests, and though we do the best with the resources we have, we are unable to guarantee support for every request. We’d like to say thanks and give you a big high five for your work in supporting your community. Happy munchin’! To submit a request, please fill out the form here Wholesale Fuel your business with Nature’s Path! Join our Wholesale Program for: Exclusive Discounts: Access unbeatable pricing on our premium organic products Effortless Ordering: Get direct access to everything you need Whether you’re blending up smoothies, serving up camps or schools, our wholesale program helps you deliver quality organic options at a great value Register for a wholesale account If you have any additional questions, please email us at wholesale@naturespath.com . Customer Services Product Quality +1 (866) 880-7284 Monday to Friday, 8:30am to 4:30 pm PST Consumer Services Nature’s Path Foods #275-250 H Street Blaine, WA 98230 USA Website Orders & General Inquiries For all naturespath.com online orders, please refer to our website chat bot in the bottom right-hand corner or the website order form above. Alternatively, feel free to call us at +1 (866) 303-4031 for any online order inquiries. Monday to Friday, 9am to 5pm EST Explore Our Brands Hungry For Savings? Sign Up For Emails To Get 10% Off! Email Delicious By Nature Follow us for news, contests, updates, and more! Facebook Pinterest Instagram YouTube Shop Shop All Rewards Wholesale Store Locator Manage Subscriptions Shop Shop All Rewards Wholesale Store Locator Manage Subscriptions About Us Our Path Blog Careers Our History About Us Our Path Blog Careers Our History Help FAQ Contact Us Discontinued Products Privacy Policy Help FAQ Contact Us Discontinued Products Privacy Policy Country/region USD Canada (CAD) Mexico (USD) United Kingdom (USD) United States (USD) © 2025, Nature's Path . Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "text": "Contact Us - Idaho Dunes RV Skip to content Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Reservations Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Get in touch with us Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Contact Information Idaho Dunes RV 1695 E 500 Rd N St Anthony, ID 83445 Tel: 208-624-3275 Email: reservations@idahodunesrv.com Learn More! Google Maps Frequently asked Questions CampGround Rules Meet our Team Have a question or comment? Please fill out the form below and a knowledgeable Idaho Dunes RV representative will reply to you shortly. Your Name (required) Your Email (required) Your Phone (optional) I am interested in learning more about (optional): Idaho Dunes RV General Campsite Info On Site Amenities Campground Rules Cancellation Policies BLM OHV Rules and Regulations Sand Dune Insight and Tips Seasonal Weather Info Local Attractions On Site Helicopter Tours UTV Trail Tours Nearby River Floats White Water Rafting Day Trips to Yellowstone National Park Day Trips to Jackson WY Lakeside Lodge and Resort Other Your Message (optional) Frequently asked Questions How do I get to Idaho Dunes RV Park? Directions from the South (Idaho Falls) Take SR20 heading East toward Rigby/Yellowstone (approx. 29 miles) Take exit 337 (North Rexburg exit) Turn left on N. Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. Directions from the North (Yellowstone) Take SR20 heading West toward Rexburg Take Exit 337 (North Rexburg exit) Turn right at N Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. How many campsites are there and how are they configured? We have 24 “Standard Full Hook-Up” sites (Water, 50-amp power and sewer, sites 1-24) Pull through. 20-22’ wide X 70’ long. Sites include a concrete patio. Sites 2/3, 4/5, 6/7, 8/9, 10/11, 14/15, 16/17, 18/19, 20/21, 22/23 are configured to share a patio with the neighboring site. We have 32 “Standard Partial Hook-Up” sites (Water and 50-amp power, sites 25-56) Pull through. 25-35’ wide X 70’ long. These sites are configured traditionally at a 45-degree angle all facing the same direction. We have 3 “Premium Partial Hook-Up” sites (Water and 50-amp power, sites 57-59) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 10 “Premium Full Hook-Up” sites (Water, 50-amp power and sewer, sites 60-69) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 25 acres of dry camping (no hook-ups ) Dry camping is always a first come first serve basis. How far is it to St. Anthony Sand Dunes Recreation Area? STATE CITY DISTANCE TIME ID Idaho Falls 40 0.5 ID Pocatello 90 1.2 UT Salt Lake City 250 3.5 MT Helena 275 3.9 MT Billings 300 4.2 ID Boise 325 4.6 WY Casper 350 5.0 WA Spokane 500 7.1 UT St. George 550 7.8 CO Denver 600 8.5 SD Rapid City 600 8.5 NV Las Vegas 675 9.6 ND Bismark 725 10.3 OR Portland 750 10.7 WA Seattle 800 11.4 CA San Francisco 875 12.5 CA Riverside 900 12.8 AZ Phoenix 900 12.8 CA Los Angeles 940 13.5 CA San Diego 1000 14.2 How big are the dunes compared to Glamis? The St. Anthony Sand Dunes cover over 10,000 acres with massive contiguous sand dunes. Osborne Overlook to China Wall in Glamis is approximately 13 miles, in direct comparison Idaho Dunes RV Park to the end of the biggest dunes near “Devils Dune” is approximately 12 miles. The infamous Choke Cherry Hill is steeper than China Wall and a significantly more difficult climb. How close is the campground to the dunes? Immediate access from your campsite to the dunes. Ride your ATV directly from the camp. IDRV is the nearest private campground to the big dunes. What amenities can be found at Idaho Dunes RV Park? Fully Stocked General Store Showers Toilets 69 Hook Up Spots 25 Acre Dry Camping Kids Playground Direct Dune Access Picnic Area On Site Seasonal RV Storage What else can I do while visiting Idaho? Yellowstone National Park Jackson Hole, WY Grand Teton National Park Yellowstone Bear World Fly Fishing Mountain Biking Photography Wildlife Viewing River Rafting Is it possible to make reservations for tent and dry camping on-line? Dry camping sites are always on a first come first serve basis. No reservations are required to camp in this area. Can we reserve a specific dry camping area? Dry camping is on a first come first serve basis and no reservations for a specific area can be provided. We're coming in with a large group and want to be together, can we reserve a group area ahead of time? At this time, we have not assigned specific group areas for camping. Groups for dry camping will on a first come first serve basis only. Is there a dump station at the park and is there a fee to dump? Use of our dump station is reserved for partial hook-up guests only. Our septic system has limited capacity and will not handle high volume dry camping dump volumes. We do not allow non-patrons use of our dump station. What is your reservation policy? Deposit policy: Reservations must be paid in full at time of booking without exception. Cancellation policy: There are no refunds under any circumstance. There are no adjustments for late arrivals or early departures. We will accommodate a one-time rescheduling of your reservation if notified at least 7 days prior to your reservation arrival date. Check-In Upon Arrival: Please check in at the Idaho Dunes RV Store immediately upon arrival. All registered guests will be issued a registration permit and receipt to affix to the window of your vehicle. Permits must be affixed in front windshield in clear view. Late Arrivals: Late arrivals must check in at the Idaho Dunes RV Store before 10:00 AM. Failure to self-register will result in a 20% registration surcharge. How late can I get to Idaho Dunes RV Park on my day of arrival? In consideration of our other campers please arrive prior to 10pm. If this is not possible please call ahead and provide advanced notice of late arrival. What time is check-out? Check out time is 11:00 AM What if I want to spend more time at the park the day we check-out? You are more than welcome to enjoy the dunes the day of check-out. Please see the manager at least one day prior to your check out date for arrangements. Are there shower facilities? The park has four (4) private showers/restrooms available 24 hours a day. There is a nominal fee for taking showers. Showers take quarters only. Showers are for Idaho Dunes RV Park guests only. Can I rent camping trailers on-site? We always recommend https://tetonar.com/rv-rentals/ for trailer rentals. Does the park allow pets? Pets are welcome. Please keep pets on a leash no longer than 10ft. Please clean-up after your pet. Is there a play area for the kids? Idaho Dunes RV has the largest three-story playground in the area for children under 10. All children must be supervised by an adult. Seating for adults is available in the immediate area to watch the kids play. Do you still have the kids track? Idaho Dunes RV does not have a designated area for youth riders on the property at this time. Please take the kids to the dune area to ride ATV’s. How can I stay up to date with what is going on at Idaho Dunes RV Park? Please visit www.idahodunesrv.com for general campground info. For the most up to the minute information on events and activities please visit our Facebook Fan Page at www.facebook.com/idahodunesrv Do you sell food on-site? Idaho Dunes RV Park may have outside food vendors on-site during special events and some holiday periods. Dates and availability will vary. Please contact us at 208-624-3275 for more information. Can we have camp fires in the park? Camp fires are allowed in the steel barrels provided. For your safety please do not dig below ground fire pits anywhere on the property. Smudge Pots are strictly prohibited and must not be used anywhere on the property. If we plan to dry camp will it be possible to fill up with water when we arrive? Water is available to all guests staying at the RV Park. Do you sell fuel on-site? VP Racing 110 Octane Fuel is sold on-site. 5-gallon pails and 54-gallon drums are typically in stock in limited quantities. Pre-ordering of VP 110 fuel is available with 20 days advance notice at https://idahodunesrv.com/vp-racing-fuel-pre-order/ Are there any Hotels/Motels nearby? Hotel accommodations can be found in both Rexburg, ID and St. Anthony, ID. Both cities are about 10 minutes away. Are picnic tables available at each camp site? Idaho Dunes RV Park does not offer picnic tables at each site. We recommend that guests bring their own tables and chairs as required. Can I place a tent on a full or partial hook-up camp site? A tent may occupy a full or partial hook-up camp site but must pay the specific rate for the type of site being occupied. Additional tents may be added for the nightly rate for tent camping. Tents must not extend beyond the physical site, infringe on the adjoining camp sites, or hinder interior roads. A maximum of 2 additional tents per hook-up site will be allowed. Does the campground offer FREE High Speed Internet YES. Idaho Dunes RV has a FREE Wi-Fi Hot Spot located near the general store with excellent connection speeds and coverage. We have installed a dedicated data line to support guests need for internet connectivity while at the campground. Our Wi-Fi is not accessible to the entire 50 acre campground but full-hook up sites are within close enough proximity to get excellent connectivity. Can I run a generator in camp? Generators can be run from 7:00 AM to Midnight in our dry camping area only. All generators must be turned off by 12:00 AM. Should you have needs that require power 24 hours per day please book an appropriate hook-up camping site. CAMPGROUND RULES Welcome to Idaho Dunes RV! Please make your party aware of the following rules and policies: Any violation of these rules may be cause for your immediate removal from the facility without a refund. No riding in camp except to access the dunes. Speed limit in camp is 5 MPH. No Music after 10:00 PM (Absolutely No Noise After Midnight Including Generators) No fireworks or smudge pots on property. All pets must be on a leash and cleaned up after. Dripping or draining of grey or black water will result in a $100 fine. Please check in at office prior to setting up camp. If arriving after hours please check in promptly at 9:00 AM the following day. Maximum of 10 people allowed per site. Limit of 1 “Extra Vehicle” allowed per site. Only 1 “Camping Unit” allowed per site. Extra vehicles staying overnight in sites will be allowed at an additional cost of $10.00 per night. All vehicles and equipment must fit within the site and not overflow onto roadways or into neighboring camps. All vehicles entering the Idaho Dunes RV gate must be registered and properly displaying registration tags. This includes RV’s, cars, and trucks. Lost, missing or stolen registration documentation will not be reissued. Individual named on the site is responsible for all parties. Do not move or alter orange safety cones in any way. Campfires are allowed in above ground burn barrels only. Absolutely no digging or below ground firepits on property. Please make children aware that power, water and communication lines are running below ground. The Idaho Dunes RV dump station is primarily reserved for partial hook-up site guests. If our septic system does have capacity, dry camping guests may pay a $10.00 dump fee to utilize the dump. Please check in with office before dumping. Dumpsters are provided for household garbage only. Any child 16 and under must be directly supervised by an adult at all times. Playground area is for children 10 and under. Children must be supervised by an adult at all times. No parking of vehicles on concrete patios in full hook-up sites. Check-In is after 1:00 PM, Check-Out is before 11:00 AM. Do not trespass on neighboring farms or properties. Please drive carefully. You are personally responsible for any damage to Idaho Dunes RV or other guests property. Idaho Dunes RV reserves the right to refuse service to anyone. Please be aware that you are on private property. We simply ask that you treat our facility as if we were all camping at your home. Ride safe and have a blast at Idaho Dunes RV! Meet the Team Mike McGroarty Owner Mike McGroarty has been an off-road, aviation, and outdoor enthusiast his entire life.  At the age of 15, Mike earned the rank of Eagle Scout in the Boy Scouts of America and by that time had over 300 nights of wilderness camping experience.  His love for the outdoors turned into a passion for off-roading as soon as his first job earned him enough income to purchase his first sport ATV.  This first ATV started an addiction for rock crawling, trail riding and sand duning that still occupies 100% of Mike’s interest to this day. Garrett McGroarty Manager Garrett McGroarty was born into the “Idaho Dunes Way of Life”.  At 3 years old, Garrett started his off-road passion on a Kawasaki KFX 50.  Garrett has logged more trail miles between Idaho Dunes RV and West Yellowstone than anyone in the area.  At a young age, Garrett developed a passion for helicopters and aviation.  Before graduating from high school, Garrett earned both his private helicopter license (PPL-H) and commercial helicopter license (CPL-H).  With advanced pilot training from the best instructors in the industry at Helisafe in Southern California, Garrett has mastered the Robinson R44 Raven II helicopters flight systems and emergency procedures.  If you have questions about the campground, dunes, local area, trail rides, or helicopter tours Garrett is your best bet to get the answers you are looking for. Colter Canon Chief Security Officer Colter Canon is Idaho Dunes RV’s Chief Security Officer. By day Colter serves Fremont County Idaho as a Sherriff’s Deputy as well as South Fremont Highschool as the School Resource Officer (SRO). Colter and his team go out of their way to ensure Idaho Dunes RV’s guests experience a safe but enjoyable atmosphere. “We understand everyone in camp is on vacation and wants to have a great time and let their hair down. We also understand that some people visiting the campground like to sleep. Its our job to make sure everyone can have the experience they are looking for within reason…” Colter Canon Google Contact Instagram Facebook Camping at St Anthony Dunes Phone: 208-624-3275 Email: reservations@idahodunesrv.com Location: 1695 E 500 Rd N, St Anthony, ID 83445 Copyright 2025 © Idaho Dunes Site Built by Moranton Media || Terms and Conditions || Privacy Policy || Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Location Email Us 208-624-3275 Login Username or email address * Required Password * Required Remember me Log in Lost your password? This site uses cookies to offer you a better browsing experience. By browsing this website, you agree to our use of cookies. More info Accept"
    },
    {
      "url": "https://floridahikes.com/florida-trail-guide-third-edition-updates/",
      "text": "Third Edition Updates | Florida Trail Guide – Florida Hikes Skip to main content Skip to header right navigation Skip to after header navigation Skip to site footer Menu Florida Hikes Hike Bike Paddle Camp Florida with authors Sandra Friend and John Keatley as your guides Search... Search site Submit search Trails Maps Guidebooks Search Search site Submit search Hike Scenic Hikes Loop Trails Dog-friendly Hikes Hikes for Kids National Parks in Florida Florida State Parks Bike Major Bike Trails Paved Bike Trails Off Road Biking Biking Articles Paddle Canoe & Kayak Rentals Paddling Destinations Paddling Articles Camp Cabin Rentals Car Camping Primitive Camping Florida Trail Plan your Hike Best Scenic Hikes Best Backpacking Section Hiking Thru-Hiking Trail Updates Travel Florida Trail Guide Third Edition Updates Updates to our Third Edition of The Florida Trail Guide (published October 2017), keyed to pages and mileage numbers in each segment of the trail presented through the book. FINAL UPDATE: 11/23/2021 As a service to our readers, we do our best to keep on top of changes to the Florida Trail and its services as they happen. Our updates come from a variety of sources, including hikers on the trail, trail maintainers, government agencies, business owners, and from the Florida Trail Association, which maintains the official list of known closures and notices from land managers . And, of course, we research changes to the trail and its services ourselves on a regular basis in order to maintain our Florida Trail app for FarOut, where updates are posted frequently. The following trail updates are keyed to the pages of the THIRD edition of The Florida Trail Guide . If you own an older edition, we encourage you to get a current edition since there were many major trail relocations between 2015 and 2017. Please print this off as an addendum to your guidebook or make corrections in the book. We won’t mind if you write in it. Our Fourth Edition was published November 2021 and replaces the Third Edition. UPDATES BY EMAIL Even if you’ve never bought our guidebook, you can join our Florida Trail mailing list for periodic trail updates. If you have bought a guidebook, we add you to the mailing list automatically. Cumulative updates to The Florida Trail Guide, Third Edition Jump to a particular trail section Big Cypress Seminole Okeechobee Kissimmee Orlando Ocala Western Corridor Northeast Florida Suwannee Big Bend Apalachicola Central Panhandle Eglin Seashore Blackwater Ocean to Lake Eastern Continental Trail The Florida Trail Association office has moved! Their new address is 1050 NW 2 Street, Suite A, Gainesville, FL 32601. Phone numbers and email remain the same. Since we released this book in October 2017, quite a few of the government agencies we reference have changed their URLs and so URLs provided no longer work. For updated links to information on hunting seasons and flood gauges, dig into the newly revised Florida Trail section of our website. Farout App : While we try to keep the route of the Florida Trail in FarOut (formerly Guthook) up-to-date at all times, our waypoint and service information is updated in batches. We have added a lot of new waypoints and photos to South Florida, Suwannee Big Bend, and Western Panhandle, with minor updates made in other regions as well. Eastern Panhandle and updates to links for water gauges and hunting seasons are next on the agenda. We’ve been building town guides in the app as well, to make it easier to find services in a town. p 19, Permits . For 2019, Eglin Air Force Base has established a new protocol for Florida Trail thru-hiker permits. They can no longer be obtained online. Eglin defines a thru-hiker as a hiker whose journey originates 50 miles or more beyond their boundaries. See the Eglin section below for full instructions on how to get a permit. BIG CYPRESS After crossing Big Cypress again in 2019, we have added dozens of new waypoints to our app, mostly having to do with reliability of water sources. This season was very dry. While the Black Lagoon at mile 22.8 remained reliable, there are also deeper ponds you can check at mile 12.1 and mile 13.1. Where alligator flag – a tall, slender leafed plant – grows in the swamp, water is at its deepest. Work is underway to replace the old mileage markers in the swamp with new ones. We’ve noted the locations of MM 1 through 16 in the app. North of that point you encounter the old markers. Subtract 6 miles from the old markers to roughly guess where you are. p. 29, mile 0 . there is a new weatherproof mailbox at Oasis Ranger Station with the trail register inside it. Be sure to sign in! Mile 15.5 . After you leave a prairie and start walking on limestone, be very alert for a water-filled sinkhole adjoining the trail. An aggressive alligator has taken residence in it. p. 30, mile 20.1 . There is actually one more piece of dry ground where you might be able to set up a tent in the next quarter mile. But when you see the old 27 Mile Marker at mile 20.9, that’s it. The next 7.8 miles of trail are IN THE SWAMP. There is NO dry land except Oak Hill at 22.7, Ivy Camp at 26.8, and one other small island at 26.3. If it’s not water, it’s mud. Mile 29 . Space for a tent, maybe, at the north end of the linear island that’s a tunnel of tropical forest. Mile 31 . There is now an I-75 North Rest Area as well as a rest area on the south side of the Interstate. We recommend using the North Rest Area now as it has less traffic and the same amenities, including vending machines with ice cream and coffee. SEMINOLE After being closed to hikers for a full year, the Seminole Reservation reopened as of 4/9/21. Billy Swamp Safari is not open, but Big Cypress Campground is. Call ahead to determine if they are accepting camping or cabin reservations. If neither place is open, you are not permitted to camp on reservation property. Be sure to obtain a permit before crossing the reservation on foot. Please review the Florida Trail Association’s details. p. 35, mile 44, West Boundary Rd. Beware of a pit bull and a smaller dog outside a yellow house. They have been attacking hikers and people have been bit. Stay on the far side of the road from the house. Tribal authorities are aware of the problem and are working with the owners. If you are chased or bitten please check in at the police station as you pass it and report it. The police station is located within sight of Big Cypress Campground. p.36, L-3 . As of 11/18/21, a portion of the L-3 levee route is closed during reconstruction of the dike system. An alternate route along a parallel levee is posted on the ground at both ends and detailed in this FTA Notice to Hikers . p.36, mile 66.2, STA 5/6. A pitcher pump has been added at the picnic shelter at STA 5/6. See FTA Notice to Hikers. The trail is sporadically closed and it is still not possible to drive to the trailhead from Deerfence Rd. An alternate route is posted there on a sign. p.36, mile 94.3, Lake Harbor. Dike reconstruction is done in this area and the trail has reopened west from John Stretch Park OKEECHOBEE Closures have been a fact of life around the lake since 2004, when it first showed signs of failure near Pahokee and Clewiston. A more recent issue is water quality. Due to the extreme decline of water quality and dangerous algal blooms in Lake Okeechobee and along the Kissimmee River basin due to agricultural runoff, use potable water sources only around the lake. Spigots on the outside of the locks and water control structures atop the dike pull directly from the lake. Current Closures The Army Corps of Engineers has an online map of the closures on their website . FTA has a version on their website as well . EAST SIDE Reviewing the FTA-provided closure map as of 11/21, the dike remains closed for construction from mile 94.5 (John Stretch Park) north through South Bay and Chosen / Torrey Island through Hatcher Rd. While it’s an 8.9 mile closure, the roadwalk around it through South Bay and Belle Glade to where the open section begins is 14.1 miles. According to notes on the map, the Corps plans to open that 8.9 mile closure in January 2022. At Nubbin Slough, it’s necessary to leave the dike and walk up US 441 to the Taylor Creek bridge because the land manager has never resolved an outstanding access issue with a landowner along the creek. Total miles closed: 11.5 of 56.6 (20%) . WEST SIDE Due to expanded closures, we strongly recommend using the EAST side for a thru-hike. While the trail is ostensibly open from mile 94.5 (John Stretch Park) to Clewiston, with a closure at the Corps offices access point, there is no way to leave the dike once you get to Clewiston. Consider this segment closed until they do. The trail remains closed from Clewiston all the way into Lakeport, past the Lakeport Campsite and the Hiker’s Graveyard.  North of Mile 130, the trail is open all the way to Okee-tantie. Restrooms are locked at all parks in Glades County. Total miles closed/inaccessible: 35.6 of 55.8 (64%) WEST SIDE p. 43, Okeechobee Landings . They are no longer accepting tent campers. p. 43, mile 104.3, Levee Park . Ongoing construction atop the dike. p. 44, mile 106.9, Uncle Joe’s . Tenting now $20. No real resupply just snacks. The dike is blocked off with a fence and construction around Uncle Joes. p. 44, Alvin Ward Park . While camping is not allowed in the park, there are places you can camp between the palms just shy of the park boundary. However, the park is currently cut off from the trail. p. 45, Alternate Roadwalk . The dike is blocked off with a fence and construction north of the Moore Haven lock. p. 45, mile 125.3, Fisheating Creek Boat Ramp . Proper name for this location is Old Fisherman’s Village. p. 46, mile 128.3, Lakeport Dike Currently posted closed due to construction on dike. Follow SR 78. p. 46, mile 129.3, Lakeport Campsite Currently inaccessible due to construction on dike, unless you walk south to it from S-131. p. 46, mile 130.1, S-131 Rejoin the trail north from this lock, home of the Hiker’s Graveyard. p. 46, LAKEPORT . Aruba RV Resort now has a new name. A restaurant has opened in the old Marina plaza along SR 78. Beck’s Store is now under new ownership as the Big Water Deli but has the same grill and minor resupply. A new Dollar General has opened on SR 78 across from the Countryside Cafe. p. 47, mile 132.6, Margaret Van de Velde Park . The observation platform at the end of the park with its great lake views has been replaced with a spiffy new one worth the detour. p. 47, mile 140.3, Indian Prairie Primitive Campground . Glades County appears to have abandoned this facility as it is overgrown and the gates are locked. p. 48, mile 150.6, Okee-tantie . While the public park and campground remain closed and Lightsey’s Restaurant moved into Okeechobee, the marina remains open. IMPORTANT: After a lengthy closure, the Florida Trail is open north from Okee-tantie. It is no longer necessary to roadwalk through Okeechobee. EAST SIDE p. 51, mile 98.5, C-4A Campsite . The campsite is in the closure area and is inaccessible. p. 53, mile 94.6, John Stretch Park . The trail is closed through the South Bay Recreation Area to CR 717 (mile 101.9), the bridge to Torrey Island. Use a road map to determine an alternate route through South Bay and Belle Glade. For your personal safety off-trail, be aware that both South Bay and Belle Glade are very economically depressed areas. p. 51, mile 99.9, South Bay Recreation Area . All access, vehicular and pedestrian, is blocked to this recreation area from every direction except perhaps the water. p. 53, SOUTH BAY . New services include a Pilot truck stop with hot food and deli, showers, and fresh fruit; and a Dollar General along SR 80 just east of the traffic light with US 27. p. 55, mile 111.6, City of Pahokee Campground . The cabins in this city campground are now privately owned and managed and prices were not posted at the office. Public restrooms adjoining the marina have reopened. The trail is posted as closed between Pahokee and Port Mayaca , however, you can rejoin it at NENA trailhead. p. 56, mile 121.5, NENA trailhead . The trailhead now connects to the Ocean to Lake Hiking Trail via a road leading down off the dike to the trailhead. The trail is now open between mile 121.5 and 123.8 at Port Mayaca Recreation Area. p. 56, mile 142.9, Nubbin Slough . Get off the dike here for a 2.6 mile roadwalk north along US 441 to cross the Taylor Creek bridge. This renders the Nubbin Slough campsite useless unless you hike out and back to it. KISSIMMEE Due to the rapid decline of water quality over the past two years along the Kissimmee River basin due to agricultural runoff, it’s smart to use potable water sources wherever possible. Avoid water from ditches that drain agricultural lands. Use natural ponds and marshes. If you must filter from the river, filter where water is flowing strongly. Hikers report a great deal of difficulty in obtaining free permits for campsites along the Kissimmee on South Florida Water Management District lands due to a new required registration on a third-party website that is not mobile-friendly. We suggest you pre-register on their website prior to your hike or at a library . p. 69, mile 150.8 . The dike has reopened for foot traffic north from Okee-tantie. It is no longer necessary to roadwalk through Okeechobee. p. 63 chart, mile 195.6 . The ranch fence has been moved in farther away from the bluff to offer some relief from teetering on the edge of the slough. Please respect this private property and do not hop the fence. p. 65 chart, mile 204 . A pitcher pump has been installed at Cowboy Crossing Campsite. Filter water. Mile 169.9, Chandler Slough East parking . Due to Kissimmee River restoration, this parking area has been closed and the trail rerouted up the road to enter the tract where the woods begin. p. 70, Cracker Trail Country Store . Updated phone number 863-763-0653. The store has changed hands again and now is a good resupply option. They are serving hot food again, too. IMPORTANT: Do NOT trespass through private property to make a beeline to the store. Use US 98 from either spot where the trail crosses it, east or west of Basinger. p. 70, Micco Landing Trailhead . On 3/31/18, the 11.3-mile Micco Bluff section opened as a footpath through palm hammocks, pasture, and slough along the Kissimmee River. It connects from US 98 to the Oak Creek trailhead along Micco Landing Rd. The blazes along that road are now painted white as an alternate route in times of high water. This permanent reroute cuts the roadwalk to 2.5 miles between Oak Creek and Starvation Slough trailheads. Trail maintainers warn us that alligators are seen all along the banks of the Kissimmee River as you near Oak Creek, and cluster in the lake that is the best water source for Oak Creek South campsite. Use caution when obtaining water. p. 72, Starvation Slough North Campsite . The campsite has been permanently moved 1.2 miles of its former location to a spot with better access to water. See this map for the new location . p. 73, High Water Route . The trail has been relocated to this higher, drier track to the east of the original FT route. p. 73, Duck Slough . Now that a new pitcher pump has been installed at the Cowboy Crossing campsite, skip Duck Slough and use the pitcher pump your water source instead. p. 73, Pine Island Slough Campsite . A pitcher pump has been installed at the relocated campsite. Filter water. The campsite has been renamed North Boundary Campsite by the park. p. 74, Kissimmee Prairie . Due to a flood-induced breach in the dike that the Florida Trail followed along the Kissimmee River, the trail has been permanent rerouted before you get to Pine Island Slough. It now continues due north to the park boundary fence and follows it due west, also skipping the “Junction of park roads.” The Pine Island Slough campsite has been relocated to an oak hammock adjoining the slough at the new crossing, which serves as a water source. Please see this FTA Notice to Hikers for the new route. p. 74, S-65A Lock . No more need to call ahead to request access! Per this FTA Notice to Hikers , there are now pedestrian gates on both sides of the lock and you may use them on your own (provided the lock isn’t in operation) during the following hours: Mon-Fri 7 AM-6 PM, Sat-Sun 5:30 AM-7:30 PM (Mar-Oct), 5:30 AM-6:30 PM (Nov-Feb) p. 74, KICCO . We have learned from hikers that South Florida Water Management District does not consider a vehicle access permit sufficient to park your car overnight behind the KICCO gate while section hiking. You must reserve a campsite somewhere in KICCO and park your car during that assigned camping period, even though you are not camping. p. 76, River Ranch . MAILDROPS: are held at the Mustang building at the south end of the road by the RV park. Package pickup hours are 9-4 Mon-Thu & Sat, 9-6 Fri, 9-1 Sun. Call 863-692-1116 to confirm before sending a maildrop. USPS is fine. Mail to: HIKER NAME c/o River Ranch RV, 30529 River Ranch Blvd, River Ranch FL 33867. SERVICES: River Ranch has added a Starbucks with baristas to the General Store. The Smokehouse, their restaurant over by the marina, has excellent burgers and barbecue. LODGING: Hikers are being quoted rates over $200 a night. CAMPING: Tent sites are now $48.00 per night on weekends and holidays. According to Ray Duncan, General Manager, “I can extend a special mid-week price to the hikers of $30 per night Mon-Thu (excluding any holiday) if they book at the front desk and tell us they are hikers. Any group larger than 5 tents should call the resort directly prior to arriving for reservations.” Call them at 863-692-1321. p. 76, mile 234.9 . Hikers report the next segment up to Mile 239.5 at SR 60 as very overgrown. As we suspected from driving this stretch of highway so many times, the SR 60 roadwalk is indeed the toughest and most terrifying of the roadwalks on the Florida Trail, even when tackled on a Sunday morning. What’s missing from this video? More than 300 cars, semis, and RVs passing by along the two hour walk. Filming was during the lulls between traffic bursts. We couldn’t stay on the shoulder for more than 50-100 steps between vehicles. We’d like to see replacing THIS roadwalk take priority in the master plan for the FNST. https://youtu.be/fvC9bB5H5Ns p. 77, mile 237.7 . Walk down the entrance road into the parking area for Osceola FMA. Look for a beaten path uphill towards SR 60. Climb up and you will see a sidewalk below along the river. Climb down to it. The sidewalk leads under the SR 60 bridge to a ramp to get you up to the pedestrian walkway on the highway bridge. p. 78, Prairie Lakes . Unless you’re thru-hiking the Florida Trail, it’s necessary to obtain a free permit for camping at Dry Pond and Parker Hammock in Prairie Lakes. It’s always necessary to get a free permit for the Lake Jackson Campground, which is vehicle-accessible. Call FWC at 352-732-1225. Parker Hammock has a pitcher pump. The pitcher pump at Dry Pond is unreliable. ORLANDO p. 91, mile 274.3, Forever Florida . This long-time ecotourism destination has closed its doors. Hikers are still permitted to walk this private conservancy through along the orange blazes, but there is no longer a trailhead, restrooms, restaurant, ziplines, or buggy tour. HOWEVER, you may still use Tracey Branch Outpost campsite (and you should) by calling ahead. Instructions are posted as you enter Forever Florida (now Crescent J Ranch). Water may be available but not guaranteed. Pack out all trash. p. 92, mile 296.5, Deer Park Road . With the bridge over Wolf Creek replaced, Deer Park Road has reopened. p. 92, mile 309.7, Nova Road . Water is accessible from the NW side of the Cox Creek bridge, but beware that it may be tainted with biosolids runoff. Taylor Creek has a better flow and comes out of a reservoir that supplies the City of Cocoa Water Treatment plant, so you may want to stock up on water there at mile 314.6. p. 94, mile 326.6, Tiger Branch campsite . Tent platforms have been added. A new campsite, Hoot Owl, has opened north of the Tootoosohatchee Bridge NEW PAY-To-CAMP Bronson / Little Big Econ State Forests . Reservations and payments via Reserve America are now expected for use of the Fern Camp and Joshua Creek campsites as well as campsites along the River Trail. The same holds true for West Camp, the only designated campsite in Little Big Econ State Forest. p. 97, mile 364.1, Lockwood Blvd . A small trailhead corral has been added to the trail crossing at Lockwood Blvd. Parallel parking for three cars. p. 98, Franklin Street . Because of new development in the area, the Florida Trail has been permanently moved to follow Franklin Street west through Oviedo, joining the Cross Seminole Trail after you cross SR 434. This moves the trail away from services that you previously walked past in Oviedo, but takes you right through brand-new Solary Park, which has restrooms, water fountain, and tables and chairs. For services, northbound, you will need to turn left at either Geneva Dr or Central Ave to walk up to the plaza with the post office, Ace Hardware, and restaurants. To reach the Townhouse Restaurant, turn left when you reach the Cross Seminole Trail. This area has been reblazed. p. 99, Winter Springs . The “unmarked but obvious path” has been obliterated along with everything else in sight as relentless urbanization continues. Line of sight, you should be able to see the shopping center as you come to the curve in the trail. Getting to it may be tricky due to construction vehicles and fences. If so, use Tuscawilla Road as your access point. p. 100, mile 375, Spring Hammock Preserve . A new campsite has been added in Spring Hammock, making it possible to complete the urban Cross Seminole Trail without a hotel stay. Access is via blue blazed trail just south of the bridge over the creek. It is for section and thru-hikers only. Before camping there, call the Florida Trail Association and leave your name, number, and date you plan to use it. p. 104, mile 388.4, Lower Wekiva Preserve State Park . The Florida Trail has been obliterated in the west end of this state park as construction for the Wekiva Parkway is tearing out a vast swath of public land. Follow the paved bike path on the south side of SR 46 from the traffic light at this trailhead. A new highway bridge over the Wekiva River will include a lane for this bike path. Cross to the north side of SR 46 at Wekiva River Rd (west side of the river) beneath the toll road overpasses to enter Seminole State Forest. p. 105, Boggy Creek Lake . The Florida Trail has been permanently rerouted northbound around the east side of Boggy Creek Lake and now crosses SR 44 and continues north, eliminating the SR 44 / Royal Trails roadwalk in Cassia. Please follow the orange blazes. The former trail to Cassia trailhead will remain in place for day hiking access from the parking area. p. 105, mile 397.8, Cassia trailhead . Permanent addition of vault toilet replaces the portalet. p. 106, PAISLEY . A long distance hiker reported being threatened with arrest when charging a phone outside the Dollar General after making purchases. Do not charge your phone there. Visit the library across the street and ask first. A new restaurant, Palermo’s Pizza, has opened at the south end of town, closest to the trail. 24929 CR 42, 352-771-0220. Old-timers may recall this as the location of the popular restaurant Big Oak Italian. OCALA Protecting your food from bears using bear bagging or bear canisters has been REQUIRED in the Ocala National Forest for a decade. The Florida Trail Association has partnered with the US Forest Service and Buck N’ Bass Sports Center in Salt Springs to offer free loaner bear canisters: a 10 liter Backerpackers Cache 812 model. Deposit required. Call ahead to reserve at 352-685-0200. p. 113, mile 410.4, Clearwater Lake . Two 2018 season hikers reported being harassed along this stretch of the trail between Paisley and Alexander Springs, particularly when making camp and after dark. This section of trail runs very close to homes. It’s safest to camp at or near the recreation areas. p. 113, mile 428.5, Farles Prairie . The U.S. Forest Service has officially decommissioned Farles Prairie as a hunt camp. Hikers haven’t been allowed to camp beside the lake for years because of bear activity. We are guessing that with this official action, the vault toilet might be locked up or removed. The pitcher pump should remain. $5 fee still applies for parking here. p. 114-115, mile 436.8 to 447, Juniper Prairie Wilderness . During hunting season (and all other times of year), hikers are permitted to random camp anywhere in Juniper Prairie Wilderness. p. 114, mile 443.7, Hidden Pond . Bears frequent this area. p. 1154, mile 448.9, Hopkins Prairie Campground . The camping fee at Hopkins Prairie, one of the designated sites for hikers during hunting season, has been raised to $15. p. 117, mile 458.6, CR 14 . Chuck Norris is no longer assisting hikers in this area as he and Tigger are retired and living the nomadic hiker life. Mile 463, 88 Store . The phone # at the 88 Store has changed. It is 352-616-4935. They are still accepting maildrops. They have added a restaurant, the Alibi, serving full meals. Call ahead for hours. p. 118, mile 469.3, Lake Delancy West Recreation Area . Another designated site during hunting season. Parking fee lowered to $5, camping fee raised to $15. p. 118, mile 478, Rodman Campground . Several 2019 season hikers have shown up and discovered their maildrops were refused by someone working at the campground. Until the problem is figured out, don’t ship here. p. 118, mile 482.5, St. Johns South Camping Area . Hikers report that the water from the pitcher pump is awful. Better to pass through the Buckman Lock gate (south side) and find the tap. WESTERN CORRIDOR p. 146, mile 359.7, Devil’s Creek . Hikers report high water here on a regular basis. May be unsafe to cross. Rumor has it that a bridge is planned, but it will not be in place in time for the 2022 season. Hikers should be aware that the trail has been relocated in the north end of Richloam, north of the junction to the Richloam trailhead. This Notice to Hikers from FTA explains the route change. p. 148, mile 377.3, Crooked River Campground . Campsites are no longer walk in or first-come first-served. They must be reserved online through Reserve America . p. 148, mile 379, Silver Lake Campground . Campsites are no longer walk in or first-come first-served. They must be reserved online through Reserve America . p. 149, mile 390.2, Perry Oldenburg trailhead . The Deer Run Rd roadwalk has been eliminated. Leaving the trailhead, the blazes now take you into a field to parallel the former roadwalk. After the trail crosses the road, it makes a diagonal across a stretch of woods containing a new designated campsite, Colonel Robins (fee / reserve on Reserve America) an important stop before Chinsegut WEA, where camping is not permitted. p. 150, mile 406.5, Mutual Mine Campground . This is no longer considered a trailhead for the Citrus section. Non-campers are not allowed to park at Mutual Mine. Campsites must be reserved online through Reserve America . p. 150, mile 413.5, Holder Mine Campground . Day use parking fee now $5. If you leave a car while backpacking it is $5 per day. Campsites must be reserved online through Reserve America . p. 156, mile 448.5, SR 200 . Signs have been posted to tell vehicles not to park along the highway at this trail crossing. There is also signage about upcoming road construction. If it is impossible to cross SR 200 due to construction, use the blue-blazed trail into and out of Ross Prairie trailhead as a bypass. Once you’re across SR 200 and back in the woods, there is a new picnic table at an intersection with a new paved bike path that extends from here to Santos and parallels the Florida Trail. You will meet it and cross it in several spots, including sharing it under road underpasses and across the Land Bridge over I-75. p. 156, mile 448.8, Ross Prairie trailhead . Signs in the restrooms indicate that you must now pay for use of the showers if you are not paying to camp at the campground at this trailhead. p. 163, mile 481.3, NUBY’S CORNER . There is a new Dollar General within an easy walk of the SR 40 trail crossing and a new BBQ restaurant. North of this point, a reroute has made passage through Hulls Creek Swamp easier. New boardwalks have been installed over the next 8 miles northbound, making for a much more pleasant hike. NORTHEAST FLORIDA p. 165, mile 483.7, SR 19 . The trail has been relocated off Plum Creek Timberlands into an adjacent parcel of private property. Follow blazes and signage. Some swamps are bridged. You rejoin the original route within 4 miles, just before entering Caravelle Ranch WMA. Full details here . p. 177, mile 490.6, SR 20 . The reroute at the north end of this section leads you to a gate facing SR 20. Between the gate and the road is a deep ditch with no bridge. There is no way around it but to go through it and get very wet. The trail continues north through the north gate, past the DOT drainage area. The former SR 20 trailhead to the east appears to be abandoned. < p. 179, mile 496.2, SR 100 . Bike path construction is complete. Cross SR 100 and follow the new McKinney Walkway up to the new paved bike path. Follow the bike path north (compass W) to Carraway. Because of the construction technique used to build this new bridge over Rice Creek, there is no longer any way to reach Rice Creek to filter water. p. 181, mile 507.1, Co-champion loblolly bay . Skip the side trip. The mighty tree has fallen. The trail is no longer being maintained. p. 181, mile 509.4, Longleaf Pine Trail . Due to logging in the forest, the trail has been relocated from the south intersection with the Longleaf Pine Trail northbound for a stretch, steering you closer to a water source in a sinkhole at 29.7770,-81.8719. p. 181, mile 519.9, Sandhill Camping Area . This campground is actually called is actually Turkey Oak Camping Area and has tent sites. Sandhill Camping Area is for RVs only. p. 182, Keystone Heights . Water is accessible at Alligator Creek along Immokalee Rd at 29.8091, -82.0329 along the Keystone Heights roadwalk. p. 184, mile 541.1, Bobbie Shepherd Park . Hikers report water from spigot is usable. Picnic tables and trash can have been added. p. 187, LAKE BUTLER. The city’s free camping program inside Union Station has been discontinued. You can still inquire about camping near City Hall or at Lake Side Park. Stop in at City Hall to sign the hiker register and talk to them. p. 188, OSCEOLA NATIONAL FOREST . The U.S. Forest Service has eliminated free camping at designated sites in the Osceola National Forest. This affects hikers during fall hunting season since you are required to use the designated campgrounds. All other times, you can random camp. p. 190, mile 588.1, Cobb Hunt Camp . A camping fee of $10 now applies. p. 190, mile 589.9, Ocean Pond . Mother Goose and Jim are no longer the camp hosts, and the new camp hosts are reportedly not as accommodating to hikers. The camping fee has been raised from $12 to $20. p. 190, mile 600.5, West Tower . A camping fee of $10 now applies. SUWANNEE p. 199, mile 609.1, NW Cansa Rd . The potential TRAIL RELOCATION has occurred, and it’s a beauty. Follow the blazes down the forest road to enjoy the new Big Shoals to Bell Springs section. You only need to use the old route past Madison Shelter if the river is flooding. Same applies at the other end, mile 614.8 at Bell Springs trailhead: the blue-blazed spur is now the orange-blazed thru trail. p. 202, mile 627.4, Sal Marie Branch . The bridge is broken and you may need wade across. p. 203, mile 631.1, Interstate 75 . New designated campsite with fire ring and camping sign north of the I-75 stile at 30.3434, -82.8418. p. 205, mile 646.8, Suwannee River whirlpool .  Benches and a table added 0.1N. p. 206, mile 665.4 . Do not follow SW 46th Ave. The roadwalk is no more. The Big Oak section has reopened and the trail re-blazed to follow the shoreline of the Suwannee River to the peninsula and then up the Withlacoochee River to the CR 141 highway bridge. Don’t miss this beauty spot. p. 209, mile 679.5, Mill Creek North campsite . Follow the old boat ramp trail past some broken pavement. When you get to the river look to the left and you’ll see a bubbling spring. Good water source. BIG BEND Sandra hiked the Suwannee to Aucilla roadwalk January 2019. It’s the longest roadwalk along the Florida Trail but was for the most part very rural and pleasant. Here’s what it looks like. https://youtu.be/KY2fAyYX2j8 p. 221, mile 689.1, Midway Baptist Church .  Pastor Matt Thompson and his wife Devin have reached out to our trail community to let hikers know that Midway Baptist Church welcomes hikers. Says the pastor, “you are more than welcome to have a break, refill your water, charge devices, or camp if you like.” They are along the 48.4-mile roadwalk off this mile marker. Contact Pastor Matt by phone or text at 850-253-5042. p. 221 map . Denny’s in Madison near I-10 is now Smackin’ Lips Diner. p. 224, mile 718, Overstreet Ave . The Pepsi machine has been upgraded and now costs $1. While it takes bills, a hiker reported that it didn’t spit out a Pepsi for his dollar. Try coins. p. 225, mile 724.5, Mt. Gilead Rd . Watch for new “Road Closed to Vehicles” signage on E side of road indicating public land managed by Suwannee River WMD. There are flat areas on an old road and in the woods usable for random camping, with a cypress swamp for water on the S side of the road. p. 225, mile 726.6, Mt. Gilead Tract trailhead . We followed the blue blazes to the campsite and discovered it’s 0.8 mile from the trailhead, not 0.3. It’s tucked deep in the woods and has no amenities except signage and a nearby water source. But it is somewhere vehicles can’t drive near. p. 226, mile 728.6, CR 14 . In January 2019, the gate was missing and the forest was entirely clearcut where the trail turns off CR 14 to head to Aucilla WMA. An FNST sign is still visible in the vast empty plain. p. 233, mile 769.8, St. Marks River . If you are staying at Shell Island Fish Camp they will ferry you for free (we encourage tipping the captain), otherwise there is a $25 fee. Shields Marina sits within sight of the crossing (upriver) and might ferry just for tips: 850-925-5612. p. 234, mile 772.7, US 98 . As we noted in our warning about FDOT Bike Path, the new paved Coastal Trail is now open. From signage and blazing by following it ourselves, we’ve determined that the Florida Trail no longer weaves in and out of the woods off US 98 as it did when we hiked it last. It now follows this paved path compass west from the St. Marks Trail privy junction north of US 98 to just shy of the Thompson House trailhead at mile 775.1. We have seen no official notice from FTA confirming this route change. p. 235, mile 784.6, Spring Creek trailhead . On the corner with US 98, 1.4N of this trailhead, a new Dollar General and large Circle K with deli items and hot foods has joined the old Stop N Save. p. 235, mile 788.3, Spring Creek Hwy . Spring Creek Restaurant was destroyed by a storm surge during Hurricane Michael and will not reopen. The SPRING CREEK ROADWALK is still in effect as there is still no forward motion on getting those replacement boardwalks in. We’ve added the roadwalk to the app as a blue line. It is 5.1 miles long. Here’s what it looks like SOBO. https://youtu.be/UVd8NAYitGg NOBO, take Spring Creek Hwy 0.2N to Jack Crum Rd, a lightly traveled high speed paved road with no shoulders to speak of. Water source at a flowing stream at 0.6N. Reach Purify Bay Rd after 3.6N. If you are in need of RESUPPLY turn right and walk 0.2E to Medart, where there is a Dollar General and a new Rocky’s, which has a wide array of excellent resupply foods and a hot grill serving breakfast, lunch, and dinner. Otherwise turn left to continue back to the FT inside St. Marks NWR. When you see the orange blazes close to you on the right, you can get over to them at an old forest road. APALACHICOLA p. 245-246, Sopchoppy . Sopchoppy Grocery now has a small cafe and serves hot food including fried chicken. Sopchoppy Pizza has closed, replaced with a hometown brewery, Civic Brewing. Food is sometimes available. Everett’s Country Store has closed. Across US 319 from where Everett’s was located, a new Dollar General has opened. Across from the old Depot downtown, there is now a new public park called Depot Park with a parking area, restrooms, short walking path, playground. Mantis Camp is a new designated campsite less than a mile west of Bradwell West trailhead, a great place to regroup after the pull through the swamp. p. 249, mile 827.1, Smith Creek . Trail access blocked by lost access to private land along Smith Creek so the trail no longer turns into the woods here. That means you’ll have to roadwalk north along CR 329 (Smith Creek Rd) to FR 13 to rejoin the trail route crossing the Ochlockonee River. Mile 854.3, Bonnet Pond Campsite . A new designated primitive campsite has been established about a mile east of Bonnet Pond with a nearby stream as you head northbound to it. It includes benches and a fire ring. p. 253, mile 858.4, Camel Lake . Camel Lake Recreation Area has reopened after Hurricane Michael cleanup. The nightly camping rate has been raised from $10 to $20. Sites must be reserved in advance through Recreation.gov. Mile 860.4, Memery Island Campsite . Another new designated primitive campsite has been established flanking the two ends of the Trail of Lakes connector loop with the FT. This one includes benches and a fire ring. Water from a stream immediately west. Once again, thanks to Mike Tucker for making these new campsites happen. In our opinion, the CR 12 roadwalk to Bristol is the second most dangerous in the state after the SR 60 roadwalk because of frequent high-speed trucks – bringing logs into and lumber out of a sawmill that you will pass – and no bike lane. It is particularly bad between the Apalachicola National Forest and CR 333. Here’s a look. https://youtu.be/RWM0vGqlJ1w p. 253, mile 865.4, CR 333 . Caz’s Bait & Tackle has closed. p. 253, mile 870.9, Citgo Station . TJs Fillin’ Station has a hot grill with ribs, chicken, burgers, and sides. Very limited resupply. p. 254, BRISTOL . Family Dollar has permanently closed. CENTRAL PANHANDLE HURRICANE MICHAEL IMPACTS: In October 2018, this region suffered winds of just under 150 mph. Damage is still visible, especially to the forests, and many businesses shuttered. Blountstown and Altha took direct hits. p.255 Eric Lewis is no longer the contact for this region. p. 263, mile 876.5, MJs Diner . MJs Diner has closed. The nearby Airport Motel was spared. p. 263, mile 877.6, Blountstown Greenway . The greenway is fully open to SR 71. Depot Park restrooms and the museum are open. p. 264, BLOUNTSTOWN . Main Street Station, Parramores, The Callahan, King House, and Connie’s have closed. Harvey’s Supermarkets have changed names. p. 264, mile 878.3, Sam Atkins Park . At the PANHANDLE PIONEER SETTLEMENT, Willard Smith, the founder and operator, cannot offer cabin space but he warmly welcomes hikers to come camp here, and it’s the only place in town you can do so. Please stop in the office or call in advance to check in with them, 850-674-2777. Here’s a look at the SR 71 roadwalk between Blountstown and Altha with hurricane debris. https://youtu.be/ka0jq38XlIE p. 264, mile 886.3, CR 275 . The Chevron Food Mart at the corner is open. p. 265, Mile 887.2, Altha / Upper Chipola WMA . As of February 2020, the ALTHA section and Altha campsite have fully reopened. The Chipola campsite is not open. The Chipola West roadwalk from Altha to Econfina is another challenging one because of the lack of bike lane and high-speed traffic. Fortunately, much of it has paralleling flat land to walk on. https://youtu.be/YQv7BMQj4k4 p. 266, mile 890.9, Shelton’s Corner . Shelton’s Store was severely damaged by the hurricane and will not reopen. We’re saddened to report that both Mrs. Shelton and her son passed away in the past year. Shelton Park & Library is open and still usable for camping. p. 266, mile 895.4, Hillcrest Baptist Church . Will “Gentle Giant” Quattlebaum welcome hikers as a part of the church’s mission. There are now signs out front to call your attention to the church as a designated stop. The church now runs a small three-room hostel with common area, climate control, and access to restroom and shower as well as electricity. While they ask for nothing in return, we’re sure donations would be appreciated. Mile 906.1, Scott Road trailhead . As of February 2020, the ECONFINA section has reopened. Designated backpacking campsites have reopened. Do not count on other water management district campsites being available. Mile 924 to 924.2, Rattlesnake Lake . Posted closure due to clearing of trees killed by Hurricane Michael. Follow gravel road to Rattlesnake Lake Campground and walk through campground. Follow lakeshore to rejoin trail northbound. p. 270, mile 923.8, SR 20 trailhead . Once in the woods, it’s now entirely in the open. It is available for parking. The SR 20 roadwalk from here to Pine Log (mile 936.4) was not as bad as expected thanks to broad shoulders and utility easements. https://youtu.be/Re7fLmAJV-E p. 270, mile 927.9, SR 77 . Hikers report that the owners do not allow camping on the property. p. 270, mile 936.4, Leave SR 20 . Enter power line access corridor to Pine Log. Around mile 939 , a new campsite, Pine Knot, has been added to the PINE LOG EAST section along Ditch Branch.  Water access and fire ring. p. 271, mile 943, Sand Pond Campground . Camping reservations for Sand Pond Campground are now required in advance through Reserve America by phone at 1-800-456-2267 or online p. 272, EBRO . The Ebro Motel has been sold and the new owner is not offering a discount. Call ahead before walking up here. p. 274, mile 954.2 . Seven Runs trailhead is currently closed for renovations. EGLIN p. 284, Permits . In 2019, Eglin Air Force Base established a new protocol for Florida Trail thru-hiker permits. They can no longer be obtained online. Eglin defines a thru-hiker as a hiker whose journey originates 50 miles or more beyond their boundaries. 1) Create an iSportsman account in advance of your hike and be sure to have finished the process of reviewing the safety videos and taking the quiz. 2) Three days before you arrive on base, call the Jackson Guard office at 850-882-4165 or 850-882-4166. The office is only open on weekdays and closed on Federal holidays. 3) Once the Jackson Guard has reviewed the Public Access Map (PAM) for the upcoming three days to ensure that the Florida Trail is open, they will electronically issue a free permit to your iSportsman account. 4) You must have this permit with you in the event you are stopped by base personnel. If you have a smartphone, make a screenshot and save it to your phone. If you do not, you will need to print a copy off at a library or other public computer before you arrive. If you are not a thru-hiker, when you complete step 1, purchase your annual Outdoor Recreation permit. If you are backpacking, you will also need to purchase camping permits. p. 285, mile 975.3, Segrest Rd . Road construction is complete along US 331. One less obstacle. p. 285, mile 975.3, Eglin Portal trailhead . Mileage is incorrect. Should be 977.1 p. 287, mile 980.4, Blount Creek . New balance-beam style bridge has a guy wire. Until you cross the bridge and get into the floodplain between Blount and Alaqua Creeks on the other side, it won’t be obvious if you need to turn around due to flooding. Flowing water = turn around and follow the FLOODING procedure. Since there is now a bridge over Alaqua Creek, your danger zone is between here and there in the lowlying floodplain swamps. p. 287, mile 981.1, Alaqua Creek . After years of anticipation, there is finally a sturdy long-span suspension bridge over Alaqua Creek. No more dangerous fording. This warning no longer applies. Enjoy the view. p. 287, mile 981.7, Turpentine Branch . Missing from the lineup is this useful water source as you climb out of the Alaqua floodplain. Easy to reach and good flow. p. 288, mile 990.2, Alaqua trailhead . To alleviate closures of the Florida Trail during tactical training exercises on the north side of Eglin, the base has created a new J-35 TTA on their Public Access Map (PAM) which all recreational users must check before heading anywhere on base. Generally, J-35 should remain open most of the time. It includes the bulk of the Catface section in Eglin, between the Alaqua trailhead and SR 285 near Mossy Head. p. 290, mile 1011.8, JR Walton Pond . At JR Walton Pond, the dam broke after Hurricane Sally in 2020. The Florida Trail has been relocated along the east side of the former pond and a new designated campsite established there. Follow the orange blazes to a new crossing of the inflow creek to the pond to continue northbound. Spanning from the Pearl trailhead at mile 1019.2 to the Yellow River Ravines section at mile 1040.2, the Crestview roadwalk is the third longest along the Florida Trail. The segment from Pearl up SR 85 and under Interstate 10 is the toughest part because of the volume of traffic and driveways. After that it’s sidewalks through Crestview and walking parallel to US 90 west. https://youtu.be/kFEEgySGeV0 p. 294, CRESTVIEW . A new Cefco convenience store has opened in a very useful spot just north of the Shoal River Bridge along SR 85. It’s now the first place you can stop and get a cold drink northbound along the Crestview roadwalk. A new hostel has opened in Crestview, Lil Cubs Place. Look for their info on Facebook. Trailside Outfitter in Crestview has closed. p. 294, mile 1030.5, US 90 roadwalk . Once you are north of the highway bridge over the railroad just north of Milligan, there is a paralleling utility easement on the south side of US 90 that is the blazed trail route and much safer walking than along the road shoulder. It continues most of the way to mile 1034.1 with intermittent breaks. p. 294, mile 1033.3, Linda Lou’s Produce . New produce stand along US 90 in Galliver is a good stop for cold water, fresh fruits and veggies, snacks. p. 294, mile 1036.6, River’s Edge Campground . Hikers report that the campground IS accepting backpacking tent campers. $30/night provides access to showers, laundry, and a place to charge your phone. Guest Lake Park no longer permits camping. A new designated campsite with the same name has been built off the blue blaze to the park. Use the park for water access, picnic pavilions, portalet. p. 295, mile 1043.0, Julian Mill Creek . A bridge now spans Julian Mill Creek. Around mile 1044 , the trail has been relocated around Carr Lake Swamp to avoid the wettest parts. p. 295, mile 1049.5, Wild Azalea Campsite . A short blue blaze at a sign leads to the campsite, which has ample space for a large group. There is a picnic bench, fire ring, and two large benches. The water source is barely 0.1N of the junction along the trail. p. 296, mile 1055.5, SR 87 . A new Dollar General has opened about a half mile north of the Nichols Lake Rd traffic light along SR 87. p. 297, mile 1056.2, Yellow River Bridge . A new pedestrian walkway is a part of the new bridge over the Yellow River floodplain. Join it on the east side of SR 87 as you approach the bridge. p. 297, mile 1057.7, Yellow River trailhead . The trail no longer goes under the highway here to enter the Weaver Creek section of Eglin. Instead, a gate has been installed in the new DOT wildlife fence on the west side of SR 87 about 0.2 south of the bridge on the west side of the highway, meaning you must cross traffic from the pedestrian walkway to get there. The slope down to it is very steep and often muddy. IMPORTANT: Eglin is now permitting hikers to use the Weaver Creek section (Yellow River to East Bay) at all times. You MUST have an Eglin Permit with you, however, and the only available campsite is Dean. p. 298, mile 1060.0, Buck Pond . The recreation area has been closed. You may still be able to find water down the blue blaze, but better to wait until Weaver Creek up ahead. p. 298, mile 1066.0, SR 87 crossing . You must now leave a gate on the west side of SR 87 and cross four lanes of traffic – which does not expect a person to cross here – to the east side of SR 87 to enter a gate. The gates are set between two vehicle-accessible secure gates. The trail gates are tied closed. Parking area (day use) is south of the gate on the northbound side of the highway. SEASHORE p. 304, mile 1086.7, CR 399 . The road crossing from the beach to UWF Dunes has been moved 0.2N of its prior location and there is now a crosswalk. It meets the paved Pensacola Beach Bike Path in front of the big “Welcome to Pensacola Beach” sign. Look for the first of the poles leading you into the dunes just behind that sign. p. 304, mile 1088.1, Bayview Campsite . An attempt was made to move the Bayview Campsite over to the bay at a location 0.2N of the needlerush marsh to make it accessible to paddlers as well. However, erosion has taken its toll. We recommend using the path straight ahead after the needlerush marsh for a good tent spot on pine duff under the pines to the right. Once you’re set up, you can follow that worn path out to the beach. Look north and you’ll see a couple of park benches perched on the eroding bluff. There isn’t anywhere to pitch a tent there except on rough ground near a garbage can. When you pass the blue blazed poles 0.2N of the needlerush marsh, this is where they lead, with no flat ground along that route. p. 304, mile 1090.2, Pensacola Beach Bike Path . Along the next half mile, there are two parking areas on the opposite side of CR 399 for beach parking, and both have portable toilets. Past those, keep alert along the bike path for sporadic water fountains with water bottle filling stations. Most are near the trolley stops. Sadly, the trolley doesn’t run during hiking season. p. 304, PENSACOLA BEACH . Travelodge is now Surf and Sand Hotel. Same address, same phone, new website , new look, and no longer a budget hotel. Your room includes use of kayaks, paddleboards, floats, and bikes. No pets. p. 306, mile 1096.8, Fort Pickens . The entrance fee for Fort Pickens has increased to $10 pedestrian, $20 vehicle. Receipt is good for one week at any unit of Gulf Islands National Seashore. The entrance station has been moved farther into the park so you don’t pass it on foot when you follow the blazes to the beach. However, whoever is picking you up at the end of the hike will need to pay the entrance fee. National Public Lands passes accepted. p. 307, mile 1102.7, Fort Pickens Campground . All reservations are through Recreation.gov. Campsites cost $20-40 and should be reserved in advance. Details here . p. 307, Fort Pickens . The gift shop at Fort Pickens is where the Florida Trail terminus register is located. It is closed until further notice. BLACKWATER p. 315, mile 1050, Burnt Grocery campsite . The full name is Burnt Grocery Creek campsite and it sits off a blue blaze that continues through the campsite and down to the creek for water. It has large benches, a picnic bench, and fire ring. p. 315, mile 1050.8, Miller Bluff Rd . Parking is possible at Miller Bluff Rd just south of the bridge over Interstate 10 on the west side of the road. Day use only recommended. p. 315, mile 1051.8, Hutton Unit .  The trail route has changed slightly through the cutover timberlands north of US 90, so landmarks we mention in the data sheet may not match up. Follow the blazes. p. 317, mile 1071.4, Bear Lake Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online p. 317, mile 1071.4, Krul Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online p. 317, mile 1081.1, Karick Lake South Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online p. 317, mile 1081.1, Karick Lake North Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online p. 318, mile 1079, Hurricane Lake South Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online p. 318, mile 1079.9, Hurricane Lake North Recreation Area . It is now necessary to reserve a campsite in advance at all Blackwater River State Forest campgrounds via Reserve America, by phone at 1-800-456-2267 or online OCEAN TO LAKE p.325-326, Ocean to Lake Hiking Trail permits : Permits are no longer needed for the DuPuis campsites. For camping in Loxahatchee Slough (Palm Beach County), the new contact is Mary Canada at 561-233-2503 (M-F 9-4), or by email . You may also call 561-233-2400, their main number. It is no longer necessary to pay your Jonathan Dickinson access fee at the front gate. Drop it in the iron ranger along the Ocean-to-Lake Trail after you cross Hobe Groves Canal. You do still have to contact the park in advance regards camping at Kitching Creek or Scrub Jay. p. 326, mile 0, NENA trailhead . The trailhead now connects to Okeechobee East via a road leading up onto the dike. However, there are so many closures along the Okeechobee East section it’s unlikely you’ll want to tackle it. p. 328, mile 31.3 . A new trailhead has opened at Hungryland Slough, just north of the entrance to Corbett WMA p. 329, mile 36.1 . A new trailhead has opened along the Beeline at Loxahatchee Slough Sandhill Crane Tract. The OTLHT now passes a tall observation tower. p. 329, mile 42.8 . Trail closures may occur due to restoration efforts along the C-18 canal. Check this link for current status and watch for signage while you’re on the trail. p. 328, mile 30.3, Everglades Youth Conservation Camp . Hikers are no longer permitted to use the premises. Do not trespass. p. 330, mile 55.9, Scrub Jay campsite . Pitcher pump added. EASTERN CONTINENTAL TRAIL In July 2018 and again in December 2018, we traversed the length of the Keys to assess recovery after Hurricane Irma. While businesses are coming along nicely, the Florida Keys Overseas Heritage Trail has seen little to no work done on places it was roughed up or washed away. That’s not a problem when you’re on foot, but John rode his bike the length of the Keys as well as on the South Dade Greenway. That enabled us to produce two new apps, with waypoints, to help you navigate both the Overseas Heritage Trail in the Florida Keys and the Florida ECT Connector from Key Largo to Big Cypress National Preserve. Here are updates for some of the waypoints noted in the data charts, p. 332-336. We discovered that many campgrounds in the Keys have either closed or no longer will accept tent campers. Mile 5.3, Stock Island . Tent campers welcome at Boyds Campground. Leos no longer accepts tents. Mile 11.5, Geiger Key Marina & RV Park . No longer accepts tent campers. Mile 21.2, Lazy Lakes RV Park . No longer accepts tent campers. Mile 21.3, KOA Sugarloaf Key . Remains closed. Mile 34.9, Big Pine Key Fishing Lodge & Campground . Tent campers welcome, lots of space. Mile 38.8, Bahia Honda State Park . Cabins reopened, one of two campgrounds open. Tents welcome. Mile 40.7, Sunshine Key RV Resort and Marina . Now owned by Encore RV Resorts. No longer accepts tent campers. Rental cabins available. Mile 42, Veterans Park . Closed, undergoing renovations. Mile 49, MARATHON . Knights Key Campground at the north end of the Seven Mile Bridge was sold and leveled and is now becoming a condo complex. Mile 61.5, Jolly Roger RV Park . Tent campers welcome. $73 + tx for up to 4 adults on site. Mile 69.8, Long Key State Park . Campground was destroyed by Irma and not rebuilt yet. Mile 72.4, Fiesta Key Resort & Campground . Now owned by Encore RV Resorts. No longer accepts tent campers. Rental cabins and hotel rooms available. Mile 82.9, Islander Resort . Closed, undergoing renovations. Mile 93, Historic Tavernier Inn . Closed, undergoing renovations. Mile 102.5, Key Largo Campground . Tent campers welcome. $40-44 + tx for up to 2 adults on site. Mile 103.8, Pennekamp State Park . Campground open, tents welcome. Mile 104.8, Kings Kamp RV Park . Tent campers welcome. $40-50 + tx for up to 2 adults on site. Mile 117.2, C-111 access road . The C-111 lock crossing has reopened. Use it to access the Southern Glades Trail as the north side access is now blocked by a vehicle gate and fence off US 1. Here is a video from John’s traverse of the Southern Glades Trail from the C-111 canal to mile 132.1 at CR 9336. He rode up it on his bike to Everglades National Park to show you what the southernmost 12 miles of this levee walk looks like. https://youtu.be/Uv3M_7bxnOI p. 345, FLORIDA CITY . The Everglades International Hostel has been renamed the Hoosville Hostel . New owners, all amenities and contact info the same. Sidebar FarOut Guides Our comprehensive trail logistics presented on offline maps: Florida National Scenic Trail (1,500 miles) Florida Keys Overseas Heritage Trail (108 miles) Eastern Continental Trail in Florida (92 miles) We earn a small commission on sales through these links. Thanks for your support! Our Florida Guidebooks We’ve written guidebooks to Florida’s outdoors for over twenty years. These help you plan a hike on the Florida Trail. FIND A TRAIL OR PARK METROS : Bradenton . Clearwater . Crestview . Daytona Beach . Destin . Fort Lauderdale . Fort Myers . Fort Walton Beach . Gainesville . Jacksonville . Kissimmee . Lakeland . Melbourne . Miami . Naples . Ocala . Orlando . Panama City Beach . Pensacola . Port St. Lucie . Punta Gorda . St. Petersburg . Sanford . Sarasota . Sebring . Stuart . Tallahassee . Tampa . Vero Beach . West Palm Beach . MULTI-REGION : Atlantic Coastal Ridge . Atlantic Coast . Bartram Trail . Big Bend . East Coast Greenway . Everglades National Park . Florida National Scenic Trail . Gulf Coast . Lake Wales Ridge . WATERWAYS : Indian River Lagoon . Intracoastal Waterway . Kissimmee River . St. Johns River . Withlacoochee River . NORTHWEST FLORIDA : Altha . Apalachicola . Apalachicola National Forest . Big Bend Scenic Byway . Blackwater River State Forest . Blountstown . Bonifay . Bristol . Bruce . Cantonment . Cape San Blas . Carrabelle . Chattahoochee . Chipley . Crawfordville . DeFuniak Springs . Eastpoint . Ebro . Eglin Air Force Base . Freeport . Fountain . Gulf Breeze . Gulf Islands National Seashore . Holt . Madison . Marianna . Milton . Monticello . Mossy Head . Munson . Navarre . Navarre Beach . Newport . Niceville . Panacea . Panama City . Perdido Key . Ponce De Leon . Port St. Joe . Quincy . Santa Rosa Beach . Sopchoppy . South Walton . St. George Island . St. Marks . St. Marks NWR . Sumatra . Vernon . Wakulla . Wewahitchka . Woodville . WATERWAYS : Apalachicola River . Blackwater Bay . Blackwater River . Chipola River . Choctawhatchee Bay . Choctawhatchee River . Coastal Dune Lakes . Ochlockonee Bay . Perdido River . St. Marks River . Wacissa River . Wakulla River . Yellow River . NORTH FLORIDA : Alachua . Amelia Island . Archer . Baldwin . Branford . Bronson . Bunnell . Callahan . Cedar Key . Chiefland . Crescent City . Cross City . Cross Creek . Dowling Park . Ellaville . Fanning Springs . Fernandina Beach . Flagler Beach . Fort White . Glen St. Mary . Green Cove Springs . Hawthorne . High Springs . Inglis . Jacksonville Beaches . Jacksonville Northshore . Jasper . Jennings . Keystone Heights . Lake Butler . Lake City . Live Oak . Macclenny . Mandarin . Mayo . Mayport . Micanopy . Middleburg . Old Town . Olustee . Orange Park . Osceola National Forest . Palatka . Palatka-Lake Butler Trail . Palm Coast . Palm Valley . Perry . Ponte Vedra . Rodman . Salt Springs . St. Augustine . Starke . Steinhatchee . Suwannee . Suwannee River Wilderness Trail . Suwannee Springs . Talbot Islands . Timucuan Preserve . Trenton . Waldo . Welaka . White Springs . Williston . Worthington Springs . Yankeetown . WATERWAYS : Santa Fe River . St. Marys River . Suwannee River . Tolomato River . Upper Withlacoochee River . CENTRAL FLORIDA : Altamonte Springs . Apollo Beach . Apopka . Astatula . Astor . Auburndale . Bartow . Babson Park . Bayport . Belleview . Bithlo . Brandon . Brooksville . Bushnell . Canaveral National Seashore . Cassadaga . Christmas . Chuluota . Citrus Springs . Clearwater Beach . Clermont . Coast to Coast Trail . Cocoa . Cocoa Beach . Cross Florida Greenway . Crystal River . Dade City . De Leon Springs . DeBary . Deland . Deltona . Dunedin . Dunnellon . Edgewater . Enterprise . Eustis . Ferndale . Fort Meade . Frostproof . Geneva . Gibsonton . Hernando . Hernando Beach . Holopaw . Homosassa . Inverness . Kenansville . Kissimmee . Lake Mary . Lake Wales . Largo . Leesburg . Lithia . Longwood . Lutz . Maitland . Malabar . McIntosh . Melbourne Beach . Merritt Island . Merritt Island NWR . Mims . Mount Dora . Narcoossee/Lake Nona . New Port Richey . New Smyrna Beach . Nobleton . Oak Hill . Oakland . Ocala National Forest . Ocklawaha . Ocoee . Oldsmar . Orange City . Ormond Beach . Osteen . Oviedo . Paisley . Palm Bay . Plant City . Poinciana . Polk City . Ponce Inlet . Port Orange . Ridge Manor . Riverview . Ruskin . Safety Harbor . Silver Springs . Sorrento . Spring Hill . St. Cloud . Tarpon Springs . Titusville . Umatilla . Viera . Walt Disney World . Weeki Wachee . Weirsdale . Wimauma . Windermere . Winter Garden . Winter Haven . Winter Park . Winter Springs . Withlacoochee State Forest . Withlacoochee State Trail . Yeehaw Junction . Zephyrhills . WATERWAYS : Alafia River . Halifax River . Hillsborough River . Lake Apopka . Little Manatee River . Ochlawaha River . Rainbow River . Tampa Bay . Wekiva River . Wekiva River Basin . SOUTHWEST FLORIDA : Alva . Boca Grande . Cape Coral . Charlotte Harbor . Ding Darling NWR . Ellenton . Englewood . Estero . Immokalee . Marco Island . North Port . Osprey . Palma Sola . Palmetto . Pine Island . Port Charlotte . Sanibel Island . Venice . WATERWAYS : Caloosahatchee River . Manatee River . Myakka River . Pine Island Sound . SOUTH FLORIDA : Arcadia . Basinger . Big Cypress National Preserve . Big Cypress Seminole Reservation . Big Cypress Swamp . Bowling Green . Clewiston . Everglades City . Indiantown . LaBelle . Lake Okeechobee Scenic Trail . Lake Placid . Lakeport . Moore Haven . Okeechobee . Ortona . Pahokee . Palmdale . Port Mayaca . South Bay . Wauchula . Zolfo Springs . WATERWAYS : Fisheating Creek . Lake Okeechobee . Peace River . SOUTHEAST FLORIDA : Biscayne Bay . Biscayne National Park . Boca Raton . Boynton Beach . Coconut Creek . Coral Gables . Coral Springs . Davie . Delray Beach . Fellsmere . Flamingo . Fort Pierce . Hobe Sound . Hollywood . Homestead . Indrio . Jensen Beach . Juno Beach . Jupiter . Jupiter Farms . Key Biscayne . North Hutchison Island . Ocean to Lake Greenway . Palm Beach . Palm Beach Gardens . Pompano Beach . Redland . Sebastian . South Hutchinson Island . WATERWAYS : Florida Bay . St. Lucie River . FLORIDA KEYS : Big Pine Key . Islamorada . Key Largo . Key West . Marathon . Overseas Heritage Trail . ©2006-2024, Sandra Friend & John Keatley | Disclosure | Site Index | Work with Us | Advertise with Us | Terms of Service and Privacy Policy Florida Hikes  PO Box 93  Mims FL 32754 | Contact"
    },
    {
      "url": "https://www.gtrlc.org/recreation-events/preserve/arcadia-dunes/",
      "text": "Arcadia Dunes: The C.S. Mott Nature Preserve (UA) - Grand Traverse Regional Land Conservancy : Grand Traverse Regional Land Conservancy Skip to content Grand Traverse Regional Land Conservancy About About GTRLC Our Mission & Values Staff Our Board Past Major Campaigns Shop our Gear Position Openings Financial Statements FAQ Get Outside Preserves, Trails & Maps Events Field Guides Property Rules & Hunting Regulations Conservation Center Conservation Center Publications & Stories Publications & Stories Land Protection Land Protection Overview Active Projects Landowner Information Farmland Protection Forest Protection Stewardship Stewardship Overview Current Initiatives Volunteer Volunteer Opportunities Contact Contact Us Support Our Work Grand Traverse Regional Land Conservancy 2846 3 Mile Rd N Traverse City , Michigan 49686 231-929-7911 or 888-929-3866 info@gtrlc.org YouTube Facebook Accredited Land Trust Accreditation Commission Donate Arcadia Dunes: The C.S. Mott Nature Preserve (UA) Benzie County , Manistee County / 3927 Acres / 20 Trail Miles Activities Birding Hiking / Snowshoeing Hunting Mountain Biking Parking Scenic Vistas Skiing Trail Running Universal Access Preserve Map | Hunting Map Directions Report An Issue Property Rules | Hunting Rules Download Field Guide iNaturalist is a community science platform we use to share flora and fauna information found on GTRLC properties. Learn what's been seen and how you can share your observations! View Plants & Animals Learn how to make your own observations Community science is a collaborative effort between scientists and those of us who are curious, concerned, and motivated to make a difference in the natural world. The scientific work undertaken with the help of the general public is invaluable as these large, volunteer-based networks make it possible for scientists to accomplish projects that would otherwise be too expensive or time-consuming through traditional means. Importantly, community science encourages public participation and brings science within reach for those who are not (or not-yet) scientists, and builds connections between people with shared interests of advancing knowledge, understanding, stewardship, and engagement with the natural world. iNaturalist is a world-wide community science information sharing platform that helps us more fully understand the properties we protect through observations from people like you. Learn how to get started View All Species Property Rules PERMITTED ACTIVITIES The preserve is open from dawn until dusk. Aside from hiking, snowshoeing, bird watching and many other passive activities, the following activities are allowed at this preserve. Dog walking is allowed, but must always be kept on a leash. Here’s why. Educational use is welcome, but we ask our guests to be mindful that they are visiting the homes of the plants and animals whose lives depend on the land’s protection and health. If you would like to lead a group hike at this preserve, please contact us to make sure that the date is open and there are no conflicting uses on the site. Hunting is allowed, but regulations vary. Please refer to the hunting rules tab on the page of the preserve you’d like to hunt before you go. Trails are not closed during hunting season. Mountain biking is permitted on the Dry Hill Trails and Camp Arcadia Trails from the St. Pierre Trailhead. Please refer to the respective preserve map for more information about these trails. Electric Bikes (Class 1) are permitted on preserves where biking is allowed. Class 1 ebikes are pedal-assist only, with no throttle, and a maximum assisted speed of 20 mph. PROHIBITED ACTIVITIES Camping Fires Electric bikes (Class 2 & 3) Class 2: throttle-assisted with a maximum speed of 20 mph Class 3: pedal-assist only with a maximum speed of 28 mph Commercial harvesting of ANY species ORVs Drone usage Metal detecting (including the use of magnets in waterways) Trapping (except in the light green portion of the hunting map.) Geocaching (without prior permission from GTRLC) Mountain biking (except in designated areas of the Dry Hill Trails and Camp Arcadia Trails) Foraging: Removal of natural features, plants or animals, outside of allowable hunting seasons, is prohibited. This includes firewood, ramps (wild onions or leeks), fiddleheads of ferns, and all native plants that are dug, cut, or damaged upon harvest. Common species of fruits, like apples or raspberries, nuts, and mushrooms that are growing in abundance, may be collected in small quantities, by hand, for personal use only. Commercial harvest of plants, animals or mushrooms is not allowed. Placement of items or structures of any kind: For the enjoyment of all users and the preservation of natural spaces, we ask that visitors take only memories and leave only footprints. Placement of memorial items, painted rocks, fairy houses, geocaches, or the construction of benches, bridges, teepees, or other man-made items using natural materials is not allowed. Private events (including weddings) Please contact us directly at (231) 929-7911 if you have any questions, notice a maintenance need, or witness an inappropriate activity taking place on a preserve. If you would like to request use of or conduct research on this property please Contact Us . Hunting Rules For Arcadia Dunes: The C.S. Mott Nature Preserve Please respect all forms of wildlife, your fellow sportsmen, and others that visit and enjoy the preserve. This preserve is a multi-use area open to the public on a year-round basis for activities such as hiking, nature study, bird watching, and cross-country skiing. Please keep this in mind at all times when hunting the preserve. The Conservancy has rules specific to this preserve for hunting and trapping. Beyond those rules set forth by GTRLC, the rules, regulations and seasons established by the Michigan Department of Natural Resources broadly apply. All persons hunting or trapping on this property are liable to prosecution for noncompliance to the rules and regulations stated by the Michigan Department of Natural Resources. MDNR Conservation Officers are requested by GTRLC to patrol its preserves. Michigan Conservation Officers are fully commissioned Peace Officers and are empowered to arrest for all violations of Michigan’s laws. The conservation officers’ primary duties are the enforcement of natural resource and environmental protection laws. MDNR rules and regulations can be found at: www.michigan.gov/dnr . Certain types of hunting are allowed in accordance with state regulations: Deer hunting; all forms. Small game, waterfowl and turkey hunting. When waterfowl hunting in the dark green portion of this map , hunters are prohibited from targeting coots, gallinules/common moorhens and rail species. Trapping is only allowed in the light green portion of the hunting map. Hunters are responsible to know all rules that are specific to this preserve. GTRLC reserves the right to deny or revoke hunting permission at its sole discretion. Unless otherwise noted, rules regulating hunting at this preserve are the same as those set forth by the MDNR, including special hunting seasons available to youth and hunters with disabilities. Permanent deer blinds, tree stands, or duck blinds are prohibited. Screw-in steps and other devices that penetrate the bark of a tree are prohibited. Portable stands must be labeled with the owner’s name and address such that it is easily visible from below at ground level. Stands can not be installed prior to September 1 and must be removed by the day following the close of the last deer season in the area. The Conservancy has no responsibility for tree stands, blinds or other items placed on this property. The cutting of shooting lanes, or cutting or destruction of brush, trees or other plants for any purpose is prohibited. The release of live animals is prohibited. Hunting within 450 feet of any occupied building, or within 100 feet of any maintained parking area or recreational structure is prohibited. Trails: Due to the meandering design of the trails on the preserve, please familiarize yourself with the location of all trails and other structures before hunting. Discharge of any firearm from or across trails is prohibited. Motorized vehicles, camping, and open or contained fires are prohibited. Parking is only allowed in designated parking areas and within the right of way of a maintained road such that no vegetation is harmed. There is no charge or fee for hunting on this preserve. For more information, please visit our Property Rules and Hunting Regulations page. Hunting Protected, owned and managed by the Grand Traverse Regional Land Conservancy. Please read our Mobility Device Use Policy for this trail, which can be accessed from the Baldy parking lot (see map below left). Arcadia Dunes, GTRLC’s largest preserve, includes over 15 miles of trail that wind through dunes, forests and many other landscapes. Adjacent working farms have also been permanently protected, ensuring the longevity of this area’s rich agricultural heritage. This incredibly diverse preserve provides a wide range of recreation opportunities and experiences, from hiking to birding to mountain biking and hunting. This preserve is home to the very popular Overlook Trail at Arcadia Dunes, a universally accessible trail that leaves from the Baldy parking lot and takes users to a stunning overlook of Lake Michigan. Be sure to visit this special trail throughout the year for different – but equally dazzling – experiences. The multi-use Dry Hill Trails are widely known for fantastic hiking, trail running and mountain biking. The Camp Trail is another multi-use trail built on relatively flat ground, making it a wonderful hike or beginner mountain bike ride. Pete’s Woods is a wonderful little hike with an unparalleled wildflower display in the spring. The Baldy Trails wander through beautiful forests and include breathtaking views of Lake Michigan from dunes high above the water. The Spring Woodland Wild Flowers Guide & Dune Wildflowers Guide will help you identify what you see along the trail. (We also have a very detailed guide available for just Pete’s Woods , though many of those species can be seen elsewhere.) Arcadia Dunes, part of the Sleeping Bear Birding Trail, is also an amazing birding experience. To learn more about birding at Arcadia Dunes, read the Sleeping Bear Birding Trail ‘s great birding site descriptions. One of Arcadia Dune’s birding sites is the Dryhill Grassland. Grasslands are immensely diverse and beautiful ecosystems, but they have nearly disappeared in recent decades. Check out the Grassland Birds of Arcadia Dunes Guide to learn which birds make the Grassland their home. Experiencing the unique wide-open beauty of this landscape is worth the trip, whether you are a birder or not. Read about the protection of Arcadia Dunes in the Coastal Campaign chapter from our 25th-anniversary publication, Love the Land: Pass it On. For the story of the new universal access trail here, read the the Overlook Trail chapter from our Campaign for Generations publication. email signup First Name: Last Name: Email: Submit Grand Traverse Regional Land Conservancy Accredited Land Trust Accreditation Commission Grand Traverse Regional Land Conservancy 2846 3 Mile Rd N Traverse City , Michigan 49686 231-929-7911 or 888-929-3866 Open Monday - Friday 9:00 - 5:00, or by appointment info@gtrlc.org Protecting significant natural, scenic and farm lands, and advancing stewardship - now and for future generations. @GTRLC Keep in touch on Facebook, Instagram, and Youtube or sign up for our newsletter. How to Support Ways to Give Active Land Protection Projects Legacy Giving Volunteer X We've updated our Privacy Policy. Take a moment to review it. View Privacy Policy"
    },
    {
      "url": "https://dunevacationrentals.com/about-us/",
      "text": "Meet The Dune Owners | Dune Vacation Rentals 30A Vacation Rentals Beachfront Grayton Beach Inlet Beach Rosemary Beach Seacrest Beach Seagrove Beach Seaside WaterColor WaterSound Pet Friendly Rentals Rentals With Pools Rentals with Golf Carts Browse All Rentals Concierge Services Concierge Services & Activities Calendar of Events Restaurant Guide 30A Attractions 30A Holiday Guide Owner Services Rental Property Management Where We Manage Private Home Management Renovations and Project Management Rental Home Projection Owner Testimonials Owner Login Real Estate About Us Meet the Dune Owners FAQS Join our Team Contact Us Real Estate About Us Meet the Dune Owners FAQS Join our Team Contact Us CONTACT (855) 813-3783 × Name * First Email * Phone * Message * Sign Up For SMS Updates By checking this box, I agree to receive SMS messages about vacation rental questions and reservations from Dune Vacation Rentals at the phone number provided above. The SMS frequency may vary. Data Rates may apply. Text HELP to 850-502-8343 for assistance. Reply STOP to opt out of receiving SMS messages. Please review our Privacy Policy page and Terms and Conditions . CAPTCHA Name This field is for validation purposes and should be left unchanged. About Us Home About Us Dune Vacation Rentals was established in 2013, as a boutique luxury vacation rental company. Bob Dickhaus, the founder and managing partner, has over 35 years of property management experience; including serving as President of Johnson Controls global facility management business, and for the last 25 years being a proven real estate services entrepreneur.\n\nDune is one of 30A’s most successful vacation rental companies, measured by owner and guest satisfaction; providing services to approximately 150 high-end luxury homes on 30A in the WaterColor®, Seaside®, WaterSound®, Rosemary Beach® communities and select gulf front properties. Contact Us MEET THE OWNERS Bob Dickhaus Founder Bob started Dune Vacation Rentals in 2013 after 35 years of property management experience\nwhich included serving as\na corporate officer and\nPresident of Johnson Controls global property\nand facility management business.\nHighlights from this\nperiod in time include\nmanaging launch\noperations at the Cape Canaveral space center and providing outsourced real estate management services to dozens of\nmajor corporations including IBM, Bank of\nAmerica, and AT&T. During the past twenty years Bob has been a successful entrepreneur and started and managed\nthree real estate software and technology companies prior to relocating fulltime to 30A in 2011. Currently he serves as Dune’s leader and “service quality champion”. Bob has\nbeen married to his wife Maggie for 40 years, has two children and five grandchildren, and\nenjoys the beach and golf in his spare time. Nada Chastain General Manager of Vacation Rental Properties Nada joined Dune in 2014 shortly after its formation. She has served as a property manager, maintenance manager and director of operations prior to being promoted into her current role. Nada has over 35 years experience in the hospitality business spanning both the restaurant and vacation rental industries. At Dune, she is responsible as General Manager, for the\nday-to-day operations of\nour vacation rental business including our property management and\nmaintenance teams. Nada is one of our prayer warriors; and enjoys her children, trips to the\nmountains and serving in her local church. Alicia Hilyard Director of Property Management Alicia joined Dune in early 2018, \nbringing twenty plus years of vacation rental management experience\nwith her, that included a senior management role with St Joe Club and Resorts and a stint\nwith The Rosemary Beach Cottage Rental Company. A true industry veteran,\nshe possesses a deep understanding of all facets of the vacation rental business. Her responsibilities include overseeing our property management team, currently consisting of six\nprofessional managers,\nwith responsibility for\napproximately 100 vacation rental homes along 30A. Alicia and her husband Dan, who is a retired Navy diver and continues to serve the Navy as a civil servant,   reside in\nLynn Haven. Katie Witt Director of Marketing and Revenue Management Katie joined Dune in early 2020. Originally from Memphis,\nTennessee, Katie started her career in the independent living industry, prior to moving with her husband to 30A. Her aptitude for all things technology and strong math and analytic skills\nearned her two rapid promotions at Dune and her current role as Director of Marketing and\nRevenue Management. Katie is responsible for our website, rental projections, 3D and drone property photography, social media and most importantly pricing and revenue management for\nour vacation rental customers.\nKatie has a heart for service and has volunteered\nin a variety of roles for the Make a Wish Foundation, Habitat for Humanity and Wounded Warrior; she and\nher husband Hayden who is a commercial pilot reside in Freeport. × PHILOSOPHY: Our philosophy can be summed up in a single word “partnership”. We view owners as partners who, together with Dune, manage properties in a way that generates the highest financial returns by ensuring the property is competitively priced and broadly advertised to maximize revenue, while maintaining and enhancing property values. Our goal is to make “raving fans” of our guests and be the best vacation rental provider; that unlike larger companies has the ability to deliver customized services. We recognize the importance of understanding the unique differences and needs of each client and can custom tailor a program that meets your specific investment property objectives. We train our associates to manage and treat your home like it is their own with the goal of maintaining your property condition like it is a non-rental. PORTFOLIO: Our operating area is limited to 30A and focused specifically on the WaterColor®, Seaside®, WaterSound®, Rosemary Beach® communities and select gulf front properties. We are highly selective in adding properties that only meet the highest quality levels; and limit the number of luxury properties served in any one community to avoid overlap and competition between similar properties. An operating strategy that results in higher revenue for our owners who on average generate in excess of $250,000 in rental revenue each year. MARKETING: We believe, and are leaders, in multi-channel marketing. The majority of guests book directly with us through our website and “Dune Direct” guest loyalty program driven by significant investments in SEO, email, pay for click, social media and print advertising. In addition, we utilize 10 plus web-based advertising channels including VRBO/HomeAway® where we have earned premier partner status which is only awarded to the top 10% of management company providers. OPERATIONS: The core of our service delivery team are our property managers, who average 12 years of property management experience each, and who serve as your single point of accountability. Our maintenance team uses branded vehicles and fulltime, uniformed and trained personnel. Our maintenance philosophy is to self-perform as many services as possible and lower operating costs for owners; we maintain a staffing ratio of one tech per 15 homes ensuring responsiveness. Housekeeping is provided by small companies exclusively under contract with Dune. We assign the same cleaners to your home each week that are closely supervised and their work inspected by our property managers to deliver to an industry leading Dune standard of cleanliness. Linens and towels are of a luxury quality level and laundered off-site but managed and labeled specific to each home, eliminating linen pool expenses and quality problems. TECHNOLOGY: Dune Vacation Rentals is an industry leader in the use and application of technology in all facets of our business. Our cloud-based property management software platform enables us to easily manage and integrate multiple 3rd party marketing channels resulting in higher revenue for owners. Mobile applications for maintenance, housekeeping and guest management provide consistent and efficient management of core services. Dune Vacation Rentals use of 3D imaging and drone photography of properties under management, enhances property marketing including 360 views, virtual tours, floor schematics and use of virtual reality property viewing. COMMUNITY INVOLVEMENT: As a Company, Dune Vacation Rentals is committed to environmental sustainability, community service and the active support of programs and associations sponsored through volunteerism of our team members. Specific areas of service include the Easy on 30A benefit which supports The Sonder Project, Muscogee Nation of Florida, Lighthouse Family Retreats and the Alaqua Animal Refuge. Our Address Dune Vacation Rentals 2563 S County Highway 395 Santa Rosa Beach, FL 32459 Give Us A Call (855) 813-3783 Property Search Subscribe to Our Newsletter Email * CAPTCHA Phone This field is for validation purposes and should be left unchanged. Quick Links All 30A Rentals Blog Contact Us Alphabetical Property Sitemap Owner Portal Privacy Policy Rental Agreement Travel Insurance 30A Summer Rentals 30A Spring Rentals 30A Holiday Rentals Rosemary Beach Vacation Homes 30A Rentals in Resorts Rosemary Rentals With Pools Watersound Condo Rentals 30A Beachfront Condos 30A Vacation Condos Connect With Us © 2025 Dune Vacation Rentals | Terms & Conditions | Privacy Policy contact us find your rental Search for Property All Decked Out | 1942 E Co Hwy 30A Anchors Aweigh | 58 Sandy Lane Barkin on 30A | 39 Bluestem Lane Beachwood | 51 Park Row Lane Bella Vita | 2132 E Co Hwy 30A Best Place Ever | 58 Montgomery Street Better By The Beach | 164 Red Cedar Way Blue Skies | 17 Bluestem Lane Blue View | 2308 E Co Hwy 30A Bluegrass Breeze | 1235 Western Lake Drive Buckeye On the Beach | 2288 E Co Hwy 30a Canvas | 198 Bluejack Street Carefree Cottage | 46 E Seacrest Beach Blvd Crabbin' House South | 116 Bluejack Street Domus Pacis | 2590 E County Highway 30A Enchantment | 305 Pompano Street Evergreen Dream | 19 Park Row Lane Gulf Getaway | 8 Blazing Star Happy Place | 66 WaterColor Blvd Here Comes the Sun | 447 E. Royal Fern Way High Cotton | 105 Spartina Circle Highboy Hideaway | 64 Venice Circle Hobnob | 158 Seagrove Village Drive It's a Wonderful Life | 1960 E Co Hwy 30A Mala House | 38 Mala Way Minnow Mansion | 2804 E Co Hwy 30A Mirasol House | 41 Sunflower Street More Grayter | 12 Garfield Myst Retreat House | 10 Dalton Drive Nancy's Folly | 164 Pond Cypress Way One in Vermillion | 93 Vermillion Way Our Slice of Heaven | 146 Forest Street Outside the Box | 2112 E Co Hwy 30A Park Place | 89 Watercolor Blvd Peaceful Easy Feeling | 156 Chivas Lane, Unit B Pelayo Paradise | 91 Pelayo Avenue Playing Hooky | 705 Western Lake Drive Rees on Western Lake | 605 Western Lake Drive Rees on Wiregrass | 144 Wiregrass Way Rendezvous | 29 E. Ruskin Street Sand Between Pines | 109 Vermillion Way SandyChic 30A | 213 Scrub Oak Circle Sapphire Sunset | 21 Bluejack Street Sea Section | 136 Bluejack Street Sea Shack | 128 Tupelo Street Seas the Day | 126 E Royal Fern Second Sandbar | 1946 E. Co Hwy 30A Selah | 23 E. Ruskin Serendipity | 21 Running Oak Circle Serenity on Western Lake | 63 Western Lake Drive Shellstone Cottage | 8690 E Co Hwy 30A Sol y Sombra | 61 Park Row Lane Southern Charm on 30A | 63 Sand Hill Circle Stress Free | 197 Scrub Oak Circle Summer Villa | 274 Pompano Street Summer of 42 | 299 Pompano Street Sun Haven | 257 Scrub Oak Cir Taste & Sea | 128 Tupelo The Oyster House | 230 Needlerush Drive The Providence | Residence 5 The Silver Sand Dollar | 88 Bluejack Street Tresor de la Mer | 25 Central Square, Unit 304 Verisun | 40 Elysee Court Villa Belvedere | 29 Dogwood Street Villa Menthe | 126 Bluejack Street Viridian | Seagrove Unit 203 Viridian | Seagrove Unit 402 Vista del Mare | 45 Seapointe Lane Whispers of Grace | 169 Scrub Oak Circle Yankee Sun | 445 West Lake Forest Drive 6 WaterColor Blvd, #201 6 WaterColor Blvd, #202 6 WaterColor Boulevard S, #203 25 Half Moon Lane 37 Compass Point #419 57 Western Lake Drive 99 Compass Point Way South #308 99 Compass Point Way South #407 99 Compass Point Way South #408 107 Sunflower Street 110B WaterSound Crossings 316B WaterSound Crossings 420B WaterSound Crossings 425A WaterSound Crossings 426A WaterSound Crossings 433 Western Lake Drive 1302 Western Lake Drive 1640 E Co Hwy 30A, # 302 1848 E County Highway 30A, #19 ×"
    },
    {
      "url": "https://friendsofanastasia.org/event/ancient-dunes-hike/",
      "text": "Ancient Dunes Hike – Friends of Anastasia State Park Skip to content Search for: HOME ABOUT Accomplishments Become A Member Board Members Corporate Documents GET INVOLVED Become A Member Volunteer Opportunities Turtle Nest Program Sea Turtle ADA Playground Project EVENTS CONTACT FACEBOOK DONATE × This event has passed. Ancient Dunes Hike February 28 @ 9:00 am - 10:00 am Date: Friday, February 28, 2025 Time: 9 a.m. – 10 a.m. Location: Anastasia State Park, 300 Anastasia Park Road, St. Augustine, FL 32080 Description: Come enjoy a guided hike through ancient dunes shaded by a maritime hammock. Discover the park’s natural communities while exploring this unique trail. Although only a mile long, this hike is more challenging than our other trails due to the natural sloping landscape. Please meet at the Hilltop Picnic Area, near the parking lot, and we will walk into the hammock together. Suggested items to bring are binoculars, comfortable walking shoes, a camera, drinking water, bug spray, and sunscreen. This event is weather permitting and subject to cancellation. Cost: Program is free with regular park admission fee. ($8.00 per vehicle. Limit 2-8 people per vehicle. $4.00 per single-occupant vehicle. $2.00 per pedestrians, bicyclists, extra passengers, passengers in vehicle with holder of Annual Individual Entrance Pass). For more information please contact the park at (904) 461-2033. For more about Anastasia State Park or Florida State Parks visit, www.FloridaStateParks.org. Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Share This Story, Choose Your Platform! Facebook Twitter Reddit LinkedIn WhatsApp Tumblr Pinterest Vk Email Event Navigation Annual First-Day Clean-Up Tracks, Trails and Tails Details Date: February 28 Time: 9:00 am - 10:00 am Event Category: Park Events Organizer Anastasia State Park Phone 904-461-2033 View Organizer Website Venue Anastasia State Park 300 Anastasia Blvd St Augustine , FL 32080 + Google Map Phone 904-461-2033 © Friends of Anastasia State Park 501.C3 Organization • All Rights Reserved 300 Anastasia Park Rd, St. Augustine, FL 32080 St. Augustine Web Design by Old City Web Services • Visit St. Augustine, FL on Oldcity.com Go to Top"
    }
  ]
}