{
  "fuentes": [
    {
      "url": "https://www.floraselect.net/contact-us/",
      "email": "info@floraselect.net"
    },
    {
      "url": "https://www.florabama.com/contact",
      "email": "booking@florabama.com"
    },
    {
      "url": "https://www.florabama.com/contact",
      "email": "info@florabama.com"
    },
    {
      "url": "https://www.florabamaolerivergrill.com/team-application",
      "email": "info@florabama.com"
    },
    {
      "url": "https://www.florabamayachtclub.com/contact",
      "email": "info@florabama.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.florabama.com/application",
      "email": "hr@florabama.com"
    },
    {
      "url": "https://www.florabama.com/fishing-rodeo",
      "email": "events@florabama.com"
    }
  ],
  "mails": [
    "booking@florabama.com",
    "events@florabama.com",
    "hr@florabama.com",
    "info@florabama.com",
    "info@floraselect.net",
    "info@reception-plus.de"
  ],
  "nombre_sitio": "florabama.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floraselect.net/contact-us/",
      "text": "Contact Us - Get in Touch | Flora Select Skip to navigation Skip to content Call : 01245 422353 Email : info@floraselect.net Search for: Search MENU MENU Home Garden Planters Adezz Garden Planters Aluminium Planters Black Planters Clayfibre Planters Contemporary Planters Corten Steel Planters Capi Planters Fibreglass Garden Planters Fibreglass Planters by Adezz Fibrestone Planters Galvanised Steel Planters Hardwood Planters Large Planters Polystone Planters Powder Coated Steel Planters Round Planters Steel Patina Planters Square Planters Terracotta Planters Terrazzo Planters White Planters Window Boxes Zinc Planters View all Garden Accessories Fire Pits, Fire Bowls and Tables Garden Edging Garden Retaining Walls Garden Pedestals Garden Stairs Garden Walls and Panels Outdoor Log Burners Letter Boxes Water Features Wood Storage View all Outdoor Cooking Pizza Ovens Trade Blog £ 0.00 0 items Home / Contact Us Contact Us We are very approachable and would love to speak to you. Feel free to call, send us an email, or simply complete the enquiry form. Find us at the office Unit 26, Reeds Farm Estate, Via A1060, Writtle, Chelmsford, Essex, CM1 3ST Directions . Give us a ring +44 (0)1245 422 353 Mon – Fri, 8:00-22:00 Support Email info@floraselect.net Send us a message Name (required) Email (required) Telephone Subject Your Message Privacy We want you to know how our service works and why and how we handle your data. Please state that you have read and agreed to these terms and conditions. I Agree to the Terms and Conditions . Contact Permission Occasionally we would like to newsletters and offers and the latest info from Flora Select by Email, post, SMS and other electronic means. We take your privacy very seriously and will only use your personal information to administer your account and to provide the services you have requested from us. If you consent to us contacting you for this purpose please tick to say how you would like us to contact you. Post Email Telephone SMS Enter the characters below and submit the form. Δ Flora Select Unit 26, Reeds Farm Estate, Via A1060, Writtle, Chelmsford, Essex, CM1 3ST Tel: +44(0)1245 422 353 Email: info@floraselect.net Useful Links About Us Garden Planters Garden Accessories Bespoke Planters & Garden Accessories FAQs Blog Contact Us Sitemap Account Information Track Order Trade My Account Customer Service Terms & Conditions Anti Spam Policy Secure Online Shopping © Flora Select. All Rights Reserved. Privacy & Cookies Policy My Account Search Search for: Search Basket 0 Shopping cart 0 There are no products in the cart! Continue shopping 0"
    },
    {
      "url": "https://www.florabama.com/contact",
      "text": "FLORA-BAMA CONTACTS Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Come See Us Contact Us We do not take reservations or call ahead for seating, as all of our restaurants are casual dining, first-come, first-serve restaurants. Location 17401 Perdido Key Dr. Perdido Key, FL. 32507 Email info@florabama.com Call (251) 980-5118 Ask Us We love to hear from you, but first check out our answers to the most asked questions below. At 6pm, only those ages 18 and older will be permitted entry. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry. Cover charge will apply daily beginning at 6PM. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry. $5 for 21yrs & older $20 for 18-21yrs ATTENTION: The Flora-Bama is located in the state of Florida and Florida law states that we DO NOT accept LA Wallet / Digital ID's. All customers need to have a physical (current) ID to gain entrance into the Flora-Bama. Daily: Gift Shop - 9am to 2:30am and Flora-Bama Lounge & Oyster Bar - 11am to 2:30am We're family friendly for all ages every day until 6pm. At 6pm, only those ages 18 and older will be permitted entry. Those who are 18 to 20 years old can stay all night as long as they are in the door by 10PM with no re-entry. We also have two dine-in restaurants located across the street: Flora-Bama Yacht Club and Flora-Bama Ole River Grill. Both open daily at 11AM and both are family friendly all hours of operation! • Ole River Grill will be open from 11AM - 9PM Sun-Thurs and 11AM - 10PM Fri - Sat. • Flora-Bama Yacht Club will be open from 11AM - 9PM Sunday through Thursday and 11AM - 10PM Friday & Saturday. NO. The Flora-Bama is located in the state of Florida and Florida law states that we DO NOT accept LA Wallet / Digital ID's. All customers need to have a physical (current) ID to gain entrance into the Flora-Bama. Forms of ID Accepted: Current, non-expired driver's license, current passport, military, or state issued. We do not accept any paper ID's or digital ID's. Yes, of course! You are welcome to utilize the beach behind the Flora-Bama and can walk through to the boardwalk for access beginning at 10AM daily. NO OUTSIDE ALCOHOL OR COOLERS ALLOWED through our doors or on our premises, though you are welcome to bring your beach bag essentials, chairs, towels etc. Please note that Food & Alcohol Sales begin daily at 11AM (live music begins daily at 12PM). Yes. Free bingo is Monday - Friday from 1p-4p in the Tent Stage. We love bachelor and bachelorette parties! You can visit HERE to get some ideas and we look forward to seeing your group at the Flora-Bama. We appreciate your interest in joining the Flora-Bama music scene! Please use the following link to submit your information to our Entertainment Department and they will contact you back: www.florabama.com/entertainers. You can also send your EPK/email request to booking@florabama.com. We do ask that you please bear with us as our team acquires a large amount of requests each day from those interested in playing at one of our  Flora-Bama music venues. Hope to see ya around soon! You can also send an email request to booking@florabama.com Well, of course our recipe is infamous for being a best kept secret... but think of it as an adult frozen milkshake sure to kick up a good time! Unfortunately, our licensing does not permit us to selll Bushwackers to-go or by the gallon...but we'd love to have you over for some cold snacks! There are lots of great places to stay and within walking distance or just a short Uber or car ride away! We would suggest MEDITERRANEAN WEST or PHOENIX X, both are beachfront and located adjacent to the Flora-Bama. You can always look into our local property management companies for availability --> Brett/Robinson (all Phoenix condos in Gulf Shores and Orange Beach), Meyer Real Estate, Kaiser Realty and Luxury Coastal Vacations just to name a few. Make sure to check out this luxury condo, located at the Mediterranean West next door to the Flora-Bama: https://www.luxurycoastalvacations.com/gulf-coast-vacation-rentals/mediterranean-west-802 We sure do... and Worship on the Water has actually become almost as famous as the bar! Join us on Sunday's for one of our two Worship Services held at 9AM and 11AM under the Tent behind the Flora-Bama. No fancy Sunday dress necessary, feel free to come casual while you enjoy the good word and live music throughout the service. Afterwards, stick around for some grub at either the FLora-Bama Oyster Bar or visit our resturants located across the street: The Flora-Bama Yacht Club and Flora-Bama Ole River Grill, both open daily at 11AM and family friendly all hours of operation. We are open 365 days a year with live music every day as well. Come on by and meet the Bamily! The Flora-Bama is a place where we encourage people of all walks of life to gather together, enjoy live music, food, drinks and create lasting memories with friends while making some new friendships along the way. This has historically included our furry friends as well, as the Flora-Bama loves animals and knows that many of our awesome patrons are pet owners (as are our owners!). Upon considering a tremendous amount of factors over a lengthy and difficult process, we have unfortunately decided to no longer allow dogs at the Flora-Bama, Flora-Bama Yacht Club, and Flora-Bama Ole River Grill moving forward. We have come to this decision with the ultimate intent of providing the safest, cleanest, and most positive atmosphere for our patrons to enjoy while on property. We truly appreciate your business and will continue to do our absolute best to create an environment for our customers that translates into lasting and enjoyable memories. Please be patient with us during this transition, as this was a very tough, but necessary choice. We look forward to seeing everyone this season and will miss our K-9 pals! Yes, there are several areas for you to smoke. Though we do have very strict rules about what you can smoke ... meaning, nothing illegal. If you're not looking to rent your watersport fun from the Flora-Bama Marina, then you can contact Ike's Beach Service to inquire more info on the Parasailing, Banana Boats and Beach Chair availabilty located beachside behind the Flora-Bama. Ike's Beach Attendants are out there daily (during season) and will be happy to help! You can also find contact information for Ike's Beach Service here: https://www.ikesbeachservice.com/ You have 45 days to return items for a full refund, with or without a receipt. Items must still have their original tags. Flora-Bama produces more than 100 events every year, so there is limited availability to host outside events. Please answer these questions HERE so our event team can follow up with you with more information regarding your request. Email Us Please select a subject and one of our Team members will get in touch with you soon. Join Our Team Flora-Bama is always seeking great new members Apply Here Location 17401 Perdido Key Dr. Perdido Key, FL. 32507 Bamily List Get notified of tickets, events and sales Call (251) 980-5118 Good Times and Good Music since 1964. Regulatory Door Policy Privacy Policy ADA Information News Room Join The Bamily Other Pages Flora-Bama Marina Flora-Bama Liquor & Lotto Flora-Bama Store Flora-Bama Yacht Club Ole River Grill Bar Working Hours Mon - Sun 11:00 am - 2:30 am Gift Shop Hours Mon - Sun 9:00 am - 2:30 am © 2025 All Rights Reserved | Flora-Bama Share by:"
    },
    {
      "url": "https://www.florabamaolerivergrill.com/team-application",
      "text": "APPLICATION FLORA-BAMA RESTAURANTS Home About Menu Gallery Mo' Fun Music Contact Team Application Address 17400 Perdido Key Dr. Perdido Key, FL. 32507 Email info@florabama.com Phone (850) 483-6262 See Our Menu Current Openings Check Out Flora-Bama Fun So much great family fun in one location! Button Button Button Button © 2025 All Rights Reserved | Flora-Bama Mngt. LLC 17400 Perdido Key Drive Perdido Key, FL. 32507 Contact Us (850)  483-6262 info@florabama.com Join Our Team Share by:"
    },
    {
      "url": "https://www.florabamayachtclub.com/contact",
      "text": "CONTACT US FOR GREAT SEAFOOD AND FUN IN ORANGE BEACH Home About Menu Appetizers Entrées Sandwiches Desserts Mo' Fun Gallery Music and More Contact CALL NOW Copy of Contact Address 17350 Perdido Key Dr. Perdido Key, FL. 32507 Email info@florabama.com Phone (850) 483-6272 See Full Menu Contact Contact Us Name Phone Email Message Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later Check Out Flora-Bama Fun So much great family fun in one location! Button Button Button Button 17350 Perdido Key Drive Perdido Key, FL. 32507 Contact Us (850)  483-6272 info@florabama.com Join Our Team © Copyright Flora-Bama Mngt. LLC Share by:"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Nachricht E-Mail name Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.florabama.com/application",
      "text": "Flora-Bama Job Application Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Wants You! The legendary Flora-Bama is famous for it's year-long great service and wonderful team. Come join our happy family and find out why we have the longest term staff in the hospitality industry on the island. If you enjoy smiling, helping people and being a team member then please fill out the application below. We will get back to you as soon as possible. View our current openings below. If you don't see what you are looking for please go ahead and fill out the application and tell us about what opening you would like when it is available. CURRENT OPENINGS Come work with the best TEAM on the beach! Flora-Bama has several outlets all located famously on the Alabama/ Florida line. This means there are numerous chances for advancement and training. Our TEAM members stay with us because we value their participation in work and leadership. Their voice and ideas matter! Since 1964 the Flora-Bama has been providing a comfortable and profitable location for employment. During those years we have seen TEAM members grow their skills and obtain new roles. If you would like to learn more apply for one of the available positions or send your resume directly to hr@florabama.com We hope to meet you soon \"On The Line.\" Join Our Team Flora-Bama is always seeking great new members Apply Here Location 17401 Perdido Key Dr. Perdido Key, FL. 32507 Bamily List Get notified of tickets, events and sales Call (251) 980-5118 Good Times and Good Music since 1964. Regulatory Door Policy Privacy Policy ADA Information News Room Join The Bamily Other Pages Flora-Bama Marina Flora-Bama Liquor & Lotto Flora-Bama Store Flora-Bama Yacht Club Ole River Grill Bar Working Hours Mon - Sun 11:00 am - 2:30 am Gift Shop Hours Mon - Sun 9:00 am - 2:30 am © 2025 All Rights Reserved | Flora-Bama Share by:"
    },
    {
      "url": "https://www.florabama.com/fishing-rodeo",
      "text": "FLORA-BAMA FISHING RODEO Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Home About About Us Articles Gallery Videos Hey Y'all Events Annual Events Daily Events Flora-Bama Church Tickets Live Music Food Oyster Bar Ole River Grill Yacht Club Store Marina Contact Contact Stories Fishing Rodeo 11th Annual Flora -Bama Fishing Rodeo JUNE 6-8, 2025 The 'Funnest' Fishing Tournament on the Gulf Coast - the Flora-Bama's Annual Fishing Rodeo is the \"Every Mans\" fishing rodeo! Just like the Flora-Bama Lounge, you don't have to be a VIP to fish with us! Categories will range from Catfish to Bill Fish, including a Spearfishing category and everything in-between. Heck, we'll probably see who can catch the biggest crab before it's all said and done. Bring all the family and friends for a fun packed weekend. With that said, we can promise you one thing - we'll be giving away top-of-the-line prizes! Event Details Below List of Services When and where is the rodeo? JUNE 6, 7 & 8. 2025 The tournament will be held at the Flora-Bama Ole River Grill beach area, across the street from the World Famous Flora-Bama Lounge. The Fishing Rodeo is a 3-day Captain's Choice tournament with anglers competing for 1st, 2nd, and 3rd place in 30 categories including red snapper. Accompanying the tournament will be a three day beach party and awards ceremony that will include daily weigh-ins with fish viewing area, live music, great food, vendor booths and hospitality done in true Flora-Bama fashion! Item Link List Item  1 Where can I register / enter? CLICK HERE FOR REGISTRATION AND RULES Registration is open NOW. Map List Item  2 What is the official schedule of the rodeo? THERE WILL BE A FACBOOK LIVE VIRTUAL CAPTAIN'S MEETING ON 6/5 AT 6PM FLORA-BAMA FISHING RODEO FACEBOOK PAGE. RODEO OPENS Friday, June 6th, 2025 at 12AM CT. RODEO CLOSES Saturday, June 7th, 2025 at 7PM CT. WEIGH-IN STATIONS Friday, June 6th, 2025, 2 - 7 PM Ole River Grill Beach Area Saturday, June 7th, 2025, 12 - 7 PM Ole River Grill Beach Area. If you aren't in line by the end time, you cannot weigh in. There will be music, food, activities, and drinks for everyone of all ages going on both days at the Flora-Bama Yacht Club and Flora-Bama Ole River Grill so come join the fun Friday and Saturday. AWARDS CEREMONY Sunday, June 8th, 2025, 11 AM at Flora-Bama Yacht Club Stage. Important Ticket Info: You can get them online at florabama.catchstat.com. Tickets can be purchased online until 11:59 pm on Thursday, June 5th. Everyone must enter one of two divisions when fishing the FBFR, the kids division or the adults division. A kid may compete in the adults division by purchasing an adult ticket, but an adult may not compete in the kids division. For online purchases, please print your confirmation email or show it on your phone at the weigh station. Item Link List Item  3 Any more information? Where can I leave from? You do not have to sign out from any specific location.  You may begin fishing at 12:00 am on Friday, June 6th.  Fish may be caught from any location between Cape San Blas, FL and the TX/LA border. You must weigh in no later than 7pm June 7th. Where is the weigh in? Next to the Flora-Bama Ole River Grill on the Beach Area. All boats that cannot fit under the Ono Island Bridge, please bring your fish in by vehicle. FOR MORE INFORMATION CONTACT EVENTS@FLORABAMA.COM Click here to visit the official tournament page. Lodging Planning a visit and in need of accommodation? Click here for more Want To Sponsor or Know More? Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Thanks To Our Sponsors Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Button Join Our Team Flora-Bama is always seeking great new members Apply Here Location 17401 Perdido Key Dr. Perdido Key, FL. 32507 Bamily List Get notified of tickets, events and sales Call (251) 980-5118 Good Times and Good Music since 1964. Regulatory Door Policy Privacy Policy ADA Information News Room Join The Bamily Other Pages Flora-Bama Marina Flora-Bama Liquor & Lotto Flora-Bama Store Flora-Bama Yacht Club Ole River Grill Bar Working Hours Mon - Sun 11:00 am - 2:30 am Gift Shop Hours Mon - Sun 9:00 am - 2:30 am © 2025 All Rights Reserved | Flora-Bama Share by:"
    }
  ]
}