{
  "fuentes": [
    {
      "url": "https://allaboutbeer.com/first-magnitude-brewing-leading-sustainability-efforts-in-florida-beer/",
      "email": "johnholl@allaboutbeer.com"
    },
    {
      "url": "https://allaboutbeer.com/first-magnitude-brewing-leading-sustainability-efforts-in-florida-beer/",
      "email": "info@allaboutbeer.com"
    },
    {
      "url": "https://www.barnivore.com/beer/4828/First-Magnitude-Brewing-Co",
      "email": "info@fmbrewing.com"
    }
  ],
  "mails": [
    "info@allaboutbeer.com",
    "info@fmbrewing.com",
    "johnholl@allaboutbeer.com"
  ],
  "nombre_sitio": "fmbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://allaboutbeer.com/first-magnitude-brewing-leading-sustainability-efforts-in-florida-beer/",
      "text": "First Magnitude Brewing: Leading Sustainability Efforts in Florida Beer - All About Beer Support All About Beer Underwriting Support Advertising With All About Beer Patreon Support Podcasts All About Beer Podcast The Beer Travelers Podcast Brewer To Brewer Podcast Drink Beer, Think Beer Podcast Beer Me! Radio Podcast Learn Brewing What is Beer? Hops Malt Water Yeast Beer Styles Belgian and Continental Ales British and North American Ales Lagers Seasonal and Specialty Stouts and Porters Wheat Ales Glossary Articles Columns Andy Crouch John Holl Acitelli on History Culture Food History Home Brewing Brewing Instructions Equipment Homebrewing Features People It’s My Round Beer Enthusiast In The Barrel People Features Pull Up A Stool The Beer Curmudgeon In The Brewhouse Visiting the Pub Behind the Bar Styles Stylistically Speaking Magazine Archives Travel Beer Travelers Beer Weekend A Closer Look Shop About Contact Us Newsletter Email Address* Support All About Beer Underwriting Support Advertising With All About Beer Patreon Support Podcasts All About Beer Podcast The Beer Travelers Podcast Brewer To Brewer Podcast Drink Beer, Think Beer Podcast Beer Me! Radio Podcast Learn Brewing What is Beer? Hops Malt Water Yeast Beer Styles Belgian and Continental Ales British and North American Ales Lagers Seasonal and Specialty Stouts and Porters Wheat Ales Glossary Articles Columns Andy Crouch John Holl Acitelli on History Culture Food History Home Brewing Brewing Instructions Equipment Homebrewing Features People It’s My Round Beer Enthusiast In The Barrel People Features Pull Up A Stool The Beer Curmudgeon In The Brewhouse Visiting the Pub Behind the Bar Styles Stylistically Speaking Magazine Archives Travel Beer Travelers Beer Weekend A Closer Look Shop About Contact Us First Magnitude Brewing: Leading Sustainability Efforts in Florida Beer John Holl 2 years ago share A lot of breweries talk about sustainability and environmental practices, but few are as committed as Florida’s First Magnitude . On this episode of Drink Beer, Think Beer it’s a conversation with Christine and John Denny, the founders of the brewery. Located in Gainesville, Florida it is the Southeast’s first carbon-neutral brewery through a partnership with We Are Neutral, and they have donated a lot of money to and encourage research into the Florida Springs Institute. In the brewhouse they are working to reduce waste and to find ways to be more efficient. There are charitable works they brewery touts and they are striving to remain a relevent community hub. As for the beers, they are pretty darn good, including one that I enjoyed during the show: Drift, a session brown ale. What’s a session brown? Tune in. John Holl + posts Bio John Holl is the editor of All About Beer Magazine. JohnHoll@allaboutbeer.com John Holl https://allaboutbeer.com/author/johnholl/ Destroyed in the Lahaina Fires, Koholā Brewery Grows and Rebrands John Holl https://allaboutbeer.com/author/johnholl/ Doing What’s Right: The Story of Maine Beer Company John Holl https://allaboutbeer.com/author/johnholl/ Beer at a Turning Point as Some Reassess a Brewing Career John Holl https://allaboutbeer.com/author/johnholl/ Now in Chicago: The Legend of Barrel pH1 Related Tags : Beer Florida Sustainability John Holl August 11, 2023 John Holl John Holl is the editor of All About Beer Magazine.\r\n\r\nJohnHoll@allaboutbeer.com All About Beer Is Supported By Newsletter Email Address* Merch Camp Rauchbier T-Shirt $ 25.00 This Week In Rauchbier Hat and Glass Bundle $ 35.00 Camp Rauchbier T-Shirt and Mug Bundle $ 40.00 Acitelli On History The Beer Hunter TV Show 25 Years On 10 years ago Tom Acitelli October 27, 2015 Before He Was Bard of Beer, Michael Jackson Was King of Carrot Juice 10 years ago Tom Acitelli April 1, 2015 Summit Brewing Started Its Climb 30 Years Ago 10 years ago Tom Acitelli December 9, 2015 Can You Believe It? It’s Been a Quarter-Century Since the First Micro-Brew Cans 9 years ago Tom Acitelli June 8, 2016 News Peace Out: Bob Pease Announces Retirement from Brewers Association 1 year ago Andy Crouch July 10, 2024 Taproom Aesthetics: How To Design A Space That Draws In Customers 2 years ago Andy Crouch October 3, 2023 IPA Truffles and Sour Ale Sneakers: The Best Beer Collaborations Don’t Always Come in a Can 2 years ago Emily Saladino June 12, 2023 DSSOLVR Launches Collaborative Hazy IPA, “Higher Calling,” to Support Asheville’sRebuilding Efforts After Hurricane Helene 11 months ago Press Release October 16, 2024 Contact Us All About Beer 22 Putnam Avenue Cambridge, MA 02139 info@allaboutbeer.com About Us All About Beer offers engaging and in-depth articles and interviews covering every aspect of brewing, from the process and ingredients to styles, trends, recipes, business, and the social pleasures of drinking. Newsletter Email Address*"
    },
    {
      "url": "https://www.barnivore.com/beer/4828/First-Magnitude-Brewing-Co",
      "text": "First Magnitude Brewing Co. has some vegan options - Barnivore vegan booze guide Beer Cider Wine Liquor Ask a Company Mobile Apps Contact FAQ Find Booze: Find Booze: First Magnitude Brewing Co. has some vegan options Address: 1220 SE Veitch St. Gainesville, Florida, 32601 USA Phone: (352) 727-4677 Fax: Email: info@fmbrewing.com URL: http://fmbrewing.com/ Checked by: Company Double checked by: Added: almost 9 years ago Products by First Magnitude Brewing Co.: Vegan Friendly First Magnitude 72 Pale Ale by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Cool Pond Belgian Blonde by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Devil's Eye Double IPA by First Magnitude Brewing Co. , USA Vegan Friendly Not Vegan Friendly First Magnitude Double Cream Stout /w SWO Coffee by First Magnitude Brewing Co. , USA Not Vegan Friendly Vegan Friendly First Magnitude Drift English Mild Ale by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Karst Belgian Pale Ale by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Nightfall Robust Porter by First Magnitude Brewing Co. , USA Vegan Friendly Not Vegan Friendly First Magnitude Oatmeal Milk Stout by First Magnitude Brewing Co. , USA Not Vegan Friendly Vegan Friendly First Magnitude Pisces West Coast IPA by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Rope Swing Red Ale by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Saltwater Intrusion Gose by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude The Tube ESB by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Time Out Stout by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Ursa IPA by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Vega Blonde Ale by First Magnitude Brewing Co. , USA Vegan Friendly Vegan Friendly First Magnitude Wakulla Weizen by First Magnitude Brewing Co. , USA Vegan Friendly Company email (September 2016) \"Only one or two of our beers are produced with lactose. Aside from that, the rest are all vegan. All are produced and packaged at our brewery. The following beers are produced all year round or are part of our seasonal lineup and are all vegan. Vega Blonde Ale 72 Pale Ale Drift English Mild Ale Ursa IPA Wakulla Weizen Time Out Stout Cool Pond Belgian Blonde Saltwater Intrusion Gose Pisces West Coast IPA Devil's Eye Double IPA The Tube ESB Karst Belgian Pale Ale Rope Swing Red Ale Nightfall Robust Porter\" Please Drink Responsibly Vegan Beer | Vegan Wine | Vegan Liquor Contents copyright © 2025 Thrust Labs .  All rights reserved. Contact Us | Terms of Use/Privacy Policy"
    }
  ]
}