{
  "fuentes": [
    {
      "url": "https://www.naplesgolfguy.com/forest-glen/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/forest-glen/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/forest-glen/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.berryhometeam.com/communities/bundled-forest-glen",
      "email": "scott@janetberry.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/forest-glen-golf-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/forest-glen-golf-country-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.golfify.io/courses/forest-glen-golf-country-club",
      "email": "gm@forestglengcc.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "acullinan@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "awiles@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "cdew@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "cfranzen@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "chusted@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "dheilmann@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "dkreft@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "eroush@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "golf@course.noexist"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "gott@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "info@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jezzi@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jtitus@kempersports.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jtitus@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "kvivacue@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "lhenzlik@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "mmcdermed@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "rfischer@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "sgustafson@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "tgcap@kempersports.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "tgomez@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "vpikovskiy@theglenclub.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "claire@goganteam.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "cmiles@johnrwood.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "karinthomas@comcast.net"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "laurentt@me.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "mary@marywiggins.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "seagate@raveis.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "a.shahin.broker@exprealty.net"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "albert.yabor@cbrealty.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "info@trevisorealty.co"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "info@trevisorealty.us"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "jonesnaples@kw.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "kreilly@kw.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "robert@schuchmanhomes.com"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "email": "steve@gulfaccess.net"
    },
    {
      "url": "https://www.sherwoodforestcc.com/contact/",
      "email": "gm@sherwoodforestcc.com"
    }
  ],
  "mails": [
    "a.shahin.broker@exprealty.net",
    "acullinan@theglenclub.com",
    "albert.yabor@cbrealty.com",
    "awiles@theglenclub.com",
    "cdew@theglenclub.com",
    "cfranzen@theglenclub.com",
    "chusted@theglenclub.com",
    "claire@goganteam.com",
    "cmiles@johnrwood.com",
    "dheilmann@theglenclub.com",
    "dkreft@theglenclub.com",
    "eroush@theglenclub.com",
    "gm@forestglengcc.com",
    "gm@sherwoodforestcc.com",
    "golf@course.noexist",
    "gott@theglenclub.com",
    "info@naplesgolfguy.com",
    "info@theglenclub.com",
    "info@trevisorealty.co",
    "info@trevisorealty.us",
    "jezzi@theglenclub.com",
    "jonesnaples@kw.com",
    "jtitus@kempersports.com",
    "jtitus@theglenclub.com",
    "karinthomas@comcast.net",
    "kreilly@kw.com",
    "kvivacue@theglenclub.com",
    "laurentt@me.com",
    "lhenzlik@theglenclub.com",
    "mary@marywiggins.com",
    "matt@naplesgolfguy.com",
    "mmcdermed@theglenclub.com",
    "rfischer@theglenclub.com",
    "robert@schuchmanhomes.com",
    "scott@janetberry.com",
    "seagate@raveis.com",
    "sgustafson@theglenclub.com",
    "steve@gulfaccess.net",
    "tgcap@kempersports.com",
    "tgomez@theglenclub.com",
    "vpikovskiy@theglenclub.com"
  ],
  "nombre_sitio": "forestglengcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.naplesgolfguy.com/forest-glen/",
      "text": "3904 Forest Glen Blvd - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com basic search FIND YOUR Dream Home Select a Property Type Single Family Residential Rentals Lots and Land Multifamily Residential Mobile Homes Commercial Select a City Naples Bonita Springs Marco Island Estero Fort Myers Fort Myers Beach Miromar Lakes North Fort Myers Captiva Sanibel Advanced Search Sell Your Home Back to Blog postings August 10, 2025 3904 Forest Glen Blvd 🌴 Just Went to Contract! | 3904 Forest Glen Blvd, Unit 102, Naples FL – Forest Glen Golf & Country Club We’re excited to share that our buyers have just gone to contract on a beautiful first-floor residence at 3904 Forest Glen Blvd, Unit 102 in Forest Glen Golf & Country Club here in Naples, Florida! After touring several outstanding golf communities across the area, we worked together to identify the perfect match for their lifestyle—one that combines an exceptional golf experience , resort-style amenities, and a welcoming community atmosphere. Finding the Right Lifestyle Fit When searching for a home in Southwest Florida’s many golf communities, it’s not just about the property itself—it’s about the lifestyle . Our buyers wanted: A bundled golf community with membership included in homeownership A recently renovated amenities and golf course Easy access to both the beach and downtown Naples A friendly, active social environment After exploring options across Naples, Forest Glen stood out for its championship golf, natural beauty, and unbeatable location. About the Property This first-floor home offers an ideal blend of comfort and views. Key features include: Panoramic views of lush landscaping, serene lake, and the golf course from a private screened lanai Modern kitchen with stainless steel appliances and multiple dining areas for entertaining Spacious master retreat with a relaxing garden tub and walk-in shower Two-car garage with built-in shelving Just steps from a satellite pool for quick dips and relaxation Forest Glen Golf & Country Club Lifestyle Forest Glen is one of Naples’ most inviting bundled golf communities. Homeowners enjoy: Championship 18-hole golf course , fully renovated in 2024 for improved playability and beauty Expansive practice facilities, including putting greens and a driving range A clubhouse with casual and fine dining options Tennis, pickleball, bocce, and a well-equipped fitness center Walking and biking trails surrounded by natural preserves Multiple resort-style pools throughout the community This community combines active living with a relaxed, friendly vibe that makes it easy for newcomers to feel right at home. Why Bundled Golf is a Game-Changer In bundled golf communities like Forest Glen , your golf membership is included in your home purchase, eliminating the need for a separate initiation fee. This makes it an exceptional value for avid golfers and those who want to enjoy club amenities without additional buy-in costs. Thinking About Your Perfect Golf Lifestyle? From Naples to Sarasota , we specialize in helping buyers not just find a house—but the right golf community to match their ideal lifestyle. Whether you’re looking for a championship golf course, robust social calendar, or a low-maintenance lock-and-leave home, we can help guide you to the perfect fit. 📩 Contact us to start your search and discover the golf lifestyle that’s right for you. About Naples Golf Guy For expert guidance in Southwest Florida real estate, contact Naples Golf Guy, Matt Klinowski P.A. Whether you’re looking to buy a single-family home or condo in Naples, Bonita Springs, Estero, Ft. Myers or Sarasota I can help. With over 20 years of experience, I offer valuable market information and insights into individual communities to help you find the perfect home and lifestyle in the best golf community to fit your needs. Reach out to me today to get started! Contact Matt: Matt@NaplesGolfGuy.com or at 239-370-0892 Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.berryhometeam.com/communities/bundled-forest-glen",
      "text": "Forest Glen Community in Naples Florida — Janet Berry Luxury Home Team Buy Testimonials Team Contact Us Blog SEARCH NEW CONSTRUCTION HOMES HOMES JUST LISTED Home Buy Testimonials Team Contact Us Blog SEARCH NEW CONSTRUCTION HOMES HOMES JUST LISTED Home Forest Glen Community in Naples Florida Forest Glen is one of the Bundled Golf Communities in Naples where homeowners and condo owner's membership is included, or \"bundled\" in with the purchase price of a home. Forest Glen Golf & Country Club is a club of distinction for those who desire a community with friendly people, superior golf, quality tennis, and first rate dining in the serenity of a nature preserve. Forest Glen is a full service club offering a newly renovated 18-hole championship golf course by Arthur Hills/Steve Forrest and Associates, four Har-Tru tennis courts, swimming pool, fitness center, fine dining, meeting and banquet facilities, and many other amenities. Residents also enjoy a paved path through the preserve for biking, jogging or simply strolling through the community. The Club is built on 630 acres east of Collier Blvd with just a 15 minute drive to the gulf beaches and downtown Naples. Located one mile from the entrance to Interstate 75, Forest Glen is just 30 minutes south of Southwest Florida International Airport and only 90 minutes east of Fort Lauderdale and the Florida East Coast. Forest Glen Community in Naples ALL BUNDLED GOLF COMMUNITIES | CEDAR HAMMOCK | COUNTRYSIDE | CYPRESS WOODS GOLF AND COUNTRY CLUB | ESPLANADE | FOREST GLEN | FOXFIRE | GLEN EAGLE | HERITAGE BAY | NAPLES HERITAGE | NAPLES LAKES | QUAIL CREEK VILLAGE | STONEBRIDGE | TREVISO BAY | TWIN EAGLES | VANDERBILT COUNTRY CLUB | WILDERNESS Back to Communities Edit Lead Form OPEN PAGE Optional custom content for this leadform (unique to this page) Name * First Name Last Name Email * Phone * (###) ### #### Thank you! ©Janet Berry Home Team All Rights Reserved Popular Pages Buy Testimonials Team Contact Us Blog SEARCH NEW CONSTRUCTION HOMES HOMES JUST LISTED Home Office Hours Monday - All Day Tuesday - All Day Wednesday - All Day Thursday - All Day Friday - All Day Saturday - All Day Sunday - All Day Janet Berry Home Team at Premiere Plus Realty 8955 Fontana Del Sol Way Naples, FL, 34109 Phone: (239) 450-1892 Email: Scott@JanetBerry.com Map View Privacy Policy ©Janet Berry Home Team 2020 All Rights Reserved Buy Testimonials Team Contact Us Blog SEARCH NEW CONSTRUCTION HOMES HOMES JUST LISTED Home Janet Berry Home Team at Premiere Plus Realty 8955 Fontana Del Sol Way Naples, FL, 34109 Phone: (239) 450-1892 Email: Scott@JanetBerry.com Privacy Policy Upload Background Image: Custom Background Brightness: Buy Testimonials Team Contact Us Blog SEARCH NEW CONSTRUCTION HOMES HOMES JUST LISTED Home ©Janet Berry Home Team 2020 All Rights Reserved 8955 Fontana Del Sol Way Naples, FL, 34109 Privacy Policy Upload Background Image: We are committed to respecting your right to privacy and protecting your information when\n\t\tyou use our services. This privacy policy also describes the choices available to you regarding our use of your\n\t\tpersonal information and how you can access, update and delete this information. We want you to understand what information we gather about you, how we use it and the\n\t\tsafeguards we have in place to protect it. This Privacy Policy applies to information\n\t\tcollected through this website and otherwise. Your use of this website and our services, and\n\t\tany disputes arising from it, is subject to this Privacy Policy as well as the Terms of Use\n\t\tand all its dispute resolution provisions, including arbitration, limitation on damages and\n\t\tchoice of law. This website is a general audience site and we do not knowingly collect personal information\n\t\tfrom children under the age of 13. If you have questions or concerns regarding this policy, you should first contact our website at support@ylopo.com 1. Collection and Use of Your Personal Information We collect Personal Information from you only when you voluntarily submit it in order to\n\t\tobtain certain information, including without limitation (A) requests to find out more about\n\t\tour programs; (B) requests to contact us; and (C) requests to forward your information to\n\t\tone of our affiliates. We do not honor all “do not track” requests and settings. If you use any signal(s) or\n\t\tanother mechanism(s) that provides you the ability to exercise choice regarding the\n\t\tcollection of personally identifiable information about your online activities over time and\n\t\tacross third-party websites or online services, we will attempt to override such signals or\n\t\tmechanisms. When you use our website, no other parties can collect personally identifiable\n\t\tinformation about your online activities over time and across different websites. Your\n\t\tchoice is indicated by your settings in your web browser. A “do not track” indication sent\n\t\tfrom your web browser will not result in any tracking activity (i.e., tracking cookies)\n\t\twithin the website to be programmatically disabled. We collect the following personal information from you: Contact Information such as name, email address, mailing address, and phone number We use this information to: Send you requested product or service information Respond to customer service requests Administer your account Send you a newsletter Send you marketing communications Improve our Web site and marketing efforts Conduct research and analysis Display content based upon your interests Data will not be sold or shared with third parties for promotional or marketing purposes.  Information collected may be used to help train AI models and approve our offerings. By clicking the Submit button, you agree to have your information shared with us \n\t\tand for us to initiate contact with you at the telephone number you provided using\n\t\tlive, recorded, artificial, or AI-generated voice, mobile phone (including through automated\n\t\tdialing, text SMS/MMS, or pre-recorded messaging) and/or email, even if your telephone\n\t\tnumber is on a corporate, state, or the National Do Not Call Registry, and you agree to our\n\t\tPrivacy Policy. You further represent that you have the authority to provide this consent\n\t\tregarding voice and text calls to the telephone number you provided. To opt out of voice\n\t\tcall, tell the operator you no longer wish to receive voice calls. To opt out of text calls,\n\t\treply “Stop”. For text messaging, you agree to only use the term “Stop” to communicate an\n\t\topt out. The rights of Users We adopt this Notice to comply with the California Consumer Privacy Act of 2018 (CCPA). Any\n\t\tterms defined in the CCPA have the same meaning when used in this Notice. Users may exercise certain rights regarding their Data processed by the Owner. In particular, Users have the right to do the following: Withdraw their consent at any time. Users have the right to withdraw\n\t\t\tconsent where they have previously given their consent to the processing of their Personal\n\t\t\tData. Object to processing of their Data. Users have the right to object to the\n\t\t\tprocessing of their Data if the processing is carried out on a legal basis other than\n\t\t\tconsent. Further details are provided in the dedicated section below. Access their Data. Users have the right to learn if Data is being\n\t\t\tprocessed by the Owner, obtain disclosure regarding certain aspects of the processing and\n\t\t\tobtain a copy of the Data undergoing processing. Verify and seek rectification. Users have the right to verify the\n\t\t\taccuracy of their Data and ask for it to be updated or corrected. Restrict the processing of their Data. Restrict the processing of their\n\t\t\tData. Users have the right, under certain circumstances, to restrict the processing of\n\t\t\ttheir Data. In this case, the Owner will not process their Data for any purpose other than\n\t\t\tstoring it. Have their Personal Data deleted or otherwise removed. Users have the right to obtain the erasure of their Data from the Owner by placing a request \n\t\t\tat the below designated support email address support@ylopo.com including their Facebook URL, \n\t\t\tfirst and last name, email address and/or phone number for identification purposes, or user can \n\t\t\talso request removal of data from Ylopo by removing the \"Local Home Search\" app connected to the \n\t\t\tFacebook account that was used for login. Go to Facebook settings, navigate to \"Apps and Websites,\" \n\t\t\tand find the app named \"Local Home Search\". Click \"Remove\" next to the app's name. Receive their Data and have it transferred to another controller. Users\n\t\t\thave the right to receive their Data in a structured, commonly used and machine readable\n\t\t\tformat and, if technically feasible, to have it transmitted to another controller without\n\t\t\tany hindrance. This provision is applicable provided that the Data is processed by\n\t\t\tautomated means and that the processing is based on the User's consent, on a contract\n\t\t\twhich the User is part of or on pre-contractual obligations thereof. Lodge a complaint. Users have the right to bring a claim before their\n\t\t\tcompetent data protection authority. Details about the right to object to processing Where Personal Data is processed for a public interest, in the exercise of an official\n\t\tauthority vested in the Owner or for the purposes of the legitimate interests pursued by the\n\t\tOwner, Users may object to such processing by providing a ground related to their particular\n\t\tsituation to justify the objection. Users must know that, however, should their Personal Data be processed for direct marketing\n\t\tpurposes, they can object to that processing at any time without providing any\n\t\tjustification. To learn, whether the Owner is processing Personal Data for direct marketing\n\t\tpurposes, Users may refer to the relevant sections of this document. How to exercise these rights Any requests to exercise User rights can be directed to the Owner through the contact\n\t\tdetails provided in this document. These requests can be exercised free of charge and will\n\t\tbe addressed by the Owner as early as possible and always within one month. We may provide this information in a standardized format that is not specific to you. The\n\t\tdesignated email address for these requests is support@ylopo.com Consent to Receiving Emails, Auto-Dialing & Auto-Texting: By registering, you are giving us, and our professional real estate clients and\n\t\tadvertisers permission to contact you via text message, email, or telephone using the email\n\t\taddress and/or telephone number that you have provided during the registration process. Such\n\t\tcontact may, from time to time, include attempts to contact you via auto-dialing,\n\t\tprerecorded or artificial voice, or auto-texting technology. You may opt out of receiving\n\t\tthese forms of communication by unsubscribing from any email communication or texting STOP\n\t\tas a reply to one of our text communications. There is no fee charged by us or its\n\t\tadvertisers to receive text messages, however, your mobile service provider may charge you\n\t\tfor sending and/or receiving text messages and air-time, as well as any other standard\n\t\tapplicable rates charged by your mobile service provider. Information Sharing We may share your personal information with and any other business associated\n\t\twith this site, in the ways that are described in this Privacy Statement. We may provide\n\t\tyour personal information to our subcontractors in support of our services,\n\t\tsuch as customer service. These companies are authorized to use your personal information as\n\t\tis necessary to provide these services to you. We may also disclose your personal information: As required by law such as to comply with a subpoena, or similar legal process. When we believe in good faith that disclosure is necessary to protect our rights, protect\n\t\t\tyour safety or the safety of others, investigate fraud or respond to a government request, To any other third party with your prior consent to do so. Cookies and Other Tracking Technologies We may use cookies, for example, to keep track of your preferences and profile information.\n\t\tCookies are also used to collect general usage and volume statistical information that does\n\t\tnot include personal information. We may use another company to place cookies on your computer to collect non-personally\n\t\tidentifiable information to compile aggregated statistics for us about visitors to our site. Links to Other Web Sites Our Site includes links to other Websites whose privacy practices may differ from ours. If\n\t\tyou submit personal information to any of those sites, your information is governed by their\n\t\tprivacy policy statements. We encourage you to carefully read the privacy statement of any\n\t\tWeb site you visit. Security The security of your personal information is important to us. We follow generally accepted\n\t\tindustry standards to protect the personal information submitted to us, both during\n\t\ttransmission and once we receive it. No method of transmission over the internet, or method\n\t\tof electronic storage is 100% secure, however. Therefore, we cannot guarantee its absolute\n\t\tsecurity. If you have any questions about the security of our Web site, you can contact our\n\t\twebsite and advertising provider support@ylopo.com Special Notice to California Residents. If you are a resident of California, in addition to\n\t\tthe rights set forth in this Privacy Policy: 1. We will not share any personal information about you to the extent prohibited by\n\t\tapplicable California law or to the extent your prior consent to share is required by\n\t\tapplicable California law; and 2. You have the right to request information from us regarding the manner in which we share\n\t\tcertain categories of information with third parties for their direct marketing purposes.\n\t\tCalifornia law gives you the right to send us a request at a designated address to receive\n\t\tthe following information the categories of information we disclosed to third parties for their direct marketing purposes during the preceding calendar year the names and addresses of the third parties that received that information; and if the nature of the third party's business cannot be determined from their name, examples of the products or services marketed. Additional Policy Information Our Web site includes Widgets, which are interactive mini-programs that run on our site to\n\t\tprovide specific services from another company (e.g. displaying the news, opinions, music,\n\t\tetc.). Personal information, such as your email address, may be collected through the\n\t\tWidget. Cookies may also be set by the Widget to enable it to function properly. Information\n\t\tcollected by this Widget is governed by the privacy policy of the company that created it. Our Web site offers publicly accessible blogs, social media, or community forums such as\n\t\tFacebook, Twitter, or Google Plus. You should be aware that any information you provide in\n\t\tthese areas may be read, collected, and used by others who access them. Visiting our Websites From Outside the United States. This Privacy Policy is intended to cover collection of information on our websites from\n\t\tresidents of the United States. If you are visiting our websites from outside the United\n\t\tStates, please be aware that your information may be transferred to, stored and processed in\n\t\tthe United States where our servers are located and our central database is operated. The\n\t\tdata protection and other laws of the United States and other countries might not be as\n\t\tcomprehensive as those in your country. By using our services, you understand that your\n\t\tinformation may be transferred to our facilities and those third parties with whom we share\n\t\tit as described in this Privacy Policy. No Rights of Third Parties. This Privacy Policy does not create rights enforceable by third parties or require\n\t\tdisclosure of any personal information relating to users of our websites. Notification of Privacy Policy Statement Changes We may update this privacy statement to reflect changes to our information practices or\n\t\tchanges in regulations governing privacy. If we make any material changes we will notify you\n\t\tby email (sent to the email address specified in your account) or by means of a notice on\n\t\tthis Site prior to the change becoming effective. We encourage you to periodically review\n\t\tthis page for the latest information on our privacy practices. This Privacy Policy was last revised on June 2, 2025. We reserve the right to modify\n\t\tor amend this policy at any time by posting the revised Privacy Policy on the website."
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/forest-glen-golf-country-club/",
      "text": "Forest Glen Golf & Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Naples Golf Communities Forest Glen Golf & Country Club Forest Glen Golf & Country Club is located in Naples, Florida. A gated community with friendly people, superior golf, quality tennis, and first-rate dining in the serenity of a nature preserve. Arthur Hills-Steve Forrest and Associates designed an extraordinary layout that enhanced and improved the 18-hole course in 2008. Additionally, the course was redesigned in 2024. Forest Glen is a full-service club offering tennis courts, swimming pools, a state-of-the-art fitness center, bocce ball, and pickleball. Additionally, the club offers members fine dining, meeting and banquet facilities, and many other amenities. Residents also enjoy a paved path through the preserve for biking, jogging or simply strolling through the community. The club was built on 630 acres east of Collier Blvd., just a 15-minute drive to the gulf beaches and downtown Naples. Also nearby are shopping malls, outlets, banks, hospitals, and major medical centers. Located one mile from the entrance to Interstate 75, Forest Glen is just 30 minutes south of Southwest Florida International Airport. Finally, single-family homes, villa,s and condos surround the course and amenities. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Naples, Florida Club Type: Private Country Club Membership Type: Bundled Golf Community Real Estate Home Price Ranges Single Family: $760,000 – $1,575,900 View Homes for Sale Condos: $345,000 – $739,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Forest Glen. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Golf Memberships 799 Golf Memberships Is Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Fees: Bundled Golf Dues: $7,812 Social Fee: N/A Social Dues: N/A In bundled golf communities, the Golf or Social membership is included with the purchase of your home. Additionally, there are annual recurring fees associated with the property, as well as one-time fees due at the time of purchase. Potential Fees Include: Master HOA Fee (Annual) Neighborhood HOA Fee (Annual) Food and Beverage Minimum (Annual) Assessments (Annual) Capital Contribution Fee (one-time) Transfer Fee (one-time) Application Fee (one-time) These fees vary by neighborhood within the community. Please feel free to contact us for additional information. Forest Glen Golf Course Opened 1999 Number of Courses 1 (18 Holes) Architect Arthur Hills Caddies Available No Practice Range Yes Own Your Own Cart Yes Course Ratings / Scorecards Par: 72 Holes: 18 Yards Rating Slope Black 6805 73.2 144 Gold 6427 71.2 137 Forest 5944 69.5 121 White 5434 67.1 118 Ladies Tees: White 5434 71.6 128 Aqua 5073 69.6 123 Red 4601 66.9 115 Amenities Gated Community One Private Golf Course Aqua Driving Range Clubhouse Fitness Center Community Pool Tennis Courts Bocce Ball Courts Pickleball Courts Where is Forest Glen Golf & Country Club Located Forest Glen Golf & Country Club 3855 Forest Glen Blvd. Naples, FL 34114 239.354.1898 Visit Club Website Back to Naples Golf Communities Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.golfify.io/courses/forest-glen-golf-country-club",
      "text": "Forest Glen Golf & Country Club, Florida - Full Scorecard and Ratings GOLFIFY Courses Pricing Knowledge Base Blog Log In Playing Forest Glen Golf & Country Club soon? Experience it like the pros, try our realtime leaderboards free today. Forest Glen Golf & Country Club 3855 Forest Glen Blvd Naples Florida, United States of America +1 (239) 354-1898 gm@forestglengcc.com Forest Glen Designer / Architect: Gordon G. Lewis/R-Arthur Hills/Steven Forrest Type by: Parkland Opened: 1966 Guest Policy: Closed Course & Slope Ratings Color Tee Course Rating Slope Rating Distance Black 73.2 144 6805 Gold 71.2 137 6427 Back Hybrid 70.3 135 6215 Forest 69.5 121 5944 Mid Hybrid 68.3 120 5661 White 67.1 118 5434 White (L) 71.6 128 5434 Aqua 65.5 107 5073 Aqua (L) 69.6 123 5073 Front Hybrid 67.8 119 4798 Red 66.9 119 4601 Full Scorecard Hole Black Gold Back Hybrid Forest Mid Hybrid White White (L) Aqua SI Par Aqua (L) Front Hybrid Red SI Par 1 412 386 386 374 351 351 351 310 9 4 310 310 276 11 4 2 353 338 299 299 299 283 283 266 13 4 266 246 246 13 4 3 541 515 515 492 443 443 443 438 5 5 438 407 407 7 5 4 470 444 417 417 375 375 375 334 1 4 334 334 329 1 4 5 187 178 165 165 165 132 132 120 15 3 120 103 103 15 3 6 600 567 522 522 470 470 470 460 3 5 460 410 410 3 5 7 161 139 161 116 116 101 101 92 17 3 92 92 75 17 3 8 431 404 374 374 374 324 324 316 7 4 316 316 283 9 4 9 410 373 345 345 345 329 329 304 11 4 304 260 260 5 4 OUT 3565 3344 3184 3104 2938 2808 2808 2640 36 2640 2478 2389 36 10 556 534 534 498 485 485 485 425 8 5 425 425 391 12 5 11 203 194 175 175 175 154 154 141 12 3 141 125 125 8 3 12 363 347 363 336 336 313 313 276 2 4 276 276 256 2 4 13 276 271 276 251 251 232 232 217 16 4 217 217 202 16 4 14 300 287 300 275 275 263 263 239 14 4 239 221 221 6 4 15 344 330 330 286 286 264 264 245 18 4 245 245 206 18 4 16 416 400 362 362 325 325 325 319 4 4 319 300 300 4 4 17 229 214 185 185 152 152 152 141 6 3 141 124 124 14 3 18 553 506 506 472 438 438 438 430 10 5 430 387 387 10 5 IN 3240 3083 3031 2840 2723 2626 2626 2433 36 2433 2320 2212 36 Total 6805 6427 6215 5944 5661 5434 5434 5073 72 5073 4798 4601 72 Download the Golfify app to score your round with live leaderboards and update tee information instantly, or send us an email at support@golfify.io . We will be happy to help! Lightning Fast Live Scoring, Leaderboards and More. Get Started for Free. Good to Know Privacy Terms of Use Deleting Your Account Resources Bulk Upload Template Blog Contact Us support@golfify.io Golfify Ltd © 2024"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "text": "MEET THE MANAGEMENT TEAM - The Glen Club Skip to primary navigation Skip to main content Facebook Instagram Twitter YouTube MEMBERS ONLY NON-MEMBER TEE TIMES GIFT CARDS The Glen Club Home ABOUT ABOUT ACCOLADES PHOTO GALLERY Purchase Gift Cards CONTACT E-CLUB MEET THE MANAGEMENT TEAM DIRECTIONS Illinois Golf Hall of Fame WGA – Evans Scholars Foundation Tours NV5 Invitational presented by Old National Bank Golf Daily Fee Tee Time Booking GOLF COURSE INFORMATION HOLE-BY-HOLE 2025 GOLF RATES DRIVING RANGE RATES & INFORMATION THE GOLF SHOP GOLF LESSONS GOLF OUTINGS FREQUENT FAIRWAYS CHICAGOLAND HOLE IN ONE PROMOTION MEMBERSHIP EVENTS SPECIAL EVENTS WEDDINGS WEDDING SHOWERS BABY SHOWERS BAR/BAT MITZVAHS MEMORIAL LUNCHEONS MEETINGS Venue Video Tour EVENT SPACE SPECIFICATIONS HOTEL HOTEL Book Now View, Change Or Cancel Your Reservation Dining GRILL GRILL GRILL MENU Book Your Grill Reservation Upcoming Events JOIN OUR DINER’S CLUB Join Team CURRENT OPENINGS Employment Application – English Employment Application – Spanish MEET THE MANAGEMENT TEAM At The Glen Club, our dedicated management team is the heart of our exceptional guest experience. With years of industry expertise, hospitality leadership, and a passion for excellence, our team works behind the scenes—and on the front lines—to ensure every event, round of golf, and visit exceeds expectations. Get to know the people who make The Glen Club one of the premier destinations for golf, weddings, dining, and events in the North Shore. Click below to learn more about each member of our leadership team, their roles, and what drives their commitment to The Glen Club experience. General Manager Joe Titus · General Manager Joe joined The Glen Club team in January, 2025. Joe has been a valued senior leader with KemperSports for over 19 years, previously serving as the General Manager at Hawthorn Woods Country Club and currently as a regional manager. He was elected to PGA Membership in 2005 and had brief stints on the east coast and at White Deer Run Golf Club in Vernon Hills. His passion for golf led him to a spot on the Arizona State Golf Team and he completed his degree in Marketing after transferring to Illinois State University. Joe continues to up the standard in the club industry and brings an unfound passion for the Members. Contact Phone: 847-832-6415 Email: jtitus@theglenclub.com Dustin Heilmann · Assistant General Manager For Dustin Heilmann, the most important tool in hospitality is a sincere smile. the foundation of great hospitality starts with a strong team and positive energy, a philosophy Heilmann plans to execute throughout his role at The Glen Club. Heilmann has exercised his inherent talent for guest service at several Chicago hotspots including Carmine’s and Nico Osteria, one of the most highly anticipated openings of 2013 in the culinary world. Working closely with notable industry leaders Chef Paul Kahan and Donnie Madia, Nico Osteria was named one of America’s 25 Best Restaurants by GQ and one of the best new restaurants by Esquire in 2014. Outside of his role as Food and Beverage Director, Heilmann enjoys reading about history and spending time outdoors – especially golfing, running and skiing. Heilmann is an avid music fan, and his diverse tastes includes Prince, Willie Nelson, Michael Jackson and his absolute favorite The Grateful Dead. If Heilmann could invite four guests to dinner, he’d dine with his father, Winston Churchill, Abraham Lincoln and Bob Dylan. Heilmann and his wife Lexington and daughter Freddie live in the Edgewater Beach neighborhood in Chicago. Contact Phone: 847-832-6402 Email: dheilmann@theglenclub.com Sales · Membership · Marketing Kate Vivacue · Director of Sales Kate joined The Glen Club in July 2021, bringing a wealth of experience and a passion for event coordination. A 2019 graduate of the University of Dayton, Kate launched her career as a catering project manager with SBR Events Group, where she excelled in managing and executing a variety of events. While at Dayton, she served as president of the campus activities board, organizing numerous events for her peers on and off campus, which helped her develop strong leadership and planning skills. Her enthusiasm for creating unforgettable experiences has quickly made her an integral part of The Glen Club’s event team. When not collaborating with clients to plan their dream events, Kate enjoys spending time with her husband, Matt, playing games, solving puzzles, and playing volleyball. She also loves catching up on The Office with Matt, as well as spending quality time with family and friends. After tying the knot at The Glen Club in November 2023, the venue holds a special place in Kate’s heart, adding even more meaning to her work. Whether she’s planning events or making memories with loved ones, Kate brings joy and energy to everything she does. Contact Phone: 847-832-6434 Email: kvivacue@theglenclub.com Lauren Henzlik · Event Sales Coordinator After establishing herself in a thriving career in dental assisting, Lauren decided to follow her heart into event coordinating at The Glen Club. Armed with a rich combination of customer-centric abilities, meticulous attention to detail, and an unwavering commitment to crafting unforgettable experiences, she steps into her new role with fervor. Lauren’s track record speaks volumes, showcasing her adeptness in nurturing client relationships and her drive to surpass expectations, all in the service of elevating The Glen Club’s events program. Outside of work, Lauren cherishes moments with loved ones, cheers for the Chicago Bears alongside her boyfriend despite her allegiance to the Minnesota Vikings, and finds solace in revisiting episodes of Friends or The Office. Contact Phone: 847-832-6431 Email: lhenzlik@theglenclub.com Mia McDermed · Marketing and Communications Coordinator and Admin After earning her BBA in Marketing from Loyola University Chicago, Mia joined The Glen Club as the Marketing and Communication Coordinator. She brings a creative, detail-oriented mindset shaped by experience in brand strategy, digital marketing, and event promotion. From developing marketing plans for national brands to supporting a nonprofit’s mission by leading events and growing digital presence in Rome, her work reflects a strong work ethic, a passion for storytelling, and a talent for connecting with people. She’s excited to bring her creativity and communication skills to elevate The Glen Club’s brand and guest experience. Outside of work, she enjoys decorating cakes, going to concerts, and rewatching her favorite TV shows. Contact Phone: 847-832-6420 Email: mmcdermed@theglenclub.com Golf Operations Ethan Roush · Head Golf Professional, PGA Ethan came to The Glen Club in 2013 and was promoted from assistant golf professional to his current role of head golf professional in 2016. He’s responsible for overseeing all areas of the golf operations, including daily operations, member events, private golf tournaments, merchandising and staffing while also delivering premier instruction to both members and non-members. Ethan came to The Glen Club from Bolingbrook Golf Club where he spent three years as an assistant golf professional. Prior to entering the golf business, he competed for prize money as a playing professional on Texas’ Tight Lies Tour. Ethan and his wife are parents to two daughters. Contact Phone: 847-832-6451 Email: eroush@theglenclub.com Anna Cullinan · First Assistant Golf Professional Anna joined The Glen Club in February 2020 after spending six seasons at Iowa’s Davenport Country Club (DCC), the last two of which were spent serving as the club’s assistant golf professional. She brings extensive experience serving private club members as well as organizing leagues, clinics and member games. Prior to working at DCC, Anna was a four-year starter on Western Illinois University women’s golf team. She’s currently enrolled in the PGM Associate Program and is working towards becoming a full member of the Professional Golfers’ Association of America. Contact Phone: 847-832-6452 Email: acullinan@theglenclub.com Adam Wiles · Superintendent Adam took over as superintendent of The Glen Club in 2020 after serving four years as the assistant superintendent at Royal Melbourne Country Club in Long Grove, Ill. A graduate of Michigan State University with a degree in Turf Science, Adam got his start in Chicago golf working at Conway Farms Golf Club. An avid golfer who enjoys lacing up his hockey skates in the winter, Adam also enjoys kayaking and playing tennis. Contact Phone: 847-724-5716 Email: awiles@theglenclub.com Florencio Montelongo · Assistant Golf Course Superintendent One of the club’s longest tenured staffers, Florencio’s career at The Glen Club began in 2000 when they were still growing in the golf course. He brings a lot of experience because of his wealth of knowledge regarding the property. Florencio can be seen on the golf course most days supporting his favorite sports team: the Chicago Cubs. Contact Phone: 847-724-5716 Dustin Kreft · Outside Services Manager Dustin has been a part of The Glen Club team since opening day in 2001. A native of Glenview, he started out as a caddie/cart attendant and has since worked his way up to his current role of outside services manager. His responsibilities include the day-to-day function of the outside services and caddie program in addition to working with the Western Golf Association’s Evans Scholars Program , the nation’s largest scholarship program for caddies. Dustin even met his wife at The Glen Club while he was caddying and she was driving the beverage cart. Contact Phone: 847-832-6410 Email: dkreft@theglenclub.com Food and Beverage Clinton Dew · Executive Chef Chef Clinton Dew began his culinary journey at Big Jones, one of Chicago’s most esteemed restaurants located in Andersonville. As a line cook, he honed his craft under the mentorship of three-time James Beard Award nominee, Chef Paul Fehribach. This invaluable experience with Chicago’s iconic Southern cuisine resonated with Dew’s roots in Tennessee, near Johnson City. Following this, Chef Dew advanced to the role of Sous Chef at White Oak Tavern and Inn in Chicago, where his dedication and culinary talent quickly earned him a promotion to Executive Chef. During his time there, he also gained significant experience in Front of House operations, further expanding his expertise. In the winter of 2017, Chef Dew answered the call of the South. With another harsh Chicago winter approaching, he seized the opportunity to enter the club world as the Executive Banquet Chef at The Olde Farm in Bristol, VA. There, he successfully managed events for up to 4,000 guests, including high-profile clients such as Jack Nicklaus, Lee Trevino, and Peyton Manning. After three years in the South, Chef Dew returned to the Midwest to start a family, finding it the ideal place to settle. As the Executive Sous Chef at Indian Hill Club in Winnetka, Chef Dew played a pivotal role in overseeing all aspects of the food and beverage operations. Chef Dew now resides in Rogers Park with his wife, Janet, and their daughter, Winter Rose. Contact Phone: 47-832-6437 Email: cdew@theglenclub.com Ron Fischer · Executive Sous Chef Chef Ron has been at The Glen Club since 2007. Previously, he served as the executive chef at both Oak Park and Ruth Lake Country Clubs, executive sous chef at the East Bank Club and helped open Hotel Nikko Chicago. In addition, he’s worked at and consulted with various Chicagoland restaurants to create menus and kitchen layouts. The youngest graduate of the French culinary school, Dumas Pierre, which used to be in Glenview, Chef Ron received his associate degree from the Culinary School of Kendall College while also serving as a teacher’s assistant during its opening. During school, he entered and won a medal in a cooking competition at the annual Chicago Food & Restaurant show. Contact Phone: 847-724-7272 Email: rfischer@theglenclub.com Stephen Gustafson · Sous Chef Growing up in Niles, Illinois, Stephen’s love for cooking was born at a young age from helping his mother. After attending Kendall College in Chicago, Stephen started his culinary career at Café Touché, where he worked his way up from intern to executive chef by 2018. From there, he served on the management team as executive sous chef for the opening of Zia’s Social in Norwood Park. Outside of work, Stephen enjoys long drives in his S2000 and hanging out with his dog, Clutch. Contact Phone: 847-724-7272 Email: sgustafson@theglenclub.com George Ott · Assistant Director Of Food and Beverage George inherited his passion for the hospitality industry from his father, who spent 30 years as a Golf Course Superintendent. Inspired by his father’s dedication, George became an Evan Scholar while working at Hillcrest Country Club during high school. He then embarked on an 8-year journey with Levy Restaurants, gaining valuable experience at venues like Arling Racetrack and the United Center. Eager to expand his knowledge, George joined Marriott Hotels for 6 years, taking on various management roles. His next challenge was as the Food and Beverage Manager at Twin Orchard Country Club, where he delved into the intricacies of club management. This experience paved the way for George to become the Assistant Director of Food and Beverage at Evanston Golf Club, where he honed his skills in overseeing larger operations. At Evanston Golf Club, George excelled in creating memorable experiences for members and guests alike, fostering strong team collaboration and member engagement. Now, armed with a wealth of expertise, George is ready to bring his passion and dedication to The Glen Club, where he aims to deliver exceptional service to all. Contact Phone: 847-724-7272 Email: gott@theglenclub.com Vlad Pikovskiy · Restaurant Manager Vladimir started his profession in Vernon Hills as a server who found his passion in the culinary world through his family’s love for cooking and restaurants. After finishing his degree in writing, he didn’t hesitate to help his cousin open the Intercontinental Hotel in Downtown Los Angeles. This led to his expansion of experience which included being a lead server at the Michelin star restaurant Jua, in the Flatiron District of New York City, task force as the assistant general manager at the Rockin’ Pig in Eureka Springs Arkansas, and managing the famous Carousel Bar at the Hotel Moneteleone in the French Quarter of New Orleans. Vladimir’s comes from a Ukrainian background with family that have been in the restaurant industry most of their lives. He enjoys traveling and dining in upscale restaurants and hotels and finds most of his comfort at home with his friends and family. In his spare time you can find him playing drums, rewatching classic blockbuster films, or trying out the new local ramen spot. Contact Phone: 847-724-7272 Email: vpikovskiy@theglenclub.com Telma Gomez · Halfway House/Beverage Cart Supervisor Telma began her career in food and beverage at Highland Park Country Club in 2001 and worked there until 2017 before joining The Glen Club. During her time here, she’s served as a banquets supervisor and captain, and now oversees the halfway house and beverage cart operations. In her free time, Telma enjoys baking cookies and playing and walking her three dogs, Tommy, Lucky and Merlin. Contact Phone: 847-724-7272 Email: tgomez@theglenclub.com Hotel · Clubhouse Colleen Husted · Clubhouse and Hotel Manager Colleen joined The Glen Club in July 2021, bringing with her over a decade of diverse experience in the hospitality industry. Her background spans several areas, including lodging, food and beverage, and golf management. Colleen’s extensive expertise and passion for the industry have made her a valuable addition to the team at The Glen Club, where she continues to contribute her skills and knowledge. Outside of work, Colleen cherishes spending quality time with her husband and son. Her love for exploration and adventure has led her to visit over 30 U.S. states and more than 10 countries. Whether she’s traveling or enjoying time with her family, Colleen finds joy in discovering new places and experiences. Contact Phone: 847-832-6613 Email: chusted@theglenclub.com Carl Franzen · Maintenance Manager Carl brings a wealth of experience to The Glen Club, with over 35 years in automotive and industrial maintenance. As a Ford Master Technician, Carl has a knack for fixing just about anything, always leading with compassion and expertise. He also spent six years as Maintenance Manager at an aerospace production company, further honing his skills. In his free time, Carl manages a private collection of 54 classic cars, a passion he’s pursued for the past 11 years. His hobbies include woodworking in his Mundelein basement, motorcycling with his wife of over 45 years, and spending quality time with his two grandsons. Carl is also dedicated to volunteer work, having rescued more than 15 dogs through the Illinois St. Bernard Rescue over the years. Contact Phone: 847-724-7272 Email: cfranzen @theglenclub.com Accounting Jonathan Ezzi · Club Controller Jonathan joined The Glen Club in February 2021. He has a widespread background in food and beverage management along with finance and accounting experience, most recently working for Aramark as the unit controller at Soldier Field. Prior to that, he worked for Levy Restaurants in their PGA division as a finance manager. An avid golfer who also plays ice hockey, Jonathan enjoys going to White Sox and Blackhawks games with his wife when away from The Glen Club. Contact Phone: 847-832-6405 Email: jezzi@theglenclub.com Sharon Radojevich · Accounting Assistant In 2022, Sharon became a member of the Glen Club. Her extensive accounting career spanned 40 years, during which she served as Controller for a Housing, Registration, and Event Company, and for the last 15 years, she held the position of Controller at a Food Distribution Company. Upon the sale of the company, Sharon chose to retire. However, after 7 months of retirement, she came across an advertisement for a part-time accounting assistant position at the Glen Club. Since then, she has been relishing her semi-retirement while working alongside her colleagues and club members. Outside of work, Sharon cherishes moments spent with her four grandchildren, indulges in gardening, and explores new destinations with her husband. Contact Phone: 847-832-6436 Email: tgcap@kempersports.com Page Footer Contact Us Address : 2901 West Lake Ave Glenview, IL 60026 Phone : (847) 724-7272 Email : info@theglenclub.com Copyright © 2025 The Glen Club All Rights Reserved. Powered by Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://floridabundledgolf.com/forest-glen-bundled-golf-community-naples-florida/",
      "text": "Forest Glen Golf & Country Club Naples FL: Homes For Sale and Real Estate - Florida Bundled Golf Skip to content Menu Menu Home Property Search Bundled Golf Map Market Report Testimonials Meet Steve’s Team Contact Us Forest Glen Golf & Country Club Naples FL:  Homes For Sale and Real Estate Luxury Golf Community Living in Naples, Florida Forest Glen Golf & Country Club is Naples Florida’s premier private, gated golf community, offering residents an exclusive bundled lifestyle experience. This exceptional golf community in Naples FL combines championship golf, world-class amenities, and serene natural surroundings across 630 pristine acres. Championship Golf Course Design Award-Winning Arthur Hills Golf Course In 2008, renowned golf course architects Arthur Hills and Steve Forrest redesigned Forest Glen’s extraordinary 18-hole championship layout. The course features: 6,820 yards of challenging championship golf Sea Isle Supreme Paspalum fairways for optimal playing conditions Tif-Eagle greens providing superior putting surfaces Professional-grade course conditions year-round Complete Recreational Amenities Forest Glen Golf & Country Club offers comprehensive recreational facilities including: Championship Golf Course – 18 holes of Arthur Hills design Tennis Programs – Professional instruction and league play Pickleball Courts – Fast-growing sport facilities Bocce Ball – Traditional recreational gaming Fine & Casual Dining – Multiple dining venues on-site Prime Naples Florida Location Convenient Access to Naples Attractions Forest Glen’s strategic location east of Collier Boulevard (County Road 951) provides residents with: 15-minute drive to Gulf of Mexico beaches 15-minute drive to Naples downtown Fifth Avenue South World-class shopping and restaurants nearby 20-minute drive to Marco Island’s pristine beaches Natural Preserve Setting Experience tranquil living within a vast nature preserve, offering: Abundant wildlife viewing opportunities Peaceful walking trails Natural Florida landscape preservation Serene, private community atmosphere Forest Glen Real Estate Naples FL This exclusive gated community spans 630 acres of meticulously maintained grounds, providing residents with: Private, secure living environment Bundled golf community lifestyle Premium real estate values Low-density residential development Why Choose Forest Glen Golf & Country Club? Forest Glen Golf & Country Club Naples Florida represents the pinnacle of luxury golf community living, combining: Championship golf course design Comprehensive recreational amenities Prime Naples location Natural preserve tranquility Exclusive private community lifestyle Discover your perfect Naples Florida golf community home at Forest Glen Golf & Country Club – where luxury meets nature in Southwest Florida’s most desirable location. The Steve Schoepfer Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. We are available to answer all your questions. Call 239-564-3877. Forest Glen 2025 Club Dues and Fees CONTACT US TODAY TO LEARN MORE ABOUT THE HOMES FOR SALE IN FOREST GLEN GOLF & COUNTRY CLUB IN NAPLES FLORIDA REALTOR® Steve Schoepfer serving Collier & Lee Counties 8950 Fontana Del Sol Way Ste. 100 Naples, FL 34109 27399 Riverview Center Blvd. Ste. 101 Bonita Springs, FL 34134 Connect with Steve DIRECT: 239.564.3877 steve@gulfaccess.net © 2025 Florida Bundled Golf • Built with GeneratePress"
    },
    {
      "url": "https://www.sherwoodforestcc.com/contact/",
      "text": "Contact - Sherwood Forest Golf and Country Club Skip to content Home President’s Letter Kingsview Development BOOK A TEE TIME Golfing BOOK YOUR CAMPSITE Restaurant Outdoor Activities Events Pickleball Contact Facebook Call 306-545-0330 Contact pmdms 2025-08-29T22:02:56-04:00 Send us a message anytime! Whether you need information on our course, venues, camping, pool, or anything in between – a member of our team will be happy to help you. Get in touch with us using the following form, we’ll be in touch with you in 24-48 hours. Your Name (required) Your Email (required) Subject Your Message × (306) 545-0330 gm@sherwoodforestcc.com Members Harassment Policy & Code of Conduct × Work Order Request Form Member Name (required) Date (required) Lot Number (required) Description (required) × Close General Manager GENERAL MANAGER (306) 536-8576 gm@sherwoodforestcc.com Morgan Schonhoffer SUPERINTENDENT (306) 519-7472 book a tee time Contact Info Box 16 , RR# 2 Regina, SK S4P 2Z2 Canada (306) 545-0330 gm@sherwoodforestcc.com Explore Home Events Outdoor Activities Golfing Contact Kingsview Development © Copyright | Sherwood Forest Golf and Country Club | Privacy Policy | Wireless Terms of Access × Book a tee time Tee-On Golf Systems Inc. Close Page load link Go to Top"
    }
  ]
}