{
  "fuentes": [
    {
      "url": "https://genius.com/Crippled-black-phoenix-we-forgotten-who-we-are-lyrics",
      "email": "inquiry@genius.com"
    },
    {
      "url": "https://www.forgottentonic.com/menu-black-lagoon",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.easyleadz.com/company/tonic-worldwide",
      "email": "xxxx@tonicworldwide.com"
    },
    {
      "url": "https://www.forgottentonic.com/menu",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "email": "atlassian@devsamurai.com"
    },
    {
      "url": "https://teamboard.cloud/",
      "email": "atlassian@devsamurai.com"
    },
    {
      "url": "https://www.tonichousing.org.uk/contactus",
      "email": "info@tonichousing.org.uk"
    },
    {
      "url": "https://www.tonichousing.org.uk/contactus",
      "email": "info@tonicliving.org.uk"
    },
    {
      "url": "https://www.tonichousing.org.uk/contactus",
      "email": "press@tonichousing.org.uk"
    },
    {
      "url": "https://historiccoastculture.com/business/forgotten-tonic/",
      "email": "inquiry@forgottentonic.com"
    },
    {
      "url": "https://historiccoastculture.com/business/forgotten-tonic/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/business/forgotten-tonic/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.tonichealth.co/en-us/pages/contact",
      "email": "sinead@tonichealth.co"
    },
    {
      "url": "https://www.tonicworldwide.com/contact",
      "email": "dubai@tonicworldwide.com"
    },
    {
      "url": "https://www.tonicworldwide.com/contact",
      "email": "india@tonicworldwide.com"
    },
    {
      "url": "https://www.tonicworldwide.com/contact",
      "email": "india@tonicworldwide.com"
    },
    {
      "url": "https://www.forgottentonic.com/private-events",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.forgottentonic.com/team",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.forgottentonic.com/staff-appreciation-fee",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.forgottentonic.com/",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://tonicsiteshop.com/contact/",
      "email": "ciera@tonicsiteshop.com"
    },
    {
      "url": "https://tonicsiteshop.com/contact/",
      "email": "info@tonicsiteshop.com"
    },
    {
      "url": "https://www.forgottentonic.com/holiday-miracle",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.forgottentonic.com/contact",
      "email": "info@forgottentonic.com"
    },
    {
      "url": "https://www.logovisual.com/product/visual-thinking-solutions/visual-thinking-products/whiteboard-process-tool-kits/team-board/",
      "email": "sales@logovisual.com"
    }
  ],
  "mails": [
    "atlassian@devsamurai.com",
    "ciera@tonicsiteshop.com",
    "dubai@tonicworldwide.com",
    "india@tonicworldwide.com",
    "info@forgottentonic.com",
    "info@reception-plus.de",
    "info@tonichousing.org.uk",
    "info@tonicliving.org.uk",
    "info@tonicsiteshop.com",
    "inquiry@forgottentonic.com",
    "inquiry@genius.com",
    "press@tonichousing.org.uk",
    "sales@logovisual.com",
    "sinead@tonichealth.co",
    "sjcc@historiccoastculture.com",
    "x@2x.png",
    "xxxx@tonicworldwide.com"
  ],
  "nombre_sitio": "forgottentonic.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://genius.com/Crippled-black-phoenix-we-forgotten-who-we-are-lyrics",
      "text": "Crippled Black Phoenix – We Forgotten Who We Are Lyrics | Genius Lyrics Music IQ Featured Charts Videos Promote Your Music Sign Up 1 We Forgotten Who We Are Crippled Black Phoenix Track 1 on The Wolf Changes Its Fur But Not Its Nature Jun. 8, 2012 1 viewer 8.3K views 6 Contributors We Forgotten Who We Are Lyrics We've forgotten who we are as men Make their own history, still they know They are chained and bound by all the past Traditions of dead generations So let's raise this bitter glass to us never getting through When I look into your eyes, I can see you see it too For I know that you believe in truth I try to channel Hughes Though you doubt me inconsequentially it gives me more to prove Was there some hidden grin within your face when we met last win- Ter? Our past still looms over us as we pretend to be friends. We Exist through history, inquiry and knowledge acquired by Investigation. You're like some poor Pharaoh, (but) no more meek tales of past Seasons, for tonight we must make haste. You are the hunted King, un- Crowned. Cars collide with horses, like mere stings of Civilisations 'Those who cannot remember the past are condemned to repeat it.' To quote George Santayana You might also like 1 Embed Cancel How to Format Lyrics: Type out all lyrics, even repeating song parts like the chorus Lyrics should be broken down into individual lines Use section headers above different song parts like [Verse], [Chorus], etc. Use italics ( <i>lyric</i> ) and bold ( <b>lyric</b> ) to distinguish between different vocalists in the same song part If you don’t understand a lyric, use [?] To learn more, check out our transcription guide or visit our transcribers forum About Have the inside scoop on this song? Sign up and drop some knowledge Start the song bio Q&A Find answers to frequently asked questions about the song and explore its deeper meaning Ask a question When did Crippled Black Phoenix release “We Forgotten Who We Are”? The Wolf Changes Its Fur But Not Its Nature (2024) Crippled Black Phoenix 1. We Forgotten Who We Are 2. You Put the Devil in Me 3. 444 (Rerelease) 4. Goodnight, Europe, Pt. II 5. (-) (The Wolf Changes Its Fur But Not Its Nature) 6. Song for the Unloved 7. Whissendine 8. Blizzard of Horned Cats I, Vigilante (2010) Crippled Black Phoenix Expand Credits Released on June 8, 2012 Tags Rock Post-Rock Progressive Rock Expand Comments Add a comment Sign Up And Drop Knowledge 🤓 Genius is the ultimate source of music knowledge, created by scholars like you who share facts and insight about the songs and artists they love. Sign Up Genius is the world’s biggest collection of song lyrics and musical knowledge About Genius Contributor Guidelines Press Shop Advertise Privacy Policy Licensing Jobs Developers Copyright Policy Contact Us Sign In Do Not Sell My Personal Information © 2025 ML Genius Holdings, LLC Terms of Use Verified Artists All Artists: a b c d e f g h i j k l m n o p q r s t u v w x y z # Hot Songs: Was ich mach Your Song HUNTR/X - Golden (Romanized) Creep Lose Yourself View All"
    },
    {
      "url": "https://www.forgottentonic.com/menu-black-lagoon",
      "text": "Menu – Black Lagoon — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations BLACK LAGOON COCKTAILS APPETIZERS SOUP & SALAD KIDS SIDES MAINS NON-ALCOHOLIC DESSERT BLACK LAGOON COCKTAILS $ 15 NOSFERATU'S RISE Coconut-Washed Lot 40 Rye, Whisky, Cinnamon, Lustau Amontillado Sherry, Bitter Queens Caribbean Bitters $ 15 $ 15 MEMENTO MORI Mezcal Union, Giffard Banane, Mr. Black Cold Brew Liqueur, Cold Brew, Bitter Queens Chinese 5 Spice Bitters $ 15 $ 13 HEX APPEAL Fords Gin, Honeydew, Lemon, Lustau Vermut Dry, Seltzer, Absinthe $ 13 $ 15 FRANK'S FIX American Vodka, Carrot, Miso Falernum, Coconut, Lustau Fino Sherry, Chinese 5 Spice Bitters $ 15 Available Non-Alc 11 $ 17 NIGHTMARE FUEL Blanco Tequila, Giffard Mangue, Matcha, Lime, Bitter Queens Thai Spice Bitters $ 17 $ 17 SIREN'S SONG Lot 40 Rye Whisky, Giffard Caribbean Pineapple, Jamaican Rum, Spice Oat Orgeat, Lustau, Amontillado Sherry, Lime, Caribbean Bitters $ 17 SPIRIT FREE OFFERINGS $ 11 WITCHING HOUR Matcha, Lemon, Honeydew, Cucumber Tonic $ 11 $ 11 BLOODLUST Giffard Non-Alcoholic Aperitif, Miso Falernum, Rooibos Tea, Lemon, Ginger Beer $ 11 SHOOTERS $ 10 PARANOIA Ford's Gin, Coconut, Lime, Thai Spice $ 10 $ 10 PSYCHOSIS Lot 40 Rye Whisky, Miso Falernum, Lemon $ 10 APPETIZERS $ 9 WARM BREAD Warm focaccia lightly brushed with a rich butter glaze. Served with a seasonal compound butter. $ 9 dairy free option +1 $ 12 MONTENEGRO MEATBALLS Ground beef meatballs infused with Amaro Montenegro and exotic spices, mixed with almonds and onions, served over a rich herbed cream sauce. $ 12 $ 11 BRUSCHETTA Oven-roasted grape tomatoes and garlic atop thick-cut toast, with melted mozzarella, basil chiffonade, and a balsamic reduction. $ 11 $ 9 ROASTED GARLIC HUMMUS Classic hummus blended with roasted garlic, tahini, and cumin, served with toasted bread and crudités, and garnished with parsley, confit onions, and garlic. $ 9 $ 9 MARINATED OLIVES A vibrant blend of Greek olives marinated with turmeric, za’atar, rosemary, garlic, capers, citrus zest, and a hint of cinnamon and curry, garnished with fresh parsley. $ 9 MP CHARCUTERIE BOARD Chef’s selection of cured meats & cheeses accompanied by toasted bread, cornichons pickles & olives. MP $ 12 CRISPY ARTICHOKE A playful twist on spinach artichoke dip, with cornstarch-coated artichoke hearts deep-fried to crispy perfection, served with a herbed cheese spinach dipping sauce, and topped with a sprinkle of Parmesan cheese. $ 12 $ 14 BAKED BRIE Creamy brie encased in golden puff pastry topped with melba sauce, almonds, cranberry & orange zest. Served with fresh fruit & crackers. $ 14 $ 14 CAJUN EGG ROLLS Crispy egg rolls filled with blackened chicken, cream cheese, chili paste, cabbage & black beans, served with a bold spicy ranch sauce for dipping. $ 14 SOUP & SALAD Half 10\n                  \n                    /\n                  \n                     Whole 18 CAESAR SALAD Crisp romaine hearts with garlic croutons, shaved Parmesan, anchovy fillets & a creamy Caesar dressing. Half 10\n                  \n                    /\n                  \n                     Whole 18 add blackened chicken thigh +10 Half 10\n                  \n                    /\n                  \n                     Whole 18 FT HOUSE SALAD Vibrant mix of leafy greens, cucumber, tomatoes, red onion, gorgonzola, dried cranberries & shaved carrots. Tossed in a rich balsamic vinaigrette. Half 10\n                  \n                    /\n                  \n                     Whole 18 add grilled shrimp +12 MP SEASONAL SALAD Chef’s choice of seasonal greens & dressing, ask your server for details. MP $ 9 SHRIMP BISQUE Rich and creamy blend of heavy cream, white wine, seafood stock, and sautéed onions, accented by a hint of sriracha and topped with fresh basil chiffonade. $ 9 KIDS $ 12 I DON’T WANT THAT Pasta sauteed with parmesan and garlic. $ 12 $ 12 I’M NOT HUNGRY Toasted flatbread with melted havarti and parmesan cheese. $ 12 add bacon +3 $ 12 I DON’T KNOW Texas toast Grilled cheese with shaved parmesan & havarti cheeses with french fries. $ 12 add bacon +3 $ 12 I DON’T CARE Hamburger on a pretzel bun with french fries. $ 12 add havarti cheese +2 SIDES $ 11 FRENCH FRIES Seasoned french fries with roasted garlic aioli and sweetened & puréed tomatoes. $ 11 trufflize it +3 $ 13 STIR FRY ANCIENT GRAINS Blend of black, brown, red & white rice stir fried with carrots, green onion, spinach & Korean BBQ sauce. $ 13 $ 11 FOUR CHEESE GRITS Creamy stone-ground grits blended with a rich quartet of havarti, parmesan, asiago & romano cheeses, finished with green onion. $ 11 $ 13 MASHED POTATOES Fluffy golden fingerling potatoes mashed with local milk & butter. Seasoned with roasted garlic, thyme & white pepper. $ 13 trufflize it +3 $ 13 BRAISED CABBAGE Cabbage slowly cooked in vinegar, butter & bacon fat with onions, celery, garlic and peppers. $ 13 $ 9 CITRUS SLAW A crisp blend of seasonal vegetables & cabbage tossed in a refreshing vinaigrette with green onion & parsley. $ 9 $ 11 ROASTED ROOT VEGETABLE Roasted parsnips, sweet potato, carrot, kale, red onion and bell pepper seasoned with salt, pepper and olive oil. $ 11 $ 11 CORN & POBLANO SALAD Charred corn and poblano pepper tossed with lime juice, diced onions, garlic, and a hint of cayenne, seasoned with salt, pepper, and gaucho elote seasoning. $ 11 MAINS $ 21 FISH SANDWICH Grilled or blackened redfish topped with crisp leafy greens, sliced tomato & red onion on cuban bread. Dressed with dill tartar and a side of crispy French fries. $ 21 $ 13 ROOT VEGETABLE FLATBREAD Naan bread topped with creamy maple mascarpone, roasted fall vegetables, crunchy pepitas, and finished with a drizzle of balsamic glaze and a sprinkle of za’atar. $ 13 $ 19 VEGGIE BURGER Grilled plant-based patty served on a toasted pretzel bun. Masterfully topped with crisp spinach, juicy tomato slices, sharp red onion & avocado and finished with a generous dollop of our signature vegenaise. $ 19 add havarti cheese +3 $ 19 FT BURGER Juicy ground beef topped with melted havarti, caramelized onions, bacon & pickles. Dressed with FT sauce on a warm pretzel bun, accompanied by french fries. $ 19 $ 19 CHICKEN THIGH SANDWICH Juicy chicken thigh paired with chimichurri aioli, fresh arugula, and sliced tomatoes, all served on a soft pretzel bun with crispy fries. $ 19 $ 19 PBLT Pepper-dusted griddled pork belly topped with fresh tomatoes, mixed greens, and mayo, all layered on Texas toast. Served with french fries. $ 19 MP FRESH CATCH Seasonal catch paired with the chef’s handpicked side—ask your server for today’s fresh selection and details. MP $ 19 PASTA ALLA VODKA Simmered carrots, onions & garlic pureed in vegetable stock & tossed with cavatappi pasta. Garnished with crispy breadcrumbs, basil & a mix of European cheeses. $ 19 add grilled chicken thigh +10 $ 17 BIBIMBAP Vibrant mix of sesame-roasted seasonal vegetables & mushrooms paired with steamed wild rice. Generously topped with spicy Korean chili sauce and a sprinkle of furikake for  a touch of umami. $ 17 add tempeh +10 add grilled shrimp +12 MP CHEF'S CUT Chef’s choice of cut & preparation with a seasonally inspired side. MP $ 26 SHRIMP & GRITS ÉTOUFFÉE Spicy blackened shrimp and andouille sausage atop creamy cheese grits, finished with green onion and jalapeño for a bold Cajun-inspired flavor. $ 26 $ 25 SAUTEED MUSSELS Blue mussels and crispy chorizo in a savory seafood stock with garlic, fire-roasted tomatoes, onions & rosemary. Served with hearty, thick-cut bread. $ 25 $ 29 CHICKEN BELLA Juicy confit & roasted half chicken over garlic skin-on mashed potatoes. Topped with fresh spinach, tomato & a rich herbed cream sauce. $ 29 $ 39 PORK CHOP Perfectly seared and roasted pork chop, served alongside southern style vinegar & butter braised cabbage enriched with crispy bacon bits. Complemented with a side of smooth, peppered apple purée. $ 39 NON-ALCOHOLIC N/APEROL SPRITZ Bright & Refreshing. A delightful blend of non alcoholic aperitif with grapefruit soda and seltzer, accented with a touch of salt. Served in a wine glass with a slice of orange. 11 $ 11 PINK CLOVER Floral & Vibrant. Seedlip Notas de Agave non-alcoholic “spirit” combined with a blackberry lemongrass shrub, lemon juice, and aquafaba. Shaken and served up in a coupe for a delicately frothy finish. $ 11 DESSERT $ 11 BOURBON CARAMEL CHEESECAKE Chicago-style cheesecake with a graham cracker crust. Topped with crispy bacon, rich bourbon caramel & a drizzle of chocolate sauce. $ 11 $ 13 FLOURLESS CHOCOLATE TORTE Decadent double-layered torte with rich chocolate ganache. Adorned with fresh raspberries, melba sauce & a dusting of powdered sugar. $ 13 $ 11 TIRAMISU BREAD PUDDING Cold brew-soaked bread and ladyfingers layered with sweetened mascarpone and dusted with rich cocoa powder. $ 11 $ 13 BROWN BUTTER CAKE Warm brown butter cake topped with caramelized apples gently cooked in bourbon brown sugar caramel with cinnamon, allspice, and vanilla, finished with a sprinkle of streusel and a dollop of whipped cream. $ 13 $ 9 CHIA SEED PUDDING Chia seeds hydrated with coconut water, infused with vanilla and coconut extract, and lightly sweetened, topped with granola and a spritz of navy strength Jamaican rum. $ 9 $ 9 CRÈME BRÛLÉE A classic crème brûlée infused with warm fall spices cinnamon, nutmeg, and allspice—topped with caramelized sugar and a dollop of marshmallow fluff. $ 9 PDF MENU Forgotten Tonic  PDF Menu 2024 HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.easyleadz.com/company/tonic-worldwide",
      "text": "Tonic Worldwide - Employees, Business, Industry & CEO | EasyLeadz Loading… Home Phone Number Finder Pricing EasyProspect Start Free Trial Schedule Demo Overview Top Contacts Financials Trademarks GST Competitors Technology Tonic Worldwide - Employees, Business, Industry & CEO View Tonic Worldwide's Top Management Contact Numbers Name Tonic Worldwide Industry Sales, Marketing & Advertising Want to update? Headquarters Mumbai, Maharashtra, India Want to update? Website http://www.tonicworldwide.com Want to update? Social Handles Want to update? Company Type Private Want to update? Company Stage Non Funded Want to update? CEO Not Available Want to update? Specialities Digital Marketing, Social Media, Website Development, Digital Strategy, Search Engine Optimization, Influencer Management Want to update? Contact Number Not Available Want to update? Contact Email Not Available Want to update? Founder Not Available Want to update? No of employees 199 as on 25 Feb 2025 Want to update? Founded Year 2005 Want to update? Revenue 10 to 50 crores as on 25 Feb 2025 Want to update? Owned By Private Want to update? MNC No Want to update? Tonic Worldwide Frequently Asked Questions When was Tonic Worldwide founded? Tonic Worldwide was founded in 2005. Where are Tonic Worldwide headquarters? Tonic Worldwide headquarters are in Mumbai, Maharashtra, India. How many employees does  Tonic Worldwide have? Tonic Worldwide has 199 employees. What sector does  Tonic Worldwide operate in? Tonic Worldwide is in sales, marketing & advertising sector. Is Tonic Worldwide a private company? Yes, Tonic Worldwide is a private company. What does Tonic Worldwide Do ? At tonic worldwide, we brew up a heady concoction of rich research, immersive insights and cutting edge creatives to craft simulating digital experiences. working globally on end-to-end digital solutions that include website development, social media, online reputation management, application development and digital strategy. we are easy, we are fun to work with and we don't give up. What does Tonic Worldwide specialize into ? Tonic Worldwide specialises into Digital Marketing, Social Media, Website Development, Digital Strategy, Search Engine Optimization, Influencer Management Who is the CEO of Tonic Worldwide ? We do not have the information about the CEO of Tonic Worldwide. Our systems are trying to find it, we will update it as soon as we have it. Tonic Worldwide- Phone & Email of Top Employees & Directors Human Resources (HR) HR Head and director View xxxx@tonicworldwide.com 98789***** CEO Chief Executive Officer View xxxx@tonicworldwide.com 98987***** Founder and Cofounder Founder View xxxx@tonicworldwide.com 98340***** MD Managing Director View xxxx@tonicworldwide.com 98907***** Finance Finance Head and Director View xxxx@tonicworldwide.com 98831***** Operations Operations Head and Director View xxxx@tonicworldwide.com 98500***** Information Technology (IT) IT Head and Director View xxxx@tonicworldwide.com 98325***** Sales Sales Head and Director View xxxx@tonicworldwide.com 98392***** Marketing Marketing Head and Director View xxxx@tonicworldwide.com 98551***** Purchase and Procurement Purchase Head and Director View xxxx@tonicworldwide.com 98468***** Admin Admin Head and Director View xxxx@tonicworldwide.com 98160***** Legal Legal Head and Director View xxxx@tonicworldwide.com 98838***** CSR CSR Head and Director View xxxx@tonicworldwide.com 98214***** Download our free EasyLeadz Chrome extension. Find contact numbers for 250M+ people on Internet directly. No Credit Card Required. One Click Signup. SIGN UP FOR FREE The most accurate data ever GDPR Compliant 150M Personal Emails 200M Work Emails 100M Direct Dials 250M Professional Profiles 30M Company Profiles Support Privacy Policies Terms of Service GDPR Opt-out Company About Us Our Data Contact Us Download our chrome extension Mr. E - Find B2B contacts universally Email us support@easyleadz.com Connect with us : X Want contacts of top management of Tonic Worldwide? Try Mr. E's contact finder tool and fetch direct mobile numbers of decision-makers of all companies globally. Grow your sales now. Start Free Trial Free Trial with 5 contacts. No Credit Card Required. One-click Signup."
    },
    {
      "url": "https://www.forgottentonic.com/menu",
      "text": "Menu – Enjoy modern American cuisine food in our dining room, bar, and outdoor patio — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations Grab a Seat APPETIZERS SOUP & SALAD KIDS SIDES MAINS FT ICONIC COCKTAILS MODERN COCKTAILS NON-ALCOHOLIC DESSERT APPETIZERS $ 10 WARM BREAD Soft, oven-warmed focaccia served with a whipped cinnamon–datil honey compound butter. $ 10 dairy free option +1 $ 15 MONTENEGRO MEATBALLS Ground beef meatballs infused with Amaro Montenegro and exotic spices, mixed with almonds and onions, served over a rich herbed cream sauce and garnished with parsley. $ 15 $ 13 BRUSCHETTA Oven-roasted grape tomatoes and garlic atop thick-cut toast, with melted mozzarella, basil chiffonade, and a balsamic reduction. $ 13 $ 11 PICKLE PLATE A tangy assortment featuring Grandpa Hausman’s icebox pickles, apple fennel kimchi, pimentos, pickled horseradish and red onion served with dijon mustard and capers. $ 11 add toasted bread +3 MP CHARCUTERIE BOARD Chef’s selection of cured meats & cheeses accompanied by toasted bread, cornichons pickles & olives. MP $ 15 CRISPY ARTICHOKE A playful twist on spinach artichoke dip, with cornstarch-coated artichoke hearts deep-fried to crispy perfection, served with a herbed cheese spinach dipping sauce, and topped with a sprinkle of Parmesan cheese. $ 15 $ 11 BLACK HUMMUS Creamy chickpea purée made with deep, nutty black tahini, roasted black garlic, and a splash of tamari. Finished with chili oil, pomegranate arils, and sesame for a bold, smoky-sweet bite. $ 11 no bread, crudités only +1 $ 20 BAKED BRIE Creamy brie wrapped in golden puff pastry with cranberry compote, topped with seasonal marmalade, toasted almonds, and orange zest. Served warm with fresh fruit and toast points. $ 20 $ 16 CAJUN EGG ROLLS Crispy egg rolls filled with blackened chicken, cream cheese, chili paste, cabbage & black beans, served with a bold spicy ranch sauce for dipping. $ 16 add additional egg roll +9 SOUP & SALAD Half 11\n                  \n                    /\n                  \n                     Whole 20 CAESAR SALAD Crisp romaine hearts with garlic croutons, shaved Parmesan, anchovy fillets & a creamy Caesar dressing. Half 11\n                  \n                    /\n                  \n                     Whole 20 add blackened chicken thigh +10 Half 11\n                  \n                    /\n                  \n                     Whole 20 FT HOUSE SALAD Vibrant mix of leafy greens, cucumber, tomatoes, red onion, gorgonzola, dried cranberries & shaved carrots. Tossed in a rich balsamic vinaigrette. Half 11\n                  \n                    /\n                  \n                     Whole 20 add grilled shrimp +12 $ 10 CURRIED BUTTERNUT SOUP Roasted butternut squash simmered with coconut milk, garlic, and toasted spices. Topped with chili oil and crisp sweet potato shoestrings for a warm, aromatic finish. $ 10 KIDS $ 9 I DON’T WANT THAT Pasta sautéed with Parmesan and garlic. $ 9 add grilled chicken thigh +10 $ 12 I DON’T KNOW Fried chicken tenders with french fries. $ 12 $ 9 I’M NOT HUNGRY Cuban bread topped with cheese and cream sauce and baked golden. $ 9 add bacon +3 $ 12 I DON’T CARE Hamburger on a pretzel bun with french fries. $ 12 add havarti cheese +2 SIDES $ 11 FRENCH FRIES Seasoned french fries with roasted garlic aioli and sweetened & puréed tomatoes. $ 11 trufflize it +3 $ 11 FOUR CHEESE GRITS Creamy stone-ground grits blended with a rich quartet of havarti, parmesan, asiago & romano cheeses, finished with green onion. $ 11 $ 13 PATATAS BRAVAS White wine–poached potatoes, fried until golden and tossed in garlic–sage aioli. $ 13 $ 11 MEDITERRANEAN PASTA SALAD Cavatappi pasta tossed with grape tomatoes, red onion, chickpeas, Kalamata olives, and feta, finished with chopped parsley and a tangy basil sun-dried tomato vinaigrette. $ 11 $ 13 COLLARD GREENS Tender collards simmered with poblano, carrot, garlic, and ginger in a spiced broth of vegetable stock, apple cider vinegar, and warm aromatics. $ 13 $ 13 STIR FRY RICE Stir-fried white rice with crisp carrots, green onions, and tender spinach, tossed in a savory-sweet Korean BBQ sauce. $ 13 $ 13 BRUSSELS SPROUTS Roasted Brussels sprouts tossed in a smoky gochujang BBQ glaze with a touch of maple sweetness. $ 13 $ 13 SWEET POTATO HASH Roasted sweet potatoes tossed with sautéed onions, Brussels sprouts, kale, bell peppers, garlic, and fresh herbs, finished with miso brown butter and a sprinkle of toasted pumpkin seeds. $ 13 MAINS $ 23 FISH SANDWICH Grilled or blackened redfish topped with crisp leafy greens, sliced tomato & red onion on Cuban bread. Dressed with dill tartar and a side of crispy French fries. $ 23 $ 19 CHICKEN SANDWICH Roasted chicken thigh on a  warm pretzel bun with pickled red onions and dill pickle chips, topped with creamy pimento cheese and arugula. Finished with a drizzle of datil infused honey and a side of crispy French fries. $ 19 $ 21 FT BURGER Juicy ground beef topped with melted havarti, caramelized onions, bacon & pickles. Dressed with FT sauce on a warm pretzel bun, accompanied by french fries. $ 21 $ 35 STEAK SANDWICH Seared steak medallions with melted provolone, roasted red peppers, and arugula on toasted hoagie, layered with artichoke cream and finished with crispy fried onions. $ 35 $ 19 BANH MI Crispy tofu marinated in soy, ginger, and porcini, layered with pickled carrots, onions, cucumbers, and fresh cilantro on toasted Cuban bread. Finished with our zesty cilantro-chile aioli and jalapeños. $ 19 $ 18 BURRATA SANDWICH Creamy burrata layered with sage walnut pesto, thick-cut tomato, and fragrant basil leaves on toasted focaccia. Served with french fries. $ 18 add prosciutto +8 MP FRESH CATCH Seasonal catch paired with the chef’s handpicked side—ask your server for today’s fresh selection and details. MP $ 20 BIBIMBAP Vibrant mix of sesame-roasted seasonal vegetables & mushrooms paired with steamed seasoned white rice. Generously topped with spicy Korean chili sauce and a sprinkle of furikake and a side of apple kimchi. $ 20 add crispy tofu +8 $ 28 SHRIMP & GRITS ÉTOUFFÉE Blackened east coast shrimp over creamy cheese grits, surrounded by a rich andouille sausage étouffée. Finished with green onion and jalapeño. $ 28 $ 33 CHICKEN BELLA Confit half chicken, crisp-skinned and tender, served with a warm sweet potato hash with shaved Brussels sprouts and wilted kale, finished with a silky fig port gastrique. $ 33 $ 21 PASTA ALLA VODKA Simmered carrots, onions & garlic pureed in vegetable stock, infused with green chili & tossed with cavatappi pasta. Garnished with aged Parmesan, basil leaves, toasted bread crumbs, and a drizzle of herb oil. $ 21 add grilled chicken thigh +10 MP CHEF'S CUT Chef’s choice of cut & preparation with a seasonally inspired side. MP $ 29 SAUTÉED MUSSELS Blue mussels steamed in a savory broth of white wine, fennel, roasted onions, garlic, chorizo, seafood stock, and fire-roasted tomatoes. Served with thick-cut focaccia. $ 29 $ 39 PORK CHOP 14 oz bone-in chop, slow-roasted in bacon fat, seared to finish. Served with braised collard greens and a bold BBQ jerk sauce. $ 39 FT ICONIC COCKTAILS $ 22 FORGOTTEN TONIC Alluring & Herbal. Navy strength gin & alpine liqueur mixed with genepy, lime zest, and quinine. Force carbonated and elegantly served in a wine glass. Limited supplies. $ 22 $ 14 I CAN’T EVEN Binge Worthy & Smoky. Blanco tequila with strawberry jalapeño shrub & bitter aperitif, mezcal, grapefruit & lime. Shaken & served over a king cube with cucumber. $ 14 $ 16 ESCAPE FROM BLACK MOUNTAIN Tropical & Bold. A captivating mix of Italian Amaro & overproof dark rum, shaken with coconut cream & a zesty combination of orange & lime juices. Accented with a dash of Angostura bitters & served over pebble ice. $ 16 $ 14 RAISING CANE Fruity & Elegant. Vodka & elderflower liqueur, enhanced with blackberry lemongrass shrub & a hint of honey. Shaken & strained into a chilled coupe glass. $ 14 $ 21 NO DESTINATION Bold & Refreshing. A playful twist on a shandy, blending tepache, pineapple eau de vie, and mezcal. Tamarind and apple add tart sweetness, while a BBQ rub salt rim enhances every sip. Served over ice in a pint glass. $ 21 $ 14 SAME AS IT EVER WAS Bright & Velvety. Kentucky bourbon shaken with lemon juice, orange blossom honey, and seasonal fruit marmalade for a rich, citrusy balance. Egg white adds a silky texture, topped with bitters and a candied citrus dusting. Served over a king cube in a double rocks glass. $ 14 MODERN COCKTAILS $ 14 BAPTISM FOR THE DEAD Savory & Spiced. A bold, savory twist on the dirty martini. Pepper infused soju meets summer kimchi brine and blanc vermouth for a complex, umami-packed sip. Stirred and served up in a Nick & Nora glass, finished with drops of mustard oil. $ 14 $ 16 THERE AND BACK AGAIN Warm & Spiced. Reposado tequila meets pumpkin falernum, orange juice, oat milk, and chai in this comforting hot cocktail. Frothed, served warm in a mug and finished with nutmeg, this cozy cocktail is reminiscent of a boozy spiced cider. $ 16 $ 29 AIM HIGH Decadent & Nostalgic. Aged agricole and Jamaican rums meet Licor 43, black tahini orgeat, taro-banana coconut cordial, and cold brew. Served over pebble ice in a Pedro bust mug, garnished with mint, citrus, and espresso powder. Serves two. $ 29 take the mug home +20 $ 15 ONLY YESTERDAY Decadent & Nostalgic. Spanish brandy, amaretto, and oloroso sherry meet rich peanut butter and blackberry, all fat-washed with coconut milk for a clear silky finish. Served over a large rock and paired with a strawberry cheesecake bite. $ 15 $ 17 DEATH BY RAYGUN Fizzy & Futuristic. American forest liqueur meets blue curaçao and green apple cordial, lime juice, and sparkling wine in this vibrant, electric sipper. Shaken and served up in a flute, finished with a mist of grapefruit oil. $ 17 $ 17 POP'S ARMCHAIR Rich & Refined. Blue cheese fatwashed rye whiskey and Islay Scotch stirred with birch, port wine, and Malört. Served over a large rock, finished with orange oil and a shard of pecan brittle. $ 17 $ 16 ANGEL IN WHITE Fresh & Fiery. Green chile-infused vodka and Batavia Arrack meet watermelon cordial and lime for a bright, punchy mix with a hint of heat. Whip-shaken and served in a hurricane glass over pebble ice, finished with grapefruit essence, a mint bouquet, and pickled watermelon rind. $ 16 $ 17 RUMOR HAS IT Bright & Bubbly. Citrus peel infused Tito’s vodka, pomegranate cordial, lemon and grapefruit juices, rhubarb amaro, and a hint of orange blossom water, force carbonated for an effervescent finish. Served over pebble ice in a Collins glass and garnished with pomegranate arils, lemon, and grapefruit oil. $ 17 NON-ALCOHOLIC $ 11 SHOOT LOW Creamy & Complex. A lush non-alcoholic blend of Giffard pineapple, black tahini orgeat, coconut cream, and cold brew, whip shaken and served in a snifter over pebble ice. Garnished with fresh mint, dehydrated citrus, and a dusting of espresso powder. $ 11 $ 11 A LITTLE PRAYER Fruity & Zesty. A bright and refreshing blend of strawberry, ginger, and citrus, elevated by the subtle bitterness of Giffard N/A Pamplemousse liqueur. Served over pebble ice in a mug. $ 11 DESSERT $ 11 FIG & HONEY CHEESECAKE Silky baked cheesecake swirled with fig preserves on a fragrant fennel graham cracker crust. Finished with a dollop of amaro-infused whipped cream and a buttery pistachio crumble. $ 11 $ 7 CHIA SEED PUDDING A rich, dairy-free pudding made with cocoa, coconut cream, maple syrup, orange zest and chia seeds. Topped with cocoa nib-cayenne brittle & pomegranate arils. $ 7 $ 13 BROWN BUTTER CAKE Rich and nutty brown butter cake served with a warm apple and cranberry compote, topped with a dollop of freshly whipped cinnamon cream. Garnished with crushed hazelnuts. $ 13 $ 11 CRÈME BRÛLÉE Velvety-smooth custard infused with orange and ginger, topped with a perfectly caramelized sugar crust for the ultimate crack with cardamom shortbread cookie and candied ginger. $ 11 PDF MENU Forgotten Tonic  PDF Menu 2025 HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Datenschutz Surname First First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "text": "TeamBoard for monday.com - TeamBoard - Resource planning, project management and Gantt Chart for Jira, monday.com Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now TeamBoard for monday.com Resource Management, Calendar, Recurring Tasks & Time Tracking, Timesheets – All in One Place! Start your free trial Book a Demo Resource Scheduler Plan and Assign Tasks with Ease Simple Task Planning : Assign tasks based on team availability and capacity. Real-Time Updates: Changes sync automatically across your monday.com boards. Avoid Overload: Track team workloads to prevent overburdening anyone. Clear Overview: See tasks on a visual timeline to spot potential issues early. Try for free → Working Capacity & Holiday Calendar Manage Workloads and Time Off with Ease Track Capacity: Easily see how much work each team member can handle. Plan for Time Off : Keep track of holidays, vacation days, and time off to avoid scheduling conflicts. Leave Requests : Track and approve team members’ time off requests in one place. Balance Workloads: Adjust tasks based on team availability to ensure no one is overloaded. Try for free → Time Tracking & Timesheets Effortlessly Track Time and Manage Timesheets Simple Time Tracking : Log time spent on tasks directly in the app. Timesheet Management : Review and approve timesheets with a few clicks. Easy Reports: Generate reports to see where time is being spent and optimize your workflow. Try for free → Calendar View Get a Clear Overview of Tasks and Deadlines View Tasks & Deadlines : See all your tasks and deadlines in one calendar. Customizable Views: Switch between daily, weekly, or yearly views to fit your needs. Track Holidays: Easily manage team holidays and ensure proper planning. Stay Organized: Keep track of all upcoming work and prevent scheduling conflicts. Try for free → Recurring Tasks Automate Repetitive Tasks and Save Time Set Up Once, Automate Forever : Create tasks that automatically repeat on your preferred schedule. Flexible Scheduling: Choose from daily, weekly, or custom intervals. Stay Organized: Keep recurring tasks organized and ensure nothing gets missed. Save Time: Eliminate the need to manually recreate tasks over and over again. Try for free → Manage Multiple Boards in Dashboard & Reports Track Multiple Boards in One Unified Dashboard Unified Dashboard : Monitor all your projects and teams in one place. Custom Reports: Create interactive reports to track performance, progress, and resource usage. Cross-Board Management: Easily manage tasks and resources from multiple boards within a single dashboard. Real-Time Updates: Get live insights into your team’s performance and project timelines. Try for free → Get Started with TeamBoard for monday.com Getting Started is Simple Start using TeamBoard in just a few clicks. Install the app from the monday.com marketplace, explore its intuitive features like the Resource Scheduler, Calendar View, and Timesheets, and see how it transforms your workflow. Need help? Book a free demo and let us guide you through everything your team needs to get started quickly and effectively. Access the Quick Start Guide → Integrate with monday.com Integrates seamlessly with monday.com environments and offers a centralized platform for managing tasks, projects, and resources effectively. Install Now TeamBoard for monday.com Features Resource Planning Resource Planning helps managers optimize their workforce and workload distribution. Try for free Project management Project management empowers managers to oversee their projects effectively. Try for free Workload Management It involves the process of efficiently distributing and managing work across your team members. Try for free Time Tracking Time Tracking lets managers monitor hours spent on tasks accurately. Try for free Calendar View This feature helps individuals and teams see at a glance what needs to be accomplished daily, weekly, monthly, or even annually. Try for free Others Additional features include work capacity, holiday scheme, timesheet, task planning, comprehensive reporting,… Try for free Blog Posts Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com Project Management 4 Dec 2024 🎅 Santa’s Workshop: Project Management Tips for a Productive Season All , TeamBoard TimePlanner 2 Dec 2024 Common Challenges of Leave Management in Jira and How to Overcome them View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    },
    {
      "url": "https://teamboard.cloud/",
      "text": "Project Management, Resouce Planning and Gantt Chart for Jira Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now Manage Work, Resources, and Time for Every Team in Jira Your One-Stop Solution for Project Management, Resource Planning, WBS Gantt Charts, Time Tracking, and Timesheets Our Solutions Book a Demo Trusted by Teams from TeamBoard ProScheduler for Jira Project Management, Resource Planning, Gantt Chart for Jira Top-rated capacity planning solution for projects, programs, and portfolios. Project management, tempo, structure timeline, WBS Gantt chart & risk management for Jira. Resource Planning WBS Gantt Chart & Timeline Time Tracking & Workload Report & Dashboard Project Risk Management Unlock Project Efficiency → TeamBoard TimePlanner for Jira Resource Capacity, Time Tracking & Timesheets for Jira Resource Management, Team Management , Time Tracking, Timesheets, and Cost Tracking for Jira Profile Management Task Planning Team Collaboration Timelog, Timesheets Leave, Event Planning Invoicing, and Billable Hours Tracking Client Management Optimize Your Workflow → TeamBoard for monday.com Resource Planning and Time Tracking for monday.com Resource management, capacity planning, and reports for teams to visualize projects and time management. Resource Planning with ease Workload Distribution Time Tracking & Timesheets Get Started with Resource Planning → TeamBoard for Salesforce Project and Resource Management for Salesforce Manage work and Plan resources seamlessly, Track and Report for Salesforce Work Management Resource Planning Track & Report Manage Your Resources → TeamBoard Features Project management The project management feature helps managers in overseeing their projects effectively. Learn more → Resource Planning Resource Planning feature help managers in optimizing their workforce and asset allocation. Learn more → WBS Gantt Chart WBS Gantt Chart facilitating project visualization and timeline tracking for managers. Learn more → Time Tracking, TimeSheets Time Tracking, TimeSheets allow managers to monitor hours spent on tasks accurately. Learn more → Cost Management Cost Management enables managers to oversee and control project budgets efficiently. Learn more → Others Additional features such as leave and vacation management, risk management, detailed issue tables, workload distribution, comprehensive reporting, teamboard, scheduling,… Let Our Customers Speak for Us! TimePlanner manages the application costs and consumption of materials within the project Claudio Pirtraroia on Atlassian Marketplace After a long search, found a right one shop tool that gives me insights on Workload, What is being allocated and time spent. Jacob Rajesh on Atlassian Marketplace Lovely app and great customer service. This app is very useful for us to plan resource and tasks for projects and portfolios. Look forward to the completed Gantt features and project budget management as you guys promised. Highly recommend. Hakan Eriksson on Atlassian Marketplace Beautiful app! fancy scheduler and modern UIUX, I strongly recommend this over other expensive legacy timesheets apps. Brian Ng on Atlassian Marketplace The app looks promising I have just installed it today and starting to discover it’s features. One thing I couldn’t find a way around is cancelling an Approved Vacation or changing it’s period range, it will be awesome if such option is available. Badry Hassan on Atlassian Marketplace I am using this app daily to manage my team and very satisfied with its capabilities. Support guys are very nice and normally response instantly. Keep up a good work the Samurais! Nathan Carter on Atlassian Marketplace Integrates with Multiple Platforms Integrates seamlessly with Atlassian , monday.com , and Salesforce environments and offers a centralized platform for managing tasks, projects, and resources effectively. Explore all TeamBoard Solutions Blog Posts All , Project Management 29 Aug at 6:41 am AML Case Management Tool for Your Project Management Needs All , Project Management 28 Aug at 12:03 am 7 Task Project Management Warning Signs To Watch For Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    },
    {
      "url": "https://www.tonichousing.org.uk/contactus",
      "text": "Contact — Tonic Housing Home About Tonic@Bankhouse Community Resources Donate Contact Back About Tonic News Press Staff Board Diversity and Inclusion Policies Back Tonic@Bankhouse Register your interest Living at Tonic@Bankhouse Tonic@Bankhouse Website Back Volunteering Funders and Supporters Friends Community Panel Ambassadors Pride Gallery International London Mayoral Elections: Manifestoes Back Precarious Lives Videos Annual Reports Building Safe Choices: 2020 Report Research Information Glossary Back Donate Back Contact Us Friends of Tonic Community Contact Home About About Tonic News Press Staff Board Diversity and Inclusion Policies Tonic@Bankhouse Tonic@Bankhouse Register your interest Living at Tonic@Bankhouse Tonic@Bankhouse Website Community Volunteering Funders and Supporters Friends Community Panel Ambassadors Pride Gallery International London Mayoral Elections: Manifestoes Resources Precarious Lives Videos Annual Reports Building Safe Choices: 2020 Report Research Information Glossary Donate Donate Contact Contact Us Friends of Tonic Community Contact CONTACT email: info@tonichousing.org.uk call: 0207 971 1091 *please note that we are a very small team and our phone line cannot always be staffed, the best way to contact us is via email. write to us at: tonic Housing, BANKHOUSE, 20 ALBERT EMBANKMENT, London, SE1 7FY Press enquiries: press@tonichousing.org.uk WANT TO LIVE AT TONIC? You can read more in depth about our first scheme, Tonic@Bankhouse on our sales website . Register your interest in Bankhouse below and one of the team will be in contact with you. You can still register your interest in living at Tonic, even if you are not eligible for the apartments at Bankhouse. Tonic intends to follow on from Bankhouse with further schemes, and telling us what you want and need is important to inform this. Being on our register of interest means we can contact you about future opportunities. Register your interest FRIENDS OF TONIC NEWSLETTER Interested in what Tonic is doing? Get involved and stay up to date with our latest news, projects and developments. We don’t send many emails, so you won’t be spammed by us (we hate spam as much as you!). First Name Last Name Email Address Sign Up Our email marketing is managed using MailChimp. We respect your privacy, and will only use your details for the specified purposes. You can unsubscribe at any time by clicking on the link in our emails or by emailing us at info@tonichousing.org.uk . We will manage your data in line with our Privacy Policy Thanks! You’re now signed up for the Friends of Tonic newsletter. SOMETHING ELSE? GET IN TOUCH. If your query is specific, get in touch directly with Bella and she will direct you to the best member of the team, at info@tonichousing.org.uk . email: info@tonichousing.org.uk Phone: 0207 971 1091 Registered address: TONIC HOUSING ASSOCIATION LTD, BANKHOUSE, 20 ALBERT EMBANKMENT, LONDON, SE1 7FY Copyright © 2025 Tonic Housing Association, All rights reserved. All content must not be reproduced without consent. Tonic Housing Association Limited is a Charitable Community Benefit Society registered in England and Wales (8315) and a Non-Profit Registered Provider of Social Housing (5224). Privacy Policy Complaints Policy info@tonicliving.org.uk Hours"
    },
    {
      "url": "https://historiccoastculture.com/business/forgotten-tonic/",
      "text": "Forgotten Tonic - HistoricCoastCulture.com Forgotten Tonic - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Select Category Drinks Places To Stay Restaurants Select Location Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach SEARCH Home Drinks ; Restaurants Forgotten Tonic Facebook Twitter Linkedin Forgotten Tonic Drinks ; Restaurants Email / Website / Facebook / Instagram / Primary address: 6 Aviles Street, St. Augustine, FL 32084 (904) 827-9055 Forgotten Tonic is a hidden neighborhood gem located in the heart of St. Augustine’s historic art district. Their menu puts a modern twist on freshly prepared American comfort food, an extensive wine list, hand-crafted cocktails, and captivating southern hospitality. Enjoy provisions inside the rich, welcoming dining room or al fresco style on the nation’s oldest street. Forgotten Tonic is a hidden neighborhood gem located in the heart of St. Augustine’s historic art district. Their menu puts a modern twist on freshly prepared American comfort food, an extensive wine list, hand-crafted cocktails, and captivating southern hospitality. Enjoy provisions inside the rich, welcoming dining room or al fresco style on the nation’s oldest street. View less HOURS: Sunday-Thursday: 12 PM-11 PM Friday-Saturday 12 PM-12 AM LOCATION Address : 6 Aviles Street, St. Augustine, FL 32084 Full map and directions Nearby Events Ancient City Poets at Sing Out Loud Presented by Ancient City Poets at Spinster Abbott's Sep 13, 2025 Facebook Twitter Linkedin Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 6 - Sep 14, 2025 Accessibility Info Facebook Twitter Linkedin Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION St. Augustine Book Festival Presented by Ximenez-Fatio House Museum at Ximenez-Fatio House Museum Sep 20, 2025 Facebook Twitter Linkedin SHOW MORE PHOTOS FIND LOCAL BUSINESSES Search by Keyword Select Category Drinks Places To Stay Restaurants Select Location Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach SEARCH RESET DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.tonichealth.co/en-us/pages/contact",
      "text": "Contact Tonic Health Skip to content Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Try risk-free – 60 day guarantee Free delivery £25+ Subscribe + Save 25% Build your health stack Menu Search Shop Shop all Shop all products Bestsellers Bundles Adults Energy + Hydration Immunity + Vitality Rest + Recover Multivitamin Gummies Kids & Baby Kids Multi Gummies Kids Immunity Gummies Kids Pre + Pro Gummies Baby Multi Drops By benefit Multivitamin Immune support Energy + Hydration Relaxation + recovery Gut health + digestion Immunity + Vitality Bundles Learn Our story Blog Podcast Health benefits Tonic Health USD $ Country Åland Islands (EUR €) Andorra (EUR €) Austria (EUR €) Belgium (EUR €) Cyprus (EUR €) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Greece (EUR €) Ireland (EUR €) Italy (EUR €) Kosovo (EUR €) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Monaco (EUR €) Montenegro (EUR €) Netherlands (EUR €) Portugal (EUR €) San Marino (EUR €) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) United Kingdom (GBP £) United States (USD $) Search Login Cart 0 items 0 Adults Kids & Baby Shop by Benefit Shop All Bundles Bestsellers Learn USD $ Country Åland Islands (EUR €) Andorra (EUR €) Austria (EUR €) Belgium (EUR €) Cyprus (EUR €) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Greece (EUR €) Ireland (EUR €) Italy (EUR €) Kosovo (EUR €) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Monaco (EUR €) Montenegro (EUR €) Netherlands (EUR €) Portugal (EUR €) San Marino (EUR €) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) United Kingdom (GBP £) United States (USD $) Adults All Adults Health Energy + Hydration Immunity + Vitality Rest + Recover Multivitamin Gummies Immunity + Vitality Kids & Baby All Kids & Baby Kids Multi Gummies Kids Immunity Gummies Kids Pre & Pro Gummies Baby Multi Drops Kids Multi Gummies Shop by Benefit Multivitamin Immune Support Energy & Hydration Relaxation & Recovery Gut Health & Digestion Energy + Hydration Learn Our story Blog Podcast Health benefits Clear Close Adults Kids & Baby Shop by Benefit Shop All Bundles Bestsellers Learn Get in touch Got a question about your order, subscription, or our products? Start in our Help Centre below – it’s the quickest way to get answers 24/7 and manage orders. Name E-mail Order status Subscription Account Feedback Product question Other Subject Order Number Message Send message Join the Tonic Truth Tribe Sign up to our newsletter to receive exclusive access to offers, new products and health hacks. E-mail Subscribe SHOP Bestsellers Bundles Adults Health Kids Health Shop all LEARN About Us Blog Podcast Health Benefits HELP & INFORMATION Delivery Returns Subscriptions Offers Contact Us Terms of Service Become a Stockist Wholesale login United States (USD $) Country Åland Islands (EUR €) Andorra (EUR €) Austria (EUR €) Belgium (EUR €) Cyprus (EUR €) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Greece (EUR €) Ireland (EUR €) Italy (EUR €) Kosovo (EUR €) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Monaco (EUR €) Montenegro (EUR €) Netherlands (EUR €) Portugal (EUR €) San Marino (EUR €) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) United Kingdom (GBP £) United States (USD $) © 2025, Tonic Health. Powered by Shopify These products are not intended to diagnose, treat, cure or prevent any disease. Immune System: Vitamins A, C, D, B6, B12 and zinc contribute to the normal function of the immune system. Cognitive function: Iron and zinc contribute to normal cognitive function. Muscle function: Magnesium contributes to normal muscle function, normal energy-yielding metabolism and normal functioning of the nervous system. It also contributes to the reduction of tiredness and fatigue. Energy: Vitamins B1, B2, B3 (niacin), B6, B12, folate, biotin and pantothenic acid contribute to normal energy-yielding metabolism and help reduce tiredness and fatigue. They also support the normal functioning of the nervous system. Nervous System: Magnesium contributes to the normal functioning of the nervous system. Hair, Skin & Nails: Zinc contributes to the maintenance of normal hair, skin and nails. Biotin contributes to the maintenance of normal hair and skin. Vitamin E contributes to the protection of cells from oxidative stress. Bone Health: Vitamin D and zinc contribute to the maintenance of normal bones and teeth. Vitamin C contributes to normal collagen formation for the normal function of bones. Magnesium contributes to the maintenance of normal bones."
    },
    {
      "url": "https://www.tonicworldwide.com/contact",
      "text": "Tonic Contact Details- We're not hard to find! Home Philosophy Work Sectors Blog Careers Contact Us Menu Close Home Philosophy Work Sectors Blog Careers Contact Us Home Contact Us Let’s connect :) India 904/905, Eureka Towers Wing-B, Mindspace, Chincholi Bunder Road, Malad (w), Mumbai, 400064 View map Tel: +91 022 33540123 / +91 9833973364 India@tonicworldwide.com Middle-East 30th/31st Floor Single Business Tower Business Bay, Sheikh Zayed Road Dubai UAE PO Box – 36677 Office No 30 41 View map +971 045072040 / + 971 504000713 / +971565735897 Dubai@tonicworldwide.com Catch up with us Name * Please enter your name Email * Please enter a valid email id Country * Please enter your country Contact No. * Please enter contact number Enter a 10-digit contact number Services * Select Service Brand Discovery and Strategy Social Media Strategy Data and Insights Creative and Content Design and Development Organic and Paid Marketing Others Please select a service Here's something more to add * Please enter a comment I am not a robot Please wait... © 2025 Tonic Worldwide. All Rights Reserved. | Privacy Policy Thank You! for sharing your details. We will get in touch with you shortly!"
    },
    {
      "url": "https://www.forgottentonic.com/private-events",
      "text": "Private Events - Host Your Next Event in Downtown St. Augustine — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations PRIVATE EVENTS Thank you for considering us for your upcoming event! Our commitment is to deliver exceptional food, balanced cocktails, and a unique ambiance, ensuring your celebration is the most memorable one since your sweet sixteen. You're invited to gather at our tables with the warmth and welcome you'd find in our own home. Our private event pricing is a food and beverage (F&B) minimum spend based on historical revenue for that time of year and day of the week you host your event. What is a F&B minimum? It is the amount you are required to spend on food and beverages to use our space and it takes the place of a room rental fee if you reach that minimum. Name * Phone * (###) ### #### Email * What are you celebrating? * Wedding Reception Wedding Rehearsal Cocktail Party Birthday Business Family Reunion Other If \"Other\" was selected, tell us about your event Date Requested * MM DD YYYY Time(s) Requested * Hour Minute Second AM PM Amount of Attendees * Enter a number from 1-100 Other Requests? Thank you! HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.forgottentonic.com/team",
      "text": "Team -- Meet the team at our Downtown Saint Augustine Restaurant & Cocktail Bar — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations Meet the Team Mike Whitmoyer General Manager Ash Lawley Chef de Cuisine Cody Mohr Hospitality Manager Logan Allee Sous Chef Izzy Anderson Sous Chef Nicholas Hausman Beverage Manager John Moore Owner Join the team We are always looking for innovative and talented team members. Join Us HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.forgottentonic.com/staff-appreciation-fee",
      "text": "Staff Appreciation Fee — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations What is a Staff Appreciation Fee? Throughout my tenure as a restaurant owner, the welfare and development of my staff have always stood at the forefront of my priorities. I see it as more than a responsibility—it's a commitment to ensure the well-being and financial stability of our team members. The current economic scenario, coupled with the unique challenges of the hospitality sector, has highlighted the hardships faced by some of our essential team members, particularly those who work behind the scenes. To address this, we've instituted wage increases for our back-of-house staff and rolled out comprehensive benefits for all full-time personnel. Yet, it's evident that these measures, while significant, are not sufficient. Thus, we're introducing a discretionary 2% \"Staff Appreciation\" fee on all orders at Forgotten Tonic. We considered the traditional approach of adjusting our menu prices to reflect the rising costs of labor. However, we opted for a distinct fee to ensure transparency. This method allows everyone—our valued guests and dedicated staff—to see the tangible benefits of this initiative. The fee is designed to support enhancements to our team's benefits, including health, dental, and vision insurance, paternity leave, paid time off, and more, distinguishing it from a mere increase in menu pricing which could easily blend into overall business costs. We're aware this strategy might seem unconventional and might prompt questions. We welcome any inquiries or discussions during your visit, and our managers are more than happy to provide clarity on this initiative. “As you grow older, you will discover that you have two hands, one for helping yourself, the other for helping others.” -Maya Angelou HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.forgottentonic.com/",
      "text": "Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations SERVING CLASSICS WITH A TWIST Grab a Seat Ample outdoor seating so you can enjoy sunny St. Augustine! A one-of-a-kind restaurant & cocktail bar Forgotten Tonic is a hidden neighborhood gem nestled away in the heart of St. Augustine's historic arts district.  We feature modern twists on freshly prepared American comfort food, an extensive wine list, hand-crafted cocktails, and good, old-fashioned southern hospitality. View Menu While reservations are not required to dine or enjoy cocktails with us, it is highly recommended. To make a reservation, please use the OpenTable app below or call us directly at (904) 827-9055 to reserve your table. Credit Card Required We require a credit card to secure reservations. All credit card information will be processed securely. No-shows or cancellations less than 1 day in advance will be subject to a charge of $15 per person. Changes to guest count made less than 1 day in advance will be subject to a charge of $15 per person. Grace Period We have a 10 minute grace period. Please call us if you are running later than 10 minutes after your reservation time. Large Groups We do not seat groups larger than 8 guests during normal business hours. We do however offer the opportunity to rent out our entire space for a set period of time. Please fill out this form for a quote. DRINKS YOU BRING HOME TO MOM So Fetch North Florida gin, yellow chartreuse, dry vermouth, raspberry anise shrub, lemon juice Bee's Knees London dry gin, lavender, honey, lemon juice I Can't Even Blanco tequila, bitter orange aperitif, joven mezcal, strawberry jalapeno shrub, grapefruit and lime juices, cucumber Raising Cane Vodka, elderflower liqueur, blackberry lemongrass shrub, honey, lemon juice, mint Explore our food and drink menus Food Menu Drink Menu To enhance our team's benefits, we've introduced an optional surcharge on all bills. This contribution directly supports the dedicated staff responsible for your dining experience, including many behind-the-scenes team members. The surcharge helps fund essential benefits like health, dental, and vision insurance, maternity leave, and paid time off. If you have any questions or prefer not to participate, please inform your server or request to speak with a manager. For further insight into the reasons behind this surcharge, we invite you to click here. “Obsessed is an understatement. Definitely our favorite stop!” “the type of bar I wanna sit at and order a dirty martini - dope vibes.” “Our server was really sweet and drinks never went empty.” Tell us about your experience. Winner of the Best Cocktails around award. BCAA, 2022 Voted Number 1 Bar on Aviles Street. Aviles Street People, 2023 World’s best cocktails according to the World. The World, 24/7 Top place to drink for people who like to drink. People Who Like to Drink Private Events We love hosting private events. It is our hope you not only enjoy our food and drink offerings but the memorable time spent with those around you. You are welcome at our tables just as you would be in our home. Learn more HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://tonicsiteshop.com/contact/",
      "text": "Contact | Tonic Site Shop Join 35k+ Others Who Love Our  Newsletter Sign Me Up Navigate Home Shop All Website Templates Canva Templates Add-On Templates How it Works company About Read the Blog The Reviews Affiliate Programs Made with Tonic Hire a Designer customer service Resources Questions & Answers Compare Products Support Hub Contact Us What is Showit? Shop categories shop Website Templates shop canva Templates Add-On Templates For Your Website Find  Your Website Template Match! Take the Quiz Award-Winning Website Templates The Internet's Favorite Canva Templates Join 40k+ Subscribers Who Apparently Love Our Weird Marketing Newsletter Need help choosing the right template for you? Take our quiz to find your match! 3 Made with TONIC How It Works Blog Shop All Website Templates Website Templates Canva Templates Canva Templates Shop By Collection Contact Us Contact Us Our goal? To defy the tech-company norm and be more supportive than your bra. Our team is the best in the business and we're here to help. Whether you need support picking out a template, learning to use the one you have, or getting questions answered before you join the TONIC fam, here's where to begin! need a little support? Have an account or order issue? client Care Send A Message Get in touch with Christina and Jax, and they'll help you sort out any order or account issues you may be having. Need some Showit tech support? Tech Support Email Us There are two ways to get tech support: live chat with Showit or email support with our Client Success Team. Take your pick. Need a personal shopper? Sales Contact Sales Chat with our in-house site stylists, and we'll help you pick out the perfect design solutions for your biz. Chat w/ Showit We'd love to hear from you! Feel free to email our team directly at info@tonicsiteshop.com . Press, speaking, and collaboration inquiries can be directed to ciera@tonicsiteshop.com . Our business hours are 9-5 ET, Monday - Friday. We're closed on the weekends to rest up and spend time with our families, but otherwise, we aim to respond to all inquiries within 24 hours. We can't wait to connect! General Questions? Write on our napkin - xo, team tonic Email Us Do your website templates work for Squarespace (or other plaforms? Can I change ____ about the template? Nope. All of our website templates are created for use with the Showit platform, which teams up with Wordpress, creating a nearly infinite range of responsive design and functionality. Showit is a drag-and-drop website builder that allows you to showcase your unique brand without any frustrating back-end coding. It gives you total freedom to create and to maintain your web presence. Try it free for 14 days by clicking HERE . Most templates only let you change the color, font or images, and even for simple changes, you often need to know CSS or HTML or upload an annoying amount of Photoshop files. Our designs make it INCREDIBLY easy for you to change ANYTHING — colors, add images, your logo and other brand paraphernalia, restructure the layout, or completely delete it all and start over. You can literally pick elements up and move them. Best of all, changes preview and update instantly and there’s no guessing what it will actually look like. So yes, you can change that. What if the template I like doesn’t match the industry I’m in? Do you have anything beyond website templates? Fret not. While our demo sites are styled to be specific to a particular industry, our templates are highly customizable and can be tailored to your exact vision for your business and brand. No matter what they may be! Coaches, artists, dentists, real estate agents, bloggers, content creators, and beyond have all found home for their business in a TONIC design. Sure do. All of our website templates have matching Canva templates for social media, and we also have Canva templates for slide decks and presentations, lead magnets, and (coming soon) for pricing / welcome guides. What if I need help + support along the way? What about SEO? The Showit support team is unreal and they are ready to help at a moment's notice. You can live chat with them in-app during normal business hours and send in support tickets via email at any time.. They are prompt, genius, and downright awesome people. Plus, we’re here to help with any design questions that come up along the way — we’re your website wing(wo)men, so don’t hesitate to reach if you need some help. You know that whole HTML5 thing we mentioned earlier?! Well that results in all the goodies on your site being indexed by Google. You can even add in keywords, image descriptions, meta tags and links to better optimize your site for search engines. Better yet, we've gathered our very best SEO tips & tricks, know-how, and resources in our very helpful SEO hub HERE . FREQUENTLY ASKED QUESTIONS More TONIC FAQs Learn More about Showit Learn More about Canva Some HElpful resources: Browse the blog for articles ranging from Showit How-tos to Marketing Tips. The TONIC Blog Blog Posts Browse a curated assortment of very helpful things. The Resource Library Resources Find TONIC product tutorials all in one place. The Learn Hub Tutorials Learn the TONIC website ways with our team & some new friends. Launch Camp Workshop We'll walk you through the launch process from start to finish. Getting Started Guide Step-by-Step Guide Watch Jen and Ryan explain how to use Showit / Canva with TONIC. Showit / Canva Orientation Free Class Need something else? We know it can be overwhelming… choosing a new website, sorting through the options, and trying to determine if TONIC templates are the right fit for you. Here are our best resources to get you started: Take the Quiz Compare Products Read the FAQs Get Support Book A Call “IF THERE WAS A PULITZER for INSTAGRAM.” Join 60k+ followers @tonicsiteshop We don't do everything, but what we do, you'll find we do pretty damn well. We're hell-bent on making you proud of the way you show up online, with easy-to-use, designer-quality resources packed with the style, substance, and strategy you need to stand out. Let's do less, but better together. NAVIGATE Home Website Templates Canva Templates Add-On Templates How It Works Shop All company About Our Story The Blog Reviews Made with TONIC Affiliate Program customer service Resources Questions & Answers Compare Products Learn About Showit Support Hub Contact Us Join 40k+ Subscribers Who Apparently Love Our Weird Marketing Newsletter count me in, jen CUSTOMER LOGIN Terms & Conditions Privacy Policy © TONIC 2024 • Creating your designer page This can take up to 2 minutes. Please do not close this page. • Updating headshot image This can take up to 1 minute. Please do not close this page. • Updating gallery images This can take up to 1 minute. Please do not close this page. • Updating recent launches This can take up to 1 minute. Please do not close this page. 🍪 TONIC uses cookies to ensure you get the best experience on our website + it's all super legal. Cookie Settings Reject All Great! I love cookies! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. Save & Accept"
    },
    {
      "url": "https://www.forgottentonic.com/holiday-miracle",
      "text": "Holiday Miracle Home — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations MAKING HOLIDAY MEMORIES WITH THE MIRACLE MENU Ample outdoor seating so you can enjoy sparkling St. Augustine! A one-of-a-kind restaurant & cocktail bar Forgotten Tonic is a hidden neighborhood gem nestled away in the heart of St. Augustine's historic arts district.  We feature modern twists on freshly prepared American comfort food, an extensive wine list, hand-crafted cocktails, and good, old-fashioned southern hospitality. View Menu While reservations are not required to dine or enjoy cocktails with us, it is highly recommended. To make a reservation, please use the OpenTable app below or call us directly at (904) 827-9055 to reserve your table. Card Card Required We require a credit card to secure reservations. All credit card information will be processed securely. No-shows or cancellations less than 1 day in advance will be subject to a charge of $15 per person. Changes to guest count made less than 1 day in advance will be subject to a charge of $15 per person. Grace Period We have a 10 minute grace period. Please call us if you are running later than 10 minutes after your reservation time. Large Groups We do not seat groups larger than 8 guests during normal business hours. We do however offer the opportunity to rent out our entire space for a set period of time. Please fill out this form for a quote. DRINKS YOU BRING HOME TO MOM Christmapolitan vodka, elderflower, dry vermouth, spiced cranberry sauce, lime, rosemary, absinthe mist Rudolph’s Replacement vodka, coffee liqueur, white creme de cacao, orange curaçao, chai syrup, almond milk, aromatic bitters Koala LaLaLa Blanco tequila, bitter orange aperitif, joven mezcal, strawberry jalapeno shrub, grapefruit and lime juices, cucumber The Krampus reposado tequila, oloroso sherry, allspice dram, mezcal, ginger, hibiscus, lime, hellfire bitters Explore our Miracle Menu Miracle Menu To enhance our team's benefits, we've introduced an optional surcharge on all bills. This contribution directly supports the dedicated staff responsible for your dining experience, including many behind-the-scenes team members. The surcharge helps fund essential benefits like health, dental, and vision insurance, maternity leave, and paid time off. If you have any questions or prefer not to participate, please inform your server or request to speak with a manager. For further insight into the reasons behind this surcharge, we invite you to click here. “Obsessed is an understatement. Definitely our favorite stop!” “the type of bar I wanna sit at and order a dirty martini - dope vibes.” “Our server was really sweet and drinks never went empty.” Tell us about your experience. Winner of the Best Cocktails around award. BCAA, 2022 Voted Number 1 Bar on Aviles Street. Aviles Street People, 2023 World’s best cocktails according to the World. The World, 24/7 Top place to drink for people who like to drink. People Who Like to Drink Private Events We love hosting private events. It is our hope you not only enjoy our food and drink offerings but the memorable time spent with those around you. You are welcome at our tables just as you would be in our home. Learn more HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.forgottentonic.com/contact",
      "text": "Contact - Get in Touch with Our Downtown Saint Augustine Restaurant and Cocktail Bar — Forgotten Tonic 0 Skip to Content Menu Private Events Gift Cards Careers Team Location Contact Reservations Open Menu Close Menu Open Menu Close Menu Menu Private Events Gift Cards Careers Team Location Contact Reservations Menu Private Events Gift Cards Careers Team Location Contact Reservations CONTACT US Feel free to reach out to us for any of your needs. We’d be happy to discuss anything from your next visit, to the weather, or even the airspeed of an unladen Swallow . RESERVATIONS Book Your Table EMAIL info@forgottentonic.com PHONE 904-827-9055 HOURS Monday 11am - 11pm Tuesday 11am - 11pm Wednesday 11am - 11pm Thursday 11am - 11pm Friday 11am - 12am Saturday 11am - 12am Sunday 11am - 11pm Holiday Hours: Thanksgiving & Christmas Day - Closed ADDRESS 6 Aviles St St. Augustine, FL 32084 PHONE ( 904) 827-9055 EMAIL info@forgottentonic.com Reservations"
    },
    {
      "url": "https://www.logovisual.com/product/visual-thinking-solutions/visual-thinking-products/whiteboard-process-tool-kits/team-board/",
      "text": "Team Board - Logovisual Ltd +44 (0) 1756 792300 +44 (0) 1756 792300 About Services Collaboration Spaces Products ThinkingWall® Dividers Large mobile dividing walls with whiteboard surface plus storage or AV screen. More Acoustics Mobile acoustic walls with whiteboard, storage, and space for an AV screen. More Originals Our original whole wall whiteboard and simple mobile freestanding unit. More Desks, Tables & Seating Whiteboard desks and whiteboard tables, plus collaboration area seating. More Custom Whiteboards Custom Printed Whiteboards Magnetic Drywipe Maps Custom Printed Portable Whiteboards Custom Shaped Whiteboards Magnetic Year Planner Whiteboard Magnetic UK Map Whiteboard Magnetic Overlays Printed Planning Whiteboards Mobile & Freestanding Whiteboards ThinkingWall® Freestander ThinkingWall® Acoustic Freestander ThinkingWall® Acoustic Curve ThinkingWall® Mobile Acoustic AV ThinkingWall® Mobile Acoustic Shelf ThinkingWall® AV Divider ThinkingWall® Divider ThinkingWall® Stor Wall Mounted Whiteboards ThinkingWall® Whole Wall Frameless Magnetic Whiteboards Custom Sized Frameless Whiteboards Custom Printed Magnetic Leaderboards Custom Printed Leaderboard Leaderboard Name Strips Whiteboard Magnetics Custom Magnets Standard Magnets MagNotes Visual Thinking Solutions Visual Thinking Products MagNotes & Sticky Notes AV Conferencing Tools Featured product ThinkingWall ® Divider View Featured product ThinkingWall ® Freestander View Projects News Shop Printed Whiteboards and Leaderboards Collaboration Tools AV Conferencing Tools Magnotes & Sticky Notes Magnets Pens Cleaning Visual Thinking Products Contact Search +44 (0) 1756 792300 Home | Shop | Visual Thinking Solutions | Visual Thinking Products | Whiteboard Process Tool Kits | Team Board Team Board £ 105.00 Lightweight double-sided magnetic dry wipe team board 800mm x 630mm. Supplied in professional carry case with hand and shoulder straps. (total weight: 2.75kg). Special Requirements Quantity Add to basket Category: Whiteboard Process Tool Kits Description Reviews (0) Product Description Lightweight double-sided magnetic dry wipe team board 800mm x 630mm. This is slightly broader but shorter than A1 size. Supplied in a professional carry case with hand and shoulder straps. (total weight: 2.75kg). Reviews There are no reviews yet. Be the first to review “Team Board” Cancel reply You must be logged in to post a review. You may also like Hook-Up Portable Whiteboards Enquire now Team Modeller Enquire now Custom Printed Portable Whiteboards Enquire now Logovisual have previously supplied whiteboard panels for our London office, so when we needed whiteboards for a room at our head office we got in touch. The end result looks good – many thanks. ADRIAN SHAH-CUNDY, VOLKER WESSELLS All looks fantastic thank you!! The guys were a pleasure to meet and it was all so hassle free. CHARLOTTE WALTERS, TUNGSTEN NETWORK Commissioned Logovisual to design and install a folding wall in one of our technology rooms. Both our company and the NHS Trust were absolutely delighted with the installation a first for all. PETER SALT, IMMERSIVE Clear and prompt communication throughout and a very smooth installation process. Nothing was too hard. Highly recommended! TRACEY COVE, STEVENS & COVE Excellent, high quality product, purchased after wise advice and installed quickly by friendly installers. Perfect product for our meeting room needs. MIA ELLIOTT, DIOCESE OF GUILDFORD The board looks great! And I’d like to say your installers were absolutely fantastic, so friendly, organised and cleaned up. JESS MARTIN, VAYNERMEDIA Logovisual really understood our brief and made some great suggestions to make our designs come to life. They helped us bring a child’s game from a small tin to a life size piece of experiential, for us to take in to store at John Lewis. Everyone loved it. Thank you guys. TAMARA SPURWAY, WILD & WOLF As a product, they really provide a varied functionality to aid in our brainstorming and project works. These mobile whiteboards have really been an excellent investment and are immensely popular with our staff. SEBASTIAN FRANCIS-JONES, C SPACE The whole process from start to finish was excellent and the final product was second to none. Highly recommend Logovisual and the team and will be using them again very soon for the next project. LYNNE BRODA, OXFORD CARTOGRAPHERS The install was fab the guys were excellent and we all love the wall, so much in fact we are thinking of future projects including them. Once again can’t thank you enough for a great thorough service. ZOE HARRIS, CBRE GLOBAL INVESTORS Logovisual had as I believed to be the simplest and hassle free job on the project, install of white boards. They were in and out within 3 hours, a job well done! THE PROJECT TEAM, OVERBURY PLC The product itself is superbly built and easy to manoeuvre around with the attached wheels. From the office team’s communication before our event to the delivery team’s installation and pickup I found everyone to be really helpful and very professional going out of their way to meet our deadlines. I would certainly recommend logovisual. SHAUN O’HARA, SAATCHI & SAATCHI WELLNESS We were looking for a new “canvas” to share information and encourage joint thinking. The Thinking Wall turned out to be the perfect solution. There’s room to be expansive and for things to have real impact. The service we received right from our first enquiry, to installation (very fast, very painless) has been excellent. STEPHEN CROWE, SCOTTISH FUNDING COUNCIL We were pleased with the high level of customer service, our order was dealt with quickly and efficiently and we are thrilled with the finished product. The custom whiteboards that are exactly as we had envisaged them. STEVE CROSTHWAITE, HOTSPUR PRIMARY SCHOOL Just wanted to thank you again for your help, had a small amount of feedback from our client: Whiteboards are superb. Even better than expected! LEE, IDEA UK DESIGN & MARKETING The products look amazing and your team were clean, tidy and considerate. MARTIN HASSALL-LEES, PLACES FOR PEOPLE Useful links Terms & Conditions Privacy Policy Artwork requirements Shop online Shop My account Basket Checkout UNIT 5B AIREDALE BUSINESS CENTRE MILLENNIUM ROAD SKIPTON BD23 2TZ +44 (0) 1756 792300 © Logovisual Ltd 2025 | Terms & Conditions | Privacy Policy | Website by PS Website Design We use cookies on this website, by continuing to browse the site you are agreeing to our use of cookies. Find out more ."
    }
  ]
}