{
  "fuentes": [
    {
      "url": "https://www.foundersshootingclub.com/contact-us/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/member-lounge/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.apexshootingcenter.com/contact-us/",
      "email": "info@apexshootingcenter.com"
    },
    {
      "url": "https://www.partyslate.com/venues/founders-shooting-club",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.foundersclubofficial.com/",
      "email": "hi@jointfc.com"
    },
    {
      "url": "https://foundersclub.com/",
      "email": "info@foundersclub.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/firearms-instruction/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/squash/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/gun-sales/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://shootingforpeace.com/about-us/",
      "email": "info@shootingforpeace.com"
    },
    {
      "url": "https://www.foundersshootingclub.com/membership/",
      "email": "sgeorge@foundersshootingclub.com"
    },
    {
      "url": "https://www.apexshootingcenter.com/founders-shooting-club/",
      "email": "info@apexshootingcenter.com"
    },
    {
      "url": "https://foundersclub.com/pages/contact-us",
      "email": "don@foundersclub.com"
    },
    {
      "url": "https://foundersclub.com/pages/contact-us",
      "email": "info@foundersclub.com"
    },
    {
      "url": "https://foundersclub.com/pages/about-us",
      "email": "info@foundersclub.com"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "email": "info@clubspot.app"
    }
  ],
  "mails": [
    "contact@partyslate.com",
    "don@foundersclub.com",
    "hi@jointfc.com",
    "info@apexshootingcenter.com",
    "info@clubspot.app",
    "info@foundersclub.com",
    "info@scibpaints.com",
    "info@shootingforpeace.com",
    "sgeorge@foundersshootingclub.com"
  ],
  "nombre_sitio": "foundersshootingclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.foundersshootingclub.com/contact-us/",
      "text": "Contact Us - Fort Lauderdale, FL - Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Contact Us VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.702.9387 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/member-lounge/",
      "text": "Fort Lauderdale, FL | Members Lounge | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Member Lounge Luxury Awaits at Our Members Lounge in Fort Lauderdale, FL Founders Shooting Club provides an expansive space for our members more reminiscent of a 5-star hotel lobby than a gun club. We’re dedicated to creating a respectful community that allows our members to meet other like-minded people. Our clean and private members lounge is packed with luxury features and services you’ll love, including multiple seating areas, table games, large screen TV’s, refreshment service, kitchen for catered events, and a cigar smoking area. There is always something exciting happening at Founders Shooting Club. Whether you’re enjoying some relaxation time after a long week or meeting up with other members for a weekly social night, enjoy the privacy and luxury of our member lounge. Learn More About Our Members Lounge Features Our members lounge is the perfect place for friends to come together to watch the big game, or simply relax after some time in the health club or shooting range. Here you’re able to enjoy an assortment of features in our clean and luxurious space. At Founders Shooting Club our goal is to provide our members with the amenities to create unique and lasting memories. The features of our lounge include: Cigars Our high-end cigars are stored in a state-of-the-art humidifier to ensure freshness and flavor. Whether you’re celebrating a momentous occasion or simply relaxing, browse our selection of the finest cigars. Kitchenette with Lockers Members have access to lockers to store snacks and their favorite beverages. Large Screen TVs Watch all your favorite movies, shows, and sports on our high-definition flat-screen TVs. Communal Round Table Our communal round table is the perfect location for local meetings and meet-ups. Whether it’s impromptu or scheduled, you can accomplish what you need at our members lounge. Shuffleboard Shuffleboard is quickly becoming one of the most popular casual sports because of its unique gameplay. We have a shuffleboard table available for our members to learn and play this exciting game. Gourmet Food Service Our lounge features gourmet catering by our preferred outside event vendors. offerings for breakfast, lunch, dinner, and late-night snacks so that our members will never go hungry! They can also cater for business meetings and events both large and small. Menu items include gourmet pizza and burgers, healthy quinoa bowls, chicken salad wraps and fresh vegetarian options like the falafel burrito. Relax at Our Members Lounge in Fort Lauderdale The members lounge at Founders Shooting Club in Fort Lauderdale, Florida provides our members an exclusive space for VIP luxury. Our members participate in a wide variety of activities together. After a long week at work or spending time on the shooting range, it’s great to have a space to unwind and relax. Discover for yourself how you can become a member today and take advantage of our amenities. See Our Other Amenities VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Limited memberships are available now. Sign up today! Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.apexshootingcenter.com/contact-us/",
      "text": "Contact Apex Shooting Center in Fort Lauderdale, FL Skip to content Fort Lauderdale, FL Range Range Pricing Rental Firearms Handgun Rentals Rifle Rental Full Automatic Rifle Rental Membership Private Events Plan Your Visit Range Rules Apex Academy List of Apex Academy Classes Shooting Qualifications Private Lessons Guest Instructors Services Range Retail Store Armorer / Gunsmith NFA Purchases & Transfers Firearm Storage Events Corporate Events Parties About About Apex FAQ Forms Policies Contact Us Founders Club Membership Firearm Storage Class III/NFA Store Online Store Member Login Open menu Range Range Pricing Rental Firearms Handgun Rentals Rifle Rental Full Automatic Rifle Rental Membership Private Events Plan Your Visit Range Rules Apex Academy List of Apex Academy Classes Shooting Qualifications Private Lessons Guest Instructors Services Range Retail Store Armorer / Gunsmith NFA Purchases & Transfers Firearm Storage Events Corporate Events Parties About About Apex FAQ Forms Policies Contact Us Founders Club Membership Firearm Storage Class III/NFA Store Online Store Member Login Indoor Shooting Range in Fort Lauderdale, FL Discover Fort Lauderdale’s World-Class Shooting Range Engage in a world-class shooting experience with Apex Shooting Center. Our new $20 million indoor shooting center in Fort Lauderdale, FL, is home to the industry’s most advanced technology, offering first-time shooters and seasoned marksmen the opportunity to tap into a thrilling experience. Get in touch today to experience our establishment for yourself. Reconceptualizing Shooting Ranges Apex Shooting Center is reconceptualizing shooting ranges from the bottom up with the new gold standard of recreational shooting. With the highest standards of quality care, innovation, and safety, we spared no expense to optimize the shooting range experience of our guests. With advanced shooting range technology provided by Action Target and industry-leading professionals, discover a shooting center like no other. Our retrieval systems are used by the police and military and offer drills, move, and shoot, timed drills, and fun games. Top-Of-The-Line Shooting Range Services We go beyond the status quo to offer a safe and inviting environment packed with versatile shooting experiences that cater to diverse skill levels. Our services include: Shooting and training classes Expansive inventory of gun rentals, including fully automatic firearms Founders Shooting Club QuickShot shooting range Indoor shooting range Tactical shooting range Apex gourmet food service Birthdays and corporate events Our Exclusive Founders Shooting Club Apex Shooting Center is Florida’s most renowned shooting club . The Founders Shooting Club invites gun enthusiasts to join our exclusive circle with a private, indoor shooting range and members-only amenities. Amplify your skills, surround yourself with members who share your passion, and gain access to best-in-class events, guest speakers, and more. Superior Firearm Rentals If you’re new to shooting or do not own a firearm, Apex Shooting Center is your source for superior firearm rentals. Our expansive selection includes an unrivaled range of premium firearms. With diverse calibers to uncover your preferred match, to the latest models, and everything from rifles to pistols, machine guns, and exotics, we have a vast array of rental guns to choose from. Your Source for Firearm Rental Excellence Leading with a commitment to quality, we routinely inspect and meticulously maintain our firearm rentals to foster unwavering safety and optimal performance. Our experts provide personalized guidance, helping you discover the firearm best suited to your needs. It’s our mission to make your time with us rewarding and enjoyable, no matter your shooting level. Leading With a Commitment to Maximum Safety Your safety is paramount to us; that’s why our rigorously trained and qualified professionals adhere to the highest standards of security and care. With strict protocols in place, you can feel confident that a day with a machine gun rental at Apex Shooting Center means a day in a secure environment, guided by the industry’s most capable hands. Connect With Apex Shooting Center in Fort Lauderdale, FL Whether you’re a firearm enthusiast or a first-timer, Apex Shooting Center in Fort Lauderdale, FL, welcomes you to our exclusive shooting range. Embark on a thrilling adventure, learn new skills, and hone your craft with our trusted shooting experts. Contact our team today to get started. Get In Touch With Us Get in touch with Apex Shooting Center in Fort Lauderdale, FL, by giving us a call at: 954-887-6101 Send us an email at info@apexshootingcenter.com Stop By To See Our Shooting Range Professionals Apex Shooting Center is located at: 5320 Powerline Road, Suite 100, Fort Lauderdale, FL 33309 We are between Commercial Blvd. and Cypress Creek Road, in the same plaza as Xtreme Action Park. See below for precise directions for both South and North point travels. We look forward to seeing you soon. Directions From South Points If you are traveling from downtown Fort Lauderdale or points south, we’re here to simplify your travels. The directions are as follows: Route 95 north to exit 32 – Commercial Blvd. Turn left on Commercial Blvd., remain in the right lane Take the first right to Powerline Road We are ¼ mile ahead on the right. Directions From North Points If you are traveling from West Palm Beach and points north, we’re here to simplify your travels. The directions are as follows: Route 95 south to exit 32 – Commercial Blvd. Turn right on Commercial Blvd., remain on the right lane Take the first right to Powerline Road We are ¼ mile ahead on the right ﻿ Reach Out \" * \" indicates required fields Name * First Last Email * Phone Message * Email This field is for validation purposes and should be left unchanged. Δ Footer Apex Shooting Center in Fort Lauderdale is Florida's premier shooting facility. Facebook Instagram Contact Information 5320 Powerline Road Suite 100 Fort Lauderdale, FL  33309 954.887.6101 info@apexshootingcenter.com Directions Business Hours Monday 11 AM - 9PM Tuesday 11 AM - 9PM Wednesday 11 AM - 9PM Thursday 11 AM - 9PM Friday 11 AM - 9PM Saturday 9AM - 9PM Sunday 9AM - 8PM © 2023 Apex Shooting Center. All rights reserved. Privacy Policy Indoor Shooting Range in Fort Lauderdale, FL Privacy Policy Contact Us"
    },
    {
      "url": "https://www.partyslate.com/venues/founders-shooting-club",
      "text": "Founders Shooting Club | Fort Lauderdale Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Founders Shooting Club Find Venues / Florida / Fort Lauderdale / Founders Shooting Club Founders Shooting Club 5320 Powerline Rd, Fort Lauderdale, FL 33309, USA Max Seated 120 Max Standing 200 Request info Favorite Overview Gallery 1 About Founders Shooting Club Founders Shooting Club is Florida's New private gun club featuring a members-only\nexperience with a luxurious country club atmosphere and amenities for shooting\nenthusiasts. Available 24 hours a day. Featuring state-of-the-art shooting lanes with\ncomputerized lane retrieval systems.\nIndoor Shooting Range- Members have exclusive access to our state of the art 25 yard\npistol and rifle range. Technology including touch screen range controls and the latest\nair filtration equipment ensure a memorable range experience.\nThe Members Lounge features an assortment of games, TV’s and a poker table. A large\nand luxurious clubhouse including the \"Al Capone Cigar Lounge\" with premium cigar\nhumidor and private Boardroom.\nThe recreational side of the facility features a Gym, Squash Court & Golf Simulator Pricing Packages Founders Shooting Club hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Map 5320 Powerline Rd, Fort Lauderdale, FL 33309, USA Follow Us Call Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.foundersclubofficial.com/",
      "text": "Founders Club | Exclusive Community For Founders, Entrepreneurs, and CEOs About Us resources Events Become A Partner FOUNDERSÂ FORUM Member directory Login Logout Become A Member My Profile 01 About Us 02 Events 03 Become a Partner 04 Founders Forum Become A Member Login My Profile Logout 01 About Us 02 Events 03 Become a Partner 04 Founders Forum Become A Member Login My Profile Logout Welcome to the Founders Club The Modern Day Community of Founders, Entrepreneurs, and CEOs Focused on Mind, Body, and Business Become A Member A Community for All Seasons From $100M exits, to thousands of retail stores, brick-and-mortar success stories, and so much more, we are here to help you grow through all stages of your businessâ life. The Core 6 Austin Los Angeles Miami New York City Toronto Vancouver 20 Cities Atlanta Bend Charlotte Chicago Columbus Dallas Denver Dubai Greenville Las Vegas London Montreal Phoenix Portland Salt Lake City San Diego San Francisco San Jose Seattle Tampa 450+ Members 75+ Annual Events 20 Cities 6 Core Hubs What Your Membership Includes Become A Member 01 Monthly Masterminds The crux of our group; the smartest founders don't try to do it all alone. The right room makes all the difference. 02 Local Community Meeting virtually is great. Hanging in person is even better. 03 Access to 75+ Private Events From John Summit to mountain summits, you never know whatâs coming next. 04 Annual Retreats The Super Bowl of Entrepreneurship. You donât want to miss this. 05 Founders Weekends From Colorado, to Arizona, to Miami, and beyond. Lifelong friendships are made here, businesses are grown here.Worth every second. 06 Online Community The bread and butter of our group. Hang out, connect, joke around. Where lifelong friendships are made. 07 Weekly Speaker Series Where else are you going to hang out with the Co-Founder of Starbucks, ask questions, and network with 450+ other A-players? Become A Member For Founders, By Founders Our carefully-curated community contains hundreds of North Americaâs most prolific entrepreneurs sharing one missionâhelping you become the best version of yourself Victoria Simmons Sock Fancy Jake Karl Mid-Day Squares Dan Mizour Coldture Sarah Vilenskiy Blossom Essentials Jennifer Commins Pluck Tea Connect with industry leaders Am I A Good Fit? The Founders Club prides itself on exclusivity, with an acceptance rate of less than 6%. We prioritize founders who are committed to helping others succeed. Our members average ~$10M-50M in annual revenue, with the club boasting a minimum requirement to join of:$500k in revenue, $1M in funding, or a $2M+ exit. Most are digital startup founders or executive in online and retail sales. For driven leaders, this is the place to connect and grow. Ready to answer the call? Become A Member Your Favorite Entrepreneurâs Favorite Newsletter The Founders Clubâs very own newsletter, Founders Forward, takes you behind the scenes of a week in the life of a high-growth startup founder. From actionable lessons, marketing breakdowns, tips on bootstrapping, and much , much moreâthis is one newsletter that no founder can afford to miss. Email Address Sign Up For Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Â©2024 The Founders Club Â©2024 The Founders Club Apply Now Become A Member Links About Us Become a Partner Nomination Program Privacy Policy Terms of Service Socials Instagram LinkedIn Sign Up For Our Newsletter Sign Up Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Apply Now Become A Member CONTACT US Contact Us Submit Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. You're Invited: Want a Peek Inside The Founders Club? We host private events around the worldâbringing together 7, 8, and 9-figure founders for real conversations and meaningful connections. Join the list and be the first to know when weâre hosting one near you. Name* Email* Submit Thank you! Your submission has been received! Oops! Something went wrong while submitting the form."
    },
    {
      "url": "https://foundersclub.com/",
      "text": "Founders Club Contact us or call 877-534-4653 for all inquiries. Search AUD CAD USD Login 0 Cart Founders Club Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login 0 Cart Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login Search 0 Cart Search our collections What are you looking for? Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. View bestsellers Pre-order our new design Bespoke timepieces Shop exclusives Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Featured Products Founders Club 4th Generation Tour Series Club Lock Organizer Golf Cart Bag for Men with 14 Way Anti Rattle Divider Top- Free Snap On Rain Hood-Full Length Dividers 3 reviews $239.95 $299.95 Founders Club 4th Generation Player Series Club Lock Organizer Golf Cart Bag for Men with 14 Way Anti Rattle Divider Top- Free Snap On Rain Hood-Full Length Dividers 18 reviews $219.95 $279.95 Founders Club Splash Waterproof Golf Cart Bag Ultra Dry for Rainy Days on The Golf Course Light Weight 14 Way Full Length Divider and Rain Hood 5 reviews $219.00 $269.00 Founders Club TG2 Complete Womens Golf Set - Right-handed 12 reviews Sold Out Founders Club Golf Women's 14 Way Divider TG2 Stand Bag 2 reviews Sold Out Founders Club Colorado 14 Way Full Length Divider Golf Cart Bag 17 reviews $189.95 $249.95 Founders Club Golf Hybrid Stand Bag for Walking or Cart 14 Way Full Length Divider 13 reviews Sold Out Founders Club 3rd Generation Premium Organizer 14 Way Golf Cart Bag 217 reviews $199.95 $279.95 Complete Sets Founders Club RTP7 Men's Golf Club Set with 14 Way Organizer Golf Bag Right Hand 10 reviews from $429.00 $549.00 Founders Club Bomb Men's Golf Club Set with 14 Way Organizer Golf Black Bag Right Hand 2 reviews from $899.00 $1,099.00 Founders Club Bomb Men's Golf Club Set with 14 Way Organizer Golf Charcoal Bag Right Hand 3 reviews from $899.00 $1,099.00 Founders Club Bomb Men's Golf Club Set with 14 Way Organizer Golf Red Bag Right Hand 5 reviews from $899.00 $1,099.00 Founders Club Bomb Men's Golf Club Set No Bag Right Hand 1 review from $699.00 $1,099.00 Founders Club Bomb Men's Golf Club Set with Stand Bag Right Hand Firm Flex No reviews $799.00 $999.00 Push Carts Founders Club Swerve 3 Wheel Golf Cart - White/Blue 5 reviews Sold Out Founders Club Swerve 3 Wheel Golf Cart- Black/Black 2 reviews $179.00 $279.00 Founders Club Swerve 3 Wheel Golf Cart - Charcoal/Blue 1 review Sold Out Made by Golfers, for Golfers. Phone & Email Support Avaliable Free Shipping on All Orders! At Founders Club we are a team. We work together, eat together, read the sports section together, and surf the internet together. We never stop improving, and we know that every new product can be done better than its predecessor. We are driven to reach perfection. It is and always will be the target. Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up Contact Us Main Office: 739 Seedling Ct STE 110 Colorado Springs,CO 80132, USA. Phone: (877) 534 4653 Email: info@foundersclub.com Founders Club About Us Contact Us News Privacy Policy Refund Policy Shipping Policy Terms of Service © 2025 Founders Club . Designed by SW . Powered by Shopify . American Express Apple Pay Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa We use cookies on our website to give you the best shopping experience. By using this site, you agree to its use of cookies. I agree Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/firearms-instruction/",
      "text": "Fort Lauderdale, FL | Firearm Instructions | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Firearms Instruction Safe Firearms Training in Fort Lauderdale, FL Founders Shooting Club members have exclusive access to our state-of-the-art shooting range and training services in Fort Lauderdale, FL. As the area’s leading gun club and shooting range, we provide every member with a VIP experience unlike anywhere else. The FSC instructors are the best in the business, have years of experience, hold top certifications, and have experience instructing civilian, police, military, and personal protection personnel. Our clean, safe, and comfortable indoor shooting range provides you with the perfect opportunity to improve your skills. Whether you’re experienced with handling a firearm or have just begun your training, we can provide you with all the information and instruction necessary. Learn more about our firearms training and become a member to get started. Firearm Instruction and More Founders Shooting Club is the perfect location to hone your firearm skills. Our firing range is rated for most pistols and long gun calibers, so we can accommodate you no matter what you’re interested in firing. We combined state-of-the-art technology and tried and true techniques to ensure you enjoy a safe and exciting experience when you choose us. In addition to firearm training, we also provide: Tactical Training – Learn combat theory and how to meet particular challenges with specific skills. Night Vision Training – Experience the excitement and challenge of firearm training while utilizing night vision technology. Combat Training – Our professional trainers will create a combat-like experience for members. Self-Defense Training – Learn how to protect yourself and your family if you’re ever attacked by taking our self-defense training class. Learn More About Our Instructors At Founders Shooting Club, we want to provide every one of our members with the highest quality experience. Our knowledgeable and professionally trained instructors are comprised of retired and active-duty military and law enforcement officers. Their combined experience in the field provides our members with unparalleled insight into the proper operation and techniques for firearm training, combat training, and much more. They can assist advanced and novice members. We also offer women-only classes led by female instructors. Luxury Gun Range in Fort Lauderdale, FL Founders Shooting Club is available to provide our members with a luxurious and first-class experience. By combining the latest technology, clean and comfortable atmosphere, and like-minded members, you won’t find an experience like this anywhere else in the area. Our team of licensed and professional trainers provides more than just firearm training. If you’re looking for combat training and more, choose us. Find out how you can become a member today. See Our Other Amenities VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Limited memberships are available now. Sign up today! Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.foundersshootingclub.com/",
      "text": "Fort Lauderdale, FL | Gun Club | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Miami & Fort Lauderdale’s Premier Private Gun Club Limited memberships are available now Watch our video! Shooting Ranges, Cigar Lounge, Fitness Center, Golf Simulator, and More Founders Shooting Club is Florida’s premiere private shooting club. Fort Lauderdale and Weston, MA locations are open with Miami coming in Q1 2026.  Our members have reciprocal access to our full network of 10 locations coming in the next two years. Members enjoy a private shooting range experience, in a safe, cool and clean indoor pistol & rifle range. The shooting range features the very latest in safety technology, including touch screen controls, biometric security, and automated HEPA air filtration equipment. The club also features unique social events with guest chefs from around the world, wine & bourbon tastings and guest speakers.  Meet the “who’s who” of South Florida at our exclusive networking events.  Founders Shooting Club is also the ONLY gun club on Earth to be accepted as a reciprocal member of Private Club World. They had to create a new category for us! The Founders Shooting Club is not only Florida’s premier private shooting facility, it is a community of family and friends who enjoy having fun, socializing and interacting with like-minded people. Check out our facility today!  It is unmatched by any shooting facility in the country. A large member lounge Cigar humidor Table games Boardroom for business activities and networking Full fitness gym Locker room with showers Squash courts Golf simulator Reserved parking On-site instructors Biometric security 24-hour access Club Amenities Read about Founders Shooting Club in the news! Guntry Club Opens in Fort Lauderdale Florida's First 'Guntry' Club Opens in Fort Lauderdale In a formal ceremony at the club on November 30, 2023, the Founders Shooting Club and our CEO Victor Grillo were given a proclamation from three mayors and six chiefs of police for our unparalleled work in the community and for promoting safe gun ownership. Founders Shooting Club CEO Victor Grillo was featured in Fort Lauderdale’s Venice Magazine: “Fort Lauderdale residents and visitors have plenty of choices when it comes to shooting ranges, but when it comes to being a part of a premier experience, that’s the Founders Shooting Club. At the helm is Victor Grillo, a self-described “serial entrepreneur” (he’s dominated in media, marketing, travel, consumer products, medical services, and the legal world) who opened the “guntry club” in August.” Read full article… Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Exclusive Member Events Firearms Instruction Fitness Center Squash VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/squash/",
      "text": "Fort Lauderdale, FL | Squash Court | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Squash Full-Size Squash Court in Fort Lauderdale, FL Squash is quickly becoming one of the most popular sports throughout the country. Founders Shooting Club has one of the only squash courts available in Fort Lauderdale. Our members have exclusive access to our newly constructed squash court. Make a game of squash a weekly ritual with a few friends or hone your skills by joining our local squash league. Whether you’re just learning the sport, or you’ve been playing for years, you’ll love the experience in our full-size squash court. Learn the Rules of Squash Squash is a racket and ball game played inside a small court with four walls. You can play in a one-on-one match or doubles, with four players on the court. The straightforward rules and relatively small area required to play have helped squash grow in popularity over the years. When you become a member, our team can help you better understand the rules as your skills progress. The typical rules of playing squash include: Serve – One player serves the ball to the second player by placing one foot within the service box. The player then strikes the ball with the racket. The ball must land within the playable zone of the wall. Play – Once the serve is established, the players take turns hitting the ball on the field of play. Once hitting the racket, the ball must not hit the floor before hitting the wall. A point is awarded when a player is unable to return the volley. Scoring – Most squash games are played until one player scores 15. However, the winner must win by at least two points. Start Playing a Game of Squash Today At Founders Shooting Club, you can find squash players with various skills. Our goal is to cultivate a community, so we encourage all players to learn, teach, and grow their skills together. We welcome players of all skill levels to join. As one of the only squash courts in Fort Lauderdale, Florida, we can help improve your skills. Become a member today to use our squash court and our other amenities, including a health spa, members lounge, and firing range. Contact us today to get started. See Our Other Amenities VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Limited memberships are available now. Sign up today! Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.foundersshootingclub.com/club-amenities/gun-sales/",
      "text": "Fort Lauderdale, FL | Gun Sales | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Gun Sales High-Quality Gun Sales and Service Whether you’re looking to purchase your first firearm or purchasing the latest rifle for your collection, Founders Shooting Club in Fort Lauderdale, Florida provides gun sales, service, and so much more. As a member, you’ll receive exclusive access to the largest selection and variety of firearms available for purchase. We also have a licensed and experienced gunsmith to service your firearm for smooth and safe operation. Discover some of the benefits our members enjoy, and consider joining us today. Contact Us Gun Sales in Fort Lauderdale, FL Hunters, collectors, and those looking to protect themselves can find a wide selection of guns available at Founders Shooting Club. We have the largest selection of firearms and firearms accessories available. Speak with our knowledgeable and experienced gunsmith to find the right gun that fits your needs. We’ll work to understand the purpose of the firearm, the customization level, and your experience with weapons to determine which is best for you. We even provide demos so you can test the gun for yourself before purchase. We carry numerous types of firearms and accessories, including: Pistols Rifles Shotguns (Class 3) Carry Ammo Sights Lights Slings Grips And More Gunsmith Services Does your firearm need an update, modification, or repair? At Founders Shooting Club, we provide gunsmith services to ensure your gun is in good operating condition while ensuring it’s comfortable to use. Our knowledgeable and experienced gunsmith has years of experience repairing and modifying various firearm types and brands, including Smith Wesson, Remington, Beretta, and more. When you bring your firearm to us, we’ll inspect it and recommend any necessary repairs or replacements. Our gunsmith services include: Gun Repairs Over time, gun parts can wear down, causing your gun to misfire or become stuck. We’ll repair damaged or broken gun parts to ensure they can be used safely. Gun Modifications Gun modifications ensure that the firearm is comfortable for use and customized to meet your exact specifications. Parts Replacement Our team offers gun part replacement services if a part cannot be repaired. Let our team keep your gun operational. Gun Sales and Service Experts in Fort Lauderdale, FL Founders Shooting Club members have access to the best selection of high-end firearms available in Fort Lauderdale, Florida and the surrounding communities. Our gunsmith can help you find the right gun to meet your style, budget, and need. You should clean your pistol or rifle after every trip to the range. As your local gunsmith, we also offer repair, cleaning, and modification services. We have everything you need to ensure your firearm is safe and comfortable to use. See Our Other Amenities VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form on the right to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Limited memberships are available now. Sign up today! Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://shootingforpeace.com/about-us/",
      "text": "About Us - Shooting For Peace Skip to content Company Menu Toggle About Us Shooting For Peace Programs Sports Diplomacy Programs Sponsors Camps Schools News/Events Menu Toggle Events News Proclamation Education Menu Toggle Shooting For Peace App SignUp/Login Course Sign Up Testimonials Contact Privacy Policy Menu Toggle Terms and Conditions Donate Today Donate Today Main Menu Company Menu Toggle About Us Shooting For Peace Programs Sports Diplomacy Programs Sponsors Camps Schools News/Events Menu Toggle Events News Proclamation Education Menu Toggle Shooting For Peace App SignUp/Login Course Sign Up Testimonials Contact Privacy Policy Menu Toggle Terms and Conditions Donate Today Donate Today About Shooting For Peace Join us as we fulfill our vision for our youth! Our Mission Bring communities together, promote education through reading, and encourage young people to engage in sports and other peaceful activities. 200+ Scholarships Awarded $10M+ In Dollars Provided 3 Million Views on Social Media 50K Educational Workbooks Delivered to Schools Participation From local commmunity leaders (mayors, police, celebrities, etc.) Year Scholarship Dollars Awarded Books Donated Number of Scholarships Awarded College 2017 $1,700,000 50,000 47 Alabama State 41 Concordia 2018 $1,902,936 30 Talladega 7 VSU $1,339,864 22 Talladega 2019 $2,726,420 55 Dillard $840,000 15 Stillman 2021 $190,780 Talladega $1,360,000 26 Stillman TOTAL $10,060,000 50,000 243 What WE ACCOMPLISHED SINCE 2015 The SHOOTING FOR PEACE program inception began 2015 and was launched in 2016 at NBA ALL STAR Weekend in Toronto, ON. In 2016 we completed a nine-city tour during the school year delivering positive messages and encouraging students of lower socioeconomic status to believe in themselves to make a difference in their futurees. From 2017-2019 our tours have stopped at every NBA All Star Weekend and BIG3 tour as well as other city stops along the way. The (18) cities including: LAs Vegas, Boston, Philly, Atlanta, New Orleans, Dallas, Houston, Detroit, Chicago, Harlem, Marietta, Toronto, Oakland, New York, Southfield, Miami, Charlotte, Los Angeles and Cleveland Our Impact and Implementation Report Click On The Images Below To View and Read Full Reports What is shooting for peace Be a part of our vision to inspire our youth to unite and reach their greatest potential! Together we can help bring communities together, promote education through reading, and encourage young people to engage in sports and other peaceful activities. SHOOTING FOR PEACE is a program spearheaded by global ambassador & former NBA player Jerome “JYD” Williams and NBA Legends. National events supporting Jerome’s non-profit, JYD Project, Inc., Choo Smith Youth Empowerment, and the Chapters of the National Basketball Retired Players Association (Las Vegas Chapter) bring together community members, schools, and students, creating memorable experiences and offering educational opportunities through: EDUCATIONAL WORKBOOK DISTRIBUTION: JYD Project, Inc., Choo Smith Youth Empowerment, and the NBRPA Las Vegas Chapter strive to improve literacy rates and bring unattainable experiences to life. With the support of Every, a leading digital education company. The goal for each event is to distribute 25,000 digital and physical educational workbooks to local District School Board students in elementary, intermediate, and high schools in each city. PANEL DISCUSSION An open forum discussion for youth and community members with featured speakers from the local community and special celebrity quests. POETRY-WRITING CONTEST High school students at participating schools will have the opportunity to express what Shooting for Peace means to them by writing a one page poem on the subject and presenting it to a panel for prizes and scholarship donations. SCHOLARSHIP AWARDS Partnering universities are offering scholarship opportunities to qualifying students who participate in the poetry-writing contest. Each scholarship is valued from $2,000 up to approximately $100,000 (for full tuition and books). CELEBRITY BASKETBALL GAME Former NBA, WNBA and Harlem Globetrotter players take the court with local high school telent, police, celebrities and community members for an afternoon of entertainment, music and amazing skills. About JYD Project, Inc. The JYD Project is a 501[c][3] youth development organization for kids ages 5-18 that encourages young people to realize their full potential and partners with other charities that support and serve youth. The JYD Project assists students in becoming positive and productive adults through fun and engaging educational based programs. www.jydproject.com Learn more About the NBRPA Las Vegas Chapter The National Basketball Retired Players Association (NBRPA) is a 501[c][3] non-profit organization with a two-pronged mission to assist former NBA, ABA, Harlem Globetrotters and WNBA players in their transition from the playing court into life after the game, while also positively impacting communities and youth through baseketball and educational programs. https://www.legendsofbasketball.com/las-vegas/ About CHOO Smith youth empowerment Choo Smith Youth Empowerment enhances youth by preparing them to be fully productive citizens and lifelong difference makers. We develop and implement programs such as after school tutoring, mentoring and youth camps that facilitate positive growth in the lives of the youth we serve, as well as their families and community. www.chooyouth.org Get In Touch Phone: 702-589-4658 Email: info@shootingforpeace.com Bringing Communities Together, Promoting Education & Encouraging Young People To Engage In Peaceful Activities Twitter Our Location 2831 St Rose Pkwy, Henderson, NV 89052 Quick Link Home About Us Menu Testimonial Contact Us Important Details Sunday to Wednesday 9AM - 10.30PM Thursday, Friday, Saturday 9AM - 12.30AM Donate Copyright © 2025 Shooting For Peace Powered by: Analytics Beyond & Beyond Digital"
    },
    {
      "url": "https://www.foundersshootingclub.com/membership/",
      "text": "Fort Lauderdale, FL | Membership Info | Founders Shooting Club Skip to Content chevron-left chevron-right chevron-up chevron-right chevron-left arrow-back star phone quote checkbox-checked search wrench info shield play connection mobile coin-dollar spoon-knife ticket pushpin location gift fire feed bubbles home heart calendar price-tag credit-card clock envelop facebook instagram twitter youtube pinterest yelp google reddit linkedin envelope bbb pinterest homeadvisor angies menu Club Amenities Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership About Founders Shooting Club FAQs Club Rules Locations Events News & Updates Contact Us Club Amenities show submenu Member Lounge Shooting Range Indoor Golf Simulator Board Room Smoke Free Lounge Firearms Instruction Fitness Center for Shooters Squash Membership show submenu About Founders Shooting Club FAQs Club Rules Locations Events show submenu News & Updates Contact Us 954.887.6100 Membership Founders Shooting Club is an exclusive gun club and firing range in Fort Lauderdale, Florida. We provide our members with a wide range of amenities and features you won’t find anywhere else. As a member, you’ll be treated like a VIP whenever you join us. Our team is committed to providing an unforgettable experience for every member. Whether you’re practicing on the firing range, working on your muscle-building plan in our health spa, or just relaxing in our lounge after a day at work, you can do so in comfort and luxury. Discover what it means to be a member at Founders Shooting Club. VIP Membership in Founders Shooting Club To learn about membership or to book a personal tour of the club, please use the form below to contact our Vice President of Membership, Simon George. Address 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 Phone 754.241.2260 Email sgeorge@foundersshootingclub.com Open 24 Hours Initiation fee: One-time initiation fee Dues: Fort Lauderdale $229, Miami $249 per month Includes: Unlimited use of the range with no lane fees and use of the other amenities in the club.  Full reciprocity with other locations.  Please see our FAQ page for answers to common questions. LIMITED-TIME PROMOTION The first 20 VIP members that join in September will receive $1,000 off of initiation fee! Miami Only: 500 Charter memberships will be offered.  $1,000 deposit required.  Free shooting lesson included and ask about options to use the Fort Lauderdale club until Miami opens. First Name * Required Last Name * Required Phone * Required Email * Required Which location are you primarily interested in? * Required Fort Lauderdale North Miami West Palm Beach Message Consent Please check this box if you would like to allow us to communicate with you by text message. I agree that by providing my mobile number and submitting the form, I consent to be contacted by phone or SMS text message.  View our Privacy Policy . Message & data rates may apply. Message frequency may vary. You can reply Help for more information or reply STOP to opt-out of further messaging. This field is hidden when viewing the form Company This field is hidden when viewing the form Lead Source Limited memberships are available now. Sign up today! Back to the top facebook twitter instagram Youtube Florida's premier private shooting club 5320 Powerline Road Suite 120 Fort Lauderdale, FL 33309 facebook twitter instagram © 2025 Founders Shooting Club. All Rights Reserved. Privacy Policy Sitemap"
    },
    {
      "url": "https://www.apexshootingcenter.com/founders-shooting-club/",
      "text": "Membership at Apex Founders Shooting Club in Lauderdale, FL Skip to content Fort Lauderdale, FL Range Range Pricing Rental Firearms Handgun Rentals Rifle Rental Full Automatic Rifle Rental Membership Private Events Plan Your Visit Range Rules Apex Academy List of Apex Academy Classes Shooting Qualifications Private Lessons Guest Instructors Services Range Retail Store Armorer / Gunsmith NFA Purchases & Transfers Firearm Storage Events Corporate Events Parties About About Apex FAQ Forms Policies Contact Us Founders Club Membership Firearm Storage Class III/NFA Store Online Store Member Login Open menu Range Range Pricing Rental Firearms Handgun Rentals Rifle Rental Full Automatic Rifle Rental Membership Private Events Plan Your Visit Range Rules Apex Academy List of Apex Academy Classes Shooting Qualifications Private Lessons Guest Instructors Services Range Retail Store Armorer / Gunsmith NFA Purchases & Transfers Firearm Storage Events Corporate Events Parties About About Apex FAQ Forms Policies Contact Us Founders Club Membership Firearm Storage Class III/NFA Store Online Store Member Login Founders Shooting Club Founders Shooting Club is Florida’s premiere private shooting club.  Members enjoy a private shooting range experience, in a safe, cool and clean indoor pistol & rifle range. The shooting range features the very latest in safety technology, including touch screen controls, biometric security, and automated HEPA air filtration equipment. The club also features exclusive social events with guest chefs from around the world, tastings and guest speakers. The Founders Shooting Club is also a community of family and friends who enjoy having fun, socializing and interacting with like-minded people. To see a full list of club amenities and learn more about membership, please visit foundersshootingclub.com . Footer Apex Shooting Center in Fort Lauderdale is Florida's premier shooting facility. Facebook Instagram Contact Information 5320 Powerline Road Suite 100 Fort Lauderdale, FL  33309 954.887.6101 info@apexshootingcenter.com Directions Business Hours Monday 11 AM - 9PM Tuesday 11 AM - 9PM Wednesday 11 AM - 9PM Thursday 11 AM - 9PM Friday 11 AM - 9PM Saturday 9AM - 9PM Sunday 9AM - 8PM © 2023 Apex Shooting Center. All rights reserved. Privacy Policy Indoor Shooting Range in Fort Lauderdale, FL Privacy Policy Contact Us"
    },
    {
      "url": "https://foundersclub.com/pages/contact-us",
      "text": "Contact Us - Founders Club Contact us or call 877-534-4653 for all inquiries. Search AUD CAD USD Login 0 Cart Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login 0 Cart Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login Search 0 Cart Search our collections What are you looking for? Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. View bestsellers Pre-order our new design Bespoke timepieces Shop exclusives Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Contact Us How can we help you? Address: Founders Club 18965 Base Camp Rd Ste A7, Monument, CO 80132 U.S.A Telephone: (877) 534 4653 If you have any questions or comments, please complete the following form or email us at the below email address. Customer Service: info@foundersclub.com Returns and Refunds: don@foundersclub.com We love hearing from you! Please fill out the form below if you have any inquiries about our products, sizing, gifting, returns + exchanges or about your order. Name * Email * Subject * Order Information General Product Inquiry Sizing, Product Specifications Returns + Exchanges Gifts Other Message * Submit Made by Golfers, for Golfers. Phone & Email Support Avaliable Free Shipping on All Orders! At Founders Club we are a team. We work together, eat together, read the sports section together, and surf the internet together. We never stop improving, and we know that every new product can be done better than its predecessor. We are driven to reach perfection. It is and always will be the target. Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up Contact Us Main Office: 739 Seedling Ct STE 110 Colorado Springs,CO 80132, USA. Phone: (877) 534 4653 Email: info@foundersclub.com Founders Club About Us Contact Us News Privacy Policy Refund Policy Shipping Policy Terms of Service © 2025 Founders Club . Designed by SW . Powered by Shopify . American Express Apple Pay Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa We use cookies on our website to give you the best shopping experience. By using this site, you agree to its use of cookies. I agree Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up"
    },
    {
      "url": "https://foundersclub.com/pages/about-us",
      "text": "About Us - Founders Club Contact us or call 877-534-4653 for all inquiries. Search AUD CAD USD Login 0 Cart Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login 0 Cart Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes Golf Bags Organizer Anti-Clanking Golf Cart Bag Waterproof Bags Travel Cover Stand Bags Colorado Cart Bag Franklin Cart Bag 2 IN 1 Cart Bag Complete Sets Bomb Set RTP7 Set Woods Drivers Bomb Driver Bomb Fairway Woods Fresh Metal Fairway Woods Irons and Hybrids Forged Irons Bomb Irons Double Sole Hybrid Iron Putters and Wedges Stand Putter Bomb Putter FP Putters 255 SPIN Wedges Push Carts Ladies TG2 Set Believe Set Believe Pearlescent Golf Balls Accessories RTP7 Golf Ball 24 Pack Rangefinders Shoes AUD CAD USD Login Search 0 Cart Search our collections What are you looking for? Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. View bestsellers Pre-order our new design Bespoke timepieces Shop exclusives Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 Menu title This section doesn’t currently include any content. Add content to this section using the sidebar. Your product's name $49.00 Your product's name $49.00 Your product's name $49.00 About Us For 35 Years, Founders Club has been producing game improvement Golf Equipment to make golf more fun for golfers of all abilities. In 1989 Gary Adams started Founders Club after leaving as the head of Taylor Made, a company he founded in 1978. Gary Adams(for more on Gary Adams https://progolfnow.com/2022/06/07/golf-entrepreneurs-gary-adams-metalwoods/ )  was considered the “founder” of the metal wood thus the name of the company Founders Club. Under Adams’ leadership Founders Club quickly became the number 2 Driver and Fairway wood (in use) on the PGA Tour behind Taylor Made. The company had a reputation for producing quality equipment and several Tour Players including Lee Janzen, Fred Funk, Curtis Strange, Dave Stockton, Lanny Wadkins, Tom Watson, and Hale Irwin among others played Founders Club equipment at various times in the 1990’s. During that stretch a Founders Club driver led the PGA Tour in Driving Accuracy for five consecutive years. The hallmark of Gary Adams designs were precision “Face Progression” and perfect “Bulge and Roll” coupled with the “Blind Bore” hosel which produces low spin rates, optimum launch angle and a penetrating ball flight for maximum distance. In addition to Gary Adams, Founders Club designers that went on to create an impact in the golf industry included Bob Vokey( for more on Bob Vokey https://www.vokey.com/nav/who-is-bob-vokey.aspx#) who later gained fame with Titliest and Jeff Sheets(for more on Jeff Sheets https://www.jeffsheetsgolf.com/founders-club---past-projects) who left Founders Club to be head of Research and Design with Top Flite and later with Golfsmith. Founders Club continues to hold true to the original pear shaped heads designed by Gary Adams along with adhering to his concepts of producing clubs with low spin rates and optimum launch angles. Over the last 3 decades, Founders Club has designed Golf Clubs, Carts, and Bags for every type player, from PGA Tour Winners to beginning golfers. We at Founders Club are proud of our tradition and look forward to the challenge of producing cutting edge products that golfers have come to expect out of Founders Club. Made by Golfers, for Golfers. Phone & Email Support Avaliable Free Shipping on All Orders! At Founders Club we are a team. We work together, eat together, read the sports section together, and surf the internet together. We never stop improving, and we know that every new product can be done better than its predecessor. We are driven to reach perfection. It is and always will be the target. Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up Contact Us Main Office: 739 Seedling Ct STE 110 Colorado Springs,CO 80132, USA. Phone: (877) 534 4653 Email: info@foundersclub.com Founders Club About Us Contact Us News Privacy Policy Refund Policy Shipping Policy Terms of Service © 2025 Founders Club . Designed by SW . Powered by Shopify . American Express Apple Pay Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa We use cookies on our website to give you the best shopping experience. By using this site, you agree to its use of cookies. I agree Join the Founders Club Community! At Founders Club, we celebrate golf as more than just a sport—it’s a passion, a way to connect, and a moment to enjoy life. Whether you’re a seasoned golfer or just getting started, we’re here to enhance your experience both on and off the course. Sign up below to stay in the loop with exclusive tips, personalized product updates, special offers, and news from our community! First Name Email * Sign Up"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "text": "ClubSpot Club Management - Contact Us top of page Home Solutions Custom Club App Membership Management Online Club Lotto Data Security Club Communications Group Messaging Club Events Ticketing Customer Stories Contact Contact - Support Contact - Sales Blog Pricing Meet The Team How To Setup Guide Admin Tutorials User Tutorials More... Use tab to navigate through the menu items. Get a Demo Login Need support? Get in touch! For the quickest response time for general customer support or ticketing queries, contact us via our  live chat button at the bottom right of the screen. You can also reach us using the support email and contact number below where a member of our team will get in touch with you as soon as possible. Live Chat via orange button in right corner below Quickest Response ​ ​ Email: support@clubspo t.app Mob: 087 032 2866 ​ CAVAN DIGITAL HUB, KILMORE BUSINESS PARK, DUBLIN RD. CAVAN Enjoying your experience with ClubSpot? We'd love to hear from you! Click here to leave us a review! Company Home About Us Contact Us Careers FAQs Privacy Policy GDPR Club Referrals Terms of Service Contact Email: info@clubspot.app Mob: 087 032 2866 Stradone, Cavan, H12 Y066 © ClubSpot 2022 All Rights Reserved bottom of page"
    }
  ]
}