{
  "fuentes": [
    {
      "url": "https://www.trailoffloridasindianheritage.org/fountain-of-youth/",
      "email": "connect@trailoffloridasindianheritage.org"
    },
    {
      "url": "https://fountainofyouthswfl.com/",
      "email": "customerservice@fountainofyouthswfl.com"
    },
    {
      "url": "https://historiccoastculture.com/organization/fountain-of-youth-archaeological-park/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/organization/fountain-of-youth-archaeological-park/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://fountainofyouthswfl.com/about-us/",
      "email": "customerservice@fountainofyouthswfl.com"
    }
  ],
  "mails": [
    "connect@trailoffloridasindianheritage.org",
    "customerservice@fountainofyouthswfl.com",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "fountainofyouthflorida.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.trailoffloridasindianheritage.org/fountain-of-youth/",
      "text": "Fountain of Youth Archaeological Park - Trail of Florida's Indian Heritage Skip to content Skip to content HOME EXPLORE MAPS NORTHWEST NORTHEAST CENTRAL SOUTHWEST SOUTHEAST MEMBERSHIP SPONSORS ABOUT FLORIDA ARCHAEOLOGY DONATE CONNECT WITH US Fountain of Youth Archaeological Park The Fountain of Youth Archaeological Park is a 15-acre, waterfront historical attraction, where visitors can learn about the first Spanish settlers who came here in the 1500s and the native Timucuans who were here to greet them. With a working archaeological dig on site, as well as several re-created Spanish and Timucuan buildings and dwellings, the park is bursting with history. Located in the area first explored by Juan Ponce de Leon in 1513 and settled by Pedro Menendez de Aviles in 1565, historic St. Augustine is the oldest successful European settlement in the United States. Colonial America started right HERE, 55 years before the Pilgrims landed on Plymouth Rock, and 42 years before Jamestown! LOCATION 11 Magnolia Ave, St. Augustine, FL 32084 VIEW MAP PHONE 904-829-3168 CALL NOW FACEBOOK LIKE PAGE INSTAGRAM FOLLOW LEARN MORE BROWSE HOURS 9am – 6pm Daily Last Ticket Sold at 5pm CHECK WEBSITE FOR ADMISSION RATES The Timucua of Seloy Ponce de Leon Names at La Florida Pedro Menendez de Aviles Origins of the Fountain of Youth Park Archaeology Solidifies a Legacy Starting at approximately 2,400B.C., Native Americans, known today as the Timucua, began to occupy the region that spreads from present-day Central Florida to Southwest Georgia. The Timucua were a loosely-knit confederation of tribes that shared a common language, but were not bound politically as a common people with a common governing body or headman. They would trade with one another, but also go to war against each other. In Timucuan villages, there were usually two kinds of houses. One type of home, referred to as a long house, was built using poles for the frame, bark for the walls, and branches from palmetto palm trees for the roof. The other type of home was round and covered with leaves of palm trees. The Timucua were known to have more permanent villages than the other tribes. Each family had their own home but the cooking took place in the village and meals were held daily in a central location. They wore clothing made from deerskin and woven cloth. The men wore their hair long with a topknot. Both men and women were said to have decorated their skin with elaborate geometric designs. Like other indigenous people encountered by the Spanish, they were considerably taller than the Europeans. Like other Native Americans, the people called Timucua were skilled hunters and fishermen. The men made tools for hunting and fishing; they used spears, clubs, bows and arrows, and blowguns, to kill their game. Game included bear, deer, wild turkey, and alligators. They smoked the meat over open fires, and women would clean and prepare the animal hides and use them for clothing. Timucua also caught fish, clams, and oysters. Farming was another important means of obtaining food for the Timucua. The main crops harvested were maize (corn), beans, squash, pumpkins, and melons. Women cooked the meals and gathered roots, nuts and wild berries to eat. While there are no official records, historians believe that Juan Ponce de Leon was born in 1460 in San Tervas de Campos, Spain. In 1493, de Leon sailed with Christopher Columbus on Columbus' second voyage to the Americas. On Hispaniola, Ponce became a military commander and was appointed deputy governor. In 1506, Ponce de León discovered a nearby island called Boriken by the native Taino people. While there, he found large deposits of gold. In 1508, on orders from the king of Spain, he further explored the island, and renamed it Puerto Rico. He was the island's governor for two years until the king replaced him with Columbus' son. Hurt by the King's action, Ponce de Leon sailed again, this time north through the Bahamas. He was in search of new lands and treasures, including a mythical fountain of youth. The Taino, spoke of a legendary, magical spring whose water was believed to make older people young again. De Leon explored many areas, including the Bahamas and Bimini, for both gold and the mythical fountain, but he never found either. While searching further north and west in spring of 1513, Ponce de Leon came ashore at a Timucua village tucked safely into a small harbor off the Atlantic Ocean. Believing the area to be an island, Ponce so named this beautiful “new land” La Florida because it was sighted during the Festival of Flowers at Easter time. The village of Seloy was centered on the land that later became the Fountain of Youth Archaeological Park and extended about one mile to the north and one mile to the west, up to the San Sebastian River. Pedro Menendez de Aviles was born in 1519. He became an officer in the Spanish navy, and in 1549, the king of Spain commissioned him to fight pirates. He did such an outstanding job that Philip II, who became king in 1556, granted him permission to start a colony in Florida to try to drive out the French. Before long, Menendez and over 2,000 sailors, soldiers, and their families set sail in 11 ships for La Florida. Menendez and his crew planned to sail up the St. Johns River to Fort Caroline, a French settlement, but Menendez discovered that French ships blocked the mouth of the river. He withdrew and sailed to the smaller harbor where Ponce de Leon had discovered. He set up a camp at Seloy, and with the help of the Timucua Indians, he and his men built a fort. On September 8, 1565, he officially named it St. Augustine. This became the first permanent settlement in the United States. He then claimed all of Florida for Spain. Menendez would remain at this site for nine months before growing hostilities between the Spaniards and the Timucua would lead him to move his fortifications across the river to what is now Anastasia Island. He was successful in signing a treaty with the Calusa Indians to trade gold for food and other supplies his troops needed. Menendez was a staunch Roman Catholic, and one of his goals was to convert Native Americans to the Catholic faith. He requested that all ships coming from Spain carry priests. These priests became missionaries, which led to the period of Spanish missions in Florida history. Menendez went back to Spain to collect more settlers, but died on September 17, 1574, before he could return to Florida. In 1868, Henry H. Williams purchased a large piece of land just outside of St. Augustine from Paul Arnau for $2,500 (2017 value of $41,533). Williams was familiar with the history of Ponce de Leon and experienced his first visitors that same year. A cross made of coquina, 15 stones long x 13 stones wide, was unearthed by B.A. Pacetti, an employee of H.H. Williams in 1874. Pacetti signed a legal deposition as to the circumstances under which he found the cross. Unfortunately, Williams was told that coquina was not available on the mainland in 1513, and had the cross re-buried. Mr. Williams sold the property to Luella Day MacConnell, who made her fortune in the gold fields of the Yukon in 1898. Mrs. MacConnell, who told everyone in St. Augustine that she had acquired the nickname Diamond Lil while in Alaska, aggressively marketed the property as the Fountain of Youth. In 1908, an employee of Mrs. MacConnell rediscovered the cross of coquina, as well as a silver casque containing severely worn documentation that has since been proven to be of a parchment and ink that was contemporary to the era of Ponce de Leon’s landing in Florida. With this event, Mrs. MacConnell begins a quest to verify the find and prove, once and for all, that she owned the site Ponce de Leon’s fabled Fountain of Youth. Louella Day MacConnell died in a car accident on June 23, 1927. On August 15th Walter B. Fraser purchased the Fountain of Youth properties from Edward McConnell for $100,000 (2017 value of $1,406,816). Much to the chagrin of the St. Augustine Historical Society and Scientific Institute, Mr. Fraser maintained the property as an attraction to educate the public about Juan Ponce de Leon and the Fountain of Youth. Mr. Fraser believed in the historical traditions of the property and sought to secure this site’s rightful place in American history. A few years after purchasing Ponce de Leon’s Fountain of Youth in 1927, Mr. Walter Fraser elected to plant some citrus trees in the southern part of the area. In 1934, a gardener was planting orange trees when he discovered a skeleton. The police were called, and it was quickly established that the remains were that of an aboriginal Native American. Further research by the Smithsonian Institution revealed that the entire area was covered with the graves of the first Christianized Native American burials in the United States. Some estimates place the number of burials at over 4,000. Over forty years later, the pattern of burials revealed the location of the 1587 Franciscan Mission of Nombre de Dios, the First Christian Mission in the United States. Over time, a large number of Timucua burials were exposed in the Park, and the “Indian Burial Ground” became a part of the memories of tens of thousands of Florida schoolchildren. Many people might have seen the image of the exposed burials on postcards and tourism promotional materials, but increasing sensitivity to the customs and cultures of Native Americans prompted the reinterment of the remains in 1991, together with a full solemn Catholic Mass. Archaeologists have been excavating at Ponce de Leon’s Fountain of Youth Archaeological Park for over 80 years, and in that time the discoveries have rewritten history textbooks time and time again. Since 1934, archaeologists have made a long list of major finds at the Park, and excavations continue to this day. Since the mid 1970s, the major contributor to the work is Dr. Kathleen Deagan, Distinguished Research Curator Emeritus, University of Florida Museum of Natural History, who generally digs at the Park in the spring months. Her major area of excavation is in the first Settlement of St. Augustine, located on the eastern end of the Park property. The Fountain of Youth offers a variety of shows and living history reenactments designed to entertain and educate visitors -- the Planetarium, the two-story Discovery Globe mapping the routes of the early explorers, the Timucuan Village, and the reconstructed First Mission of Nombre de Dios. TIMUCUAN VILLAGE ABOUT THE TIMUCUAN VILLAGE When Pedro Menendez de Aviles landed in the village of Seloy on September 8, 1565, he did so at a bustling town that was a tool and pottery making center of activity. The Timucua were governed by a Cacique (Chief) named Saturiwa, and were initially friendly to the Spanish. As the cultures existed side by side, difficulties arose, and European diseases took a horrible toll on the Timucua. These diseases and politically-motivated warfare over the succeeding decades spelled doom for this culture. The last known Timucua died in Cuba in the early 1700s. The Fountain of Youth park celebrates the culture of these proud Native Americans in a reconstructed portion of the town of Seloy. Living History Interpreters will help you to understand what day to day life was like in the village, how the Timucua hunted, fished, made fine pottery and shell tools, and how they finally slipped away into history. Timucua in this area used canoes to travel by water. It is thought that these canoes were fashioned using a method that included burning and scraping. Recently, FOYAP completed construction of a dugout canoe using these Timucuan methods. Fashioned from a single pine log, this canoe is now on display down at the waterfront by the Spanish Watchtower. In 2013, they completed construction of a historically-correct anoti, a large Timucuan family house, and a nihi paha, a special meeting house. Although the Timucua are gone, they are not forgotten. Come learn about the first denizens of the area and their culture, and be sure to ask about the 1,000 year-old domesticated dog burial discovered at the Park! NOMBRE DE DIOS MISSION CHURCH ABOUT THE MISSION CHURCH “…These first Christian Indians attended Mass in the town of St. Augustine until after 1587, when the first Franciscan mission doctrina was established at the Nombre de Dios, and was given the same name. Franciscan friar Antonio de Escobedo was assigned there, and helped build the first Nombre de Dios mission church. (FLORIDA MUSEUM OF NATURAL HISTORY) In 1587, Franciscan friars constructed the first mission in the continental United States right here on the grounds of the Fountain of Youth. The location of this Mission, however, was a mystery that revealed itself little by little. It began in 1934, when a gardener planting an orange tree discovered a skeleton, which proved to be a Timucuan. Over time, a large number of Timucua burials were exposed in the Park, and the pattern and position of their burials revealed the true location of the 1587 Mission of Nombre de Dios. To reconstruct the Mission, a new archaeologically appropriate site was chosen. The structure was built using historically correct methods wherever possible using local cypress, which was known to 16th century Spaniards to be durable and resistant to wood-eating insects. The Mission church features a choir loft and rustic altar, and uses a palm thatch roof. The floor is crushed coquina, as is the area around the church. Standing in the reconstructed church, you will smell the cypress beams and planking, palm thatch and salt air as you gaze at the beautiful open-beamed structure. Let yourself be transported back to the first days of Christianity in the United States. ATTRACTIONS OF THE PARK ABOUT THE PARK ATTRACTIONS The Spring House at Ponce de Leon’s Fountain of Youth Archaeological Park is a beautiful 60-year old coquina building that encompasses the original spring that was recorded in a seventeenth century Spanish land grant. With signed guest books stretching back to 1868, the Fountain of Youth is the oldest attraction in Florida, and the Spring House is the centerpiece of the historical Juan Ponce de Leon experience at the Park. The spring issues forth directly from the Floridan aquifer, which lies below ground under much of North Florida. The water contains over 30 minerals and the spring would have been the perfect replenishment site for Juan Ponce de Leon’s ships upon landing on Florida’s shores 500 years ago. Early Spanish and Portuguese explorers of the 1400’s and 1500s braved long stretches of the world's oceans and did so by using navigational tools of their time, such as the astrolabe and the quadrant. With these tools and the expertise of their navigators, these intrepid explorers knew their latitude to a surprisingly exact degree. In our Navigators’ Planetarium, we demonstrate these techniques in a fascinating hourly show, then turn the night sky back to the way it appeared on April 2, 1513, the night before Juan Ponce de Leon landed on the shores of La Florida. You will be transfixed. The Discovery Globe illustrates the routes of the explorers to and from the New World, shows the extent of the lands of La Florida, the new Universities that were established in the Americas, and the settlements and cities that they founded. The globe is 30 feet high and is extremely impressive, and features shows every hour. Spanning 600 feet, the Founders’ Observation Riverwalk gives beautiful views. Whether you stroll its length during the morning or the afternoon, the scenery is stunning. Ponce de Leon’s Fountain of Youth Park features 15 acres that overlook the Matanzas River and St. Augustine Inlet. Ponce de Leon’s Fountain of Youth Archaeological Park boasts a muster (or flock) of nearly 30 Indian peafowl. Their raucous calls echo from all areas of the Park, and their colorful displays are unforgettable. The blue peacock males spread their plumage in order to attract a mate and to warn off other males and the show is stunning – but it pales in comparison to the display of the white peacocks, which look like huge snowflakes! These Exotic peacocks wandering the beautiful grounds create a magical setting for weddings and private events. SPANISH COLONIAL INTERPRETATIONS ABOUT THE COLONIAL FEATURES With a fleet of seven ships and many soldiers, Menendez was an imposing presence, and the Timucuans offered him and his forces part of their village – thus establishing St. Augustine, the oldest continuous European settlement in the United States. 55 years before the Pilgrims landed at Plymouth Rock and 78 years before the founding of Jamestown, the town of St. Augustine became a keystone in Spain’s New World network of settlements. In fact, the first Thanksgiving in the United States took place at what is now our this park. A Blacksmith Exhibit, located on the South side of the Menendez Settlement field, offers guests a glimpse into St. Augustine’s past through accurate historical interpretation. The open-floorplan exhibit is fascinating in its layout and construction. The bellows are an oversized, horizontal double lung design which feeds a custom-made forge. This forced-air setup can generate blacksmithing temperatures in excess of 2,500 degrees. This fully functional blacksmith shop can produce Spanish Colonial style iron goods present in the area during the First Spanish Period (1565-1763) of Florida’s history. When St. Augustine was founded in September of 1565, the spyglass had yet to be invented, so only the sharpest-eyed men were hand-picked for watchtower duty. Standing like sentinels of the Northeast Florida coast, the Spanish watchtowers of St. Augustine helped sentries see farther to discover threats earlier. A recreation of such towers is available to visit and experience what life was like for the watchmen. A replica six-pounder Spanish cannon is used in hourly demonstrations about the history of their use in the settlement of St. Augustine. Additional weapons demonstrations include arquebus gun lectures and firing and period crossbow demonstrations. Since these period weapons require dry powder charges, the demonstrations are weather-dependent. The Spanish colonists of the fledgling settlement of St. Augustine needed reliable water transportation, and a chalupa was constructed to fulfill this need. Whether it was routine runs across the bay or short trips to investigate potential threats, this workhorse of the bays and rivers filled the bill nicely. In partnership with the St. Augustine Maritime Heritage Foundation, Fountain of Youth Park is rebuilding an historically-correct chalupa. Visitors can observe this process and learn more about colonial vessels at a working boat-building shop. page information credit: Fountain of Youth Archaeological Park, Visit St. Augustine, Florida Memory Project, Wikipedia, City of St. Augustine,  Florida Center for Instructional Technology photos from the sources listed above, as well as publicly posted online sites with thanks to the contributors HOME EXPLORE MAPS MEMBERSHIP SPONSORS ABOUT DONATE CONNECT WITH US Search for: Search ©Trail of Florida's Indian Heritage, Inc. | Site Design and Management by Runjik Productions This website receives hosting sponsorship from PRIVACY, COOKIES, and ACCESSIBILITY Powered by Nirvana & WordPress."
    },
    {
      "url": "https://fountainofyouthswfl.com/",
      "text": "Fountain of Youth | Wellness & Aesthetics Lounge Skip to main content Close Search Menu WELLNESS & AESTHETICS Vitamin IV Drips Anti-Aging Beauty Glutathione Hangover High Dose Vitamin C Immunity Luxury Myers Cocktail NAD+ Performance Wellness Vitamin Injections Peptides BioRePeel Injectables Luxury Facial Medical Aesthetics TeleHealth Rejuvenation and Healing Medical Weight Loss Microneedling Micronutrient Testing MEN’S HEALTH Men’s Health: TRT TRT: Pellet Therapy Erectile Dysfunction WOMEN’S HEALTH ABOUT US BUY GIFT CARDS BOOK YOUR SESSION facebook linkedin google-plus instagram Fountain of Youth Feel & Look Your Absolute Best. Fountain of Youth helps you maximize your physical potential, feel your best and will set you on the path for longevity and health. We are your personalized healthcare team that advises you every step of the way. B O O K A P P O I N T M E N T Buy Gift Cards Fountain of Youth Services & Products Only premium products – at your convenience. SCHEDULE A SESSION NOW IV Vitamin Therapy View the Full Product Category Vitamin Injections View the Full Product Category Injectables View the Full Product Category Medical Aesthetics View the Full Product Category Peptides View the Full Product Category Medical Weight Loss View the Full Product Category Men’s Health: TRT View the Full Product Category Erectile Dysfunction View the Full Product Category Pedro Oliva, Jr CEO & C0-Founder Pedro Oliva has served as a Firefighter/Paramedic since 2015, and as a Medical/Rescue Specialist for the local Urban Search and Rescue Task Force Team. As the CEO of Fountain of Youth, Pedro has a passion for health and wellness, and a heart of service. Read Pedro's Full Bio. Wellness Lose weight. Feel great. Aesthetics Pamper Yourself Men’s Health Aging doesn’t need to be this painful. Get your hormones tested. Learn More Here Women’s Health Energy for living starts with balanced hormones. So start here. Learn More Here Peptides: Your health & performance on the next level. Peptides can get you over your plateau to your best self. When you’re at your best, you out-perform everyone on the field. Aging is inevitable, but the effect it has on our bodies doesn’t have to be. We fuel winners at Fountain of Youth. Be one. IV DRIP THERAPIES Get Back on Top with IV Therapy We offer 11 uniquely customized IV infusions that deliver a wide range of nutritional benefits and target specific health and immune deficiencies, all administered by licensed and specially trained medical professionals. Anti-Aging Beauty Glutathione Hangover High Dose Vit C Immunity Luxury NAD+ Myers Cocktail Performance Wellness Fountain of Youth Offers Intensive Medical Weight Loss Programs Weight loss is a complex process that involves many different factors, including diet, exercise, and overall lifestyle habits. At Fountain of Youth, we offer comprehensive weight loss programs designed to help you achieve your goals and improve your overall health. Change Your Body Forever The Fountain of Knowledge Medical Weight Loss Mitochondrial Uncouplers for Fat Loss: Human Trials and What Comes Next Takeaways Controlled mitochondrial uncouplers like HU6 are in early human trials and show promise for reducing liver fat and body adiposity while preserving lean mass. Organ-targeted and prodrug delivery systems enhance safety by… Anti-Aging Kisspeptin-Based Hormonal Reset for Functional Hypothalamic Amenorrhea Takeaways Kisspeptin analogs like MVT‑602 restore reproductive signaling upstream of traditional therapies. These agents offer faster cycle restoration while minimizing risks of hyperstimulation or estrogen overload. Precision dosing and integrative wellness can improve… Medical Weight Loss How AI and Dual-Pathway Drugs Are Shaping Next-Gen Weight Loss Takeaways Dual‑pathway therapies deliver stronger, longer-lasting fat loss while preserving lean mass. AI‑guided dosing promises smarter personalization, improving adherence and real‑world outcomes. The oral and injectable co‑agonist amycretin marks a breakthrough in obesity… CHECK OUT OUR BLOG HERE It's time to become your best self. We are Southwest Florida's Leading Medical Spa. Vitamin IV Drips Beauty Fountain Glow Immunity Fountain Defense Hangover Fountain Remedy Specialty Fast Vitamin IV High Dose Vitamin C Glutathione IV Drip Wellness Fountain Myers Cocktail Fitness Fountain Peak Anti-Aging Support NAD+ Luxury The Fountain Vitamin Injections Beauty Glutathione Biotin Immunity Vitamin C Tri-Immune Boost Anti-Aging NAD+ Wellness Amino Blend Vitamin D3 Mineral Blend Energy B-12 B-Complex Medical Aesthetics Skin Care Products Gentle Cleanser Hydrating Cleanser Book A Therapy Here Exfoliating Polish Dual Action Scrub Complexion Renewal Pads Oil Controls Pads Acne Treatment Calming Toner Men’s Health Erectile Dysfunction Sildenafil Tadalafil Testosterone Replacement Therapy Free Testosterone Hormonal Testing Consultation Treatment Other Services Medical Weight Loss Men’s Clinic TRT/ED Treatment Micronutrient Testing Injectables (Coming Soon) Peptides Anti-Aging Strength Recovery Healing Immunity Adonis Goddess Beauty Be your best self, in your best health. Contact Us (239) 355-3294 customerservice@fountainofyouthswfl.com 13720 Cypress Terrace Circle, Suite 303 Fort Myers, FL 33907 [get directions] View our PRIVACY POLICY and DISCLAIMER . Hours Monday 7AM –5PM Tuesday 7AM –5PM Wednesday 7AM –5PM Thursday 7AM –5PM Friday 7AM –5PM Saturday 7AM –3PM Sunday Closed Connect Instagram Facebook LinkedIn Get Directions B o o k Y o u r S e s s i o n © 2025 Fountain of Youth. Site Design & Imagery by Damian Hanley Inc. A Fort Myers Video Production agency. facebook linkedin instagram Close Menu WELLNESS & AESTHETICS Vitamin IV Drips Anti-Aging Beauty Glutathione Hangover High Dose Vitamin C Immunity Luxury Myers Cocktail NAD+ Performance Wellness Vitamin Injections Peptides BioRePeel Injectables Luxury Facial Medical Aesthetics TeleHealth Rejuvenation and Healing Medical Weight Loss Microneedling Micronutrient Testing MEN’S HEALTH Men’s Health: TRT TRT: Pellet Therapy Erectile Dysfunction WOMEN’S HEALTH ABOUT US BUY GIFT CARDS BOOK YOUR SESSION facebook linkedin google-plus instagram phone"
    },
    {
      "url": "https://historiccoastculture.com/organization/fountain-of-youth-archaeological-park/",
      "text": "Fountain of Youth Archaeological Park - HistoricCoastCulture.com Fountain of Youth Archaeological Park - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 SEARCH Advanced Filters Home Organization Fountain of Youth Archaeological Park Facebook Twitter Linkedin Print Fountain of Youth Archaeological Park The Fountain of Youth Archaeological Park is a 15-acre waterfront historical attraction where visitors learn about the first Spanish settlers and the native Timucuans who greeted them. The park is bursting with history with a working archaeological dig and several re-created Spanish and Timucuan buildings. Enjoy the views over the water from the 600-foot Founders Riverwalk or from the Observation Tower. Sample the waters from the natural spring and let the kids feed the roaming peacocks. The Fountain of Youth offers a variety of shows and reenactments to entertain and educate visitors: the Planetarium, the two-story Discovery Globe mapping the routes of the early explorers, the Timucuan Village, and the reconstructed First Mission of Nombre de Dios. The Fountain of Youth Archeological Park is the site of the first Spanish settlement in the new world. Founded by Spanish explorer Pedro Menéndez de Avilés in 1565, this is the oldest continuously occupied European settlement in North America. Long before the Spanish came to La Florida, the Timucuan Indian village was established at this site for nearly 3,000 years. In 1513, Juan Ponce De Leon claimed Florida for the Spanish crown, though no colonies were successful here until Menéndez arrived in 1565. The large grounds of the Fountain of Youth attraction make a great space for family gatherings, weddings, or other special occasions. The beautiful waterfront location offers views of the bayfront and St. Augustine Inlet. With it ... view more » The Fountain of Youth Archaeological Park is a 15-acre waterfront historical attraction where visitors learn about the first Spanish settlers and the native Timucuans who greeted them. The park is bursting with history with a working archaeological dig and several re-created Spanish and Timucuan buildings. Enjoy the views over the water from the 600-foot Founders Riverwalk or from the Observation Tower. Sample the waters from the natural spring and let the kids feed the roaming peacocks. The Fountain of Youth offers a variety of shows and reenactments to entertain and educate visitors: the Planetarium, the two-story Discovery Globe mapping the routes of the early explorers, the Timucuan Village, and the reconstructed First Mission of Nombre de Dios. The Fountain of Youth Archeological Park is the site of the first Spanish settlement in the new world. Founded by Spanish explorer Pedro Menéndez de Avilés in 1565, this is the oldest continuously occupied European settlement in North America. Long before the Spanish came to La Florida, the Timucuan Indian village was established at this site for nearly 3,000 years. In 1513, Juan Ponce De Leon claimed Florida for the Spanish crown, though no colonies were successful here until Menéndez arrived in 1565. The large grounds of the Fountain of Youth attraction make a great space for family gatherings, weddings, or other special occasions. The beautiful waterfront location offers views of the bayfront and St. Augustine Inlet. With its deep sense of history and the natural beauty of the site, the Fountain of Youth is a magical place. There park is pet-friendly and has ample free parking. Ponce de Leon’s Fountain of Youth Archaeological Park is located just north of the Mission Nombre de Dios and just south of the Vilano Bridge View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Commercial Business ; Educational ; History/Heritage Contact information Email / Website / Facebook / Instagram / Primary address: 11 Magnolia Avenue, St. Augustine, FL 32084 904-806-3045 904-829-1529 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Featured Organizations EMMA Concert Association Presenting beautiful music in beautiful St. Augustine at the Lewis Auditorium at Flagler College! EMMA’s mission is to offer quality music and dance performances by national and international artists. They also aim to encourage interest in classical music and to provide opportunities for the youth of St. Johns County. EMMA accomplishes this by offering school concerts in local schools and funding requests from music teachers for instruments and equipment. Historic Florida Militia The Historic Florida Militia (HFM) is a non-profit umbrella organization supporting re-created historic interpretive units and representing a number of cultures and time periods. \"We are not street performers, we are educators. We are not parades, we are historic programs. This is not an exercise in free speech, this is an opportunity to educate. We are not promoting a political agenda, we are promoting the city's history through a practical and factual teaching method\". Crisp-Ellert Art Museum at Flagler College Built in honor of Dr. JoAnn Crisp-Ellert and her husband, Dr. Robert Ellert, the Crisp-Ellert Art Museum offers Flagler College students and the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. The Museum challenges students, the Flagler community and the public to cultivate individual creativity, critical reflection, historical consciousness and respect for the free exchange of ideas. In this spirit, the Museum also hosts public programs, including artist talks, readings, panel discussions and film series that provide a platform for vital interdisciplinary dialogue. DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://fountainofyouthswfl.com/about-us/",
      "text": "About Us | Fountain of Youth Skip to main content Close Search Menu WELLNESS & AESTHETICS Vitamin IV Drips Anti-Aging Beauty Glutathione Hangover High Dose Vitamin C Immunity Luxury Myers Cocktail NAD+ Performance Wellness Vitamin Injections Peptides BioRePeel Injectables Luxury Facial Medical Aesthetics TeleHealth Rejuvenation and Healing Medical Weight Loss Microneedling Micronutrient Testing MEN’S HEALTH Men’s Health: TRT TRT: Pellet Therapy Erectile Dysfunction WOMEN’S HEALTH ABOUT US BUY GIFT CARDS BOOK YOUR SESSION facebook linkedin google-plus instagram About Us About the Fountain of Youth Team Founder & CEO Pedro Oliva Jr. Pedro Oliva Jr. is a native of Miami, Florida but moved to sunny Southwest Florida when he was 13. Having spent half his life in Southwest Florida, he now considers this home. His experience includes working as a Firefighter/Paramedic since 2015. He holds the title of Medical and Rescue Specialist for the local Urban Search and Rescue Task Force Team, providing advanced skills in natural and man-made disasters. He is currently an EMS Coordinator and provides medical training to firefighter crews alongside quality assurance. Mr. Oliva Jr. has also earned a Bachelor’s Degree in Public Safety Administration. Pedro gained a passion for wellness after working several years as a Firefighter. Seeing coworkers and patients develop injuries, diseases, and disabilities, he thought to himself, “there must be a way to alleviate these issues and improve people’s health before it deteriorates.” After being introduced to regenerative and performance medicine, Pedro teamed up with Dr. Paul Tritel to create the Fountain of Youth! BOOK A THERAPY TODAY Physician Assistant Jeff St. Firmin Jeffrey is a native of Fort Lauderdale, Florida. He attended Florida Gulf Coast University and received his bachelor degree in Clinical Laboratory Science with a minor in Chemistry. Jeffrey wanted to purse further education and began his Physician Assistant (PA) program at Nova Southeastern University graduating in 2017. After graduation, he remained in the area with a focus in orthopedic surgery helping to complete joint arthroplasty, complicated fractures, and arthroscopic procedures. Jeffrey has always had a passion for acute care therefore he pursed a career in emergency medicine. He currently practices at LeeHealth. He has been in this specialty for the past four years. Jeffrey has a strong interest in men’s health, fitness/weight loss, aesthetics and wishes to make a positive impact in the community. BOOK A THERAPY TODAY Meet the Rest of Our Team These are the people that actually run things. They keep our clients comfortable, treated and have the bedside manner that every doctor wishes for. We love our staff and we’re convinced you’ll love them too. Jessica Gallant, RN Office Manager/IV Therapist Jessica is a Registered Nurse with Fountain Of Youth. She is originally from Miami, Florida. She loves spending time with her husband Chad and daughter Emma. As well as making new memories with her family. She has past experience as a Cardiac Nurse and she is very eager to meet all of the Fountain of Youth Clients. Maria Oliva, RN Medical Aesthetic Director/IV Therapist Maria Oliva is a Registered Nurse with Fountain Of Youth. She is originally from Miami, Florida. She loves spending time with her husband CEO/Founder Pedro and their two dogs Dakota and Denver. One of her favorite thing to do is going to new restaurants and trying their signature dishes. Her past experience includes 7 years with Lee Health as a Medical Assistant. Maria is very passionate about Beauty and Aesthetics and wants to help you look and feel your best! The Fountain of Knowledge Medical Weight Loss Mitochondrial Uncouplers for Fat Loss: Human Trials and What Comes Next Takeaways Controlled mitochondrial uncouplers like HU6 are in early human trials and show promise for reducing liver fat and body adiposity while preserving lean mass. Organ-targeted and prodrug delivery systems enhance safety by… Anti-Aging Kisspeptin-Based Hormonal Reset for Functional Hypothalamic Amenorrhea Takeaways Kisspeptin analogs like MVT‑602 restore reproductive signaling upstream of traditional therapies. These agents offer faster cycle restoration while minimizing risks of hyperstimulation or estrogen overload. Precision dosing and integrative wellness can improve… Medical Weight Loss How AI and Dual-Pathway Drugs Are Shaping Next-Gen Weight Loss Takeaways Dual‑pathway therapies deliver stronger, longer-lasting fat loss while preserving lean mass. AI‑guided dosing promises smarter personalization, improving adherence and real‑world outcomes. The oral and injectable co‑agonist amycretin marks a breakthrough in obesity… CHECK OUT OUR BLOG HERE It's time to become your best self. We are Southwest Florida's Leading Medical Spa. Vitamin IV Drips Beauty Fountain Glow Immunity Fountain Defense Hangover Fountain Remedy Specialty Fast Vitamin IV High Dose Vitamin C Glutathione IV Drip Wellness Fountain Myers Cocktail Fitness Fountain Peak Anti-Aging Support NAD+ Luxury The Fountain Vitamin Injections Beauty Glutathione Biotin Immunity Vitamin C Tri-Immune Boost Anti-Aging NAD+ Wellness Amino Blend Vitamin D3 Mineral Blend Energy B-12 B-Complex Medical Aesthetics Skin Care Products Gentle Cleanser Hydrating Cleanser Book A Therapy Here Exfoliating Polish Dual Action Scrub Complexion Renewal Pads Oil Controls Pads Acne Treatment Calming Toner Men’s Health Erectile Dysfunction Sildenafil Tadalafil Testosterone Replacement Therapy Free Testosterone Hormonal Testing Consultation Treatment Other Services Medical Weight Loss Men’s Clinic TRT/ED Treatment Micronutrient Testing Injectables (Coming Soon) Peptides Anti-Aging Strength Recovery Healing Immunity Adonis Goddess Beauty Be your best self, in your best health. Contact Us (239) 355-3294 customerservice@fountainofyouthswfl.com 13720 Cypress Terrace Circle, Suite 303 Fort Myers, FL 33907 [get directions] View our PRIVACY POLICY and DISCLAIMER . Hours Monday 7AM –5PM Tuesday 7AM –5PM Wednesday 7AM –5PM Thursday 7AM –5PM Friday 7AM –5PM Saturday 7AM –3PM Sunday Closed Connect Instagram Facebook LinkedIn Get Directions B o o k Y o u r S e s s i o n © 2025 Fountain of Youth. Site Design & Imagery by Damian Hanley Inc. A Fort Myers Video Production agency. facebook linkedin instagram Close Menu WELLNESS & AESTHETICS Vitamin IV Drips Anti-Aging Beauty Glutathione Hangover High Dose Vitamin C Immunity Luxury Myers Cocktail NAD+ Performance Wellness Vitamin Injections Peptides BioRePeel Injectables Luxury Facial Medical Aesthetics TeleHealth Rejuvenation and Healing Medical Weight Loss Microneedling Micronutrient Testing MEN’S HEALTH Men’s Health: TRT TRT: Pellet Therapy Erectile Dysfunction WOMEN’S HEALTH ABOUT US BUY GIFT CARDS BOOK YOUR SESSION facebook linkedin google-plus instagram phone"
    }
  ]
}