{
  "fuentes": [
    {
      "url": "https://naplesgolfguy.com/golf-communities/foxfire-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/foxfire-country-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.rentnaples.com/vacation-rentals/rental/FFFM4-103/",
      "email": "mary.babroff@premiersir.com"
    },
    {
      "url": "https://www.rentnaples.com/vacation-rentals/rental/FFFM4-103/",
      "email": "mary.babroff@premiersir.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/foxfire-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/foxfire-country-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.sfpgagolf.com/guided-by-mentorship-donald-sheas-journey-to-general-manager-at-foxfire-country-club",
      "email": "sflorida@pgahq.com"
    },
    {
      "url": "https://www.foxfirecc.com/About_Our_Club/Rental_Property_Members",
      "email": "kbrophywhit@aol.com"
    },
    {
      "url": "https://foxfirenation.com/about-us/meet-team-foxfire/",
      "email": "info@foxfirenation.com"
    }
  ],
  "mails": [
    "info@foxfirenation.com",
    "info@naplesgolfguy.com",
    "kbrophywhit@aol.com",
    "mary.babroff@premiersir.com",
    "matt@naplesgolfguy.com",
    "sflorida@pgahq.com"
  ],
  "nombre_sitio": "foxfirecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://naplesgolfguy.com/golf-communities/foxfire-country-club/",
      "text": "Foxfire Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Naples Golf Communities Foxfire Country Club Foxfire Country Club is a gated golf community in Naples, Florida.  Designed by Arthur Hills, there are 27 holes of golf on 385 acres. Further, this is a bundled golf community. As a result, a golf membership is included with your home purchase. Additionally, residents have access to a newly renovated clubhouse with casual and formal dining options. Also, there are multiple community pools, tennis courts, and bocce courts for members to enjoy. Finally, Foxfire is just ten minutes from the Gulf Beaches, seven minutes to downtown Naples, and within walking distance of three shopping centers. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Naples, Florida Club Type: Private Country Club Membership Type: Bundled Golf Community Real Estate Home Price Ranges Single Family: $600,000 – $1,150,000 View Homes for Sale Condos: $205,000 – $500,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Foxfire Country Club. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Golf Memberships 931 Golf Memberships Is a Golf Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Fees: Bundled Golf Dues: $7,920 Social Fee: N/A Social Dues: N/A In bundled golf communities, the Golf or Social membership is included with the purchase of your home. Additionally, there are annual recurring fees associated with the property, as well as one-time fees due at the time of purchase. Potential Fees Include: Master HOA Fee (Annual) Neighborhood HOA Fee (Annual) Food and Beverage Minimum (Annual) Assessments (Annual) Capital Contribution Fee (one-time) Transfer Fee (one-time) Application Fee (one-time) These fees vary by neighborhood within the community. Please feel free to contact us for additional information. Golf Course Information Opened 1985 Architect Arthur Hills Number of Courses 1.5 (27 Holes) Caddies Available No Practice Range Yes Own Your Own Cart Yes Course Ratings / Scorecards Blue/Red Course Par: 72 Holes: 18 Yards Rating Slope 1 6284 70.2 129 2 5899 68.3 126 2/3 5663 67.6 123 3 5421 66.7 119 Ladies Tees: 3 5421 71.5 131 4 5015 69.0 126 4/5 4704 67.5 120 5 4383 65.7 114 Red/Silver Course Par: 72 Holes: 18 Yards Rating Slope 1 6252 70.1 126 2 5847 68.0 122 2/3 5658 67.5 117 3 5457 66.7 113 Ladies Tees: 3 5457 71.5 129 4 4955 68.4 125 4/5 4628 66.8 118 5 4241 64.8 111 Silver/Blue Course Par: 72 Holes: 18 Yards Rating Slope 1 6202 69.9 129 2 5812 68.1 125 2/3 5559 67.3 121 3 5312 66.0 117 Ladies Tees: 3 5312 71.2 132 4 4824 68.0 128 4/5 4528 66.5 119 5 4232 64.7 113 Amenities Gated Community One Private Golf Course Driving Range Clubhouse Fitness Center Community Pool Tennis Courts Bocce Ball Courts Where is Foxfire Country Club Located Foxfire Country Club 1030 Kings Way Naples, FL 34104 239.643.3139 Visit Club Website Back to Naples Golf Communities Note: We make every effort to make sure our information for this Golf Club: Foxfire Country Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.rentnaples.com/vacation-rentals/rental/FFFM4-103/",
      "text": "Foxmoor in Foxfire CC | Naples, FL | Rent Naples Skip to main content My Rentals Recently Viewed (1) 800-749-7368 Rentals View All Rentals All Naples Rentals Search By Amenity Annual Rentals Beachfront Rentals Condos Monthly Rentals Pet Friendly Rentals Rentals with Pools Search by Bedrooms 1 Bedroom Rentals 2 Bedroom Rentals 3 Bedroom Rentals 4 Bedroom Rentals 5+ Bedroom Rentals Advanced Search Rental Information Property Rating System Area Info About/Contact Contact About Southwest Florida Rental Agents List My Property Testimonials Skip to Availability Calendar Media Overview Amenities Rates Reviews Request Info Save to My Rentals Remove from My Rentals Share Rental Search Results >\n            Property Detail Foxmoor in Foxfire CC - FFFM4-103 Bedrooms: 2 Bathrooms: 2 Sleeps: 4 View Slideshow Slideshow Map This property has been viewed 12 times in the last 3 days X Select your arrival date Select your departure date Reserve your stay Arrival Date Departure Date Rent ${{priceQuote.rent.toFixed(2)}} Discount -${{priceQuote.discount.toFixed(2)}} {{priceQuote.travelInsurance.name}} ${{priceQuote.travelInsurance.amount.toFixed(2)}} {{priceQuote.damageProtection.name}} ${{priceQuote.damageProtection.amount.toFixed(2)}} Total ${{priceQuote.bookingTotal.toFixed(2)}} Initial Payment Due ${{priceQuote.dueNow.toFixed(2)}} We are unable to obtain current pricing at this time. Please call {{contactPhone}} and one of our specialists will be happy to assist you. Please call our office at {{contactPhone}} to get a price quote or to book this property. {{priceQuote.errorMsg}} Please try selecting new dates or call {{contactPhone}} for special requests and one of our associates will be happy to assist you. Please try selecting new dates or call {{contactPhone}} for special requests and one of our associates will be happy to assist you. Change Dates Overview ↑↓ Not Available for 2026 Season. Golf amenity privileges with transfer membership (fee $400).  First floor unit in the gated community of Foxfire Country Club. This 2 bedroom, 2 bath well maintained unit features tile floors throughout, a king sized bed in the primary bedroom, 2 twin beds in the guest room, a dining area and spacious living room and kitchen. Enjoy the Southwest Florida sunsets on the screened lanai with its west exposure and view of the golf course. Foxfire Country Club is an Arthur Hills designed course featuring 27 holes of Championship Golf for all skill levels. Tenants can purchase a $600 Tenant Transfer Golf membership (fee plus green and cart fees) to access golf and country club amenity privileges There is also a social membership (no golf) available for $250. Foxfire's beautiful 20,000 square-foot, Mediterranean-styled Clubhouse features the main dining room with banquet and fine dining facilities; the Foxlair Grille and lounge with flat-screen televisions for sports viewing and a covered terrace dining area; and the halfway house for a quick breakfast, lunches, snacks, and beverages. The Clubhouse is the center of Foxfire social life. A wide variety of special events and performances, as well as recurring activities like trivia and karaoke provide endless entertainment. Many members participate in our various clubs, including bridge, book discussion group, mahjong and travel. There are so many things to do, that you will quickly become a part of the active social sense. Call or email Mary Babroff for more information on and to schedule a showing mary.babroff@premiersir.com or 239-262-4242. ***Information contained herein deemed reliable but not guaranteed*** Amenities ↑↓ Bldg. Complex Name : Foxmoor in Foxfire Type Unit : Lowrise Condo Unit Rating : Bronze Beach Access Type : Drive Distance to Beach : 15 miles Elevator : No Floor/Bldg Height : 1 of 3 Year Built : 1984 Approx. Sq. Ft. : 1135 Exposure/View : W/Golf Course Pool/Spa : Community Washer/Dryer : Yes Parking Type : Carport Lanai / Balcony : Lanai/Screened BBQ Grill : No Master Bedroom : King Bathrooms-Master : Shower Guest Bedroom : 2 Twins Bathrooms-Guest : Shower/Tub Combo Flooring : Tile TV/DVD/ STEREO : 3/0/0 Internet Access : Wifi Pet Friendly : No Listing Advisor : Mary Babroff Min.Rental # x perYr : 30x4 Security Deposit : $1500 Reservation Fee : $150 Damage Protection : $60 Amenity Transfer Fee : $250Social/$600 Golf Departure Clean Fee : $200 Taxes : 11% Utility Charges : $150 Cap Other : $50 Gate Card Rate - Monthly : $4,800/$2,400 Request Info Name * Email * Phone Message * Please contact me with information regarding Foxmoor in Foxfire CC. This field is hidden when viewing the form Agent Email Prices ↑↓ Starting Ending Daily Rate Weekly Rate Monthly Rate Min. # Nights 01/01/2026 03/31/2026 n/a n/a $4,850.00 0 *Excludes Taxes, Fees and Travel Insurance. Reviews ↑↓ Submit a Review for Foxmoor in Foxfire CC Rental Review Your Name * Enter your name as used on your reservation so we can validate your stay with us. This will NOT display on the website. Your Email * Please enter your email address in case we need to contact you. This will NOT display on the website. Public Information The fields below may be publicly displayed on our website. Display Name * Please enter your name as you wish it to appear on the website. Use initials if you wish privacy. Review Title * Enter a short phrase to describe your rental experience. Arrival Date * Enter the date you checked in for this rental. Select the month, day and year. Arrival Date * Month Month 1 2 3 4 5 6 7 8 9 10 11 12 Day Day 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Year Year 2026 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 Rating (1-5) * Select based on the # star rating you would give this property. 5 being the best. 5 4 3 2 1 Review * Leave your comments about this rental property. Phone This field is for validation purposes and should be left unchanged. Contact Us Premier Sotheby's Int'l Realty 800-749-7368 Owner Login Specialty Markets Naples Cay Rent Premier SIR Newsletter Signup Name * First Email * Name This field is for validation purposes and should be left unchanged. Rentals Availability Calendar Rentals with Pools Rental Condos Pet Friendly Rentals Rental Unit List Quick Links About Us Contact List My Property Area Info Guest Payment © Copyright 2025  Rent Naples Sotheby's International Realty is a registered trademark licensed to Sotheby’s International Realty Affiliates LLC. Each office is independently owned and operated. Equal Housing Opportunity. Website managed by RealTech Webmasters ← Close Menu Rentals View All Rentals All Naples Rentals Search By Amenity Annual Rentals Beachfront Rentals Condos Monthly Rentals Pet Friendly Rentals Rentals with Pools Search by Bedrooms 1 Bedroom Rentals 2 Bedroom Rentals 3 Bedroom Rentals 4 Bedroom Rentals 5+ Bedroom Rentals Advanced Search Rental Information Property Rating System Area Info About/Contact Contact About Southwest Florida Rental Agents List My Property Testimonials"
    },
    {
      "url": "https://www.naplesgolfguy.com/foxfire-country-club/",
      "text": "Foxfire Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Naples Golf Communities Foxfire Country Club Foxfire Country Club is a gated golf community in Naples, Florida.  Designed by Arthur Hills, there are 27 holes of golf on 385 acres. Further, this is a bundled golf community. As a result, a golf membership is included with your home purchase. Additionally, residents have access to a newly renovated clubhouse with casual and formal dining options. Also, there are multiple community pools, tennis courts, and bocce courts for members to enjoy. Finally, Foxfire is just ten minutes from the Gulf Beaches, seven minutes to downtown Naples, and within walking distance of three shopping centers. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Naples, Florida Club Type: Private Country Club Membership Type: Bundled Golf Community Real Estate Home Price Ranges Single Family: $600,000 – $1,150,000 View Homes for Sale Condos: $205,000 – $500,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Foxfire Country Club. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Golf Memberships 931 Golf Memberships Is a Golf Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Fees: Bundled Golf Dues: $7,920 Social Fee: N/A Social Dues: N/A In bundled golf communities, the Golf or Social membership is included with the purchase of your home. Additionally, there are annual recurring fees associated with the property, as well as one-time fees due at the time of purchase. Potential Fees Include: Master HOA Fee (Annual) Neighborhood HOA Fee (Annual) Food and Beverage Minimum (Annual) Assessments (Annual) Capital Contribution Fee (one-time) Transfer Fee (one-time) Application Fee (one-time) These fees vary by neighborhood within the community. Please feel free to contact us for additional information. Golf Course Information Opened 1985 Architect Arthur Hills Number of Courses 1.5 (27 Holes) Caddies Available No Practice Range Yes Own Your Own Cart Yes Course Ratings / Scorecards Blue/Red Course Par: 72 Holes: 18 Yards Rating Slope 1 6284 70.2 129 2 5899 68.3 126 2/3 5663 67.6 123 3 5421 66.7 119 Ladies Tees: 3 5421 71.5 131 4 5015 69.0 126 4/5 4704 67.5 120 5 4383 65.7 114 Red/Silver Course Par: 72 Holes: 18 Yards Rating Slope 1 6252 70.1 126 2 5847 68.0 122 2/3 5658 67.5 117 3 5457 66.7 113 Ladies Tees: 3 5457 71.5 129 4 4955 68.4 125 4/5 4628 66.8 118 5 4241 64.8 111 Silver/Blue Course Par: 72 Holes: 18 Yards Rating Slope 1 6202 69.9 129 2 5812 68.1 125 2/3 5559 67.3 121 3 5312 66.0 117 Ladies Tees: 3 5312 71.2 132 4 4824 68.0 128 4/5 4528 66.5 119 5 4232 64.7 113 Amenities Gated Community One Private Golf Course Driving Range Clubhouse Fitness Center Community Pool Tennis Courts Bocce Ball Courts Where is Foxfire Country Club Located Foxfire Country Club 1030 Kings Way Naples, FL 34104 239.643.3139 Visit Club Website Back to Naples Golf Communities Note: We make every effort to make sure our information for this Golf Club: Foxfire Country Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.sfpgagolf.com/guided-by-mentorship-donald-sheas-journey-to-general-manager-at-foxfire-country-club",
      "text": "Guided By Mentorship: Donald Shea’s Journey To General Manager at Foxfire Country Club ABOUT PGA MEMBERS TOURNAMENTS GOLFPASS FOUNDATION PARTNERS JUNIOR GOLF NEWS Contact DONATE VOLUNTEER SFPGA SHOP DONATE VOLUNTEER SFPGA SHOP ABOUT PGA MEMBERS TOURNAMENTS GOLFPASS FOUNDATION PARTNERS JUNIOR GOLF Guided By Mentorship: Donald Shea’s Journey To General Manager at Foxfire Country Club As a college student pursuing a bachelor's degree in education, Donald Shea, PGA, had his future all mapped out. With an affinity for teaching, Shea planned to use his education degree to teach school during the year in Florida and return to his hometown in Massachusetts to teach golf for the summer. Growing up in Billerica, Massachusetts, Shea, PGA General Manager at Foxfire Country Club, was always looking for work. At 16 years of age, his father worked at a private club outside of Boston as the caddie master. One night, Shea's father asked him if he would pick the range, and although Shea had little interest in golf at the time, he agreed. \"That's where my golf journey began, at the Weston Golf Club, and I just fell in love with the game,\" explained Shea. \"I tell people all the time, I went to pick the range one night and ended up picking it for the next five years.\" At Weston, Shea was introduced to and worked for Tony Morosco, PGA, a 2001 PGA of America Hall of Fame inductee and highly celebrated New England PGA Professional. Morosco mentored the young Shea and brought him on the bag for several National Senior events. \"I could see what drove Tony as far as his playing and teaching abilities. He was just someone I looked up to because he was such a good player and teacher,\" said Shea. As his golf bug grew, Shea met Barrie Bruce, PGA, who operated the Golf School at The Country Club of Billerica. While in college, Shea began working in the golf shop at Weston during the day, and gave lessons and ran junior clinics at Billerica in the evenings. At this point, Shea was hooked and entered the PGA Associate Program, or what was then called the GPTP program, in 1997. \"I was 25 years old, and I knew I was going to pursue being a PGA Professional,\" said Shea. \"It kind of clicked that this was my desire to get my Class-A and move through the programs.\" In 1998, Shea joined the team at Foxfire as an associate, working under another highly celebrated PGA Professional, Jim Kurtzeborn, Past President of the Section and a 2023 South Florida PGA Hall of Fame inductee. \"Jim was definitely my greatest mentor of all,\" emphasized Shea. \"He taught me all the little things and inspired me to be the very best I could be in many different ways.\" Shea served as Kurtzeborn's first assistant for three years before Kurtzeborn eventually accepted another role, leaving a vacancy in the head professional position. Unbeknownst to Shea, Kurtzeborn, who had been with Foxfire for 13 years, recommended him to the board to become the next head professional, a move that springboarded his professional career. \"Jim had notified the board one Friday afternoon that he was going to resign as the director of golf at Foxfire,\" explained Shea. \"Three days later, the board met and voted me unanimously as the next head golf professional.\" While the move was great for Shea's career, it did come with uncertainty. Shea was still an associate with no head professional experience, but Kurtzeborn's unwavering confidence was all Shea needed. \"He (Jim) said to the board, I'm not worried about whether or not all of you can do my job; I'm worried about who's going to do his job,\" recalled Shea. \"To have that sense of someone's confidence unsolicited and to have someone you admire so much behind you meant the world.\" After only two years as head professional, Shea, who had become a full Class-A Member, was promoted to director of golf, assuming full golf responsibilities, just as his mentor Kurtzeborn did. \"It was a member who recommended to the board that they change my title and role to director of golf,\" explained Shea. \"That, of course, inspired me to stay.\" In only eight years, Shea had moved from a first assistant role as an associate to a Class-A PGA director of golf, all at the same facility. With nearly 15 years of experience working at Foxfire, Shea was approached by the board in 2011, asking about his interest in becoming the next general manager. Content with his position as director of golf, Shea was not interested. Less than a year later, the board again approached Shea, and they were very keen on him becoming the general manager. \"It wasn't something that I was looking to do again as a career move,\" explained Shea. \"I felt like, hey, you can sit on the sidelines and not take it, or you can step in there and take on the challenge, and that's what I ended up doing.\" Similar to his time taking over as head professional, the new general manager position did come with some uncertainty, but Shea was prepared for the challenge. \"It's an incredible learning curve, and I think it is something that most head pros, directors of golf, or other department heads will underestimate,\" said Shea. \"The way you have to look at things and change your perspective and understand there's so many different perspectives and points of view.\" In 2013, Shea took over as general manager and still serves in this role, bringing his time with Foxfire to over 27 years, an accomplishment Shea and Foxfire are very proud of. \"I was given an opportunity to put my fingerprint on something, and something big, which has certainly been a motivator for me,\" emphasized Shea. \"I've always wanted this club to be the best it could be for the members and the entire staff. That's how I approach my work every single day. When I come to work at Foxfire, I come to work for every single member and their families, and every single employee and their families.\" < Older Post Newer Post > Share this story Jim McLean, PGA & Dennis Walters Announced as 2025 PGA of America Hall of Fame Inductees September 8, 2025 The PGA of America announced today that Jim McLean, PGA of Jim McLean Golf Schools, and Dennis Walters, Honorary PGA of America Member, will be inducted into the 2025 PGA of America Hall of Fame Class.                                                                                                                         Jim McLean is one of the most influential PGA of America Golf Professionals in the world, recognized globally for his teaching excellence.                                                                                                                                     In 1991, he founded the Jim McLean Golf School at Doral, which has grown into an internationally respected academy with locations across the U.S., Spain, Mexico, and South Korea, and is currently headquartered at the historic Biltmore Hotel in Coral Gables, Fla.                                                                                                                                     His schools have produced 420 certified teaching professionals, with over 250 serving as Directors of Golf or Instruction. McLean, a PGA Master Professional, has taught thousands of golfers, including over 100 PGA, LPGA, and Champions Tour professionals, including Cristie Kerr, Keegan Bradley, Tom Kite, Peter Jacobsen, Lexi Thompson, Gary Woodland, and Bernhard Langer.                                                                                                                                     McLean has written 15 golf books, a business book and contributed to Golf Digest, Golf Magazine, Golf Illustrated and Met Golfer. He has been a featured presenter at 12 PGA Teaching & Coaching Summits, spoke at three European Summits and has presented all over the world.                                                                                                                                     He served 15 years on the National PGA Teaching and Education Committees. McLean’s contributions have been recognized at every level.                                                                                                                                     In the Metropolitan Section, where he spent 19 years, he was named Teacher of the Year (1986), received the Professional Development Award (1987) and was inducted into the Met PGA Hall of Fame (2012).                                                                                                                                     In the South Florida Section, he won Teacher of the Year twice (1996, ‘98), earned the Youth Player Development (2000) and Professional Development Awards (2001) and was inducted into the South Florida PGA Hall of Fame (2020).                                                                                                                                     Nationally, he was named PGA of America Teacher of the Year (1994) and received the PGA Professional Development Award (2020).                                                                                                                        As a player, McLean qualified for the U.S. Junior, U.S. Amateur, U.S. Open, and U.S. Senior Open, and made the cut in the Masters. Earlier in his career, he was Director of Golf at Sunningdale, Quaker Ridge, Sleepy Hollow, Tamarisk, and Doral. Both of his sons, Matt (Wake Forest) and Jon (Oklahoma State), played college golf.                                                                                                                         Born in Neptune Township, New Jersey, World Golf Hall of Fame Member Dennis Walters fell in love with the game early and became one of the state’s top junior golfers.                                                                                                                                     He finished 11th in the 1971 U.S. Amateur and after playing collegiate golf at North Texas State University, aimed for the PGA TOUR, reaching the finals of Q-School.                                                                                                                                     His plans changed dramatically after a golf cart accident in 1974 left the 24-year-old paralyzed from the waist down. Showcasing the dedication and devotion that has marked his life ever since, Walters turned tragedy into inspiration and found a way to continue playing the game he loves at a high level while inspiring others to do the same.                                                                                                                                     In 1975, he began playing from a custom-made swivel seat on his golf cart, beginning a career of inspiring all golfers, especially those with disabilities, and leading to the recognition of a new category: Adaptive golf. Walters won the inaugural USGA Adaptive Open in the seated division in 2022. Two years later, he won the Florida Adaptive Open in the seated division shooting 74, one shot lower than his age.                                                                                                                                     Since 1977, he has staged the world-famous one-hour trick-shot clinic, the “Dennis Walters Golf Show,” more than 3,000 times, traveling over 3.5 million miles and always accompanied by his co-star rescue dog.                                                                                                                        Walters was inducted into the World Golf Hall of Fame in 2019; New Jersey Golf Hall of Fame ( 2019); received the USGA Bob Jones Award (2018); Neptune High School Hall of Fame (2016); South Florida PGA Section Hall of Fame (2010); PGA of America Distinguished Service Award (2008); University of North Texas Hall of Fame (2000); joined the likes of U.S. Presidents Dwight Eisenhower and Gerald Ford as a PGA of America Honorary Member (1992); and received the Ben Hogan Award (1978).                                                                                                                         The PGA of America Hall of Fame originated in 1940 at the suggestion of famed sportswriter Grantland Rice. It is the highest honor the PGA of America can bestow upon its membership or ambassadors of the game. For a full list of PGA of America Hall of Fame members,                                              click here                                  .                                                                                                            “The PGA of America is honored to recognize our 2025 Hall of Fame Class and celebrate the incredible impact they have had throughout their careers, inspiring thousands both on and off the course,” said PGA of America President and Master Professional Don Rea Jr., PGA Owner/Operator of Augusta Ranch Golf Club (Arizona). “Whether they have won Major Championships, given thousands of lessons or captivated audiences with trick shots, each PGA Hall of Fame Member has played an essential role in shaping the game of golf as we know it today.”                                                                                                            The 2025 PGA of America Hall of Fame Inductees fall under four induction categories: PGA of America Past President Category (Richerson); PGA of America Golf Professional Category (Glanton, McLean, Turner); Tour Player Professional Category (Lopez); and PGA of America Ambassador Category (Walters). Brant Peaper Wins South Florida Assistant PGA Professional Championship August 29, 2025 Naples, FL                                   - Brant Peaper carded rounds of 67-69–136 to win the South Florida Assistant PGA Professional Championship by one shot held at Bear’s Paw Country Club, August 28-29.                                                                                                            With a staggered leaderboard following round one, Peaper, an Associate Assistant Professional at Lost Tree Club, trailed Ryan Crowley by three, who matched the Bear’s Paw course record with an 8-under 64 during the opening round.                                                                                                            For the second consecutive year, Peaper entered the final round in the lead group. While being 2-under on the day through 6, Peaper’s tee shot found a bunker on the par-5, 7th hole.                                                                                                            “I hit what I thought was a really good drive, which leaked into the bunker. Then I took off a little more than I could chew and hit it right into the lip,” explained Peaper on what led to a double-bogey on the 7th hole.                                                      Undeterred, Peaper parred the 8th and 9th holes to finish even on the front-9 and 5-under overall, still within two shots of the lead.                                                      “There is still a lot of golf to be played,\" Peaper told himself. “It doesn’t really matter, you just have to try to hit really good shots and see what happens.”                                                                                                            Heading into the back nine, Peaper did not drop a single shot, playing the final 9 holes at 3-under, including a birdie on the 17th that ultimately secured the one-shot victory over Taylor Morgan, PGA of Pine Tree Club, and Michael Kartrude, PGA of The Bear’s Club. South Florida PGA Foundation Dedicates 12th Habitat for Humanity Home in Labelle August 29, 2025 Labelle, FL (August 29, 2025)                                               - The South Florida PGA Foundation dedicated its 12th Habitat for Humanity home to new homeowners Jesus and Paola. This build was made possible through a partnership with Habitat for Humanity of Lee and Hendry Counties.                                                                              In 2023, the thought of home ownership was merely a glimmer of hope for Jesus and Paola. With a desire to provide a safe home for their young family, faced with many challenges along the way, today's dedication was filled with joyful tears and much excitement as they received the keys to their first home, thanks to the support of the South Florida PGA Foundation and all of the members who supported the project.                                                                  Bearing gifts upon their arrival, Jesus and Paola were so grateful and appreciative of all the support they received on the journey to homeownership, from their family and friends to the volunteers, Habitat for Humanity staff, and beyond.                                                                  “We have a home for our kids to grow,” said Paola. “We are very happy and excited to receive this home.” Unlocking Opportunities: PGA Members excelling as General Managers - Brian Bartolec, Ken Kosak & Rob Oosterhuis By Matt De Tullio • August 26, 2025 PGA of America Golf Professionals are coined as experts in the game and business of golf, whose mission is to grow the game we all love.                                                                                                            At more than 30,000 strong, the PGA of America offers an extensive network of professionals to lean on, ask questions, seek advice, and collaborate with. Opportunities to network can come at the Chapter, Section, and National levels, all designed to elevate the PGA Professional.                                                                                                            As golf department heads, PGA Professionals play an integral role in facilities, and PGA Professionals in high management roles are becoming increasingly more prevalent.                                                                                                            Outside of being PGA General Managers, one thing stands out for Brian Bartolec of Shadow Wood Country Club, Ken Kosak of Broken Sound Club, and Rob Oosterhuis of Royal Palm Yacht & Country Club – they are all involved with the Club Management Association of America (CMAA) and all three sit on the CMAA Florida Chapter Board of Directors. Mark Mielke Claims South Florida Senior PGA Professional Championship August 20, 2025 Jupiter, FL                                               - Mark Mielke, PGA, fires consecutive under-par rounds to narrowly win the South Florida Senior PGA Professional Championship, played August 19-20 at The Bear’s Club.                                                                               ﻿                                                                  In addition to being crowned the 2025 Senior Section Champion, Mielke, a Teaching Professional at High Ridge Country Club, and the other nine top-finishers advanced to the Senior PGA Professional Championship, which will be held October 23-26 at PGA Golf Club. Mark Brown and Mark Mielke Win Third Consecutive Senior Pro-Pro August 8, 2025 North Palm Beach, FL                                               - Mark Brown, PGA and Mark Mielke, PGA  fired a 10-under 61 to win their third consecutive Senior Pro-Pro Championship today at North Palm Beach Country Club.                                                                              This year’s event welcomed 42 two-person teams of senior PGA Professionals playing in a four-ball format.                                                                  Brown, a PGA Teaching Professional at the Yacht and Country Club, and Mielke, a PGA Teaching Professional at High Ridge Country Club, first teamed up in the 2023 Senior Pro-Pro when Brown joined the Section. Since then, the pair have not lost a Senior Pro-Pro Championship at North Palm Beach Country Club, including a 12-under 59 last year for a total of 32-under in the last three years.                                                                  Starting on hole number 12, the duo started slower than years past, playing the first seven holes at 2-under. Once they turned to the front-nine, Brown and Mielke played the next 11 holes at 7-under to secure the win by one over Daniel Heaslip, PGA, and David Witt, PGA, at 9-under.                                                                  Finishing in a tie for third at 8-under were the teams of Jerry Tucker, PGA, and Joe Kern, PGA, and the team of Paul Scaletta, PGA, and Tim Turpin, PGA. Rounding out the top-5 were four teams at 6-under: Paul Crespo, PGA, Derek Niszczak, PGA, Colin Amaral, PGA, Jared Isaacs, PGA, Justin Hicks, PGA, Matt Ball, PGA, Michael Kostelnik, PGA, and Alan Morin, PGA.                                                                  The 2025 Senior Pro-Pro was supported and hosted by North Palm Beach Country Club. Thank you to PGA Director of Golf, Allan Bowman and his entire staff for hosting.                                                                  The Senior Section season will culminate on August 19-20 at the Bear’s Club for the Senior Section Championship.                                                                                        Leaderboard Ty Patterson Wins Bushnell Stroke Play Championship - Evan Bowser, PGA Qualifies for Corales Puntacana Championship August 5, 2025 Palm Beach Gardens, FL                                  - Ty Patterson played the final two holes at 3-under to win the Bushnell Stroke Play Championship, played August 4-5 at Old Palm Golf Club and BallenIsles Country Club. Alan Morin, PGA, claims the Senior Division title with a 7-under performance.                                                                  The South Florida PGA Bushnell Stroke Play Championship is the third of four SFPGA Majors to be played throughout the 2025 season. In addition to the major, the 36-hole event also served as a qualifier for the 2026 Corales Puntacana Championship on the PGA TOUR, in which Evan Bowser earned the spot as the low Class-A Professional.                                                                  After a 6-under 66 in the opening round at BallenIsles North Course, which included only 25 putts, Patterson, an Associate Assistant Professional at the Golf Club of the Everglades, trailed by one. With his final round at Old Palm, Patterson opened with a bogey before finishing his first nine holes at 2-over.                                                                  With Evan Bowser, PGA of LaPlaya Golf Club, holding a two-shot lead on the back nine, Patterson checked the leaderboard and knew he needed to make a charge.                                                                  “I looked at it (leaderboard) on 15 and that's when I knew I needed to make some birdies,\" Patterson said. “I looked at it on 17, and Evan was 8-under, so I was two back.”                                                                  Patterson proceeded to make an eagle on the par-5 17th and a birdie on the par-4 18th to claim the outright title by one in only his third SFPGA Major since joining the Section in 2024.                                                                  “I'm still taking it in and processing,\" Patterson said following the win. “I'm going to play in every tournament now.”                                                                  While finishing runner-up to Patterson by one, Bowser, a PGA Assistant Professional at LaPlaya Golf Club, secured low Class-A Professional honors, earning him entry into the Corales Puntacana Championship on the PGA TOUR.                                                                  “It is super exciting,” exclaimed Bowser, who was unsure he would even be able to play in the event. “I was flying back from a trip in Michigan, and my flight got cancelled, so I didn’t get here until 2:30 AM Monday.”                                                                  Bowser is no stranger to competing at the highest level, as he competed in the 2024 PGA Championship with his sister on the bag and family cheering him on, and looks to have the same support at the 2026 Corales.                                                                  “I am sure she will be there for me, and it should be a family affair for sure, it will be a lot of fun,” Bowser said as he just returned from a family trip in his hometown in Michigan.                                                                  In the Senior Division, Alan Morin, PGA Assistant Professional at The Club at Ibis, managed a two-day total of 7-under to win the Senior title by one over Justin Hicks, PGA, Paul Scaletta, PGA, and Brett Melton, PGA.                                                                  Over the 36-hole event, Morin managed two clean scorecards, as the only player in the field to go bogey-free.                                                                  Morin added his second win of the year after winning the South Florida Senior Open in May.                                                                  The 2025 Bushnell Stroke Play Championship, supported by DR Golf Sales, Melin, Oakley, and Nexbelt, was hosted at Old Palm Golf Club and BallenIsles Country Club.                                                                  Old Palm is led by PGA Director of Golf, Ryan Flinn, and PGA Assistant Professional, Joey Medora, while BallenIsles is led by PGA Director of Golf Jeff Fitzherbert, PGA Head Professional Chris Hayes, and five PGA Assistant Professionals.                                                                                     Leaderboard Christine Meier: Staying Connected to the Game She Loves By Tami Tolley • July 25, 2025 In the five years after graduating from Michigan State University, Christian Meier, PGA, took her Toyota Prius from 10,000 to over 300,000 miles, competing all across the country on the Symetra Tour (now Epson Tour).                                                                                                            A four-year starter for the Spartans, where she competed in 42 career events, won three Big 10 Conference titles, and boasted the 10th lowest scoring average in school history, Meier was set on making it to the highest level of women's golf.                                                                                                            Growing up in Rochester Hills, Michigan, Meier loved competing, and having an older sister who also played golf made that competitive drive even deeper. The two were talented junior golfers, often competing head-to-head as the only girls in junior events back home.                                                                                                            While Christine headed to Michigan State and her sister, Amy, to conference competitor Ohio State, the Meier sisters were carving their own paths. The summer following her sophomore year, Christine qualified for the U.S. Women's Open, becoming the first Spartan to qualify for the Major Championship while still in school. A year later, Amy qualified as well.                                                                                                            With both sisters having standout college careers, they hit the road together, traveling across the country, searching for their breakout opportunity. Christine's came in her second-to-last year on tour, but it was vastly different from what she initially envisioned.                                                                                                            While having an extensive break on her schedule, Christine came across a high school coaching position in Memphis, Tennessee. Not ready to give up on her playing aspirations, Christine saw this as an opportunity to do something different and get her mind off the grueling stretch of competitive golf.                                                                                                            \"The woman who hired me was Mary Murphy, a PGA Professional who teaches in Memphis and Olive Branch, Mississippi,\" explained Christine. \"She talked about the PGA Program a little bit, and I kind of brushed it off initially, not in a negative way, I was just still in the mindset of, I'm going to play, I'm a player.\"                                                                                                            The experience turned out to be extremely beneficial for Christine, who began falling in love with coaching—so much so that she came back the following season to coach for another 10 weeks.                                                                                                            This time, Christine was introduced to Jennifer Hudson, the PGA Director of Instruction at Sankaty Head Golf Club in Texas.                                                                                                            \"I saw what she did, she helped me with my game a little bit, and it started to look like a life I would enjoy,\" Christine recalled. \"It keeps you around the game, you learn a ton, and you get to meet a lot of other people. That may have nudged me in that direction more than I already was.\"                                                                                                            Throughout this entire time of playing professionally and coaching, Christine maintained a seasonal position inside the golf shop at The Club at Mediterra while working up north for a few seasons.                                                                                                            Following her second stint coaching, when Christine returned to Mediterra for the winter season, PGA Director of Golf Kevin Swan again encouraged her to enter the program.                                                                                                            Because of her time competing on tour and experience working at different facilities, Christine had the necessary knowledge to knock out the program.. Between the encouragement from Swan and others, Christine was all in on the PGA of America, becoming a Class-A Member in 2023.                                                                                                            While proud and happy with her new life in golf, Christine is not afraid to admit that the transition from playing full-time to now working in golf was incredibly daunting.                                                                                                            \"Golf was such a huge part of my identity that it was really difficult to wrestle with the potential of that not being the case anymore, not being able to be around the game, not playing a ton anymore,\" Christine explained. \"I really struggled with that idea.\"                                                                                                                         A few years into her full-time position with Mediterra, Christine is just as involved with the game as she ever was, only now in a different setting.                                                                                                                        \"It has been a perfect fit because I can still be around the game, which was so important to me,\" emphasized Christine. \"I never really want to lose that or the playing or teaching piece of it.\" Justin Hicks, PGA & Robbie Wight 3Peat at Pro-Scratch Championship July 24, 2025 Naples, FL                                               - For the third consecutive year, Justin Hicks, PGA, and Robbie Wight claim the Pro-Scratch Championship, presented by Srixon | Cleveland, played July 22-23 at Talis Park Golf Club and Grey Oaks Country Club.                                                                              Hicks and Wight first teamed up in the 2022 Pro-Scratch Championship, where they finished in the top-25. Since then, the duo has won three straight, making them the first pair to win three consecutive titles in the event's 45-year history.                                                                  Finishing at 19-under, 62-63–125, Hicks and Wight outlasted the teams of Michael Kartrude, PGA of The Bear’s Club, with amateur partner, Justin Grondahl, and the team of Brant Peaper of  Lost Tree Club and amateur partner, Mackenzie Edwards, by one.                                                                  With rain falling throughout the front nine of the final round for Hicks and Wight, they managed a 3-under performance, which saw them trail by two going into the final nine holes. As the rain subsided, Hicks and White caught fire, playing the final six holes at 5-under, including an eagle on the par-5 13th hole from Hicks.                                                                  “We get a sandwich at the turn and somehow go gangbusters on the back, which was a lot of fun, \" said Hicks. “We managed to really ham and egg it well on the back nine and saw ourselves go from chasing to the ones being chased.”                                                                  Finishing in fourth was the Bowser team of Evan Bowser, PGA of LaPlaya Golf Club, and sister Elayna Bowser, who finished at 17-under. Rounding out the top-5 were the teams of Kenny Leech, PGA of Don Law Academy @ Osprey Point, with Elijah Zamarron, and the team of Kyle Horvath, PGA of Quail Creek Country Club, and partner, Victor Prokop, at 15-under.                                                                  This year’s Pro-Scratch Championship was held at Grey Oaks Country Club and Talis Park Golf Club. Grey Oaks Country Club is led by PGA Directors of Golf, Martin DeAngelo and Leslye Dyke, PGA Head Professional of Golf Professional Avery Radunz. Talis Park Golf Club is led by PGA Director of Golf, David Witt, and Associate Head Professional, Cory Briney.                                                                  Srixon and Cleveland were the presenting partners, while Airshare, Ghost Golf, Kohler Wisconsin, The Back Nine Golf, Florida Window and Door, and Unknown Golf were the supporting partners.                                                                  Leaderboard Cahill and Chang Win Yamaha Pro-Pro Championship at 21-under July 9, 2025 Naples, FL                                               - Seminole Golf Club Professionals, Matt Cahill and Dakun Chang, win the Yamaha Pro-Pro Championship, presented by Callaway, July 8-9 at The Rookery at Marco and Hammock Bay Golf Club.                                                                              Head Professional, Cahill, and Assistant Professional, Chang completed the wire-to-wire victory with a 21-under performance, adding their third team championship together but first Pro-Pro victory.                                                                  This year’s Championship returned to The Rookery at Marco and Hammock Bay, serving as the host facilities for the fourth time in the last five years. A full field of 240 South Florida PGA Professionals and Associates competed in a team four-ball format over the 36-hole event.                                                                  After an 11-under opening round, Cahill and Chang held a one-shot lead over Andrew Filbert, PGA of West Bay Club, and Justin Smith, PGA of Bonita Bay Club. Leaving no room for question, the duo of Cahill and Chang opened the final round with five straight birdies to expand their lead.                                                                  The two again managed five straight birdies on the back nine on holes 12-16 to ultimately finish at 21-under and three shots ahead of Filbert and Smith.                                                                  In third place came the Peaper duo of Brian and Brant, who wrapped the event at 17-under. Finishing in a tie for fourth at 16-under were the teams of Greg Martin and Michael Kartrude, Ashley Grier and Alan Morin, and Mark Mielke and Mark Brown.                                                                  The 2025 Yamaha Pro-Pro Championship was presented by Callaway and supported by Dunning/Greg Norman, Global Golf Sales, Heritage Creations, Hole In One USA, JumboMax Grips, and Toptracer.                                                                  The Rookery at Marco is led by PGA Director of Golf, Scott Lien, PGA Head Professional, Phillip Ott and PGA Assistant Professionals, Tony Kelley and Nicholas Fairneny. Hammock Bay is led by PGA General Manager, Anthony Schmid and PGA Assistant Professionals, Raymond Miron and Brandon Rowcliffe.                                                                  Leaderboard 1 (current) 2 3 ... 64 GET IN TOUCH PHONE (561) 729-0544 ADDRESS 7201 Georgia Ave. West Palm Beach, FL 33405 HOURS OF OPERATION 8:30 AM - 4:30 PM ET QUICK LINKS ABOUT PGA MEMBERS TOURNAMENTS GOLFPASS FOUNDATION PARTNERS NEWS Contact PGA MEMBER LOGIN CONNECT Powered by Long Drive Agency ⛳️ Powered by Long Drive Agency ⛳️ Powered by Long Drive Agency ⛳️ Share by:"
    },
    {
      "url": "https://www.foxfirecc.com/About_Our_Club/Rental_Property_Members",
      "text": "Rental Property - Foxfire Country Club - Naples, FL Skip to content FOXFIRE GOLF & COUNTRY CLUB Member Login Logout Home Golf Dining & Catering Golf Course Tours Pro Shop Reciprocals Employment Opportunities About Our Club Contact Us & Directions Fee Schedule History Meet Club Management Membership & Community Rental Property Page content Rental Property The Foxfire Community Association oversees the transfers of member privileges to renters, but does not handle the rental of properties in the community.  All rentals are handled by the owners themselves or by real-estate or rental agencies.  A Transfer Form must be completed by the owner and the renter, and most rental agents have the necessary information to complete this process. Our rental list will help you find the right size property. TRANSFER FORM 2024/2025 INSTRUCTIONS FOR FILLING OUT TRANSFER FORM 2021/22 MASTERPLAN VIDEO RENTAL LIST FOXFIRE LANE CONDOS ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 1051 Foxfire Lane #201 2nd Floor. Seasonal. Newly remodeled 2/1 available May1,25 through the Fall 25. Pools, golf, bocce, terrific gym, restaurants and bars. Perfect getaway. Condo 2/1 Martin Flood 978-473-9884 [email protected] 03/31/2025 1001 Foxfire Lane #304 3rd Floor. Seasonal. Condo 2/2 Kerry Mulvey 215-285-8151 [email protected] 06/23/2025 1075 Foxfire Lane #309 3rd Floor. Annual. Annual Rental Available August 8th 2025, Offered Turnkey Furnished, Social Membership Only. https://patriciadovichi.myrealtyonegroup.com/rental/swf/225063802/1075-foxfire-ln-309-naples-fl-34104 Condo 2/2 Patty Dovichi - Realtor 239-293-9403 [email protected] 07/18/2025 FOXGLEN DRIVE (VILLAS) ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 152 FOXGLEN DRIVE 1st Floor. Seasonal. First Floor. Beautiful seasonal rental. 2 bedroom with new queen beds and sofa sleeper. View of fountain and blue course. Available February, March and April 2026. Villa 2/2 Suzanne Juhl-Pulver 914-474-1429 [email protected] 07/01/2025 FOX GLEN DRIVE (CONDOS) ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 220 Fox Glen Drive Seasonal. 1st Floor. 2 bedrooms. 2 bathrooms. Professionally decorated and updated in 2024. Screened in lanai facing hole #3 on the blue course. Covered parking spot. Pool and hot tub steps away, social or golf membership transfer. Available August - October 2025 & May -  October 2026 Condo 2/2 Susie L'Heureux 313-815-5621 [email protected] 03/12/2025 219 Fox Glen Drive #1106 1st Floor. Seasonal. Freshly renovated with all new flooring, furniture, kitchen appliances, beds, large smart TV, etc. Private lanai with walk-out overlooks golf course. Condo 2/2 Catherine Bonneau 203-506-2783 [email protected] 228 Fox Glen Drive #3202 2nd Floor. Seasonal. Condo 2/2 Scott Jiras 609-306-1991 [email protected] 06/04/2025 FOX HOLLOW DRIVE ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 5417 Fox Hollow Drive 1st Floor. Seasonal. New bathrooms, new kitchen, enclosed papered patio, enclosed lanai, overlooking Red 1 tee box. Condo 2/2 Kathleen Whitman 810-516-1546 [email protected] 11/27/2024 5366 Fox Hollow Drive 1st Floor. Seasonal. A complete remodel was completed recently. Front lanai and patio, grill, and enclosed rear lanai and garage. Not available for FEB/MAR/APR 2026. Available for any other months. Veranda 2/2 Bob Sacco 617-448-4612 [email protected] 03/31/2025 5250 Fox Hollow Drive #508 1st Floor. Annual. Recent total renovation, EVERYTHING is new! Completely turnkey. Hurricane windows and screened lanai with hurricane shutters. Beautifully decorated. Annual lease with social membership transfer only. No smoking, no pets. Condo 2/2 Susan Swanson 239-207-1175 [email protected] 04/25/2025 5321 Fox Hollow Dr. 1st Floor. Seasonal. Walking distance to clubhouse and pool right across from driveway. Veranda 3/2 Sarah Zepeda 203-644-8544 [email protected] 07/29/2025 FOXHAVEN DRIVE (CONDOS) ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE POSTED 420 Fox Haven Drive #3107 1st Floor. Seasonal. Tennis courts, pickleball courts, grill, pool and Master golf Condo 2/2 Realtor - Breanna Reinike 708-704-1121 [email protected] 02/17/2025 400 Fox Haven Drive #4304 3rd Floor. Seasonal. 3-6 Months. April 30 - October 31, 2025 NEWLY RENOVATED with best VIEWS (water and golf) in Foxfire. Condo 2/2 Stan Yagiello 201-400-1351 [email protected] 03/17/2025 420 Fox Haven Drive #3208 2nd Floor. Seasonal. Nicely furnished, all new appliances. Fully stocked kitchen. Available December 2025 and 2026. Condo 2/2 Ann Murray 773-504-9758 [email protected] 04/07/2025 469 Fox Haven Drive #1204 2nd Floor. Seasonal. 27 hole golf course Country club Pool Pickle ball Lanai overlooking golf course Condo 2/2 + Den Alice Miller 239-961-3393 [email protected] 06/17/2025 420 Fox Haven Drive #3303 3rd Floor. Seasonal. Very nice unit with outstanding views. Cathedral ceilings which gives it a spacious feeling, nicely furnished Condo 2/2 Frank Smith 508-942-2221 [email protected] 07/18/2025 400 Fox Haven Drive 3rd Floor. Seasonal Totally renovated, end unit with high ceilings, larger than the other 2-bedroom units because it is an end unit. would consider annual rental. Condo 2/2 Britt Merritt 908-227-8133 [email protected] 08/06/2025 FOXTAIL COURT (VERANDAS) ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 214 Foxtail Court First Floor Seasonal Beautiful view overlooking Blue4 and lake with fountain. Unit has new: baths, AC, carpeting in bedrooms, grill, and painting throughout. Golf cart available for transportation within community. Garage. Tastefully decorated. Seasonal rental Veranda 2/2 Michael Hintz (732)-513-2454 [email protected] 09/24/2024 616 Foxtail Court 2nd Floor. Off-Season, Short-term rental available MAY - DEC 30TH, 2025 Beautifully Updated 2nd floor Veranda overlooking Blue 4. Veranda 2/2 Realtor: Patty Dovichi 239-293-9403 [email protected] 09/27/2024 210 Foxtail Court 2nd Floor. Seasonal. This spacious unit has beautiful views of Blue 4 with newer baths, kitchen, AC & windows. There is no better way to relax after golf then relaxing on the enclosed lanai and watching the players approach on Blue. We are flexible on dates of rental. Veranda 2/2 Deb & Paul Ryan 781-632-9747 [email protected] 03/07/2025 120 Foxtail Ct. 2nd Floor. Seasonal FULLY RENTED JAN-APR 2026 AVAILABLE FOR 2027 SEASON Veranda 2/2 Jeffery Gallas 414-460-8252 [email protected] 06/23/2025 610 Foxtail Ct. 2nd Floor. Seasonal. Beautifully renovated, cathedral ceilings, 24 x 24 diagonal travertine floor, cherry cabinets, master bath floor to ceiling marble with cherry wall hung vanities, great view, etc. Veranda 2/2 Frank Smith 508-942-2221 [email protected] 07/18/2025 206 Foxtail Ct. 2nd Floor. Annual. 2nd floor with amazing views of Blue 4. Renovated throughout. 1 car detached garage. Available for April 2026. Will consider annual rental. Veranda 2/2 Karen Keevers 978-460-0313 [email protected] 07/28/2025 KINGS WAY (VILLAS) ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 466 Kings Way 1st Floor. Seasonal. Upgraded Villa with 2 car garage, golf cart, patio off the lanai on the 6th hole, new mattresses, pillows and linen in each bdrm, TV in all rooms, newly painted throughout, upgraded and modernized, new frig 2023, washer/dryer 2023 and AC 2022. Available November 15 -30 and all Dec. 2025 Villa 2/2 Jack Leary 603-321-3649 [email protected] 05/19/2025 SINGLE FAMILY HOMES ADDRESS TYPE CONTACT PHONE NUMBER EMAIL DATE LISTED 1239 Foxtrot Court 1st Floor. Seasonal. Very quiet cul de sac, large private garden, private pool area with outside dining & bar area with BBQ, 2 sitting rooms, dining area. House 3/3 Dorothy Laird 239-643-5180 [email protected] 05/27/2025 360 Fox Den Circle 1st Floor. Seasonal. January Only at MLS#: 225061454 SHORT-TERM RENTAL AVAILABLE JAN only 2026. Step into a bright, open, and beautifully designed retreat, where every detail enhances both comfort and style. This 2-bedroom, 2-bathroom home, complete with a versatile den, unfolds to a peaceful pond view. www.PattyDovichi.Realtor House 2/2 + Den Patty Dovichi-Realtor 239-293-9403 [email protected] 07/07/2025 997 Kings Way Seasonal Single family home available located directly across from the Clubhouse and adjacent to Club pool. Enjoy all the amenities of Foxfire Club without ever moving your car. Walk across the street to tennis, golf, fitness, bocce, the pool and dining/bar. Primary Bedroom has king bed. Both secondary bedrooms feature two twin beds. Screened in porch for outdoor dining. Seasonal Rental - Available for one Tenant from Saturday January 11th through Saturday March 28th. House 3/2 Nicole Ruppert Keelty 410-746-2989 [email protected] 08/11/2025 Address: 1030 Kings Way   Naples, FL 34104 P: (239) 643–3139 F: (239) 643–6282 E: [email protected] © 2025  Foxfire Country Club. All Rights Reserved. Powered by clubsystems group"
    },
    {
      "url": "https://foxfirenation.com/about-us/meet-team-foxfire/",
      "text": "MEET TEAM FOXFIRE – Foxfire Realty Skip to content MAIN NAVIGATION MENU Home About Us Meet Team Foxfire Our Family History Marketing Flipbook Contact us Just Arrived Our Properties All Properties Live Water Historic Estates Homes and Cabins Country Estates Land & Farms Commercial Properties Homesites Timberland Investment Recreational & Hunting Land Natural Resources Auctions Video Gallery Recent Sales Resource Management Timber Management Wildlife Management Client Comments News Foxfire Real Estate Market Report – March, 2018 SALES TOP ONE BILLION DOLLARS Foxfire Magazine Links Historic Lewisburg Webcam MAIN NAVIGATION MENU × Home About Us Meet Team Foxfire Our Family History Marketing Flipbook Contact us Just Arrived Our Properties All Properties Live Water Historic Estates Homes and Cabins Country Estates Land & Farms Commercial Properties Homesites Timberland Investment Recreational & Hunting Land Natural Resources Auctions Video Gallery Recent Sales Resource Management Timber Management Wildlife Management Client Comments News Foxfire Real Estate Market Report – March, 2018 SALES TOP ONE BILLION DOLLARS Foxfire Magazine Links Historic Lewisburg Webcam Home About Us Meet Team Foxfire Our Family History Marketing Flipbook Contact us Just Arrived Our Properties All Properties Live Water Historic Estates Homes and Cabins Country Estates Land & Farms Commercial Properties Homesites Timberland Investment Recreational & Hunting Land Natural Resources Auctions Video Gallery Recent Sales Resource Management Timber Management Wildlife Management Client Comments News Foxfire Real Estate Market Report – March, 2018 SALES TOP ONE BILLION DOLLARS Foxfire Magazine Links Historic Lewisburg Webcam Meet Team Foxfire Since 1949 our family has provided owners and the prospective owners of quality real estate with exceptional brokerage, auctioneering, and forest-management services. From the outset we've cultivated long-term relationships built on personal service and expert counsel and have grown by building a team of experts, each of whom possesses specialized knowledge. While you may work with only two or three team members, many more will be engaged in the process on our end, and we invite you to familiarize yourself with each in our team members section. Richard Grist – Founder Richard is the founder and CEO of Foxfire Realty as well as Grist, Inc. He graduated in 1979 from West Virginia University with a BS degree in Forest Resource Management. Richard holds Brokers licenses in West Virginia and Virginia and is a registered forester and licensed auctioneer. Today, Richard continues a 40+ year career working full time as a real estate broker and professional forester. Richard, and his wife Mary, have been married for over 45 years and have two children and 2 grandchildren.\n\nA native of West Virginia, Richard grew up immersed in the land management and forest products industry. Starting in 1949, Richard’s father worked 50 years as a professional forester and land manager in WV.  Richard’s two brothers and brother-in-law are professional foresters as well. Richard has been the project forester for the Boy Scouts of America’s 12,000-acre High Adventure facility in WV since 2009. Teresa Bostic Teresa Bostic is the transaction coordinator and manager of business operations for Foxfire. With more than 20 years prior experience as a paralegal and law-firm office manager, she is uniquely qualified to help facilitate the transaction process. She was graduated from Bluefield State College with a degree in business administration. Randy S. Burdette Broker, auctioneer, and personal-property appraiser, Randy Burdette has for more than a quarter century been a state and national leader in the profession of auctioneering and is past director of the National Auctioneers Association. He was the founder of Riverbend USA Auction Company and has joined the Foxfire Realty team as a principal auctioneer and real estate agent.\n\nHe is a graduate of the Certified Auctioneers Institute and the Certified American Guild of Appraisers and is a certified estate specialist in West Virginia. He has served as president and vice-president of the W.Va. Auctioneers Association and was elected to its hall of fame. He is a State Fair of West Virginia “Grand Champion Auctioneer.” Joseph “Buck” Williams, III Born and raised in Pennsylvania, Joseph \"Buck\" Williams' career in the timber industry spans 3 states and 60 years.  President and CEO of award winning timber harvesting company, Jayfor Logging, Buck currently works with Foxfire Realty as both sales associate and right-hand man.\n\nA recipient of local, state, and national career awards, Buck has testified before Senate panels regarding OSHA safety requirements, served on university committees for coordination of multiple State agencies pertaining to conservation issues and was a leader in the charge to establish Logging Safety Field Days in Pennsylvania.  He has been active in National, Regional and several State foresty organizations, serving on boards of directors as in officer.  He also holds a West Virginia real estate salesperson license.  Buck has also developed successful housing subdivisions in both Pennsylvania and WV. David Sibray Historian and long-time promoter of West Virginia, David Sibray has joined forces with Foxfire as a realtor, public relations advisor, and consultant in matters of historic real estate. He is the owner of Sibray Public Relations, a member of the W.Va. Press Association, and publisher of West Virginia Explorer. He is a member of boards of the Preservation Alliance of West Virginia and of the Friends of the New River Gorge National River and sits on the advisory board for the National Coal Heritage Area. A former chairman of local landmarks commissions, he often acts as a consultant in matters of government influence on historic real estate. Matt Hall Born and raised in the southeastern West Virginia area, Matt Hall has been in land title protection and management since his graduation from Glenville State College. A native of White Sulphur Springs, Matt has called Rainelle home for many years, devoting a long career with the forestland department of MeadWestvaco Corporation in Rupert.  Being a licensed West Virginia Professional Land Surveyor and a licensed Forest Technician, Matt has diversified experience in land title protection and research; property boundary management; timberland taxation, sales, and acquisitions; easement management, facility maintenance and security, and personnel safety management.  He was also the recipient of the H. H. Jefferson Safety award, covering a 9-state region, for significant contribution to logging safety. Bill Zimmerman Bill Zimmerman is Foxfire Realty's #1 land man with decades of experience.  Bill has been a licensed real estate agent for many years and is a licensed auctioneer in West Virginia and Virginia.  Bill grew up in Greenbrier County, and began his career in the construction trade soon after graduating from Greenbrier East High School.  He has owned and operated Zimmerman General Construction for more than 30 years.  Bill is also a farmer.  He raises cattle, keeps bees for honey, and maintains a Sugar Shack for the production of maple syrup.  He also has experience with logging and is a broker and miller of vintage reclaimed lumber.\n\nBill has volunteered his time and construction expertise in building churches in Appalachia, as well as schools and churches abroad in Africa and Cuba, and is active in disaster relief efforts in West Virginia and other states.  Bill and his wife, Anita, reside on their farm in Organ Cave, West Virginia.  Bill and Anita have been married for 45 years, and have two daughters, Jessica and Kimberly, and five grandchildren. Jamie Smith Jamie was born and raised in the scenic mountains of Richwood, West Virginia and has continued to be a resident of Nicholas County throughout his lifetime.  A graduate of Glenville State College with an Associate Degree in Science in Forest Technology, Jamie put his skills to great use as timberland and property manager for private investment companies over his 25-plus year career.  During that time, Jamie was involved in the acquisitions and sales of over 150,000 acres of timberland and recreational properties.  Now, as a licensed West Virginia Real Estate Salesperson/Realtor, Jamie has joined Team Foxfire and with him, brings vast experiences in timberland and property management (including sales and acquisitions), title and easement knowledge, property boundary maintenance and Geographic Information System (GIS) Mapping. Kristi Scott Kristi Scott has been a real estate salesperson with Foxfire Realty since 2019.  She is a lifelong resident of Hinton, West Virginia.  Being a Summers County native, she knows the area well.  After graduating from WVU in 1988, Kristi was able to come back home, marry a hometown boy - Jack Scott, and raise a family of 2 children in a safe, clean and beautiful town.  Kristi is also a physical therapist at the local hospital and has had the wonderful opportunity to meet so many wonderful people in the surrounding area.  Kristi loves Summers County and loves living there.  She is always excited to welcome new buyers to our area and helping sellers make the selling process easier and successful for them.\n\nIn her spare time, Kristi takes full advantage of the outdoor activities available in our area.  Kristi's motto has always been “Live Here, Work Here, Play Here!” Butch Robertson Joseph “Butch” Robertson joins the Foxfire group after a career as a Greenbrier County educator. Robertson brings experience to the group after working as an engineer, chemist and mathematics instructor. He was a charter member of the staff that started the Greenbrier Community College that is now a branch of Bluefield State.\n\nRecently he has been working in the area of property management of private homes at the Greenbrier Resort in White Sulphur Springs. For a few years in the 1980’s Robertson operated a construction company building private homes in Western Greenbrier County.\n\nRobertson has a network of friends throughout West Virginia that he formed as he served on Governor Manchin’s technology committee, an instructor of teachers for the West Virginia Center for Professional Development, and several years as secretary of the West Virginia Coaches Association. Pamela “Sam” Withrow Pamela “Sam” Withrow, owner of Camera One Photography, ensures that imagery disseminated by Foxfire is of the highest quality. She has been an instructor at the Woodland School of Photography, from which she graduated in 1976 before becoming a photographer for Club Photos and Yellowbird Photo Service, providers of photography for The Greenbrier. Her ability to match digital enhancement with traditional photography sets Foxfire apart. Jason Gore Jason Gore pilots our remote-controlled aircraft, ChopperFoxfire, ensuring that clients and customers benefit from up-to-date visual technology.  He is a member of the Academy of Model Aeronautics and president of Pence Springs Prop-Twisters, a remote-control-aircraft club. He is also production manager at one of southern state’s largest printing companies. Paul Grist, Grist Real Estate Associates – Strategic Partner Broker and Realtor Paul Grist is president of Grist Real Estate Associates, Inc. He holds bachelor’s degrees in political science and environmental policy from Virginia Tech and is a 2006 graduate of West Virginia University’s real estate institute at Parkersburg. He was graduated from the Nashville Auction School in 2006, from the Professional Ringman’s Institute in 2007, and from the Certified Auctioneers Institute in 2010. Also in 2010, he was recognized by The State Journal as among the most influential West Virginians younger than 40. He was honored as the region’s top-selling agent in 2010, 2012, 2013, and 2014. Dedicated to community service from an early age, he was awarded the rank of Eagle Scout in 2000. He has served as president of both the Lewisburg Rotary Club and the United Way of the Greenbrier Valley. Rob Thomas, Magic’s Computer Service – Strategic Partner Robert (Rob) Thomas was born and raised in Midway, Kentucky, near Lexington, the horse capital of the world. Rob worked on the most prestigious horse farms with legendary horse racing history; notably the Gainsborough Farm for the King of Dubai assisting with taking mares to breed the triple- crown winner, Secretariat , and other derby winners.\n\nRob has a deep understanding of computer mechanics, and during the infancy of the computer age, he began his 25 year career developing a vast knowledge of networking, repair and computer construction.  Today, Rob owns “Magic’s Computer Repair”. Clear Creek Forest Management – Strategic Partner Scott Reigel, O wner of Clear Creek Forest Management, LLC, is a native West Virginian and second generation forester, and a 1999 graduate of WVU with a BS in Forest Resources Management and Wood Industries.  He has worked in the forest products industry as a inventory manager for Kopper's Industries railroad tie treating facility dealing directly with the operations main client CSX.  Scott then moved into the sawmill and log procurement sector  buying, scaling and reselling sawlog and export veneer logs.  In 2002, Scott helped to establish Clear Creek Forestry, LLC.,  a partnership dedicated to multiple use forest management.\n\nIn 2009 Scott founded Clear Creek Forest Management, LLC and which has flourished based on  strong client satisfaction.  Scott's company  serves clientele throughout  the Eastern regions of the US working in Appalachian hardwoods and south eastern pine plantations.\n\nHe is also an instructor of forestry at the college level and has a true understanding and passion for forest resource management. You can visit Scott's website at www.callccfm.com . STAY CONNECTED SEARCH WEBSITE ©2025 Foxfire Realty · info@foxfirenation.com · www.foxfirenation.com 304.645.7674 (Office) · 304.645.7698 (Fax) · 888.645.4454 (Nationwide) Richard Grist, Broker 1029 Washington Street East · Lewisburg, WV 24901 Scroll To Top"
    }
  ]
}