{
  "fuentes": [
    {
      "url": "https://www.foxslounge.com/",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://www.foxslounge.com/happenings/daily-happy-hour",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://therealdeal.com/miami/2016/12/08/rene-dahdah-sells-foxs-lounge-in-south-miami-for-7-5m/",
      "email": "news@therealdeal.com"
    },
    {
      "url": "https://therealdeal.com/miami/2016/12/08/rene-dahdah-sells-foxs-lounge-in-south-miami-for-7-5m/",
      "email": "trd@therealdeal.com"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "email": "foxaroundtheworld@foxnews.com"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "email": "hannity@foxnews.com"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "email": "irena.briganti@foxnews.com"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "email": "tips@tcnetwork.com"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "email": "watters@fox.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "lva@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "edia@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.comphone"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "victoria.gurrieri@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowcc@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowcomments@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowcomments@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowstreamissues@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowtips@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "livenowwebteam@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003evictoria.gurrieri@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003elivenowcc@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003elivenowcomments@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003elivenowstreamissues@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003elivenowtips@fox.com"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "email": "u003elivenowwebteam@fox.com"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "email": "dal@dalectronics.com"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "email": "eurocustomerservices@foxint.com"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "email": "info@foxint.com"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "email": "sales@foxint.com"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "email": "workshop@tacklebox.co.uk"
    },
    {
      "url": "https://www.foxslounge.com/gallery",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://www.foxslounge.com/happenings/martini-mondays",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://www.foxslounge.com/happenings/weekend-djs",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://www.foxslounge.com/private-events",
      "email": "foxs@wearealllost.com"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "ahutchinson@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "amcdaniel@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "bdepies@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "ctrebatoski@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "froddy@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "info@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "lschultz@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "mtenhaken@foxcities.org"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "email": "pseidl@foxcities.org"
    },
    {
      "url": "https://fox-news.pissedconsumer.com/customer-service.html",
      "email": "ldepartment@foxnews.com"
    },
    {
      "url": "https://www.foxslounge.com/happenings",
      "email": "foxs@wearealllost.com"
    }
  ],
  "mails": [
    "ahutchinson@foxcities.org",
    "amcdaniel@foxcities.org",
    "bdepies@foxcities.org",
    "ctrebatoski@foxcities.org",
    "dal@dalectronics.com",
    "edia@groominglounge.com",
    "eurocustomerservices@foxint.com",
    "foxaroundtheworld@foxnews.com",
    "foxs@wearealllost.com",
    "froddy@foxcities.org",
    "hannity@foxnews.com",
    "info@foxcities.org",
    "info@foxint.com",
    "info@groominglounge.com",
    "info@groominglounge.comphone",
    "irena.briganti@foxnews.com",
    "ldepartment@foxnews.com",
    "livenowcc@fox.com",
    "livenowcomments@fox.com",
    "livenowstreamissues@fox.com",
    "livenowtips@fox.com",
    "livenowwebteam@fox.com",
    "lschultz@foxcities.org",
    "lva@groominglounge.com",
    "mtenhaken@foxcities.org",
    "news@therealdeal.com",
    "pseidl@foxcities.org",
    "sales@foxint.com",
    "tips@tcnetwork.com",
    "trd@therealdeal.com",
    "u003elivenowcc@fox.com",
    "u003elivenowcomments@fox.com",
    "u003elivenowstreamissues@fox.com",
    "u003elivenowtips@fox.com",
    "u003elivenowwebteam@fox.com",
    "u003evictoria.gurrieri@fox.com",
    "victoria.gurrieri@fox.com",
    "watters@fox.com",
    "workshop@tacklebox.co.uk"
  ],
  "nombre_sitio": "foxslounge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.foxslounge.com/",
      "text": "Fox's Lounge | South Miami Restaurant & Bar | South Miami's Neighborhood Bar Since 1946 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Serving South Miami since 1946 Your neighborhood staple for great food & stiff drinks. Specials every day, drop by and say hi . FULL RESTAURANT & BAR * FULL RESTAURANT & BAR * FULL RESTAURANT & BAR * Post up with us Happenings Happy Hour Every Day, 4:00 pm - 6:00 pm Read More → Martini Mondays Every Monday, 8:00 pm - Close Read More → Margarita Martes (Tuesday) Every Tuesday, 8 pm - Close Read More → Wing It Wednesday Every Wednesday, 4 pm - 11 pm. Read More → Weekend DJs Fridays and Saturdays Read More → We’ve been here a while. Dig in to our storied past. Learn More The Buzz Oscar T. Great service, great food, and strong drinks, in a cool vibe environment. Daniela D. The ambiance was perfect for a dinner date--warm, intimate, and inviting. Sonia A. Cozy little spot to meet up for a quick girls night out, friend meet up or date! Albert B. The overall experience is a casual, comfortable, and nostalgic atmosphere to chill and catch up with friends over drinks. Howard F. Hard to believe, been going there since the fifties. Come on back. Carla W. Classic joint. Glad to have experienced the original. Cheers to recreating a historic favorite. Matthew B. Fox's is the definition of your neighborhood dive bar. All the stories you hear about 80's Miami comes to life in this place and you feel welcomed in the windowless lounge. Geraldine D. Super cool retro bar that perfectly blends old-school vibes with a modern touch. Visit Us 6030 S. Dixie Highway South Miami, FL 33143 (305) 703-6553 * * * * * * Hours of Operation Sunday - Monday: 4pm - 12am Tuesday - Saturday: 4pm - 2am Kitchen closes @ 11:00pm Book on Resy.com Now * * * * * * 10% off to all healthcare, government, law enforcement, military, teachers & students. News & stuff. First Name Last Name Email Address Sign Up Thank you! By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://www.foxslounge.com/happenings/daily-happy-hour",
      "text": "Happy Hour — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Happy Hour Jan 10 Written By Kevin Coster Join us for Happy Hour every day of the week from 4:00 pm - 6:00 pm featuring $7 Cocktails, $5 Beers, $6 Wines. Kevin Coster Next Next Martini Mondays By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://therealdeal.com/miami/2016/12/08/rene-dahdah-sells-foxs-lounge-in-south-miami-for-7-5m/",
      "text": "Fox's Lounge South Miami | Rene Dahdah | South Miami CRE Sign in Subscribe Subscribe search News All Markets San Francisco New York South Florida Los Angeles Chicago National Texas Sectors Residential Commercial Development Politics Tech Data Dashboard Snapshots Articles Rankings Interactive Maps Directory Data Books Magazine Data Book 2025 Current Issue Issue Archives The Closing Weekend Events Miami Forum Building Houston Future City Salon Series New York Forum Golf Classic Industry Events Video + Podcast Video Podcast Partners Brand Studio Content Videos Collaborate Advertise Sponsor & Exhibit Engage Sponsored Content Appliance Innovation Hub Multifamily Index Newsletters Other About Us Contact Us Privacy Policy Subscribe Corporate Subscriptions Advertise Help Center Careers Shop Reprints South Florida A South Miami’s Fox’s Lounge sells for $7.5M, buyer plans adaptive re-use Fox's Plaza and Colliers broker Marcos Puente Dec 8, 2016, 8:00 PM UTC By Katherine Kallergis Save article SHARE THIS ARTICLE FONT SIZE A A A The once-popular Fox’s Lounge in South Miami has a new owner. Fox’s Plaza, marketed as a redevelopment opportunity, just sold to an out-of-state buyer for its asking price of $7.5 million. Tony Arrellano of Metro 1 Commercial Rene Dahdah sold the properties at 7435 Southwest 61st Avenue and 6022-6030 South Dixie Highway to S. Miami Retail BH LLC, according to a press release. The site hit the market with Colliers International South Florida broker Marcos Puente in August. Tony Arellano of Metro 1 Commerical represented the buyer. Puente said he received multiple offers at the asking price because of the lack of supply along U.S. 1. “It’s definitely not unusual in this market to have full price or over ask for good, quality real estate, especially in markets like South Miami,” Arellano told The Real Deal . Sign Up for the undefined Newsletter SIGN UP State records show an attorney manages the buyer, a Miami-based entity. Arellano declined to identify his client, but said they are from outside of Florida. The deal, which closed Thursday, has not yet been recorded. The buyer will renovate and re-lease the buildings, according to the release. The properties were marketed with approved plans for two four-story, mixed-use buildings with retail, office and apartments on the site, which currently includes two vacant buildings with 165 feet of frontage on U.S. 1 and land in the rear. Asking rents will be in the $65 per-square-foot range. The plan is to bring in “interesting and creative tenants” like those in Wynwood, Arellano said. The project, in the drawing stage, will be completed within a year. In all, the site has 48,350 square feet of land and 10,830 square feet of buildings. Dahdah , who paid $3 million for the parcels in 2009, closed Fox’s during the summer of 2015 with plans to build a mixed-use project himself. Fox’s, built in 1946, was open for nearly 70 years. Downtown South Miami and parts of Coral Gables along South Dixie Highway have become increasingly attractive to investors and developers. Nearby projects include Paseo de la Riviera , a mixed-use development on the Holiday Inn site in the Gables, the planned redevelopment of the Shops at Sunset Place , and a handful of smaller retail projects in South Miami. First National Bank of South Miami provided financing for the Fox’s deal, Arellano said. He declined to provide the loan amount. George Befeler, partner at Homer Bonner Jacobs, represented Dahdah and Denise L. Ben-David, partner at Waserstein Nunez & Foodman, represented S. Miami Retail BH LLC, according to the release. Recommended All Markets All Markets Chicago Los Angeles National New York San Francisco South Florida Texas Recommended For You About us Contact us Privacy policy Terms and Conditions Subscribe Corporate Subscriptions Advertise Help center Careers Shop All rights reserved © 2025 The Real Deal is a registered Trademark of Korangy Publishing Inc. 450 West 31st Street, New York, NY 10001 Phone: 212-260-1332"
    },
    {
      "url": "https://www.wikihow.com/Contact-Fox-News",
      "text": "5+ Ways to Contact Fox News Network: Phone, Email & More Skip to Content Quizzes PRO Courses Hot Guides Tech Help Pro Expert Videos About wikiHow Pro Upgrade QUIZZES All Quizzes Love Quizzes Personality Quizzes Trivia Quizzes Taylor Swift Quizzes EDIT Edit this Article EXPLORE Tech Help Pro About Us Random Article Quizzes Request a New Article Community Dashboard This Or That Game Forums Arts and Entertainment Artwork Books Movies Computers and Electronics Computers Phone Skills Technology Hacks Health Men's Health Mental Health Women's Health Relationships Dating Love Relationship Issues Hobbies and Crafts Crafts Drawing Games Education & Communication Communication Skills Personal Development Studying Personal Care and Style Fashion Hair Care Personal Hygiene Quizzes Love Quizzes Personality Quizzes Fun Games Forums Arts and Entertainment Finance and Business Home and Garden Relationship Quizzes Cars & Other Vehicles Food and Entertaining Personal Care and Style Sports and Fitness Computers and Electronics Health Pets and Animals Travel Education & Communication Hobbies and Crafts Philosophy and Religion Work World Family Life Holidays and Traditions Relationships Youth LOG IN Log in Social login does not work in incognito and private browsers. Please log in with your username or email to continue. Facebook Google wikiHow Account No account yet? Create an account RANDOM Home Random Browse Articles Quizzes & Games All Quizzes Trending Love Quizzes Personality Quizzes Fun Games Dating Simulator Learn Something New Forums Courses Happiness Hub Explore More Support wikiHow About wikiHow Log in / Sign up Terms of Use wikiHow is where trusted research and expert knowledge come together. Learn why people trust wikiHow Categories Education and Communications Contacting Companies Contacting Media Outlets How to Contact Fox News to Make a Comment or Complaint Download Article Quickly & easily submit a request or suggestion to the Fox network Co-authored by Tami Claytor and Sophie Burkholder, BA Last Updated: January 12, 2025 Fact Checked Download Article Fox News Phone Number | Website & Social Media | Email | Mailing Address | Finding Answers Yourself | FAQs About Fox News Customer Service | Q&A | Tips | Show more | Show less X This article was co-authored by Tami Claytor and by wikiHow staff writer, Sophie Burkholder, BA . Tami Claytor is an Etiquette Coach, Image Consultant, and the Owner of Always Appropriate Image and Etiquette Consulting in New York, New York. With over 20 years of experience, Tami specializes in teaching etiquette classes to individuals, students, companies, and community organizations. Tami has spent decades studying cultures through her extensive travels across five continents and has created cultural diversity workshops to promote social justice and cross-cultural awareness. She holds a BA in Economics with a concentration in International Relations from Clark University. Tami studied at the Ophelia DeVore School of Charm and the Fashion Institute of Technology, where she earned her Image Consultant Certification. This article has been fact-checked, ensuring the accuracy of any cited facts and confirming the authority of its sources. This article has been viewed 1,201,534 times. If you have a comment, question, or news tip for Fox News, you can contact the network online, by phone, or by mail. Knowing the correct email address, phone number, or address for your specific concern will improve the likelihood of getting a reply or otherwise being heard. Below, we’ll give you the essential steps to contact Fox via phone, email, social media, and more! Fox News Contact Information Call Fox News customer service at 1-888-369-4762 or fill out their suggestion form on their help page. You can also tweet @FoxNews or send a Facebook message to the official Fox News page . Steps Section 1 of 6: Contacting Fox News by Phone Download Article Call Fox News at 1-888-369-4762 . Whereas some networks mostly encourage online submission of comments, Fox News does provide viewers with a 1-800 customer service number. You can use this phone number if you have a general inquiry, comment, suggestion, or concern. [1] X Research source Be prepared to go through a series of phone prompts when you dial the number. These prompts will direct you to the person or department you need to speak with. Advertisement Section 2 of 6: Contacting Fox News on their Website or Social Media Download Article 1 Fill out the contact form on the Fox News website. Go to the Fox News help page and select a topic from the dropdown menu. Then, fill in your personal information and message as prompted. Add any attachments you would like to, then submit your request. This portal is a great avenue for contacting the network with news comments, story corrections, or news tips . [2] X Research source If sending a correction or story question, specify when the story was on and what it was about. Corrections should be backed with outside, reliable sources . If sending in a tip, indicate the topic and location. Also, provide any sources you have to support or verify the tip. 2 Reach out to Fox hosts or shows on Facebook or Twitter. You can reach out to the main Fox News pages via their Twitter account or Facebook account . The hosts who are on Facebook and Twitter have social media buttons above their biographies on the Fox News website. Go to the Fox personalities page and click on the name of the person you want to contact. Then, click on the social media button in their biography. If you have a lengthy comment to make, a personal comment, or a simple comment but are not a “fan” of Fox News on Facebook, you will need to click on the “Message” button at the top of the Fox News Facebook page to send a private message . You can also send news tips by tweeting them to the main Fox News account or posting them on Facebook. Fox News is also interested in videos or photos of news happening in your area. 3 Find contact information for local affiliates on the Fox website. Go to this page and browse through the local affiliates to find the one you’re searching for. You can find each station's address, phone number, and website. Simply use the listed address and phone number for your local station to get in touch with a representative. Advertisement Section 3 of 6: Contacting Fox News by Email Download Article 1 Email the Fox News Press Office via irena.briganti@foxnews.com. Currently, Irena Briganti is the Group Senior Vice President of Media Relations at Fox News. You can send her an email to inquire about press releases and related topics at irena.briganti@foxnews.com . [3] X Research source 2 Email a specific Fox News show by finding their show contact page. Go to the Fox News show page and click on the show you're interested in contacting. Scroll through the page and look for a sidebar labeled \"Contact the Show.\" Fill in your personal info and comments as prompted, then send your message. You can also look at the websites for specific TV personalities to find their email addresses. For instance, you can reach Sean Hannity at hannity@foxnews.com or Bret Baier through this link . 3 Email FOXaroundtheworld@foxnews.com if you live outside the US. If you live outside the United States but watch Fox News on the Internet or on television, let them know your suggestion, tip, or complaint by sending an email to FOXaroundtheworld@foxnews.com . You can also use this email address to let Fox News know that you would like to view their news channel even though the channel is not available in your area. Advertisement Section 4 of 6: Contacting Fox News by Mail Download Article Write Fox News at 1211 Avenue of the Americas, NYC. Contact Fox News the old-fashioned way by sending snail mail to their physical address. Send your correspondence to: [4] X Research source Fox News Channel 1211 Avenue of the Americas New York, NY 10036 Section 5 of 6: Getting Questions Answered Without Contacting Fox News Download Article 1 Use the Fox News help page for questions relating to television. The network’s website has a help page in which you can search topics you want information about; it’s probably a good idea to see if a frequently asked questions page answers your question before calling. Questions addressed include how to find jobs or internships at Fox News, where you can buy Fox News products, and issues with the Fox News App for Xbox 360. The page also addresses many programming questions, ranging from information on how polls are conducted to program scheduling. 2 Find answers to online-related questions on the help page. The network also has a help page devoted to answering questions related to its online products. This page includes information on the playing of videos and online commenting. [5] X Research source Technical errors addressed on this page include loading issues with stories on FoxNews.com and link issues. The page also provides information on signing into and deleting a FoxNews.com account. You can also sign up for breaking news alerts on the page. 3 Get help with mobile devices on the designated page. Fox also has a page that answers questions relating to mobile devices. You can find information about the Android and iPhone versions of the Fox News mobile app, as well as iPad accessibility and information about the Xbox app. Advertisement Section 6 of 6: Frequently Asked Questions About Fox News Customer Service Download Article 1 How do I get the Fox Nation Military & Veteran’s offer? If you’re looking to learn more about Fox Nation ’s Military & Veteran’s offer, watch this video demo to sign up as an existing customer or this video demo to sign up as a new customer. 2 How do I get the Fox Nation First Responders offer? Read through this complete tutorial from Fox News to sign up for their First Responders offer. You can also learn more about the offer at this link . 3 How do I contact Sean Hannity? If you want to get in touch with Sean Hannity —the current host of FOX News Channel’s Hannity —navigate to his official website and click the three horizontal bars at the top-right of the screen. Click Contact Us , then fill out the form to send a message to Sean Hannity and his team. 4 How do I contact Tucker Carlson? If you want to get in touch with Tucker Carlson —the former host of FOX News Channel’s Tucker Carlson Tonight —send him an email at tips@TCNetwork.com . [6] X Research source 5 How do I contact Jesse Watters? If you want to get in touch with Jesse Watters —current FOX News host—you can call him at (929) 286-7479 or email him at watters@Fox.com . Advertisement Community Q&A Search Add New Question Question How can I get in touch with Fox Nation? wikiHow Staff Editor Staff Answer This answer was written by one of our trained team of researchers who validated it for accuracy and comprehensiveness. wikiHow Staff Editor Staff Answer You can contact customer support for Fox Nation through the Fox community website, here: dcgcommunity1.force.com/fox/s/support-form. Thanks! We're glad this was helpful. Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow Yes No Not Helpful 31 Helpful 20 Question How can I contact Sean Hannity? wikiHow Staff Editor Staff Answer This answer was written by one of our trained team of researchers who validated it for accuracy and comprehensiveness. wikiHow Staff Editor Staff Answer Click the “Contact Us” link at the top of Sean Hannity’s website, Hannity.com. From there you can fill out a contact form or find information about how to call and speak to a representative. You can also email him at hannity @ foxnews.com. Thanks! We're glad this was helpful. Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow Yes No Not Helpful 32 Helpful 53 Question How can I prevent my email address from being used or displayed when I contact Fox News with a comment? R2_d2000 Top Answerer You can use a service like 10minutemail.com to get a temporary email address that will be deleted after ten minutes. Alternatively, you can create a regular email account, send your comment, and delete the account afterward. Thanks! We're glad this was helpful. Thank you for your feedback. If wikiHow has helped you, please consider a small contribution to support us in helping more readers like you. We’re committed to providing the world with free how-to resources, and even $1 helps us in our mission. Support wikiHow Yes No Not Helpful 11 Helpful 42 See more answers Ask a Question 200 characters left Include your email address to get a message when this question is answered. Submit Advertisement Tips Be realistic about reaching out directly to a Fox News host or executive. It’s unlikely that a network is going to transfer your call to Sean Hannity or Lachlan Murdoch, for instance. Thanks Helpful 0 Not Helpful 0 Submit a Tip All tip submissions are carefully reviewed before being published Name Please provide your name and last initial Submit Thanks for submitting a tip for review! Advertisement You Might Also Like How to Contact Fox News Journalist Jesse Watters How to Contact Fox Nation How to Contact Tucker Carlson Online & Submit a Story How to Contact Sean Hannity How to Contact CNN to Submit a Tip or Make a Complaint How to Contact MSNBC News by Email, Phone & More How to Contact Ford Motor Company The Best Ways to Contact The Daily Show How to Contact the NFL How to Contact Nickelodeon 5 Quick Ways to Contact Hulu Customer Service and Get Help How to Contact the Republican National Committee (or GOP) How to Call, Write, or Email the White House How to Contact Nancy Grace Advertisement References ↑ https://www.foxnews.com/contact ↑ https://www.foxnews.com/contact ↑ http://press.foxnews.com/media-contacts/ ↑ http://press.foxnews.com/corporate-info/ ↑ https://help.foxnews.com/hc/en-us/categories/204381628-Web ↑ https://tuckercarlson.com/contact About This Article Co-authored by: Tami Claytor Etiquette Coach This article was co-authored by Tami Claytor and by wikiHow staff writer, Sophie Burkholder, BA . Tami Claytor is an Etiquette Coach, Image Consultant, and the Owner of Always Appropriate Image and Etiquette Consulting in New York, New York. With over 20 years of experience, Tami specializes in teaching etiquette classes to individuals, students, companies, and community organizations. Tami has spent decades studying cultures through her extensive travels across five continents and has created cultural diversity workshops to promote social justice and cross-cultural awareness. She holds a BA in Economics with a concentration in International Relations from Clark University. Tami studied at the Ophelia DeVore School of Charm and the Fashion Institute of Technology, where she earned her Image Consultant Certification.  This article has been viewed 1,201,534 times. 12 votes - 43% Co-authors: 19 Updated: January 12, 2025 Views: 1,201,534 Categories: Contacting Media Outlets Article Summary X To contact Fox News, call their customer service number by dialing 1-888-369-4762. Follow the operator’s prompts, which will direct you to the person or department you need to speak with. You can also write a letter and mail it to 1211 Avenue of the Americas, New York, NY, 10036. If you prefer to email, you can visit the Fox News website to find their email address for general comments, or the emails for individual hosts and show producers. Keep reading to learn how to send Fox News a correction or a news tip. Did this summary help you? Yes No In other languages Russian Chinese Print Send fan mail to authors Thanks to all authors for creating a page that has been read 1,201,534 times. Reader Success Stories Evie Salter Sep 19, 2018 \"I want to send Jedediah Bila a copy of my book that Mo the Cat wrote. A buyer at Disney World picked it up for a gift shop there, and tourists from all over world write to him. I think she, as an animal lover, would enjoy it. Thanks for an address to use!\" ...\" more More reader stories Hide reader stories Share your story Did this article help you? Yes No Advertisement Cookies make wikiHow better. By continuing to use our site, you agree to our cookie policy . Co-authored by: Tami Claytor Etiquette Coach 12 votes - 43% Click a star to vote % of people told us that this article helped them. Co-authors: 19 Updated: January 12, 2025 Views: 1,201,534 Evie Salter Sep 19, 2018 \"I want to send Jedediah Bila a copy of my book that Mo the Cat wrote. A buyer at Disney World picked it up for a gift shop there, and tourists from all over world write to him. I think she, as an animal lover, would enjoy it. Thanks for an address to use!\" ...\" more Greg Yeakel Oct 23, 2018 \"Hopefully, it gives me access to the news channel and an opportunity to be heard. I appreciate the information I have read. Hopefully, the news channel will respond.\" ...\" more Athena Henderson Nov 17, 2021 \"Thank you for making it easy to find contacts to get justice in a murder trial. Everything I needed was right there in one place.\" ...\" more Robert Washington Dec 27, 2017 \"There was the exact address for Fox News and an e-mail address as well to contact an employee to have some input. Thank you.\" ...\" more Anonymous Feb 21, 2017 \"Mail address helped. I haven't been able to email because my emails are blocked. I am trying to expose DOJ & FBI corruption.\" ...\" more Share yours! More success stories Hide success stories Quizzes Do I Have a Dirty Mind Quiz Take Quiz Personality Analyzer: How Deep Am I? Take Quiz Am I a Good Kisser Quiz Take Quiz Rizz Game: Test Your Rizz Take Quiz \"Hear Me Out\" Character Analyzer Take Quiz What's Your Red Flag Quiz Take Quiz You Might Also Like How to Contact Fox News Journalist Jesse Watters How to Contact Fox Nation How to Contact Tucker Carlson Online & Submit a Story How to Contact Sean Hannity Featured Articles How to Undo a Repost on Instagram Will I Get Together With My Crush Quiz The Easiest Way to Clean Your Room from Top to Bottom Wondering if Someone Likes You Online? 11 Important Signs to Watch Out For How to Increase Your Self Confidence with Positive Daily Practices How to Fix Painful Shoes Trending Articles How Many People Have a Crush On Me Quiz My Lookalike Generator What Does Your Sleeping Position Say About You? 10+ Scary Phone Numbers to Call Dating Simulator Princess Treatment vs Bare Minimum Quiz Featured Articles How to Use Castor Oil to Promote Healthy Hair How to Apply for an Internship Tips for Trimming Long Hair Evenly (Your Own or Someone Else’s) How to Whiten Teeth With Baking Soda 130+ Sexy, Sweet, & Seductive Messages for Him Something Bit Me! Common Insect Bites (with Pictures) Featured Articles Do I Have Common Sense Quiz 50 Cute & Flirty Knock-Knock Jokes to Make Them Smile How to Calm an Aggressive Cat How to Get a Flat Stomach in 7 Days: Exercises, Diet Tips, & More How Do You Know if She Likes You? 15+ Signs She’s Into You How to Flirt Watch Articles How to Clean Your Microwave Naturally with Lemon How to Tell if Chicken Is Done: Using a Food Thermometer & Other Signs How to Clean a Charging Port Without Damaging Your Device 3 Simple Ways to Fold a Button-Down Shirt for Travel An Easy Guide to the Coin Toss 5 Easy Ways to Accurately Figure Out Your Ring Size Trending Articles The 15 Most (And Least) Attractive Hobbies for Men to Have Labubu Blind Box Generator: Unbox & Collect Your Own Online Lababus What Is Your Soul Animal Quiz Which Huntr/x Member is My Soulmate Quiz Which Niche AI TikTok Fruit Am I Quiz Hollow Knight: Best Order to Defeat All Bosses Quizzes Am I Smart Quiz Take Quiz How Insecure Am I Quiz Take Quiz What Disney Princess Am I Quiz Take Quiz Do I Have a Phobia Quiz Take Quiz Guess My Age Quiz Take Quiz Am I a Genius Quiz Take Quiz Categories Education and Communications Contacting Companies Contacting Media Outlets wikiHow Newsletter You're all set! Helpful how-tos delivered to your inbox every week! Sign me up! By signing up you are agreeing to receive emails according to our privacy policy. Home About wikiHow Experts Jobs Contact Us Site Map Terms of Use Privacy Policy Do Not Sell or Share My Info Not Selling Info Contribute Follow Us × Don’t miss out! Sign up for wikiHow’s newsletter Subscribe You're all set! X - - 618"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "text": "Contact Grooming Lounge ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 0 0 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection Visit us Account ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection 0 Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers 0 $50.00 away from free shipping $0.00 Subtotal Cart 100% Money-Back Guarantee Your Cart Tax (calculated in checkout) - Shipping (calculated in checkout) FREE Your Cart is Empty shop now SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit Shaving SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits Skin CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers Body BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products Hair SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Beards BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products [hide] Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Built in our Barbershops, not a Boardroom. All Grooming Lounge brand products are developed, tested and used daily in our luxury barbershops and spas. We guarantee you'll love 'em or your money back. Grooming Lounge Collection Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Grooming lounge collection Brands A-Z MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz Brands MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items Deals+ OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Give Us A Call 703.288.0355 Barbershop + Spa DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Add description, images, menus and links to your mega menu A column with no settings can be used as a spacer Link to your collections, sales and even external links Add up to five columns Get In Touch Just reach out to the appropriate department with questions, comments or compliments. We're always happy to communicate with the people who keep us in business. Website Customer Service Email: [email protected] Phone: 866.456.8643 Hours: Mon-Fri 9 to 5 ET Tysons Corner, VA Store Email: [email protected] Phone: 703.288.0355 Tysons Galleria 1732 U International Drive McLean, VA 22102 LEARN MORE > Press and Media Inquiries Email: [email protected] Wholesale Inquiries Email: [email protected] Phone: 800.365.8522 Send Us A Note! Name This field is required. Email This field is required. Message Send Sign Up & Get 15% Right Now PROGRAMS Expert Advice Subscribe + Save Rewards Special Discounts Affiliate ABOUT US Our Story Barbershop + Spa Careers Blog HELP Contact Us/Customer Care FAQs Fast Shipping Policy Generous Return Policy Schedule A Barbershop + Spa Reservation Sign Up & Get 15% Right Now © 2023 Grooming Lounge . PRIVACY POLICY"
    },
    {
      "url": "https://www.livenowfox.com/contact-us",
      "text": "Contact Us | LiveNOW from FOX Live News Weather Politics Where to Watch LiveNOW Team About More Watch Live Expand / Collapse search ☰ Search site Live Where To Watch LiveNOW on YouTube FOX TV Stations FOX Weather Tubi FOX SOUL News Top Stories National World Politics Crime Police Chases Idaho Murders Israel-Hamas War Russia-Ukraine War Northeast New York News - FOX 5 NY Philadelphia News - FOX 29 Philadelphia Washington, DC News - FOX 5 DC New Jersey News - My9NJ South Atlanta News - FOX 5 Atlanta Orlando News - FOX 35 Orlando Tampa News - FOX 13 News Gainesville News - FOX 51 Gainesville Dallas News - FOX 4 News Houston News - FOX 26 Houston Austin News - FOX 7 Austin Midwest Chicago News - FOX 32 Chicago Detroit News - FOX 2 Detroit Minneapolis News - FOX 9 Milwaukee News - FOX 6 News West Phoenix News - FOX 10 Phoenix Los Angeles News - FOX 11 San Francisco News - KTVU FOX 2 Seattle News - FOX 13 Seattle Weather Winter Weather Severe Weather Hurricanes Environment FOX Weather Money Economy Business Personal Finance Consumer Real Estate Science Air & Space SpaceX Technology Wild Nature Viral Heartwarming News Unusual Pets & Animals Other News Sports Health Lifestyle Entertainment FOX Shows About LiveNOW Contact Us Distribution Partners LiveNOW Team Email Newsletters Contact Us Phone East Coast newsroom: (407) 741-5191 West Coast newsroom: (602) 452-0891 Mailing Address LiveNOW from FOX 35 Skyline Drive Lake Mary, FL 32746 News Tips Got a news tip for the LiveNOW team? Email it to us: livenowtips@fox.com Viewer Comments If you have a comment about something you saw on LiveNOW from FOX , please send it to us via email: livenowcomments@fox.com . If you have a comment about a FOX News program or personality, visit FOXnews.com to send it. Thank you for watching! Streaming Issues If you're having trouble watching, we want to know. Please use the following emails to reach us: Video Streaming issues: livenowstreamissues@fox.com Closed Captioning issues: livenowcc@fox.com Website For technical issues with LiveNOWFOX.com website, please email us at livenowwebteam@fox.com . Social Media Follow LiveNOW from FOX on social media! You'll find us here: Facebook: LiveNOW from FOX Twitter: @livenowfox Instagram: @livenowfox TikTok: @livenowfox YouTube: LiveNOW from FOX Press Inquiries If you're a reporter and need information for a story, please contact: Victoria Gurrieri Manager, Corporate Communications FOX Television Stations Victoria.Gurrieri@fox.com (212) 301-3419 Jobs at LiveNOW from FOX Want to join our team? Click here for a current list of open positions . How to Contact FOX News Channel If you're trying to comment about a show or personality on FOX News, click over to their website . Please note that email addresses listed on this page do NOT reach the FOX News Channel team. Live Where To Watch LiveNOW on YouTube FOX TV Stations FOX Weather Tubi FOX SOUL News Top Stories National World Politics Crime Police Chases Idaho Murders Israel-Hamas War Russia-Ukraine War Northeast New York News - FOX 5 NY Philadelphia News - FOX 29 Philadelphia Washington, DC News - FOX 5 DC New Jersey News - My9NJ South Atlanta News - FOX 5 Atlanta Orlando News - FOX 35 Orlando Tampa News - FOX 13 News Gainesville News - FOX 51 Gainesville Dallas News - FOX 4 News Houston News - FOX 26 Houston Austin News - FOX 7 Austin Midwest Chicago News - FOX 32 Chicago Detroit News - FOX 2 Detroit Minneapolis News - FOX 9 Milwaukee News - FOX 6 News West Phoenix News - FOX 10 Phoenix Los Angeles News - FOX 11 San Francisco News - KTVU FOX 2 Seattle News - FOX 13 Seattle Weather Winter Weather Severe Weather Hurricanes Environment FOX Weather Money Economy Business Personal Finance Consumer Real Estate Science Air & Space SpaceX Technology Wild Nature Viral Heartwarming News Unusual Pets & Animals Other News Sports Health Lifestyle Entertainment FOX Shows About LiveNOW Contact Us Distribution Partners LiveNOW Team Email Newsletters youtube facebook instagram twitter email Updated Terms of Use New Privacy Policy Your Privacy Choices Closed Captioning About Us Contact Us Partners Newsletters This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://www.foxint.com/home/support/contact-us/",
      "text": "Find out how to get in touch with Fox new Follow us: Language: English English Nederlands Deutsch русский français italiano magyar polski čeština español română български hrvatski 0 £0.00 Sorry, we are out of stock of product: Home or Register Products Products New Products Baiting Tools & Accessories Barrows Bedchairs & Chairs Bite Alarms Bite Indicators Boats & Electric Motors Carp Care Clothing Cookware Edges™ Hooklinks & Leader Materials Edges™ Lead Setups Edges™ Ready Tied Rigs, Leaders & Tubing EDGES™ Rig Accessories Edges™ Tools Edges™ Zig & Surface Fishing Feature Finding & Markers Hooks - Carp Hooks Hooks - Edges™ Range Landing Nets Leads & Feeders Lights & Head Torches Luggage - Aquos Luggage - CAMOLiTE™ Luggage - Voyager® Mainline and Leaders Pods & Rod Support Power Packs PVA & Arma Mesh Reels Rods Shelter Accessories Shelters Sleeping Bags, Pillows & Covers Spomb™ Range Tackle & Rig Storage The Syndicate Store Locator Fox TV Articles Support Contact Us Product Manuals Declarations of conformity Catalogue & Guides Warranty Information Product Recalls About Us Careers at Fox support contact us Products New Products Baiting Tools & Accessories Barrows Bedchairs & Chairs Bite Alarms Bite Indicators Boats & Electric Motors Carp Care Clothing Cookware Edges™ Hooklinks & Leader Materials Edges™ Lead Setups Edges™ Ready Tied Rigs, Leaders & Tubing EDGES™ Rig Accessories Edges™ Tools Edges™ Zig & Surface Fishing Feature Finding & Markers Hooks - Carp Hooks Hooks - Edges™ Range Landing Nets Leads & Feeders Lights & Head Torches Luggage - Aquos Luggage - CAMOLiTE™ Luggage - Voyager® Mainline and Leaders Pods & Rod Support Power Packs PVA & Arma Mesh Reels Rods Shelter Accessories Shelters Sleeping Bags, Pillows & Covers Spomb™ Range Tackle & Rig Storage The Syndicate Store Locator Fox TV Articles Support Contact Us Product Manuals Declarations of conformity Catalogue & Guides Warranty Information Product Recalls About Us Careers at Fox Follow us: Contact Us If your enquiry is regarding a faulty product, please contact the FOX Authorised Stockist from whom the item was purchased. Your retailer will be more than happy to handle your enquiry through our Company. They will also assist you with any technical or product queries you may have. For a full listing of Fox approved stockists in your area please use the Store Locator . Ordering Spare Parts Fox spare parts can be ordered direct online from this website. Visit the Products Section and browse or search for the product from which you want to purchase a spare part. On the right hand side next to the Product Overview you will find all spare parts available for this particular item. Micron (Only) Repairs & Servicing For Microns within 2 year warranty and with proof of purchase please contact the Fox authorised stockist from whom the item was purchased. Out of warranty Microns please contact Dalectronics Limited for repairs and servicing on the following email: dal@dalectronics.com Reel (Only) Repairs & Servicing For all reel repairs and servicing please contact workshop@tacklebox.co.uk Send us an email Processing please wait... Who to contact * Please select General Sales Customer Services Your name * Your email * Country * Please select Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Belarus Belgium Belize Bhutan Bolivarian Republic of Venezuela Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Darussalam Bulgaria Cambodia Cameroon Canada Caribbean Chile Colombia Congo (DRC) Costa Rica Côte d’Ivoire Croatia Cuba Czech Republic Denmark Dominican Republic Ecuador Egypt El Salvador Eritrea Estonia Ethiopia Faroe Islands Finland France Georgia Germany Greece Greenland Guatemala Haiti Honduras Hong Kong S.A.R. Hungary Iceland India Indonesia Iran Iraq Ireland Islamic Republic of Pakistan Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Korea Kuwait Kyrgyzstan Lao P.D.R. Latin America Latvia Lebanon Libya Liechtenstein Lithuania Luxembourg Macao S.A.R. Malaysia Maldives Mali Malta Mexico Moldova Mongolia Montenegro Morocco Myanmar Nepal Netherlands New Zealand Nicaragua Nigeria North Macedonia Norway Oman Panama Paraguay People's Republic of China Peru Philippines Poland Portugal Principality of Monaco Puerto Rico Qatar Réunion Romania Russia Rwanda Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa Spain Sri Lanka Sweden Switzerland Syria Taiwan Tajikistan Thailand Trinidad and Tobago Tunisia Turkey Turkmenistan U.A.E. Ukraine United Kingdom United States Uruguay Uzbekistan Vietnam World Yemen Zimbabwe Enquiry subject Enquiry * Please fill in all fields marked with an '*'. Send Additional info: Fox International Group Limited 1 Myrtle Road Brentwood Essex CM14 5EG For customer service returns: Fox International Group Limited Customer services Dennenlaan 3A 2340 Beerse België foxint FoxInternational1 FoxInternational fox_international Store locator: You can search for your local store here. Find a store Fox spare parts: Contact us to check the availability of spares here. Spares CATCH OUR BEST CONTENT AND COMPETITIONS FIRST. DISCOVER MORE AND SIGN UP HERE © FOX International Group Limited. All rights reserved. EEE Producer Registration No. WEE/BC0058TS. TERMS & CONDITIONS PRIVACY POLICY & COOKIES SLAVERY STATEMENT"
    },
    {
      "url": "https://www.foxslounge.com/gallery",
      "text": "Gallery — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Gallery Follow us on Instagram By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://www.foxslounge.com/happenings/martini-mondays",
      "text": "Martini Mondays — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Martini Mondays Jan 7 Written By Kevin Coster ﻿Join us every Monday for Vodka and Gin Martinis featured at $10 each. 8:00 pm - Close. Kevin Coster Previous Previous Happy Hour Next Next Margarita Martes (Tuesday) By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://www.foxslounge.com/happenings/weekend-djs",
      "text": "Weekend DJs — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Weekend DJs Jan 1 Written By Kevin Coster Join us on Friday and Saturday Nights for bites, cocktails, and Live DJ Sets. Kevin Coster Previous Previous Wing It Wednesday By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://www.foxslounge.com/private-events",
      "text": "Groups & Events — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Let’s Party Fox’s Lounge in South Miami is the perfect spot to host birthdays, anniversaries, and other milestone events. Nostalgic and unpretentious, Fox’s offers a mix of classic American dishes and strong, expertly crafted cocktails. To host your event at Fox’s Lounge, please fill out the form below and we will get back to you shortly! Private Event Software powered by Tripleseat By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    },
    {
      "url": "https://www.foxcities.org/about-us/staff/",
      "text": "Staff - Fox Cities CVB | Fox Cities CVB Skip to content 60 ° F 0 Saved Navigation Things to Do Outdoor Recreation Indoor Recreation & Amusements Museums & Historical Sites Shopping Family Fun Arts & Culture Live Music & Nightlife Spas & Wellness Fox Cities Original Experiences Found in the Fox Full Stream Ahead Hit the Trails Date Night For the Family Round of Applause Food & Drink Locally Owned Restaurants Bars & Lounges Events Annual Events Submit Event Fox Cities Snapshots Where to Stay Plan Your Visit Communities Getting Here & Getting Around Weather & Average Temperatures Travel Resources Fox Cities Visitor Center Destination Guide Deals E-Newsletter Sign-Up Group Tours Meeting Planners Sports Planners About Us Blog Home About Us Staff Staff Get to know us Meet the team that makes the magic happen! Administration Pam Seidl Executive Director Email: pseidl@foxcities.org I have the pleasure of leading this amazing organization and staff to ensure that we accomplish our mission of economic development through tourism. The Bureau serves as the source for independent information on tourism in the Fox Cities, ensuring all visitors, whether here for a convention, sports tournament or leisure travel have the best experience possible. The best view in the Fox Cities: It may sound odd, but the view heading West on the HWY 441 bridge across Little Lake Buttes des Morts at sunset. It's just beautiful. Favorite place to eat: The \"sister\" restaurants of Carmella's and SAP. Favorite Fox Cities attraction or event: Walking the Fox Cities Trestle over Little Lake Butte des Morts is my favorite outdoor activity and any of our local farm markets make for a great event Headshot location: Loop the Lake. It's a beautiful trail comprised of trestle bridges that connect 3 of our local communities. It's where I take my dog, Boyd, for a walk every night! Felicia J. Roddy Director of Finance and Administration Email: froddy@foxcities.org I oversee the daily operations of the Bureau, which include financial management, human resources, information technology, purchasing and overall office functions. The best view in the Fox Cities: High Cliff State Park. I love being able to take my horses there and ride on over 8 miles of trails. Favorite place to eat: It's a tie between Island Sushi and Dick and Joan's Supper Club. Both places are date night go-tos for my husband and I. Favorite Fox Cities attraction or event: There is always a great selection of shows to choose from at the Fox Cities Performing Arts Center. Headshot location: Lower Telulah Park Kayak Launch Marketing & Communications Cathy Trebatoski Director of Marketing Communications Email: ctrebatoski@foxcities.org My job is to help promote the Fox Cities region as a premier destination for tourism. I ensure that our strategic marketing, communications and branding work together to spread the message on why locals and tourists alike should plan their next vacation or staycation to the Fox Cities. Best view in the Fox Cities: I love the view of Lake Winnebago by the lighthouse in Kimberly Point Park. Favorite place to eat: Charlie's Drive-In, Hortonville. They are well known across the area for their cheeseburgers and homemade root beer. My favorite item is their BBQ sandwich which is similar to a sloppy joe. Favorite Fox Cities attraction or event: Pumpkin picking at Cuff Farms. I enjoy the scenic wagon ride through the fields where you can gather pumpkins of all shapes and sizes. There are lots of fun areas for the kids to play and an antique truck that is a great photo opp. Headshot location: Mile of Music mural. I love hearing original music from the eclectic array of up and coming artists that comprise Mile of Music. It's fun to rub elbows with bands as they join the audience to watch their fellow musicians perform. Bri Depies Digital Marketing Manager bdepies@foxcities.org I have the pleasure of promoting the Fox Cities on all digital platforms by developing and executing digital strategies. I showcase the inviting atmosphere, attractions, and events that make the Fox Cities a dynamic destination and draw people to visit. Best view in the Fox Cities: The beautiful Scheig Center Gardens in Appleton Memorial Park is so peaceful and always features beautiful seasonal flowers. It’s a wonderful escape, whether alone or with a loved one, and showcases the natural beauty of the area. Favorite place to eat: I love Waverly Beach Bar & Grille because of its unbeatable atmosphere. Relaxing on the outdoor patio, enjoying live music, and taking in the beautiful views of Lake Winnebago—all while enjoying a delicious sandwich—is the perfect way to spend an evening. Favorite Fox Cities attraction or event: One of my favorite events in the Fox Cities is the Downtown Appleton Christmas Parade. I have so many fond memories of bundling up and watching the parade with my family each year since I was a kid. It always kicks off the holiday season in such a magical way! Headshot location: Photo coming soon! Appleton Public Library. The newly renovated Appleton Public Library, which reopened in February 2025, serves as a dynamic space for community creativity, learning, and connection. Sports Matt Ten Haken Director of Sports Marketing Email: mtenhaken@foxcities.org My job is to help bring in as many visitors to the Fox Cities as possible through sports. Whether it is an arm wrestling competition, a youth soccer tournament, or a coaches' convention, I sell the Fox Cities as a destination for a variety of sporting events. The best view in the Fox Cities: From the Lower Softball Diamond at Sunset Park in Kimberly, you can see the Fox River just beyond the outfield fence. Favorite place to eat: Dick & Joan's Supper Club in Appleton to enjoy a drink in the lounge area, partake in the robust salad bar, and dig into a hearty meal. Favorite Fox Cities attraction or event: Enjoying a warm summer evening with friends at a Timber Rattler game at Fox Cities Stadium. Headshot location: Community First Champion Center. It's one of the premier sports tourism facilities in the country. Being involved with the project since the initial idea has been one of the highlights of my professional career. Abby McDaniel Sports Marketing Manager Email: amcdaniel@foxcities.org My job is to assist with promoting the Fox Cities as a premier destination for sporting events. The best view in the Fox Cities: High Cliff State Park as it captures the beauty and essence of the Fox Cities. Favorite place to eat: It's hard to beat the Friday Fish Fry at Mark's East Side. Favorite Fox Cities attraction or event: Cheering on the Wisconsin Timber Rattlers (and their grounds crew) at Fox Cities Stadium! Headshot location: Manderfield's Bakery. I love sweets and baking reminds me of spending time with my family in Minnesota. I love having that little reminder of home here in the Fox Cities. Group Sales Alison Hutchinson Senior Group Sales Manager Email: ahutchinson@foxcities.org I specialize in promoting the Fox Cities as a destination for meetings and conventions. My job is to work with our partners to bring new and existing groups into the area to stay in our hotels, sample our cuisine, visit local attractions and events, browse our many shopping venues and share their experiences with colleagues and friends. The best view in the Fox Cities: At 1000 Islands Environmental Center, there is a boardwalk trail that takes you along the river and I enjoy being surrounded by all of the natural beauty. Favorite place to eat: Stone Arch Brewpub, for their cheese curds, which are hand-made with the Stone Arch Scottish Ale, or the schnitzel with a creamy mushroom sauce. Favorite Fox Cities attraction or event: My favorite attraction is the Performing Arts Center. You can go to a Broadway show at the convenience of your own town. Headshot location: Bergstrom-Mahler Museum of Glass. It holds the largest, public collection of glass paperweights in the world. The best part is free admission! On your way out, check out the Museum Shop which has an array of original and affordable glass art. Lindsey Schultz Sales & Marketing Assistant Email: lschultz@foxcities.org My job is to support both the Sales and Marketing teams by promoting and sharing the fantastic destination that is the Fox Cities! The best view in the Fox Cities: My favorite view is from the East College Avenue bridge that goes over Little Lake Butte de Morts. I always have to take in the beautiful views each time I cross it. Favorite place to eat: I love Mill City Public House for their elevated take on typical \"American bar food.\" Their burgers, sandwiches, tots, and more are all fantastic! If I am looking to get my Mexican food fix, I love Sangria's Mexican Grill. They have a large menu of great food and drinks; each option just as good as the last. Favorite Fox Cities attraction or event: I enjoy all of the walking trails that the Fox Cities has to offer. Places such as 1000 Islands Environmental Center for their winding board walks and nature views, or taking in the great view over Little Lake Butte Des Morts from Trestle Trail Bridge. Headshot location: Fox Cities Exhibition Center. The Fox Cities Exhibition Center is a multi-purpose convention center located in the heart of Downtown Appleton. The space is a draw for events such as large conventions, career fairs, and even sporting events. More About Us Board of Directors Our Board of Directors consists of an equal number of municipal representatives, hotel managers and owners, and community leaders who review and approve CVB policy, program, and budget. Learn More Annual Report Each year, the CVB creates an Annual Report showcasing the previous years' successes. Learn More Volunteer Opportunities Support the greater Fox Cities area by becoming a part of our team! Learn More Partner Portal Welcome, industry partners, to your one-stop-shop for CVB information and resources! Learn More Career Opportunities The Fox Cities Convention & Visitors Bureau is an economic development organization that strengthens the Fox Cities community and economy by investing in and promoting our destination. Learn More Tourism Development Grants The Fox Cities Convention & Visitors Bureau allocates a percentage of its room tax revenue for the development or expansion of visitor attractions and amenities. Learn More Email Newsletter Destination Guide Visitor Center 213 S. Nicolet Rd. Appleton, WI 54914 (920) 734-3358 Hours Mon - Fri | 8:00am - 4:30pm Closed on Wednesdays from Labor Day to Memorial Day About Us Contact Us Media Site Map ©2025 Fox Cities - All Rights Reserved \n                            - Privacy Policy This site uses cookies to provide you with an optimized experience. Learn More Accept Quick Search Search Location Map"
    },
    {
      "url": "https://fox-news.pissedconsumer.com/customer-service.html",
      "text": "Fox News Customer Service Phone Number (888) 369-4762, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Media Fox News 2306 Customer Service Updated on 08/31/2025 Contact Fox News Customer Service Reviews 0 Contacts Q&A Advertisements Fox News Phone Numbers and Emails Toll-Free Number: (888) 369-4762 Call customer service Send Message Media: (212) 301-3000 Fox News Emails: Customer Service Fox Around The World General Info Military and Veteran Legal Media Advertising Inquiries, Senior Executive Vice President, Corporate Communications, Vice President and Editor-in-Chief of FOX News Digital Is this your business? phone numbers and emails Advertisements Fox News Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Fox News Customer Service is rated at 2.2 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 81% phone 19% email The best phone number to call Fox News is 8883694762 . 87% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 18% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Wednesday , while the shortest are on Saturday . The average call time is 2 minutes . Be prepared for the call as Fox News may ask you for the following information to identify you as a customer: address or zip code, email or first and last name . View full overview › Fox News Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Fox News Customer Service is rated at 2.2 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 81% phone 19% email The best phone number to call Fox News is 8883694762 . 87% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 18% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Wednesday , while the shortest are on Saturday . The average call time is 2 minutes . Be prepared for the call as Fox News may ask you for the following information to identify you as a customer: address or zip code, email or first and last name . People call Fox News mainly because of product/ service, request for information and account . 7% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel unsatisfied after talking to customer service representatives. The best email to contact Fox News is ldepartment@foxnews.com . 35% of customers use this email address to address their issues and concerns. Customers evaluated the effort they needed to make to contact customer service as neither easy nor difficult . Close How to Contact Fox News Customer Service? Most Popular Number: (888) 369-4762 Total calls: 1 617 Issues resolved: 49 Last call: Sep 9, 2025 Rebecca A. Garland PissedConsumer Reporter What Is The Fox News Phone Number? If you want to contact Fox News Customer Service by phone, you should find the correct Fox News phone number to be heard and get a prompt reply. According to the Fox News contacts page, you may call the company at 1-888-369-4762 to submit a general inquiry, offer your suggestions or share your concerns. To get in touch with the required staff member or department, you will have to go through several auto-phone prompts. Be ready to spend some time on this. Unfortunately, this is the only phone number you may use to call Fox News Channel. How Do I Get Hold Of Fox News Customer Service By Chat? The Fox Help Center can be reached by live chat. The option is accessible from the company website Monday through Friday from 6:00 a.m. to 8:00 p.m. PST and Saturday through Sunday from 7:00 a.m. to 8:00 p.m. PST. Please note that the timeframe can be changed during holidays. To start the Fox News support chat, click Chat with an Expert on the bottom right corner of the company website. You will need to fill out a support form. It is necessary to state your name and email address, then select the brand about which you want to inquire and the available option. Having stated the abovementioned data tap the Start Chat button. You can also submit the Fox News Customer Support form on the help page and one of their customer care representatives gets back to you within several minutes. How Do I Reach Out To Fox News Customer Service Via Social Networks? In addition to calling the Fox News Customer Service number, you can also offer your comments or news tips for the channel via social media platforms. You can reach out to Fox shows or hosts via Facebook or Twitter. Tweeting or messaging through social media networking is much easier than emailing the company since there is no single Fox News email address. You should fill in the Contact the Show form or find the email of the Fox News person you’d like to communicate to. You may follow Fox News on Facebook and Twitter, exchange private messages as well as comment posts, and get in touch with Fox News hosts using their social media accounts. Links to the official Fox News social media accounts are available on the company Help page. Contact Information Fox News Website: www.foxnews.com Fox News Help Center: Visit contact page Corporate Office Address: Fox News Network, LLC 1211 Avenue of the Americas, 15th Floor New York, New York 10036 United States Help in Social Networks: Facebook Pinterest Instagram Twitter Linkedin Youtube Fax: +1212.301.5785 Fox News Customer Service Reviews 2.2 / 5 Poor See all 2.3K reviews Brynn Glh Aug 23, 2025 To early to tell 5.0 some improvement but not with reps. need to make it easier to get to reps .that is all I have to say for right now Read full review Amyrah Rag Jul 13, 2025 Want a refund? 1.0 Not very good it took almost 3 months to get them to cancel the subscription after them wanting to be charged 1995 or five dollars to talk to somebody still havent received a refund. We watched one program since November 1924 would really like a refund. Read full review Caterina Hfa Mar 26, 2025 I called to thank will go the great interview he had with congressman himes it was sad to see the congressman laugh about his responsibilities with the afghan exit 5.0 I really hoped someone was able to thank Wil for his efforts. I did call him and leave him a message and I sure hope I got the right Will Kane oh well if it wasnt someone else figure it out. I did call the Congressmans office and ask them to Ford, how ignorant a message he gave in it was sad to see someone laugh and they said they were gonna do it and I never hear back from anybody Read full review Tayah Zpv Mar 13, 2025 No one got back with me Not good!!! I left a msg , but no one ever bother to call me back, very disappointed, I just thought that someone would care enough to to call back Read full review How Good is Fox News's Customer Service? Chon Kpm Chon Kpm Feels Disappointed | Aug 23, 2025 Poor response Read full quote Cherry C Zry Cherry C Zry Feels Disappointed | Mar 05, 2025 we have been charged for Fox Nation for a year and we never signed up for it. Read full quote Carol G Agw Carol G Agw Feels Satisfied | Jan 23, 2025 I was calling to give input not complaining. The title “pissed“ is not an accurate or. Good opportunity to get through to Fox. To give. Beneficial input. Perhaps you could give us another way to get through to staff. Read full quote Trica Jzf Trica Jzf Feels Disappointed | Dec 08, 2024 I tried to sign up for Fox Nation, they took my money and I have no Fox Nation on my TV. I tried to cancel and nothing has happened. I would like to speak to a human. my number is 419-602-****. Pauline Canaday e-mail. pcanaday01@***.com Read full quote Marlon G Hvz Feels Disappointed | Nov 24, 2024 They are so biased and paranoid about my press release they act like they are doung heavy drugs. Settjng bad examples and snub of the Grassroots Comminity is disrespectful and iy wont be tolerated. Read full quote William G Qwo William G Qwo Feels Disappointed | Nov 21, 2024 Though I only watch Fox News their customer service is 0 in my opinion. I haven’t received an answer from them at this time. Read full quote Summary of Fox News Customer Service Calls 1.9K TOTAL CALLS 01:37 AVG CALL DURATION 7% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Fox News? Product/ Service Question: 1d ago “I’m pissed at basically Carlos, can’t listen to her cracked voice , no sense either. Please get rid of her!!!” 4d ago “Phone settings issue” 7d ago “Trying to find a Hotel/Bar in Kota Kinebalu where I can watch AFL Finals games” Request for Information Question: 7h ago “To check about ordering something” 1d ago “Question about FoxNation” 10d ago “Concerned for a friends safety” Account Question: 15d ago “I was scammed in my Wells Fargo account and they refuse to give me my money back” 19d ago “Can’t log into Fox one” 20d ago “I’m a disabled & homeless 67 yr old who has been using my part C insurance for medical transportation. They are using immigrants who driove me to doctor appts at high rates of speed, who they’re unfamiliar with area many don’t speak Eng” Activation/ Cancellation Question: 3d ago “Activate phone” 13d ago “Cancel subscription” 14d ago “Cancel service” Payments and Charges Question: 1M ago “Unauthorized charge” 2M ago “$59.49 charge on credit card!!” 2M ago “Big beautiful bill” Staff Question: 1M ago “Service down” 1M ago “Fox nation service” 2M ago “I'm having trouble with fox nation chat service so please cancel my subscription” Website/ Application Question: 6d ago “Missing video from website. Date 8-26-25” 18d ago “Cannot download Fox One app on my Samsung tv” 5M ago “Your app is problematic. I casting to TV and it dies after an hour” Return/ Replace Question: 3M ago “Correction” 4M ago “About correctional center in Vienna IL 6695 State Route East 146 Vienna IL, 62995” 7M ago “The windows in the national Cathedral. Is anybody paying attention to how they’ve been changed?” Shipping and Delivery Question: 1d ago “Trying to get the military discount for fox nation but it says I need a tv provider but is there a way to download the app with starlink internet?” 5d ago “Did fox nation lock me out of live fox shows cause I dont get them since sat.” 3M ago “How American citizen ate treated in other countries by there immigration. Where bribes to government employees is the only way to get the to do anything. I am a older woman American citizen and my Austic adult son are being discriminate against.” Refund Question: 21d ago “Refund” 1Y ago “I want a refund” 2Y ago “Frontier has hundreds of customers grounded due to mechanical issues. Passengers were removed and told no flight is available until 3pm tomorrow. They refuse any room accomodations, refunds, or anything. Passengers told they will receive nothing and” Employment Question: 4M ago “Long story short, the sheriffs department can’t handle their job. Can’t do their job so the governor since federal troops in to do the job for the sheriffs department meanwhile, good people like myself or getting shot at held up by weapons I’ve” 9M ago “For job” 9M ago “Big Tip on a hatchet job performed on the Republican Party. You’ll never guess who did I?” Cards Question: 12d ago “I want that Bit h Jessica Tarlov GONE OF OF The Five after what she said to Joey Jones just now on The Five- “Now you want to play the leg card” she said to an amputee who gave his legs for our country!!!! GONE Tarlov ***” 5Y ago “Myself and my husband being false accused for a green card” Other Question: 1d ago “TO SEND YOU THE VIDIO” 4d ago “Start Fox one” 7d ago “Suggestion” Compare Fox News Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Newsmax Customer Service 2.3 out of 5 CNN Customer Service 1.8 out of 5 MSNBC Customer Service 2.2 out of 5 Write a review Do you have something to say about Fox News? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Fox News Reviews Contacts Q&A Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Fox News contact page? Contact Fox News Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    },
    {
      "url": "https://www.foxslounge.com/happenings",
      "text": "Happenings — Fox's Lounge | South Miami Restaurant & Bar 0 Skip to Content Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Menus Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Open Menu Close Menu Folder: Menus Back Dinner Beverage Happy Hour Gallery Happenings History Groups & Events RESERVATIONS Kevin Coster 1/10/25 Kevin Coster 1/10/25 Happy Hour Every Day, 4:00 pm - 6:00 pm Read More Kevin Coster 1/7/25 Kevin Coster 1/7/25 Martini Mondays Every Monday, 8:00 pm - Close Read More Kevin Coster 1/6/25 Kevin Coster 1/6/25 Margarita Martes (Tuesday) Every Tuesday, 8 pm - Close Read More Kevin Coster 1/6/25 Kevin Coster 1/6/25 Wing It Wednesday Every Wednesday, 4 pm - 11 pm. Read More Kevin Coster 1/1/25 Kevin Coster 1/1/25 Weekend DJs Fridays and Saturdays Read More By Lost Boy & Co. • Contact Us Also visit: Tropezón | Lost Boy Dry Goods | Brother’s Keeper"
    }
  ]
}