{
  "fuentes": [
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/visit#:~:text=We allow:,clear, 1-gallon ziplock bag",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/fpl-solar-amphitheater-at-bayfront-park",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/fpl-solar-amphitheater-at-bayfront-park",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/fpl-solar-amphitheater-at-bayfront-park",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/visit",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "info@bayfrontpark.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "josephnieman@livenation.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "sbutler@miamigov.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "email": "sbutler@miamigov.comcom"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/drinks",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "email": "info@bayfrontparkmiami.com"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "email": "sbutler@miamigov.com"
    },
    {
      "url": "https://spotlightsolar.com/bayfront-park-project",
      "email": "info@spotlightsolar.com"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/private-events",
      "email": "fplsolarampevents@livenation.com"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/know-before-you-go",
      "email": "fplsolarampevents@livenation.com"
    }
  ],
  "mails": [
    "fplsolarampevents@livenation.com",
    "info@bayfrontpark.com",
    "info@bayfrontparkmiami.com",
    "info@spotlightsolar.com",
    "josephnieman@livenation.com",
    "sbutler@miamigov.com",
    "sbutler@miamigov.comcom",
    "specialevents@livenation.com"
  ],
  "nombre_sitio": "fplsolaramphitheaterbayfront.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/visit#:~:text=We allow:,clear, 1-gallon ziplock bag",
      "text": "Visiting FPL Solar Amphitheater at Bayfront Park: Parking, Amenities, Frequently Asked Questions Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Where The Music's At Get Here FPL Solar Amphitheater at Bayfront Park is located at 301 N Biscayne Blvd., Miami, FL 33132. Directions Pick Your Parking FPL Solar Amphitheater has partnered with ParkWhiz to offer easy and reliable options. Click HERE to book parking through ParkWhiz. View All Upgrades Drinks Skip the preshow rush and sip with us! This season we’re serving up even more drink options with every fan in mind. Learn More Accessibility FPL Solar Amphitheater at Bayfront Park strives to ensure that all of our guests have a great time at our venue. If you need additional assistance while you are here, please make sure you let us know. Learn More The Need-To-Know Before You Go We're thrilled to welcome you beneath the Miami skyline! Before your arrival, make sure to check out what to expect during your visit to FPL Solar Amphitheater at Bayfront Park. Learn More Venue Map Get lost in the music. Not the venue. FPL Solar Amphitheater at Bayfront Park is a vibrant piece of Miami's downtown, so here’s a map to help you get around. Download FAQ How can I contact FPL Solar Amphitheater at Bayfront Park? Venue Phone number – (305) 358-7550 What is your bag policy? To reduce staff contact with guest belongings, we have implemented the following bag policy: we will allow clear plastic, vinyl or PVC tote bags no larger than 12” x 6” x 12” and/or small clutch bags (6”x 9”). Can I rent a lawn chair? Lawn chairs are available for rent for most shows and must be turned in at the end of the event. Our rental chairs are 27.6” wide X 27.6” deep X 30.5” tall. No other chairs are permitted inside the venue. To rent a lawn chair in advance, click here. How is traffic control around FPL Solar Amphitheater at Bayfront Park? Traffic is controlled by local law enforcement. If there are any major traffic issues that will impact the start of the event we will post this information on our social media pages. Do you have a lost and found? If you lose an item while you are at an event - you can visit the Bayfront Park Management Trust office to see if it has been turned in or by calling them at (305) 358-7550. What are your will call protocols? Will call tickets are available for pickup at the box office located on the south side of the venue on show days only beginning at 12pm. Please make sure that you have a photo ID matching the purchasers name to pick up tickets. Any name changes need to go through Ticketmaster Customer Service- 800-653-8000. Guests are not permitted to put tickets in will call for other guests to pick up. You will need to arrange to meet your party at the facility to deliver tickets. If tickets or passes are being left for you- they will only be left at the box office. This includes meet and greet passes, backstage passes, press passes, and tickets from the tour or other promotional company. We do not get these tickets until the day of the event close to doors so please do not try to pick them up earlier. If your tickets/passes are not in will call you will need to contact the person that left them for you to determine where they are. The box office cannot contact any member of the tour for you. What is your camera policy? SUBJECT TO CHANGE - The standard venue policy allows camera phones, disposable cameras, and small digital cameras. Any camera that has a detachable lens will be considered professional and not allowed in. If the camera lens zooms out of the camera more than 1 in- it will be considered a professional camera and will not be allowed in. Some artists do not permit cameras so please check back for the show you will be attending to ensure that we will be allowing cameras in. Is smoking permitted? Smoking is not permitted in the seated area (e-cigarettes and vaping included). Guests may smoke on the lawn or on the crosswalks on top of the lawn. If another guest complains about the smoke, we may ask you to refrain from smoking or move to another location. We appreciate your cooperation. Can I bring water into FPL Solar Amphitheater at Bayfront Park? Guests are permitted to bring in one (1) factory sealed bottle of water, up to one gallon in size. This policy is subject to change based on artist requests or safety considerations. Aluminum bottles and refillable plastic water bottles are permitted. Camelbacks are not permitted. Refill bottles and cups (no glass & must be empty) for FREE at our water refill station, located in the Main Crosswalk. We also provide two Water Monster jugs for quick and easy access.. Water fountains are available outside of the restrooms. What items do you allow in FPL Solar Amphitheater at Bayfront Park? We allow: Clear plastic, vinyl or PVC tote bags n larger than 12\" x 6\" x 12\" and/or small clutch bags (6”x 9”). Cameras – nonprofessional only, no detachable lenses Food – in a clear, 1-gallon ziplock bag Water – up to 1 gallon in a factory sealed or empty bottle Blankets How do sponsorships work? All sponsorship inquiries should be directed to our office- please call (561) 795-8883 and ask to speak with someone in sponsorship. Any handouts or presence on site needs to be cleared with venue sponsorship. If you do not have permission to be on site you will be escorted off property. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://specialevents.livenation.com/venues/fpl-solar-amphitheater-at-bayfront-park",
      "text": "FPL Solar Amphitheater at Bayfront Park | Miami Event Venues | Live Nation Special Events Javascript must be enabled for the correct page display Skip to Content menu home venues events services about press blog Privacy Policy Terms & Conditions search search opener Submit LiveNation special events p l a n y o u r e v e n t p l a n y o u r e v e n t Work (310) 360-3077 Fax (310) 360-3077 Contact Us national sales icon mail plan your event background image Menu Details Gallery Spaces Exclusives Services FAQs Contact FPL Solar Amphitheater at Bayfront Park LEGENDARY VENUE, EPIC EVENTS! Featuring outdoor setting and soaring views, FPL Solar Amphitheater at Bayfront Park is the perfect location for your next conference, corporate event, fundraiser, private concert or graduation. With access to the world’s greatest musical entertainment, state-of-the-art lighting and sound, custom menus and mixology, our talented staff handles every detail, so you don’t have to. Accommodating up to 8,500 guests, and located less than a mile from downtown Miami, 5.5 miles from Miami Beach Convention Center and 8.1 miles from the airport, this unique venue will exceed expectations. view venue one sheet Venue Space Overview Amphitheater Lawn Venue Space Overview Previous Next Venue Space Overview Featuring flexible event space and accommodating up to 8,500 guests, FPL Solar Amphitheater at Bayfront Park features an open-air amphitheater and lawn, making this venue the perfect atmosphere that celebrates extraordinary hospitality and service. View Venue Capacities Amphitheater Amphitheater The flexible amphitheater is ideal for event of every description that features state-of-the-art lighting and sound system and large bars that are sure to wow every guest. Take your event center stage on the elaborate stage or utilize the lower seating that repurposes it to open floor plan, perfect for a private dinner, award ceremony or business meeting. View Venue Capacities Lawn Lawn FPL Solar Amphitheater at Bayfront Park's spacious lawn offers endless possibilities for planning the perfect outdoor event. Accommodating up to 5,828 guests and close-up views of the stage, this versatile space is perfect for events of all occasions including conference, corporate event and company picnics. View Venue Capacities × venue capacities location reception banquet theater Amphitheater - - 2,672 Lawn 5,803 - - Full Venue 8,500 - 2,697 event types url corporate events Make your corporate event the talk of the town. Host an exclusive roundtable meeting or company reception in a unique setting that offers custom culinary experiences and mixology with unparalleled event services. Learn More Learn More url Company Picnics Bring your team together at one of our outdoor event venues and spacious amphitheaters. Elevate your company events, company picnics, employee gatherings or daytime meetings to the next level with an outdoor setting. Learn More Learn More url FILMING & PHOTOSHOOTS Make your vision a reality! Plan your next photoshoot with Live Nation Special Events. Our versatile venues and photoshoot locations curate a unique setting. Our venues offer sound and lighting to enhance your next filming location. Learn More Learn More url private concerts Amplify your event experience at our venue with a private concert featuring world-renowned artists, full-service event production and state-of-the-art lighting and sound. Learn More Learn More url FUNDRAISERS & GALAS Live Nation Special Events is ready to amplify your next fundraiser, gala, charity concert or non-profit event at our private event venues. Our experienced event team can assist with producing large-scale fundraisers allowing you to focus on your cause. Learn More Learn More url Social Gatherings Celebrate your social events in style! Whether you are gathering guests for a stylish dinner or hosting a celebratory function – our talented staff is here to handle every detail from custom menus, hand-crafted cocktails, décor, themes and entertainment that fits any occasion. Learn More Learn More url Convention Receptions Whether you're planning a welcome party, closing reception, VIP luncheon or conference after-party, our reception halls, conference spaces, and our full-service event production will elevate your guests’ experience. Learn More Learn More url Holiday Parties Rock out during the holidays with Live Nation Special Events! From lively company parties to festive private gatherings and themed events, let us create holiday memories that last a lifetime. Host the most iconic party of the season at the best locations and event venues. Learn More Learn More url UNIQUE WEDDINGS Celebrate your love story with us! Our one-of-a-kind event spaces offer a memorable backdrop from custom floral centerpieces and gorgeous accents to the post-wedding champagne brunch with decadent sweets. Let our wedding specialists make your special occasion one to remember. Learn More Learn More world-renowned artist packages From headlining artists to local talent and keynote speakers, Live Nation Special Events provides unlimited access to entertainment and our in-house team can assist you with producing large-scale events, including booking local bands, DJs headlining artists, or keynote speakers. learn more amenities Food & Beverage Custom Menus & Offerings Craft Beer Bars & Mixology Traditional & Unique Presentations Exclusive Culinary Partners Entertainment & Production Personalized Event Planning Full-Service Event Production Unlimited Entertainment Access State-of-the-Art Lighting & Sound Event Enhancements Experiential Branding Video Mapping Interactive Entertainment Creative & Customized Décor exclusive offers url making corporate cool Get down to business at one of our legendary venues! Host your next meeting or event with us and receive a complimentary coffee station. Learn More Learn More url make your vision a reality Take your event to the next level! Host your event and receive up to $500 in credit for event enhancements. Learn More Learn More url rock your wedding Celebrate your love story with us! Book your ceremony or reception with us and receive a complimentary confetti cannon blast. Learn More Learn More join our newsletter I'd like to receive special events updates from FPL Solar Amphitheater at Bayfront Park. Plus, get highlights and exclusive offers from Live Nation Special Events. sign up FAQs What event spaces are available to rent for meetings or private events? FPL Solar Amphitheater at Bayfront Park offers a variety of event spaces that can accommodate different capacities for your next meeting or private event. This allows you to choose the space that best fits your event's size and needs from Amphitheater, and Lawn. What event services can I expect, including catering and vendor partnerships? We offer exceptional full-service event planning services with an experienced in-house team and established partnerships with premier vendors. Our event planning team will handle every detail including world-renowned artists packages, décor, custom branding, state-of-the-art lighting, A/V equipment and sound. Let our culinary experts create an unparalleled dining experience with custom catering menus and bar packages. Contact us today to learn more about our services and how we can make your event a one-of-a-kind experience. Can the venue team book entertainment, bands, DJs, and keynote speakers for my event? Yes, FPL Solar Amphitheater at Bayfront Park's in-house venue team has relationships with a variety of artists and DJs that they can recommend for your unique event. Live Nation is the largest entertainment company in the world, which gives us access to an extensive network of world-renowned artists and keynote speakers. What parking options are provided by the venue? FPL Solar Amphitheater at Bayfront Park's event team can provide parking and valet options for your meeting or private event when applicable. We recommend contacting us directly for more information on parking and availability. Our team is happy to assist you with any questions regarding parking arrangements. Is this venue accessible to those with disability needs? FPL Solar Amphitheater at Bayfront Park prioritizes accessibility and strives to make our venue accessible to everyone. If you have specific accessibility needs, inform our event specialists in advance with your requirements and the date assistance will be needed. On the day of the event, our staff will be ready to support you. Contact us today to learn more about our accessibility options and how we can ensure your experience is inclusive and enjoyable. What is the event scheduling process, and how early should I start planning? Don't miss out on securing your preferred dates, contact us today to start planning! Whether you need to plan a corporate event, daytime meeting, filming, photoshoot, fundraiser, and private concert, our event specialists are here to assist you. While we can accommodate quick turnarounds, it's always best to book as soon as possible to ensure your desired date is available. Our team will help schedule a site tour and provide a comprehensive overview of our venue's floor plans, amenities, event venue specs, and address any inquiries you may have. As the leading provider of live entertainment, we are committed to efficiently working with you to create a successful event. Contact FPL Solar Amphitheater at Bayfront Park 301 N. Biscayne Blvd., Miami, FL 33132 fplsolaramphitheaterbayfront.com work 305.938.2517 @bayfrontparkmiami @BayfrontParkMIA @bayfrontparkmia Explore Nearby Venues special event inquiries National Sales LiveNation special events SpecialEvents@livenation.com work 310.360.3077 facebook instagram linkedin copyright © 2025 live nation all rights reserved read our privacy policy or terms & conditions Do Not Sell or Share My Personal Information venues by close prev step personal details event details next step let's gather some info. Please fill out the form below to get started. First Name Last Name Your email Your number Get special events updates, highlights and exclusive offers from Live Nation Special Events. Please fill out the required fields. continue By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy and a bit more information. We will be in touch shortly. First Name Last Name Your number Your email Event Type Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military/Government Religious Tour & Travel Other How did you hear about us? Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other + Please fill out the required fields. Please complete the Captcha to proceed. submit or go back Select venue(s) from below Select a State Select a State Multi-Venue Arizona California Colorado Connecticut D.C. Delaware Florida Georgia Illinois Indiana Kentucky Louisiana Massachusetts Maryland Michigan Minnesota North Carolina Nevada New York Ohio Pennsylvania South Carolina Texas Wisconsin Utah Vancouver, BC venues input Please select at least one venue to proceed. submit or go back Thank you. Not to brag but... press & clients Back to top close By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/visit",
      "text": "Visiting FPL Solar Amphitheater at Bayfront Park: Parking, Amenities, Frequently Asked Questions Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Where The Music's At Get Here FPL Solar Amphitheater at Bayfront Park is located at 301 N Biscayne Blvd., Miami, FL 33132. Directions Pick Your Parking FPL Solar Amphitheater has partnered with ParkWhiz to offer easy and reliable options. Click HERE to book parking through ParkWhiz. View All Upgrades Drinks Skip the preshow rush and sip with us! This season we’re serving up even more drink options with every fan in mind. Learn More Accessibility FPL Solar Amphitheater at Bayfront Park strives to ensure that all of our guests have a great time at our venue. If you need additional assistance while you are here, please make sure you let us know. Learn More The Need-To-Know Before You Go We're thrilled to welcome you beneath the Miami skyline! Before your arrival, make sure to check out what to expect during your visit to FPL Solar Amphitheater at Bayfront Park. Learn More Venue Map Get lost in the music. Not the venue. FPL Solar Amphitheater at Bayfront Park is a vibrant piece of Miami's downtown, so here’s a map to help you get around. Download FAQ How can I contact FPL Solar Amphitheater at Bayfront Park? Venue Phone number – (305) 358-7550 What is your bag policy? To reduce staff contact with guest belongings, we have implemented the following bag policy: we will allow clear plastic, vinyl or PVC tote bags no larger than 12” x 6” x 12” and/or small clutch bags (6”x 9”). Can I rent a lawn chair? Lawn chairs are available for rent for most shows and must be turned in at the end of the event. Our rental chairs are 27.6” wide X 27.6” deep X 30.5” tall. No other chairs are permitted inside the venue. To rent a lawn chair in advance, click here. How is traffic control around FPL Solar Amphitheater at Bayfront Park? Traffic is controlled by local law enforcement. If there are any major traffic issues that will impact the start of the event we will post this information on our social media pages. Do you have a lost and found? If you lose an item while you are at an event - you can visit the Bayfront Park Management Trust office to see if it has been turned in or by calling them at (305) 358-7550. What are your will call protocols? Will call tickets are available for pickup at the box office located on the south side of the venue on show days only beginning at 12pm. Please make sure that you have a photo ID matching the purchasers name to pick up tickets. Any name changes need to go through Ticketmaster Customer Service- 800-653-8000. Guests are not permitted to put tickets in will call for other guests to pick up. You will need to arrange to meet your party at the facility to deliver tickets. If tickets or passes are being left for you- they will only be left at the box office. This includes meet and greet passes, backstage passes, press passes, and tickets from the tour or other promotional company. We do not get these tickets until the day of the event close to doors so please do not try to pick them up earlier. If your tickets/passes are not in will call you will need to contact the person that left them for you to determine where they are. The box office cannot contact any member of the tour for you. What is your camera policy? SUBJECT TO CHANGE - The standard venue policy allows camera phones, disposable cameras, and small digital cameras. Any camera that has a detachable lens will be considered professional and not allowed in. If the camera lens zooms out of the camera more than 1 in- it will be considered a professional camera and will not be allowed in. Some artists do not permit cameras so please check back for the show you will be attending to ensure that we will be allowing cameras in. Is smoking permitted? Smoking is not permitted in the seated area (e-cigarettes and vaping included). Guests may smoke on the lawn or on the crosswalks on top of the lawn. If another guest complains about the smoke, we may ask you to refrain from smoking or move to another location. We appreciate your cooperation. Can I bring water into FPL Solar Amphitheater at Bayfront Park? Guests are permitted to bring in one (1) factory sealed bottle of water, up to one gallon in size. This policy is subject to change based on artist requests or safety considerations. Aluminum bottles and refillable plastic water bottles are permitted. Camelbacks are not permitted. Refill bottles and cups (no glass & must be empty) for FREE at our water refill station, located in the Main Crosswalk. We also provide two Water Monster jugs for quick and easy access.. Water fountains are available outside of the restrooms. What items do you allow in FPL Solar Amphitheater at Bayfront Park? We allow: Clear plastic, vinyl or PVC tote bags n larger than 12\" x 6\" x 12\" and/or small clutch bags (6”x 9”). Cameras – nonprofessional only, no detachable lenses Food – in a clear, 1-gallon ziplock bag Water – up to 1 gallon in a factory sealed or empty bottle Blankets How do sponsorships work? All sponsorship inquiries should be directed to our office- please call (561) 795-8883 and ask to speak with someone in sponsorship. Any handouts or presence on site needs to be cleared with venue sponsorship. If you do not have permission to be on site you will be escorted off property. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://bayfrontparkmiami.com/contact/",
      "text": "CONTACT – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu CONTACT All rental inquiries for the FPL Solar Amphitheater at Bayfront Park should be directed to Live Nation at: josephnieman@livenation.com . For all other booking information , please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com . Parks are open from 7:00 am a 10:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event. CONTACT All rental inquiries for the FPL Solar Amphitheater at Bayfront Park should be directed to Live Nation at josephnieman@livenation.com . For all other booking information , please contact our Events Coordinator Parks are open from 7:00 am a 10:00 pm daily. Office Hours: Monday to Friday from 8:00 AM to 6:00 PM, closed on Saturdays and Sundays Unless there is a Special Event. FOLLOW US Park Locations For more information please write to: info@bayfrontparkmiami.com For all other booking information Please contact our Special Event Manager Santravia Butler: sbutler@miamigov.comcom 305.358.7550 Park Locations For more information please write to: info@bayfrontpark.com For all other booking information Please contact our Special Event Manager Santravia Butler email: sbutler@miamigov.comcom 305.358.7550 FOLLOW US Bayfront Park Miami 301 Biscayne Blvd, Miami, FL 33132 Maurice A. Ferré Park 1075 Biscayne Blvd, Miami, FL 33132 HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/",
      "text": "FPL Solar Amphitheater at Bayfront Park Tickets & Schedule | Miami Concert Venue Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Miami's stage by the Bay! View Shows Stage Dive In Headline Acts Quevedo - Buenas Noches USA Tour Sat Nov 15, 2025 Buy Tickets More Info Sat 15 Nov Quevedo - Buenas Noches USA Tour 2026 Premium Season Tickets Wait List Thu Dec 31, 2026 Buy Tickets More Info Multi Day 31 - 31 Dec 2026 Premium Season Tickets Wait List Quevedo - Buenas Noches USA Tour Sat Nov 15, 2025 Buy Tickets More Info Sat 15 Nov Quevedo - Buenas Noches USA Tour 2026 Premium Season Tickets Wait List Thu Dec 31, 2026 Buy Tickets More Info Multi Day 31 - 31 Dec 2026 Premium Season Tickets Wait List See More Shows Amp Up Your Experience Fast Lane Access Embrace Miami time—but do it right. Fast Lane Access lets you skip the lines, ensuring you won’t miss a single moment of the show here at FPL Solar Amphitheater at Bayfront Park! View Upgrade Lawn Chair Comfort Coming to the Lawn? Forget the hassle of lugging your own chair. Settle into our cup-friendly lawn chairs. Just reserve, pick up on arrival, and relax into the show! Rent Now Blanket Bliss Reserve a Live Nation Blanket, pick it up with your ticket, and it’s yours to keep! Reserve Now One Stage. Countless Memories. Charlie Puth | May 31, 2023 LIVE EXPERIENCE Gave fans an unforgettable glimpse into the creative process behind his renowned hits! Rüfüs Du Sol | October 23, 2022 SOLD OUT Wrapping up their tour in the heart of Miami to a sold-out audience! Their dynamic performance under the city lights made for an unforgettable evening. Jack Harlow | October 14, 2022 COME HOME THE KIDS MISS YOU A full crowd at FPL Solar Amphitheater enjoyed Jack Harlow's hits in Bayfront Park! Dua Lipa | June 12, 2018 SOLD OUT Dua Lipa dazzled fans with a stunning performance on the bay! Queens of the Stone Age | May 2, 2018 A ROCKERS' RAVE Queens of the Stone Age rocked Bayfront Park with a high-energy blend of lights and riffs that had Miami dancing. In Collab With Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/drinks",
      "text": "Discover the drink options at FPL Solar Amphitheatre Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Drinks Shaker Cup Cocktails Shaken to perfection and filled with juicy, vibrant flavors like Strawberry Vodka Lemonade or Prickly Pear Margarita, Shaker Cup Cocktails are an essential concert accessory. Made with Owen’s Craft Mixers and sealed with a spill-proof lid to keep the good vibes flowing, no matter how wild the night gets. Liquid Death Liquid Death will not kill you. But make no mistake, our infinitely recyclable cans of premium low-calorie beverages will absolutely murder your thirst. And it doesn't stop there. After twerking on your thirst's grave, these ruthless cans will actually donate a portion of the proceeds to help kill plastic pollution. Beverages include: Mountain Water, Soda-Flavored Sparkling Water, and Iced Teas. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://bayfrontparkmiami.com/bayfront-park-2/",
      "text": "HOME – BAYFRONT PARK MIAMI Skip to content HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT Main Menu WELCOME TO BAYFRONT PARK MIAMI Welcome to the Park Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. READ MORE Welcome to the Park Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. READ MORE UPCOMING EVENTS Looking for an exciting activity today, tonight, or this weekend? Look no further than Bayfront Park and Maurice A Ferré Park, where you can always find something enjoyable for you and your family. From outdoor concerts to free Yoga classes and holiday parties, there’s a variety of entertaining events to choose from. Make sure to check back regularly as we continually update our offerings. Get ready for a fantastic and memorable experience! For all other booking information Please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com 09 September Bayfront Park Free Yoga Via Zoom Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail 10 September Bayfront Park Yoga Classes by Donation Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail No event found! Introducing Our New Initiative : Bayfront Park Newsletter! SUBSCRIBE Leave this field empty if you're human: UPCOMING EVENTS Looking for something to do today, tonight, this weekend? at Bayfront Park and Maurice A Ferré Park you can always find something fun for you or the whole family. Outdoor concerts, free Yoga classes, holiday parties and more. Check in often as we are adding new events. For all other booking information Please contact our Special Event Manager Santravia Butler at: sbutler@miamigov.com 09 September Bayfront Park Free Yoga Via Zoom Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail 10 September Bayfront Park Yoga Classes by Donation Evento recurrente 301 Biscayne Blvd, Miami, FL 33132 Facebook Twitter Linkedin Email View Detail No event found! THE PLACES FPL Solar Amphitheater at Bayfront Park is located within Bayfront Park and is managed and operated by Live Nation. It reopened in August of 2009 after a multi-million dollar renovation that included permanent reserved seats; new, picturesque sightlines to Biscayne Bay; a new superior roof structure; state-of-the-art production capabilities; VIP boxes with table service and VIP parking; permanent, new restroom facilities; expanded concessions, and more. In 2020, the new FPL Solar Amphitheater at Bayfront Park was completed, which has 500 solar panels. The canopy-like solar structure covers nearly 400 feet of walkway around the venue. The Bayfront Park Amphitheater has been renamed the FPL Solar Amphitheater at Bayfront Park. The solar panels double as a research facility and showcase Miami’s commitment to sustainability. Also included in the 500-panel solar installation are seven solar trees located around the park. The solar canopy and trees feature LED lighting that illuminate the venue at night and can be programmed to change colors to coincide with special events. The Bayfront Park Amphitheater is framed within the majesty and beauty of Miami's Central Park, it can hold up to ten thousand people, with 2500 fixed seats and an additional 7300 on the lawn. Get ready to be captivated by world-class performances in a truly exceptional setting! FPL solar AMPHITHEATER Discover the charming playground located at the southern end of the park, right next to the Tina Hills Pavilion. Hours: Daily from Sunrise to Sundown Adults are only allowed in the play area when accompanied by children under 12. The Lee & Tina Hills features the latest in playground design, including rubber safety surfacing, and a unique play sculpture. In addition, there are benches and trash receptacles adjacent to the playground. The “play sculpture,” crafted by Cemrock Landscapes, Inc., depicts a rising wave and features a dolphin, a turtle, and a manatee. This “made to order” sculpture was created to showcase the marine animals typical to the waters of Miami. The sculpture is suitable for children ages 5-12 Play scultpture featuring manatee and a turtle “play sculpture,” crafted by Cemrock Landscapes, Inc., depicts a rising wave and features a dolphin, a turtle, and a manatee. In addition, some of the playground features include a pirate ship, bouncers, and a “supermax” structure which includes slides and several climbing apparatuses.Playground slide and climbing Playground climbing net Playground pirate ship. Explore this amazing playground and create long lasting memories. The LEe & TINA HILLS playground The The Tina Hills Pavilion, located within the park, is a versatile venue for a range of events. With a capacity of 1,000, it accommodates intimate concerts, receptions, corporate functions, and press conferences. The pavilion offers fixed seating for 200 guests and lawn seating for 800, providing flexible arrangements. Its open-air design allows for a captivating experience, whether facing the stage or enjoying the picturesque views of Biscayne Bay. Discover this exceptional venue for your next gathering or performance, and create memorable moments for the whole family. Pavillion TINA HILLS MEET THE PARK MEET THE PARK HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT HOME EVENTS Menu Toggle PLAN YOUR VISIT PAST EVENTS BOARD MEETINGS Menu Item PARKS Menu Toggle BAYFRONT PARK MAURICE A. FERRÉ PARK ABOUT Menu Toggle HISTORY INSTAGRAM POSTS RULES AND REGULATIONS FREQUENTLY ASKED QUESTIONS PRESS RELEASE CONTACT 301 North Biscayne Boulevard Miami, Florida 33132 305-358-7550 bayfrontparkmiami.com For more information please write to: info@bayfrontparkmiami.com Park operating hours from 7:00 am to 11:00 pm daily. Office Hours: Monday to Friday from 9:00 AM to 5:30 PM, closed on Saturdays and Sundays Unless there is a Special Event SUBSCRIBE Leave this field empty if you're human: Copyright © 2025 BAYFRONT PARK MIAMI | Powered by [FULLCO Studio] BAYFRONT PARK RULES AND REGULATIONS MAURICE A. FERRÉ PARK RULES AND REGULATIONS PARK HOURS: 7:00 a.m. to 10:00 p.m. Please keep the Park clean by not damaging the Park or its furnishings. Use of the Park and its amenities shall be used for its intended use and safely. Benches are strictly intended for sitting and NOT sleeping or laying down. Park sculptures and monuments are meant to be viewed and enjoyed. Please do not touch, sit, climb, nor deface any public art or monument. No aggressive or threatening behavior is allowed in the Park, including aggressive panhandling or soliciting. ONLY Trust authorized vehicles are allowed in the Park. No skateboarding or other motorized vehicles are allowed in the Park. No fires, hunting nor molesting wildlife are allowed in the Park. No littering or dumping personal belongings. Deposit trash in trash containers. No camping nor use of temporary structures, such as tents, chairs, hammocks or card board are allowed in the Park. No swimming, no fishing, nor solicitation without a Bayfront Park Management Trust issued permit in the Park. No Consumption of alcoholic beverages unless a special permit is obtained from Bayfront Park Management Trust. All commerce, advertising, vending, or business must be approved by Bayfront Park Management Trust. All docking, launching, or landing of a vessel requires a permit from Bayfront Park Management Trust. Any organized activity, event, or gatherings, such as photoshoots and video shoots require a permit from Bayfront Park Management Trust. No drones are allowed in the Park unless authorized by Bayfront Park Management Trust. All dogs must be on a leash and dog owners are responsible for picking up any waste, as well as any damage caused to the Park by owner’s dog. Any Park visitor found violating park rules will be removed from the premises and           enforced by Bayfront Park Security and City of Miami Police. For Permits and inquiries, please contact our Bayfront Park office: 305-358-7550 or at info@bayfrontparkmiami.com . THANK YOU FOR VISITING, COME AGAIN SOON! The above rules are detailed in Chapter 38 of the City of Miami Code; and enforced by Bayfront Park Staff, Bayfront Park Security, and City of Miami Police CLOSE STOP HUMAN TRAFFICKING CLOSE WELCOME TO MAURICE A. PARK Maurice A. Ferré Park has transformed into an open-air museum, boasting spectacular venues in close proximity to the bay, where breathtaking outdoor events take place. It offers magnificent views not only of Biscayne Bay but also the downtown Miami skyline, making it a privileged location for unforgettable gatherings. The park’s surroundings feature stunning artwork showcased along the Dogs and Cats Walkway, as well as an extraordinary area housing the Jiménez Deredia exhibition, which will be available throughout the entire year. Formerly called Museum Park, the 21-acre Maurice A. Ferré Park is home to the Peréz Art Museum Miami and the Patricia and Phillip Frost Museum of Science. Located north of AmericanAirlines Arena, this park is considered an extension of Bayfront Park. It sits right on Biscayne Bay and has an outdoor amphitheater, grassy areas, walking and biking baths and Plaza de la Marina Española (Spanish Navy Plaza), a monument that honors the Spanish Navy and its arrival in the Americas on October 12, 1492. X WELCOME TO BAYFRONT PARK Bayfront Park, originally called Royal Palm Park, is the oldest public gathering space in the Greater Miami community. Established in 1896, it started with a pavilion and green space used for sports activities. Over the years, it expanded to include a bandshell and became a venue for various events. Today, Bayfront Park spans 32 acres in Downtown Miami, offering stunning views of Biscayne Bay. It features open lawn spaces, a seaside path, sandy beach area, performance venues, VIP seating, tropical rock garden, and a historic waterfall from 1926. Discover a peaceful oasis tucked away in the heart of Miami. It’s the perfect place to relax, explore, and enjoy unhurried walks. Whether you’re having a picnic or participating in outdoor activities, this captivating park invites you, with its stunning waterfront views and expansive green spaces, to escape the bustling city and immerse yourself in the tranquility of nature. X Scroll to Top"
    },
    {
      "url": "https://spotlightsolar.com/bayfront-park-project",
      "text": "Bayfront Park project — Beautiful Solar Structures | Spotlight Solar 0 Skip to Content Home Products Projects More About Blog Press Get news Contact Quote Open Menu Close Menu Home Products Projects More About Blog Press Get news Contact Quote Open Menu Close Menu Home Products Projects Folder: More Back About Blog Press Get news Contact Quote Project overview Miami made a statement for the Super Bowl and for the future - showing it’s an environmental champion with beautiful solar structures around the city. There are 28 striking solar “trees” where millions of people can see them. This is especially true at Bayfront Park, a Live Nation venue which hosts performances year-round, including Ultra and many Super Bowl 54’s pre-game events. We even made solar effective (for encouraging people to use solar themselves) at night! Spotlight Solar exists to make solar more visible, so more people will embrace it. We are thrilled by this opportunity to bring solar to center stage for so many people. Click on pictures below to see larger ones Specifications Energy stewardship -- Bayfront Park has 500-panel solar installation, including solar trees, which generates about 250 kilowatts of emissions-free energy – more than the power used during the amphitheater’s concert season. FPL, a lead partner in the project, is bringing 30 million solar panels into service by 2030. Visible solar -- 7 Spotlight Solar Lift structures at Bayfront Park, a custom curved canopy by Lumos Solar, 21 other solar trees around Miami. Exposure -- Estimated 600,000 visitors to pre-Super Bowl, and millions more Miami residents and visitors. Certified Integrator -- SEM Power Press, impact Bayfront Park got a green makeover right in time for Ultra and the Super Bowl Party under the Panels: FPL Solar Installation Takes Center Stage at Bayfront Park in Advance of Big Game “By day, the solar canopy and trees produce renewable energy and advance our sustainability mission. And, when the sun goes down, the array’s colorful lights add a new dynamic to Miami’s iconic skyline.” - Joe Carollo, Miami Commissioner “This is an exciting time for Bayfront Park. We’re thrilled to be able to help support the growth of renewable energy in Florida and to showcase this great sustainable technology to concert-goers.” - Joseph Nieman, Director, Live Nation Venues and FPL Solar Amphitheater General Manager “With hundreds of thousands of football fans descending on our community and millions more worldwide tuning in for the big game, the FPL Solar Amphitheater showcases the bold, innovative spirit of Miami and the city’s relentless commitment to sustainability and resiliency.” - Eric Silagy, CEO, FPL View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize Get updates Request a Quote Contact Spotlight Powered by Squarespace"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/private-events",
      "text": "FPL Solar Amphitheater at Bayfront Park: Multi-Use Venue for Private Events in Miami Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Make FPL Solar Amphitheater at Bayfront Park Yours Featuring outdoor setting and soaring views, FPL Solar Amphitheater at Bayfront Park is the perfect location for your next conference, corporate event, fundraiser, private concert or graduation. With access to the world’s greatest musical entertainment, state-of-the-art lighting and sound, custom menus and mixology, our talented staff handles every detail, so you don’t have to. Accommodating up to 8,500 guests, and located less than a mile from downtown Miami, 5.5 miles from Miami Beach Convention Center and 8.1 miles from the airport, this unique venue will exceed expectations. Let’s plan your event First name * Last name * Email * Phone number * Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military / Government Religious Tour & Travel Other Event type Event date Company name Number of attendees Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other How did you hear about us? Promo code Get special events updates, highlights and exclusive offers from Live Nation Special Events. Submit This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Contact our Sales Team Phone : 305.938.2505 Email : fplsolarampevents@livenation.com Address : 301 N Biscayne Blvd, Miami, FL 33132 One-Sheet Capacities More Details Event Spaces NightSkyline Venue Aerial VenueBack Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.fplsolaramphitheaterbayfront.com/know-before-you-go",
      "text": "Plan Your Visit: Parking, Amenities & Policies | FPL Solar Amphitheater at Bayfront Park Skip to content Shows Upgrades Visit Get Here Pick Your Parking Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … The Need-to-Know Before You Go We can’t wait to see you at FPL Solar Amphitheater At Bayfront Park! DAY OF SHOW INFO: Vampire Weekend 'Only God Was Above Us' Tour Part 2 with Turnstiles - Friday, June 13 Box Office opens: 2:00PM Doors open: 6:00PM Show start: 7:00PM *Keep an eye on our website and social media handles, as guidelines are subject to change!* Here’s what to expect when you visit us: BAG POLICY: Only small clutches, wristlets or fanny packs no bigger than 6\" x 9\" OR clear plastic bags no bigger than 12\" x 12\" x 6\" will be allowed inside the venue. All bags are subject to search upon entry. Guests have the right to refuse a bag search and the venue has the right to refuse entry. If you have any items that are not allowed into the venue please return them to your vehicle. COME RAIN AND/OR SHINE: The show will go on whatever the weather. Unless it’s looking extra gnarly. Check our socials for any changes. WHEN YOU GET HERE: You know the drill—metal detectors, maybe a pat down, and a bag check if you’ve got one. Items ALLOWED to be brought in to venue include, but not limited to: Blankets Cameras - Nonprofessional only, no detachable lenses Food - In a clear, 1-gallon ziplock bag Water - Up to 1 gallon in a factory sealed or empty bottle Umbrellas- Small/parasol MOBILE ENTRY: Your phone is your ticket. Before you set off, download your tickets to your phone on the Live Nation app. More info on mobile tickets here . Phone troubles? Visit the box office on event day for assistance. Be prepared to show your ID. CONTACTLESS PAYMENTS ONLY: We’re a cash-free venue. If you arrive without a debit or credit card, head to a Guest Services booth and they’ll exchange cash for card (for free). BOX OFFICE: Open on show days only. The West Box Office opens at noon, the East Box Office opens about an hour prior to doors. The box office is cashless and only accepts credit or debit cards. THE MERCH: Find that coveted merch at our Concert Gear booths in the east and west plazas. For some events, you’ll find extra booths located throughout the venue. DESIGNATED DRIVERS: Are you the responsible fan tonight? Our concessionaire offers a free fountain soda to guests that commit to be the designated driver for their party. Please visit the designated driver booth located at our Guest Service booths in the east and west plazas. RECYCLING: You’ll find recycling bins throughout the venue. HYDRATION: Refill bottles and cups (no glass & must be empty) for FREE at our water refill station, located in the Main Crosswalk. We also provide a Water Monster jug for quick and easy access. Guests are permitted to bring in one (1) factory sealed bottle of water, up to one gallon in size. This policy is subject to change based on artist requests or safety considerations. Aluminum bottles and refillable plastic water bottles are permitted. Camelbacks are not permitted. Water fountains are available outside of the restrooms. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch FPL Solar Amphitheater at Bayfront Park 301 N Biscayne Blvd Miami, FL 33132 fplsolarampevents@livenation.com 305.358.7550 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    }
  ]
}