{
  "fuentes": [
    {
      "url": "https://business.stuartmartinchamber.org/members/member/frazier-creek-brewing-distilling-co-15219",
      "email": "info@stuartmartinchamber.org"
    },
    {
      "url": "https://www.fraziercreekstuartfla.com/calendar",
      "email": "info@fraziercreekstuartfla.com"
    },
    {
      "url": "https://www.wptv.com/news/region-martin-county/stuart/stuarts-frazier-creek-brewery-and-distilling-company-wins-usa-todays-10best-for-best-new-brewery",
      "email": "erin.sadler@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-martin-county/stuart/stuarts-frazier-creek-brewery-and-distilling-company-wins-usa-todays-10best-for-best-new-brewery",
      "email": "meghan.mcroberts@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-martin-county/stuart/stuarts-frazier-creek-brewery-and-distilling-company-wins-usa-todays-10best-for-best-new-brewery",
      "email": "sbilling@wptv.com"
    }
  ],
  "mails": [
    "erin.sadler@wptv.com",
    "info@fraziercreekstuartfla.com",
    "info@stuartmartinchamber.org",
    "meghan.mcroberts@wptv.com",
    "sbilling@wptv.com"
  ],
  "nombre_sitio": "fraziercreekstuartfla.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://business.stuartmartinchamber.org/members/member/frazier-creek-brewing-distilling-co-15219",
      "text": "Frazier Creek Brewing & Distilling Co. | Restaurants and Nightlife | BREWERY/DISTILLERY | COCKTAILS/WINE/BEER Skip to content --°F Member Login Join Chamber The Chamber Close The Chamber Open The Chamber About Us President’s Report Membership Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship Vubiz Trains Events & News Close Events & News Open Events & News Upcoming Events Chamber Calendar Community Calendar Chamber Event Flyers Latest News Chamber & Member News Online Compass Florida Chamber News Legislative Updates Photo Galleries Breakfasts Luncheons Business After Hours Annual Expos Holiday Trade Show Installation of Officers LEADERship Ribbon Cuttings Golf Tournaments Special Events Business Close Business Open Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Close Tourism Open Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Close Relocation Open Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide The Digital Times Recreation Close Recreation Open Recreation Things to Do Boating Diving and Snorkeling Golf Courses Beaches and Parks Fish & Hunt Fishing Report Sailfish Tournaments Fishing Guide Frazier Creek Brewing & Distilling Co. Categories Restaurants and Nightlife BREWERY/DISTILLERY COCKTAILS/WINE/BEER 973 S.E. Federal Highway Stuart FL 34994 (772) 672-7882 Send Email Visit Website Hours: Mon - Thurs 2pm - 10pm Fri 12pm - 11:30pm Sat 11am - 11:30pm Sun 11am - 10pm Driving Directions: Take Kanner Hwy east to  US1/ Federal Hwy Turn South In 500 feet, turn left into Mayfair Plaza About Us Martin County’s first Brewstillery, Winery, and Cidery. Located 500 feet west of Frazier Creek in Stuart, Florida, a city originally named Potsdam with German roots, Frazier Creek Brewing & Distilling Co. adds to the city’s brewing history. Founded by passionate professional brewers and home brewers, our love for sharing the highest quality libations drives our craft in the brewery and distillery. Our mission is to enhance the quality of life in our community by providing the finest beers, seltzers, sodas, spirits, cocktails, specialty wines, and hard ciders by building upon the history established in beautiful Stuart, Florida. Taproom and cocktail lounge are available for event rentals and food is provided by local food trucks and delivery from local restaurants. Weekends feature entertainment with Live Music and DJs Drinks $2.50 - $250.00 Highlights Over 20 Beers always on tap made onsite! Over 10 distilled spirits available, made from scratch onsite! Cocktail lounge with craft cocktails 3,500sf Taproom Happy Hour Monday - Friday 3-6pm Images Gallery Image 20240504_185027.jpg × Gallery Image 20240426_210315.jpg × Gallery Image 20240425_202821.jpg × Gallery Image 20240504_163712(0).jpg × Gallery Image 20240504_185010.jpg × Gallery Image 20240508_222904.jpg × Gallery Image 20240512_210007.jpg × Gallery Image IMG_5125.jpg × Gallery Image 20240512_205921.jpg × Gallery Image 20240512_205902.jpg × Gallery Image 20240509_182935.jpg × News Vendor Opportunity for Oktoberfest pop-up market at Frazier Creek Brewing & Distilling Release Date: August 25, 2025 Rep/Contact Info Mr. Etienne Bourgeois × Close Mr. Etienne Bourgeois Phone: (772) 672-7882 Send an Email Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel Connect with us 1650 S Kanner Highway Stuart, FL 34994 772-287-1088 x111 info@stuartmartinchamber.org Facebook-f Twitter Youtube Linkedin-in Chamber Info Join The Chamber Member Search Member Benefits President's Report Contact The Chamber Privacy Policy News & Events Online Compass Member News Chamber Calendar Community Calendar Non-Profit Events Health Resources Newsletter Enter your email, subscribe to our newsletter and stay informed! Subscription Form Newsletter First Name Last Name Subscribe © 2025 STUART/MARTIN COUNTY CHAMBER OF COMMERCE. ALL RIGHTS RESERVED. Member Login Join Chamber The Chamber About Us President’s Report Member Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship VUBIZ Trains Events & News Chamber Calendar Community Calendar Photo Gallery Member News Chamber Event Flyers Online Compass Florida Chamber News Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide Recreation Boating Fishing and Hunting Fishing Report Sailfish Tournaments Fishing Guide Diving and Snorkeling Golf Courses Beaches and Parks Facebook-f Twitter Youtube Linkedin-in Search"
    },
    {
      "url": "https://www.fraziercreekstuartfla.com/calendar",
      "text": "Calendar Search this site Embedded Files Skip to main content Skip to navigation Home About Us On Tap! Events Calendar Merch Location Join our email list! Home About Us On Tap! Events Calendar Merch Location Join our email list! More Home About Us On Tap! Events Calendar Merch Location Join our email list! Frazier Creek Brewing & Distilling Co. promotes responsible enjoyment of our handcrafted beer and spirits. You must be 21 years of age or older to purchase or consume alcoholic beverages. Please drink responsibly. Frazier Creek Brewing & Distilling Co. | 973 SE Federal Highway, Stuart, FL 34994 FrazierCreekStuartFla.com Google Sites Report abuse Page details Page updated Google Sites Report abuse"
    },
    {
      "url": "https://www.wptv.com/news/region-martin-county/stuart/stuarts-frazier-creek-brewery-and-distilling-company-wins-usa-todays-10best-for-best-new-brewery",
      "text": "This local brewery just won USA Today's 'Best New Brewery' Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go Weather Interactive Radar Daily Forecast Hurricane Survival Guide Hourly Forecast Live Interactive VIPIR Hurricane Map Weather Cams News Local News WPTV Investigates Real Estate News Politics State National News World News Crime Education Protecting Paradise Your Health Matters Traffic Gas Prices Gas Availability Airports Entertainment WPTV Schedule, Other TV Listings Movies Life Finding Florida Shining A Light Underdog Pets Family Food News Sports Panthers Dolphins College Sports FAU Hurricanes Gators Seminoles Cognizant Classic Football Baseball Basketball Surfing Blog Recreation Sports Money Money Headlines Dont Waste Your Money Recalls Marketplace Sunshine Spotlight Home Experts In the Know Videos WPTV Livestream Player WPTV on Youtube About Us Advertise Contact Us WPTV Schedule, Other TV Listings Contests Jobs Staff Bios WHDT, South Florida's 9 How to Watch WPTV 24/7 Support Sign In Newsletters Sign Out Manage Emails Apps Careers Search WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 1 WX Alerts 1 Closings/Delays Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade More + Quick Links + Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade News Treasure Coast Region Martin County Stuart Actions Facebook Tweet Email Stuart’s Frazier Creek Brewery and Distilling Company wins USA Today's 10Best for 'Best New Brewery' RAK Brewing Co. in Frederick, Maryland, and Hot Plate Brewing Co. in Pittsfield, Massachusetts, rounded out the top three Prev Next WPTV Frazier Creek Brewery's Co-Founder Etienne Bourgeois celebrates after finding out the 'Brewstillery' in Stuart won USA Today's 10Best competition for 'Best New Brewery' March 5, 2025. By: Meghan McRoberts Posted STUART, Fla. — A Treasure Coast brewery has snagged the top spot on USA Today’s 10Best list of best new breweries in the country. 20 breweries across the country were nominated by a panel of experts for 'Best New Brewery' and readers were able to vote on their favorite, creating a top 10 list of breweries that opened in the last three years. Stuart’s Frazier Creek Brewery and Distilling Company was announced as the winner on Wednesday. WATCH: Staff, customers at Frazier Creek Brewery and Distilling Company find out they won USA Today's 10Best competition for 'Best New Brewery' Stuart’s Frazier Creek Brewery and Distilling Company wins USA Today's 10Best for 'Best New Brewery' “It’s absolutely amazing. It’s only every couple of years that a Florida brewery is nominated,\" Co-Founder Etienne Bourgeois said. \"We do have a lot of breweries in Florida, so for the focus to be on us, it’s absolutely breathtaking.\" RAK Brewing Co. in Frederick, Maryland, and Hot Plate Brewing Co. in Pittsfield, Massachusetts, rounded out the top three. USA Today made note of how Frazier Creek hosts food truck nights, bingo events, and shuffleboard to “keep you both entertained and quenched.” It is also one of the few ‘Brewstilleries’ in Florida offering both spirits and craft beer. Bourgeois said that just being nominated brought in new business. He’s excited to see the boost to his business after taking the number one ranking. “It’s huge for us. It’s huge for Stuart,\" Bourgeois said. \"It’s huge for our local brewing community. We have the Treasure Coast Wine and Ale Trail. I think it will be great for them. I think we can all prosper.” Frazier Creek is open seven days a week and is located at 973 SE Federal Highway, Stuart, FL 34994. See the full list here . Copyright 2025 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the South Florida Sports Headlines Newsletter and receive up to date information. now signed up to receive the South Florida Sports Headlines Newsletter. Click here to manage all Newsletters At WPTV, It Starts with Listening Weather Traffic News Money Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    }
  ]
}