{
  "fuentes": [
    {
      "url": "https://discoverbradenton.com/business/freckled-fin-irish-pub/",
      "email": "20admin@discoverbradenton.com"
    },
    {
      "url": "https://discoverbradenton.com/business/freckled-fin-irish-pub/",
      "email": "admin@discoverbradenton.com"
    },
    {
      "url": "https://www.florida-dreams.com/the-best-irish-pub-in-anna-maria-island/",
      "email": "rentals@florida-dreams.com"
    },
    {
      "url": "https://vfipubs.ie/contact-us/",
      "email": "enquiries@vfipubs.ie"
    }
  ],
  "mails": [
    "20admin@discoverbradenton.com",
    "admin@discoverbradenton.com",
    "enquiries@vfipubs.ie",
    "rentals@florida-dreams.com"
  ],
  "nombre_sitio": "freckledfin.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://discoverbradenton.com/business/freckled-fin-irish-pub/",
      "text": "Anna Maria Island Restaurants and Bars: Freckled Fin Irish Pub Skip to content Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Instagram Facebook Envelope Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login Explore Business Directory Explore Neighborhoods Old Manatee Historic District Village of the Arts Downtown Bradenton Events Event Calendar Add Event Shop Shop Manatee Local Offers Local Voices Blog Tips from Local Pros Business Buzz Give Back Nonprofit Directory Volunteer Opportunities North River Discover Palmetto Discover Parrish Get Featured Join the Business Network List Your Nonprofit Suggest a Listing Pitch An Article Add an Event Login send email Visit website Restaurants & Nightlife Freckled Fin Irish Pub Freckled Fin Irish Pub & Music Hall is located on Anna Maria Island and is a full-service Irish Pub. We Have 12 beers on tap with 3 rotating local selections along with Irish favorites! We also have Classic Irish dishes as well as fresh local seafood, sandwiches, salads, and more! Come see why we’re known as “The Cheers of Anna Maria Island.” We offer live music, indoor and outdoor seating, and super-friendly service! Business Hours : 11:00 am - 12:00 am Mon 11:00 am - 12:00 am Tue 11:00 am - 12:00 am Wed 11:00 am - 12:00 am Thu 11:00 am - 12:00 am Fri 11:00 am - 1:00 am Sat 11:00 am - 1:00 am Sun 11:00 am - 12:00 am Event associated with this business Bri Rivera at Freckled Fin Irish Pub December 13, 2025, 8:30 pm - 12:30 am Read more >> Dance Party w/ DJ Gator Ryan Halloween Party at Freckled Fin Irish Pub October 31, 2025, 8:30 pm - 8:45 pm Read more >> Jahrockaz Reggae Band at Freckled Fin Irish Pub November 7, 2025, 8:30 pm - 12:30 am Read more >> Kamryn Emory and Social Fabric at Freckled Fin Irish Pub October 4, 2025, 7:30 pm - 11:30 pm Read more >> Live Music with Bobby James at Freckled Fin Irish Pub October 2, 2025, 7:00 pm - 11:00 pm October 30, 2025, 7:00 pm - 11:00 pm Read more >> View all CONTACT 941-251-3930` Send Message Contact Form Demo (#20) First Name Last Name Email Subject Your Message Submit Form Address 5337 Gulf Drive STE 600 SOCIAL Facebook Instagram Video https://www.youtube.com/channel/UCVHjZQ-fShjUbGdneqsialQ 1 Reviews on “Freckled Fin Irish Pub” Excellent 5 1 reviews 5 4 3 2 1 Alexis AWESOME food. Great atmosphere. Live music, energetic staff, delicious drinks. This is a must do while visiting. Cool Irish/beach vibe July 12, 2022,\n\t\t\t\t\t\t\t1:31 pm Reply Leave a Review Cancel reply Your email address will not be published. Review text Select a rating Overall Name Email Website Save my name, email, and website in this browser for the next time I comment. Next More For You No listings were found matching your selection. Something missing? Why not add a listing? . Images Courtesy of Pablo Ortega Photography Facebook Instagram Information 1201 6th Ave W #100, Bradenton, FL 34205 Admin@DiscoverBradenton.com Meet The Founder Disclaimer cancellation form © 2025 Discover Bradenton Terms and Conditions Privacy Policy Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.florida-dreams.com/the-best-irish-pub-in-anna-maria-island/",
      "text": "Irish Pub in Anna Maria Island | Florida Dreams Skip to main content 941-462-4016 My Rentals Recently Viewed (0) Rentals Anna Maria Island Rentals View By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4+ Bedrooms View By Type Condos Homes Pet Friendly Rentals with A Pool Luxury Rentals View By Location Anna Maria Holmes Beach Bradenton Beach Bradenton All Rentals Availability Calendar Featured Properties Travel Insurance Specials Sales Our Listings Florida Dreams Real Estate MLS Search Contact an Agent Things to Do Get Ideas Activities & Attractions Events & Happenings Restaurants & Dining Sports & Outdoors 10% OFF Incentives Island Gems Property Management About About Us About Anna Maria Island Contact Us The Best Irish Pub in Anna Maria Island Though Anna Maria Island is a hidden gem in Florida, it definitely has distinct qualities that it is known for. The laid-back atmosphere is the Island’s main attraction, allowing visitors to truly get away from the hustle and bustle of daily life. AMI is full of beautiful, relaxing beaches, unique shopping opportunities, and of course, some incredible food. When you think of eating on a Florida vacation, your first thought is probably seafood; more than likely, you don’t think about having great Irish pub food. But on Anna Maria Island, one of the biggest attractions is Freckled Fin Irish Pub, an authentic European eatery in the heart of Florida and just minutes away from our vacation rentals on Anna Maria Island . History Photo from Shutterstock Freckled Fin gets its name from an old Irish legend. The story goes that, in a small island off the coast of Ireland, a mermaid was caught by a local fisherman who wanted to take her for his bride. Left alone with seemingly no other option, the mermaid agreed and gave the fishermen seven human children, the youngest of which was a daughter named Fin. Fin was very fast and fluid in the water, and her mother revealed her secret of being a mermaid. Fin left home and found a ship being lured in by sirens. She saved the captain and eventually came to the Gulf of Mexico where she met a group of humans that were supposedly the first to discover what we know of today as Anna Maria Island. The tribes nicknamed the mermaid the Freckled Fin, and she went on to save many more sailors throughout her lifetime. This rich legend has bled into the culture of the Freckled Fin Irish Pub, as it maintains the same bold and free spirit as the mermaid. Food At the Freckled Fin, you will find the perfect blend of traditional Irish grub and fresh local seafood . Shepherd’s Pie and steak on a stick are European staples, or you can try something from the sea like the Gulf Mahi Tacos or the Smoke on the Water sandwich. You’ll also find selections like poutine, nachos, salads, sandwiches, pizza, and more. Freckled Fin has an extensive drink menu, full of Irish ales as well as domestic brews, wine, and liquor. Entrees cost around $15 each, so you can get great cuisine without breaking the bank. You definitely won’t leave the Freckled Fin hungry! Entertainment Not only can you get a great meal at the Freckled Fin, but you can stick around and enjoy some great entertainment as well. Throughout the week, Freckled Fin is proud to host local musicians for you to enjoy while you eat. Just a few of their acts include Acoustic Thunder, Raw Vinyl, and Kettle of Fish. Musical acts are always being updated, so be sure to visit their website or their Facebook page for an up-to-date listing. Plan Your Visit We are proud to serve guests visiting Anna Maria, and we have rental options that will meet your every need. For more information on local restaurants and our Anna Maria Island rentals with a pool , contact us today! View All Rentals The Freckled Fin Irish Pub is located at 5337 Gulf Drive North in Holmes Beach . They’re open Sunday through Thursday from 11 a.m. until 11 p.m., and Friday through Saturday from 11 a.m. until 2 am. Book Your Anna Maria Island Rental Freckled Fin has been a staple in Anna Maria Island since 2015, and it is just one of the countless food and entertainment options you’ll find on the island. No matter what kind of cuisine you’re in the mood for, you will find it just minutes from our Anna Maria Island vacation rentals . Pet Friendly Rentals Rentals with Pools Rental Homes Recent Posts Find The Perfect Anna Maria Island Golf Cart Rental for Your Trip Check Out Motorworks Brewery During Your Anna Maria Island Vacation Enjoy the Best Shopping in Holmes Beach During Your Vacation Try These Incredible Anna Maria Island Restaurants A Brief History of Holmes Beach Newsletter Signup Email * Facebook This field is for validation purposes and should be left unchanged. Δ Florida Dreams Realty of AMI, Inc 5508 Marina Dr Unit A, Holmes Beach, FL 34217 941-462-4016 Owner Login Site Links Things to Do Activities & Attractions Events & Happenings Restaurants & Dining Sports & Outdoors About Deutsch Sales Specials Rentals A – Z Rentals Pet-Friendly Rentals Anna Maria Island Rentals with Pools One Bedroom Rentals Two Bedroom Rentals Three Bedroom Rentals Anna Maria Rentals Bradenton Beach Rentals Bradenton Rentals Email Sign Up Email * Instagram This field is for validation purposes and should be left unchanged. Δ © Copyright 2025  Anna Maria Vacation Rentals | Florida Dreams Terms and Conditions | Privacy Policy | Website Accessibility Policy Website managed by RealTech Webmasters Powered by Yapstone Inc. For disclosures and information about consumer complaints regarding your payments, please see: https://www.yapstone.com/legal/licenses ← Close Menu Rentals Anna Maria Island Rentals View By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4+ Bedrooms View By Type Condos Homes Pet Friendly Rentals with A Pool Luxury Rentals View By Location Anna Maria Holmes Beach Bradenton Beach Bradenton All Rentals Availability Calendar Featured Properties Travel Insurance Specials Sales Our Listings Florida Dreams Real Estate MLS Search Contact an Agent Things to Do Get Ideas Activities & Attractions Events & Happenings Restaurants & Dining Sports & Outdoors 10% OFF Incentives Island Gems Property Management About About Us About Anna Maria Island Contact Us Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://vfipubs.ie/contact-us/",
      "text": "Contact Us - VFI Pubs Skip to content About News Training Contact About News Training Contact Members Area Contact Get In touch today Address VFI House, Castleside Drive, Rathfarnham, Dublin 14. \nD14 N8N8 Call +353 1 492 3400 Email [email protected] Get in touch Get In Touch Name Phone Email Message I consent to having this website store my submitted information so they can respond to my inquiry. Enquire now Vintners’ Federation of Ireland VFI House, Castleside Drive, Rathfarnham Dublin 14. D14 N8N8 Tel: +353 1 492 3400 Get in touch Copyright 2025 All rights reserved. Cookie Policy Privacy Policy Terms & Conditions Cookie Policy Privacy Policy Terms & Conditions Web Design by About us News Training Contact Us Members Area About us News Training Contact Us Members Area"
    }
  ]
}