{
  "fuentes": [
    {
      "url": "https://www.frenchmansreservecc.com/public/weddings-and-banquets/private-events",
      "email": "psaylor@frenchmansreservecc.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-1024x194.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-1080x205.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-1536x292.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-2048x389.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-500x95.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x-768x146.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "ip_base-logo_ivory_@4x.png"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "email": "info@russo-group.com"
    },
    {
      "url": "https://www.pbcoastal.com/homes-for-sale-palm-beach-gardens-fl/frenchmans-reserve/frenchmans-reserve-frequently-asked-questions/",
      "email": "elatalladi@frenchmansreservecc.com"
    },
    {
      "url": "https://www.pbcoastal.com/homes-for-sale-palm-beach-gardens-fl/frenchmans-reserve/frenchmans-reserve-frequently-asked-questions/",
      "email": "membership@frenchmansreservecc.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "ajames@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "blee@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "ccooper@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "ccozma@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "ischultz@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "jcolo@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "lgarbacea@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "psaylor@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "rchiavari@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "scohn@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "sorezi@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "svecellio@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "arodriguez@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "jenglish@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "jkramer@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "kbaloyi@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "nlewis@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "pmroz@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "email": "tennis@frenchmansreservecc.com"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/john-colo-60c495.html?LayoutID=17",
      "email": "jcolo@frenchmansreservecc.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://frcharities.org/who-we-are/",
      "email": "info@frcharities.org"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/contact-us",
      "email": "membership@frenchmansreservecc.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    }
  ],
  "mails": [
    "ajames@frenchmansreservecc.com",
    "anirudh.shetye@skanem.com",
    "arodriguez@frenchmansreservecc.com",
    "beatrice.malle@skanem.com",
    "blee@frenchmansreservecc.com",
    "ccooper@frenchmansreservecc.com",
    "ccozma@frenchmansreservecc.com",
    "elatalladi@frenchmansreservecc.com",
    "info.nairobi@skanem.com",
    "info@frcharities.org",
    "info@inzmo.com",
    "info@reception-plus.de",
    "info@russo-group.com",
    "ip_base-logo_ivory_@4x-1024x194.png",
    "ip_base-logo_ivory_@4x-1080x205.png",
    "ip_base-logo_ivory_@4x-1536x292.png",
    "ip_base-logo_ivory_@4x-2048x389.png",
    "ip_base-logo_ivory_@4x-500x95.png",
    "ip_base-logo_ivory_@4x-768x146.png",
    "ip_base-logo_ivory_@4x.png",
    "ischultz@frenchmansreservecc.com",
    "jane@skanem.ke",
    "jcolo@frenchmansreservecc.com",
    "jenglish@frenchmansreservecc.com",
    "jkramer@frenchmansreservecc.com",
    "kbaloyi@frenchmansreservecc.com",
    "lgarbacea@frenchmansreservecc.com",
    "membership@frenchmansreservecc.com",
    "njogu@skanem.com",
    "nlewis@frenchmansreservecc.com",
    "olive.kunihira@skanem.com",
    "pmroz@frenchmansreservecc.com",
    "psaylor@frenchmansreservecc.com",
    "rchiavari@frenchmansreservecc.com",
    "sachen.gudka@skanem.com",
    "sales@finewineliquors.com",
    "sameer.gaikwad@skanem.com",
    "scohn@frenchmansreservecc.com",
    "shamila.mirza@skanem.com",
    "sorezi@frenchmansreservecc.com",
    "svecellio@frenchmansreservecc.com",
    "tennis@frenchmansreservecc.com"
  ],
  "nombre_sitio": "frenchmansreservecc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.frenchmansreservecc.com/public/weddings-and-banquets/private-events",
      "text": "Private Events - Frenchmans Reserve Call Us Login About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information Menu Sign In About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information More ▾ Weddings Private Events Banquet Menu Testimonials Request Information Private Events Celebrate your special occasions at Frenchman's Reserve Country Club. We promise to go above and beyond to personally take care of you and your guests to ensure that you feels welcomed and beyond satisfied. We have both indoor and outdoors spaces perfect for your event and can accommodate intimate gatherings. Whether you are planning a wedding, baby shower, meeting, birthday party, golf outing or rehearsal dinner, you will be taken care of by our experienced staff. Our goal is to make planning your event as easy as possible for you and to make you feel like a guest at your own event! Please contact our Social Events and Catering Director, PSaylor@Frenchmansreservecc.com or call 561-630-0333 ext.140 (561) 630-0333 Frenchman's Reserve 3370 Grande Corniche Palm Beach Gardens, FL 33410 Loading ... © Frenchman's Reserve. All Rights Reserved."
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://russo-group.com/community/frenchmans-reserve/",
      "text": "Frenchmans Reserve - The Russo Group Exclusive Listings Closed Sales Properties Communities Abacoa Golf Club Communities Jupiter Jupiter / Juno Oceanfront Jupiter / Tequesta Waterfront New Construction North Palm Beach Palm Beach Gardens Tequesta In the Press Videos Global Connections Forbes Global Properties Luxury Portfolio About Us Meet The Team Market Trends Northern Palm Beach Favorites Contact Us Select Page 561.358.6608 Instagram Youtube Facebook TikTok Frenchmans Reserve - The Russo Group Frenchmans Reserve Description Price Range: $900,000 - $6,000,000 Frenchman’s Reserve lifestyle is among the best in the country. The amenities inside Frenchman’s Reserve offer a world of social opportunities – all without ever having to leave the privacy of your own community. With an array of activities to enjoy year-round, you will find that Frenchman’s Reserve is truly where you belong. Starting with the spectacular Arnold Palmer Signature Golf Course, this is only the first of the many impressive features of the Club. In addition to the championship golf course, the world-class amenities at Frenchman’s Reserve include a state-of-the-art Grande Clubhouse, a rejuvenating Spa and Fitness Center, formal and casual dining options, seven lighted Hydrogrid clay tennis courts, a multi-sport court, a resort-style outdoor pool and whirlpool, newly renovated playground, men and women’s locker facilities, and beautiful guest suites for visitors to the Club and out-of-town guests. The luxurious homes are reminiscent of the elaborate Palm Beach mansions designed by 20th Century architect Addison Mizner, the awe-inspiring architecture throughout the community continues the rich traditions of the Mediterranean Revival. Frenchman’s Reserve features an exceptional location just minutes from the world class shopping and restaurants of the PGA corridor, minutes to the beautiful beaches in Juno Beach. All of this is the reason Frenchman’s Reserve Country Club has recently been recognized as a Platinum Club of America for 2016-18, in the category of top 150 Country Clubs (out of 4000+ private clubs). Please contact the Jupiter and Tequesta luxury home Realtors of the Russo Group for help buying, selling or renting a Frenchmans Reserve luxury property. Login & Get Full Access × Email Address (must be valid) CONTINUE WITH EMAIL or Continue with Facebook Continue with Google By clicking on login buttons you are agreeing to our terms of use and giving us expressed written consent to contact you Agree & Get Full Access × In order to view sold properties, you will need to provide the information below and agree to the terms and conditions. We will then send you an email or text to verify the info provided so you can gain full access to sold properties. Gain Access Via Email Text Message First Name Last Name Cell Phone Email I agree to the terms and conditions Send Check Your Email to Gain Full Access × You requested that we send email to gain access to view sold properties. Check your email and click the link to proceed. Re-send the verification email By registering, you agree to our terms of use and that\nreal estate professionals and lenders may call/text you about your inquiry, which may involve use\nof automated means and prerecorded/artificial voices. You don't need to consent as a condition of\nbuying any property, goods or services. Messages/data rates may apply. Thank you for registering. Are you currently working with one of these agents? Available Homes For Sale at Frenchmans Reserve Login & Get Full Access × Email Address (must be valid) CONTINUE WITH EMAIL or Continue with Facebook Continue with Google By clicking on login buttons you are agreeing to our terms of use and giving us expressed written consent to contact you Agree & Get Full Access × In order to view sold properties, you will need to provide the information below and agree to the terms and conditions. We will then send you an email or text to verify the info provided so you can gain full access to sold properties. Gain Access Via Email Text Message First Name Last Name Cell Phone Email I agree to the terms and conditions Send Check Your Email to Gain Full Access × You requested that we send email to gain access to view sold properties. Check your email and click the link to proceed. Re-send the verification email By registering, you agree to our terms of use and that\nreal estate professionals and lenders may call/text you about your inquiry, which may involve use\nof automated means and prerecorded/artificial voices. You don't need to consent as a condition of\nbuying any property, goods or services. Messages/data rates may apply. Thank you for registering. Are you currently working with one of these agents? Property Search Search Filters Clear Filters Apply Filters Minimum Price No min 25,000 50,000 75,000 100,000 125,000 150,000 175,000 200,000 250,000 300,000 350,000 400,000 450,000 500,000 550,000 600,000 650,000 700,000 750,000 800,000 850,000 900,000 950,000 1,000,000 1,050,000 1,100,000 1,150,000 1,200,000 1,250,000 1,300,000 1,350,000 1,400,000 1,450,000 1,500,000 1,550,000 1,600,000 1,650,000 1,700,000 1,750,000 1,800,000 1,850,000 1,900,000 1,950,000 2,000,000 5,000,000 10,000,000 15,000,000 100,000,000 - Maximum Price No max 25,000 50,000 75,000 100,000 125,000 150,000 175,000 200,000 250,000 300,000 350,000 400,000 450,000 500,000 550,000 600,000 650,000 700,000 750,000 800,000 850,000 900,000 950,000 1,000,000 1,050,000 1,100,000 1,150,000 1,200,000 1,250,000 1,300,000 1,350,000 1,400,000 1,450,000 1,500,000 1,550,000 1,600,000 1,650,000 1,700,000 1,750,000 1,800,000 1,850,000 1,900,000 1,950,000 2,000,000 5,000,000 10,000,000 15,000,000 100,000,000 Bedrooms Any 1+ 2+ 3+ 4+ 5+ 6+ Bathrooms Any 1+ 1.5+ 2+ 2.5+ 3+ 4+ 5+ 6+ Single Family Condos Townhouse Multi-Family Condos Single Family Show agency only listings No Yes Property Facts Min Square Foot Min Acres Min Year Built - Max Year Built Min Days On Site - Max Days On Site Property Amenities General Options Just Listed Walkable Fixer Upper Newly Built Open House Adult 55+ Green/Energy Star Horse Property Golf Course Pool Water Front Water View Views Financial Options Reduced Foreclosures Short Sales Not Distressed Lease to Own No HOA Fees Seller Financing Structural Options Fireplace 1+ Car Garage 2+ Car Garage 3+ Car Garage 1 Story 2 Stories 3 Stories Deck Basement Master on Main Air Conditioning Rental Options Furnished Allows Pets Contact Us Andrew Russo 561.371.0933 Milla Russo 561.358.6608 GET UPDATED EMAIL ALERTS REGISTER info@Russo-Group.com Ph: 561.358.6608 300 W. Indiantown Rd. Jupiter, FL 33458 Instagram Youtube Facebook TikTok ©2019 | Russo Group. ALl Rights Reserved"
    },
    {
      "url": "https://www.pbcoastal.com/homes-for-sale-palm-beach-gardens-fl/frenchmans-reserve/frenchmans-reserve-frequently-asked-questions/",
      "text": "Frenchmans Reserve Frequently Asked Questions MLS Search Jupiter Palm Beach Gardens Juno Beach Singer Island North Palm Beach Blog Open main menu Contact us Phone number Sign up or Sign in Share Edit Profile Saved Searches 0 Favorite Properties 0 Sign Out Previous Edit Profile Saved Searches 10 Favorite Properties 10 Sign Out MLS Search Jupiter Palm Beach Gardens Juno Beach Singer Island North Palm Beach Blog Contact Us Sign up / Sign in Share 561.440.1000 Share this with your friends Copy Close 561.440.1000 Real Estate Company Call Close Frenchmans Reserve Country Club Real Estate Find Your Home Advanced Search Sell Your Home Frenchmans Reserve All Homes For Sale Frenchmans Reserve Interactive Map Search Refine Your Search Frenchmans Reserve Membership Frequently Asked Questions Frequently Asked Questions This general description of Frenchman’s Reserve Country Club & Community is provided for informational purposes only and should not be relied on in deciding whether to acquire a membership or purchase a home. For a full description of the benefits and privileges, please refer to the Membership Plan (the “Membership Documents”) and related property owner documents. Complete sets of Documents are available upon request, and should be reviewed prior to the acquisition. Q. What is Frenchman’s Reserve? A. Frenchman’s Reserve is a 100% Member-owned private equity Country Club & Community. Providing Members much more than golf... join in on the fun! With our full social calendar you can be as busy as you would like. In addition to the Arnold Palmer Signature Golf Course, Frenchman’s offers seven Har-Tru clay tennis courts, resort style swimming pool, two pickleball courts which include basketball and hard court tennis capabilities, a state of the art fitness facility, a youth center as well as a relaxing spa & salon. There is something for everyone. Frenchman’s Reserve is a certified Audubon Sanctuary, a Distinguished Club of America and recognized as a TOP 100 Platinum Club of America! Q. What type of homes make up the Frenchman’s Reserve Community? A . Frenchman’s Reserve is a well varied community with 341 single family homes, 56 coach homes, and 50 custom homes ranging in square footage from 2,450 through 11,000 and priced from $550,000 through $4,000,000. Q. Do I have to be a Club Member if I live in the community? A. Yes. All residents of Frenchman’s Reserve Country Club are required to hold an equity membership. Please request to see the membership plan and offerings. Q. What is a Member-owned Equity Club? A. An Equity Member-owned Club provides its Members the opportunity to control the Club and its facilities through the right to vote. Each equity membership represents an equity ownership interest in the Club. The operation of the facilities is accomplished through the direction of a “Board of Directors” which is elected by the Equity Members. The Board of Directors oversees the management of the Club and generally directs the operation of the Club facilities. Major issues are normally decided by vote of the Members. Q. What facilities does the Country Club offer? A . The facilities include: 18-Hole Arnold Palmer Signature Golf Course, Driving Range, Pitching & Putting Greens and 4.5 acre Three Hole Practice Facility Golf Shop featuring the latest in equipment, fashions, and collectable items 45,000 square foot Grande Clubhouse featuring: Main Dining Room with seating for up to 300 Grille Room and Lounge Outdoor Dining Terrace Library & Private Dining Room Women’s Locker Room & Lounge/Card Room Men’s Locker Room & Lounge/Card Room Seven HydroGrid Clay Tennis Courts and one Multi Sport Court for Basketball and Pickleball next to a well-stocked Tennis Shop Parc, a relaxed, casual ambiance restaurant with outdoor seating CORE, a youth center providing childcare for children ages 1 through 15 A resort style Swimming Pool with Spa, Children’s area and poolside dining patio. State-of-the-Art Fitness Center offering 10,600 square feet of exercise space featuring Two Group Fitness Rooms, Indoor Cycling and Pilates Studio. Spa & Salon offering a wide range of services that include: Hair, Nails, Skin Care and Massage Relaxing full service treatment rooms with Men’s and Women’s Locker Rooms with Steam Rooms Four fully appointed Guest Suites for Members exclusive use. Q. What categories of membership are offered by the Club? A. The Club offers two types of equity memberships; full golf equity and social/sport equity. Full Golf Equity Membership : allows Members and their immediate family to enjoy unlimited use of our Arnold Palmer Signature golf course, tennis, swimming, fitness, spa, and social facilities of the Club. This level of membership includes all court & greens fees and allows fourteen-day sign up privileges for golf tee times and tennis court times. Social/Sport Equity Membership : allows Members and their immediate family to enjoy unlimited use of tennis, swimming, fitness, spa, limited golf and all social facilities of the Club. This level of membership includes all tennis court fees and allows fourteen-day sign up privileges for tennis court times. Social/Sport equity memberships are only available to purchasers of homes that currently have Social/Sport equity memberships. Q. Is there an equity contribution required to join the Club? A . Yes, $150,000 for a Full Membership and $95,000 for a Social Membership.  The refundable equity amount for a Full Membership is $100,000 and the refundable amount for a Social Membership is $62,500. Q. How many memberships will you allow? A. The Frenchman’s Reserve Country Club By-Laws state that 349 full golf equity memberships will be allowed. The number of social equity memberships is determined by the Board of Directors. Q. What are the annual dues and fees for the Club? A. Annual dues are paid on a calendar basis but may be pro-rated for a new Member based upon the month in which they join. (The dues year runs November 1 to October 31.) Q. Is there a food and beverage minimum spending requirement? A. Yes, There is a $1,200 annual food and beverage spending requirement. Q. What counts towards the food minimum? A. All a la carte food & beverages purchased in the Grille & Main Dining Rooms, Parc, Turn Station and Pool Window. Carry out and To-Go orders are included too! Q. Can I switch to another membership level? A. Yes. Please refer to the Club Documents as there may be transfer fees, upgrade fees or additional initiation fees required, depending on the circumstances. Q. Are Club Memberships transferable? A . Club Members may not sell, transfer or otherwise assign their membership privileges except to the Club, and therefore, Club Members may not transfer or otherwise assign their Club Membership at Frenchman’s Reserve directly to any third party. Q. Does one membership grant access to my entire family? A. A Club membership can be issued in the name of an individual, in the names of both spouses or in the name of an Entity. The ability to spend quality time with members of the family is of paramount importance these days. The Club is committed to providing a pleasant environment where this can be accomplished. Each membership in the Club is a family membership, which includes full privileges for spouses or domestic partners and unmarried children under the age of 30 who either live at home or attend school on a full-time basis. The Club provides programs and activities that are appealing to family members of all ages. Q. When was the last Club renovation completed? A. This year saw the completion of Parc, the new casual dining restaurant serving golfers and pool-goers as well. There was the addition of a putting green and a 4.5 acre 3 hole short game practice facility. A new Tennis Center was completed in fall 2018. Three additional fitness studios were added along with the expansion and renovation of the current Fitness Center. Q. Are there any charges for these improvements? A . Along with annual membership dues, all Members pay an annual $1,500 capital charge per membership. The $1,500 payment will be through 2026. Q. Is Frenchman’s Reserve \"kid friendly\"? A. Yes! We work very hard to make kids feel welcome and a part of the Club & Community. We encourage youth participation in tennis, swimming, fitness and golf. Frenchman’s Reserve provides many great opportunities for children to enjoy the Club while learning integrity and confidence. Many events are child focused, including Easter Brunch & Egg Hunt, Halloween Party & Haunted House, Gingerbread Decorating and much, much more. The Club also hosts children's summer and holiday camps, swim lessons and provides tennis and golf instruction. Q. May we bring guests to the Club and if so, what is the policy? A. Yes. Members may invite guests to use the facilities of the Club upon payment of any applicable guest fees. Guest use shall be subject to the Rules & Regulations and Guest Policies of the Club, including, restrictions on the number of guests a member can sponsor and the number of times a particular guest may use the Club facilities. Q. What services are included in your POA quarterly charges? A. Services provided include home security alarm monitoring with an included comprehensive service plan, Comcast cable television with high speed internet. Landscape maintenance is provided for all homes (except custom homes) which consists of grass cutting, trimming of shrubs, hedges and palms, lawn & ornamental pest control, fertilization & weed control. 24-hour security and an onsite property owners association are provided for homeowner needs. Q. What type of security is provided to keep the community safe? A. Gated 24/7 access control to include roving and tactical patrols, state of the art security video surveillance, and protection of the community’s 5-mile perimeter. Our officers are either former military, former law enforcement or police academy trained with advanced protective and medical training. Q. Is there a Property Owners Capital Contribution? A . Yes. There is a one-time capital contribution upon transfer of title on a property equal to one quarter dues. It is paid at settlement to the association and deposited into the capital reserves to fund future community maintenance items. Q. Who manages Frenchman’s Reserve Country Club? A. The General Manager along with the management team run the day-to-day Club operations and strives to enhance the value and benefits associated with a Frenchman’s membership. Our Board of Directors, composed of elected Members, oversees the policies and long-term viability of the Club. Q. How is the Board of Directors of the Country Club selected? A. Three Directors are elected annually to serve a three year term. Q. How is the POA Board of Directors selected? A. Three Directors are elected annually to serve a three year term. Q. Who manages Frenchman’s Reserve Property Owner’s Association? A. The POA’s General Manager along with the POA management team run the day to day POA operations and strives to enhance the value and benefits associated with living within Frenchman’s Reserve. Q. What should I do if I have additional questions about Club Membership? A. Complete details concerning the membership program at Frenchman’s Reserve Country Club are available from Gwen Gordon, Membership Director. If you have additional questions or would like further information, please contact Gwen at 561-630-0333 ext. 113 or by email at membership@frenchmansreservecc.com Q. Who may I contact if I have additional questions about the services and fees of the Property Owners Association? A. Complete details concerning the Property Owners Association are available from Ed Latalladi, POA General Manager. You may contact Ed at 561-626-2874 or by email at elatalladi@frenchmansreservecc.com All information on this page comes directly from https://www.frenchmansreservecc.com/membership/membership-faqs Frenchmans Reserve All Homes For Sale Frenchmans Reserve Membership Information Latest Frenchmans Reserve Homes For Sale $3,690,000 3 Beds ⋅ 4 Baths ⋅ R11122393 MLS ⋅ Frenchmans Reserve BLDG. This expanded Montecito model has been completely reimagined from top to bottom, blending modern elegance with timeless sophistication. Wide-plank hardwood floors, new recessed lighting, and impact-rated windows and doors set the tone, with natural light filling every room. 320 Charroux Drive, Palm Beach Gardens $2,599,000 3 Beds ⋅ 4 Baths ⋅ R11117636 MLS ⋅ Frenchmans Reserve BLDG. Your serene garden home awaits. Fabulous value for a single family home located in the well located and highly sought after country club community of Frenchman's Reserve. This lovely inviting 3 bedroom + den/office and 4 full bath Casa Bendita model home features tranquil long lake & course view and is ready to become your very own. Completed with lovely signature finishes throughout this spectacular residence has been lightly lived in and lovingly maintained. The beautiful newly completed inviting pavered drive/entryway opens to wonderful pool, lake & course views all highlighted by captivating tropical landscaping. Delight in the scenic garden views from the primary suite and throughout the main living spaces. An absolutely perfect home for family gatherings and guests. 802 Floret Drive, Palm Beach Gardens $1,150,000 3 Beds ⋅ 3 Baths ⋅ R11104830 MLS ⋅ Frenchmans Reserve BLDG. RARELY available Larger, Upper Unit with Private Elevator and a ''Coveted'' FULL GOLF MEMBERSHIP.  This gorgeous home features Updated flooring throughout, NEW Roof 2024, New exterior paint and lighting 2024, New Glass front entry door, ALL IMPACT GLASS!  Stainless Steel appliances and 2 car Garage.    Experience Frenchmans Reserve Country Club, a Platinum Golf Communty with incredible amenities.  The open concept allows both bedrooms and flex space to be located in each section of their own. . The outdoor living area offers a private screen-enclosed covered balcony which is the perfect spot to sip your morning coffee or simply take in the lovely Florida weather surrounded by mature landscaping. True Resort Style  Living!  Enjoy the large primary suite with 2 large walk-in closets with 347 Chambord Terrace, Palm Beach Gardens $6,950,000 5 Beds ⋅ 7 Baths ⋅ R11103259 MLS ⋅ Frenchmans Reserve BLDG. Welcome to 678 Hermitage Circle, an exceptional 5 bedroom 6 1/2 bath estate offering over7700 sq ft of refined living and outdoor space in the gated community of Frenchmans Reserve.  Designed for elegant living, this home seamlessly blends timeless architecture with luxurious modern upgrades.Brand new 2025 roof and a whole-house generator, ensuring year-round comfort and security.  The fully renovated chef's kitchen boasts high end appliances, all opening to expansive living and dining spaces with travertine floors throughout.The lavish primary suite is a private sanctuary featuring his and her bathrooms, walk-in closets and serene views of the resort style pool, spa and covered loggia. Additional features are a summer kitchen, private office and media room plus a 3 car garage 678 Hermitage Circle, Palm Beach Gardens $2,295,000 3 Beds ⋅ 4 Baths ⋅ R11091580 MLS ⋅ Frenchmans Reserve BLDG. NEW ROOF being installed June/July! Welcome to prestigious Frenchman's Reserve a Platinum Club of America since 2016! Golf membership upgrade available! Pristine 3-4BR/4BA 1-story home - Den could be 4th BR/Office - light & bright w/ very flexible floorplan to fit your lifestyle. A/C 2023, Washer/Dryer 2023, Pool Heater 2021. Enjoy the private pool & wide golf views. Enjoy tennis, pickleball, resort-style pool, cards plus             a Fitness Center w/awesome classes. Enjoy breakfast, lunch & dinner at Parc & events/dining in the Grille Room. Kids Core Club will entertain your kids/grandkids! Just minutes away you'll find the IntraCoastal Waterway & pristine beaches on the Atlantic Ocean a year-round haven for boaters & watersport enthusiasts. It's all about LOCATION! LOCATION! LOCATION! 212 Montant Drive, Palm Beach Gardens $7,495,000 5 Beds ⋅ 8 Baths ⋅ R11067471 MLS ⋅ Frenchmans Reserve BLDG. CUSTOM ESTATE with Panoramic Water & Golf Views in a Prestigious Location.COMPLETELY RENOVATED in 2022 | An ENTERTAINERS DREAM HOME!Discover luxury redefined in this custom 5-bedroom + office, 8-bathroom estate, completely transformed in 2022. Perfectly positioned at the end of a private cul-de-sac on nearly half an acre, this exceptional home offers unparalleled panoramic lake and golf course views. With a gourmet chef's kitchen, spa-like bathrooms, Expansive Outdoor Entertaining space and exquisite design throughout, this is a home where sophistication meets comfort.Refined Elegance & Thoughtful DesignFrom the grand foyer to the expansive living spaces, every detail has been curated for an effortless blend of luxury and function.Primary Suite Retreat - 820 Floret Drive, Palm Beach Gardens Start Your Search Frenchmans Reserve Real Estate Market Report Check Stats Now Country Club Membership Costs Specialized Communities Golf & Clubs Gated-Non Club Waterfront Condos Boating Beach Growing Family Frenchman's Reserve Information Frenchmans Reserve Home Page Membership Cost and Fees Country Club Amenities Frequently Asked Questions Floor Plans Things to do Events and Activities Easter/Passover at Frenchman's Country Club Living Rent The Banquet Hall Custom Home Designs What Will $700,000 Buy? Heritage Collection Floor Plans Casa Bendita Carrinton Largo Mar Montecito Playa Riente Signature Collection Floor Plans Casa Del Sol Mallorca Playa Verde Segovia Villa Rosa Aristocrat Collection Floor Plans Carlton Coventry Cranbrook Las Palmas Palm Beach Gardens Search Palm Beach Gardens Communities Extremely Helpful \"Todd Blair was extremely helpful in our transition from Mississippi to Florida. We felt he was looking out for our best interest the entire time.\" Joel Keller Trust Him Completely \"Todd is extremely knowledgeable and has helped guide me through the process of purchasing two homes. I trust him completely and highly recommend!\" Tara Steinbeck Attention to Detail \"I had a great experience with my agent, Todd Blair. Todd made the experience extremely easy due to his local knowledge and attention to detail.\" Debbie Dalessandro Consummate Professional \"The best thing that happened to us when we were looking for a place in Florida was finding Todd Blair. He was the consummate professional-knowledgeable, personable and flexible.\" Jane Janeczek Very Knowledgeable \"Todd was very knowledgeable and was able to show me several homes that were just right for me and my family. His thorough knowledge of the area and his construction background made me feel confident.\" Victoria Witkowski Above & Beyond \"From the the first time we met him Todd was professional courteous scrupulously honest, generous, and kind. We had more than a few twists and turns, no fault of Todd, yet he always went above and beyond to resolve every issue.\" Stephen Bozzo Absolutely the Best \"Todd is absolutely the best. He is so well informed and so knowledgeable about real estate. He listens, doesn’t push and just guides you in the right direction. We really valued our time with him.\" Theresa Bozzo More Google Reviews Search by Map Find your Palm Beach Coastal home. Find Your Home 14255 U.S. Highway 1 Juno Beach, FL 33408 Todd Blair Broker/Owner Florida License# BK3217770 561.440.1000 DISCLAIMER: All listings featuring the BMLS logo are provided by BeachesMLS, Inc. This information is not verified for authenticity or accuracy and is not guaranteed. Copyright ©2020 BeachesMLS, Inc. Communities Jupiter Palm Beach Gardens Juno Beach Singer Island North Palm Beach Search Advanced Search Quick Search Map Search Market Reports Sold Search Resources Buyer Learning Center Seller Learning Center About Blog ® | Palm Beach Coastal Realty IDX Site Powered by Accessibility Terms Privacy"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * Datenschutz name E-Mail E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/meet-the-team",
      "text": "Meet The Team - Frenchmans Reserve Call Us Login About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information Menu Sign In About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information More ▾ Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Meet The Team Administration RSS Feed Paul Mroz General Manager / COO 561-630-0333 x 111 pmroz@frenchmansreservecc.com Golf RSS Feed Steve Vecellio, PGA Director of Instruction 561-630-0333 x138 SVecellio@frenchmansreservecc.com Jake Kramer, PGA Lead Assistant Golf Professional 561-630-0333 x147 jkramer@frenchmansreservecc.com Brian Lee, Certified PGA Guest Services Manager/Lead Assistant Golf Professional 561-630-0333 x147 BLee@frenchmansreservecc.com Sue Cohn Golf Shop Merchandiser 561-630-0333 x104 SCohn@frenchmansreservecc.com Nick Lewis Seasonal Assistant Golf Professional 561-630-0333 x120/21 nlewis@frenchmansreservecc.com Golf Course Maintenance RSS Feed John Colo Director of Golf Course Maintenance 561-630-0333 x401 JColo@frenchmansreservecc.com Tennis RSS Feed Angel Rodriguez Director of Tennis 561-630-0333 x119 | 561-799-9998 (D) arodriguez@frenchmansreservecc.com Jason Berry Tennis Professional 561-630-0333 x122 tennis@frenchmansreservecc.com Food & Beverage RSS Feed Kenneth Baloyi Food & Beverage Director 561-630-0333 ext. 137 kbaloyi@frenchmansreservecc.com Pat Saylor Social Events & Catering Director 561-630-0333 ext. 140 PSaylor@frenchmansreservecc.com Rick Chiavari Executive Chef 561-630-0333 ext. 140 RChiavari@frenchmansreservecc.com Corina Cozma Food & Beverage Manager 561-630-0333 ext. 106 CCozma@frenchmansreservecc.com Ayesha James Food & Beverage Supervisor 561-630-0333 x106 AJames@frenchmansreservecc.com Fitness RSS Feed Jan English Fitness Director 561-630-0333 ext. 150 jenglish@frenchmansreservecc.com Lumi Garbacea Fitness Supervisor 561-630-8084 LGarbacea@frenchmansreservecc.com Marsha Benjamin Personal Trainer / Pilates Instructor Jose Mena Personal Trainer Paulina Hartman Personal Trainer Jo Reyes Personal Trainer Spa and Salon RSS Feed Lily Schultz Spa Coordinator 561-630-033 x131 | 561-799-9989 (D) ISchultz@frenchmansreservecc.com AnnMarie Smith Hair Stylist Linda Leet Facial & Massage Therapist Keelee Wright Massage Therapist Susanne Girouard Nail Technician Kimberly Donofrio Nail Technician Daniela Muraru Hair Stylist Yessica Torres Facial Therapist Kelley Kuykendall Massage Therapis CORE Club RSS Feed Shelley Orezi CORE Club Supervisor 561-630-0333 x153 | 561-799-9986 (D) SOrezi@frenchmansreservecc.com (561) 630-0333 Frenchman's Reserve 3370 Grande Corniche Palm Beach Gardens, FL 33410 Loading ... © Frenchman's Reserve. All Rights Reserved."
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/john-colo-60c495.html?LayoutID=17",
      "text": "John Colo - Frenchmans Reserve Call Us Logout Menu Logout < Back John Colo Director of Golf Course Maintenance 561-630-0333 x401 JColo@frenchmansreservecc.com John was previously the Golf Course Superintendent overseeing the Hills Course at Jupiter Hills Club in Tequesta, Florida for the past 5 years. Prior to Jupiter Hills , John was the Golf Course Superintendent at the Country Club of York in York Pennsylvania for 10 years. John received his Turfgrass Management Certification from Rutgers University. Besides his extensive experience with TifEagle Greens, Celebration Fairways and Paspullum Tee boxes, John has gone through two renovations at Jupiter Hills where he was heavily involved in the process including redoing much of the existing irrigation and the regrassing of each course. John is committed to providing the highest quality turf conditions and golf experience for our Members. He will be very visible to the membership and is looking forward to meeting each and every one of you. He lives in Hobe Sound with his two sons, Robert and Kevin who are 19 and 17 respectively. He is the proud owner of a single digit handicap. (561) 630-0333 Frenchman's Reserve 3370 Grande Corniche Palm Beach Gardens, FL 33410 Loading ... © Frenchman's Reserve. All Rights Reserved."
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://frcharities.org/who-we-are/",
      "text": "Who We Are - Frenchman's Reserve Charitable Foundation Skip to content Grants Portal Who We Are What We Fund Grant Information News and Notes Support Home > Who We Are Who We Are About Us The Frenchman’s Reserve Charitable Foundation, Inc. is a volunteer charitable organization that was formally established in 2024 by resident members of Frenchman’s Reserve Country Club. The Foundation is a 501(c)(3) charity dedicated to supporting Palm Beach County non-profit charitable organizations that offer family and social services, medical support, food stability, veterans assistance and animal welfare. Our Mission Our mission is to improve the lives of those in need in Palm Beach County by providing assistance to charitable organizations within the local community. Frenchman’s Reserve Recognized as a Platinum Club of America since 2016, Frenchman’s Reserve is a unique private residential community with world class amenities including an Arnold Palmer Signature Golf Course, extensive racket facilities, a rejuvenating spa and fitness center, resort style pool and grand clubhouse with dining, card rooms and guest suites. Located in Palm Beach Gardens the community consists of 341 single family homes, 56 coach homes and 50 custom homes. As such, its intimacy sets it apart from other nearby communities. To learn more about Frenchman’s Reserve go to our club website at www.frenchmansreservecc.com Foundation Board of Directors Board of Directors Our Frenchman’s Reserve Charitable Foundation Board of Directors sets overall policy and guidance for the Foundation. It also establishes guidance on timing and the agenda for all activities and has final say on grant recipients. The Board consists of seven members, two of whom also sit on the Frenchman’s Reserve Club Board of Directors. Robert Fine – President Gerry Bresnick – Vice President Allen Cicchitelli – Secretary Robert Diskin – Treasurer James Juracka - Director Lenore Padgett - Director Bruce Weinstein – Director Foundation Volunteers Working Committees The Board is aided in its work by volunteer members of the necessary working committees. Each committee is headed by a Board member and consists of residents of Frenchman’s Reserve. The working committees are: Communication and Reports Finance Fundraising and Sponsorships Governance and Compliance Grants Latest News Award Celebration Recap: A Successful First Year of Giving We are thrilled to announce the successful conclusion of our 2024–2025 giving cycle, which culminated in our First Annual Grants Award Celebration on April 30th, 2025. This memorable event brought together donors, volunteers, and members of the Frenchman’s Reserve community to recognize and support 20 outstanding charitable organizations making a difference in Palm Beach County. Read Full Article View All News Articles Menu Who We Are What We Fund Grant Information News and Notes Support Grants Portal Contact Us 3370 Grande Corniche Palm Beach Gardens, FL 33410 Send us a Message Federal Tax ID# 99-2148481 © 2025 Frenchman's Reserve Charitable Foundation | Legal Disclosures Site by Perisphere Media Scroll To Top"
    },
    {
      "url": "https://www.frenchmansreservecc.com/public/about-us/contact-us",
      "text": "Contact Us - Frenchmans Reserve Call Us Login About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information Menu Sign In About Us Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Membership Becoming a Member Our Community Our Features Golf Course Tour About our Golf Golf America Segments Meet our Pro's Golf Attire & Etiquette Weddings & Banquets Weddings Private Events Banquet Menu Testimonials Request Information Amenities Dining Clubhouse Luxury Suites Resort Style Pool Spa & Salon Fitness Center Racquets Kids' CORE Club Real Estate Welcome Realtors! Current Home Listings FAQ's Tenant Member Information More ▾ Our Club Contact Us Meet The Team Charitable Foundation Hours of Operations Bee Initiative Contact Us Clubhouse 3370 Grande Corniche Palm Beach Gardens, FL 33410 (561) 630-0333 Membership@FrenchmansReserveCC.com Property Owners Association POA 3350 Grande Corniche Palm Beach Gardens, FL 33410 (561) 626-2874 www.FrenchmansReservePOA.com Directions to Frenchman's Reserve Country Club From Interstate 95 and Florida’s Turnpike, exit at PGA Boulevard in Palm Beach Gardens and head east. Travel in the far right lane to the Alternate A1A ramp and head north 1 3/10 miles to the Frenchman’s Reserve entrance on the right. Only minutes away from Frenchman’s Reserve: I-95 (3 minute drive) Florida Turnpike (5 minute drive) Palm Beach International Airport (20 minute drive) Palm Beach Gardens Medical Center (10 minute drive) Palm Beach (15 minute drive) Fort Lauderdale (45 minute drive) Miami (90 minute drive) (561) 630-0333 Frenchman's Reserve 3370 Grande Corniche Palm Beach Gardens, FL 33410 Loading ... © Frenchman's Reserve. All Rights Reserved."
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    }
  ]
}