{
  "fuentes": [
    {
      "url": "https://frogsongorganics.com/locations-2/",
      "email": "info@frogsongorganics.com"
    },
    {
      "url": "https://www.purplefrog.co.uk/contact",
      "email": "more@purplefrog.co.uk"
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/csa-membership-terms-policies/",
      "email": "csa@frogsongorganics.com"
    },
    {
      "url": "https://ofrf.org/crop-livestock-integration/frog-song-organic/",
      "email": "give@ofrf.org"
    },
    {
      "url": "https://frogsongorganics.com/orderonline/",
      "email": "info@frogsongorganics.com"
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/",
      "email": "csa@frogsongorganics.com"
    },
    {
      "url": "https://skyorganics.com/pages/contact-us",
      "email": "influencers@skyorganics.com"
    },
    {
      "url": "https://frogsong.localfoodmarketplace.com/Producer/7af0accd-18b4-4a89-95b7-978cc2951dd8",
      "email": "info@frogsongorganics.com"
    },
    {
      "url": "https://frogsongorganics.com/about-us/contact-us/",
      "email": "csa@frogsongorganics.com"
    },
    {
      "url": "https://frogsongorganics.com/about-us/contact-us/",
      "email": "info@frogsongorganics.com"
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/member-resources/",
      "email": "csa@frogsongorganics.com"
    },
    {
      "url": "https://frogsong.localfoodmarketplace.com/",
      "email": "info@frogsongorganics.com"
    },
    {
      "url": "https://frogsongorganics.com/about-us/faq/",
      "email": "csa@frogsongorganics.com"
    }
  ],
  "mails": [
    "csa@frogsongorganics.com",
    "give@ofrf.org",
    "influencers@skyorganics.com",
    "info@frogsongorganics.com",
    "more@purplefrog.co.uk"
  ],
  "nombre_sitio": "frogsongorganics.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://frogsongorganics.com/locations-2/",
      "text": "Locations - Frog Song Organics | Organic Farm | Central Florida Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar Locations WHERE CAN I PICK-UP MY SHARE? Home and Wholesale Delivery is available in Gainesville, Orlando, Jacksonville, St. Augustine, Palatka, Ormond Beach, Mt. Dora, Bradenton, Tampa, St. Pete, and Sarasota! Email info@frogsongorganics.com to inquire if we deliver to your address! Hawthorne, FL Frog Song Organics – Farm Pick-Up 4317 NE US Hwy 301 Hawthorne, FL  32640 Wednesdays, Thursdays, or Fridays After 4 pm Gainesville, FL Cypress & Grove Brewery 1001 NW 4th Street Gainesville, FL  32601 Wednesdays, 4:00 – 8:00 pm Palatka, FL Azalea City Brewing Co 120 S 7th St Palatka, FL 32177 Thursdays, 5:00 pm – 9:00 pm Orlando Area Winter Park Farmers Market Central Park West Meadow Morse Blvd & New York Ave Winter Park, Fl 32789 SATURDAYS, 8 am – 1 pm *we are located near the train tracks Grounding Roots, Winter Park 4270 Aloma Avenue Winter Park, FL 32792 Saturdays, 3 PM – 6 PM All Inclusive CrossFit 1152 Harmon Ave Winter Park, FL 32972 Wednesdays, 2 PM – 6PM Jacksonville, FL Jacksonville (Private Residence) Near Plummers Point / Scott Mill Rd. Thursdays, 12:30 – 3:00 PM BREW Five Points 1024 Park Street Jacksonville, Florida Thursdays, 12-4 PM Atlantic Beach (Private Residence) Near Park Terrace East Thursdays, after 3:00 PM St. Augustine, FL Stone Climbing 115 Strongway Ct. St. Augustine, FL 32086 THURSDAYS, 4:00 PM – 8:00 PM St. Augustine Farmer’s Market at the Amphitheatre 1340C A1A South St. Augustine, FL 32080 SATURDAYS, 8:30 AM – 12:30 PM Ormond Beach, FL Ormond Beach Farmers Market 22 S Beach St Ormond Beach, FL 32174 Thursdays, 8:00 am – 1:00 pm Tampa and St. Pete , FL Meacham Urban Farm – Tampa, FL 1108 E Scott St Tampa, FL 33602 TUESDAYS, 12:30 – 3:30PM Little Tree Homestead & Nursery – Gulfport, FL @ Private Residence On 19th Avenue Gulfport, FL 33707 WEDNESDAYS, 2:00 – 8:00 PM Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://www.purplefrog.co.uk/contact",
      "text": "Contact | Purple Frog Solutions [mega=solutions] Brand Strategy & Insights Sales & Marketing CRM & Automation Methodology About us Resources [mega=resources] Sapient Blog Client Support Client Support Menu Brand Strategy & Insights Framing your story and improving your position in the market Sales & Marketing Bridge the gap between saying and doing CRM & Automation HubSpot implementation backed up with strategic insight auto_awesome The sapient blog Learn sales and marketing strategies & make your company remarkable book Free marketing strategy ebook east book An introduction to User Experience design east newspaper The sapient blog Learn how to shape sales and marketing strategies and make your company remarkable forest Thinking in fields Random thought on business, marketing, sales and life on walk in the countryside open_in_new Free marketing strategy ebook An introduction to User Experience design Contact us Let's get the ball rolling Fill out the form on this page to let us know how we can help you. And if a contact form isn’t your preference, give us a ring! We are always happy to help, give you advice and explore how we can best work together. Get in touch Call us 01865 570390 between 9am and 4pm Email us more@purplefrog.co.uk Address John Eccles House Robert Robinson Avenue Oxford Science Park Oxford OX4 4GP UK Contact Details 01865 570390 more@purplefrog.co.uk Follow us Information Privacy Terms More from us Contact us Client Support © 2025 Purple Frog All rights reserved. John Eccles House, Robert Robinson Avenue, Oxford Science Park, Oxford OX4 4GP United Kingdom Sales and marketing consultancy and digital marketing agency in Oxford with extensive experience in marketing strategy, business growth, B2B branding, inbound marketing and marketing automation."
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/csa-membership-terms-policies/",
      "text": "CSA Membership | Frog Song Organics | Central FL Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar CSA Membership Terms CSA Membership & Subscription Terms & Agreement CSA is a partnership between community members and the farmers that feed them. Members make a commitment to the farm, and together we produce high quality produce grown in an ecologically and socially responsible manner. We value transparency and integrity in food sourcing, and we thank you for supporting your local food system. We are a farm-based CSA, and our goal is to grow as much of the food in your share as possible on our own farm here in Alachua County. We also work with other partner growers to offer more variety to you and minimize risk due to weather. All of the produce grown at our farm in Alachua County, FL is USDA certified organic by Quality Certification Services. Our eggs, chicken and pork are not certified organic. They are raised on our farm, rotated on fresh pasture, and receive organic, soy-free feed. Eggs are currently not SNAP eligible due to Florida law, we sell them as pet treats under our feed master registration permit. We are partnering with other farmers to source items for your weekly “Farmer’s Choice” CSA boxes to expand our offerings. We partner with trustworthy sources who we personally visit and maintain relationships with to assure that they meet our standards of pesticide and herbicide free production. Occasionally, you may receive an item such as mushrooms or eggs which are not certified organic. This will be noted on the storefront, your email order confirmation and weekly items list inside your box. All products that we carry are produced without synthetic fertility, herbicides or pesticides, and are foods we trust to feed to our own family. You can select only certified organic items, or only items grown in Florida by selecting a Pre-Paid Credit Membership where you log in weekly to select the items you wish to receive. **We DO NOT offer customization of Farmers Choice CSA Memberships.** Please use the Pre-Paid Credit Membership if you would like to customize your order each week. Your membership is an investment in the farm. We will do our absolute best to produce and source a wide selection of high quality produce for you throughout the course of your membership. In the event of crop failure due to weather or pest issues, the quality, quantity, and selection of produce available may vary. We cannot guarantee the availability of a specific crop on a specific date. If crops are less abundant in one given week, we will aim to make up for the value of your box in a future distribution, so that you receive the full value of your membership over the course of the season. The value of each box week to week may not be exactly equivalent. Our goal is to make the value of the food you receive during your membership season equal to or greater than the cost of the membership, based on farmers market prices. When we have abundance of an item, you will see more of it in your box. When particular items are less abundant, your share of those items may be smaller, but these items are allocated to our members first and foremost. There are also some items we do not sell online and only offer to CSA member such as certain special citrus varieties. Your share will be available for pick up each week only during the day and time you select. Unclaimed shares will not be held past your scheduled pick up time and credits/refunds will not be issued for missed pick-ups. You are welcome to send family or friends to pick up your share for you, you do not need to inform us. You may schedule a “delivery hold” through our online ordering system or by email with a minimum of three-day notice to cancel any distribution and receive credit for the value of that week’s share. For example, if your pick up is on Wednesday, the hold deadline is Monday. If you know ahead of time when you will be out of town, Log into your account to schedule a hold, email us or call our office at 352-468-3816. Credits due to holds may be used to purchase fresh produce and other goods from the farm until the end of your membership period. You can roll existing credit onto your next season renewal if you renew before the current season ends. Your credit expires one year from membership enrollment. AUTO RENEWAL POLICY: All CSA Memberships will be automatically renewed and charged to your card on file on week 11 for the following season unless you opt out. If you decide not to renew, please let us know by email before the cancellation deadlines listed below. We will send paper reminders in your box and also by email. 2025 CSA Seasons ( 4 Seasons, each 13 weeks): WINTER 2025: Tuesday, January 7th – Saturday, April 5th (Renewal/Cancellation deadline March 28th) SPRING 2025: Tuesday, April 8th – Saturday, July 5th (Renewal/Cancellation deadline June 27th) SUMMER 2025: Tuesday, July 8th – Saturday, October 4th (Renewal/Cancellation deadline September 26th) FALL 2025: Tuesday, October 7th – Saturday, January 3rd (Renewal/Cancellation deadline December 26th) Pre-Paid “Your Choice” Memberships Pre-Paid “Your Choice Membership credits expire one year from purchase date. Reusable CSA Boxes When you join the CSA, you are allocated two (2) green, plastic reusable boxes that your share will arrive in each week unless your add-ons warrant us to pack your order larger or multiple boxes. Please, return the reusable boxes to your pick-up location each week so that they may be cleaned, sanitized and re-used for the following week’s delivery. Egg Shares and Extra Item Add-Ons to the Farmer’s Choice Box You may add items such as pickles, jam, coffee, eggs, etc on a one-time basis to your CSA share using the online ordering system. The order deadline is two days before your pick up by noon. You must have a credit card on file to pay for add-on items, which we will run after you have received the item(s). Members are responsible for their perishable items after delivery and we cannot guarantee exact delivery times. Please leave a cooler with ice packs if you will not be home. Payments: Payment is due in full at the time you join. SNAP payment: We can accept SNAP payments, and utilize the Fresh Access Bucks matching program for a discounted rate. To pay with SNAP, please call our office to set up payment by SNAP. SNAP payments will be made weekly. Refunds/Cancellations No refunds are available for CSA memberships or unclaimed shares unless in the event we need to cancel a pick up location. If you miss a pick-up you do not receive double the next week. We will donate unclaimed shares to local shelters/service providers, farm staff meals, delivery site hosts, or volunteers. Memberships are transferable to other people. If a weekly pick up becomes impossible for you, you may transfer the balance of your share to Account Credit and use it to shop at the farmers market or order online. *In the event that extenuating circumstances result in a refund, the refund will be for the membership fees paid less any credit card/electronic processing fees, and a $20 processing fee for each season cancelled to cover administrative staff time. *In the event that we have to cancel delivery service to your location, you have the option to receive a full refund for the remaining value of your share or switch to another location. Thank you so much for electing to support local & organic agriculture in our community with your membership! If you have any questions or concerns, please contact us: Email: csa@frogsongorganics.com Office Phone: (352) 468-3816 We appreciate your support of our farm! The Frog Song Team Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://ofrf.org/crop-livestock-integration/frog-song-organic/",
      "text": "Frog Song Organics - Organic Farming Research Foundation Skip to content DONATE NEWS SIGN-UP Search for: Why Organic? Organic is Regenerative Organic for Climate Organic FAQs Research Organic Research Hub (Search Tool) National Organic Research Agenda Farmer-Led Trials Program Farmer-Led Trials Program | Learn More OFRF Grant Program Ag Research Forum Organic Research Amplification Services Resources Recursos en Español Videos & Webinars Online Courses Publications Crop-Livestock Integration Transitioning to Organic Advocacy Our Priorities State-By-State #GetActive Guide Our Statements Policy Corner News OFRF News Farmer Stories Organic in the Media Events About About OFRF Mission and Values Diversity, Equity, & Inclusion Annual Reports and Financials Meet Our Team Our Partners Get Involved Receive News Ways to Give Internships and Jobs Search for: Frog Song Organics Frog Song Organics Frog Song Organics is a highly diversified farm producing vegetables, herbs, flowers, orchard crops, pork and poultry products, and legumes. John Bitter was one of the farmers that OFRF spoke with about Integrated Crop-Livestock Systems, the practice of raising livestock and crops together in ways that benefit the whole farm ecosystem. Farm name: Frog Song Organics Farmer name: John Bitter Location: Hawthorne, Florida, (traditional homelands of the Seminole Tribes, Republic of Timucua, Miccosukee Tribe, and Mascogo). Products: Diversified mixed vegetables, flowers, herbs, pastured pork, eggs. ICLS practices: Grazing & terminating cover crop, cleaning up crop residue, breaking pest cycles. Years certified organic: Since 2012. Acreage: 62 acres, mix of leased and owned with 20-40 acres in production. Type of livestock: Pigs, chickens. Markets: Farmers Markets, CSA, wholesale distribution, and custom delivery boxes. Years in operation: Since 2011. Farm crew size: ~30 people, with half directly involved in daily crop production. OFRF is honored to share a recording of a conversation with John Bitter about Integrated Crop-Livestock Systems at his farm. You can listen now by pressing the “play” button below.  Or click this link to download John’s story to listen later. https://ofrf.org/wp-content/uploads/2023/06/John-Bitter-FAFO-Crop-Livestock-Interview-Audio-EDITED-2.0.mp3 Balancing Act: How Frog Song Organics Integrates Livestock and Crops When John Bitter and his wife Amy started Frog Song Organics on 5 acres in 2011, a vision of how to carefully scale-up the farm was long in the works. They both had several years’ experience working with farms in the area, and each knew nearby markets well enough to know they had opportunities to grow. Looking ahead, they had also spoken with the owner of neighboring land about leasing additional acreage in the future. Fast-forward 12 years, and Frog Song Organics is a 62-acre operation with about 30 full-time employees and 20-40 acres in production at any one time. Located less than a 2 hour’s drive from several markets, Frog Song provides organic products year-round to four farmers markets and wholesale accounts in Gainesville, Orlando, St. Augustine, and Tampa, and through an online-order, customizable-box CSA program. At this stage, John is happy with the size of the operation, and focused on improvements to the overall farm. “Now we’re just trying to fill in the efficiency of what we are doing. We don’t really want to get a lot bigger but we want to get more efficient and more profitable, being able to do more with less resources, essentially,” he said. Frog Song is a highly diversified farm producing vegetables, herbs, flowers, orchard crops, pork and poultry products, and legumes. For John, balancing the livestock and crop enterprises is key. “Something to think about is how all this scales,” he said. From his perspective, scaling “needs to match the fertility, the planting, and the marketing…and if one of those is way out of whack, the business might fail.” So while Frog Song could produce a lot more pork and eggs, keeping a system that is balanced, where the amount of livestock fits the crop systems, is John’s recommended strategy. “People are looking at one way or the other, like ‘I’m going to be a pig farmer or a chicken farmer’, well, that’s 1/8th of what you do, or 1/12th of what you do, and you base the rest on what grows really well in your area and what resources you already have available rather than trying to bring in too much of the resources that will end up driving you out of business. If you depend too much on other resources, eventually, when the prices of those resources change, your business model will have to change, very rapidly, or else you won’t stay in business.” Why integrate livestock with crop production? Speaking about why John and Amy decided to include animals from the onset, John says, “The primary reason we integrate livestock is to turn a liability into a resource.” For Frog Song, that means pigs are brought into sweet potato fields following harvests to help clean up ‘seconds’ and bits left behind that can otherwise harbor pests. In the warmth of the southeastern region where Frog Song is located, a sweet potato weevil thrives. The highly mobile bug can ruin inventories and crops in fields. Non-organic controls include herbicide applications to sweet potato fields following harvests, or soil fumigants. As an organic farm, Frog Song had to find other methods. “We decided pigs were the best way to plow over the land without using a lot of diesel. So the pigs will take sweet potato scraps and turn it into something that’s a very high-value product: organic bacon. Better than organic, it’s actually pasture-raised and on organic pasture!” Another liability-turned-to-resource can be seen in the orchards . Chickens are ranged under established (2 years old or more) stone fruit trees after fruiting. As they scratch and peck around the trees, they effectively reduce plum curculio, millipedes, cutworms and other lepidoptera pests. To make the most of the benefits of the chickens’ manure, feed is concentrated around the base of fruit trees to maximize the time they spend scratching weeds and leaving behind manure. Cover crops and livestock integration On farms with integrated systems of crops and livestock, cover crops can provide valuable forages. At Frog Song, cover crops are planted year-round, and almost always include a multi-species mix. From November to February, winter rye, coker oats, and wheat are planted. Buckwheat, 4 types of millet, and sorghum-Sudan grass go in from March to October. And from April through August, John plants Sunn Hemp as a stand-alone. All of these crops, in addition to certain cash crops like the sweet potatoes, are eventually grazed by animals. Sunn Hemp is planted as a stand-alone cover crop in a pear orchard. “This would be a good time to graze it down by pigs, if you needed to. Sunn Hemp is kind of our backup plan for pig grazing. We try to have enough millet and sorghum and buckwheat after the sweet potato crop, and if we fail at any time, then we have acres and acres of the Sunn Hemp that would be a decent forage for them.” John recommends grazing sunn hemp only until about 20 inches tall. At about waist-high, it becomes too tough, high in a particular acid, and the pigs “just won’t eat it,” he says.  Also of note: for grazing pigs in this area, the fence would be placed to exclude the pigs from the pear trees. The choice of which cover crops to plant for grazing centers around three questions for John. One, will the animals eat it, and at what stage is best to start grazing? Two, how much does it cost to establish, in both time and expenses, especially given that the cost of cover crop seeds can vary from year to year? And three, how does the crop fit in with the rotation? The answer to that third question, for Frog Song, has special implications for legume cover crops. Since one of Frog Song’s cash crops is legumes, they need at least 3 years in the rotations without legumes in order to avoid building up diseases like white rot. Sunn Hemp seems to be a distant enough relative that it remains in the cover-crop mix at Frog Song, and does not contribute to buildup of diseases affecting legume cash crops The switch to on-farm breeding For years at Frog Song, piglets were purchased off-farm, but after some time, John decided it was best to breed their own pigs on-farm. “After being in business for some years,” he explains, “sometimes the piglets aren’t there when you need them to be there, in your cycle.” Since beginning on-farm breeding with Red Wattle Hogs, the animals are bred and available at times that suit the farm, and the animals “stayed in good health and stayed productive.” To maintain healthy genetics, a few sires from different lines are brought in to live on site. A few sows cycle through the “Honeymoon Suite” to breed with them, and then are introduced to farrowing pens, which are “good spots on the farm…basically giving the sow the best of what there is in that moment of the year,” with plenty of shade and quality forage. Within 7-14 days, the piglets have begun to graze the forage and are learning the cycles and systems of Frog Song. “Certain animals can be pretty much addicted to grain,” John explained. “They won’t go forage for themselves, they’ll just wait for when the grain comes, then they get really nasty to have to battle out their siblings or bunkmates for that grain. In our system, we’re looking for the pigs who just want to go plow up any part of their block, go find their own sweet potatoes, and there’s really no way that a bully pig can dominate that system: they’ve all got plenty to eat, they’re stress-free, and by the time they get to the end of the block, there’s a new block waiting for them.” Adaptations in infrastructure for livestock Two of the most important pieces of infrastructure for livestock at Frog Song are electric fencing and animal housing. Training workers so that each understands how electricity flows through an entire fencing system has been key to being able to troubleshoot problems in the field quickly without slowing other parts of the operation down. And to keep a careful eye on the electric systems, John recommends having one person who is responsible for checking systems at least once a day. At Frog Song, handlers check the systems twice a day. Electric fencing is key to the paddock systems at the farm, typically set up as block-paddocks that are fractions of a longer, rectangle-shaped field. The animals move across the field into a new paddock every 5-7 days. For livestock housing, one important adaptation has to do with the clay soils at the farm: John has moved away from anything with wheels, such as chicken houses on trailers, because clay gets into tire seals, ruins them, and the seals need to be replaced often. New housing structures are custom-built using 2-inch metal tubing, in a design that can be picked up with a front-end loader and easily moved with a tractor. Risks of raising animals and crops together Understanding the risks of raising livestock is simple, but it is of the utmost importance. John explains, “How do you grow vegetables and raise animals at the same time? This is a really important part to talk about. This is where the farm can go really wrong if you don’t acknowledge your risks. But the risks are simple: you don’t want to get manure in the product in any way possible!” The plans for dealing with this simple risk are taken seriously. In order to know where the risks lie, the farm identifies where manure is traveling, from paddocks to packing shed or plantings. These “Critical Control Points” (CCP’s) are part of the farm’s HACCP plan (Hazard Analysis and Critical Control Point Systems plan), which means they are “identified, verified, and validated” so they all get met. With animals moving around the farm often, John starts thinking about where the manure will go the moment he starts designing the layout of fields. That means thinking about the flow of water. “I’d say, start there, as a farmer,” he suggests, “you need to look at ‘Which way does every drop flow?’ As it comes out of the sky and hits your farm. Then you need to know where your paddocks are, where you’re going to raise your crops, and what kind of crops you are going to raise (low or high risk).” Having staff trained in safe handling and protocols for visiting anywhere on the farm with manure or entering packing areas is also a necessary part of managing the CCP’s and risks of manure. Benefits you can see: soil fertility Despite the risks, workload, and infrastructure needs, having pigs and chickens is an integral part of what makes Frog Song successful. When asked about the benefits of the 12+ years of crop-livestock integration at the farm, John spoke about one key indicator of soil health: the health of the cover crops. In the first few years, some fields barely sustained a cover crop. Other fields with more clay had large incongruencies in growth over the area and in how water moved through them (areas with poor drainage and large puddles). Now these same fields produce uniform, lush patches of cover crops, and as John reflects on a decade-plus of integration, he says, matter-of-factly, “every year certain blocks are getting better.” Visit Frog Song Organics’ webpage. BACK to Crop-Livestock Integration Resources Wes 2023-09-04T19:18:56-04:00 CONTACT US Phone: 831-426-6606 Email: office[at]ofrf.org P.O. Box 440, Santa Cruz, CA 95061 If you use a screen reader and need assistance, please call us at 831-426-6606. Recent News School Lunches Might Look Different This Year: Federal Funding Freezes Pinch School Food Programs September 8, 2025 A Trio of Comments: OFRF Chimes in on USDA Actions September 5, 2025 Farmer-Led Trials Program Spotlight: The Woven Trifecta September 2, 2025 CONTENT Home Research Programs FAQs About Get Involved Careers JOIN OUR NEWSLETTER Sign Up to Receive Future News Updates and Action Alerts Privacy Policy SUPPORT OFRF Thank you for your contributions! We couldn’t do our work without your support. We hope you will consider donating today via our online form or by donating a non-cash gift, such as a vehicle, stocks, or IRA contribution. Feel free to email give@ofrf.org with any questions! DONATE Copyright 2025 Organic Farming Research Foundation | All Rights Reserved | Site designed and developed by Forest Design LLC Instagram LinkedIn YouTube Page load link Translate » Go to Top"
    },
    {
      "url": "https://frogsongorganics.com/orderonline/",
      "text": "Online Produce Ordering | Frog Song Organics | Hawthorne FL Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar Order Online Click here for: Online Ordering Become a CSA member CSA Members should also register as customers. Please use the online ordering system to purchase your Membership. Need help setting up your account? Call us: 352-468-3816 Email us: at info@frogsongorganics.com Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/",
      "text": "Join Our CSA | Central FL CSA Programs | Frog Song Organics Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar Join Our CSA A Great Way To Connect with our Farm CSA = Community Supported Agriculture Purchase a share of our farm’s harvest and receive your share of the harvest: a weekly box of fresh-picked, locally grown, certified organic fruits & vegetables. If you’re looking for an alternative to the grocery store that supports local, independent farmers, read on: Click Here to Register for 2025 CSA Shares Pre-pay for a season, and receive a weekly box of seasonal, certified organic fruits & veggies from our farm, plus bonus items from regional partner growers. We select in-season items from our farm each week and work to provide the best variety and quality possible throughout the growing season. We offer a “Farmer’s Choice” membership which includes seven to ten items weekly. Sign up once for the season, and receive a weekly box with no additional effort. These shares are not customizable, there are no substitutions. If you want to become a member and select your own items, please use the “Pre-Paid Your Choice Membership” option, which is a one-time payment of $500. You will need to log in weekly to place your order and can choose from any items in our store. When you use up your credit, you can purchase more at any time. Read the Full Membership Terms Here Take a VIDEO TOUR of our farm and CSA OUR SEASONS & PRICING 2025 CSA Season Dates are listed below. Members receive 13 distributions per season. Our new subscription model will automatically renew your membership for the following season, unless you let us know you would like to cancel. Pricing varies by location, each season is thirteen weeks long. Farm Gate & All Farmers Market Pickups: $520 Individual Size Per Season ($40/week) $819 Family Size Per Season ($63/week) All Other Pickup Locations $598 Individual Size Per 13 week Season ($46/week) $936 Family Size Per Season ($72/week) ** Home Delivery adds $8-$20 per week depending on your location What’s Growing? Download Our Updated Crop Calendar WINTER 2025: Tuesday, January 7th – Saturday, April 5th Kales, radishes, turnips, lettuces, arugula, bok choy, carrots, chard, fennel, snow peas, English peas, sweet potatoes… SPRING 2025: Tuesday, April 8th – Saturday, July 5th Strawberries, lettuces, carrots, radishes, sweet corn, potatoes, peaches, plums, figs, squash, cucumbers, beans, kohlrabi, spring onions, cabbage… SUMMER 2025: Tuesday, July 8th – Saturday, October 4th Potatoes, watermelon, summer squash, cucumbers, peppers, okra, basil, eggplant, tomatoes, cucumbers, persimmons, fresh roselle hibiscus… FALL 2025: Tuesday, October 7th – Saturday, January 3rd Sweet potatoes, green beans, chestnuts, kale, roselle hibiscus, radishes, turnips, bok choy, arugula, collards, lettuces, mustard greens, scallions … We now accept SNAP/EBT for CSA Memberships. The Fresh Access Bucks matching grant program pays for 50% of your share! Matching is limited to $40 per day. First, create your free account for our online store. Then, please contact us to register for a CSA membership using SNAP, payment cannot be accepted directly through our website. Please contact us at csa@frogsongorganics.com if you have any questions. Use This Link to Register Online Today! WHERE CAN I PICK-UP MY SHARE? Home Delivery is available in select Gainesville, Orlando, Jacksonville, Tampa, and Volusia County areas. Check out our interactive map to search your address. List of Locations – Click Here Our goal is to grow as much food as we can that goes into your share.  We also partner with other local, certified organic farms to add diversity to your share throughout the growing season.  We will always be transparent as to where items come from, sources and producer practices are listed on our website. Download our Updated Crop Calendar CSA – Community Supported Agriculture – is a partnership between community members and the farmers that feed them. At Frog Song Organics CSA, members make a commitment to the farm, and together we produce high quality produce grown in an ecologically and socially responsible manner. Each week members pick up tasty, fresh, produce at one of our convenient sites. CSA membership helps you experience the seasons through food, eat more organic vegetables, and forms a direct connection between you and where your food comes from. CSA membership is a very special opportunity for you to support the creation of new sources of healthy food and jobs in our community. Your investment will yield a weekly bounty of locally grown produce and support alternatives to the conventional food system. We hope you will join us in co-creating a sustainable food system and become a member of our farm. Make a healthy choice for your family and your community, and eat like your life depends on it! Each week, “Farmer’s Choice” members receive a selection of at 7-10 vegetables and/or fruits being harvested from our farm and partner producers. All of the fresh produce grown at our farm in Alachua County is certified organic. This selection changes throughout the season and could include items such as fresh herbs, kale, radishes, carrots, beets, cabbage, green beans, lettuce, tomatoes, eggplants, peppers, onions, hot chilis, sweet corn, squash, cucumbers, potatoes, strawberries, watermelons, Asian pears, persimmons, chestnuts, pumpkins, squash, arugula, turnips, collard greens, fennel, basil, dill, sweet potatoes, and much, much more! CSA is an investment, which means there are both benefits and risks. In a good season, your share will be bountiful and diverse. In the event of a crop failure due to a freeze or hurricane, your share might look a little different. You can think of your CSA membership as a reservation for your food in our field. We take care of your share of the field during the season, and you get what we harvest. As farmers we will do our best to ensure that members always receive the best selection and quality possible. The benefits of CSA membership with Frog Song Organics include: A seasonal eating experience – you get to try different foods at the peak of their flavor and nutrition. Taste new varieties of vegetables and learn about how they grow and how to cook them. Arrive at the end of the market and have a box saved just for you! (No rushing to get there early to get the first pick). Recipes on how to use produce Invitations to on-farm events Reduce your carbon footprint by eating more local foods, and contribute to the development of a sustainable, local food system! Increase your consumption of certified organic produce – grown without the use of synthetic herbicides, pesticides or fertilizers. Support ethical relationships with farm workers and the creation of jobs in our community. Save money and take control of your health by cooking more meals at home – you’ll always have fresh produce to work with. Get to know your local farmer, and be able to visit your farm! Increase community food security by sustaining food production in your region. The benefits of the CSA to the farmer include: Reduction of financial risk because our costs of production are paid up front (meaning we have to borrow less money). We can focus on growing the best food possible for the rest of the season knowing that our crops are already sold. We really like getting to know our customers and seeing familiar faces each week. We love seeing families nourished by healthy food! Being able to hire more people and count on steady work throughout the season. *Workplace/School delivery is available for groups of 10 or more members. Please contact us at csa@frogsongorganics.com to arrange your own pick up site at your home, workplace or school. Site Hosts with at least six members receive a complimentary share! Farm Shares – Pastured Animals We take pride in humane and environmentally sound animal husbandry. Egg shares and pork shares are available, please contact us for more details. All of our animals live outdoors, on pasture, and are rotated around the farm for the maximum benefit to the land, and best nutrition and quality of life for the animals. All animals are supplemented with certified organic, soy-free feed. Eggs: We choose not to use sanitizing chemicals on our eggs and we do not grade them by weight. According to USDA regulations, this means they may not be labeled for human consumption. We currently sell eggs as pet treats and have a feed master registration. To receive eggs, please join as a member and purchase an Egg Share. At this time, eggs are not SNAP eligible. Pork Share packages are processed at non-inspected facilities, and you receive your share of a whole animal, with transportation and butchering service included in the price. We also now offer pasture raised pork which can be added to your order. **Please note, value added kitchen products (elderberry syrup, kimchi, jam, etc), and any animal products are not certified organic, due to our low volume of these products and lack of certified processing facilities in our region. Our kitchen products are always made using all organic ingredients.** Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://skyorganics.com/pages/contact-us",
      "text": "Get in Touch - Contact Us Today - Sky Organics Free Shipping on Orders over $50 Open Menu Shop Most Loved Products New Arrivals Shop All Oils & Serums Face Body Hair Essential Oils Culinary Butters & Balms Lip Body Masks & Mists Face Body Insect Repellent Collections Glow Skincare Cotton & Towels Swabs Balls Pads Face Towels DIY Essentials Oils Butters Others About Us Our Story Our Product Standards Our Sustainability Commitment Recycle with Us Blogs & Updates About Us About Us Store Locator Search Shop Back Shop Most Loved Products New Arrivals Shop All Oils & Serums Back Oils & Serums Face Body Hair Essential Oils Culinary Butters & Balms Back Butters & Balms Lip Body Masks & Mists Back Masks & Mists Face Body Insect Repellent Collections Back Collections Glow Skincare Cotton & Towels Back Cotton & Towels Swabs Balls Pads Face Towels DIY Essentials Back DIY Essentials Oils Butters Others About Us Back About Us Our Story Our Product Standards Our Sustainability Commitment Recycle with Us Blogs & Updates About Us Back About Us About Us Store Locator Open Menu Shop Most Loved Products New Arrivals Shop All Oils & Serums Face Body Hair Essential Oils Culinary Butters & Balms Lip Body Masks & Mists Face Body Insect Repellent Collections Glow Skincare Cotton & Towels Swabs Balls Pads Face Towels DIY Essentials Oils Butters Others About Us Our Story Our Product Standards Our Sustainability Commitment Recycle with Us Blogs & Updates About Us About Us Store Locator Account Search View Shopping cart 0 0 Open Menu Get in Touch We’d love to hear from you! Have a question about ingredients, products, online orders, or shipping?  Please contact us using the below form. We’re here from Monday to Friday and will try to get back to you within a day of your request. You can also check out our FAQ page and you may find your answer there! For all influencer and affiliate inquiries, please email us at influencers@skyorganics.com . Your Name Email Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Follow Us on Social Contact Us Refund Policy Accessibility Statement Store Locator Privacy Policy Terms of Use Do Not Sell or Share My Personal Information ManyChat Terms FAQ B Corp Certified Subscribe to our Newsletter and receive 20% OFF* on your first website order. Your Email By submitting this form, I confirm I am a US resident 18+ and agree to Sky Organics' terms of use (which include an arbitration provision to resolve disputes) and to receive marketing and promotional communications (including emails) from Sky Organics. I have read and acknowledged Sky Organics' privacy policy . You can unsubscribe here . *Discount code does not apply to Buy with Prime purchases. Submit This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Follow Us on Social TERMS OF USE PRIVACY POLICY © 2025 SKY ORGANICS Amazon American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa This site is intended for U.S. Consumers Your Cart Your cart is currently empty. Click here to continue shopping . Search Account Thanks for contacting us! We'll get back to you shortly. As partners with Ecologi, we are planting one tree for every sign up we receive. Thank you for being part of the change! Thanks! We will notify you when it becomes available! The max number of items have already been added There is only one item left to add to the cart There are only [num_items] items left to add to the cart"
    },
    {
      "url": "https://frogsong.localfoodmarketplace.com/Producer/7af0accd-18b4-4a89-95b7-978cc2951dd8",
      "text": "Frog Song HOME PRODUCT LIST MEET YOUR PRODUCERS JOIN OUR CSA SIGN UP! GIFT CERTIFICATES CONTACT US HOME PRODUCT LIST MEET YOUR PRODUCERS JOIN OUR CSA SIGN UP! GIFT CERTIFICATES CONTACT US Shop Login 0 Continue Shopping For Distribution on: Fri Sep, 12 There are no items in your cart for this distribution day. Shop Total: $0.00 Subscription Orders Top Producer Select Producer Select Producer Buddha's Garden Clem's Organic Gardens Farm Supply Frog Song Farm (Not Certified Organic) Frog Song Kitchen (Not Certified Organic) Frog Song Organics Fungi Jon (Not Certified Organic) Hickory Meadows Organics High Springs Orchard (NOT CERTIFIED ORGANIC) Little Pond Farm LNB Groves Mud Rooster's Local Honey (Not Certified Organic) New Sprout Organic Farm Oso Sweet Farms LLC Passion Organics Farm Rainbow Star Farm (Not Certified Organic) Santa Fe Organics St. Simon's Farm (Urban Vegetable Project) Sweetwater Coffee Coop TendWell Farm The Family Garden (not certified organic) Tracy Lee Farms (Not Certified Organic) Watsonia Organics Yaupon Brothers American Tea Co. Frog Song Organics Contact: John Bitter & Amy Van Scoik Address: 4317 NE US HWY 301 Hawthorne, FL, 32640 Phone: 352-468-3816 Website: https://frogsongorganics.com/ About Us Co-founders John Bitter and Amy Van Scoik started Frog Song Organics in the fall of 2011. Our mission is to produce nutritious food for our community and create meaningful employment opportunities. We also aim to demonstrate that farming can be accomplished with the “triple bottom line” – with respect to our human, ecological and economic resources. We started with help from family, friends and neighbors, working in trade for food. Over the past five years, we have grown from two planted acres to managing over sixty acres.  We are located in eastern Alachua County about 30 minutes from the University of Florida in Gainesville. We grow over eighty different types of produce, herbs, fruits and flowers. We grow mainly in the field and also in several greenhouses/hoophouses. Everything is grown in soil for real flavor, we do not use any hydroponics. We also raise laying hens for eggs and have recently started a pastured pork program for our CSA members. We also produce value-added goods such as jams and fermented foods like kimchi and pickles. Our farm, and all of our fresh produce, is certified organic by Quality Certification Services.  We have been certified organic since 2012. We currently sell at several regional farmers markets, directly to many fine restaurants and grocers, and to distributors and buying clubs. We operate a CSA program (Community Supported Agriculture) with over one hundred members. Our team is made up of a group of amazing, hard-working, and caring people who cooperate to produce our crops. At our peak season, we have had up to twenty-five staff members. We offer a variety of benefits to our full time staff including paid sick leave, life insurance, prepared lunches, and a paid vacation program. We recently started offering a healthcare stipend. We pay for the legally required workers compensation insurance coverage (which is not standard on many farms who pay “under the table” or employ undocumented workers). We also pay legally required employment taxes for our staff. We work with both domestic and international crew members. Our permanent, year-round crew includes folks from Michigan and Florida. Some of our seasonal staff is from Puebla, Mexico utilizing the H-2A guest worker visa program. This program, offered through the Department of Labor, allows guest workers to travel safely across borders and return each summer to visit family at home. It also provides our farm with experienced workers to keep up stable production to feed people in our community. Agriculture is hard work and we truly appreciate everyone who has worked with us on the farm in one way or another, and our efforts will forever be in memory of our neighbor and great friend, Dave Stanley, second from left in our 2012 team photo pictured. Our long-term goals include adopting solar power, improving our on-farm fertility system and composting program, and opening an on-site farm stand for retail customers to purchase produce and enjoy family-style farm house cooking. We have been approved for a REAP solar grant which covers 25% of the project costs for a solar array pole barn, and it's up to us to raise the other 75% of the costs which total approximately $49,000. Scheduled for construction in 2020!! If you are interested in financing the project with a low-interest private loan, please contact us at info@frogsongorganics.com Practices USDA Certified Organic by Quality Certification Services since 2012 Privacy Policy Terms of Service Refund Policy Producer Login Contact Us © Powered By - Local Food Marketplace"
    },
    {
      "url": "https://frogsongorganics.com/about-us/contact-us/",
      "text": "Contact Us | Central FL Organic Farm | Frog Song Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar Contact Us CSA questions? Email csa@frogsongorganics.com General or sales inquiries? Email info@frogsongorganics.com or fill out the form below. Prefer phone calls? Give us a ring at (352) 468-3816 . Mailing address & physical location: 4317 NE US Hwy 301 Hawthorne, FL 32640 (Visitors/private tours welcome by appointment only.) Sorry. This form is no longer accepting new submissions. Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://frogsongorganics.com/join-our-csa/member-resources/",
      "text": "Member Resources & Schedules - Frog Song Organics | Organic Farm | Central Florida Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar Member Resources & Schedules Questions about your CSA membership? Contact us by email: csa@frogsongorganics.com Call us: 352-468-3816 Going out of town? Please email to place your account “on hold” and we won’t pack a box for you while you’re gone. You can also send a friend or relative to pick up your box anytime. Just tell them where to find us and they will need to tell us your name to get your box. MARKET CREDIT: If you schedule a week of delivery hold for your CSA box, you will receive an account credit for that box which you can use at the farmers market or to special order items such as eggs, flowers, jam, kim chi, extra vegetables, etc. Need to make a payment? Send us a check in the mail: Frog Song Organics 4317 NE US Hwy 301 Hawthorne, FL 32640 Call us during Monday-Friday 8 am – 4 pm to pay by phone: 352-468-3816 2025 CSA SCHEDULES WINTER: Tuesday, January 7th – Saturday, April 5th SPRING: Tuesday, April 8th – Saturday, July 5th SUMMER: Tuesday, July 8th – Saturday, October 4th FALL: Tuesday, October 7th – Saturday, January 3rd Need all the fine print? Here is our current CSA policy. Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    },
    {
      "url": "https://frogsong.localfoodmarketplace.com/",
      "text": "Frog Song HOME PRODUCT LIST MEET YOUR PRODUCERS JOIN OUR CSA SIGN UP! GIFT CERTIFICATES CONTACT US HOME PRODUCT LIST MEET YOUR PRODUCERS JOIN OUR CSA SIGN UP! GIFT CERTIFICATES CONTACT US Shop Login 0 Continue Shopping For Distribution on: Fri Sep, 12 There are no items in your cart for this distribution day. Shop Total: $0.00 Subscription Orders Top Have you joined our CSA yet? CSA stands for Community Supported Agriculture. We make meal planning easy with our memberships! You invest in your share of the harvest, and we work to fill your very own box with fresh, local and organic items every week. Gift Certificates are available! Support a local business and give your friends & loved ones fresh, healthy food - a good meal is a gift everyone can enjoy. Current Farmer's Markets - times and locations Grove Street Farmers Market Ormond Beach Farmers Market St. Augustine Amphitheater Farmers Market Winter Park Farmers Market Please stay connected by joining our email list and making sure that we are added to your contacts list. We are also posting regular updates on our Facebook page: https://www.facebook.com/FrogSongOrganics/ and Instagram: https://www.instagram.com/frogsongcsa/ Place your order online, for pick up at the farm, at your market, or delivery to your restaurant or home. We serve the Gainesville, Jacksonville, St. Augustine, Tampa Bay, Ormond Beach, Palm Coast and Orlando Areas. See a map of locations here. * Online orders must be received two days before your pick up. If you do not see the pick-up day or location listed that you need, please contact us. The prices listed are specific to your pick up or delivery location. Once you create an account and choose a location , you will be able to see pricing. **If you are a commercial customer, please contact us first to set up your account. Phone: (352) 468-3816 Email: info@frogsongorganics.com This is our online store - Return to www.frogsongorganics.com to learn more about the farm. Privacy Policy Terms of Service Refund Policy Producer Login Contact Us © Powered By - Local Food Marketplace"
    },
    {
      "url": "https://frogsongorganics.com/about-us/faq/",
      "text": "FAQ | Frog Song Organic Farming | Central Florida Frog Song Organics | Organic Farm | Central Florida Organic fresh produce and more Home Order Online News from the Farm Farm News Special Events Press Video CSA News and Shares Educational Resources Farm Incubator Recipes Main Dish Soups Breads and Cakes Salads Brunch Sides Beverages Desserts The Farm About Us Contact Us Join Our Team FAQs Locations Farmers Markets Retailers and Distributors Restaurant Partners Join Our CSA Member Resources & Schedules Distribution Veggie Spotlight Crop Calendar FAQ What is the Membership Agreement? Please read here. What crops do you grow and when are they ready? Please see our Crop Availability Calendar for the eighty two types of produce we grow! You’ll see everything from Arugula to Zucchini. We grow a diverse range of specialty vegetable crops, tree fruit including citrus, persimmons and stone fruit, strawberries, melons, root crops including potatoes and carrots, sugar cane. We also grow medicinal crops including tulsi, turmeric, moringa. Do you practice methods like chemical free, organic, regenerative, etc.? We practice a combination of certified organic and regenerative practices. We do use some OMRI approved pest control materials as well as biological controls such as predatory nematodes. We utilize cover crops and rotational grazing to build soil, we do not use any plastic mulch to grow in and we also do use mechanical tillage to prepare some beds and kill weeds. What do I get in a CSA Share? Fresh vegetables, fruits and herbs. We source from our farm and partner growers around Florida and the Southeast. We will always identify the source of the produce. In Summer 2020, we will be working with new certified organic partner growers located in North Carolina to provide a wider selection for our members. Many weeks we offer eight or nine items. The exact amount can vary depending on the harvest, this is representative of what we have done the past four years. Add On Items – Eggs, Pork, Flowers: Our eggs are not certified organic. We raise our hens outside, free-ranging, and supplement them with certified organic, soy-free feed. Our kitchen products produced with all organic ingredients, the finished products are currently not certified organic. Pork shares are not certified organic. The locally sourced piglets (Lola Farms) are brought to the farm at about 8-10 weeks old after weaning, and from that point are grazed on crop land and pasture, and supplemented with certified organic and soy-free swine feed. *All of our animal products are available to CSA members only, and are “not labeled for human consumption” due to USDA regulations. If you require pork that is processed under USDA inspection, please contact us to purchase of a whole animal and to arrange special handling. We also offer USDA inspected retail cuts from other local producers, including Tracy Lee Farms. How much does it cost? CSA Memberships range from $35-$65 per week, depending on the size of your share and whether you pick up or get home delivery. Payment is due in full for the season via cash, check, or credit card online. Various details apply, please contact us at csa@frogsongorganics.com if you have any questions. Do you accept SNAP/EBT/P-EBT? Yes! Please set up your account and place your order (a credit card is required to guarantee the order) then call our office at 352-468-3816 to provide your SNAP card information to process instead of your credit card. We are also a partner with the Fresh Access Bucks (FAB) matching grant, which will pay for 50% of your Florida-Grown fresh fruits and vegetables. *Please note, our eggs are not eligible for SNAP or FAB matching because they are sold as pet treats. You can pay for these items separately with a credit card. *For CSA Members, we will process payments once every four weeks due to the regulations on accepting SNAP ahead of time for food. Where can I pick up? We offer multiple pick up locations in Gainesville, at the farm in Hawthorne, in Winter Park, and St. Augustine, Florida. Please contact us to arrange a custom delivery to your home, school, office, gym, place of worship, etc! All you need is sheltered space for drop off, and a group of a ten people ready to join. The host of the pick up site gets a complimentary share! Is a CSA membership right for me? Yes: CSA is great for people who like to try new foods, who cook several nights a week at home, who have a dependable schedule and can pick up at the same time each week, who prefer getting a box full of surprises rather than shopping from a specific list, who want to eat lots of greens & root veggies, and people who tend to arrive later at the market but still want to get great veggies. CSA membership is great for people who want to know where their food is coming from every week, and can budget ahead for their produce, and who want to support a local business. Maybe Not: CSA membership is not good fit for picky eaters, people with allergies/restrictions to eating entire families of vegetables (nightshades, for example), people who travel a lot with erratic schedules, people who don’t like to cook, anyone who cannot tolerate improvisational cooking, people who cannot budget for produce for several months at a time. If any of these apply to you, please come to the market or shop online and select exactly what you want, when you want it. Can I work for my share? Limited work-trade opportunities are available. You must be able to commit to the same day and time each week for the entire season. Please contact us for more details. Do I get to pick what produce I get each week? No, we carefully select and pack the Farmer’s Choice box for you ahead of time. Each week all of the CSA members typically receive the same items throughout the week unless we have to adjust based on crop availability. If you’d like to select your own items, come to the farmers market or place an order online. What if I don’t like an item? We recommend sharing with a friend, co-worker or neighbor, or giving it a second chance with a new recipe. We are not able to accommodate substitutions requests for individual vegetables. If you’d like to select your own items, come to the farmers market or place a customized order online. I will be out of town – what do I do? You can have someone else come and pick up your share at the designated time and place. You can also schedule a delivery hold in advance by emailing us at least three days in advance of your pick up day. You will receive a credit for that week’s share value which you can use to purchase other items at the market or apply towards the next season’s membership. This credit expires at the end of the season. What happens if I forget to pick up my share? The produce will be used for meals on the farm, donated to a local shelter, or fed to our pigs and chickens. It won’t be wasted. If you miss a week, you do not receive double the following week. Host sides are not responsible for holding shares for pick up past the designated time, we apologize for any inconvenience this may cause. I am a student, and I leave Gainesville in May. Can I still be a CSA member? We recommend placing online orders when you need food. Can I get a refund after I join? CSA memberships are not refundable except under these conditions: We can no longer service the delivery day or location as agreed when you joined. We do not receive enough memberships to serve your location and we have to cancel delivery. You have to move away (really far, like out of state, not just across town). For workplace/school drop offs, you may receive a refund if you are no longer employed by the organization where your pick up is located or you no longer attend the school. Email us at frogsongcsa@gmail.com to arrange. You can also call our office at 352-468-3816 with any questions you may have and someone will get back to you soon! Do you raise animals or animal products, and do you incorporate animals into crop rotation? Yes we raise heritage hogs on pasture and laying chickens on pasture, and rotate them all over our farm. We supplement with organic, soy-free feed (it does contain corn). How would you describe your farm? We are a diversified, certified organic production farm, focused on providing high-quality, nutrient dense, and flavorful food to our community. We also support a dozen or more regional organic farms through our partner producer program, and serve as a food hub to help other growers distribute their products to local farmers markets and restaurants. Latest Recipes CSA 2025 SUMMER WEEK 8 CSA 2025 SUMMER WEEK 7 CSA 2025 SUMMER WEEK 6 Copyright © 2011 - 2025, Frog Song Organics, All Rights Reserved Site by Ghost Pepper Creative"
    }
  ]
}