{
  "fuentes": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://guidetoflorida.com/kissimmee/venue-events/fuma-lounge",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/kissimmee/venue-events/fuma-lounge",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.partyslate.com/venues/fuma-lounge",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "lva@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "edia@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.comphone"
    },
    {
      "url": "https://www.shopfuma.com/contact-us",
      "email": "customercare@pharmapacks.com"
    }
  ],
  "mails": [
    "contact@partyslate.com",
    "customercare@pharmapacks.com",
    "directory@guidetoflorida.com",
    "edia@groominglounge.com",
    "info@groominglounge.com",
    "info@groominglounge.comphone",
    "info@reception-plus.de",
    "lva@groominglounge.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "fumalounge.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * First Datenschutz Surname E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://guidetoflorida.com/kissimmee/venue-events/fuma-lounge",
      "text": "FUMA Lounge - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Kissimmee Food & Drink FUMA Lounge FUMA Lounge Share 2025 Best of Florida Honorable Mention Winner Bars 5281 W Irlo Bronson Memorial Hwy, Kissimmee, Florida, 34746 Send Message 407-479-9842 Vote for Us! | Bars Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name FUMA Lounge Visit Website https://www.fumalounge.com Online Social Profiles Phone Number 407-479-9842 Location 5281 W Irlo Bronson Memorial Hwy Kissimmee , Florida , 34746 United States About FUMA Lounge FUMA Lounge is the perfect venue for any intimate concert/event, offering luxury seating and an amazing atmosphere. While larger venues cater to thousands, our space is ideal for gatherings of up to 400 people. We specialize in Arab concerts and events, but also host a variety of private events and non-Arab concerts, making us a versatile choice for any occasion in Orlando, FL. × Map View Get Directions Cancel FEATURED LISTINGS! Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 LIME Fresh Mexican Grill Plantation, FL 33324 Website (407) 383-5015 Nino's Bakery & Cafe Punta Gorda, FL 33950 Website 941-833-8912 READ AND REAP! Southern Comfort With a Side of Soul! Florida’s Chip Shot at the Future Englewood’s Sweet Spot! MORE TO EXPLORE! Best of Florida Voting Best Bars in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.partyslate.com/venues/fuma-lounge",
      "text": "FUMA Lounge | Kissimmee Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas FUMA Lounge Find Venues / Florida / Kissimmee / FUMA Lounge Photo credit: FUMA FUMA Lounge 5281 W Irlo Bronson Memorial Hwy, Kissimmee, FL 34746, USA Max Seated 250 Max Standing 300 Request info Favorite Overview Gallery 1 About FUMA Lounge We are a 5000 square feet lounge with comfortable seating, two bars, stage and a private room. Over 150 parking spaces available. We host baby showers, bridal showers, birthdays, anniversaries, bachelorette/bachelor parties, engagement parties, corporate outings and more. Pricing Packages Pricing Info We’re more than just a venue. \nWhen you rent our space, you have access to 4,000 square feet of fully furnished space, featuring a stage with a backdrop, multiple screens throughout the lounge, professional sound and lighting, and a private room. \n\n  > > >  Beyond the space itself, we can provide a full open bar, a coffee/tea/dessert bar, and catering service if desired. We can also offer entertainment options.\n\nWhat’s included really depends on the type and scale of your event, as well as your specific needs. We host everything from small private gatherings to large corporate events, concerts, and other public events. Request a Quote FAQs 5 Does the venue have a liquor license? Yes, we do. We’re a fully licensed lounge with a full bar, offering a wide selection of cocktails, beer, wine, and bottle service. Does your venue have on-site parking available for guests? We have plenty of free parking available to easily accommodate all of your guests / attendies. What is the venue capacity? Our venue can easily host up to 250 guests with full seating, or up to 300 guests with a partially seated setup. What is included in the venue rental cost? What’s included really depends on the type of event you’re planning. For a full buyout, you have access to 4,000 square feet furnished space, complete with a stage, backdrop, multiple screens throughout the lounge, and a private room. From there, we can tailor the experience to your needs. How much does it cost to rent the venue? As a fully operating lounge, pricing varies based on the type and scale of your event, as well as the services you’d like included. We provide a detailed quote once we understand the specifics of your event. Map 5281 W Irlo Bronson Memorial Hwy, Kissimmee, FL 34746, USA Follow Us Visit Website Call Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "text": "Contact Grooming Lounge ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 0 0 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection Visit us Account ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection 0 Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers 0 $50.00 away from free shipping $0.00 Subtotal Cart 100% Money-Back Guarantee Your Cart Tax (calculated in checkout) - Shipping (calculated in checkout) FREE Your Cart is Empty shop now SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit Shaving SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits Skin CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers Body BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products Hair SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Beards BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products [hide] Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Built in our Barbershops, not a Boardroom. All Grooming Lounge brand products are developed, tested and used daily in our luxury barbershops and spas. We guarantee you'll love 'em or your money back. Grooming Lounge Collection Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Grooming lounge collection Brands A-Z MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz Brands MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items Deals+ OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Give Us A Call 703.288.0355 Barbershop + Spa DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Add description, images, menus and links to your mega menu A column with no settings can be used as a spacer Link to your collections, sales and even external links Add up to five columns Get In Touch Just reach out to the appropriate department with questions, comments or compliments. We're always happy to communicate with the people who keep us in business. Website Customer Service Email: [email protected] Phone: 866.456.8643 Hours: Mon-Fri 9 to 5 ET Tysons Corner, VA Store Email: [email protected] Phone: 703.288.0355 Tysons Galleria 1732 U International Drive McLean, VA 22102 LEARN MORE > Press and Media Inquiries Email: [email protected] Wholesale Inquiries Email: [email protected] Phone: 800.365.8522 Send Us A Note! Name This field is required. Email This field is required. Message Send Sign Up & Get 15% Right Now PROGRAMS Expert Advice Subscribe + Save Rewards Special Discounts Affiliate ABOUT US Our Story Barbershop + Spa Careers Blog HELP Contact Us/Customer Care FAQs Fast Shipping Policy Generous Return Policy Schedule A Barbershop + Spa Reservation Sign Up & Get 15% Right Now © 2023 Grooming Lounge . PRIVACY POLICY"
    },
    {
      "url": "https://www.shopfuma.com/contact-us",
      "text": "Contact Us | Shop Fuma top of page FREE SHIPPING $49 or more* Contact Us : 718.635.9800 SHOP FUMA ALL YOUR DAILY NEEDS LOG IN / SIGN UP BEST SELLERS HEALTH & BEAUTY HOME & KITCHEN MOBILE & PC BABY PRODUCTS PET SHOP SPORTS & OUTDOORS LAWN & GARDEN FASHION WALLETS & HANDBAGS SHOES Use tab to navigate through the menu items. CUSTOMER CARE Contact Information Return Policy Frequently Asked Questions Privacy Policy CONTACT INFORMATION ​ You will find answers to most commonly asked questions in our FAQ section. Should you have additional questions, please contact us at 718-635-9800, email us at support@shopfuma.com , or click on the Live Chat icon on the right side. Your questions will be answered by one of our Customer Care representatives. Our Customer Service Department is available Monday through Friday from: 9 AM to 6 PM ET ​ By Phone: 718-635-9800 By Email: support@shopfuma.com By Live Chat: Click on the Live Chat icon, at the upper section of the scroll bar. While emails and messages left via Live Chat are not monitored after-hours, we will do our best to respond promptly the following business day. Business hours are subject to change due to holidays or extenuating circumstances. SHOP FUMA ALL YOUR DAILY NEEDS NEWSLETTER SIGN UP SUBSCRIBE Need Help? Give us a call 1-718- 635-9800 FREE SHIPPING on orders over $49 SHOPPING ​ Best Sellers Health & Beauty Home & Kitchen Mobile & PC Baby Products Pet Shop Sports & Outdoors Lawn & Garden Fashion Wholesale MY ACCOUNT ​ Create an account Manage Account Manage Shipping Addresses Order History Track Orders CUSTOMER CARE ​ ​ Contact us FAQ Returns Privacy Policy Sell to Us Employment bottom of page"
    }
  ]
}