{
  "fuentes": [
    {
      "url": "https://fumacigarsocial.com/",
      "email": "info@fumacigarsocial.com"
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "email": "info@cigarinc.com"
    },
    {
      "url": "https://quitsmokingwokingham.co.uk/contact-us/",
      "email": "darren@quitsmokingwokingham.co.uk"
    },
    {
      "url": "https://www.cigarsunlimited.co.uk/contact-us/",
      "email": "sales@cigarsunlimited.co.uk"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "email": "contact@brottar.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/fuma-cigar-social-tallahassee",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/fuma-cigar-social-tallahassee",
      "email": "merchants@giftly.com"
    }
  ],
  "mails": [
    "contact@brottar.com",
    "corporate@giftly.com",
    "darren@quitsmokingwokingham.co.uk",
    "info@cigarinc.com",
    "info@fumacigarsocial.com",
    "merchants@giftly.com",
    "sales@cigarsunlimited.co.uk"
  ],
  "nombre_sitio": "fumacigarsocial.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fumacigarsocial.com/",
      "text": "FUMA Cigar Social | The premier cigar lounge of Tallahassee Home About Us Our Selection View Menu Events Contact / Booking Subscribe Home About Us Our Selection View Menu Events Contact / Booking Subscribe Tallahassee's Premier Cigar Lounge View more Premium cigar service Find your best stick View more \"Wine Down\" Great Wine Selection View more Join our FANTASY FOOTBALL LEAGUE! Weekly Prizes  //  Grand Prize (limited availability) CLICK TO JOIN THE LEAGUE Two Teams DRAFT PARTY, Sunday Aug. 31, 2025 // 5p More Events The FUMA Experience Located in the Midtown area in Tallahassee, Florida, Fuma Cigar Social is a Premium Cigar Lounge dedicated to cigar enthusiast and their guests. From our well stocked walk-in humidor to the state-of-the-art air filtration system that keeps the environment fresh and friendly, Fuma Cigar Social is THE PLACE to sit back, relax and enjoy a fine cigar, a beer, wine or the best Cuban coffee you’ve ever had! You know… life’s simple pleasures. Visit Us! Open hours Sunday: 3 – 10p Monday – Wednesday: 3 – 11p Thursday : 3p – Midnight Friday: 3p – 2a Monday – Wednesday: 10a – 11p Thursday : 10a – Midnight Friday: 10a – 2a Saturday: Noon – 2a The best hour is… Happy hour Monday – Friday: Until  7p $2 off all wine by the glass 15% off all wine by the bottle $2 off all draft beer Come visit the premier lounge of Tallahassee! It’s all about the connections. Come by and relax in comfort. You’ll love our friendly and knowledgeable staff. More Photos Our Selection Cigars A curated collection of some of the finest brands you can find. From cigars of the year to highly popular sticks, we cater to all. We love providing a comfortable atmosphere for the aficionado all the way to those starting out on their love for a good smoke. Come check us out! Wine Our wine selection is crafted by sommeliers to deliver a superb tasting experience for all levels of wine connoisseurs. For more discerning customers, we have a fine selection of reserve bottles. Please inquire with our hosts. Beer If you like meeting great people, come to the bar! We support some of your favorite local breweries and have a wide variety to find you some new favorites. View  Beer and Wine Fall in love with our made-fresh Cuban Coffee! Delicious Dulce de Leche Available with caramel. Did someone say Hookah? Premium shisha in multiple flavors. This month’s highlight We Recommend… Check out our cigar and beer of the month. We also have some great suggestions if you’re trying to find the perfect pairing. Cigar of the Month Oliva Serie V 135th Anniversary Oliva Serie V ranks among the top cigars on the market year after year. With this special release, Oliva pays tribute to the year 1886 – it was 135 years ago when Melanio Oliva got his start working in the tobacco fields in Cuba. And what better way to honor this family patriarch than with a new Limited-Edition size of the beloved Serie V blend. -.cigarsinternational.com Beer of the Month Victory Sour Monkey Fruity notes from imported Belgian yeast swirl through a precise souring. Pucker up to a bite of citrus laden tang ending with a delectable experience. -beeradvocate.com ⇔ Undercrown 10 + Left Hand Peanut Butter Milk Stout Try these TOGETHER! Delirium Red + Isla Del Sol ⇔ ⇔ Try these TOGETHER! Undercrown 10 + Left Hand Peanut Butter Milk Stout Delirium Red + Isla Del Sol ⇔ What are they saying? My favorite spot for a relaxing night out! Tim K. Yelp Review Cigars check. Ambience check. Cool people check. I'll be back. Shawn G. Yelp Review Fuma is one of my favorite places in Tallahassee. The vibe is chill and the ambiance is so relaxing. Misti T. Yelp Review Top notch. High class. Superior service. Great selection. Ryan B. Yelp Review Beautiful cigar lounge, great background music and of course a nice selection of cigars. Howard M. Yelp Review Great for dates or groups. Also large beer and wine selection. Julie C. Yelp Review Fuma is an instant Tallahassee gem...first rate customer service from the moment I entered the building. Ben K. Yelp Review Events Come enjoy your favorite sporting event with friends and your favorite cigar! Book an Event March 20, 2025 FUMA Cigar Social March Madness It's that time of the year!  Enter our group and win prizes while cheering all the action on! Sign up by Thursday, March 20th before the first game. Sign Up Here! April 4, 2025 FUMA Cigar Social Golf Fun Come out to Fuma for some golf fun!  We'll have a putting green.  Sink a put, win a prize!  Free for all.  Tons of golf swag and other giveaways with Bells Brewing. May 2, 2025 FUMA Cigar Social Crux Cigar Event Welcome Crux Cigars on their first visit to FUMA!  Win prizes, enjoy giveways and specials all graduation weekend long! New Memberships, Rewards & Club Subscription Now Available! Gallery The best place to relax and enjoy the company of friends in comfort 1307 N Monroe St, Tallahassee, FL 32303 850/765-5756 info@fumacigarsocial.com Sun-Wed: 3 - 10p Thu: 6p - Midnight Fri: 5p - 2a Sat: 3p - 2a Contact Us Looking to host and event or have any questions, comments or concerns? Fill out the form below and we’ll get back to you quickly! Please enable JavaScript in your browser to complete this form. Name * First Last Email * How can we help you? * Event Inquiry / Booking Cigar Request General Question or Comment Guest Feedback Other Please select all that apply. Comment or Message * Submit The premier cigar lounge of Tallahassee. 1307 N Monroe St, Tallahassee, FL 32303 850/765-5756 Mon - Wed: 10a - 11p Thu: 10a - Midnight Fri: 10a - 2a Sat: Noon - 2a Sun: 3 - 10p Follow Us! © 2024  |  Fuma Cigar Social. All Rights Reserved."
    },
    {
      "url": "https://cigarinc.com/pages/about-us",
      "text": "About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories Skip to content Enjoy Free Shipping on Orders of Cigars Over $75.   Questions? Call us at 818-719-9885 icon-X Close menu Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact Log in instagram Instagram Facebook YouTube X Cart icon-X Close cart Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. Cigars All Cigars Best Selling Cigars Cigar Inc. New Arrival Top 25 Cigars by Cigar Aficionado Cigar Companies Cigar Finder Cigar Accessories All Cigar Accessories Humidors All Humidors Electronic Humidors Desktop Humidors Travel Cases & Tubes Humidor Accessories Shop by Brand Raching Humidors Afidano Humidors El-Septimo Humidors Lighters Cutters Travel Cases & Tubes Punches Ashtrays Sets Lifestyle Shop by Brand Maccarrone Brizard and Co. El-Septimo Special Deals Blog Cigar Inc. Podcast Who We Are About Us Contact account Log in icon-search Search icon-hamburger Site navigation icon-bag-minimal Cart Search Search Cigar Inc. Premium Cigars and Luxury Accessories Watch About Us Welcome to Cigar Inc. — Where Luxury Meets Legacy At Cigar Inc., we are proud to be a premier distributor of premium cigars and high-end cigar accessories , serving discerning enthusiasts across the globe. Headquartered in Los Angeles, we offer both a luxurious retail experience and a seamless online store tailored to the needs of aficionados who demand the best. We curate only the finest cigars from prestigious brands, featuring rare blends, limited editions, and collector-grade releases. Our exclusive accessories include handcrafted humidors , precision cutters, and luxury lighters—each designed to elevate your smoking experience. Cigar Inc. is also a U.S. distributor of select collections in collaboration with iconic names like El Septimo, Brizard & Co., and Lucky Cigar . With deep industry relationships and trusted partnerships, we bring exceptional craftsmanship and exclusivity directly to your humidor. Whether you're purchasing for your private collection, preparing for a special event, or gifting a true connoisseur, Cigar Inc. delivers a standard of quality worthy of the moment. Visit our Los Angeles showroom or shop online at www.cigarinc.com . Experience the world of premium cigars—crafted for those who expect nothing less than luxury. Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Contact Us Contact Us Mon-Fri, 9:30 am. - 5:30 pm: 📞 Tel: 1 818-719-9885 📠 Fax: 1 818-719-9886 📧 Email: Info@Cigarinc.com Footer Footer Search Refund Policy & Privacy Policy Terms of Service Sign up and save Sign up and save Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe icon-email Subscribe instagram Instagram Facebook YouTube X icon-X \"Close (esc)\" icon-chevron-left icon-X icon-chevron icon-X About Cigar Inc. | Your Source for Premium Cigars & Luxury Accessories"
    },
    {
      "url": "https://quitsmokingwokingham.co.uk/contact-us/",
      "text": "Contact Quit Smoking Wokingham | Reach Out for Support and Inquiries HOME QUIT SMOKING PACKAGE Premium smoking package VAPING CESSATION PACKAGE Premium Vaping package PRICE BLOG REVIEWS CONTACT US Book Appointment Quit Today : 07736041455 Home Quit Smoking Hypnosis Package Premium Smoking Package Vaping Cessation Package Premium Vaping package Quit Smoking Hypnotherapy Price Blog Reviews Contact Us Contact Us Home Contact Us Get In Touch I will equip you with everything you will need to become a Non-Smoker. Professional, Friendly, approachable and honest treatment to empower you to Take back control over your smoking habit. Phone 07736041455 Email darren@quitsmokingwokingham.co.uk Address Markham House 20 Broad St Wokingham RG40 1AH Opening Hour Mon 8am to 8pm Tues 8am to 8pm Wednesday 8am to 8pm Thursday 8am to 8pm Friday 8am to 5pm Saturday 8am to 2pm Sunday 8am to 2pm Contact Form SEND MESSAGE 5 simple steps to becoming a non-smoker. 1. Get in contact to book an appointment using the contact form, followed by paying a deposit by Bank transfer (the balance can be paid on the day of your session). 2. Complete the Questionaire about your smoking habits (this will speed up your session and allow me to prepare your tailor-made and bespoke script for your session). 3. Read the Terms & Conditions and the Preparation Checklist which will be emailed to you. 4. Attend your personalised and bespoke one to one Quit Smoking Session. 5. Start your new life as a healthy happy Non-Smoker confident that you will be free from any desire to smoke! * Get a free additional session if required with the first 6 months if required. Our Awards & Nominations At Quit Smoking Wokingham, we take pride in our recognition within the industry, demonstrated by our awards and nominations. Our dedication to excellence in specialised hypnotherapy ensures unparalleled service and client satisfaction. Disclaimer: At Quit Smoking Wokingham, we are dedicated to supporting you on your journey to quitting smoking through hypnotherapy. It’s important to understand that results with hypnotherapy can vary from person to person. While many individuals experience significant success in quitting smoking, your commitment and active participation in the process are crucial factors in maximising your own success rate. It’s essential to acknowledge that results are not guaranteed. While hypnotherapy can be a powerful tool in helping you quit smoking, the effectiveness of the treatment depends on various factors, including your readiness to change, individual circumstances, and the complexity of your smoking habits. We encourage you to approach hypnotherapy with an open mind and a willingness to engage fully in the process. By actively participating and following the guidance provided, you can increase your chances of successfully quitting smoking and achieving your goals. Please feel free to discuss any concerns or questions you may have about the process. Our team is here to support you every step of the way on your journey to a smoke-free life. Book Appointment 0 Facebook 0 Linkedin 0 Pinterest 0 Kik 0 Trello 0 Viber 0 Whatsapp 0 Telegram 0 Reddit 0 Digg Say goodbye to the limitations of your previous smoking habit with our specialised hypnotherapy. SERVICES HOME VAPING CESSATION PACKAGE PREMIUM VAPING PACKAGE QUIT SMOKING PACKAGE PREMIUM SMOKING PACKAGE PRICE BLOG REVIEWS Sitemap QUIT SMOKING WOKINGHAM I am a hypnotherapist based in Wokingham – Berkshire. Specialised trained and certified in Stop Smoking Hypnosis. One of the most popular issues that people come to a hypnotherapist for is to help them quit smoking! CONTACT INFO Markham House 20 Broad St Wokingham RG40 1AH 07736041455 darren@quitsmokingwokingham.co.uk © Copyright 2025 | quitsmokingwokingham.co.uk - All rights reserved. Back to top Book Appointment"
    },
    {
      "url": "https://www.cigarsunlimited.co.uk/contact-us/",
      "text": "Contact Us - Cigars Unlimited Free Delivery on orders over £50 Same day dispatch when ordered before 2pm Earn Points on all items Established Online Since 2000 MENU Shopping Basket No products in the basket. Search for: Search Log In Account Sale Cuban Cigars Featured New Releases Special Prices Best Seller Limited Edition Regional Edition Vintage & Rare Connoisseur's Choice Mini Cigarillos Gifts Shop All Cuban Cigars Havana Cigars are undisputedly one of life’s great pleasures. A recognised symbol of civilised living which impart a state of well being, relaxation and contentment. The sensation of smoking, smelling and tasting a Havana cigar offers a supreme moment of pleasure. To assist you in making your selection from the brands offered, we have added a few tasting notes and pointers which we hope you find useful. All Brands Bolivar Cohiba Cuaba Diplomaticos El Rey del Mundo Fonseca Guantanamera Hoyo de Monterrey H. Upmann Jose L. Piedra Juan Lopez La Flor de Cano La Gloria Cubana Montecristo Partagas Por Larrañaga Punch Quai D'Orsay Quintero Rafael Gonzalez Ramon Allones Romeo y Julieta San Cristobal de la Habana Sancho Panza Trinidad Vegas Robaina Vegueros Davidoff Cigars White Band Collection Winston Churchill Collection The Late Hour THROUGH THE DAY INTO THE NIGHT Whatever the task, whatever the hour, Winston Churchill knew the right cigar can be a trusted companion. So the cigars which carry his name echo his character. Sir Winston was not a man to follow convention. He found inspiration and creativity in the long dark hours of the night. «The Late Hour Series» thus offers cigars that perfectly accompany contemplative evenings. Winston Churchill – a man and a cigar for all times. From «The Original Series» through to «The Late Hour Series» cigars, the Winston Churchill Collection pleases with quality that never sleeps. Escurio Davidoff Escurio is a distinctive and full-flavored blend that represents the fascinating fusion of Dominican and Brazilian tobaccos. It features an Ecuadorian Habano wrapper, a distinctive Brazilian Cubra leaf binder, and Mata Fina and Cubra tobacco in the filler. This exceptional blend emerged as a result of Davidoff’s continued pursuit of excellence in the world of cigars. After expanding its horizons to Nicaragua in 2013, the brand set its sights on Brazil, specifically the picturesque Bay of Todos Los Santos. The unique climate and conditions of this region offered the opportunity to cultivate the richest and most flavourful tobacco leaves. This blend takes you on a rollercoaster of flavours that may surprise your taste buds, making each puff a journey of discovery. The taste experience is a masterpiece of complexity and depth. It starts with a salty and woody note, which smoothly transitions into sweetness, revealing hints of citrus heightened by a creamy aftertaste. This vibrant combination is a tribute to the richness of Brazilian culture, making it an ideal choice for those who seek exploration and adventure through their cigar experiences. Davidoff Escurio is a blend worth keeping in your humidor, as it is always ready to transport you… Zino Cigars Minis Shop for all Davidoff Cigars A brand created by the legendry Zino Davidoff, who originally started producing cigars in Cuba circa 1969. The 1970’s saw tremendous success for the Davidoff brand as cigar shops opened to the public all over the World selling what is now regarded as a premium and exceptional range of cigars crafted in the then new “El Laguito” factory in the suburbs of Havana. By 1991 the love affair was over between Davidoff and Cuba when production of all Cuban Davidoff’s ceased. The great man himself died on 14th January 1994 but not before he had switched production of his special brand to the Dominican Republic around 1990. Today the Davidoff brand embraces eight different ranges of premium handmade cigars : the exclusive Limited Edition, recently launched Zino Platinum Scepter Series, outstanding Millennium Blend , “Aniversario Series”, “Grand Cru Range”, “Mille Range”, “Specials” and “Classic” Range” incorporating Davidoff Nos.1, No.2, No3 and Ambassadrice. The tobaccos used to make these different cigars are based on five different blends of tobacco each aged for at least four years to impart a smooth, refined and distinctive taste. New to the Davidoff range of cigars are Club Cigarillos in tins of ten for those who… Other Cigars Featured New Additions Sale Connoisseur Choice Limited Editions Best Seller Mini Cigarillos Shop All Other Cigars Region / Countries American Cigars European Cigars Sumatran Cigars Peruvian Cigars Honduran Cigars Nicaraguan Cigars Dominican Cigars Gifts & Samplers Gifts Samplers Shop All Gifts & Samplers Accessories Cigar Ashtrays Cigar Books Cigar Cases Cigar Cutters Cigar Humidors & Accessories Cigar Lighters Cigar Tools Shop All Accessories Cigarette Lighters & Accessories Pipes & Tobacco Pipes Pipe Tobacco Pipe Accessories Shop All Pipes & Tobacco About Us Contact Us Sampling Lounge Events News Home / Contact Us Contact Us Opening Hours Mon to Thurs: 10:00 - 18:00 Fri & Sat: 10:00 - 19:00 Sun & Bank Holiday: Closed Tel No. Call us within the U.K on 020 7386 9000 From outside the U.K. Call +44(0) 20 7386 9000 Address 129, Walham Green Court Moore Park Road Fulham London SW6 2PX United Kingdom Connect with us Please contact us via email sales@cigarsunlimited.co.uk or through the enquiry form below. Contact Name* Email Address* Subject Phone Message Δ Our Location Cigars Unlimited is conveniently located at 129, Walham Green Court, which is in Moore Park Road, London SW6 2PX. Situated between the Fulham Road and Kings Road in South West London, only 2 minutes walk from Fulham Broadway Underground Station (District Line) and the Fulham Broadway Retail Centre. Within 15 minutes drive of Chelsea, Kensington, Putney, Battersea, Hammersmith and Wandsworth we are well served by the following London Transport bus services which all pass through Fulham Broadway … Nos 11, 14, 22, 28, 211, 295, 391, 424 and C3. To find us refer to the map below. When you reach Fulham Broadway proceed South down Harwood Road towards the Kings Road. Within 100 yards, immediately before the first set of traffic lights, turn left into Moore Park Road. We are to be found 80 yards on the left hand side fronting a raised pavement. Look forward to seeing you! About Us About Us Contact Us Sampling Lounge Events News Support Account Delivery Returns Terms & Conditions Privacy Policy Contact Details 129, Walham Green Court Moore Park Road Fulham London SW6 2PX +44 (0)207 386 9000 +447367767141 sales@cigarsunlimited.co.uk Mon to Thurs: 10:00 - 18:00 Fri & Sat: 10:00 - 19:00 Sun & Bank Holiday: Closed © Copyright 2025 RSVP Art, Entertainment & Antiquity Ltd. Website Design by SiteWizard Welcome to Cigars Unlimited. This website contains tobacco products. Please confirm that you are over the age of 18 to enter the website. Yes — Enter Site"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "text": "Contact BROTTAR: Get in Touch for Premium Service & Inquiries\n – BROTTAR® OFFICIAL Skip to content Great news! Shipping is now available to Canada & the UK! 🚚✨ Shop now! Home Contact Wholesale About Us FAQs Log in Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Home Contact Wholesale About Us FAQs Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Search Log in Cart Item added to your cart View cart Check out Continue shopping Contact We’d Love to Hear From You At BROTTAR, we value every question, comment, and piece of feedback from our customers. Whether you’re curious about our products, need assistance with your order, or simply want to share your thoughts, our dedicated team is here to help. Multiple Ways to Connect Email: For prompt support, drop us a message at Contact@brottar.com . Contact Form: Fill out our online form available on this page for quick inquiries and we’ll get back to you within 24 hours. Customer Support: Our dedicated support team is available during business hours to provide personalized assistance and ensure your satisfaction. Our Commitment to You We believe in building lasting relationships with our customers through transparency, responsiveness, and exceptional service. Every inquiry is important, and we strive to ensure that your experience with BROTTAR is seamless and satisfying. Visit Our Website Explore our online catalog and discover how our premium products can elevate your living space. We’re here to assist you every step of the way—from product selection to post-purchase support. Thank you for choosing BROTTAR. We look forward to connecting with you! Contact form Name Email * Phone number Comment Send Support About Us Shipping & Delivery Return & Refund Policy Terms & Conditions Privacy Policy Wholesale FAQs Blog At BROTTAR, every detail matters. Founded by visionary entrepreneurs with a passion for design and excellence, our brand was born out of the desire to merge artistic innovation with everyday functionality. Our journey began with a single idea: to redefine the way you display your most cherished items. Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Payment methods PayPal Venmo © 2025, BROTTAR® OFFICIAL Powered by Shopify Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.giftly.com/gift-card/fuma-cigar-social-tallahassee",
      "text": "Browse & Buy Online Gift Cards | Giftly Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Search for Any Business, Gift a Place they Love Gift up to $1,000 with the suggestion to spend it at nearly any business. Every Giftly is delivered in a customized greeting card by email, mail, or printout. Parrilla Peña 4 star Argentine in Buenos Aires Rodríguez Peña 682, Buenos Aires 4.4 (225) • $$ • Argentine Any Place in Buenos Aires B Anything they want, wherever they choose Buenos Aires B Universal Gift La Brigada 4 star Steakhouse in Buenos Aires Estados Unidos 465, Buenos Aires 3.9 (139) • $$$ • Steakhouses Your Favorite Place in Buenos Aires B Anything they want, wherever they choose Buenos Aires B Universal Gift Camping 4 star Bar in Buenos Aires Av. Pueyrredón 2501, Buenos Aires 3.7 (125) • $$ • Bars Ricas Empanadas 4 star Argentine in Buenos Aires Viamonte 715, Buenos Aires 4.3 (3) • $ • Argentine search Trustpilot Popular in Buenos Aires, B Gift up to $1,000 for one of these great places Parrilla Peña 4 star Argentine in Buenos Aires Rodríguez Peña 682, Buenos Aires 4.4 (225) • $$ • Argentine La Brigada 4 star Steakhouse in Buenos Aires Estados Unidos 465, Buenos Aires 3.9 (139) • $$$ • Steakhouses Camping 4 star Bar in Buenos Aires Av. Pueyrredón 2501, Buenos Aires 3.7 (125) • $$ • Bars Ricas Empanadas 4 star Argentine in Buenos Aires Viamonte 715, Buenos Aires 4.3 (3) • $ • Argentine Chila 4 star Signature Cuisine Av. Alicia Moreau de Justo 1160, Buenos Aires 4.4 (39) • $$$$ • Signature Cuisine El Mosquito 4 star Argentine in Buenos Aires Tte. Gral J.D. Peron 4499, Buenos Aires 3.9 (31) • $$ • Argentine Vive Café 5 star Coffee & Tea in Buenos Aires Costa Rica 5722, Buenos Aires 4.6 (25) • $ • Coffee & Tea La Ferneteria 5 star Bar in Buenos Aires Serrano 1349, Buenos Aires 5.0 (3) • Bars Moebius 5 star Bookstore in Buenos Aires Bulnes 658, Buenos Aires 4.8 (4) • $$$ • Bookstores 1 2 3 Next The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a  gift card with the flexibility of money. See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize Easy to buy online. Delivered now or later Send with a personalized greeting card 3 easy ways to redeem the gift Business Categories Travel Seafood Restaurants Shopping Men's Clothing Activities Outdoors Going Out Nail Salons Spa & Beauty See More Universal Giftly's Any Restaurant Any Restaurant Gift up to $1,000 and let them choose where to spend it. The thoughtfulness of a gift card with the freedom and flexibility of a Giftly. Buy an Any Restaurant Gift Any Store Shop ‘til they drop, anywhere they want 248k stores nationwide Universal Gift Any Nail Salon A mani-pedi at their favorite spot 27k nail salons nationwide Universal Gift Any Bar Drinks on you! Wherever they choose 32k bars nationwide Universal Gift Any Place Their favorite place, or a new spot Any location nationwide Universal Gift Featured Businesses Restaurants Tatiana By Kwame Onwuachi 10 Lincoln Center Plz, New York, NY 4.4 (528) • $$$$ • Caribbean Rocca 323 W Palm Ave, Tampa, FL 4.4 (620) • $$$ • Italian THE LOT Liberty Station 2620 Truxtun Rd, San Diego, CA 3.6 (1.9k) • $$ • Bars House of Prime Rib 1906 Van Ness Ave, San Francisco, CA 4.2 (9.9k) • $$$$ • American Marietta Square Market 68 N Marietta Pkwy NW, Marietta, GA 4.1 (158) • $$ • Food Stands Wolf By Vanderpump 18 Hwy 50, Stateline, NV 3.9 (650) • $$$ • American Hal's The Steakhouse 30 Old Ivy Rd, Atlanta, GA 4.0 (984) • $$$$ • American Born & Raised 1909 India St, San Diego, CA 4.1 (3.2k) • $$$$ • Steakhouses Costco Wholesale 26610 Ynez Rd, Temecula, CA 3.1 (17) • Hot Dogs Semma 60 Greenwich Ave, New York, NY 4.1 (562) • $$$$ • Indian Golden Steer Steakhouse Las Vegas 308 W Sahara Ave, Las Vegas, NV 4.1 (2.8k) • $$$$ • Steakhouses Your Dekalb Farmers Market 3000 E Ponce De Leon Ave, Decatur, GA 4.2 (1.5k) • $$ • Seafood Markets Le Diplomate 1601 14th St NW, Washington, DC 4.3 (5.6k) • $$$ • Brasseries Chez Francois Restaurant 555 Main St, Vermilion, OH 4.3 (227) • $$$$ • French The Sun Dial Restaurant, Bar & View 210 Peachtree St NW, Atlanta, GA 3.3 (1.3k) • $$$$ • New American MDRD 187 Monroe Ave NW, Grand Rapids, MI 4.3 (185) • $$$ • Spanish Umi 3050 Peachtree Rd, Atlanta, GA 4.2 (818) • $$$ • Sushi Bars Primal By Mia 406 Beach Ave, Cape May, NJ 4.4 (179) • Seafood Spago Beverly Hills 176 N Canon Dr, Beverly Hills, CA 4.1 (2.6k) • $$$$ • New American Arnold Palmer's Restaurant 78164 Ave 52, La Quinta, CA 4.1 (453) • $$$ • American Capri Ristorante 324 Burr Ridge Pkwy, Burr Ridge, IL 3.7 (642) • $$ • Italian Gallaghers Steakhouse 228 W 52nd St, New York, NY 4.2 (2.1k) • $$$$ • Steakhouses Rok N Fondue 25 E State St, Redlands, CA 3.8 (1.1k) • $$$ • Fondue Wood Tavern 6317 College Ave, Oakland, CA 4.3 (2.3k) • $$$ • New American Scales 68 Commercial St, Portland, ME 4.3 (1.2k) • $$$ • Seafood Musaafer 5115 Westheimer Rd, Houston, TX 4.3 (936) • Indian Zahav 237 St James Pl, Philadelphia, PA 4.5 (3.6k) • $$$$ • Middle Eastern Shopping Watches Of Switzerland 1 Broadway Everett, Boston, MA 4.4 (5) • Watches Walmart 1320 Altamont Ave, Schenectady, NY 2.0 (20) • $$ • Department Stores 900 North Michigan Shops 900 N Michigan Ave, Chicago, IL 4.0 (107) • $$$ • Shopping Centers American Dream 1 American Dream Way, East Rutherford, NJ 3.5 (526) • $$ • Shopping Centers NorthPark Center 8687 N Central Expy, Dallas, TX 4.2 (648) • $$$ • Shopping Centers UCLA Store 308 Westwood Plz, Los Angeles, CA 3.7 (110) • $$$ • Sports Wear Golden Goose Deluxe Brand 30 Geary St, San Francisco, CA 3.7 (19) • Shoe Stores Glendale Galleria 100 W Broadway, Glendale, CA 3.5 (886) • $$ • Shopping Centers Aventura Mall 19501 Biscayne Blvd, Aventura, FL 4.2 (743) • $$$ • Shopping Centers Oakbrook Center 100 Oakbrook Ctr, Oak Brook, IL 4.5 (21) • Shopping Centers Country Club Plaza 4706 Broadway Blvd, Kansas City, MO 4.2 (178) • $$$ • Shopping Centers Westfield UTC 4545 La Jolla Village Dr, San Diego, CA 3.4 (872) • $$$ • Shopping Centers The Mall at University Town Center 140 University Town Center Dr, Sarasota, FL 3.6 (135) • $$ • Shopping Centers International Plaza and Bay Street 2223 N Westshore Blvd, Tampa, FL 4.2 (319) • $$$ • Shopping Centers Kenwood Towne Center 7875 Montgomery Rd, Cincinnati, OH 3.8 (186) • $$$ • Shopping Centers Scottsdale Fashion Square 7014 E Camelback Rd, Scottsdale, AZ 4.1 (700) • $$$ • Shopping Centers Tysons Corner Center 1961 Chain Bridge Rd, Tysons, VA 4.0 (578) • $$ • Shopping Centers Boca Center 5150 Town Center Cir, Boca Raton, FL 3.7 (14) • $$ • Shopping Centers Costco Wholesale 11700 Mezzo Dr, North Port, FL 3.8 (18) • Wholesale Stores Hotels & Travel Delta , American , Southwest And United Airlines 206 W 45th St, New York, NY 1.0 (1) • Tours MSC Cruises USA 6750 N Andrews Ave, Fort Lauderdale, FL 1.7 (417) • Travel Services The Standard Spa Hotel 40 Island Ave, Miami Beach, FL 3.6 (672) • $$ • Hotels Gaylord Opryland Resort 2800 Opryland Dr, Nashville, TN 3.0 (2.1k) • $$$ • Hotels Allegiant Airlines Spokane, WA 3.0 (2) • Airlines Posthotel Leavenworth 309 8th St, Leavenworth, WA 4.2 (191) • $$$$ • Hotels Hotel del Coronado, Curio Collection by Hilton 1500 Orange Ave, Coronado, CA 3.0 (2.6k) • $$$ • Hotels Pechanga Resort Casino 45000 Pechanga Pkwy, Temecula, CA 3.1 (2.5k) • $$ • Resorts The Omni Grove Park Inn & Spa 290 Macon Ave, Asheville, NC 3.5 (806) • $$$$ • Hotels Norwegian Cruise Line 24 Africa Way, Downtown Miami, FL 3.0 (97) • Tours Chateau Elan Winery & Resort 100 Rue Charlemagne, Braselton, GA 3.6 (665) • $$$ • Resorts Gaylord Texan Resort & Convention Center 1501 Gaylord Trl, Grapevine, TX 3.1 (1.3k) • $$$ • Hotels The Battle House Renaissance Mobile Hotel & Spa 26 N Royal St, Mobile, AL 4.0 (160) • $$$ • Hotels Six Flags Great Escape Lodge & Indoor Waterpark 89 Six Flags Dr, Queensbury, NY 2.3 (259) • $$ • Hotels Montauk Manor 236 Edgemere St, Montauk, NY 3.4 (190) • Resorts Gurney's Montauk Resort & Seawater Spa 290 Old Montauk Hwy, Montauk, NY 2.8 (425) • $$$$ • Hotels The St Regis Longboat Key Resort 1601 Gulf Of Mexico Dr, Longboat Key, FL 3.8 (22) • Hotels Food & Grocery Keens Steakhouse 72 W 36th St, New York, NY 4.2 (3.5k) • $$$$ • Steakhouses Walmart 14101-15799 Fwy, Mesquite, TX 1.0 (1) • Grocery Other Universal Studios Hollywood 100 Universal City Plz, Universal City, CA 3.7 (6.3k) • Amusement Parks The Spa At Séc-he 200 E Tahquitz Canyon Way, Palm Springs, CA 4.5 (168) • $$$ • Day Spas Sphere 255 Sands Ave, Las Vegas, NV 3.3 (1.6k) • Stadiums & Arenas Hollywood Pantages Theatre 6233 Hollywood Blvd, Los Angeles, CA 4.3 (1.9k) • Performing Arts The Ritz-Carlton Spa, Orlando, Grande Lakes 4012 Central Florida Parkway, Orlando, FL 4.4 (127) • $$$$ • Day Spas Madison Square Garden 4 Pennsylvania Plz, New York, NY 4.1 (1.3k) • $$$ • Stadiums & Arenas Bally's Twin River Lincoln 100 Twin River Rd, Lincoln, RI 2.2 (381) • Casinos Universal Orlando Resort 6000 Universal Studios Plz, Orlando, FL 3.4 (547) • Amusement Parks Cosm Dallas 5776 Grandscape Blvd, The Colony, TX 3.1 (188) • $$$ • Venues & Event Spaces CMX CinéBistro Siesta Key 3501 S Tamiami Trl, Sarasota, FL 3.5 (288) • $$$ • Cinema Grand Ole Opry 2804 Opryland Dr, Nashville, TN 4.4 (968) • $$ • Music Venues The Farmer's Dog Brooklyn, NY 3.6 (17) • Pet Services Knott's Berry Farm 8039 Beach Blvd, Buena Park, CA 3.3 (4.9k) • Amusement Parks The Spa at Encore Boston Harbor One Broadway, Everett, MA 3.8 (32) • $$$ • Day Spas Wrigley Field 1060 W Addison St, Chicago, IL 4.4 (1.8k) • Stadiums & Arenas The Spa at CIVANA 37220 Mule Train Rd, Carefree, AZ 4.3 (36) • Day Spas New York Philharmonic 10 Lincoln Center Plz, New York, NY 4.3 (70) • $$$ • Performing Arts Billy Sushi 116 N 1st Ave, Minneapolis, MN 4.3 (24) • Speakeasies Ryman Auditorium 116 Rep John Lewis Way N, Nashville, TN 4.3 (741) • $$ • Music Venues Lincoln Center 70 Lincoln Center Plz, New York, NY 4.5 (332) • $$$ • Performing Arts Wolf in the Woods 1920 Fort Stockton Dr, San Diego, CA 4.6 (461) • $$$ • Wine Bars New York City Ballet 20 Lincoln Ctr, New York, NY 4.3 (144) • Performing Arts The Spa at Claremont 41 Tunnel Rd, Berkeley, CA 3.1 (126) • $$$ • Skin Care The Salt Shed 1357 N Elston Ave, Chicago, IL 4.0 (107) • $$ • Music Venues Dodger Stadium 1000 Vin Scully Ave, Los Angeles, CA 3.8 (2.6k) • Stadiums & Arenas Chateau Elan the Spa 100 Haven Harbor Dr, Braselton, GA 3.5 (96) • $$$ • Massage The Phoenician Spa 6000 East Camelback Road, Scottsdale, AZ 4.0 (99) • $$$ • Day Spas CMX Cinebistro Hyde Park 1609 W Swann Ave, Tampa, FL 3.9 (559) • Cinema Yankee Stadium 1 E 161st St, Bronx, NY 4.0 (1.7k) • Stadiums & Arenas Beau Rivage Resort & Casino 875 Beach Blvd, Biloxi, MS 3.4 (710) • Casinos Universal Studios Florida 6000 Universal Blvd, Orlando, FL 3.5 (2.9k) • Amusement Parks New England Aquarium 1 Central Wharf, Boston, MA 3.5 (1.2k) • Aquariums Mountaineer Casino, Resort & Races 1420 Mountaineer Cir, New Cumberland, WV 2.4 (79) • Casinos Irvine Spa 2332 Barranca Pkwy, Irvine, CA 3.8 (1.6k) • $$ • Day Spas Gun Lake Casino Resort 1123 129th Ave, Wayland, MI 2.3 (166) • Casinos See More FAQ's What is the best way to purchase gift cards? The best way to purchase a gift card depends on whether you want to email or text the gift card to your recipient, give it to them in person, or mail a physical gift card to them. Here are some of the most popular methods to buy electronic and physical gift cards: On a third-party website In-person at the issuing store, restaurant, or other location On the issuing merchant's website On a bank-issued gift card website At a third-party store, such as Target Another option is to purchase a Giftly, which can be used in place of a gift card, and works for almost any national retailer or your favorite local business. How does Giftly work? You can send up to $1,000 to your recipient for any local or national merchant. Giftly will deliver your gift with a customized greeting card by email, text, mail, or printout. Your recipient will choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. While you can suggest a store, bar, restaurant, activity, or something else you think they'd like, your recipient can use the gift for anything they want. How do digital gift cards work? A digital gift card - also known as an electronic gift card (or e-gift card) - works just like a physical gift card but can be used for online purchases. Like a physical gift card, a digital gift card has some type of code or barcode that you can enter online when you're making online purchases. When you send a digital gift through Giftly, your recipient can choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Can you buy gift cards online? Yes. You can purchase a Giftly, which works just like an online gift card, for almost any national retailer or your favorite local business. When you buy a Giftly online at Giftly.com, you can send it to your recipient via text, email, or print. Your recipient can then use the Giftly for anything that they like best, whether it's in person at a store or restaurant, or for online purchases. You can also sometimes buy gift cards online through a specific business's website. However, unlike a Giftly, your recipient can usually only redeem it at that one place. What is the safest way to buy gift cards? The most important thing about sending someone a gift is that it gets delivered safely and securely. The safest way to buy gift cards is through a company that you trust and to store the gift card in a safe place before you give it to someone. At Giftly, you can purchase a Giftly - which works like a universal gift card - in any amount up to $1,000 and send it to your recipient via text, email, or print. Throughout the process, you never have to worry about losing a physical gift card or buying a gift from a company you don't trust. How does someone redeem a gift card from Giftly? When you send a digital gift through Giftly, your recipient can choose the most convenient way to receive the gift: as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Giftly allows people to send monetary gifts to friends and family and suggest where to go and what to get with the gifted funds. Through Giftly, purchasers can suggest a specific business or business category to the recipient and include a personal note. While you can suggest a store, bar, restaurant, activity, or something else you think they'd like, your recipient can use the gift for anything they want. Can you send gift cards via email or text? Yes. You can buy a Giftly through an easy online process and send it to your recipient via email, text, or print. This works great because your recipient has the flexibility to redeem the gift as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Once the recipient has received the funds, they are free to spend them when and where they choose and can receive a Giftly Visa Gift Card to use in-store or online purchases. Do Giftly gifts expire? No. A Giftly gift never expires. You can buy a Giftly online at Giftly.com in any amount up to $1,000. Your recipient can then redeem the Giftly as a Visa gift card in the mail, as a credit to their bank account, or as a credit to their PayPal account. Then they can then use the Giftly for any purchases they want, whenever it is the most convenient for them. What are the most popular gift cards you can buy online? Sending someone an online gift card for a birthday, holiday, or another special occasion is a great way to celebrate them and show how much you care. Some of the most popular gift options from Giftly are: Target, Kohl's, Lululemon, Bath and Body Works, Ross. Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    }
  ]
}