{
  "fuentes": [
    {
      "url": "https://fusionlp.org/about-us/",
      "email": "gts@fusionlp.org"
    },
    {
      "url": "https://fusionlp.org/about-us/",
      "email": "megan.dayton@state.mn.us"
    },
    {
      "url": "https://fusionlp.org/about-us/",
      "email": "mwynne@fusionlp.org"
    },
    {
      "url": "https://fusionlp.org/about-us/",
      "email": "susan.brower@state.mn.us"
    },
    {
      "url": "https://www.fusionsportsevents.com/about-us",
      "email": "info@fusionsporstventures.com"
    },
    {
      "url": "https://www.fusionsportsevents.com/about-us",
      "email": "info@fusionsportsventures.com"
    },
    {
      "url": "https://www.thefusionteam.com",
      "email": "service@thefusionteam.com"
    },
    {
      "url": "https://yorkfashionweek.com/contact-us",
      "email": "enquiries@yorkfashionweek.com"
    },
    {
      "url": "https://www.fusionfashiontechsummit.com/agenda/",
      "email": "info@fusionfashiontechsummit.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://davincimagazine.com/fusion-fashion-events-south-florida-fashion-leader/",
      "email": "elements@2x.png"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.fusionrose.com/contactus",
      "email": "events@fusionrose.com"
    },
    {
      "url": "https://www.fashionfusion.co.za/pages/contact-us-1",
      "email": "shop@fashionfusion.co.za"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "elements@2x.png",
    "emcfadden@diamondheadtheatre.com",
    "enquiries@yorkfashionweek.com",
    "events@fusionrose.com",
    "gts@fusionlp.org",
    "info@fusionfashiontechsummit.com",
    "info@fusionsporstventures.com",
    "info@fusionsportsventures.com",
    "info@scibpaints.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "megan.dayton@state.mn.us",
    "mwynne@fusionlp.org",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "service@thefusionteam.com",
    "shop@fashionfusion.co.za",
    "susan.brower@state.mn.us",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "fusionfashionevents.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fusionlp.org/about-us/",
      "text": "About Fusion • Fusion Learning Partners Facebook Twitter LinkedIn Public Technology Institute Community Become a PTI Member Become a Business Partner GOVIT Leadership Summit & Symposium Schedule Travel & Planning Become a Sponsor Mainstage Speakers Session Descriptions Breakout Speakers Marketing Assets Consulting Services Service Offerings Education CGCIO™ – Certified Government Chief Information Officer CGCIO™ Graduates CGDSP – Certified Government Digital Services Professional Foundations of IT Leadership Training & Professional Development Research & Content GOVIT Hub 365 Digital Webinars Podcasts From PTI Blogs News About Share With Us! Public Technology Job Board Call for Authors and Contributors PTI Staff Client Services Event Planning & Management Organizational Support Current Clients About Fusion Overview Staff Board History Press Upcoming Events Blog Behind the Podium Jobs Events 2025 GOVIT Leadership Summit & Symposium Schedule Travel & Planning Become a Sponsor Mainstage Speakers Session Descriptions Breakout Speakers Marketing Assets Contact General Inquiry RFP Submission Select Page About Us At Fusion Learning Partners, we believe learning is the origin of change and transformation, and we believe learning never stops – it’s a lifelong endeavor that continues beyond the classrooms of our youth. Fusion is a nonprofit organization committed to creating environments that promote learning for the individuals, organizations, and the communities they serve. From conferences and convenings to supporting collaborative initiatives and organizations, Fusion exists to strengthen and transform the communities where we work, live, and thrive. Since 1976, Fusion Learning Partners (fka GTS Educational Events) has served a diverse set of public and private partners ensuring they have the knowledge, skills, and relationships needed to make positive change for themselves, and the organizations and communities they serve. Our Mission, Vision, Purpose, and Values Our Mission: To serve the public and civic sector with events, programs and services that inspire innovation for the greater good. Our Vision: To be a catalyst that strengthens and transforms the communities in which we work, live and thrive. Our Purpose: We convene, connect and engage people and organizations so that they can discover innovative solutions to complex social problems. WE DO THIS THROUGH: Professional Learning Programs and Events Meeting Coordination and Support Organizational Support Services for Associations, Organizations and Initiatives Our Values: Cultivate Connections Throughout human history, we have craved connection. It’s in our DNA as humans, and it’s in our DNA as Fusion Learning Partners. That’s why everything we do, from our events and conferences to convening and supporting collaboration, is built on a foundation of connection where we can all strengthen and transform the communities we serve – together. Collaborate Learning and innovation don’t happen in a bubble, and no individual alone possesses the power and knowledge we gain when we work together. Collaboration is the catalyst for breaking new ground, and with that in mind, we’ve made creating spaces for collaboration to happen a focus of all we do. Future-Ready When we connect and collaborate, we can begin seeing around corners and imagining what’s to come, allowing us to create the future we want together rather than letting it simply happen to us, our organizations, and our communities. We are committed to: Passion We approach every project and partnership in the belief of our purpose, mission and vision. Purpose We believe that everything we do should be rooted in promoting innovative practices to strengthen and transform our communities. Partnership We build relationships that are mutually-beneficial, mission-aligned and transformational. Fusion Staff Fusion Learning Partners prides itself on the experience, expertise and passion of its staff. Whether our knowledge and expertise of program planning and event management, marketing and sales, operations management or providing key capacity building services, our team is passionate about the work we do and the impact our efforts have on the careers and lives of those who are served through the partnership and services we provide. Laura Barry Director of Business Operations Laura reports to the CEO and serves as an integral member of the Fusion Learning Partners team. Laura’s primary responsibility is ensuring organizational effectiveness by providing leadership for the organization’s financial and administrative functions. Laura brings over 10 years of experience, including overseeing financial operations and budgeting for large, complex portfolios, and working closely with senior leadership to align financial strategy with organizational goals and mitigate risks. She is passionate about fostering collaboration across departments to build strong, well-informed teams and is excited to help Fusion maximize its impact by strengthening its infrastructure. Laura oversees all accounting, human resources, and general operations/office management functions, including supervision of operational or financial support roles. Contact Laura Dale Bowen Director of Member Services, Public Technology Institute Dale works with the Public Technology Institute’s leadership, member officials, private sector and other non-profit partner organizations to develop content to help local government managers and leaders better understand the tech, service delivery and management issues impacting local government. With thirty-five years of experience in the local government association community, Dale develops collaborative approaches and programs that provide insight and value to member and customer audiences. Contact Dale Barry Condrey Director of Technology Services, Public Technology Institute Before joining the Public Technology Institute as Director of Technology Services, Barry was the CIO for Chesterfield County, Virginia for 17 years. Under his leadership Chesterfield County was four times recognized as the #1 digital county in the USA. He has worked in the IT field for over 40 years holding a wide range of technology leadership positions in the public and private sectors. Barry holds advanced degrees in public leadership, economics and computer science. He is a certified government CIO (CGCIO), a certified information security manager (CISM) and a national top 25 Doer, Dreamer & Driver. Contact Barry Olivia Hui Andersen Member Services & Registration Coordinator With a strong background in international membership management and educational event planning, Olivia supports Fusion’s member engagement and registration operations with precision and care. She brings experience from the Swedish Chamber of Commerce in China, where she managed services for over 200 member companies and helped develop high-impact professional development events. Fluent in English, Mandarin, and Danish, she excels in stakeholder communication and thrives in diverse, fast-paced environments. Her work coordinating over 100 events—both in-person and virtual—reflects her skill in designing accessible registration systems, planning engaging programs, and fostering meaningful connections across sectors. At Fusion, she applies her attention to detail and global mindset to help deliver exceptional experiences for members and event participants alike. Contact Olivia Noelle Hulshizer Program & Communications Coordinator Noelle excels in her field of public relations and brings talented experience in marketing, communications, digital media, and event management. Her role at Fusion also includes technical coordination, marketing, administration, and event and customer service support. She enjoys the variety of programs that Fusion manages, learning something new every day! Contact Noelle Ian Jordan Event Manager Ian brings experience in event planning from both a venue host and planner perspective. He has enjoyed pivoting his events to fit the everchanging landscape of the world. His role includes client coordination, event planning & logistics, budgeting, and volunteer & speaker management. He loves putting together fun, unforgettable experiences. Contact Ian Christopher Kohn Sponsorship & Tradeshow Manager Chris has 20 years of exhibit and sponsorship sales and comprehensive trade show management experience. Throughout his career he has been involved with over 100 conferences and trade shows. He is no stranger to events both large and small, ranging in size from 75–10,000 attendees and 10–500 sponsors & exhibitors. His event experience and on-site responsibilities include client contracts, facility rules & regulations, logistics / shipping / material handling procedures, union rules & regulations, booth selection, membership / sponsorship point systems, sponsorship programs & vendor contracts. Chris excels at fostering and maintaining positive, working relationships with new and existing sponsors & exhibitors to ensure budget goals and client satisfaction are met. Contact Chris Charles Kronschnable Registration & Operations Manager Charles Kronschnable is a versatile professional with a rich background in event planning and information technology. With extensive experience in the IT sector, Charles excels in strategic planning, budgeting, and contract negotiation. His expertise extends to database administration, project management, and team leadership, making him a valuable asset for Fusion Learning Partners. Leveraging his technical acumen and passion for events, Charles orchestrates seamless experiences, fosters community engagement, and drives impactful results. Contact Charles Darryl Polk Director of Education, Public Technology Institute Darryl Polk, former CTO of Riverside County, CA and adjunct faculty with the PTI CGCIO program has joined the Public Technology Institute as its new director of education. In this role, Darryl will build on the successful development and delivery of the PTI portfolio of certifications and certificate programs, as well as other key content that impacts the local government IT community. Darryl brings over 37 years of experience in public service, the last 10 of which have been in executive IT roles. In addition to being a graduate of PTI’s CGCIO program, he has a Bachelors In Organizational Development and a Masters in Public administration. He has served as an advisor to PTI on the Leadership Council since 2018 and has strong relationships and friendships within the PTI community and in the local government IT space across the country. Contact Darryl Brandon Shuey Program & Communications Coordinator, Public Technology Institute In his few years of experience, Brandon has learned how to create success in event planning, project management, and marketing roles. He enjoys working on a wide range of projects so that no two days are ever the same. In his role he will be working on membership engagement and recruitment, content development, and program outreach. Contact Brandon Jessica Strobush Member Services & Education Coordinator, Public Technology Institute Jessie works with the Public Technology Institute’s leadership, member officials, and students to support meaningful educational experiences, enhance member engagement, and ensure smooth program and event delivery . She brings over three years of experience as a secondary educator, specializing in creating engaging curricula and managing Learning Management Systems (LMS) for both in-person and virtual instruction. She has trained new teachers on educational technology, developed outcome-aligned lesson plans across multiple subjects, and supported diverse student needs with creativity and dedication. Jessie brings exceptional organizational skills, and a passion for collaboration with a focus on transparency and success. Her passion for lifelong learning and effective communication fuels her commitment to serving government and civic clients and students with excellence and integrity. Contact Jessica Margaret Winchell Senior Account Executive & Event Manager Margaret has more than 30 years’ experience in educational event management for groups of 150 – 2500, as well as 20 years’ experience in association management, providing executive level leadership to both national and international clients. She has extensive experience working with hotels and convention centers around the globe and experience with coordinating transportation services, onsite/offsite event planning during the conference, securing entertainment, managing food and beverage, decorations for staging, receptions and banquets during a conference. Contact Margaret Mary Wynne Chief Executive Officer Mary has twenty years of experience as an accomplished nonprofit leader with a proven track record of designing and leading innovative, impactful programs and client services, including educational programming. She is adept at building relationships and incorporating the unique needs of diverse stakeholders to deliver outcomes that exceed expectations. Mary has been recognized for her strategic leadership skills and has been successful in overseeing complex change and growth initiatives. Contact Mary Board of Directors Our Board of Directors represents different roles and organizations, which helps provide breadth and depth as they guide and advise Fusion Learning Partners on issues of the day and future direction. This team of nonprofit and business professionals knows the underpinnings of Fusion and what guides our work. The Fusion Board of Directors shares our mission and values and hold us to the highest standards so that the communities and partners we serve receive exceptional service and results. Board of Directors Position Announcement lAre you civic-minded and want to support positive change in our communities? Do you believe in the importance of convening and connecting people to promote learning and inspire innovation? Are you looking for an opportunity to join a strategic group of cross-sector professionals to help lead a growing national organization? Then we want you to join our Board of Directors! Fusion Learning Partners is seeking volunteers to provide strategic guidance and fiduciary/operational oversight for the organization. Ideal candidates will have one or more of the following professional backgrounds*: Legal, preferably nonprofit and/or contract law Higher Education Government IT/IS Government Communications/Digital Services *Previous nonprofit experience and geographic representation outside the state of Minnesota is a plus The Position: Three year board term starting in January, 2026 Quarterly meetings Estimated 15 – 20 hour time commitment per year Who We Are Fusion Learning Partners is an established and growing national nonprofit organization dedicated to serving government and civic organizations with educational events, programs and services that inspire innovation for the greater good. We are a catalyst that convenes, connects and engages people and organizations so they can transform the communities they serve. We do this by offering: Professional Education, Events and Consultation Association Management Services Congerence Management Services We are Minnesota-based organization with new national reach, embarking on a plan for growth. With a focus on technology and innovation, we will continue to advance our core activities by producing a variety of fee-based, educational events and programs to individuals, as well as offering association, conference management and consultation services to organizations. Who You Are: You are a professional in the public, civic or private sector looking to support and contribute to the work of a nonprofit organization, expand your professional connections and grow new skills. You have experience with and/or an interest in supporting the work of the government and civic sector. You believe that ongoing professional development, life-long learning and innovative thinking are key drivers to the success of individuals, organizations and institutions. You are strategic and collaborative, and enjoy contributing ideas, connections and opportunities for business growth. For More Information: Contact Mary Wynne, Chief Executive Officer at mwynne@fusionlp.org Cathy Hart Board Chair President and CEO, Slainte Group Sue Wallace Vice Chair Strategic Communications and Outreach Manager, City of Minneapolis Dave Blanchard Board Secretary School of Education, Teacher Development: Information Media, Saint Cloud State University Jay Kiedrowski Board Treasurer Retired Senior Fellow, Humphrey School of Public Affairs Tom Steichen General Counsel & COO, Colliers Mortgage Holdings Osman Ahmed Director of Community Partnerships, Great MN Schools Greg Anderson Principal, Regional Practice Center Lead, Short Elliott Hendrickson Inc. Nick Bata Director of Sales, Horizontal Talent Amy Cheney Chief Information Officer, City of Bloomington, MN Kaela Dickens Client Lead & Analytics Consultant, Data Drive LLC Adam Frumkin Chief Information Officer, Franklin County, OH Adam Larson CIO/Director of IT, Washington County, MN Elizabeth Lo Chief Operating Officer, Harris County Texas Universal Services Joe Sheeran Communications Manager, City of Maplewood Norma Konschak Vice President Finance & Administration, Normandale Community College Mary Wynne Chief Executive Officer, Fusion Learning Partners Fusion Jobs Press Releases New Client Announcement! Fusion Learning Partners Serves the Western Regional Innovation & Technology Alliance (WRITA) Read More New Hire Announcement Laura Barry Joins Fusion Learning Partners to Serve as Director of Business Operations Read More New Hire Announcement Darryl Polk Joins Fusion Learning Partners to Serve as PTI’s new Director of Education Read More New Hire Announcement Barry Condrey Joins Fusion Learning Partners and PTI as the new Director of Technology Services Read More Exciting News from Fusion Learning Partners! Fusion Learning Partners Welcomes the Public Technology Institute to Further Enhance Government Tech Solutions Read More Our History 48 Years of Connecting, Convening, Inspiring, and Informing How do local policymakers, staff, and appointed officials in diverse settings and from diverse backgrounds gain the knowledge to make informed decisions and the skills to work effectively with other stakeholder groups? This is the question from which Government Training Services (GTS) was born. In 1976, as a result of work started by the Center for Urban and Regional Studies at the University of Minnesota, GTS was established as a public joint powers association. The intent was to bring together the providers and consumers of education and training, to develop quality programs available to all local governments so that each local entity did not have to “reinvent the wheel,” and to consider economies of scale. What emerged was a vehicle ideally suited for addressing intergovernmental and multi-sector educational needs. In 2003, due to cuts in state appropriated funds, GTS transitioned to an independent, nonprofit corporation, with a new board of directors, an expanded mission to serve both the public and civic sector, and a new name – GTS Educational Events. Over the years, GTS formed meaningful relationships with dozens of public, civic and private sector partners. Partners included those who worked with GTS for decades, as well as new partners who reaped the benefits of working with an organization that shared similar goals and values around the power of convening and connecting people. In 2022, in response to an extensive market/brand survey and new strategic plan, GTS Educational Events officially became Fusion Learning Partners. In 2023, Fusion Learning Partners acquired the Public Technology Institute and its programs and services, which allow us to broaden and deepen our work and commitment to serving public sector technology and innovation across the country. Now a national organization, Fusion is poised for growth in size, scope and impact. Building on the strength of our 48 year history, we are moving into the future as an organization that is focused on playing an important role in our society – perhaps now more than ever – to be a catalyst for organization and community transformation. We do this in a spirit of partnership and co-creation, working with our partners, clients, stakeholders and participants to bring people together to learn, solve problems and create positive social change. Get Started with Fusion! PTI Become a Member AI and Cyber Summit 2025 Training & Professional Development Consulting Services Research & Content Public Technology Job Board Call for Authors and Contributors 2025 GOVIT Leadership Summit & Symposium PTI Staff CLIENT SERVICES Event Planning & Management Organizational Support Current Clients ABOUT FUSION Overview Staff Board History Press Upcoming Events Blog Behind the Podium CONTACT Fusion Learning Partners 1400 Van Buren St. NE #200-239 Minneapolis, MN 55413 Support@FusionLP.org 651.222.7409 SUBMIT RFP COOKIE POLICY PRIVACY POLICY TERMS OF SERVICE Twitter Facebook LinkedIn Copyright © Fusion Learning Partners 2024 Jim Hall, CEO, Hallmentum Jim Hall is an innovative, high-achieving Senior IT Leader with over twenty years’ experience in IT Leadership. Jim believes in developing the next generation of IT Leadership, to help IT organizations better respond to the changing technology landscape. After serving more than eight years as Chief Information Officer in government and higher education, Jim founded Hallmentum to provide coaching, advising, and mentoring to CIOs and IT Directors, Leadership Development training to emerging IT Leaders, and Essential Management training to new managers and supervisors. Jim is a featured speaker on IT Leadership and Technology Innovation at conferences and venues including Government IT Symposium, SINC Midwest IT Forum, International Institute of Business Analysis, Premier CIO Forum, Minnesota e-Learning Summit, CIC CIO TechForum, and UBTech. Jim is a published author on IT Leadership, and has written Coaching Buttons, a collection of essays about leadership and vision in information technology: how to be a leader, how to lead through change, how to do strategic planning. Jim has also contributed chapters to several professionally published books on IT Leadership, including The Open Organization Leaders Manual (2nd Edition), The Open Organization Workbook, and Cultivating Change. Jim contributes feature articles about IT Leadership and Technology Innovation in magazines and journals including Government CIO Outlook, CIO Review, University Business, OpenSource, and The Open Organization. Jim has also been interviewed and cited as an expert on IT Leadership and Technology Innovation for publications including University Business Magazine, and MinnPost. Jim has a master’s degree in Scientific and Technical Communication from the University of Minnesota, and a bachelor’s degree in Physics from the University of Wisconsin-River Falls. CLOSE About Demos Economacos Demos Economacos – Systems Engineer – Software AG Government Solutions Demos Economacos is a Systems Engineer with Software AG Government Solutions. He has worked closely with a variety of Federal, State, and Local agencies in modernization, data sharing, and API initiatives. Demos is a former Information Technology employee of the Department of Human Services of the State of Minnesota and has first-hand experience with the complexities and challenges facing modernizing legacy applications. CLOSE About Sabih Khan Sabih Khan – Industry Strategy & GTM Executive, Public Safety & Justice- Salesforce Sabih Khan serves as an Industry Leader for Public Safety and Justice for Salesforce within the global public sector. In this role, he serves as a subject matter expert for Salesforce and its customers in policing technologies—specifically within the areas of digital transformation, business automation, AI, data analytics, and data management. In addition, he leads Salesforce’s go-to-market strategy for innovative solutions for public safety agencies across the globe. Sabih spent 15 years working in various public safety roles, 10 of which were as a sworn officer. Most recently, he served as the Deputy Chief of the Strategic Initiatives Division at the Chicago Police Department (CPD). Within this role, he led a vast number of wide-ranging initiatives in the nation’s second-largest police department, including its supply chain and logistics response to the COVID-19 pandemic in early 2020. He also oversaw CPD’s hardware technology transformation toward a mobile-only workforce, including transition legacy applications to the cloud. Earlier in his tenure at CPD, he led the development and management of the department’s technology and data analytics strategy while also overseeing units such as Information Services, Data Analytics, Evidence and Recovered Property, Records, Facilities Management, and General Support. CLOSE About Stacy Kaiser Stacy Kaiser- MNIT SOC Supervisor Stacy has amassed more than two decades of technology experience working for Minnesota, its’ counties, and private companies. She spent more than eight years leading and improving technology for local Minnesota government before taking on a leadership role within the state’s judicial branch. Stacy currently manages the State of Minnesota’s Security Operations Center (SOC) overseeing the state’s efforts to improve Cybersecurity monitoring, and incident management. CLOSE About Gorham Palmer Gorham Palmer – Distinguished Designer – IBM. Gorham is an IBM Distinguished Designer leading IBM’s UX practice in North America. For over 25 years, he has been fusing systems thinking with design craft to solve big, challenging, ambiguous problems. He draws on his experience as an illustrator, designer, and design thinker in creative services and customer experience consulting to deliver customer experience strategy, creative and brand strategy, conceptual problem-solving, organizational design transformation, and compelling creative execution in both traditional and digital media. CLOSE About Stephanie Ahles Stephanie Ahles – Trainer and Facilitator – HueLife. With great heart and wisdom, Stephanie leads the development and delivery of HueLife training and curriculum. She is dedicated to a deep comprehension of the methods and the highest quality standards. She is a co-creator and trainer of HUE Methods, a certified ToP trainer and facilitator, a certified Scrum Master, and an accredited Lumina Practitioner. Stephanie has more than 20 years of experience in county government. She specializes in leadership and organizational development, changes and project management, and strategic planning. She has an MA in Public Administration and a BA in Psychology and Social Work. CLOSE About Kim Wee Kim Wee – Webmaster and Digital Accessibility Coordinator – Minnesota IT Services partnering with Education Kim is the Accessibility Coordinator and Webmaster for Minnesota IT Services partnering with Education and is a Certified Professional in Web Accessibility (CPWA). She has over 20 years of web experience in design, development, and administration with a focus on web accessibility. CLOSE About Julie Baker Julie Baker – IT Strategic Analyst – Hennepin County Julie Baker is an IT Strategic Analyst as a member of the IT Strategic Planning team. Julie joined Hennepin County in 2014 as a business analyst, in 2017 she assumed the role of IT Consulting Specialist, and in 2020 became an IT Strategic Analyst. Julie is currently responsible for IT Strategic planning working alongside her peers who support strategic messaging, strategic measures, and business architecture as well as county IT leadership and many others across the organization. Julie was responsible and provided oversight of the 2019-2020 IT strategic plan as well as the current 2021 IT Strategic Plan. She stays actively engaged with the strategies, strategy teams, and sponsors associated with the strategic plan. Julie embraces continuous improvement and besides overseeing the current strategic plan is already beginning to formulate the next planning cycle and further maturing IT strategic planning for the county. CLOSE Golden GOVIT 2022 Collaboration WINNER: The Digital Experience Model Prior to the COVID-19 pandemic, Hennepin County was already laying a digital experience foundation across three areas: 1) aligning digital experience work with county core values and priorities, 2) prioritizing digital accessibility, and 3) shifting to Agile and User Experience principles. The pandemic accelerated how quickly the county need to respond to serve residents in an entirely new way without infrastructure to support it. The Office of Digital Experience was created to coordinate work across the organization to address residents’ digital needs with the goal to provide a consistently positive, accessible, and equitable digital service experience. The Office of Digital Experience accelerates the digital transformation of resident experiences by standardizing, prioritizing, and streamlining the rapid release of in-demand applications, websites, and tools, while centering the user every step of the way. This model joins key partners in the business, the IT community, and communication and engagement together to deliver coordinated digital service that provide residents a consistently positive, accessible, and equitable experience. There are approximately 15-20 newly created positions to research, design, and implement new ways of coordinating digital work with an eye on equity and centering the resident voice. Hennepin County leverages its existing workforce by creating opportunities for temporary assignments, for up to 24 months, for current employees who have an interest in helping shape the future of creating an accessible and consistently positive Digital Experience for residents. Partner teams in the model operate within three separate departments, jointly collaborating in service of all business lines. This structure enables appropriately resourced teams to focus on the core functions of digital experience, user experience, website communications, and web infrastructure to maintain and expand what the county’s digital service portfolio can provide to residents. The investment in the county’s digital services for all community members complements the Office of Broadband and Digital Inclusion’s work to eliminate the digital divide, too. Together these efforts create more opportunity for digital equity and engagement for Hennepin County residents. CLOSE Golden GOVIT 2022 Innovation WINNER: Digital Service Automation At the beginning of the pandemic, The Resident Real Estate Services division of Hennepin County quickly implemented a chat service off the Hennepin.us website as service centers closed. As in-person county services began to re-open, chat service continued to remain popular averaging over 500 chats a month. According to survey feedback, residents really like the ability to gain quick answers to their questions without having to come in person or wait on hold over the phone. Unfortunately, the quick vendor solution didn’t offer the capabilities and scalability that was needed to continue with the service. Additionally, many questions asked in chat had answers readily available on the Hennepin County website. The project established goals to both respond to simple resident questions through a chat bot allowing more time for Service Center agents to respond to more complex needs of residents. By keeping the scope of the project narrow, the chat service could be developed quickly and then adapted for use across other business areas while continuing to grow the volume of responses available from the chat bot. To address usability, the project started by analyzing the previous years’ worth of transcripts, over 10,000 chats, to identify the topics and questions most asked by residents. From there, the field of responses were narrowed down to the fourteen most needed by residents and clear enough to be provided by a chat bot. The responses were then reviewed for plain language and readability by the User Experience team. A UX Designer from the team recognized that there were no standards for chat UI, so they created a guide to help developers in their initial design. Developers quickly built a prototype to put before stakeholders. Business owners were able to use resident questions from chat transcripts to validate and train the AI responses from the chat bot. A UX review refined the final product to create a chat flow that clearly indicated when the resident was chatting with a bot and when the chat was with a live person. The early availability of the prototype allowed for an accessibility review, something the Enterprise IT developers had never experienced. This identified many barriers for use by screen reader and allowed time to repair before moving the chat service to production. This early action kept Hennepin County in regulatory compliance and trained developers on accessibility needs to incorporate in future work. Finally, the project incorporated an equity review throughout the project. First, a field was added to the current chat service for residents to voluntarily provide a zip code. Then, the zip code data was mapped to the Social Vulnerability Index (SVI), identifying the needs of most vulnerable communities based on their chat requests. Finally, zip code and SVI were integrated into the chat service to prioritize those community needs and mitigate unintended impacts. The new chat service is designed to scale across the organization, meet the growing needs of Hennepin County residents, and prioritize the most vulnerable populations in the community. CLOSE Golden GOVIT 2022 Service WINNER: Veteran Application Tracking System The Minnesota Department of Veteran Affairs Claims and Field Operations, assists Minnesota Veterans, their dependents, and survivors with State and Federal benefits and services. Prior to the start of this project, our division was operating on four separate systems. MDVA’s Deputy Commissioner sought out to change that and envisioned creating a system where MDVA’s multiple divisions had one shared system for application submittals, case management, application processing, award grants, information sharing, data collection and reporting of our Veteran’s benefits and services. This project comprised of cross functional teams from multiple Agencies and Divisions within MDVA. Some of these included Minnesota IT services (MNIT), MDVA Higher Education Veterans Programs and MDVA Programs and Services. The business manager ensured that all stories met the scope of the project and prioritized accordingly. The business analyst and scrum master ensured the developers were aware of the requirements. We had daily scheduled “stand ups” to verify tasks were being completed, resolve blockers, and clarify any requirements. The process was smooth, effective, and provided the business with a product that met all expectations and functions properly. Starting with the staff planning sessions in October 2019 and through the projected final release in November 2022 the process was completed in an agile, two-week SCRUM environment. The two-week process is called a sprint which consisted of, bi-weekly planning sessions, weekly backlog reviews, daily updates, and reviews. Shortly after the beginning of this project, the need for this system increased dramatically with the United States Department of Veteran Affairs (USDVA) initiative to go paperless and the effects of the Covid-19 Pandemic. These two events took away the ability for Veterans, County Workers and MDVA employees to meet in person and to physically submit applications/documents to each other and to the USDVA, during a time when MN Veterans needed assistance the most. As a result of the VATS Claims Project MN Veterans, MDVA’s Field Operations and Minnesota’s 87 County Veteran Service Offices can securely upload applications to MDVA’s Claims Offices and MDVA’s Benefits Division. MDVA Claims staff were able to continue their mission remotely, throughout the pandemic without interrupting the services they provide to our MN Veterans and stakeholders. MDVA claims staff were able to change their workflow to a paperless operation. The VATS Claims project now allows MDVA Claims to be on one shared system remotely which includes functionality such as: secured claims processing, form generation, case management, data sharing, reporting, and API’s which allow secure direct submittal of applications/documents to the USDVA and status updates from the USDVA. VATS Claims also has an enhanced County Upload Portal in beta testing currently with an expected release to all MN counties in November 2022. The VATS Claims Portal allows County Veteran Service Offices to securely submit applications/documents to MDVA’s Claims offices and State Soldiers Assistance Program. The portal also allows MDVA to share data, case management information, and upload statuses for MDVA & USDVA to the County Users. CLOSE Golden GOVIT 2022 Individual Leadership WINNER: Lisa Meredith Lisa Meredith has been the Executive Director for Minnesota County Computer Cooperative (MnCCC) for 20 years. MnCCC is a joint powers organization, working with counties and other local government entities to provide software solutions. Lisa has the leadership ability that makes the people around her thrive. She has a special skill of being able to understand the strengths of individuals and assist them in using those strengths for the betterment of the whole organization or project. Lisa works tirelessly and through her actions she has propelled MnCCC to new heights. She is the driving force in finding innovative, cost-effective software and technology solutions. Her efforts have transformed the landscape of public services. For example, recently Lisa was instrumental in two new software contracts that saved counties across Minnesota tens of thousands of dollars. In one project it was her initiative to get election software contracts in place for election equipment. In another project she assembled a group dedicated to Human Resources. With Lisa’s leadership this group went out for bid for payroll software, which is already saving counties on significant fees. Eventually that solution be offered to a wider local government audience. Under Lisa’s leadership, MnCCC has grown to 13 user groups and continues to grow and meet county and other local government needs. Lisa balances an incredible workload. Along with hundreds of meetings with all levels of county leadership, she still makes the workplace a fun environment that encourages staff to achieve a very high level of work output. Lisa has a strong commitment to bringing people and agencies together to work collaboratively. She truly believes and has proven a lot more can be done together rather than apart. Her work doesn’t stop there. Lisa’s motto is “to embrace the audacious acts that incite positive change” and it is evident in her work using ToP Facilitation to help other organizations solve problems. As a true champion of innovation and collaboration to improve service, Lisa Meredith is so deserving of the Golden GOVIT Award. CLOSE Golden GOVIT 2022 Individual Leadership Finalist: Megan Seeds Megan Evans Seeds is the Chief Digital Officer for Hennepin County. She is a true public servant at heart and is passionate about the user experience of residents who engage with the county online. Megan has been an influential leader in the digital services space for years, beginning by effectively managing county websites to most recently creating the Digital Experience model at the county. This model is a collaboration between multiple teams from multiple departments including IT, Communications, and the newly formed Office of Digital Experience (ODX), the core of the model, which she leads with an impressive balance of wisdom and curiosity. With Megan’s leadership, the Office of Digital Experience has launched or is set to launch new digital products, services, and resources: • Hennepin County Resident Services Chatbot • Hennepin County Web Standards • Hennepin County Climate Action website • The Hennepin County Digital Accessibility Policy • The Hennepin County User Experience Community of Practice These are just a recent sampling of the outcomes from Megan’s vision, strategy, and leadership. Megan has unquestionably been instrumental in the advancement of Hennepin County’s service to residents. She has been a force for change and dedicated to improving digital services for residents throughout her career. She continues to inspire and motivate her team and organization and is worthy of recognition with the GovIT Individual Leadership Award for 2022. CLOSE Golden GOVIT 2022 Individual Leadership Finalist: Michelle Heisler As we have seen nationwide, the pandemic brought many new challenges for workforces, including how employees work and collaborate in a hybrid environment. This was no different for Hennepin County’s employees and it quickly became apparent that spaces needed to be created to offer accommodations for these new work scenarios. Michelle Heisler, who serves as the Enterprise Strategic Solutions Manager within the IT department at Hennepin County, led the effort to develop and implement a strategic IT solution, in response to the new hybrid workforce. At the very beginning of the pandemic Michelle’s preparation and work with Microsoft on setting up Teams enabled all county employees to seamlessly transition from an in-office work environment to literally overnight having Teams rolled out to all county employees. The next challenge then became what will things look like in the physical space of our buildings as employees started to prepare to return to the office. The focus of this project was to create an energetic feature rich environment that embodies the Hennepin County culture of innovation and to leverage the Microsoft Teams Rooms technologies along with providing a modern upbeat environment. Hennepin County’s Core Values include: Continuous Improvement, Customer Service, Diversity and Inclusion, Employee Engagement, and Workforce Development, all of which were vital frameworks to consider for the Collaborative Work Center project to be successful. Michelle’s leadership style truly and wholly exemplifies Hennepin County’s Core Values in every sense and are at the center everything she sets out to accomplish. To best portray Michelle’s leadership competency and further support why she is so deserving of this award, here are some thoughts and contributions from some of the project team members… • Michelle collaborated effectively and respectfully across all county departments to achieve shared goals. • She connects with organizations and contacts outside of the county and has even brought other organizations’ best practices to our conversations, so that we could decide what could be replicated or adapted to improve our spaces. • Michelle focused on direction from county leaders and considered employee’s past experiences to inform strategic service planning and was creative and persistent in solving what were often challenging problems • Michelle’s willingness to openly share and to listen to other’s ideas were very much appreciated. As the project sponsor, Michelle provided support and guidance to help the project team overcome new and challenging hurdles. Supply chain issues, provisioning new equipment, and figuring out how to support these new devices all fell under Michelle’s leadership and relied on her expertise to get us where we are today. Michelle championed the concept of collaborative workspaces in challenging times and her commitment to making things better in a more innovative environment has enabled Hennepin County to set ourselves as true leaders in this space. It is truly an honor to have Michelle as part of our organization, leading the path for our future! CLOSE Golden GOVIT 2022 Service Finalist: WashingtonCountyOR.gov Website Redesign Washington County is located on the western edge of Portland, Oregon. It covers over 700 square miles of land and has a 600,000 service population who live across urban, suburban, and rural areas. With unique online needs increasing for each area, the County knew it was time to replace its public website with a digital gateway to a variety of services and information. The IT team and the Office of Equity, Inclusion & Community Engagement partnered with an outside consultant (Interpersonal Frequency) to help them understand the issues on their website, invest in community engagement, and translate that knowledge into a new user experience. They took a holistic look at what their communities were intending to do on the site and the obstacles in their way. Washington County and Interpersonal Frequency gathered quantitative and qualitative data about how citizens used the site, their pain points, etc. Focus groups were completed with live translation services in their native languages for four key community groups: the Housing and Supportive Service Network, the Western Regional Emergency Task Force, the Vision Action Network, and the Latino Professionals in Government. Some fascinating feedback included how needed information was usually on the site, but it was challenging or overwhelming to locate, even through search. In situations like a mental health crisis, there was no time to attempt to dig through departments for contact information or locations for vital services. Additionally, touchpoints were too small for mobile and tablet users, especially in the navigation menus. The lack of accessibility features made groups wonder who the prioritized population was on the site. It was also very difficult to find Spanish versions of the content — it was clear that Spanish users wanted to engage, but had no tools to do so. Washington County and its consultant took that data and began designing a user experience that listened to these users. First, they created streamlined navigation and wayfinding with a simplified structure. This included clearly prioritized updates and hierarchy to guide users to key tasks and timely information. Then they created task-based and action-focused items like a prominent “How-Do-I” style menu on the homepage to speed up access to key items across the site. The user experience also broke down departmental silos so users didn’t need to understand the County’s structure to find services. The new design adhered to brand standards, but reflected a clean and organized new look with broad appeal. This design also accounted for a variety of screen sizes for a seamless new mobile experience that is easier to use, while aiming for improved performance and accessibility overall. It provides options for translation and multi-language support, with some content manually translated for accuracy. Throughout the process, the teams returned to these community groups and completed usability testing. Doing so kept the community engaged and helped them feel invested in the results. As advocates for the new website, they interact with it more often and actively share it with their colleagues. CLOSE Golden GOVIT 2022 Service Finalist: Workforce One eSignature Imagine being a single parent who was recently laid off from your 10+ year job due to downsizing. Your skills are outdated, and you’ve had difficulty obtaining employment that will pay the rent and feed your family. You apply for the Minnesota Family Investment Program (MFIP) and are eligible to receive the maximum of $1,305 in cash and food benefits each month. While rent, utilities, and two growing children cost significantly more, you’ll be able to avoid eviction for at least two months. You begin working with an MFIP Employment Services (ES) Counselor, who explains that they can help with a resume, interviewing skills, funding for training, and help with your job search. After taking a short class to get a certificate and updating your resume, you finally land a job offer that will allow you to support your family without public assistance. Before you start the new job, you need funding for childcare until you can get a couple of paychecks and catch up on rent. Your ES Counselor explains that you need to sign an update to your Employment Plan so you can get childcare benefits approved. Before eSignature in WF1, there were few options to sign the document – all of which cost precious time and money. Where you live in Greater MN, public transportation is not available. If you don’t have a car, you need to wait for the paperwork to be mailed to you, sign it, then mail it back to your counselor, which could take upwards of a month of more. You fear that your future employer will not be able to accommodate delaying your start date if it takes that long to get childcare. If you have a car, another option would be to drive to the Counselor’s office 45 minutes away, but that would cost $20 in gas. If you have internet and a printer, the document could be sent from your counselor via encrypted email, printed out (if you can afford ink at $30/cartridge), then faxed or scanned back to the counselor. With the implementation of eSignature functionality in October 2022, your Counselor can send you the document for signature via email. You can open the document on your smartphone, tablet, or computer, sign and submit it within minutes. You can proceed with childcare arrangements and confirm your job start date with your new employer. It’s that simple. While eSignature functionality in WF1 has been a long-term plan, the pandemic expedited its development. The WF1 Team consulted with subject matter experts (SMEs) to gather requirements, verified security and validity of signed documents, and worked with a vendor. Gathering requirements from providers and program administrators allowed the WF1 Team to customize functionality so that it is available for over 2,000 staff and 100,000 customers. This enhancement is already changing the service delivery method to a more human-centered and accessible design, removing barriers for Minnesotans who are most in need. CLOSE Golden GOVIT 2022 Innovation Finalist: Collaborative work centers for remote and hybrid staff In 2020, County Administrator David Hough asked 6,000 of the county’s staff to work remotely to prevent the spread of Covid-19. To continue county services, staff had to reimagine service delivery. One of the highest priorities for IT was to imagine new ways to support a hybrid workforce. County Administration created three worker profiles for staff: onsite, hybrid, or remote. Onsite workers were asked to work primarily or entirely at county facilities. Hybrid workers were asked to divide their time between remote and onsite work. Remote workers were asked to work primarily or entirely offsite. Pre-pandemic, county buildings were divided into cubical or office spaces for departments – generally by floor or area. With new worker profiles, facilities would need to be transformed into places that hybrid or remote workers could temporarily use. IT partnered with the Facility Services Department to create new collaborative work centers. IT volunteered their 18 floor at the Hennepin County Government Center in downtown Minneapolis as a pilot. After significant planning, the team decided to create four different types of work zones. The first type is focus zones, which had technology staff would find in a cubicle pre-pandemic. The next type is a collaboration zone, which include conference rooms for both in-person and hybrid meetings. Next are community zones, which are informal places where staff can talk between meetings. Lastly, resource zones that include general office supplies and printers. Most of these spaces are equipped with Microsoft Teams Room technology. For meeting rooms, this includes a door scheduling panel to tell which rooms are booked, or the option to book in the moment. They also include equipment for hybrid meetings. Community zones include Teams phones and A/V equipment for impromptu meetings. When the pilot was complete, the project team worked with communications teams to announce the new space. This campaign included newsletter stories about topics including information about the types of work zones, guidance on shared space work etiquette, instructions on booking rooms, and reminders on items required for entry. Shortly after the opening of the 18 floor collaborative work center, Hennepin County opened a second space at the Ridgedale Regional Service Center – about 20 minutes away from the government center downtown. More collaborative work centers continue to be built and/or technology supplied in facilities around the county. Today, staff can choose between six locations for temporary work. IT and facilities will continue to work together on future collaborative work centers. The partnership between Facility Services and IT to create collaborative work centers for Hennepin County staff has been very successful. The collaborative work centers are an innovative way to integrate technology – like Microsoft Teams Rooms – into workspaces for staff. Other groups in Minnesota are asking Hennepin County for tours of these spaces to replicate the experience for this staff, including the Minnesota Department of Education, the Minnesota court systems, the state’s IT department, and the City of Minneapolis’s CIO. CLOSE Golden GOVIT 2022 Collaboration Finalist: Veteran Post 9/11 Service Bonus The Post-9/11 Service Bonus project was developed using Agile principles to enable the team to meet project objectives in the extremely short application release target of nine weeks. MNIT and MDVA project team members, began project initiation immediately after the Omnibus Veterans and Military Affairs bill was signed in early May 2022. Key stakeholders included, Veterans, County partners, and agency clients. Business requirements were captured and prioritized by the MDVA Product Owner in partnership with the project team. The project team’s requirement gathering efforts resulted in objectives that included the ability for Veterans or their families to easily submit an online application and supporting documentation, ability for Veterans to view the status of their application, ability for MDVA staff to review and process applications, integration, and automation of Veteran payments with the State’s financial system, and delivery of monitoring analytics and reports for management control. State of Minnesota IT security best practices were an integral part of all phases of the project to mitigate and reduce application security risk and vulnerabilities. The project team also captured project risks and corresponding mitigation plans during the project planning phase. A key risk identified during project initiation was the need for additional QA resources to meet the application testing requirements. The risk mitigation task involved a re-prioritization of MDVA work that resulted in additional QA resources being assigned to the project. Application development was executed in two-week sprints where each story was developed to meet a specific acceptance criteria. Each story was also functionally tested within the sprint and defects were fixed immediately to ensure quality. Each two-week sprint included a sprint review with stakeholders to allow application features and functionality input to be provided or confirmed. User acceptance testing (UAT) was coordinated within the project once the key application functionality was developed. UAT spanned approximately half of the project development timeframe to allow business partners a hands-on opportunity to use the application, test features and provide feedback and input. The Post 9/11 Service Bonus application was successfully released on July 7, 2022. The resulting application has provided Veterans, MDVA and county partners with one of the nation’s first service bonus applications. The solution provides a secure application for Veterans to apply for, and MDVA to administrate the Post 9/11 Service Bonus program which is sustainable and paperless through the payment process. As of October 28, 16,800 applications have been approved and $17.7M in payments have been dispersed to Veterans or their beneficiaries through the Post 9/11 Service Bonus application. A key component of the success of the project was the high level of partnership and collaboration between the MDVA and MNIT project team members. Despite the challenges of the project’s short timeframe and high importance, the project team members met their shared objectives through dedication, hard work and open and clear communication. The resulting project success is a significant benefit to the Veterans of the State of Minnesota. CLOSE Who is Jon Eichten, Deputy Commissioner, Minnesota IT Services? Jon Eichten serves as MNIT’s Deputy Commissioner. In his role, Jon oversees MNIT’s state agency-based Chief Business Technology Officers as well as MNIT’s business operations functions, ensuring executive branch agency technology needs are met in alignment with MNIT’s mission, vision, and strategic priorities. Jon previously served as MNIT’s Government Relations Director, where he oversaw MNIT policy and budget proposal development, and inter-agency and legislative affairs. Before joining MNIT, Eichten worked for the Minnesota Senate. CLOSE Spaceships Hello! Test test test CLOSE About Mary Frantz Mary Frantz is the founder, CEO and Managing Partner of Enterprise Knowledge Partners, LLC (EKP) based in Minneapolis, Minnesota. Mary has nearly 30 years of experience in technology and security. Fifteen years were spent in executive leadership roles in Fortune 150 corporations. She has accumulated extensive international experience and has managed the technical design and build of many global systems. She is a hands-on industry and court-vetted expert in cybersecurity, data breach, cloud-based service models, enterprise architecture, breach remediation and cyber forensics. She has led advanced ethical hacking (red teams), security assessments and has managed multiple cyber incident response investigations across the globe.  Mary is also plaintiff’s technical expert in the Equifax, Yahoo, Facebook, and many other breaches and cyber incidents. Mary graduated from Northern Illinois University with a quadruple major:  a B.A. in Math / Statistics, a B.A. in Foreign Language (Spanish, French), a B.S. in International Relations and a B.S. in Information Systems/Operations Management.  She received an M.B.A. from the University of Chicago with an emphasis in International Business and Finance, and a Masters’ in Computer Science Engineering from Georgia Tech. She holds various active and non-active certifications in systems auditing, ethical hacking, penetration testing, forensics, engineering and architecture. Mary is a keynote speaker, author and industry expert. She is a passionate advocate for women entrepreneurs in  STEM. She is a mentor and volunteer for women and minorities in business and technology, a Board Officer for the Minnesota Academy of Science, and a board member on the Minneapolis Cyber Summit. Mary is currently serving as an elected School Board Director for District 719. CLOSE About Kevin Ford Kevin Ford started as the CISO of North Dakota in November of 2019.  His previous role was CISO of CyberGRX in Denver, CO, one of the top cybersecurity start-ups in the nation, where he was responsible for expanding cybersecurity, privacy and risk management capabilities to protect the security information of over fifty thousand organizations, including Fortune 100 clients, from growing, global online threats. He previously served in senior consulting roles for Deloitte where he advised the U.S. Congress, the U.S. Indian Health Service, local governments, and multiple private sector customers on cyber-risk management initiatives and digital privacy.  Kevin also served as a member of the NIST Cybersecurity Framework development team and served as a cyber-risk manager for NASA. CLOSE About Stacy Kaiser Stacy has amassed more than two decades of technology experience working for Minnesota, its’ counties, and private companies. She spent more than eight years leading and improving technology for local Minnesota government before taking on a leadership role within the state’s judicial branch. Stacy currently manages the State of Minnesota’s Security Operations Center (SOC) overseeing the state’s efforts to improve Cybersecurity monitoring, and incident management. CLOSE About Brian Johnson Brian Johnson is the president of 7 Minute Security, which specializes in security assessments, penetration testing and training. He is especially passionate about teaching others about security and hosts a weekly blog/podcast to help consumers and businesses strengthen their security posture. When he isn’t camped out behind a keyboard, he enjoys outdoor activities with his family, as well as singing and playing guitar in an acoustic duo. CLOSE About Jason Rist Jason has 20+ years of IT, Engineering, Support, and Testing experience. By asking difficult questions, he looks to find solutions to complex problems for customers. CLOSE About Bryan Behrenshausen Dr. Bryan Behrenshausen is a community architect in the Open-Source Program Office at Red Hat, where he develops learning and enablement materials that teach others about the power and potential of open-source. He also is a lead architect of the Open Organization project and community. CLOSE Who is Dr. Verna Price? Dr. Verna Cornelia Price is an internationally known human potential expert who specializes in personal power, cross-cultural communications, facilitating racism conversations. employee engagement, leadership and managing change. As the CEO of The Power of People Consulting Group™, a leadership and management consulting firm, Dr. Verna consults with diverse audiences spanning from corporations, government agencies, not-for profits, K-16 educators and universities with clients in the United States, Europe, The Caribbean, Central American, Africa and China. Dr. Verna has founded multiple organizations in the USA including an Undergraduate Leadership Academic Minor at the University of Minnesota, The Power of People Leadership Institute, Girls in Action™(renamed Girls Taking Action) and Boys of Hope™. In 2020, Dr. Verna created and hosted a radio talk show in partnership WCCO Radio called In the Room Where it Happened: Racism Conversations that Matter to ALL of Us. In 2020, Dr. Verna was named one of the Top 100 People to Know in 2021 by Twin Cities Business Magazine. In 2017, Dr. Verna received the Founders Award from the University of Minnesota, Twin Cities for her role in cofounding the Undergraduate Leadership Academic Minor, now the largest of its kind in the world. In 2013, Dr. Verna was named an Everyday Hero by EBONY Magazine and received the MN LINKS Emerald Award. In 2010, Dr. Verna was named Entrepreneur of the Year by the Black MBAs and Pioneer of the Year by Women Venture. Dr. Verna is a best selling author of three books, The Power of People: Four Kinds of People Who Can Change Your Life ( also published in Spanish), The Silent Cry: Dealing with Subtracters in Work and Life , and Change Your Life in 30 Days. Dr. Verna received her Ph.D. from the University of Minnesota. CLOSE Who is Nancy Lyons? Nancy, CEO and co-founder of Clockwork , is an outspoken advocate for making work better. More inclusive, flexible, and adaptable. No one does great work if they’re worried or if they can’t bring their whole self to work. And she learned this the hard way: by having terrible jobs and not fitting in. Things many of us can relate to. But how do we create workspaces like that? It’s on us: leaders, employees, teams. People. We all have to take responsibility for creating cultures and spaces that actually work for humans, with all their complexities, nuances, and intricacies. And in doing so, we will make better products, better experiences, and have better work lives. Are you ready for a work revolution? She is. Her first book was Interactive Project Management: Pixels, People, and Process , a human-centered approach to producing digital products. Her current book, Work Like a Boss: A kick-in-the-pants Guide to Finding (and Using) your Power at Work , is the little book everyone needs to remember the actions, attitudes, and attributes that will make work better, for individuals and everyone around them. CLOSE Justin Femrite Headshot About Justin Femrite, Public Works Director & Chief Engineer Justin Femrite is the Public Works Director and Chief Engineer for the City of Elk River. In this role he is responsible for the administrative and professional work planning activities of the City’s engineering, wastewater, stormwater and maintenance divisions. He provides the direction for long term planning, design, construction, inspection and maintenance of public drainage, sanitary sewer, park, trail and roadway systems in the City. He further helps develop the department’s long term vision and participates at all levels of government to assure the department’s ability to be run efficiently and effectively. CLOSE About Avish Parashar, Author & Speaker Avish grew up in “exotic” Poughkeepsie, NY and now makes his home in Philadelphia, PA. Though he performed all through high-school, he decided to stop performing when he went to college to “focus on his studies” (his parents were very proud of this decision). That resolve lasted only a few months, as the first time he saw an improv comedy show he fell in love (his parents were slightly less proud). One week later he auditioned for the campus improv group, got in, and the rest is history. After graduating, he started Polywumpus Improv Comedy, which performed regularly in and around Philadelphia for seven years. Avish closed up Polywumpus to focus on the speaking and training side of the business – using improv comedy as a tool to teach valuable business skills such as creativity, innovation, and adaptability. Weaving together humorous stories, jokes, audience interaction, and improv comedy games, Avish keeps the audience engaged while imparting a key lesson: Planning is Important, but Improvising is Essential! No matter how well you plan, things will go wrong, surprises will arise, and the Universe will throw you a curveball. Your success and sanity are directly related to how you respond these challenges. By the end of one of Avish’s presentations you will have key tools to flow with all that life throws at you. Avish has spoken to the very creative (actors and directors), the very un-creative (accountants), the very casual (college students), and the very business-like (sales professionals). The end result is always the same – smiles, laughs, and a new way of looking at life and business. Avish is the author of “Improvise to Success!” and the Amazon best-selling, “Say ‘Yes, And!'” (And yes, his parents are once again very proud.) CLOSE Tim Walz is Minnesota’s 41st Governor. His career has been defined by public service, from serving our country in the military to serving our students as a high-school teacher and football coach to serving our state in Congress. Born in a small town in rural Nebraska, Tim’s parents instilled in him the values that guide his commitment to common good and selfless service. Soon after his high school graduation, Tim enlisted in the Army National Guard. Tim attended Chadron State College, where he graduated with a social science degree in 1989. Harvard University offered Tim an opportunity to gain a new perspective on global education by teaching in the People’s Republic of China from 1989-90, where he joined of one of the first government-approved groups of American teachers to work in Chinese high schools. Upon his return from China to Nebraska, Tim served full time in the Army National Guard, and accepted a teaching and coaching position. More importantly, he met his wife, Gwen Whipple, who was teaching at the same school. Tim and Gwen Walz moved to Mankato in 1996, where they began working at Mankato West High School. In addition to teaching social studies, Tim helped coach the Mankato West football team that won the school’s first state championship. After 24 years in the Army National Guard, Command Sergeant Major Walz retired from the 1-125th Field Artillery Battalion in 2005. Tim won his first election to the United States House of Representatives in 2006, and was re-elected for another 5 terms serving Minnesota’s First Congressional District. In addition to his work on the Farm Bill, the Lewis & Clark Regional Water System, Minnesota Highway 14, and the Minnesota State Veterans Cemetery in Preston (MN), Tim introduced the STOCK Act, a bill that sought to limit congressional insider trading. On March 22, 2012, the STOCK Act passed with overwhelming bipartisan support in both the House and the Senate. After years of living in Mankato, Tim and Gwen moved to St. Paul with their two children, Hope and Gus, and their rescue pets, Scout and Afton. CLOSE Tarek Tomes serves as the Commissioner of Minnesota IT Services (MNIT) and the State of Minnesota’s Chief Information Officer (CIO), leading state efforts to provide the best possible IT solutions and customer service to the people of Minnesota and our business partners. As a recognized industry leader, Tomes brings over 25 years of experience in managing technology innovation across diverse industries, both in national, international, and public and private sector operations. Throughout his career, he has facilitated data-driven decision making, implemented many critical enterprise projects, and improved workforce diversity and inclusion. Before becoming Commissioner, Tomes served as the Chief Innovation Officer and former Chief Information Officer at the City of St. Paul, where he was responsible for managing ongoing process improvements, supporting human-centered design, and increasing the overall effectiveness of city services and resources. While in St. Paul, Tomes facilitated a digital transformation at the city level, pioneering the use of mobile applications to improve resident opportunities. This work allowed the city to leverage deep data insights while promoting and supporting equitable service delivery. During his time as St. Paul’s Chief Information Officer, Tomes oversaw the launch of St. Paul’s Open Information Portal, which serves to promote and encourage innovative uses of data and transparency in government services. Tomes’ prior work experience also includes six years as an Assistant Commissioner of Minnesota IT Services, where he created several nation-leading Information Technology sourcing agreements for 33,000+ user utility services statewide – including the first cloud-based public sector statewide service offering in the nation. While Tomes was serving in this role, Minnesota became the first state in the country to manage all Information Technology through service level agreements, a model that was recognized with a national award. Before joining state service, Tomes spent 13 years working for British Telecom. CLOSE About Dr. Archelle Georgiou, Chief Health Officer, Starkey Hearing Technologies Dr. Archelle Georgiou is the Chief Health Officer for Starkey Hearing Technologies, a global hearing technology company headquartered in Eden Prairie, Minnesota. She is responsible for the company’s commitment to improve individuals’ overall wellness and quality of life through products that deliver better hearing. She develops and maintains strategic relationships within the medical community, oversees the Healthable features embedded in the company’s hearing aids, and brings hearing health to the forefront of overall health. Dr. Georgiou’s extensive healthcare background includes experience as a physician, business executive, advisor, author and speaker. She was Chief Medical Officer of United Healthcare between 1996 and 2007 where she eliminated unproductive policies within the healthcare system and designed systems to coordinate care delivery.  From 2008 to 2010, Dr. Georgiou served as a senior fellow in the Center for Health Transformation, a bipartisan think-tank established by former Speaker of the House, Newt Gingrich. Since 2008, Dr. Georgiou has been a strategic advisor to a diverse group of companies who are dedicated to cultivating cross-industry collaboration and patient-centric care. She serves as an adjunct faculty member and Executive in Residence at the University of Minnesota’s Carlson School of Management. Archelle serves on the Board of Directors and is Chair-Elect at Children’s Hospital and Clinics of Minnesota; she is also on the Board for CaringBridge. For all the above and more, Dr. Georgiou received the Champion Award among Minnesota Business Healthcare Leaders in 2014 and was recognized “an individual who has focused their efforts to elevate the profile/status of the state’s health care industry.” One of Dr. Georgiou’s greatest passions is using the media to educate consumers. As a medical expert, she has covered over 1,500 medical topics during her weekly segments on KSTP-TV. As an innovator on consumerism and health reform, she has been asked to speak at the White House, the World Bank and the Surgeon Generals of the Army, Navy and Air Force. She has also appeared on FOX Business Network, CNN, Good Morning America, and Katie’s Take with Katie Couric. In 2009, she was the medical correspondent for a Blue Zones international expedition to Ikaria, Greece, where she worked with National Geographic researcher Dan Buettner to explore the underlying explanations for the island population’s longevity. Based on her interactions with viewers, Dr. Georgiou developed the CARES Model, a five-step approach that consumers can use to make healthcare decisions, and in February 2017, published her first book, Health Care Choices: 5 Steps to Getting the Medical Care You Want and Need (Rowman & Littlefield). Dr. Georgiou graduated from the Johns Hopkins School of Medicine and was board-certified in Internal Medicine. She lives in Wayzata, Minnesota and enjoys spending her time with her husband, three girls and diva-like dog, Isabella. CLOSE About Dennis Zuzek, Sr. Vice President and Chief Technology Officer, HealthPartners Dennis Zuzek is Sr. Vice President and Chief Technology Officer for HealthPartners in Minneapolis, Minnesota. HealthPartners, the largest consumer-governed nonprofit health care organization in the nation, delivers care and provides health insurance coverage across the upper Midwest. Dennis is the leader of Information Services & Technology, which provides infrastructure, applications and data management services to support HealthPartners health plan serving 1.8M members, a care delivery system serving 1.2M patients and a workforce of 28,000 colleagues. The department collaborates closely with business partners across the organization to: Advise, evaluate and recommend advanced technology investments that support HealthPartners future growth Develop and manage applications for organization-wide care delivery, health plan and system services for patients, members, purchasers, providers and employees Manage an information technology backbone to support analytics, consumer engagement, and operations Operate a reliable and secure on-premise and cloud infrastructure Dennis has served as a technology leader at HealthPartners for six years. In January 2021 he was appointed to his new role as CTO. During his tenure, he oversaw the growth of health plan technology, including web & mobile and numerous applications. Previously, he held several vice president and director positions in network management, clinical analytics, clinical systems development and data management at UnitedHealth Group and Allina Health. Dennis has a bachelor’s degree from the University of Minnesota and a master’s degree from the University of Wisconsin-Milwaukee. CLOSE About Meyrick Vaz, Vice President – Strategic Market Partnerships, UnitedHealthcare Meyrick Vaz leads strategic market partnerships within the UnitedHealthcare (UHC) Office of the CIO. In this role, he closely tracks emerging trends and developments in healthcare, while scouting for innovation that aligns with UHC’s business agenda. He is responsible for identifying, evaluating, piloting, scaling up, and rolling out new, untested ideas and approaches that could improve patient experience and increase provider satisfaction. He is currently focused on the application of blockchain in healthcare including UHC’s work with the Synaptic Health Alliance. Meyrick has more than 28 years of business technology leadership experience in industries like healthcare, financial services, retail, information services, and consulting. CLOSE About Scott Feinberg, MPH, Senior Client Executive – Healthcare, Amazon Scott Feinberg has over 20 years’ experience working in healthcare technology and has a deep understanding of the entire healthcare ecosystem. As a leader, Scott has spent time working on some of the most up-and-coming Telehealth solutions, cloud technologies, and digital transformation. while not losing sight of the importance of direct patient care. Today, Scott currently works at Amazon, supporting some of the largest non-profit healthcare providers in the country. Before Amazon, Scott held leadership roles at UnitedHealth Group, Cisco, Infor, and Dell. As a Minnesota HIMSS board member, Mr. Feinberg also holds a CPHIMS Certified Professional in Healthcare Information and Management Systems from HIMSS. Scott is a featured speaker and podcaster on technology. Scott graduated from the University of Minnesota and later earned a mini masters in eCommerce from St. Thomas. CLOSE ABOUT TRESSA SPRINGMANN Tressa Springmann has been Chief Information Officer for LifeBridge Health since 2012.  Further she has had responsibility as Senior Vice President over Performance Improvement including the organization’s Lean transformation work (prior) and currently over the systems HIM function.  LifeBridge Health, a $2B in revenue not for profit system, consists of Sinai Hospital, Northwest Hospital, Carroll Hospital, Levindale Hebrew Geriatric Center and Hospital, and its subsidiaries and affiliated units, with nearly 10,000 employees and a vast physician network, LifeBridge Health provides patients with a continuum of care as a partner for lifelong health. As one of the largest and most comprehensive providers of health-related services to the people of Maryland, LifeBridge Health has the technology, skills and expertise of an academic system with the warmth and personal attention of a community continuum of care. Tressa is chairman of the technology committee for CRISP, Maryland’s State Health Information Exchange (HIE), and a member of the Premier Member Technology Committee (MTIC). She is also currently on The Healthcare Management Program Advisory Board for Towson University and is an adjunct professor at Mount St Mary’s University previously teaching Healthcare Information Technology as part of their Masters in Healthcare Administration (MHA) program. She is the Past President of Maryland HIMSS (MDHIMSS), is a certified professional in Health Information Systems Management (CPHIMSS) and has attained her certification as a Healthcare CIO. (CHCIO).  Tressa has served multiple years on the AHA ‘Most Wired’ Selection Committee, was a question writer for both the CPHIMSS and CHCIO exams.  She has been on the program planning committee for multiple CHIME forums and is currently active on the CHIME membership committee and recent CHIME Foundation feedback sessions.  She has regularly attended CHIME Forums and various educational events including participation in many vendor focus group sessions.  She holds her Masters from The Johns Hopkins University and her BA in Biology from St. Mary’s College of Maryland. Prior to joining LifeBridge Health, Tressa Springmann served as Vice President and Chief Information Officer (CIO) for Greater Baltimore Medical Center (GBMC) of Towson, Maryland, which includes a 300 bed acute hospital, an employed and community physician organization and the region’s largest hospice provider.  Ms. Springmann has also held information technology positions at Integrated Health Services (IHS), Georgetown University Hospital, Dimensions Healthcare System, CMC Occupational Health, Pharmacia Diagnostics, Electronic Data Systems (EDS) and The Johns Hopkins School of Medicine. Tressa recently received her Wine Production Certificate from Penn State. ABOUT CYNTHIA PERAZZO Cynthia is a solutions-oriented healthcare strategist and innovator. She leads AVIA’s Center for Consumerism which is focused on identifying and building strategies to improve access, experience and consumer relationships that can result in growth and consumer loyalty.  As the leader of AVIA’s team in the West, Cynthia assures that AVIA member health systems are achieving the greatest value from adoption of digital solutions.  She and her team work with members to deeply understand their strategy and market dynamics and identify and implement innovative technologies to address critical organizational needs. Cynthia believes collaboration is the key to success for any organization seeking to successfully implement significant change. Before joining AVIA, Cynthia served as the Senior Vice President of Strategy & Business Development at Hoag Health, a regional health system in Newport Beach, California. Cynthia lead organizational strategic planning and business development in support of Hoag’s mission to provide the highest quality health care services to the communities of Orange County and beyond. Before joining, Hoag she served as Vice President of Corporate Development for Premier, Inc., a national alliance of health systems.  Cynthia led Premier’s strategic growth into the United Kingdom and developed the business plan and first contract with the National Health Service for a hospital pay for performance program based on Premier’s CMS Hospital Quality Improvement Demonstration project. Entrepreneurial in nature, Cynthia co-founded and served as VP of Business Development for nTrusted, Inc., a consumer focused, health-related software company in San Diego. Cynthia also worked with a new venture developing innovative, point-of-care clinical information systems, leading business development, sales and marketing. Cynthia holds a Master’s degree in Business Administration from the Harvard Business School and a Bachelor’s degree in Business Administration in Finance from the University of Texas at Austin. CLOSE ABOUT EDWARD W. MARX Ed has served as the CIO for University Hospitals Health Systems, Texas Health Resources, NYC Health + Hospitals and the Cleveland Clinic. At every organization, Ed helped lead mobile strategies, analytics, and digital transformation to drive superior clinical and business outcomes. Author of ‘Voices of Innovation: Fulfilling the Promise of Information Technology in Healthcare’ (2019), ‘Extraordinary Tales from a Rather Ordinary Guy’ (2014), and ‘Scenes From an Early Morning Run’ (2019), Ed’s latest release, ‘Healthcare Digital Transformation: How Consumerism, Technology, and Pandemic are Accelerating the Future” is the #1 Amazon Best Seller in the Healthcare Innovation category. An avid athlete, Ed is a heart attack survivor, cancer survivor, and member of TeamUSA Duathlon. ABOUT CRIS ROSS Christopher Ross is currently the Chief Information Officer of Mayo Clinic. Prior to that, he was Executive Vice President and General Manager of the Clinical Interoperability business for Surescripts. He has 28 years of diverse experience in healthcare, information technology and government. He serves on the Health and Human Services Health IT Standards Committee, the Markle Foundation Connecting for Health Steering Committee, and previously served on the Patient Centered Primary Care Collaborative and the CDC’s National Biosurveillance Advisory Subcommittee. Before Surescripts, Cris most recently was Executive Vice President for Product and Information Services and Chief Information Officer for CVS/MinuteClinic, the pioneer and leader in retail-based healthcare. Cris holds a BS degree in Economics from the University of Minnesota and an MBA from the Yale School of Management. He serves on the Boards of Directors of the Walk-In Counseling Center and Central Presbyterian Church. Close About Jennifer Lundblad, Ph.D., M.B.A., President & CEO, Stratis Health Jennifer P. Lundblad, PhD, MBA is President and CEO of Stratis Health, an independent non-profit organization that leads collaboration and innovation to improve health. Dr. Lundblad has an extensive background in leadership, organization development, and program management in both non-profit and education settings. She has a BA in speech communication and economics from Macalester College, an MBA in public and non-profit management from Boston University, and a PhD in education with a focus on training and organization development from the University of Minnesota. Her dissertation research was “Teamwork and Safety Climates in Small Rural Hospitals,” and she has published articles in peer reviewed journals on topics related to health quality and organizational change. Dr. Lundblad is a member of the national RUPRI (Rural Policy Research Institute) Health Panel and serves on various other national and local boards and in committee leadership positions. She has an adjunct assistant professor appointment at the University of Minnesota School of Public Health. CLOSE About Jan Malcolm, Commissioner, Minnesota Department of Health Commissioner Malcolm was appointed in January 2018 as commissioner for the Minnesota Department of Health. Ms. Malcolm is responsible for directing the work of the Minnesota Department of Health. MDH is the state’s lead public health agency, responsible for protecting, maintaining and improving the health of all Minnesotans.  The department has approximately 1,400 employees in the Twin Cities area and seven offices in Greater Minnesota. Professional Background: Prior to being appointed commissioner, Jan Malcolm was an adjunct faculty member at the University of Minnesota School of Public Health, where she co-directed a national research and leadership development program funded by the Robert Wood Johnson Foundation. Earlier she also helped develop initiatives to strengthen the nation’s public health system as a senior program officer at the Robert Wood Johnson Foundation. Commissioner Malcolm previously served as CEO of the Courage Center and as President of the Courage Kenny Foundation following the merger of Courage Center and the Sister Kenny Rehabilitation Institute. She has also worked as Vice President of Public Affairs and Philanthropy at Allina Health. From 1999 to 2003, Ms. Malcolm served as Commissioner of the Minnesota Department of Health. Throughout her career, she has been active in state and national health care, public health associations, and government commissions on health care access and quality. Educational Background Jan Malcolm is a graduate of Dartmouth College. Honorary Doctor of Laws from U of M School of Public Health Malcolm previously served as CEO of the Courage Center and as President of the Courage Kenny Foundation following the merger of Courage Center and the Sister Kenny Rehabilitation Institute. She has also worked as Vice President of Public Affairs and Philanthropy at Allina Health. From 1999 to 2003, Malcolm served as Commissioner of the Minnesota Department of Health. Throughout her career, Malcolm has been active in state and national health care, public health associations, and government commissions on health care access and quality. CLOSE About Bobbie McAdam, Vice President, Enterprise Program Services, Medica Bobbie McAdam has held positions in direct patient care settings, technology companies and health plans throughout her career in the health care industry.  Her experience includes managing healthcare EDI initiatives related to provider outreach and education, application/portal development, IT infrastructure services, health care data standards and data integration, translation and exchange.  She currently holds accountability for a multi-disciplinary team focused on vendor and contract management, finance and enterprise strategic project investment governance.  Bobbie possesses a Bachelor of Science degree in Medical Record Administration from Bowling Green State University. CLOSE About Renee Frauendienst, RN, PHN, BSN, Retired Public Health Director, Stearns County; current Vice-Chair, St. Cloud Hospital Board Renee Frauendienst is recently retired from Stearns County as the Public Health Director.  She received her Bachelor’s Degree in Nursing from the College of St. Benedict and has a Certification in Performance Improvement from the University of Minnesota, School of Public Health.  During her 33 years as a leader in Public Health, she was known for her expertise in innovation, policy development, performance improvement, emergency preparedness and community engagement, which earned her several awards including the Jim Parker Leadership Award and the Barbara O’Grady Award.  In her retirement, she has started her own consulting business where she focuses on assisting governmental entities with performance improvement projects with a particular focus on public health and human services.  She has a particular interest in the role of nurses in impacting health equity and building a culture of health in their community.  She currently serves as the vice-chair for Stratis Health Board, the vice-chair for the St. Cloud Hospital Board and is the current president for the Minnesota Center for Nursing. CLOSE About Deepti Pandita, MD, Chief Health Information Officer, Hennepin Healthcare Deepti Pandita MD is the chief Health Information officer at Hennepin Healthcare in Minneapolis, MN, a safety net academic medical center and also a Level one Adult and Pediatric Trauma center. Dr. Pandita is Board Certified in Internal Medicine and in Clinical Informatics. She is also Program Director of the Clinical Informatics Fellowship at Hennepin Healthcare. She received her Medical Degree from Christian Medical College, Vellore, India and did her residency training at university of North Dakota Dr. Pandita is active with the American Medical Informatics Association and American college of Physicians leading several state and National committees. She is also on the board for Minnesota doctors for Health Equity and Board member of the Healthcare Executive Forum. Deepti has a passion for using innovation and technology to improve care delivery for the underserved and marginalized populations. She started a telemedicine program that delivers substance abuse treatment to incarcerated patients at the Hennepin county jail and is working to create health equity in the space of Telemedicine for all underserved populations during the Pandemic and beyond. CLOSE About Jennifer Fritz, MPH, Director, Center for Health Information Policy and Transformation, Minnesota Department of Health Jennifer Fritz is the Director of the Office of Health Information Technology at the Minnesota Department of Health.  She is responsible for the direction of Minnesota e-Health programs, including the Minnesota e-Health Initiative, Administrative Uniformity, Minnesota’s Health Information Exchange Oversight Program, and activities related to privacy and security, health informatics and data standards. Prior to this role, Jennifer served as Deputy Director of the Office of Health Information Technology and various other roles at the Minnesota Department of Health.  Jennifer has received a Bachelor of Science and Master of Public Health degrees from the University of Minnesota. CLOSE About Rahshana Price-Isuk, MD, Director of Clinical Services, Northpoint Health & Wellness Center Medical Degree:  MD, University of Maryland, Baltimore Residency Training: University Of MN Family Medicine Redisency-North Memorial/Broadway Family Medicine Clinic. Philosophy of Care: As a Minneapolis native, Dr. Price-Isuk is passionate about service to the Minneapolis community. She  grew up in both North and Northeast Minneapolis, attending Northeast Junior High School and graduating from North Community High School. After finishing medical school Dr. Isuk returned to her community and attended Family Medicine residency training  at the  University of Minnesota Broadway Clinic and North Memorial Medical Center.  Dr. Isuk has a passion for health education.  She desires to teach patients how to take ownership of their wellness.  Her goal is to empower people and communities to take control of their health and well-being in addition to teaching providers how to provide culturally competent, equitable healthcare services.   Dr. Isuk looks at each visit as an opportunity for learning for both provider and patient.  Clinical Interests and Experience:  Dr. Isuk enjoys her specialty of Ambulatory Family Medicine and has been Board Certified for 15 years.  She provides comprehensive care for persons starting at birth through end of life care.  She takes particular interest in the adolescent population and loves assisting them in addressing their health and social needs and leading them toward finding life’s purpose. Other Interests: Public Speaking, Mentoring, Cooking, Singing, Cycling/Power Walking, Playing with my kids! Favorite TV show is “The Voice.” CLOSE About Pleasant Radford Jr. MBA, Health Equity Officer, UCare Mr. Radford is a multidisciplinary health care professional who uses his experience in health care business management, public health, and community engagement to help build an equitable, affordable, culturally competent health care system for all. Formerly, Radford was Principal Evaluator at Blue Cross and Blue Shield of Minnesota, where he directed the evaluation of healthy eating, physical activity and commercial tobacco prevention projects across the state of Minnesota, and worked with key community and corporate stakeholders in public policy, population health and consumer experience to improve health outcomes for members experiencing health inequities. Prior to his position at Blue Cross, Radford was a consultant at UnitedHealth Group. He also worked at Mayo Clinic, University of Chicago, Illinois Caucus for Adolescent Health and served in the Peace Corps. As Health Equity Officer at UCare, Radford will work across the organization to align clinical, community and provider health equity initiatives. UCare Senior Vice President and Chief Medical Officer, Julia Joseph-Di Caprio, M.D. said, “Pleasant brings enormous depth of experience and passion to this new role at UCare. We are excited to have him lead this important work creating opportunities for all of our members to have equitable access to health care and a good quality of life, which is difficult for so many UCare members because of their race or economic circumstance.” Radford serves on the Board of the Guthrie Corporate Council and previously was a Board member of Nice Ride Minnesota. He holds a Master of Business Administration (MBA) from the University of St. Thomas (Minneapolis, MN) and a Bachelor of Science (BS) in Psychology and Bachelor of Arts (BA) in Spanish from the University of Illinois (Champaign, IL). Radford and his wife, Toni, live in Minneapolis, Minnesota. CLOSE About Paul Kleeberg, MD, FAAFP, FHIMSS, Retired family physician and former Regional Medical Director, Aledade Dr. Kleeberg is a retired family physician and experienced in assisting physicians and clinic leadership to achieve their goals in value-based care. His most recent accomplishment has been Regional Medical director with Aledade where all his ACOs reduced the cost and increased the quality of care while more than half had achieved shared saving checks. Among his other accomplishments have been serving as the Chief Medical Informatics Officer for Stratis Health, Medical Director for Clinical Decision Support at HealthEast Care System and for Allina Health.  He has been Board Chair for HIMSS (The Health Information Management Systems Society), led the meaningful use committee for the Office of National Coordinator for Health Information Technology, and clinical lead for the team implementing the Epic Ambulatory System at Alina.  He started his medical practice providing the full spectrum of family medicine in a small independent practice St Peter Minnesota and later he worked in a suburban ambulatory practice in Ramsey MN, part of the Allina Health system, using the ambulatory EHR he had helped design. Dr. Kleeberg comes with vast experience in value-based care and the implementation of technologies, including telehealth, to improve provider workflows, care quality, cost savings and the patient experience of care. CLOSE ABOUT MICKY TRIPATHI Micky Tripathi is the National Coordinator for Health Information Technology at the U.S. Department of Health and Human Services, where he leads the formulation of the federal health IT strategy and coordinates federal health IT policies, standards, programs, and investments. Mr. Tripathi has over 20 years of experience across the health IT landscape. He most recently served as Chief Alliance Officer for Arcadia, a health care data and software company focused on population health management and value-based care, the project manager of the Argonaut Project, an industry collaboration to accelerate the adoption of FHIR, and a board member of HL7, the Sequoia Project, the CommonWell Health Alliance, and the CARIN Alliance. Mr. Tripathi served as the President and Chief Executive Officer of the Massachusetts eHealth Collaborative (MAeHC), a non-profit health IT advisory and clinical data analytics company. He was also the founding President and CEO of the Indiana Health Information Exchange, a statewide HIE partnered with the Regenstrief Institute, an Executive Advisor to investment firm LRVHealth, and a Fellow at the Berkman-Klein Center for Internet and Society at Harvard University. He holds a PhD in political science from the Massachusetts Institute of Technology, a Master of Public Policy from Harvard University, and an AB in political science from Vassar College. Prior to receiving his PhD, he was a Presidential Management Fellow and a senior operations research analyst in the Office of the Secretary of Defense in Washington, DC, for which he received the Secretary of Defense Meritorious Civilian Service Medal. CLOSE Jim Hall is an innovative, high-achieving Senior IT Leader with over twenty years’ experience in IT Leadership. Jim believes in developing the next generation of IT Leadership, to help IT organizations better respond to the changing technology landscape. After serving more than eight years as Chief Information Officer in government and higher education, Jim founded Hallmentum to empower IT Leaders to drive meaningful change through hands-on training, workshops, and coaching. Jim is a featured speaker on IT Leadership and Technology Innovation at conferences including Government IT Symposium, SINC Midwest IT Forum, International Institute of Business Analysis, Premier CIO Forum, Minnesota e-Learning Summit, CIC CIO TechForum, and UBTech. Jim is a published author on IT Leadership, and is the author of Coaching Buttons, a collection of essays about leadership and vision in information technology: how to be a leader, how to lead through change, how to do strategic planning. Jim has also contributed chapters to several other books on IT Leadership, including The Open Organization Leaders Manual (2nd Edition), The Open Organization Workbook, and Cultivating Change in the Academy. Jim contributes feature articles about IT Leadership and Technology Innovation in magazines and journals including Government CIO Outlook, CIO Review, University Business, OpenSource, Linux Journal, and The Open Organization book series. Jim has also been interviewed and cited as an expert on IT Leadership and Technology Innovation for publications including The Forecast by Nutanix, Government CIO Outlook, University Business Magazine, and MinnPost. CLOSE ABOUT DEAN BOORMAN Account Manager of Strategic Accounts with H.B. Fuller, Owner of Minnesota Management Consulting, LLC and CFO of No Rush Hour Productions, LLC. 30 years in Project Program and Portfolio Management, MBA, PMP®, LSSGB, ITIL, and CSM®. ABOUT LISA BROWN Director Program Management at Surescripts with 30+ years of project, program, portfolio and PMO management across multiple industries and organizational sizes. A proven professional with a consistent track record of implementing solutions to address business, technical and strategic challenges within complex organizations. ABOUT RICK RIETOW Associate Partner at Project Consulting Group.  30+ years in Project, Program, Portfolio Management and leading PMOs.  Built, matured, or scaled PMO’s in 10+ companies from mid-size to fortune 100. MBA, PMP®, Lean Six Sigma MBB. ABOUT JOE PERZEL Sr. Portfolio Manager with Surescripts, owner of JPerzel Inc & CEO of No Rush Hour Productions, LLC. 40+ years in Project Program and Portfolio Management, PMP®. CLOSE ABOUT GEORGE S. HAWKINS, ESQ. George Hawkins launched his innovation-focused enterprises Moonshot Missions after stepping down as CEO of DC Water, where he served for eleven years.  George helps agencies identify and adopt strategies to deliver better service and lower cost. George transformed DC Water into an innovative enterprise while tripling its investment in clean water.  DC Water’s innovations ranged from Green Infrastructure to a $500 million investment in clean energy.  DC Water issued the first century bond, first environmental impact bond, and spearheaded programs to support low-income customers and provide for local workforce development. George serves on the National Infrastructure Advisory Council, which advises the White House.  George is an advisor to Xylem, Inc. and serves on the Board of the North American Electric Reliability Corporation.  George has served as a Senior Lecturer at Princeton University and an Executive in Residence for American University. Mr. Hawkins also served as Director of the DC Department of the Environment and served as Director of non-profit organizations and held positions with the USEPA and the firm Ropes & Gray. George is a popular speaker on water and environmental issues.  He has been the recipient of many awards, including the AWWA’s Fuller Award, Governing Magazine’s Public Official of the Year in 2015, WEF Public Official of the Year in 2016, and the Water Leader of the Year Prize in 2017.  DC Water was awarded the US Water Prize in 2016. He graduated from Princeton University (Summa Cum Laude) and from Harvard Law School (Cum Laude). CLOSE ABOUT DR. UMAIR SHAH Umair Shah, MD, MPH, was appointed Secretary of Health by Governor Jay Inslee on December 21, 2020. Prior to this, Dr. Shah served as Executive Director and Local Health Authority for Harris County Public Health (HCPH) – the nationally accredited county public health agency for the nation’s third largest county with 4.7 million people. Dr. Shah earned his BA (philosophy) from Vanderbilt University; his MD from the University of Toledo Health Science Center; and completed an Internal Medicine Residency, Primary Care/General Medicine Fellowship, and MPH (management), at the University of Texas Health Science Center. He also completed an international health policy internship at World Health Organization headquarters in Switzerland. Upon completing training, Dr. Shah began a distinguished career as an emergency department physician at Houston’s Michael DeBakey VA Medical Center. He started his formal public health journey as Chief Medical Officer at Galveston County’s Health District before joining HCPH to oversee its clinical health system and infectious disease portfolio. Under his leadership, HCPH has won numerous national awards including recognition as Local Health Department of the Year from the National Association of County and City Health Officials (NACCHO) in 2016. Dr. Shah currently holds numerous leadership positions with respected entities like the National Academies of Sciences, Engineering, and Medicine; U.S. Centers for Disease Control and Prevention; Trust for America’s Health; Network for Public Health Law; and Texas Medical Association. He previously served as president of NACCHO (and its Texas affiliate) representing the nation’s nearly 3,000 local health departments. Over his career, Dr. Shah has been a clinician, an innovator, an educator, and a leader in health. CLOSE Maurice Ashley made history in 1999 when he became the first African-American chess grandmaster. He is a three-time national championship coach, author of Chess for Success: Using an Old Game to Build New Strengths in Children and Teens , Chess commentator, iPhone app designer, puzzle inventor, and motivational speaker. Maurice is well known for providing dynamic live tournament coverage of world-class chess competitions and matches. His high-energy, unapologetic, and irreverent commentary combines Brooklyn street smarts with professional ESPN-style sports analysis. He has covered every class of elite event, including the World Chess Championships, the US Chess Championships, the Grand Chess Tour, and the legendary “man vs. machine” matches between Garry Kasparov and IBM’s Deep Blue. Traveling the world as an ardent spokesperson for the many character-building effects of chess, Maurice shares how chess principles and strategies can be applied to improve business practices and assist with personal growth. Maurice also acts as a master of ceremonies and inspirational speaker at business conferences and high-class chess events. Maurice has received multiple community service awards from city governments, universities, and community groups for his work. In recognition of his immense contribution to the game, he was inducted into the US Chess Hall of Fame in 2016 and the Brooklyn Technical High School Hall of Fame in 2018. CLOSE About Janel Anderson Dr. Janel Anderson is the founder of Working Conversations, LLC and holds a PhD in organizational communication from Purdue University where she wrote her dissertation on virtual teams 20 years ago.  Part professor, part coach, part comedian, she offers practical strategies that can be implemented immediately. Twitter: @janelanderson LinkedIn: https://www.linkedin.com/in/janelanderson CLOSE About Hayley Cohen Hayley Cohen is an Executive Security Advisor and Threat Gamification Engineer for IBM Security Command, and is based in Cambridge, Massachusetts. She leads companies, intelligence agencies and governments through simulated cyber-attacks, and builds one-of-a-kind scenarios for custom client experiences. Aside from sharing best practices from a business perspective, Hayley also demonstrates hacking techniques and tools to provide insight into how threat actors conduct attacks. Prior to joining IBM Security Command, Hayley was a software engineer for various IBM Security teams, where she worked with leading technologists to develop world class security products. Hayley holds a B.S. in Computer Science from the Tufts University School of Engineering and a Credential of Readiness from Harvard Business School Online. Hayley is currently pursuing an M.S in Cybersecurity Policy and Governance from Boston College. Hayley has run simulations and demonstrations for business and technical leaders around the world. Her recent engagements include FS-ISAC Americas Virtual Summit, IBM Security Master Skills Munich, Massachusetts Digital Government Summit and Minnesota Government IT Symposium. Twitter: @HayleyBCohen LinkedIn: https://www.linkedin.com/in/hayleybcohen CLOSE About John Nerge John Nerge is the GIS Coordinator for the City of Brooklyn Park. John works will all city departments, empowering their business decisions with spatial and data analysis, cartography, and storytelling. To achieve this, he uses human centered decision to fit the app to the audience, not the other way around. Twitter: @GISJohnMN LinkedIn: https://www.linkedin.com/in/johnnerge/ CLOSE About Thomas Fisher Thomas Fisher is professor, director of the Minnesota Design Center, and Dayton Hudson Chair in Urban Design in the College of Design at the University of Minnesota. Fisher served for 19 years as a dean at the University of Minnesota and became the director of the Minnesota Design Center in 2015. His research has focused on sustainable architecture, design ethics, and community-based service design. Recognized in 2005 as the fifth most published writer about architecture in the United States, Fisher has written 9 books, over 50 book chapters or introductions, and over 400 articles in professional journals and major publications. Named a top-25 design educator four times by Design Intelligence, he has lectured at 36 universities and over 150 professional and public meetings. He has written extensively about architectural design, practice, and ethics. His latest book, Designing our Way to a Better World (Minnesota) came out in 2016. CLOSE Mandy Froehlich passionately encourages educators to create innovative change in their classrooms. A former Director of Innovation and Technology, technology integrator, and teacher, she has experience at many levels of the organizational structure. Her interest lies in reinvigorating and re-engaging teachers back into their profession, as well as what’s needed to support teachers in their pursuit of innovative and divergent thinking and teaching. She consults internationally with school districts and post-secondary institutions in the effective use of technology to support great teaching, mental health support for educators, and how to create organizational change. Her first book, The Fire Within: Lessons from Defeat that have ignited a passion for learning, discusses mental health awareness for teachers. Her second book, Divergent EDU , is based on an organizational structure she developed to support teachers in innovative and divergent thinking. Her third book, Reignite the Flames , is based on educator engagement and mental health. And check out here newly released book, The Educator’s Matchbook , a weekly guide for educators looking to reignite their love of teaching. Close About Mark Lanterman Mark Lanterman is the Chief Technology Officer of Computer Forensic Services. Before entering the private sector, Mark was a member of the U.S. Secret Service Electronic Crimes Taskforce. Mark has 28 years of security and forensic experience and has testified in over 2000 cases. Mark is faculty for the Federal Judicial Center in Washington, D.C., the National Judicial College in Reno, Nevada, the University of Minnesota and the Mitchell Hamline Law School. Mark is a professor in the cybersecurity program at the St. Thomas School of Law in Minneapolis, Minnesota. Mark has provided training in digital evidence, computer forensics and cyber security to the United States Supreme Court. He has also presented to the 8th and 11th Circuit Federal Judicial Conferences as well as numerous State and Federal Judicial Conferences across the United States. Mark completed his postgrad studies in cybersecurity at Harvard University and is certified as a Seized Computer Evidence Recovery Specialist (SCERS) by the Department of Homeland Security. Mark is a member of the Minnesota Lawyers Professional Responsibility Board and serves as Chairman of its Opinions Committee. CLOSE About Angela Maldonado In her role as Partner, Angela oversees work in 3 states and leads the leadership development practices team for TNTP. In her role, she works with state departments, philanthropic organizations and foundations, CMOs and districts on a range of work that includes leadership development, talent diversification, access to high quality academics and implementation, and authentic community engagement.  In her work at TNTP Angela has led principal preparation programs in Philadelphia and Kansas City and supported districts in designing comprehensive talent management and human capital strategies. Prior to her work at TNTP, she supported district staff and principals in Prince George’s County with the implementation of a new teacher evaluation system. Prior to her work there, she joined education as a Teach For America corps member in Philadelphia, where she taught middle school English in the district, leading her students to significant gains on city wide tests. During this time, she was featured on NBC’s Education Nation as an exemplary model of teaching. Following her teaching experience, Angela joined Teach For America staff as a Manager of Teacher Leadership Development, coaching first and second year teachers throughout Philadelphia, reaching more than 2000 students via the teachers she coached. In 2015, Angela was named to Forbes 30 Under 30 list of influential educators. Angela completed her Bachelor of Science in Finance at Penn State University and holds a Masters from the University of Pennsylvania Graduate School of Education. CLOSE About Brian Johnson Brian Johnson is the president of 7 Minute Security, which specializes in security assessments, penetration testing and training. He is especially passionate about teaching others about security and hosts a weekly podcast to help consumers and businesses strengthen their security posture. When he isn’t camped out behind a keyboard, he enjoys outdoor activities with his family, as well as singing and playing guitar in an acoustic duo. CLOSE About Lynette Crane Lynette Crane, corporate trainer, coach, international speaker, and author, has had 40 years of experience in helping people address stress under many different challenging circumstances, including economic chaos and natural disasters as well as personal crises. She was a pioneer in 1978 when she created the first college course on The Psychology of Stress, then went on to do organizational training for such institutions as Pacific Bell Telephone Company (during their divestiture from AT&T), San Francisco Veterans’ Affairs, San Francisco Airport, and more.  Her training has additionally impacted companies such as Hewlett Packard, Target, and a hot of others over her 40 years of experience. Recognizing the old stress management techniques were not delivering what was needed in the modern era, she turned to latest in neuroscience and quantum physics to create a unique scientifically-validated program in which participants can gain the tools to deal successfully with the losses and disruptions of our pandemic by learning, easily and quickly, how to prepare for, recover from and adapt in the face of adversity. CLOSE Seen on The Ellen Show and NBC Nightly News, educator, speaker, and author Michael Bonner is an energizing voice in education. Michael has presented to more than 200 education conferences, school district meetings and leadership development audiences across the U.S. & Canada to share his “lessons learned” from teaching in a Title I school with children that experience high levels of trauma and adverse situations. Mr. Bonner’s candid, enthusiastic seminars challenge listeners to create diverse, inclusive education plans “where students can see themselves within the lessons and assessments” as a means to increase student success rates. He empowers his audiences to build genuine relationships with their students because “you can’t demand a withdrawal from someone you have never invested in.” Administrators and educators alike leave Mr. Bonner’s presence ready to make an impact that affects eternity. He is consistently seen as a visionary leader who strives to create a positive mindset among all of his students. His students come to class each day with diverse backgrounds, strengths, needs, and challenges. Therefore, he identifies strategies to ensure their growth socially, emotionally, academically, and psychologically. Due to his educational approach, students leave more hopeful, challenged, inspired, and forever a part of Bonnerville. Today, Mr. Bonner lives in Atlanta, Ga. where he is beginning a new educational journey as a fourth and sixth grade English teacher at the famed Ron Clark Academy! Close Glen has been in education for over 20 years and he currently works as an instructional coach in Sauk Rapids, Minnesota. Glen was previously a Spanish teacher. Glen is well known by the Schoology community as a Gamification expert, Schoology Ambassador, and he was the 2016-2017 Schoology Educator of the Year. He is the co-host of OnEducation Podcast whose goal is to have honest conversations about teachers, teaching and everything in between. CLOSE Co-convener Stratis Health is proud to provide continuing medical education credit for physicians and advanced practice professionals for the MN HIMSS and Minnesota e-Health Initiative Conference, through their CME accreditation by the Minnesota Medical Association. Physician Continuing Medical Education (CME) AMA PRA Category 1 Credit™ This activity has been planned and implemented in accordance with the Essential Areas and Policies of the Minnesota Medical Association (MMA) through the joint sponsorship of Stratis Health and the MN HIMSS and Minnesota e-Health Initiative Conference. Stratis Health is accredited by the MMA to provide continuing medical education for physicians. Stratis Health designates this activity for 7 AMA PRA Category 1 Credits™. Physicians should only claim credit commensurate with the extent of their participation in the activity. CME certificates will be emailed after completion of these steps: An online evaluation survey will be emailed after the conference. Complete the survey, indicate only those keynotes/sessions you attended. Electronically sign and submit the survey. A CME certificate will be emailed to you from Stratis Health. Speaker and Planning Committee Disclosure: To comply with MMA Standards for Commercial Support, Stratis Health requires presenters to disclose the existence of any significant financial interest or other relationships with companies whose products or services are related to the subject matter of the presentation. Each presenter will submit a signed disclosure form prior to the conference. No presenter or planning committee member involved with the MN HIMSS and Minnesota e-Health Initiative Conference will have a financial relationship that could be perceived as a real or apparent conflict of interest in the context of their presentation; nor will any speaker discuss research or unlabeled uses of commercial products. Continuing Education and Contact Hours for Nurses The University of Minnesota School of Nursing, Office of Practice, Partnerships and Professional Development, is accredited as a provider of continuing nursing education by the American Nurses Credentialing Center’s Commission on Accreditation. The MN HIMSS and Minnesota e-Health Initiative Conference is designed to meet the Minnesota Board of Nursing requirements for continuing education. It is the responsibility of the individual nurse to determine if the course fulfills that requirement. Continuing Education Credits and Contact Hours for Other Health Professionals The MN HIMSS and Minnesota e-Health Initiative Conference may meet continuing education requirements for your focus. Attendees will receive a certificate of attendance following completion of a post-conference online evaluation survey. It is the responsibility of the individual to determine if the course fulfills that requirement. CLOSE Amanda VanDerHeyden, Ph.D., is a private consultant and researcher who has directed and evaluated numerous school-wide intervention and reform efforts. Amanda is founder of Spring Math (www.springmath.com), a web-based comprehensive mathematics RtI system covering numeracy to algebra, which is widely used in the U.S. and has shown strong gains in math achievement. Her work has been featured on “Education News Parents Can Use” on PBS and The Learning Channel. Dr. VanDerHeyden has held faculty positions at Louisiana State University Health Sciences Center and University of California at Santa Barbara. She is President of Education Research & Consulting, Inc. in Fairhope. Dr. VanDerHeyden serves as scientific advisor to TIES and the Center on Innovations in Learning. She has served as a guest or standing panel member for NIH, IES at the U.S. Department of Education and on numerous boards including the RTI Advisory Board for the National Center for Learning Disabilities and SEDL, one of 10 regional laboratories funded by the U.S. Department of Education since merged with the American Institutes for Research). Dr. VanDerHeyden has published more than 100 scholarly articles and chapters, 7 books, and has given keynote addresses to state school psychology associations and state departments of education in 32 states and Singapore. She is co- author of the Evidence-Based Mathematics Innovation Configuration for the National Comprehensive Center for Teacher Quality at Vanderbilt University and now the Collaboration for Effective Education Development, Accountability, and Reform at University of Florida. Her most recent book (Kovaleski, VanDerHeyden, & Shapiro—The RTI Approach to Evaluating Learning Disabilities) was featured at a forum for policymakers hosted by the National Center for Learning Disabilities as a best-practice guide for identifying and serving children with Learning Disabilities in October of 2013 in New York, NY. She actively conducts research focused on improving learning outcomes for students and her scholarly work has been recognized in the form of article of the year awards in 2007 from Journal of School Psychology and 2016 from Journal of Learning Disabilities Research & Practice, the Lightner Witmer Early Career Contributions Award from Division 16 (School Psychology) of the American Psychological Association, and her 2012 induction into the 150-member Society for the Study of School Psychology. Amanda believes that most academic failure is preventable and that all children can learn when provided with the right instruction. Close Ruth Lynfield is State Epidemiologist and Medical Director at Minnesota Dept of Health. She joined MDH as a medical epidemiologist in 1997. She has investigated and responded to outbreaks, developed surveillance systems, and conducted public health research, evaluation and planning. She has served on a number of federal advisory committees including the National Vaccine Advisory Committee, the FDA Vaccine and Related Biological Products Advisory Committee and chairs the CDC Board of Scientific Counselors for the Deputy Director for Infectious Diseases. She is an Adjunct Professor of Medicine and of Epidemiology and Community Health at the University of Minnesota. Close Elissa Hansen, President & CEC at Northspan Elissa Hansen invests her time creatively advancing others’ capabilities. Recently, she has facilitated strategic planning processes for numerous public, private, and nonprofit organizations in the Upper Midwest. She also spearheaded the creation of the Minnesota Opportunity Collaborative and has worked to expand and enhance Northspan’s programs. She leads Northspan with over 20 years of experience in business and economic development across Minnesota and Wisconsin. Karl Schuettler, Research Director & Consultant at Northspan Karl Schuettler manages the Northland Connection program, provides support services to local communities, and researches and analyzes economic trends. In the past year, Karl’s work has included numerous economic analyses, reports on business visit programs, and staffing support for several regional partnerships. He holds a bachelor’s degree from Georgetown University and a master’s degree in urban and regional planning from the University of Minnesota. Terri Thao Terri Thao is passionate about building power with community. She is currently a program director at Nexus Community Partners, a non-profit community building intermediary where she runs the Boards and Commissions Leadership Institute (BCLI). Terri has spent most of her professional career in the fields of community economic development, community building, leadership development, and philanthropy. She also teaches classes on leadership and advocacy at Metropolitan State University. She serves on the boards of the F.R. Bigelow Foundation, Minnesota Housing and Voices for Racial Justice. She obtained her Bachelors’ and Masters’ degrees from the University of Minnesota. She lives with her family on the East Side of St. Paul and loves to read in her spare time. Dannielle Lewis Dannielle Lewis is a senior manager in the tax practice, focused on serving clients in the construction and real estate industry. She leads Wipfli’s team of Qualified Opportunity Zone specialists and is a frequent speaker on this topic. She also advises clients on complex tax transactions involving partnership interest exchanges or business sales. Dannielle stays up to date on the ever-changing tax laws and recognizes opportunities for new and potential clients to help save and structure their funds. She leverages her proactive planning and advising to ensure clients reach their goals and are successful. CLOSE Seventeen. That’s how many years Jana has worked as a journalist for KARE 11 news here in Minneapolis – it is also the same amount of time she has spent wondering if she could ever really be that much needed addition to the now defunct Destiny’s Child.   But she’s for sure gonna name her first child, Destiny, just to get remotely close to that brand. Other tidbits.  She is from a town you’ve never heard of but it’s a 40 minute drive from St. Louis.  She once sold her ten year anniversary gift from KARE 11 to an ex so she could buy a pair of Air Jordan’s. Jana graduated from the University of Missouri-Columbia a very long time ago and had it not been for a persistent journalism professor would have spent her adult life driving the Wienermobile. Jana has won 6 regional Emmy awards. You can see Jana weeknights on Breaking The News, KARE 11, at 6:30 pm. Close Research Scientist Jacob seeks to strengthen communities’ resilience by promoting the use of data and careful analysis. At Wilder, he generates and curates content for the Minnesota Compass website and manages a portfolio of related research projects. He brings experience in research, geospatial analysis, writing, and outreach from previous positions at the Federal Reserve Bank of Minneapolis, the Center for Urban and Regional Affairs, and the Institute for Agriculture and Trade Policy, among others. He holds a master’s degree in urban and regional planning from the Hubert H. Humphrey School of Public Affairs at the University of Minnesota and a bachelor’s degree in English from James Madison University in Virginia. Outside of work, he enjoys bicycling around the Twin Cities and getting lost in the woods as he forages for mushrooms. In his opinion, a perfect day would somehow combine the two. CLOSE Kathlene Campbell is the Dean of Education at the University of St. Thomas where she oversees the departments of educational leadership, special education, and teacher education as well as the charter school authorizing unit. Dr. Campbell’s multifaceted experience as a classroom teacher, community college and state college professor, state college interim dean, university instructor and supervisor, and non-profit consultant have shaped all of her strategic and scholarly pursuits. She holds a B.A. in Elementary Education and M.Ed. in Early Childhood Intervention and Family Studies from the University of North Carolina at Chapel Hill, and a Ph.D. in Curriculum and Instruction from The University of Texas at Austin. Close Michael Baran, PhD is a Senior Partner and Digital Solutions Lead at inQUEST Consulting. He has been working with organizations for almost 20 years, helping support their diversity, equity, and inclusion efforts. By training, he has a doctorate in cultural anthropology and cognitive psychology, studying questions like: how do we all develop unconscious biases? And what are the subtle ways that cultures include some people and exclude others? Michael has taught courses at Harvard University and the University of Michigan. He has lead projects aiming to reduce racial disparities in education, health, housing, and criminal justice at the FrameWorks Institute and at the American Institutes of Research. He is also the coauthor of the recently launched book Subtle Acts of Exclusion: How to Understand, Identify, and Stop Microaggressions, cited in Forbes as one of the “11 Books To Read If You Want To Be A More Inclusive Leader.” Close Andy Zimney is a Principal Advisor and Team Performance Coach at Employe Strategies, Inc.—a boutique firm in Minneapolis that partners with leaders to create highly effective work cultures. He has two decades of experience in the conference room as an organizational executive and on the stage as a profession improviser. Andy has lead learning seminars and coached teams from a wide variety of industries across the country to help them adapt to change and support more innovative cultures. Andy spends the rest of his time with his wife and 3 fantastic children in St. Paul, MN. Close Jessica O. Matthews is the Founder & CEO of Uncharted Power, an award-winning, full-service power and data infrastructure company. The Company’s proprietary suite of technologies enables it to build, own and operate decentralized power infrastructure for communities with various applications for edge colocation, power, and sensing. Developing technologies in energy generation, transmission and storage, the Company also has mastered harnessing kinetic energy, enabling it to engineer consumer products for Fortune 500 companies in the U.S. and various international governments. The Company was founded by Jessica when she was only 22 years old. Jessica was invited by President Barack Obama to the White House to represent small companies for the signing of the America Invents Act in 2012. In 2016, she raised the second-largest Series A ever raised by a black female founder in history and was selected to ring the NASDAQ opening ceremony bell, representing all Forbes 30 Under 30 alumna. Jessica’s research and career centers around the intersection of disruptive technology, renewable energy, human behavior, and the psychology of self-actualization. A dual citizen of Nigeria & the U.S., Jessica has a degree in Psychology and Economics from Harvard University, an MBA from Harvard Business School, and is listed on over 10 patents and patents pending—including her first invention of the SOCCKET, an energy generating soccer ball, at the age of 19. Her list of accolades includes Fortune’s Most Promising Women Entrepreneurs, Forbes 30 under 30 list, Inc Magazine 30 under 30, and Harvard University Scientist of the Year. Close Minnesota State Demographer Susan Brower is the Minnesota State Demographer and directs the MN State Demographic Center. Susan became the State Demographer in February 2012. In that capacity, she travels the state talking with Minnesotans about the new social and economic realities that are brought about by recent demographic shifts. Susan’s work applies an understanding of demographic trends to changes in a range of areas including the state’s economy and workforce, education, health, immigration and rural population changes. Susan joined the State Demographic Center after working as a researcher on the Minnesota Compass project at Wilder Research in St. Paul. Prior to that, she worked at the Population Studies Center at the University of Michigan. Susan earned her Ph.D. in sociology at the University of Michigan, specializing in demography and family sociology. She also holds a master’s degree in public policy from Humphrey School of Public Affairs at the University of Minnesota. For media or other inquiries, please contact Susan at susan.brower@state.mn.us (preferred) or 651-201-2472. Download a high resolution photo of Susan . Note: If you would like Susan to present at an event, please email her with your request. CLOSE Kori Land, Attorney at LeVander, Gillen & Miller, P.A. Korine Land is a shareholder at LeVander, Gillen & Miller, located in South St. Paul, Minnesota. She is the City Attorney for the cities of West St. Paul, Stillwater, Cottage Grove, Randolph and Hampton. Ms. Land is the Chair of her Firm’s Municipal Practice Group, a past president of the Minnesota City Attorneys’ Association and a frequent speaker for the League of Minnesota Cities on various municipal matters. She graduated from Augustana University and Mitchell-Hamline College of Law. CLOSE Molly Just, Senior Planner at WSB Molly has nearly 20 years of experience in local and regional government, as well as in the private sector. While her experience includes long-range planning and current planning, Molly finds planning nirvana when helping to solve problems.  She finds that the answers are often hiding in plain sight – in the zoning ordinance or comprehensive plan.  Molly’s planning career started in the Washington, DC area, then moved to Maine, and finally to Minnesota in 2015; attracted by the evident quality of life.  Molly lives in Minneapolis with her husband, son, and pets.  In her free time, Molly is always trying to carve out time to walk the lakes with her dog or strengthen her yoga practice. CLOSE Erin Perdu, Director of Community Planning & Economic Development at WSB Erin Perdu, AICP, is the Community Planning and Economic Development Director for WSB in Minneapolis. She has been a practicing planner for over 20 years, working primarily in the upper-Midwest and Texas. Her career spans both the public and private sectors, including a 12-year stint at the helm of the consulting firm she founded, ENP & Associates. Erin’s passions include long-range planning, community engagement, and bringing national best practices to communities of all sizes. She holds a Bachelor of Science from Stanford University (Earth Systems) and Master of Science (Natural Resources) and Master of Urban Planning degrees from the University of Michigan. CLOSE Mike Couri, Attorney at Couri & Ruppe, P.L.L.P. Michael C. Couri is a partner with Couri & Ruppe. Mr. Couri received his Bachelor of Science degree in accounting from Illinois State University in 1985. He then received his Certified Public Accountant certificate and Juris Doctorate from the University of Illinois in 1988. He was admitted to the Illinois Bar in 1988 and the Minnesota Bar in 1991. Mr. Couri has been continuously engaged in the practice of Municipal Law in Minnesota since 1991. He has been the City Attorney for the City of Albertville since 1992, the City of St. Augusta since 2000, and the City of Rockford since 2002. He has also represented a number of Townships since his entry into the practice of Municipal Law in 1991. Mr. Couri has attended City and Township sponsored continuing legal education seminars annually since 1991 and has periodically spoken on Municipal issues before City and Township organizations. CLOSE Phil Carlson, Associate at Stantec Phil Carlson has practiced as a planning consultant in the region for more than forty years, assisting dozens of cities with comprehensive plans, neighborhood studies, urban design guidelines, zoning codes, and planning advice. He has designed residential, commercial, industrial, and mixed use developments, and wrote one of the first form-based codes in Minnesota. He has taught planning and zoning to city staff and leaders for over thirty years and is frequently called as an expert witness in land use and zoning cases. CLOSE Senior Demographer Megan Dayton is a Senior Demographer at Minnesota’s State Demographic Center. Since 2012, she has been responsible for preparing demographic projections for the State of Minnesota, 13 Economic Development Regions, and 87 counties. Serving in this role, Megan is Minnesota’s state representative to the Federal-State Cooperative Program for Population Projections (FSCPP) with the U.S. Census Bureau. Megan’s work involves the creation of school district estimates upon request for intercensal levy cycle funding and providing data analysis for state agencies, councils, and legislators. Megan’s research interests include improving upon existing data modeling techniques used for state and sub-state areas, as well as social stratification and more general demographic trends related to fertility, mortality, and migration patterns. Megan has hands-on knowledge of social and economic realities brought about by recent demographic shifts. Her work engages an attentive approach to relating current demographic trends with the resulting likelihoods. Megan holds a master’s degree in applied demography from the Center for Demography and Population Health at the Florida State University. Contact Megan at megan.dayton@state.mn.us (preferred) or 651-201-2461. Download a high resolution photo of Megan . Note: If you would like Megan to present at an event, please email her with your request. CLOSE COVID-19 and the Transforming Learning Summit The Transforming Learning Summit is proceeding with safety as a top priority. Our planning committee closely follows the CDC guidelines, local and state public health authorities and US State Department/Federal Government rules related to the COVID-19 virus.  We recognize the situation is fluid and changing daily. We’ve instituted the following policy that only applies to COVID-19 related cancellations: » 100% of attendee and sponsor/exhibitor registration fees will be refunded if a company has instituted travel restrictions for its employees that is effective during the dates of the Summit, and an attendee or sponsor/exhibitor cannot attend the event. Cancellation must be communicated by email to gts@fusionlp.org accompanied by the company proof of policy. Refunds will not be issued for cancellations before July 15, 2020. » 100% of registration fees will be refunded if cancellation of the event is mandated by local health authorities GTS Educational Events is actively exploring Digital Conferencing tools and the potential benefits that sponsors and exhibitors would receive, in the event that the in-person event is canceled. We will ensure sponsors and exhibitors receive comparable or even enhanced benefits associated with a captive digital audience. We welcome your ideas and input. CLOSE COVID-19 and the Government IT Symposium The Government IT Symposium is proceeding with safety as a top priority. Our planning closely follows the CDC guidelines, local and state public health authorities and US State Department/Federal Government rules related to the COVID-19 virus.  We recognize the situation is fluid and changing daily. We’ve instituted the following policy that only applies to COVID-19 related cancellations: » 100% of attendee and sponsor/exhibitor registration fees will be refunded if a company has instituted travel restrictions for its employees that is effective during the dates of the Conference, and an attendee or sponsor/exhibitor cannot attend the event. Cancellation must be communicated by email to gts@fusionlp.org after November 16, 2020, accompanied by the company proof of policy. Refunds will not be issued for cancellations before November 16, 2020. » 100% of registration fees will be refunded if cancellation of the event is mandated by local health authorities GTS Educational Events is actively exploring Digital Conferencing tools and the potential benefits that sponsors and exhibitors would receive, in the event that the in-person event is canceled. We will ensure sponsors and exhibitors receive comparable or even enhanced benefits associated with a captive digital audience. We welcome your ideas and input. CLOSE Madhulika Gaur, Business and Quality Analysis Supervisor for Minnesota IT services at Minnesota Management and Budget (MMB), has over fifteen years of experience in multiple aspects of critical software systems and custom applications, including experience in automation, Functional, performance testing. Madhulika currently manages Business Analysts team and QA teams working on variety of Functional, Accessibility, automation and performance testing efforts. Close Darin Richardson is the Claims Manager of the League of Minnesota Cities Insurance Trust (LMCIT), working in this capacity since January 2014. Darin currently oversees both the property casualty and the workers’ compensation claims staff at the LMCIT. Prior to becoming the Claims Manager, Darin spent twenty-three years as a property casualty claims professional dedicated to the LMCIT while working for Berkley Risk Administrators and GAB. Close B. J. is the Risk and Homeland Security Manager for Dakota County.  B.J. is responsible for the oversite of several programs at the County including: health and safety, insurance and claims, continuity of operations planning, emergency management and implementation of enterprise risk management.  Dakota County began actively pursuing cyber insurance coverage in 2018.  The County has leveraged its relationship with AIG insurance to help develop a comprehensive framework to mitigate, respond and recover from cyber security events. Close Ryan Donovan has been in the insurance industry for 15+ years as a commercial P&C, Group Health, and Life insurance producer.  In his current role, Ryan serves as the Manager of the Insurance and Risk Management department for Sourcewell. Close Annie is a broker in Aon’s Professional Risk Solutions Team located in Chicago, and has been with Aon since 2012.  She works with organizations across all industries and sizes in assessing Errors & Omissions, Network Security and Privacy, and Media Risks. Close Sean Sweeney is Senior Director & Chief Security Advisor, Americas, in Microsoft’s Cybersecurity Solutions Group.  In this role, he is primarily responsible for aligning and mobilizing his team of Cybersecurity Advisors and Architects across the U.S., Canada, and Latin America to deliver thought leadership and deep customer engagement.  He is also responsible for regularly engaging with the security industry through public speaking, standards development, and advanced research, as well as providing strategic direction on products and services, and advising customer CxOs on security and compliance issues. Prior to joining Microsoft, Sean served as a Chief Information Security Officer of the University of Pittsburgh, principal and co-founder of a Pittsburgh-based eDiscovery startup, Chief Information Officer for a national law firm based in Pittsburgh, and Litigation Support Applications Manager for the U.S. Department of Justice in Washington, D.C. A frequent author and speaker on security and compliance, Sean is also a steadfast champion of cybersecurity workforce development.  Originally from Northern Virginia, and an avid boater; Sean has resided in Pittsburgh, PA for the last 13 years. Close John Israel currently manages the State of Minnesota’s Security Operations Center (SOC) and Enterprise Forensics teams overseeing the state’s efforts to improve cybersecurity monitoring, incident detection, and incident investigations. This role includes building and maintaining key cyber resources related to security monitoring and cybersecurity analysis for Minnesota government – including direct roles partnering with the Minnesota Secretary of State, Minnesota Fusion Center, and Minnesota county IT teams. Close Robert Biestman is the Department of Homeland Security (DHS) Cyber Mission Center Sector Outreach Lead. His role is to build customer relationships with critical infrastructure cyber leaders with the goal of securing the nation’s critical infrastructure by furthering DHS’ understanding of cyber activity targeting U.S. critical infrastructure and delivering valuable intelligence back to sectors so they can better defend against cyber threats facing the Homeland. Mr. Biestman provides cyber leaders a direct contact into the intelligence community and facilitates information sharing, joint analysis partnerships, and in-depth cyber threat briefings. Prior to his role as Sector Outreach Lead, he worked as a financial sector technical cyber threat analyst for the DHS Cyber Mission Center, and in addition has worked as a homeland security legislative advisor for the U.S. House of Representatives. Mr. Biestman graduated from the University of California, Santa Barbara with a degree in Business Economics and received his Master’s Degree in Cyber Leadership from National Defense University’s College of Information and Cyberspace. Close David Maeda is the Director of Elections for the Minnesota Secretary of State’s Office. David’s team interfaces directly with election officials in every Minnesota county. Close Terry is a Senior Engineer with Collier IT where he works to ensure clients are successful with database, big data, and cloud initiatives.  Terry has 30 years of software development and implementation experience as a developer, architect, support, and sales team member. He brings extensive experience in enterprise software design, development, consulting, training, and sales with both government and commercial clients.  Prior to joining Collier IT, Terry was a Solution Architect at Cloudera and a Principal Systems Engineer at Oracle. Close Scott is a Director of Product Management for GraalVM at Oracle.  He has over 25 years experience in the industry as a developer and product manager. Scott joined Oracle in 2003 as a developer and was one of the architects of SecureFiles in the Oracle Database. In 2011, Scott joined the Oracle Solaris Kernel team as an engineering manager and took over product management for Oracle Solaris in 2013. Scott has been working with the GraalVM team for the last 2+ years. Close Brian is the Chief Technology Officer at Collier IT. He has over 36 years in the Information Technology field starting in the US Navy in 1981. Although proficient in many technologies his passion has been in the Operating Environment, Engineered Systems, Data Center grade servers, Big Data/Hadoop, and storage, and now Cloud Computing and the associated MSP aspects. He has been teaching for Sun Microsystems / Oracle since 2000. Brian actively writes a blog and provides formal presentations on various Oracle and related technology topics. @Snatchbrain Brian presents at a number of technology gatherings and is currently focused in Cloud connectivity, Docker in the Cloud, Hadoop, and Data Analytics in the Cloud. Brian is an Oracle Ace Director for Engineered Systems / Solaris and was recently awarded the 2018 Oracle Excellence Award: Leadership in Infrastructure Transformation. Close Jason Moldan is a Solutions Architect with Amazon Web Services where he works to ensure customers are successful on their cloud journey. Jason has over 20 years if IT experience and prior to joining Amazon, he was the Technical Architect for the University of St. Thomas where he developed and led the universities cloud initiative. Close Tarek Tomes Commissioner and Chief Information Officer Tarek Tomes serves as the Commissioner of Minnesota IT Services (MNIT) and the State of Minnesota’s Chief Information Officer (CIO), leading state efforts to provide the best possible IT solutions and customer service to the people of Minnesota and our business partners. As a recognized industry leader, Tomes brings over 25 years of experience in managing technology innovation across diverse industries, both in national, international, and public and private sector operations. Throughout his career, he has facilitated data-driven decision making, implemented many critical enterprise projects, and improved workforce diversity and inclusion. Before becoming Commissioner, Tomes served as the Chief Innovation Officer and former Chief Information Officer at the City of St. Paul, where he was responsible for managing ongoing process improvements, supporting human-centered design, and increasing the overall effectiveness of city services and resources. While in St. Paul, Tomes facilitated a digital transformation at the city level, pioneering the use of mobile applications to improve resident opportunities. This work allowed the city to leverage deep data insights while promoting and supporting equitable service delivery. During his time as St. Paul’s Chief Information Officer, Tomes oversaw the launch of St. Paul’s Open Information Portal, which serves to promote and encourage innovative uses of data and transparency in government services. Tomes’ prior work experience also includes six years as an Assistant Commissioner of Minnesota IT Services, where he created several nation-leading Information Technology sourcing agreements for 33,000+ user utility services statewide – including the first cloud-based public sector statewide service offering in the nation. While Tomes was serving in this role, Minnesota became the first state in the country to manage all Information Technology through service level agreements, a model that was recognized with a national award. Before joining state service, Tomes spent 13 years working for British Telecom. Tomes received his Bachelor’s degree from the University of Maryland and attended Graduate School for Business Management at Boston University. Close Mark Lanterman is the Chief Technology Officer of Computer Forensic Services. Mark is a current member of the U.S. Secret Service Electronic Crimes Taskforce. Mark has 28 years of security and forensic experience and has testified in over 2000 cases. He is faculty at the University of Minnesota, the University of St. Thomas School of Law, Mitchell Hamline Law School, the National Judicial College in Reno, Nevada and the Federal Judicial Center in Washington, DC. Mark is a member of the Minnesota Lawyers Professional Responsibility Board. Mark provides regular commentary on national print and broadcast media. Close As MNIT’s Strategic Planning Director Kirsten brings together stakeholders from across the executive branch to develop, implement, and evaluate MNIT’s strategic plan. She engages with breadth and depth in her work so that stakeholders – from senior leadership to customers to front line staff – have an opportunity to shape the agency’s path. She has Master’s degrees in Public Health and Public Policy and has a background in program evaluation. Close Coming Soon! Close Dan works with the DHS commissioner team and other senior leaders to coordinate an agency-wide approach to strategic planning, leadership development, change management, and organizational effectiveness. He earned a Master’s in Human Resource and Change Leadership (concentration in Organization Development) and a Doctor of Education in Leadership (concentration in Public Policy) from the University of St. Thomas. Close Duy Nguyen – Quality Assurance Analyst for Minnesota IT Services at Minnesota Management and Budget (MMB). He performs accessibility testing with manual and assistive technology tools to ensure that MMB’s digital systems are usable by people with or without disabilities and that the Minnesota accessibility standards are maintained. Close Mike Mahurin is an experienced Security Solutions architect at ConvergeOne. He has been in the information technology field for 20 years with 18 of those focused-on enterprise information security for the government, manufacturing, and financial services sectors. He currently supports advanced security consulting services across the United State with ConvergeOne. Close Washington County Information Technology Collaboration and Data Integration Manager. I have a Degree in Computer Science from Augustana University, Sioux Falls, SD. I started my career as a developer for private business. My husband and I moved to Stillwater and I was hired by Washington County as a data processing coordinator. I transitioned into application development and business analyst for several years, then a Senior Lead. I have been in the IT Manager role for the Collaboration and Data Integration Division for the last 10 years. Close Earl Carter has always had a passion for solving puzzles and understanding how things operate. Mr Carter quickly learned that identifying security weaknesses is just like solving puzzles. Over 20 years ago, he was introduced to network security when he accepted a position at the Airforce Information Warfare center in San Antonio, Texas. In 1998, Mr Carter starting working Cisco and became one of the founding members on the Security Technology Assessment Team (STAT). After spending 15 years identifying new security threats and assisting product teams in hardening their devices and software to mitigate those identified security threats, Mr Carter became a Threat Researcher for Cisco Talos. Now he spends his time hunting for new threats against live customer networks by examining various intelligence feeds and data sources. Among Mr Carter’s significant contributions to Cisco are multiple security patents and authoring three Cisco Press Security Books. Close Dan is a co-founder of Lifescale Analytics. As the Chief Insight Officer, he oversees all aspects of delivering services and results for clients. Dan began his career in application development and has managed and directed development organizations consisting of up to 100 people. He has 27 years of IT leadership and consulting experience and has implemented successful IT practices in data security, business intelligence, data architecture, agile IT management and enterprise architecture. Dan’s experience with implementing strategic technology spans a variety of vertical segments including the life sciences, insurance, banking, database marketing, mortgage and medical industries. Dan has served in technology leadership positions with UNUM Life, Carlson Companies, Wells Fargo and GMAC-RFC and he has provided strategic IT consulting services to many notable organizations including The Federal Reserve Bank, Syngenta Seeds, National Marrow Donor Program/Be The Match, Bayer CropScience and Duke Clinical Research Institute. Dan earned a bachelor’s degree in geographic information systems from the University of Minnesota and a master’s degree in geography and computer science from the University of Iowa. Close Mike Beddow is the IBM Hybrid Cloud and Analytics Solutions Leader for the Public Sector and Healthcare industries. Mike graduated from Lehigh University with a dual major in Computer Science Engineering and Business. He has technical experience solving complex business challenges leveraging a variety of IBM and open source solutions. Mike focuses on advising clients at various stages of their cloud and AI journey. Close Jacob seeks to improve community vitality by promoting the use of data and community indicators to better understand trends in different quality-of-life measures. At Wilder, he generates and curates content for the Minnesota Compass website and manages a portfolio of related research projects. He brings experience in research, geospatial analysis, writing, and outreach from previous positions at the Federal Reserve Bank of Minneapolis, the Center for Urban and Regional Affairs, and the Institute for Agriculture and Trade Policy, among others. He holds a master’s degree in urban and regional planning from the Hubert H. Humphrey School of Public Affairs at the University of Minnesota and a bachelor’s degree in English from James Madison University in Virginia. Outside of work, he enjoys bicycling around the Twin Cities and getting lost in the woods as he forages for mushrooms. In his opinion, a perfect day would somehow combine the two. Jacob is also a contributor to the Minnesota Compass blog: Close Ellen serves as a research scientist for Minnesota Compass where she tracks indicators for the project which provides community-level trends for Minnesota residents. Ellen analyzes community-level data trends by working collaboratively with Minnesota organizations to identify data indicators that are relevant to their everyday work. Before joining Wilder Research, Ellen worked for the University of Iowa’s Center for Evaluation and Assessment and University of Minnesota’s Office of Community Engagement for Health conducting research and evaluation related to education, health, and social services. She has worked with community-based organizations, state and local government, and higher education institutions for the past 15 years to develop indicators that support informed decision-making. Ellen holds dual master’s degrees in public health and public policy from the University of Washington and a bachelor’s degree in English from Grinnell College. Ellen enjoys cooking for her family, visiting the mountains in her native home of Montana, and reading a good book. Close Shawn Kammerud is the Chief Information Security Officer \\ IT Director at Minnesota IT Services partnering with Minnesota Department of Health. He is a nationally recognized healthcare technology leader that is a catalyst for security while knowing how to balance usability. Kammerud has a MHA, B.S. in Healthcare Administration and Management with an Information Technology specialization from Colorado State University and an associate’s degree in computer science from WITC New Richmond. Close Joseph Pugh is an Operations and Development Systems Supervisor with MNIT partnering with Minnesota Department of Health. He has over 25 years of IT experience in development and his career includes mainframe, client server, fat client servlets and now “the cloud”. His perspective and experience aligns with a significant number of development and operational government staff that will be tasked with this important transition. Joseph has a Bachelor of Science in Mathematics and Statistics from Miami University in Oxford Ohio. Close Brenda Gabriel Paul the Director of IT Projects and Applications for MNIT partnering with the Minnesota Department of Health. Brenda has over 25 years of IT experience; she has seen many infrastructure and application development changes throughout her career. Brenda is a Certified Information Systems Security Professional (CISSP) holding Masters of Science in Information Technology, Assurance and Security from Capella University, and a BA in Finance and Computer Science from College of St. Catherine. Brenda Gabriel Paul the Director of IT Projects and Applications for MNIT partnering with the Minnesota Department of Health. Brenda has over 25 years of IT experience; she has seen many infrastructure and application development changes throughout her career. Brenda is a Certified Information Systems Security Professional (CISSP) holding Masters of Science in Information Technology, Assurance and Security from Capella University, and a BA in Finance and Computer Science from College of St. Catherine. Close Andrew Will-Holmberg is the Cloud Operations Supervisor at Minnesota IT Services partnering with the Minnesota Department of Health. He has over a decade of public and private Cloud experience. Prior to joining MNIT, he was a business owner and Director of Operations overseeing teams responsible for Cloud operations for clients ranging from tech startups to Fortune 100 companies. Close Gail Toussaint , CBAP, has a wealth of experience as a Business Analysis over many years in both public and private sector organizations. Gail attained IIBA Certified Business Analyst Professional (CBAP) certification in 2008. She served four years on the IIBA Board of Directors for the Minneapolis/St. Paul chapter Close Mel is the Chief Information Officer at the League of Minnesota Cities where she oversees the League’s internal technology services and assists Minnesota cities with their technology initiatives. Prior to the League, Mel worked in technology leadership roles in both municipal and county government. Close Ken is the statewide Disability Programs Coordinator for MnDOT. He has expertise in applying the American’s with Disabilities Act, with emphasis in the application of Employment-related activities, including access to digital content. Ken is blind and uses a screen reader. Close Jennie Delisi is the Accessibility Analyst in the State of Minnesota’s Office of Accessibility. She is an invited expert on the W3C’s Cognitive and Learning Disabilities Accessibility Task Force, a Certified Professional in Web Accessibility (CPWA), and member of the International Association of Accessibility Professionals’ Competencies Development and Recommendation Committee.io. Close Peter has been helping government agencies securely accomplish their missions with a focus on mitigating cyberthreats for over 30 years. Peter helps the broader IT community understand the very latest cyber capabilities and risk mitigation methods to effectively address cyber threats. His has a unique combination of a technical background and a passion to clearly convey high-tech topics to audiences of all levels. He works with NIST and the National Cybersecurity Center of Excellence (NCCoE) and has contributed their 1800-Series Special Publications. With a degree in Mechanical Engineering from Duke University, Peter has held leadership positions at Hewlett-Packard, AT&T and Panasonic. Close Andy Zimney is a Senior Culture and Advisor and Team Performance Coach at Employee Strategies, Inc.—a boutique firm in Minneapolis that partners with leaders to create highly effective work cultures. For more than 20 years, Andy has lead learning seminars and coached teams from a wide variety of industries, including government agencies, all over the country to help them create more productive, innovative, and meaningful work. Close David Andrews has over 39 years of experience working in the assistive technology, web accessibility and access to information fields. He is Chief Technology officer of Minnesota State Services for the Blind where he has worked for the past 25 years. In this position he supervises SSB’s Engineering Unit, and works on a variety of accessibility and technology-related issues with SSB and DEED staff as well as other state agencies and SSB partners. He was a part of the group of people who worked together on web and software accessibility issues, whose work ultimately led to the passage of accessibility legislation in Minnesota in 2009. While at SSB he has also directed its Communication Center and Assistive Technology Unit. Prior to coming to Minnesota he worked for the National Federation of the Blind, NFB, as the first Director of the International Braille and Technology Center. The IBTC is the world’s largest demonstration and evaluation center for assistive technology used by blind persons. Andrews continues to work for the NFB as a contractor, administering a system that supports over 350 Internet Mailing Lists, and over 40 web sites used by NFB Affiliates, Chapters, and Divisions throughout the country. Andrews has a Master’s Degree in Broadcast Management and has also worked for a variety of radio reading services and telephone-accessed dial-up newspaper reading services. Close Ken is an experienced security and audit professional with a strong understanding of complex computing environments, security frameworks, legislative and regulatory requirements and accepted practices with security solutions. Having presented to state, regional and national workshops, and conferences; Ken offers a highly rated presentation style. A founding member and past President of Western Wisconsin InfraGard Chapter, past President of ISSA-Milwaukee (International Systems Security Association), past President and founding member of ISSA-Madison, past chairman MATC Milwaukee Security Specialist Curriculum Advisory Committee, past member of Herzing University’s Department of Homeland Security Degree Program, ISACA (Information Systems Audit and Control Association) and member Western Wisconsin Association of Computer Crime Investigators (WWACCI). Ken has security information published in several books and trade magazines. As Director IT Services for FIPCO® a subsidiary of the Wisconsin Bankers Association; Ken has coordinated and performed information security/IT Audits and risk assessments in over 100 financial institutions in the past few years. If you’d like to contact Ken, he can be reached via email at; kshaurette@fipco.com. Close Renee Heinbuch , Currently the Washington County Information Technology Director for the past 2.5 years with 25 years of Information Technology experience in the private sector including the following companies, Blue Cross Blue Shield of MN, US Bank, Land O’Lakes and 3M. She is participating on the Governor’s Blue Ribbon Committee and chairing the Cybersecurity sub-committee. Close David has worked on technology solutions for social programs for over 12 years, and is currently the Lead Offering Manager for the IBM Social Program Management Platform. In this role, David seeks to understand the needs of organizations managing Health and Human Services programs, and translate those requirements into generic, reusable software components for the Platform that can help deliver improved outcomes for vulnerable populations worldwide. Close A specialized quality assurance analyst who uses WCAG 2.0 guidelines to create test cases’ expectations. Using QA best practices and assistive technology tools, she executes accessibility tests, reports violations, retests, and ensures our assistive technology end users can successfully access and use State products. Close EAQAT’s automation engineer whose talents created the Assistive Technology Tool (AST) that produces a system-generated report showing scanned screenshots of each page with violations, explanation of the WCAG 2.0 guidelines that weren’t met, and possible resolutions that assist the technical team. Close Damien is a Sr. Solutions Architect for Public Sector at Red Hat. Worked as lead developer, dev manager and enterprise architect in public and private sectors for 20 years. Having worked on projects from desktop-based widgets to major multi-tiered applications with web API’s, he developed an acumen for application architecture. Current focus is on Containerization; Data Center Modernization & The road to DevOps. Presenting the Evolution of IT and progression to Containerization. Close Varsha Chetlur is the Social Program Data and Analytics Offering Manager for Government Health and Human Services with IBM Watson Health. Varsha focuses on developing analytics that help social program agencies meet their reporting needs. She enjoys working with clients, understanding market needs and developing innovative offerings addressing client challenges. Close Phillip Yeich is the Director, Emerging Solutions for the Office of the CTO at ConvergeOne. For the past 18 years, Phillip has been involved with innovation in the Software arena in the Financial Services, Pharmaceutical, Federal & State Government and Business Intelligence industries on behalf of numerous Fortune 500 companies. Phillip has specialized in validating ideas & concepts through the software lifecycle to realize full monetization. Today, Phillip is responsible for driving ConvergeOne intellectual property Software Solutions to market ensuring customer satisfaction and providing an exceptional customer experience. Phillip holds a B.A. from the University of Texas San Antonio, and a MBA from Bellevue University, Omaha Nebraska. Close Mikki Desque is the Strategic Survey & Evaluation Coordinator for the Minnesota Department of Human Services. Previously, Mikki spent 14 years managing the Metropolitan State University psychology lab and, prior to that, supervised the Wilder Research survey center. She is also an experienced data analyst, database administrator and project manager. Close Karen leads the developers and support specialists that deliver Teams, SharePoint, Forms, Power BI, and other collaboration/productivity tools within Office 365. Her team develops the processes and management practices necessary to keep Office 365 running smoothly for over 35,000 users. Close Jill leads the Customer Service Management (CSM) area of MNIT Enterprise Services. CSM includes business relationship management, service portfolio management and Experience IT. The focus of CSM is to ensure MNIT services meet the IT needs of the state agencies, boards and commissions we serve. Jill has been with the State of MN for 20 years this year, starting with the Department of Human Services prior to joining the MNIT Team. Close Ted is an Application Architect for MNIT Services. At work he participates in and leads teams that implement enterprise-level IT solutions, services, and platforms. Outside work he coaches Ultimate Frisbee, walks, rides, juggles, travels, reads, and helps with his sons’ Boy Scout Troop. Close Wendy and a small group of colleagues at the Department of Human Services were the first among the Minnesota executive branch to implement SharePoint when it was released to market in 2001. Over the years Wendy has maintained a direct connection with SharePoint and passion for enabling collaboration and transforming the way people work. Today Wendy leads the MNIT Enterprise O365 teams responsible for developing, deploying, and supporting tools like SharePoint and Teams. Close Irene is the intergovernmental relations counsel at the League of Minnesota Cities, where she advocates on behalf of cities at the state Legislature and serves as legal counsel for the lobbying department. Close Jennifer is the Director of Government Relations at Ramsey County where her responsibilities include leading staff and working with external partners to develop and advance Ramsey’s legislative platforms at the state and federal level. Close Susie Crowell is a Business Analyst with MNIT partnering with the Department of Employment and Economic Development on the Workforce One application. Prior to working at MNIT, she was a consultant in the public and private sectors for over 20 years. Close Jenkins Nelsen is an internationally recognized diversity consultant, trainer, planner, researcher, lecturer. Co-president, the Diversity Institute, Inc.; adjunct professor, consultant for Luther Seminary. Corporate clients include UnitedHealth Group, The St. Paul Companies, The Federal Reserve Bank, The Mayo Clinic and Children’s Hospitals. She is co-founder, INTER-RACE, a diversity think tank at Augsburg College. Close Corey Blommel has 20 years of IT experience that stretches across several fields. Currently, Corey is a security instructor at Anoka Ramsey Community College, and manages the Cybersecurity, Computer Networking and Computer Science academic programs. Corey is also a community faculty member at Metropolitan State University, and an instructor at the MNCyber Cyber Range. Corey holds a Bachelors degree in IT management from Concordia University and Masters degrees in MIS from Metropolitan State University. When not teaching, Corey continues to work as an IT consultant. Close Karie is a HueLife Facilitator and Trainer. Previously, she was the Director for Allies for Substance Abuse Prevention Coalition (A.S.A.P.). While at A.S.A.P., she facilitated a countywide coalition of volunteers to assess, plan, and implement environmental strategies to change the culture around underage drug and alcohol abuse. By using the action planning and accelerated action planning methods, Karie led the coalition to successfully pass ordinances and policies that have created sustainability in their efforts. Close Stephanie is the Chief Operating Officer (COO), consultant, facilitator and trainer at HueLife, an organizational development and facilitation company that focuses on Human Understanding and Engagement as a strategy for change. She is dedicated to helping organizations align activities with mission and values, strengthen processes and increase engagement by building a culture of innovation, equity and empowerment. Her unique ability to motivate and inspire groups through participatory processes consistently delivers great results. She has 20 plus years of leadership experience in local government as well as experience and expertise working with for profit and nonprofit organizations. She specializes in leadership and organizational development, change and project management, and strategic planning. Stephanie is a Technology of Participation (ToP®) Certified Facilitator and Mentor Trainer. She has a baccalaureate degree in Psychology and Social Work from Pacific Lutheran University in Tacoma Washington and a Master’s degree in Public Administration from Hamline University in St. Paul Minnesota. Close Robert partners with Public Sector entities across the US to provide thought leadership and market leading expertise in addition to conducting keynote presentations, strategy workshops and consulting engagements along with driving programmatic initiatives across business and technology domains. Close Kris leads the Experience IT program where she works to improve user experience for 35,000 state employees. Prior to this, as Innovation Analyst for MNIT’s Innovation Program and Tech Connections Initiative Manager for the Minnesota Department of Transportation, she helped drive IT innovation to foster collaboration and greater productivity. Close Shawn Riley was born to a broken and abusive home. Shawn overcame the challenges of his youth and adopted a growth mindset and “we can make the world a better place” attitude.  At the age of 16 he started a technology company. Later in his career he entered the private sector and worked as a thought leader for companies like IBM and the Mayo Clinic. His career has included massive change and transformation initiatives spanning multi billion-dollar organizations. In 2017 Shawn was appointed by Governor Doug Burgum to lead the state of North Dakota’s technology services as the Chief Information Officer. He is always looking to connect with others who have a “we can change the world” attitude as he strives to be a servant leader and improve lives, empower people, and inspire success. Close Brad Morse has 10 years’ experience working in State government, and is currently the Program Manager at MN. DLI overseeing the delivery of the Workers’ Compensation Moderation Project. Before this role, Brad was the Deputy Director of the Workers’ Compensation division at the UT. Labor Commission, where he oversaw the implementation of the departments EDI claims reporting system, and online waiver application program. Close Ravi Subramaniam is the U.S. Public Markets Leader for Blockchain at IBM. In his role, he shares information about IBM’s Blockchain offerings and solutions with customers and prospects and consults with clients on their Blockchain solution requirements. In a long and distinguished technology consulting career of more than 20 years, he has worked with clients on both their technology strategy planning and roadmap requirements as well as large Business transformation implementation projects. Close Kristina’s deep expertise in both hospitality management and operations lends a unique human-centered and service-oriented perspective to her consulting and design work with clients in healthcare, financial services, manufacturing, and government. She is passionate about delivering the experience her clients expect and want, and helps them do the same for their customers. In addition to her role at Azul Seven, Kristina serves as an industry consultant at the University of Minnesota College of Design. Close Rohit Saxena currently supervises IT staff of the Environmental Health (EH) division at MDH to ensure service delivery meets the needs of the division. Recently, Rohit oversaw his team in migrating applications to the cloud. He is part of the architecture team in developing EH’s cloud based architecture applications. Close Bree Basham has 20 years in the brand and marketing space at agencies large and small in Charlotte, New York, and Los Angeles. As Creative Director of CapTech’s CX group, her team is focused on driving strategic approaches for enterprise-level business, brand, and marketing objectives. Her team of UI and UX designers create customer-centered products that bridge physical and digital experiences, making the journey through a product or service as seamless as possible. Close Jacquelynn Mol Sletten is a Financial Aid Administrator with the Minnesota Office of Higher Education. Jacquelynn administers the Dual Training Grant along with several other financial aid programs. She received her graduate degree from Bethel University and has nearly 10 years of experience in working with financial aid. Close JoAnn is a lead web accessibility tester and trainer with MN.IT Services. She has over twenty years of experience working on government IT projects. JoAnn is a recipient of the 2015 Project Opportunity Award and a member of the WorkForce One Rewrite team that received the 2015 NASCIO – Information Communications Technology Innovations Award. Close Lea Dooley , MNIT Services. Lea Dooley is the digital accessibility coordinator from the User Experience Design Team at the Minnesota IT Services Partnering with Human Services and MNsure. Lea is a Certified Professional in Accessibility Core Competencies (CPACC). Close Lolly Lijewski is the digital accessibility coordinator at the Minnesota Department of Human Services. She has over thirty-nine years of experience in advocacy, accessibility, and service delivery on behalf of the disability community. She is a certified JAWS tester of hundreds of documents, web sites and applications for digital accessibility and usability design. She developed and teaches a JAWS Screen Reader course and has been a screen reader user for more than 43 years. Close Kristy Dalton is the CEO of Government Social Media LLC and executive director of the Government Social Media Organization. She has been called on as an industry influencer and her unique background includes serving as a delegate at a NATO social media summit in Sarajevo, advising government agencies on digital strategy and delivering keynotes on social media and tech innovation all across the United States. Kristy has authored several social media courses for the LinkedIn Learning platform and pens a regular social media column in Government Technology Magazine. She founded the nation’s first social media conference for U.S. city, county and state agencies, the Government Social Media Conference. Close Coming Soon. Close Chris Dancy is touted as “the Most Connected Man on Earth,” and the world is watching those connections carefully. For 25 years, Dancy has served in leadership within the technology and healthcare industries, specializing in the intersection of the two. Chris entered the public dialog concerning digital health as the media started to focus on wearable technology. He earned his moniker by utilizing up to 700 sensors, devices, applications, and services to track, analyze, and optimize his life–from his calorie intake to his spiritual well-being. This quantification enables him to see the connections of otherwise invisible data, resulting in dramatic upgrades to his health, productivity, and quality of life. A noted keynote speaker and executive workshop retreat facilitator, Chris guides organizations and audiences on a journey–a disruptive, breathtaking journey–into the future of computing, when behavior becomes the ultimate interface. As a author his digital wellness journey will transform how we look at the technology of our lives. Close Jim Hall is an innovative, high-achieving Senior IT Leader with over twenty years’ experience in IT Leadership. Jim believes in developing the next generation of IT Leadership, to help IT organizations better respond to the changing technology landscape. After serving more than eight years as Chief Information Officer in government and higher education, Jim founded IT Mentor Group to provide coaching, advising, and mentoring to CIOs and IT Directors, Leadership Development training to emerging IT Leaders, and Essential Management training to new managers and supervisors. Jim is a featured speaker on IT Leadership and Technology Innovation at conferences and venues including Government IT Symposium, SINC Midwest IT Forum, International Institute of Business Analysis, Premier CIO Forum, Minnesota e-Learning Summit, CIC CIO TechForum, and UBTech. Jim is a published author on IT Leadership, and has written Coaching Buttons, a collection of essays about leadership and vision in information technology: how to be a leader, how to lead through change, how to do strategic planning. Jim has also contributed chapters to several professionally published books on IT Leadership, including The Open Organization Leaders Manual (2nd Ed.), The Open Organization Workbook, and Cultivating Change. Jim regularly contributes feature articles about IT Leadership and Technology Innovation in magazines and journals including Government CIO Outlook, CIO Review, University Business, and The Open Organization. Jim has also been interviewed as an expert on IT Leadership and Technology Innovation for publications including University Business Magazine, and MinnPost. Jim has a master’s degree in Scientific and Technical Communication from the University of Minnesota, and a bachelor’s degree in Physics from the University of Wisconsin-River Falls. Close Richard Matson-Daley has spent his career at the intersection of mission and technology, with approximately 15 years of experience in the nonprofit, higher education and government technology sectors.He is a stronger believer in collaboration, conversation and participatory leadership, and draws from a number of frameworks in his work, including the Art of Hosting and Harvesting Conversations that Matter and Human Centered Design. Close Abby is a Principal at Azul Seven, where she works closely with nonprofit, healthcare, financial services, education, and government clients to understand business challenges, uncover user needs, guide strategy, and achieve strong, successful outcomes. She serves as a trusted advocate for Azul Seven’s clients and a champion for the power of human-centered design to influence lasting change. Close A born public speaker and trainer, Kit Welchlin began public speaking at the age of 9 in 4-H. By 16, he was organizing and facilitating presentations on leadership, citizenship, community service and motivation for the 4-H and Future Farmers of America. Kit Welchlin purchased his first manufacturing company at age 21, and by 26 was CEO and Chairman of the Board of three manufacturing companies in three states. He’s been an instructor with the Minnesota State Colleges and Universities, where he has been repeatedly nominated Outstanding Faculty. He is a Professional Member of the National Speakers Association. Kit has a B.S. Degree in Speech Communication, Business Administration and Political Science. He earned an M.A. Degree in Speech Communication and Business Administration. In 2014, Kit was inducted into the Minnesota Speakers Association Hall of Fame. He has delivered more than 3,000 speeches and seminars to more than 500,000 people over the past 26 years. Close Prior to its acquisition by ConvergeOne, Craig worked for AOS for 10 years as a Design Architect and Systems Consultant in Omaha, NE. As a Design Architect, Craig meets with clients to understand the business needs for technology (such as SD-WAN, Security, etc), create topology designs, PowerPoint proposals, and Statements of Work for professional services teams to implement the solution. He supports multiple accounts throughout Nebraska, Iowa, and the Dakotas and covers technology solutions including Route/Switch, Security, Wireless, Data Center, and Unified Communications. Close Desi Klimesh is an e-RYT 1500+ hours (experienced, registered yoga teacher). Desi has shared with, and educated others about the practice, and benefits of yoga, on the mat, and off of the yoga mat. Residing in Roseau, MN, Desi welcomes all, to her Yoga Tree Yoga Studio, believing yoga is for everybody, and is for every BODY. Desi’s 20 years of teaching and educating others about the practice of yoga include, kids yoga, adults, pre-natal yoga, chair yoga, mindfulness, and meditation. Desi shares the yoga practice locally as well as internationally, leading Women’s Circles of Yoga and Self Discovery in Ubud, Bali. Close Jay is Minnesota’s first Chief Information Accessibility Officer, or CIAO. He leads the Office of Accessibility which works with Minnesota state agencies to develop policies and implement processes and best practices that helps ensure that digital government operations and services are accessible and usable for all. Close Jennifer Wells , State Bridge Inspection Engineer, Minnesota Department of Transportation – Bridge Office has been an engineer with MnDOT for the past 18 years, the last 13 in fracture critical bridge inspection and 5 years in bridge design and bridge standards. Jennifer has a BSCE from Michigan Tech University and an MSCE from the University of Minnesota. She is a licensed civil engineer, NBIS Team Leader, FAA Certified Small Unmanned Aircraft System pilot, and lead investigator on MnDOT drone research for bridges. The MnDOT Bridge Office Inspection Unit is responsible for managing the Minnesota bridge inspection program and conducting fracture critical inspections statewide on both the state and local system. Close Kim Wee is the Digital Accessibility Coordinator and Webmaster for Minnesota IT Services partnering with Education and is a Certified Professional in Web Accessibility (CPWA). She has over 20 years of web experience in design, development, and administration with a focus on web accessibility. Close As Executive Director, National Workforce Solutions, Sue Wallace is responsible for Creating IT Futures’ adult workforce program including program enhancements, expansion to new markets and overseeing ongoing operations nationally. Ms. Wallace started her professional career in the IT industry and moved on to spend nearly 14 years in nonprofit workforce development before joining Creating IT Futures. She holds both a bachelor’s and a master’s degrees from Ball State University. Close John Sundberg is the founder of Kinetic Data and architect of Kinetic solutions. He spent time in enterprise IT across large multinational and fortune 500 and government organizations prior to founding Kinetic Data. He has been a leader of hundreds of projects with extensive work in improving systems architecture for complex, distributed systems. John’s passion is in improving the world by building distributed, maintainable, and high performing systems to provide business agility. He is married, has four kids and lives in Minnesota. Close Alison Slaats has worked in the GIS field for over 20 years in the government, private, non-profit and academic sectors. She currently works at the Minnesota Geospatial Information Office (MnGeo) as a project portfolio manager. Close Damani Short is a seasoned and highly sought-after business and technology leader. Damani founded Lexico – a Transformation Services Consultancy – after recognizing a gap in technology and broader transformation initiative planning approaches that effectively enable and drive mid-market companies’ improved economic sustainability and growth. As a GE Lean/Six Sigma Master Blackbelt, Damani’s distinguished change leadership track record underpins an innovative strategy and roadmapping approach resulting in differentiated business outcomes. Damani’s vast experience in technology leadership, including information security and compliance, global leadership, general management/P&L ownership, and overall company growth strategy development (most recently a 38% CAGR) has placed him in global leadership roles for some of the most iconic brands, including GE, Newell Rubbermaid, United States Olympic Committee, Johnson Controls, and Shutterfly. For the past 20 years, he’s held a variety of CIO, CTO, and Compliance Officer roles for companies ranging from $40M to $45B n annual revenue. Close Enterprise Data Architect and Sr. Data Governance for the State of Minnesota’ MNIT Services. She has over 25 years of experience in leadership roles in public and private sector. Currently working with National Governors Association (NGA), 7 other states on cross-sector data sharing initiative to inform policy https://www.govtech.com/analytics/NGA-Initiative-Could-Enable-Data-Sharing-On-Policy-Between-Agencies.html. She works with technology and business leaders in Data Governance and Data Management, including, data security and privacy, integration, analytics, and data migration strategies. Ellena has also implemented data governance and data stewardship programs and processes throughout her career. She has delivered on large projects and received several leadership awards. Ellena previously presented work at IT Government Symposiums, Digital Summit, and she has contributed to several white papers published by National Chief Information Officers (NASCIO). Close Andrew Schmitt is an Information Security professional with a passion for Incident Response and Digital Forensics. Currently, Schmitt is a member of the Cyber Security Incident Response Team (CSIRT) at Medtronic where he focuses on hunt teaming and tier 3 incident response. Additionally, Schmitt is an adjunct professor at Metropolitan State University where he has authored and taught classes in Network Protocols and Analysis, Cyber Incident Response, and Penetration Testing. Schmitt holds a Master’s of Science from the University of Minnesota and currently holds multiple certifications including GCIH and GCFA. Outside of teaching, Schmitt spends time working on the open source project, Power-Response, and he coaches the Metro State Collegiate Cyber Defense Competition team. Close Stevie Peterson, CCMP, PMP, CBAP, PMI-ACP, CSM, PMI-PBA, LSSGB, IIBA-AAC, ITIL® v2 Manager with a mark of Distinction, ITIL® v3 Expert Stevie Peterson is a consultant, trainer, and speaker with over 25 years’ experience specializing in the areas of organizational change, program leadership, business analysis, process design/improvement, service management (ITIL®), and Agile. Close Jerine has more than 20 years in public sector, with a primary focus on business relationships and project management for IT projects; many security and grant-funded. As the Principal IS Liaison for Ramsey County, Jerine focuses on bringing the business and technology staff together to find agreeable resolutions. Jerine is a certified Project Manager and Black Belt in Six Sigma, so process is at the forefront of her thoughts, and a Public Participation Facilitator, guiding many contentious discussions. Previously, Jerine worked at the Port of San Diego as Senior Manager, Policy & Planning. Close Karen Ray is a recognized authority in building and sustaining collaborative ventures. Her experiences in the 1970’s as executive director of literacy-focused agency mandated to collaborate by state and federal funders led to seminal research in collaboration. She has combined this collaborative experience with her training expertise to problem-solve with agencies involved in joint ventures. She has earned a reputation for group facilitation that results in decisions, highly interactive training sessions, and effective consultation for collaborations. Karen has help to found dozens of collaborations and consulted with hundreds of others across the United States during the last 28 years. Karen’s most recent book , “The Nimble Collaboration,” is an award-winning collection of wisdom and best practices based on years of consultation with collaborations in many sectors in many states. Karen Ray co-authored the book “Collaboration, Creating, Sustaining and Enjoying the Journey” in 1995. This award-winning handbook guides non-profit staff through partnership ventures. She has taught teambuilding and leadership courses in the College of St. Catherine Master’s program in Organization Leadership and Ethics, and undergraduate courses for Metropolitan State University. She holds a Masters degree in Applied Behavioral Sciences from Whitworth College, Spokane, Washington with a specialty in organization and human development. Karen is a certified consultant in Whole Systems Technology. Check out Karen’s web site on collaboration at KarenRayCollaboration.com Close Danwood (Woody) Rasmussen is an Integration Architect working for MNIT at the Dept of Human Services. Responsibilities include reviewing and implementing service bus patterns to share information between internal/external systems. Prior to this he worked at IBM as an Application Architect responsible for the Entitlements and Management system as well as web services to share business partner data with other IBM applications. Close Joe Perzel has been leading projects of all sizes and managing staffs since 1982 in both a corporate and vendor capacity. He has a background in including government, non-profit, K12 and higher education, healthcare, insurance, finance, audit and compliance. Presently Joe is Partner JPerzel Inc. as well as Program Manager at Surescripts LLC. He has also held leadership positions at Cargill, MN Workers Compensation Insurers Agency, Thomson Reuters and International Multifoods. Joe has been presenting since 2002 on topics ranging from project management, leadership, strategy, negotiations/sales. Most recently he has been the keynote at the Manitoba PMI PDD, Central Arkansas PDD, Rochester CTC Leadership conference, as well as presented to PMI-MN, PMI International, PMI (Atlanta, Delaware Valley, Dallas, Heartland, MileHigh, Silver Springs), IIBA, MN State Symposium, St Cloud State University and the University of St Thomas. Close George F. Paulik has a Ph.D. in Mathematics and a Masters in Electrical Engineering and over 20 years of work experience at IBM in chip design and circuit technology. He currently works as a logic designer at IBM in Rochester, MN and is an IBM Q Ambassador. Close Dan Oehmke , Director, Enterprise Service Desk, MN.IT Services Dan Oehmke is Director of MNIT’s Enterprise Service Desk and leads ITIL / ITSM initiatives in support of 45,000 end-users. With almost 40 years public service in the United State Army and at the State of Minnesota, Dan has also has taught graduate level operations management courses at St. Mary’s University. Dan’s credentials include accredited ITIL instructor, ITIL Expert, Distinguished Professional in Service Management, and ISO / IEC 20000 Consultant/Manager. Dan is a past president of the National Association of State Technology Directors and holds Master of Business Administration from the University of St. Thomas. Close John Nerge is the GIS Coordinator for the City of Brooklyn Park. He uses modern, human-centered design to build and publish engaging and intuitive public GIS apps. A big part of that is knowing how to work with people and build relationships. In his spare time, he enjoys cooking, reading, and martial arts. Close Co-author of The Art of Convening: Authentic Engagement in Meetings, Gatherings, and Conversations; Art of Convening© Certified Convening Leader Patricia works at the intersection of individual and organizational change, where she collaborates with individuals, teams and organizations organizations to increase their positive impact in the world in a way that feels inspired and alive. She does this through lovingly curated, high-impact experiences; workshops, retreats, and courses; and speaking. Patricia’s focus is inspiring CPL’s growth through program development and execution of CPL’s signature programs: The Art of Convening Trainings, The Art of Purpose Trainings, Collaborative Leadership model and toolkit, and consulting and coaching programs. All CPL programs are dedicated to creating a world that works for all. Through her experience she found a passion for convening with those of all ages but her interests flourished in working with organizations and companies around her. With 25+ years of working with entrepreneurial start-ups and community organizing, Patricia has had a broad experience in convening, marketing and organizational operations. Patricia held positions at Telemedia Communications, successfully launching two national magazines, Garden Way Mfg. Inc, and DeepRock Mfg. Patricia, co-author of The Art of Convening: Authentic Engagement in Meetings, Gatherings and Conversations, has coached and prepared executives for the Thought Leader Gatherings and Transformational Leaders Collaboratory for 16 years. Patricia is trained in and utilizes a variety of convening, facilitation and community management methods. These include The Art of Convening Practicum Trainings and Certifications, Six Initiatives of Transformation, Coaching for ROI, C-IQ Conversational Intelligence for Coaches, True North Groups Institute, Twin Cities Rise Personal Empowerment Facilitator Training, World Café, ToP Core Competencies, Open Space, and Presencing/Theory U. Patricia believes in the value of giving back to the community and serving as a leader to all around her. Patricia is co-founder of the Conscious Business Alliance and serves as a Founding Board member, now an Advisory Council member of Honoring Women Worldwide, served as a Founding Board member of Women’s Congress for Future Generations Conferences and the Positive Coaching Alliance MN Chapter. She is a continuing active member of the National Association of Professional Women and National Coalition of Dialogue and Deliberation. She has also been an instrumental influence in the development and progression of three Waldorf Schools. In Patricia’s free time she enjoys being the mother of three children, grandmother of three amazing human beings, reading and competing as a sprint triathlete. The YWCA Sprint Triathlon for Women is an annual goal–this is year 7! Close Denise Moreland has spent most of her career working in state and county government, managing IT. She is a defender of public service, a champion for democratizing the workplace and a shameless optimist. In her book, Management Culture: Innovative & Bold Strategies to Engage Employees (Two Harbors Press, 2012), Ms. Moreland challenges leaders and employees to abandon the culture of command and control in favor of democracy and collaboration. Having worked in the public sector, Ms. Moreland understands the pressure and frustrations, as well as the rewards and opportunities presented in public service. Close Michael Sable is a graduate of Augsburg (BA) and the University of St. Thomas (MBA) and brings 20 years of local government management experience. He’s currently an adjunct faculty member at the University of Virginia, Weldon Cooper Center for Public Service, and managing partner for the consulting firm The Work of Leadership. Michael consults for the local governments across the country helping them proactively respond to the changing demands of the 21st century. Prior to starting the firm, Sable worked for Hennepin County, managing a department staff of 270 with a combined operating and capital budget of $180m. He’s also worked for the cities of Brooklyn Park (pop. 78,000) and Cedar Rapids, IA (pop. 125,000) as the Assistant City Manager, including serving as Interim City Manager for Brooklyn Park in 2015. Sable currently serves on the board of directors for the Alliance for Innovation, a member-based organization promoting innovation in local government nationally, GTS Educational Events, providing training and event services to local governments in the region, and an advisor to the Drucker Institute Public Sector Playbook at Claremont Graduate College. Close Charlie has +17 years experience working in technology. Finding himself consistently working in that space right between technology and business (and now district and government) leadership. Charlie has worked with agile methodologies for the past 7 years at both fortune 50, 500 and now in government organizations. Close Charlyne Lefebvre-Paillé is a French Canadian design research lead at IBM Watson Health. She has a Master’s degree in service design from the Royal College of Art in London. Based in Cambridge, MA, she leads design research across the Government sector, engaging with government agencies and the people they serve around the globe, translating their needs into actionable insights for her teams. Close"
    },
    {
      "url": "https://www.fusionsportsevents.com/about-us",
      "text": "About Us — Fusion Sports | Youth Soccer & Futsal Tournaments, Showcases, and Events 0 Skip to Content HOME ABOUT US EVENTS THE DERBY THE OPEN PARTNERS CONTACT US Open Menu Close Menu HOME ABOUT US EVENTS THE DERBY THE OPEN PARTNERS CONTACT US Open Menu Close Menu HOME ABOUT US Folder: EVENTS Back THE DERBY THE OPEN PARTNERS CONTACT US Elevating the Game, Inspiring the Next Generation. We’re setting a new standard in youth soccer — one built on elite competition, unforgettable experiences, and a vision for long-term impact across the country Learn More About Us Our Mission Fusion Sports exists to deliver the highest-quality youth soccer events in the nation. We aim to inspire players, coaches, and families through competitive excellence, premium event execution, and a culture that puts passion, integrity, and community at the forefront. What We Believe At Fusion Sports, we believe youth sports are more than games — they’re defining moments. We believe in the power of competition to build confidence, in the value of structure to shape discipline, and in the importance of opportunity for every young athlete to rise, shine, and succeed. Our events are designed to inspire players, unite communities, and raise the bar across the youth soccer landscape Our Commitment We are committed to delivering first-class soccer experiences that are professionally run, intensely competitive, and deeply rewarding for players, coaches, and families. From our national tournaments to local showcases, we obsess over every detail to ensure teams leave better than they arrived — on the field and beyond. We’re here to grow the game and fuel the next generation of champions. Our Vision We envision a future where youth soccer is defined by excellence, opportunity, and community. Fusion Sports is not just creating tournaments; we’re crafting experiences that shape players' futures, elevate coaching standards, and inspire the next generation to dream bigger. Our goal is to be the driving force behind a movement that transforms youth sports into a platform for both personal and athletic growth, on a national scale Join the Movement. Build the Future. Whether you're a team, player, coach, brand, or supporter — there's a place for you at Fusion Sports. Be part of a fast-growing platform that champions excellence and creates lasting impact. Contact Us Elite Youth Soccer Events. National Reach. Local Impact. Contact Info: info@fusionsportsventures.com Scottdale, Arizona Copyright © 2025 Fusion Sports. All rights reserved. Privacy Policy | Terms of Use"
    },
    {
      "url": "https://www.thefusionteam.com",
      "text": "Fusion | Staffing top of page REQUEST A PROPOSAL ELEVATE YOUR EXPERIENTIAL MARKETING REIMAGINE THE EXPERIENCE No matter how clever your marketing materials are, meaningful connections require face-to-face interaction with your brand at an event. The people you choose to represent your organization are critical to your success. ​ So, why is hiring talent often the last step in experiential marketing? IMAGINE A STRATEGIC PARTNER WITH YOU FROM THE BEGINNING WHO DELIVERS: The right strategy The right people The right message Let’s create experiences that convert your customers and deliver a measurable return on your investment. The right outcome SOLUTIONS Ready to elevate your customers’ experiences with your brand at experiential events, retail activations and tradeshows? Struggling to move your customers down the sales pipeline? Launching a new product and need to create a memorable activation? IMPACTFUL EXPERIENTIAL STAFFING Create a memorable impact on the consumer using branded experiences with knowledgeable talent to inspire your target audience to share your product or service with their friends both online and off. RETAIL ADVOCACY Make a meaningful impression by interacting with target consumers inside a retail location. Retail Advocacy brings your organization and a retailer closer while effectively communicating the right message for your brand. ASSISTED SELLING Engage consumers on the floor using brand champions to answer questions about your products and services. Whether manning your brand’s product displays or overseeing product demos, assisted selling is a tried-and-true tactic to drive sales. TRADESHOW LEAD GENERATION Capitalize on your exposure to decision makers. Studies show that 81% of trade show attendees have buying authority. You need the right  convention models and trade show talent to present your product or service and generate leads at every show. REQUEST A PROPOSAL YOUR FUSION EXPERIENCE Your FUSION Strategist walks you through our proven process to achieve your goals. Discover Your Goals. Starting with the end in mind, your goals drive our experts to allocate the right people and resources to your project. Amplify Your Voice. Capturing the key messaging is essential to telling and retelling your story well so that every touch point is a powerful experience for your customer Place the Right People to Drive the Right Results. Your brand is unique and so is your message. We tailor our talent for an optimal fit so both your brand and message are delivered naturally and powerfully. Deliver with Excellence. Achieving your goals is the number one priority. You benefit from proactive communication throughout the program to ensure our talent is delivering. Receive Meaningful Data. Understanding what’s happening on the ground is critical to course correcting for success. You gain insight from customized reporting with the metrics that matter most. What Clients Say About Working with FUSION “I'm extraordinarily impressed. Your staff are terrific and doing a great job - appreciate the work you're doing!\" \"I think this was one of the best collective groups I've ever worked with. They were all very outgoing and professional. With their help, we were able to collect over 3,000 surveys which exceeded our goal of 1500 for the client.\" “The FUSION team did a fantastic job, as usual!” OUR STORY Since the beginning, FUSION has always been about serving others with excellence. With 28 years of experience in our industry, we understand the value of our relationships with employees, talent, and clients, viewing their success as our success. ​ Our approach continues to drive FUSION toward new markets, additional offerings and a more sophisticated level of talent to best serve the needs of our growing client base. We strive to ensure that we are ahead of the curve in anticipating and adjusting to the changes that impact experiential and impact our clients. ​ Today, FUSION’s spirit of service has made us an industry leader in experiential marketing. Our team continues serving innovative brands, making sure they “Own the Room” in their markets. ​ REQUEST A PROPOSAL Connect With Us You’ve learned a little about us, now we’d like to learn about you. Tell us about your goals and let’s talk about how we can achieve them together! 678-762-1113 Service@TheFusionTeam.com Ready to Talk? 678-762-1113 © 2024 FUSION. All rights reserved. 1000 North Main Street, Suite 219 Fuquay-Varina, NC 27526 bottom of page"
    },
    {
      "url": "https://yorkfashionweek.com/contact-us",
      "text": "Get in touch with York Fashion Week About Applications Register Your Interest Model Applications Sponsors Networking Shop Contact Us VIEW Events About Applications Register Your Interest Model Applications Sponsors Networking Shop Contact Us YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 YFW 2025 PART TWO  //  16.09.2025 - 20.09.2025 CONTACT US We're on hand to answer your questions about York Fashion Week. You can reach the YFW team via the email addresses below or by completing our short contact form below. Email us at enquiries@yorkfashionweek.com ﻿ or fill in our contact form below and one of the team will be in touch with 48 working hours. Please enable JavaScript in your browser to complete this form. Your Name * Company Name * Email Address * Contact Number Website Address * Subject * General Enquiry Event Enquiry Application Enquiry Sponsorship Enquiry Volunteering Press Enquiry Other Tell us about your enquiry Submit GET INVOLVED IN YFW REGISTER YOUR INTEREST GET THE LATEST FROM YFW Sign up to our newsletter to find out the latest news from YFW straight to your mailbox. We promise not to spam you with constant emails. It's not very fashionable. SIGN UP OUR SPONSORS GET SOCIAL GET INVOLVED Register Your Interest Model Applications Networking Contact Us OUR SUPPORTERS Our Sponsors Corporate Supporters﻿ Registered Office: 3 & 4 Park Court, Riccall Road, York, Y019 6ED.  York Fashion Week LTD. We are registered in England and Wales. Company Number: 13731657. VAT Number: GB 394875336. Privacy Policy | Site by NIMA & Mark Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behaviour or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Accessibility Accessibility modes Epilepsy Safe Mode Epilepsy Safe Mode Dampens color and removes blinks This mode enables people with epilepsy to use the website safely by eliminating the risk of seizures that result from flashing or blinking animations and risky color combinations. Visually Impaired Mode Visually Impaired Mode Improves website's visuals This mode adjusts the website for the convenience of users with visual impairments such as Degrading Eyesight, Tunnel Vision, Cataract, Glaucoma, and others. Cognitive Disability Mode Cognitive Disability Mode Helps to focus on specific content This mode provides different assistive options to help users with cognitive impairments such as Dyslexia, Autism, CVA, and others, to focus on the essential elements of the website more easily. ADHD Friendly Mode ADHD Friendly Mode Reduces distractions and improve focus This mode helps users with ADHD and Neurodevelopmental disorders to read, browse, and focus on the main website elements more easily while significantly reducing distractions. Blindness Mode Blindness Mode Allows using the site with your screen-reader This mode configures the website to be compatible with screen-readers such as JAWS, NVDA, VoiceOver, and TalkBack. A screen-reader is software for blind users that is installed on a computer and smartphone, and websites must be compatible with it. Readable Experience Content Scaling Default Text Magnifier Readable Font Dyslexia Friendly Highlight Titles Highlight Links Font Sizing Default Line Height Default Letter Spacing Default Left Aligned Center Aligned Right Aligned Visually Pleasing Experience Dark Contrast Light Contrast Monochrome High Contrast High Saturation Low Saturation Adjust Text Colors Adjust Title Colors Adjust Background Colors Easy Orientation Mute Sounds Hide Images Hide Emoji Reading Guide Stop Animations Reading Mask Highlight Hover Highlight Focus Big Dark Cursor Big Light Cursor Cognitive Reading Virtual Keyboard Navigation Keys Voice Navigation Link navigator Select an option Reset Settings Hide Forever York Fashion Week Accessibility Statement Accessibility Statement yorkfashionweek.com 11 September 2025 Compliance status We firmly believe that the internet should be available and accessible to anyone, and are committed to providing a website that is accessible to the widest possible audience, regardless of circumstance and ability.\r\n\r\nTo fulfill this, we aim to adhere as strictly as possible to the World Wide Web Consortium’s (W3C) Web Content Accessibility Guidelines 2.1 (WCAG 2.1) at the AA level.\r\n\r\nThese guidelines explain how to make web content accessible to people with a wide array of disabilities. Complying with those guidelines helps us ensure that the website is accessible to all people: blind people, people with motor impairments, visual impairment, cognitive disabilities, and more.\r\n\r\nThis website utilizes various technologies that are meant to make it as accessible as possible at all times. We utilize an accessibility interface that allows persons with specific disabilities to adjust the website’s UI (user interface) and design it to their personal needs.\r\n\r\nAdditionally, the website utilizes an AI-based application that runs in the background and optimizes its accessibility level constantly. This application remediates the website’s HTML, adapts Its functionality and behavior for screen-readers used by the blind users, and for keyboard functions used by individuals with motor impairments.\r\n\r\nIf you’ve found a malfunction or have ideas for improvement, we’ll be happy to hear from you. You can reach out to the website’s operators by using the following email enquiries@yorkfashionweek.com Screen-reader and keyboard navigation Our website implements the ARIA attributes (Accessible Rich Internet Applications) technique, alongside various different behavioral changes, to ensure blind users visiting with screen-readers are able to read, comprehend, and enjoy the website’s functions. As soon as a user with a screen-reader enters your site, they immediately receive a prompt to enter the Screen-Reader Profile so they can browse and operate your site effectively. Here’s how our website covers some of the most important screen-reader requirements, alongside console screenshots of code examples: Screen-reader optimization: we run a background process that learns the website’s components from top to bottom, to ensure ongoing compliance even when updating the website.\r\nIn this process, we provide screen-readers with meaningful data using the ARIA set of attributes. For example, we provide accurate form labels;\r\ndescriptions for actionable icons (social media icons, search icons, cart icons, etc.); validation guidance for form inputs; element roles such as buttons, menus, modal dialogues (popups),\r\nand others. Additionally, the background process scans all of the website’s images and provides an accurate and meaningful image-object-recognition-based description as an ALT (alternate text) tag\r\nfor images that are not described. It will also extract texts that are embedded within the image, using an OCR (optical character recognition) technology.\r\nTo turn on screen-reader adjustments at any time, users need only to press the Alt+1 keyboard combination. Screen-reader users also get automatic announcements to turn the Screen-reader mode on\r\nas soon as they enter the website.\r\n\r\nThese adjustments are compatible with all popular screen readers, including JAWS and NVDA. Keyboard navigation optimization: The background process also adjusts the website’s HTML, and adds various behaviors using JavaScript code to make the website operable by the keyboard. This includes the ability to navigate the website using the Tab and Shift+Tab keys, operate dropdowns with the arrow keys, close them with Esc, trigger buttons and links using the Enter key, navigate between radio and checkbox elements using the arrow keys, and fill them in with the Spacebar or Enter key.Additionally, keyboard users will find quick-navigation and content-skip menus, available at any time by clicking Alt+1, or as the first elements of the site while navigating with the keyboard. The background process also handles triggered popups by moving the keyboard focus towards them as soon as they appear, and not allow the focus drift outside of it.\r\n\r\nUsers can also use shortcuts such as “M” (menus), “H” (headings), “F” (forms), “B” (buttons), and “G” (graphics) to jump to specific elements. Disability profiles supported in our website Epilepsy Safe Mode: this profile enables people with epilepsy to use the website safely by eliminating the risk of seizures that result from flashing or blinking animations and risky color combinations. Visually Impaired Mode: this mode adjusts the website for the convenience of users with visual impairments such as Degrading Eyesight, Tunnel Vision, Cataract, Glaucoma, and others. Cognitive Disability Mode: this mode provides different assistive options to help users with cognitive impairments such as Dyslexia, Autism, CVA, and others, to focus on the essential elements of the website more easily. ADHD Friendly Mode: this mode helps users with ADHD and Neurodevelopmental disorders to read, browse, and focus on the main website elements more easily while significantly reducing distractions. Blindness Mode: this mode configures the website to be compatible with screen-readers such as JAWS, NVDA, VoiceOver, and TalkBack. A screen-reader is software for blind users that is installed on a computer and smartphone, and websites must be compatible with it. Keyboard Navigation Profile (Motor-Impaired): this profile enables motor-impaired persons to operate the website using the keyboard Tab, Shift+Tab, and the Enter keys. Users can also use shortcuts such as “M” (menus), “H” (headings), “F” (forms), “B” (buttons), and “G” (graphics) to jump to specific elements. Additional UI, design, and readability adjustments Font adjustments – users, can increase and decrease its size, change its family (type), adjust the spacing, alignment, line height, and more. Color adjustments – users can select various color contrast profiles such as light, dark, inverted, and monochrome. Additionally, users can swap color schemes of titles, texts, and backgrounds, with over 7 different coloring options. Animations – epileptic users can stop all running animations with the click of a button. Animations controlled by the interface include videos, GIFs, and CSS flashing transitions. Content highlighting – users can choose to emphasize important elements such as links and titles. They can also choose to highlight focused or hovered elements only. Audio muting – users with hearing devices may experience headaches or other issues due to automatic audio playing. This option lets users mute the entire website instantly. Cognitive disorders – we utilize a search engine that is linked to Wikipedia and Wiktionary, allowing people with cognitive disorders to decipher meanings of phrases, initials, slang, and others. Additional functions – we provide users the option to change cursor color and size, use a printing mode, enable a virtual keyboard, and many other functions. Browser and assistive technology compatibility We aim to support the widest array of browsers and assistive technologies as possible, so our users can choose the best fitting tools for them, with as few limitations as possible. Therefore, we have worked very hard to be able to support all major systems that comprise over 95% of the user market share including Google Chrome, Mozilla Firefox, Apple Safari, Opera and Microsoft Edge, JAWS and NVDA (screen readers), both for Windows and for MAC users. Notes, comments, and feedback Despite our very best efforts to allow anybody to adjust the website to their needs, there may still be pages or sections that are not fully accessible, are in the process of becoming accessible, or are lacking an adequate technological solution to make them accessible. Still, we are continually improving our accessibility, adding, updating and improving its options and features, and developing and adopting new technologies. All this is meant to reach the optimal level of accessibility, following technological advancements. For any assistance, please reach out to enquiries@yorkfashionweek.com For full functionality of this site it is necessary to enable JavaScript."
    },
    {
      "url": "https://www.fusionfashiontechsummit.com/agenda/",
      "text": "AGENDA | FUSION FASHION TECH SUMMIT top of page Menu Close HOME OUR WHY SPEAKERS AGENDA PARTICIPATE EVENTS SPONSOR MEMBERSHIP APPLY PARTNERSHIP CONTACT HOME OUR WHY SPEAKERS AGENDA PARTICIPATE EVENTS SPONSOR MEMBERSHIP APPLY PARTNERSHIP CONTACT The Welcoming and Opening Remarks SDGs: Climate Action (13), Life on Land (15), Decent Work and Economic Growth (8) Welcome To Fusion Fashion Tech Summit: UNWRAPPED | Wear Your Old Clothes. Restore The Planet. 9:00 AM – 9:10 AM SDGs: Affordable and Clean Energy (7), Climate Action (13), Industry, Innovation and Infrastructure (9) Opening Remarks: 9:10 am - 9:20 am The Fusion Fashion Tech Summit 2025, themed \"Wear Your Old Clothes. Restore Our Planet.\" explores the intersections of circular economy, technology, and creative expression to redefine the future of sustainable fashion. This year, the summit tracks are broken up by the four interconnecting economies: circular, autonomous, creator, and attention. This day-long event brings together leaders across regenerative agriculture, biomimicry, AI, natural resource governance, climate investing, material innovation, blockchain, and more to spotlight innovations that transform the industry from fiber to final product and beyond. The summit expands beyond fashion to feature a beauty industry panel focused on sustainable ingredients, ethical sourcing, and clean tech that mirrors the textile sector’s regenerative shift. Attendees will also engage with critical discussions on scaling regenerative practices, bridging digital and physical experiences for consumers, and empowering creators to drive sustainable systems. With interactive sessions and groundbreaking showcases, the summit challenges industries to rethink consumption and production for a more equitable and regenerative future. TICKETS Collaborate. Network. Expand. We look forward to hosting another educational and dynamic event. We thrive by bringing our diverse community together. Please note that this is a live working agenda and therefore times, panel topics, and speakers are tentative until five days before the event date and are subject to change at anytime. We hope you enjoy the summit and look forward to welcoming you all. If you would like to be involved as a partner and/or sponsor please send an email to info@fusionfashiontechsummit.com . FUSION CHANGES OUR WORLD WEAR YOUR OLD CLOTHES. BUILD A MORE HUMANE INDUSTRY. RESTORE OUR PLANET. Circular Economy: Regenerating Fashion from Fiber to Future SDGs : 7 (Affordable and Clean Energy), 9 (Industry, Innovation and Infrastructure), 13 (Climate Action) ​ Our panelists explore how renewable energy, green infrastructure, and city planning intersect with ethical fashion production. From powering manufacturing hubs with solar energy to integrating clean energy into retail and logistics, panelists will discuss the role of cities in enabling low-carbon, resilient fashion systems. PANEL 1: 9:20 AM – 9:50 AM Designing Cities, Powering Fashion: Renewable Energy Meets Urban Style SDGs: 8 (Decent Work and Economic Growth), 13 (Climate Action), 15 (Life on Land) Panelists will discuss how regenerative agriculture and biomimicry unlock a new era of sustainable textiles. By learning from ecosystems and restoring soil health, fashion can transition from extractive to regenerative systems. Experts will share how natural processes and agricultural waste inspire textile innovation and drive circular, eco-positive design. PANEL 2: 9:50 AM – 10:20 AM From Soil to Style: Regenerative Agriculture & Biomimicry in Fashion and Textiles SDGs: 3 (Good Health and Well-being), 12 (Responsible Consumption and Production), 14 (Life Below Water), 15 (Life on Land), 17 (Partnerships for the Goals) ​ Sarah McCue's work addresses the health impacts of nanoplastic pollution, advocating for urgent regulation and producer responsibility to remove toxic plastics from the environment and human bodies. While her work spans multiple sectors, in this session, she will highlight the urgent need for industries like fashion and textiles to reduce harmful plastics and transition to safer, circular materials. This session explores the intersection of human health, plastic pollution, and sustainable solutions. PANEL 3: 10:20 AM – 10:35 AM Industry Spotlight: Sarah McCue | Plastic in Humans Global Removal Fund SDGs: Responsible Consumption and Production (12), Partnerships for the Goals (17), Industry, Innovation and Infrastructure (9) Uniting leaders across generations and disciplines to explore how sustainability in fashion is shaped by diverse perspectives of age, culture, and experience. The session highlights the importance of cross-generational dialogue and mentorship in accelerating circular economy principles and fostering inclusive innovation. Panelists share how traditional knowledge, youthful innovation, and collective action can transform fashion toward equity, resilience, and systemic change. Industry Spotlight: 10:35 AM – 11:35 AM Intergenerational Sustainability: Circular Fashion Through Diverse Voices (Co-hosted panel in collaboration with Sustainability Women in the World – SW2 , Led by Ann Lee Jeffs, Founder of SW2. ) Creator Economy: Empowering Individual Innovation & Responsible  Under consumption BREAK: 11:35 AM – 12:05 AM Network. Collaborate. Expand ​ PANEL 4: 12:05 AM – 12:35 AM Rethinking Retail: Conscious Consumers & the End of Fast Fashion SDGs : Responsible Consumption and Production (12), Quality Education (4), Reduced Inequalities (10) ​ Spotlights the shift from fast fashion to mindful, value-driven retail experiences. Discussion focuses on transparency, ethical sourcing, and circular business models reshaping consumer behavior. Leaders share how they engage conscious shoppers and build trust via storytelling, technology, and purpose. PANEL 5: 12:35 AM – 1:05 PM Tailor-Made Luxury: Fit Tech In a Hyper-Personalized World SDGs: 8 (Decent Work and Economic Growth), 10 (Reduced Inequalities), 12 (Responsible Consumption and Production) ​ Explores how AI-driven size prediction, 3D body scanning, and virtual try-ons reduce returns and waste, creating sustainable luxury personalization. Discussion covers inclusion, privacy, and accessibility in fit technology. Industry Spotlight: 1:05 PM – 1:35 PM Performance SDGs: Industry, Innovation and Infrastructure (9), Responsible Consumption and Production (12), Partnerships for the Goals (17) ​ Lunch Break: 1:35 PM – 2:05 PM Network. Collaborate. Expand PANEL 6: 2:05 PM – 2:35 PM Culture and Tradition Rewired: Modern Innovation Meets Tradition SDGs :  9 (Industry, Innovation and Infrastructure), 12 (Responsible Consumption and Production), 17 (Partnerships for the Goals) ​ Celebrates the fusion of time-honored craftsmanship and cutting-edge innovation. From indigenous weaving techniques enhanced by new materials to artisan-led collaborations with tech startups, panelists discuss how preserving cultural heritage is essential to progress, co-creating sustainable, dignified futures in fashion. Autonomous Economy: Tech-Enabled Responsible Production Autonomous Economy: Tech-Enabled Responsible Production SDGs :  9 (Industry, Innovation and Infrastructure), 12 (Responsible Consumption and Production), 17 (Partnerships for the Goals) ​ Celebrates the fusion of time-honored craftsmanship and cutting-edge innovation. From indigenous weaving techniques enhanced by new materials to artisan-led collaborations with tech startups, panelists discuss how preserving cultural heritage is essential to progress, co-creating sustainable, dignified futures in fashion. Industry Spotlight 2:35 PM – 2:50 PM Chandra Prakash Jha SDGs :  9 (Industry, Innovation and Infrastructure), 12 (Responsible Consumption and Production), 13 (Climate Action), 15 (Life on Land) ​ Chandra leverages cutting-edge satellite Earth Observation, AI, and IoT technologies to revolutionize the fashion supply chain, one of the world’s largest polluters, into a climate-neutral, biodiversity-positive system. Their pioneering Triangular Auditing™️ approach uses satellites, drones, and IoT devices to close the transparency gap by tracing raw materials from farm to finished product. This groundbreaking method brings unparalleled visibility, accountability, and climate intelligence, empowering brands to verify sustainability claims and drive regenerative impact at every stage. Panel 7: 2:50 PM – 3:20 PM Smart Roots Governance: AI, Agriculture & Ethical Resource Sourcing SDGs :  12 (Responsible Consumption and Production), 13 (Climate Action), 15 (Life on Land) ​ Examines how AI and data-driven tech are transforming agriculture and raw material sourcing—from predictive analytics to ethical tracking. Learn how smarter systems help brands align with regenerative practices, minimize impact, and ensure transparency from farm to fabric. Panel 8: 3:20 PM – 3:50 PM Trust by Design: Cybersecurity, Blockchain & Fashion's Digital Identification Ecosystem Industry Spotlight: 3:50 PM – 4:05 PM Antarctica and the Fashion and Textiles Crisis SDGs : 9 (Industry, Innovation and Infrastructure), 10 (Reduced Inequalities), 16 (Peace, Justice and Strong Institutions) ​ Explores how blockchain, AI, and decentralized IDs secure authenticity, protect consumer data, and build resilient fashion systems. Learn how these technologies foster transparency and trust, from product to person. SDGs :  9 (Industry, Innovation and Infrastructure), 11 (Sustainable Cities and Communities), 12 (Responsible Consumption and Production), 13 (Climate Action), 14 (Life Below Water), 15 (Life on Land) ​ Terry Trevino and architect/activist Giulia Foscari will explore how polar environmental science and cultural heritage intersect with the global fashion and textile crisis. Terry’s satellite work tracks nanoplastics, tiny plastic particles that contaminate water and enter the food chain. Nanoplastics are often invisible but devastating, largely originating from synthetic textiles and fast fashion shedding microfibers. Giulia uses design and storytelling to highlight climate impacts on Antarctic heritage, while also fostering transnational research and activism to protect Global Commons threatened by environmental change. Together, they will discuss how innovation, culture, and cross-sector collaboration can drive sustainable change in fashion. Industry Spotlight: 3:50 PM – 4:05 PM Industry Spotlight: Antarctica and the Fashion and Textiles Crisis SDGs :  12 (Responsible Consumption and Production), 13 (Climate Action), 15 (Life on Land) ​ Panel 8: 3:20 PM – 3:50 PM Trust by Design: Cybersecurity, Blockchain & Fashion's Digital Identification Ecosystem Let's Continue to Build A More Humane World Together! Let's Continue to Build A More Humane World Together! Expanded Ecosystems: Tech, Identity & Wellbeing PANEL 13: 4:35 PM – 5:05 PM Sustainable Sourcing: Governance, Shifting Economies, & Trade Policy SDGs: Peace, Justice and Strong Institutions (16), Decent Work and Economic Growth (8), Responsible Consumption and Production (12) PANEL 14: 5:05 PM – 5:35 PM Cybersecurity, AI & Digital Identity in the Fashion, Beauty, and Wel Ecosystem SDGs: Industry, Innovation and Infrastructure (9), Reduced Inequalities (10), Peace, Justice and Strong Institutions (16) Panel 15: 5:35 PM - 6:05 PM Space Fabrication: Advanced Materials from Extraterrestrial Environments Industry, Innovation and Infrastructure (9), Responsible Consumption and Production (12), Partnerships for the Goals (17) Industry Spotlight 4: 6:05 PM – 6:35 PM SDGs: Industry, Innovation and Infrastructure (9), Reduced Inequalities (10), Peace, Justice and Strong Institutions (16) Powered By  A More Humane World © 2025 Fusion Fashion Tech Society |  All Rights Reserved. Built By Ambriel Pouncy Fusion Changes Our World info@fusionfashiontechsummit.com ​ Fusion Changes Our World HOME OUR WHY SPEAKERS AGENDA PARTICIPATE EVENTS SPONSOR MEMBERSHIP APPLY PARTNERSHIP CONTACT bottom of page"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://davincimagazine.com/fusion-fashion-events-south-florida-fashion-leader/",
      "text": "Fusion Fashion Events: The Cultural Powerhouse Driving South Florida’s Fashion Scene Year-Round - Davinci Magazine Facebook Instagram Linkedin Pinterest TikTok Twitter Youtube Threads Sign in Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact Sign in Welcome! Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search 64.4 F New York Thursday, September 11, 2025 My account Access account Login Register Facebook Instagram Pinterest TikTok Twitter Youtube Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Related Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact Search Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Related Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact Search Photo Credit: Michael Hursey Fashion News & Events 2 min. Read Fusion Fashion Events: The Cultural Powerhouse Driving South Florida’s Fashion Scene Year-Round 28 By Davinci Magazine Staff June 17, 2025 Facebook Twitter Pinterest WhatsApp When it comes to curating culture, fashion, and unforgettable experiences in South Florida, Fusion Fashion Events isn’t just showing up — they’re running the entire show. While many producers limit their impact to marquee moments like Miami Swim Week or Art Basel , Fusion has found a way to extend their influence far beyond the expected calendar dates. They’re not here to follow trends — they’re here to define them. And if there’s a major event in South Florida, you can bet Fusion Fashion Events is not just involved — they’re at the center of it all. Photo Credit: Michael Hursey More Than Just a Runway At its core, Fusion Fashion Events has never been about simply putting clothes on a runway. It’s about creating experiences that engage every sense. Their productions are immersive, electric, and driven by a genuine understanding of South Florida’s unique cultural rhythm . From live performances by Grammy-nominated artists to hosting sports-meets-fashion spectacles like the Model Pickleball Tournament , Fusion takes every opportunity to fuse fashion with music, art, and community — hence the name. Their secret sauce? A relentless commitment to cultural authenticity. South Florida isn’t just a backdrop — it’s the inspiration. Fusion’s team has its finger on the pulse of what’s next, who’s hot, and how to spotlight rising talent in unforgettable ways. Dominating Year-Round Outside of the swimwear and art world spotlights, Fusion keeps the momentum going all year. Whether they’re activating pop-up fashion moments during Art Basel, collaborating with music festivals, or hosting influencer-studded fashion panels, they’ve created a cultural engine that never slows down. They don’t just produce events — they create platforms. For models, designers, DJs, creatives, and entrepreneurs, Fusion has become the place to be seen. The Pulse of the City What makes Fusion truly stand out is their ability to represent what South Florida style feels like — bold, unapologetic, effortlessly cool, and always ahead of the curve. Their shows don’t feel like traditional fashion events — they feel like moments. Moments you remember. Moments you post about. Moments that turn designers into icons and emerging talent into household names. In a region that thrives on vibe, energy, and innovation, Fusion Fashion Events continues to set the bar. Whether it’s taking over a pool deck during Swim Week or throwing a rooftop runway party with live performances and DJ sets, they keep the city talking — and dancing. A Cultural Staple As South Florida continues to evolve into a global hub for fashion and entertainment, Fusion Fashion Events is leading the charge. Their ability to bridge style with substance has made them more than an event producer — they’re now a cultural institution . So if you’re wondering who’s shaping the future of fashion in Miami and beyond, look no further than Fusion. They’re not just producing events — they’re shaping the scene . Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Related Tags Fusion Fashion Events Miami fashion culture South Florida fashion Hot this week Exclusive Feature The Armory Show 2025, My Firsthand Look at Art, Market, and Spectacle September 6, 2025 0 A personal walk through The Armory Show 2025, where art, market, and spectacle meet, from quiet morning deals to an afternoon full of cameras. News & Events Giorgio Armani, Legendary Italian Designer, Dies at 91 September 5, 2025 0 Giorgio Armani, the legendary Italian fashion designer who transformed global style and dressed Hollywood’s elite, has passed away at 91. News & Events Louis Vuitton Expands and Renovates Women’s Boutique at Mall at Millenia in Orlando September 4, 2025 0 Louis Vuitton unveils its newly expanded Women’s store at the Mall at Millenia in Orlando, showcasing luxury fashion, fine jewelry, and beauty. Fashion Best Red Carpet Looks from the 82nd Annual Venice Film Festival September 6, 2025 0 The 82nd Annual Venice Film Festival delivered unforgettable fashion moments. From Hollywood icons to global stars, here are the best looks that defined the red carpet. Fashion International Heritage Fashion Week Returns to New York for Season 04 September 8, 2025 0 International Heritage Fashion Week returns to New York on September 11, 2025, at the Angel Orensanz Foundation, uniting designers, models, and entertainers to celebrate fashion as heritage and innovation. Topics Beauty Culture Exclusive Feature Fashion Lifestyle News News & Events Photography More Exclusive Feature Alison Blickle: Future Ruins 0 In Future Ruins, Alison Blickle presents a world where beauty and technology collide. Her new paintings at Kravets Wehby Gallery in Chelsea explore avatars, grief, and longing in a future where nature has disappeared. Fashion International Heritage Fashion Week Returns to New York for Season 04 0 International Heritage Fashion Week returns to New York on September 11, 2025, at the Angel Orensanz Foundation, uniting designers, models, and entertainers to celebrate fashion as heritage and innovation. Fashion Best Red Carpet Looks from the 82nd Annual Venice Film Festival 0 The 82nd Annual Venice Film Festival delivered unforgettable fashion moments. From Hollywood icons to global stars, here are the best looks that defined the red carpet. Exclusive Feature The Armory Show 2025, My Firsthand Look at Art, Market, and Spectacle 0 A personal walk through The Armory Show 2025, where art, market, and spectacle meet, from quiet morning deals to an afternoon full of cameras. News & Events Giorgio Armani, Legendary Italian Designer, Dies at 91 0 Giorgio Armani, the legendary Italian fashion designer who transformed global style and dressed Hollywood’s elite, has passed away at 91. News & Events Louis Vuitton Expands and Renovates Women’s Boutique at Mall at Millenia in Orlando 0 Louis Vuitton unveils its newly expanded Women’s store at the Mall at Millenia in Orlando, showcasing luxury fashion, fine jewelry, and beauty. Fashion Hailey Bieber Becomes the Face of DKNY’s Fall 2025 Campaign 0 DKNY unveils its Fall 2025 campaign featuring Hailey Bieber as the brand’s new global face. The collection blends classic New York street style with Hailey’s modern influence. Culture Chloe Malle Named New Top Editor at American Vogue 0 American Vogue names Chloe Malle as top editor for the U.S. edition, while Anna Wintour continues in global leadership at Condé Nast. Related Articles International Heritage Fashion Week Returns to New York for Season 04 Fashion September 8, 2025 Best Red Carpet Looks from the 82nd Annual Venice Film Festival Fashion September 6, 2025 The Armory Show 2025, My Firsthand Look at Art, Market, and Spectacle Exclusive Feature September 6, 2025 Giorgio Armani, Legendary Italian Designer, Dies at 91 News & Events September 5, 2025 Louis Vuitton Expands and Renovates Women’s Boutique at Mall at Millenia in Orlando News & Events September 4, 2025 Popular Categories Fashion Exclusive Feature News & Events Culture Beauty Photography Lifestyle Previous article Kering’s Bold Bet: Renault CEO Luca de Meo Tapped to Revive Gucci and Group Fortunes Next article meg elsier Returns with “sportscar [scrapped],” a Gritty Glimpse into the Deluxe Edition of spittake Facebook Instagram Linkedin Mail Pinterest TikTok Twitter Youtube DAVINCI MAGAZINE Davinci Magazine\" is a prestigious fashion and lifestyle publication renowned for its exquisite blend of high fashion, beauty, culture, and photography, inspired by the artistic genius of Leonardo da Vinci. It stands as a beacon in the fashion industry, celebrated for showcasing cutting-edge trends, luxurious lifestyles, and diverse global perspectives in a visually stunning and intellectually enriching format. Latest News Alison Blickle: Future Ruins Exclusive Feature September 8, 2025 0 In Future Ruins, Alison Blickle presents a world where beauty and technology collide. Her new paintings at Kravets Wehby Gallery in Chelsea explore avatars, grief, and longing in a future where nature has disappeared. International Heritage Fashion Week Returns to New York for Season 04 Fashion September 8, 2025 0 International Heritage Fashion Week returns to New York on September 11, 2025, at the Angel Orensanz Foundation, uniting designers, models, and entertainers to celebrate fashion as heritage and innovation. Best Red Carpet Looks from the 82nd Annual Venice Film Festival Fashion September 6, 2025 0 The 82nd Annual Venice Film Festival delivered unforgettable fashion moments. From Hollywood icons to global stars, here are the best looks that defined the red carpet. Trending Alison Blickle: Future Ruins Exclusive Feature September 8, 2025 0 In Future Ruins, Alison Blickle presents a world where beauty and technology collide. Her new paintings at Kravets Wehby Gallery in Chelsea explore avatars, grief, and longing in a future where nature has disappeared. International Heritage Fashion Week Returns to New York for Season 04 Fashion September 8, 2025 0 International Heritage Fashion Week returns to New York on September 11, 2025, at the Angel Orensanz Foundation, uniting designers, models, and entertainers to celebrate fashion as heritage and innovation. Best Red Carpet Looks from the 82nd Annual Venice Film Festival Fashion September 6, 2025 0 The 82nd Annual Venice Film Festival delivered unforgettable fashion moments. From Hollywood icons to global stars, here are the best looks that defined the red carpet. Sitemap Home About Exclusive Feature News & Events Fashion Lifestyle Culture Beauty Photography Contact © 2022 Davinci Magazine. All Rights Reserved. Discover more from Davinci Magazine Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading Subscribe %d"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.fusionrose.com/contactus",
      "text": "Contact Us — Fusion Rose Events Home About 2025 Pricing Media calendar Layouts Vendors Balloons Bartenders & ABC Decoration Event Planners Event Speakers Florist Food Gifts Hair & Makeup Home Prep Insurance Jeweler Lighting & AV Linens Locksmith Moving Music Nails Pets Photography & Videography Self Care Stages Vehicle Detailing Wine Tasting In’s & Outs Forms Contact Us Menu 9111 Kiefer Boulevard Sacramento, CA, 95826 1(916)469-9028 Your Custom Text Here Home About 2025 Pricing Media calendar Layouts Vendors Balloons Bartenders & ABC Decoration Event Planners Event Speakers Florist Food Gifts Hair & Makeup Home Prep Insurance Jeweler Lighting & AV Linens Locksmith Moving Music Nails Pets Photography & Videography Self Care Stages Vehicle Detailing Wine Tasting In’s & Outs Forms Contact Us Contact Us Name * First Name Last Name Phone Number * Email Address * Subject * Event Date Message * Thank you! We will be in touch soon. Please browse through the website, many of your questions can be answered by clicking on the tabs. Do we have availability for a specific date? Check our our calendar. What do we charge? Go to the Pricing tab. If you still have questions, please call or text us at 916-956-9043 . If you’d like to book a walk through or schedule an event, please fill out the contact us form."
    },
    {
      "url": "https://www.fashionfusion.co.za/pages/contact-us-1",
      "text": "Contact us\n\n        – Fashion Fusion FREE DELIVERY for orders over R950 ALL DISCOUNTS APPLIED AT CHECKOUT LATEST ARRIVALS WOMEN MEN KIDS BRANDS FALL/WINTER COLLECTION DENIM PROMOS Contact us We want to make it possible for you to have the best shopping experience and will get back to you within 24 hours. For online support you can contact us on   087 061 1111 from 8am - 5pm, for general customer care inquiries you can contact us on 087 944 5678. You may also find your query answered in the most frequently asked questions (FAQ) page. Name Email Message This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Menu Our story Return Request Contact us Careers Need assistance? Find a store FAQ Social media Follow us on Social Media Subscribe Sign up to our e-mailer and receive the latest trends and fashion deals. Email English ZAR LATEST ARRIVALS WOMEN MEN KIDS BRANDS FALL/WINTER COLLECTION DENIM PROMOS Fashion Fusion 2025 Refund policy Privacy policy Terms of service Shipping policy"
    }
  ]
}