{
  "fuentes": [
    {
      "url": "https://www.fws.gov/refuge/alligator-river/visit-us/activities",
      "email": "alligatorriver@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/red-river/contact-us",
      "email": "redriver@fws.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "brent_vickers@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "brian_ubelaker@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "cory_graham@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "crystal_leonetti@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "gisela_chapa@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "glenn_westdahl@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "hannah_voorhees@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "janel_day@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "jarred_stone@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "jason_roberts@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kendra_holman@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kevin_foley@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kristen_morrow@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "lisa_grediagin@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "liz_williams@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "michelle_stpeters@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "nissa_pilcher@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "orville_lind@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "robbin_lavine@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "scott_ayers@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "thomas_plank@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "bernard_shavings@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "brent_vickers@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "brian_ubelaker@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "brooke_mcdavid@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "cory_graham@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "crystal_leonetti@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "deanna.perry@usda.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "gisela_chapa@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "glenn_westdahl@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "hannah_voorhees@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "janel_day@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "jarred_stone@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "jason_roberts@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "justin_koller@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "karie_crow@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "katerina_wessels@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kendra_holman@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kevin_foley@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "kristen_morrow@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "leigh_honig@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "lisa_grediagin@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "liz_williams@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "michelle_stpeters@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "nissa_pilcher@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "orville_lind@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "rebecca_brown@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "robbin_lavine@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "scott_ayers@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "sherri_gould-fehrs@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "subsistence@fws.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "subsistence@ios.doi.gov"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "email": "thomas_plank@ios.doi.gov"
    },
    {
      "url": "https://www.fws.gov/story/2024-10/meeting-mission-cache-river",
      "email": "cypresscreek@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "email": "ed_britton@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "email": "kendra_pednault@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "email": "tim_a_miller@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "email": "uppermississippiriver@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "email": "wendy_woyczik@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/wallkill-river/contact-us",
      "email": "anna_bisson@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/sherburne/get-involved",
      "email": "sherburne@fws.gov"
    },
    {
      "url": "https://www.fws.gov/refuge/crystal-river/get-involved",
      "email": "crystalriver@fws.gov"
    }
  ],
  "mails": [
    "alligatorriver@fws.gov",
    "anna_bisson@fws.gov",
    "bernard_shavings@ios.doi.gov",
    "brent_vickers@ios.doi.gov",
    "brian_ubelaker@ios.doi.gov",
    "brooke_mcdavid@ios.doi.gov",
    "cory_graham@ios.doi.gov",
    "crystal_leonetti@ios.doi.gov",
    "crystalriver@fws.gov",
    "cypresscreek@fws.gov",
    "deanna.perry@usda.gov",
    "ed_britton@fws.gov",
    "gisela_chapa@ios.doi.gov",
    "glenn_westdahl@ios.doi.gov",
    "hannah_voorhees@ios.doi.gov",
    "janel_day@ios.doi.gov",
    "jarred_stone@ios.doi.gov",
    "jason_roberts@ios.doi.gov",
    "justin_koller@ios.doi.gov",
    "karie_crow@ios.doi.gov",
    "katerina_wessels@ios.doi.gov",
    "kendra_holman@ios.doi.gov",
    "kendra_pednault@fws.gov",
    "kevin_foley@ios.doi.gov",
    "kristen_morrow@ios.doi.gov",
    "leigh_honig@ios.doi.gov",
    "lisa_grediagin@ios.doi.gov",
    "liz_williams@ios.doi.gov",
    "michelle_stpeters@ios.doi.gov",
    "nissa_pilcher@ios.doi.gov",
    "orville_lind@ios.doi.gov",
    "rebecca_brown@ios.doi.gov",
    "redriver@fws.gov",
    "robbin_lavine@ios.doi.gov",
    "scott_ayers@ios.doi.gov",
    "sherburne@fws.gov",
    "sherri_gould-fehrs@ios.doi.gov",
    "subsistence@fws.gov",
    "subsistence@ios.doi.gov",
    "thomas_plank@ios.doi.gov",
    "tim_a_miller@fws.gov",
    "uppermississippiriver@fws.gov",
    "wendy_woyczik@fws.gov"
  ],
  "nombre_sitio": "fws.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fws.gov/refuge/alligator-river/visit-us/activities",
      "text": "Alligator River National Wildlife Refuge | Visit Us - Activities | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Alligator River National Wildlife Refuge Image Details Image Details Image Details Alligator River National Wildlife Refuge About Us What We Do Facility Services Projects & Research Contact Us Visit Us Activities Locations Tours Trails Rules & Policies Get Involved Events News Library Species Map https://www.facebook.com/CoastalNorthCarolinaNWRC Facility Activities Don’t miss the National Wildlife Refuges Visitor Center on Roanoke Island and its state-of-the-art exhibits—all free! Or, venture to the Dare County mainland to Alligator River National Wildlife Refuge’s popular Murphy Peterson Wildlife Drive , where locals compete to see who can count the most black bear in one evening. Wildlife abounds in the farming and moist soil management units along the Wildlife Drive. If you are looking for adventure, a great way to explore the refuge is by canoe or kayak, using the refuge’s 15+ miles of color-coded paddling trails. There are two half-mile, universally accessible wildlife trails for a leisurely stroll in a beautiful, quiet and secluded place. Enrich your experience by joining us for an open-air tram tour or interpretive program .For wildlife photographers, there are great photographic opportunities if you have patience. Hunting and fishing are allowed with restrictions. In fall, the refuge joins other eastern North Carolina refuges and partner organizations each year to host the Wings Over Water Wildlife Festiva l, a celebration of migrant waterfowl and other local wildlife. Auto tour The refuge has an incredible Wildlife Drive where black bear, wild turkeys, all kinds of birds of prey, waterfowl, and other wildlife may be seen. Locals drive around after supper and compare notes about how many bears they have seen in different fields. There's even a chance to see an elusive... Wildlife watching We welcome beginning and expert wildlife watchers! The Wildlife Drive is a great place to start. The open fields along the Wildlife Drive provide food and habitat for wildlife and an open landscape for viewing and photographic opportunities. Black bear, waterfowl and other birds, alligators, and... Ranger-led programs The refuge offers a range of programs about the wildlife and habitats on the refuge, such as bears and red wolves. For more information, see the program schedule below. For fee programs, please call the registration number 252-216-9464 to reserve and pay. Hiking There are two half-mile (one-way) universally accessible trails on the refuge: the Sandy Ridge Wildlife Trail and Creef Cut Wildlife Trail. In addition, hiking is open in all areas open to the public, including many miles of refuge roads. Refuge roads closed to... Hunting Alligator River National Wildlife Refuge contains approximately 160,000 acres, most of which are open to hunting. There are more than 150 miles of old logging roads that provide hunting access, some for vehicles and some on foot. Vehicular access is restricted to designated roads. Visitors... Fishing Sport fishing is allowed on any open area of the Refuge in accordance with State and Federal regulations. Waters available for fishing include East Lake, South Lake, Whipping Creek Lake, Sawyer Lake and Swan Lake. Brackish bays/estuaries include Pamlico Sound and Alligator River. Streams... Birding The refuge is a birding hotspot, with excellent habitat for field and forest birds. In winter, the farm fields support thousands of wintering waterfowl, including elegant tundra swans. The field habitats are also home to species such as the declining northern bobwhite quail, northern... Boating - non-motorized The refuge has four paddling trails starting at the end of Buffalo City Road. There is a canoe/kayak launch and parking for vehicles, including those with trailers, at the end of the road (note that parking can fill up quickly during peak summer season). There is another... Photography We welcome beginning and expert photographers alike to record their outdoor adventures on film, memory card or internal hard drive! The Wildlife Drive is a great place to start. The open fields along the Wildlife Drive provide food and habitat for wildlife and an open landscape for viewing and... Biking Bicycling is allowed only on designated public access routes/roads. Bikes are not allowed on the Sandy Ridge or Creef Cut walking trails. Please be aware of your surroundings when biking on the refuge. Stay at least 100 yards away from large animals such as black bears, coyotes, and red... Boating - motorized There are three North Carolina Wildlife Resources Commission boat ramps, suitable for small boats, near the refuge; one off of Mashoes Road provides access to East Lake, another off of Old Ferry Landing Road provides access to Alligator River,... Education programs Is your school, youth, environmental or other group interested in learning more about the wildlife, plants, habitats and ecology of Alligator River National Wildlife Refuge?  Refuges are wild places, and we want to teach you more about them!  We offer much for children and... Accessible trails There are two trails on the refuge. The Creef Cut Wildlife Trail is fully accessible and meets ADA requirements. The Sandy Ridge Wildlife Trail is a half-mile and more rustic and \"wild\" than Creef Cut Trail. Though it is possible for wheelchairs and strollers to use this trail... Dog walking Pets are allowed on refuge trails and roads. All domestic pets (dogs, cats, horses, etc.) must be properly confined, leashed (10-foot maximum), or haltered and under owner control at all times. Dog training The training of chase dogs is permitted only during modern gun deer season. Please see the Hunting section for more information. The use of dogs is restricted to designated areas. All dogs must be confined or leashed and under owner control when not engaged in hunting. Hunters may walk on closed... Horseback riding Horseback riding is allowed only on roads open to motorized vehicles. Groups of 6 or more horses must have a Refuge Special Use Permit. For questions, please contact the refuge. Firewood cutting Firewood cutting requires a special use permit; contact the refuge for more details. There is no guarantee you will receive the permit, and you should apply early enough to allow 2-4 weeks for processing. Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.fws.gov/refuge/red-river/contact-us",
      "text": "Red River National Wildlife Refuge | Contact Us | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Red River National Wildlife Refuge Image Details Red River National Wildlife Refuge About Us What We Do Facility Services Law Enforcement Laws & Regulations Contact Us Visit Us Activities Trails Rules & Policies News Library Species Map Contact Us Please contact the Refuge with any questions or concerns.  Our staff and volunteers are available to help! Red River National Wildlife Refuge 150 Eagle Bend Point Bossier City, LA 71112 Telephone: (318) 742-1219 Fax: (318) 742-1259 Visit us on Facebook ! Visitor Center Hours Monday            8:00 AM - 4:00 PM Tuesday           8:00 AM - 4:00 PM Wednesday     8:00 AM - 4:00 PM Thursday         8:00 AM - 4:00 PM Friday              8:00 AM - 4:00 PM Saturday         10:00 AM - 4:00 PM (as volunteer staffing allows) Sunday           1:00 PM - 4:00 PM (as volunteer staffing allows) Email Address redriver@fws.gov Location and Contact Information Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.doi.gov/subsistence/osm/staff",
      "text": "OSM Staff Directory | U.S. Department of the Interior Skip to main content An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government organization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. Countdown to America's 250th Anniversary : July 4th 2026 Dismiss America250 Newsroom Accessibility Menu Toggle Font Size Toggle OpenDyslexic Toggle Dyslexia-friendly black-on-creme color scheme Contact Us U.S. Department of the Interior Menu About About Interior Interior Leadership Meet the Secretary Departmental Offices History of the Interior Join Careers Pathways Program Veterans Employment Volunteer Bureaus Bureaus Bureaus Bureau of Indian Affairs Bureau of Indian Education Bureau of Land Management Bureau of Ocean Energy Management Bureau of Reclamation Bureau of Safety & Environmental Enforcement Bureau of Trust Funds Administration National Park Service Office of Surface Mining Reclamation & Enforcement U.S. Fish & Wildlife Service U.S. Geological Survey Media Media Blog Press Releases Media Contacts Multimedia Search America250 Newsroom Accessibility Menu Toggle Font Size Toggle OpenDyslexic Toggle Dyslexia-friendly black-on-creme color scheme Contact Us Breadcrumb Home Federal Subsistence Management Program Office of Subsistence Management OSM Staff Directory In This Section Home Contact Us FAQ Subsistence Overview and History Regulatory Process Student Art Contest Federal Subsistence Board Current Proposals Members Upcoming FSB Meetings Past Meeting Transcripts Past Meeting Materials Policies & Procedures Regional Advisory Councils Apply for RAC Southeast Alaska Southcentral Alaska Kodiak/Aleutians Bristol Bay Yukon-Kuskokwim Delta Western Interior Alaska Seward Peninsula Northwest Arctic Eastern Interior Alaska North Slope RAC Meeting calendars Public comments Council Member Training Special Actions Upcoming Public Hearings Pending Special Actions Fisheries Special Actions Wildlife Special Actions Tribal and ANCSA Corporation Consultation Wildlife Regulations Fisheries Regulations Fisheries Resource Monitoring Program FRMP Contacts Applying for Funding FRMP Reports Partners for Fisheries Monitoring Program Applying For Funding Maps Latest News Share Facebook LinkedIn Reddit Pinterest X (formerly Twitter) OSM Staff Directory Contact staff members of the Office of Subsistence Management Office of Subsistence Management Main Office (907) 786-3888 or Toll Free: (800) 478-1456 / subsistence@ios.doi.gov Director - Crystal Leonetti -  (907) 786-3888, crystal_leonetti@ios.doi.gov Deputy Director (Sciences) - Scott Ayers -  (907) 744-3824, scott_ayers@ios.doi.gov Deputy Director (Operations), acting - Katerina Wessels - (907)786-3885, katerina_wessels@ios.doi.gov Executive Secretary - Glenn Westdahl  - (907) 786-3325, glenn_westdahl@ios.doi.gov Native Liaison - Orville Lind -  (907) 786-3953, orville_lind@ios.doi.gov Policy Coordinator - Robbin La Vine -  (907) 786-3353, robbin_lavine@ios.doi.gov State Subsistence Liaison - VACANT Regulatory Affairs Division Supervisor/Regulations Specialist - Justin Koller -   (907) 891-0355, justin_koller@ios.doi.gov Subsistence Outreach Coordinator/Public Affairs - VACANT Permit Specialist - VACANT Administrative Record Specialist - VACANT Wildlife Division Supervisor - Lisa Grediagin  - (907) 786-3357, lisa_grediagin@ios.doi.gov Wildlife Biologist - Tom Plank -  (907) 786-3394, thomas_plank@ios.doi.gov Wildlife Biologist - Brian Ubelaker -  (907) 727-3174, brian_ubelaker@ios.doi.gov Wildlife Biologist - Kendra Holman -  (907) 786-3387, kendra_holman@ios.doi.gov Cartographer - Janel Day janel_day@ios.doi.gov Anthropology Division Supervisor - Brent Vickers -  (907) 531-1375, brent_vickers@ios.doi.gov Anthropologist - VACANT Anthropologist - Hannah Voorhees -  (907) 786-3364, hannah_voorhees@ios.doi.gov Anthropologist - Liz Williams -  (907) 786-3888, liz_williams@ios.doi.gov Anthropologist - Jason Roberts -  (907)786-3888, jason_roberts@ios.doi.gov Anthropology Pathways Student Intern - Kristen Morrow -  (907) 786-3888, kristen_morrow@ios.doi.gov Fisheries Division Supervisor - VACANT Fisheries Biologist/Partners - VACANT Fisheries Biologist - Jarred Stone -  (907) 310-9487, jarred_stone@ios.doi.gov Fisheries Biologist - Cory Graham -  (907) 786-3947, cory_graham@ios.doi.gov Fisheries Biologist - Kevin Foley -  (907) 782-6331, kevin_foley@ios.doi.gov Fisheries Biologist - VACANT Fisheries Technician - VACANT Fisheries Student Intern - VACANT Grants Management Specialist - Michelle St. Peters -  (907) 786-3691, michelle_stpeters@ios.doi.gov Council Coordination Division Supervisor - Katerina Wessels -  (907)786-3885, katerina_wessels@ios.doi.gov Council Coordinator (Southeast Alaska Region) (U.S. Forest Service employee) - DeAnna Perry -  (907) 209-7817, deanna.perry@usda.gov Council Coordinator (Kodiak/Aleutians & Northwest Arctic Regions) - VACANT Council Coordinator (Southcentral & Western Interior Regions) - Nissa Pilcher -  (907) 891-9054, nissa_pilcher@ios.doi.gov Council Coordinator (Bristol Bay Region) - Leigh Honig -  (907) 891-9053, leigh_honig@ios.doi.gov Council Coordinator (Eastern Interior & Yukon-Kuskokwim Delta Regions) - Brooke McDavid -  (907) 891-9181, brooke_mcdavid@ios.doi.gov Council Coordinator (Seward Peninsula & North Slope Regions) - Gisela Chapa -  (907) 786-3676, gisela_chapa@ios.doi.gov Administrative Division Supervisor - Karie Crow -  (907) 786-3521, karie_crow@ios.doi.gov Financial Specialist - VACANT Budget Analyst - VACANT Admin Support Assistant - Sherri Gould-Fehrs -  (907) 505-9047, sherri_gould-fehrs@ios.doi.gov Admin Support Assistant - Becky Brown -  (907) 786-3882, rebecca_brown@ios.doi.gov Admin Support Assistant - Bernard Shavings -  (907) 786-3994, bernard_shavings@ios.doi.gov Was this page helpful? Yes No This page was not helpful because the content: Please provide a comment Leave this field blank Return to top Section Title About DOI Accessibility Contact Us Copyright Disclaimer Information Quality Privacy Policy Site Map Vulnerability Disclosure Policy Section Title Budget & Performance Cummings Act Notices FOIA Hearings and Appeals Case Inventories Inspector General No Fear Act reports Subscribe Enter your email address to subscribe to Interior news and updates U.S. Department of the Interior Stewarding Conservation and Powering Our Future 1849 C Street NW, Washington, DC 20240"
    },
    {
      "url": "https://www.fws.gov/story/2024-10/meeting-mission-cache-river",
      "text": "Meeting the mission in the Cache River | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Meeting the mission in the Cache River Image Details Meeting the mission in the Cache River Watershed Oct 28, 2024 Written By Justin Sexton We continue to meet the conservation mission of the U.S. Fish and Wildlife Service for the American public every day in the Cache River Watershed, as we work to manage waterfowl and other trust species across this special landscape. We want to assure folks that we continue to meet our biological and greater resource management tasks uninterrupted on the ground and in-person at the refuge. This means that refuge staff continue to work onsite, attending to moist soil management and patrolling during hunting season, as well as other essential functions. Resources for planning your visit Planning a visit to see the towering bald cypress and water tupelo trees that make this refuge so special? Give us a call at 618-997-3344, email us at CypressCreek@fws.gov or stop by our sister refuge. The Crab Orchard National Wildlife Refuge Visitor Center is open from 8:00 a.m. to 4:00 p.m. every day. Our robust support team is happy to help you plan your next trip to Cypress Creek National Wildlife Refuge. We closed the visitor contact station at Shawnee Community College on September 30, 2024, and began routing visitor services-related needs to the visitor services team at the Crab Orchard National Wildlife Refuge Visitor Center about 30 miles away. Given the proximity of these refuges to each other, and the daily availability of visitor services professionals, visitors have been able to get helpful information as they plan a visit. Continuing conservation Resources supporting our agency’s work are strong. Our conservation work continues unchanged, and refuge lands remain open for exceptional outdoor experiences, including paddling, hiking, wildlife viewing, hunting and other wildlife-dependent activities. In addition to public access to these lands and waters, we continue to manage for waterfowl and other trust species. Cypress Creek National Wildlife Refuge has been, and continues to be, deeply rooted in the conservation of the lands and waters of the Cache River Watershed of southern Illinois. Established in 1990 under the Emergency Wetland Reserve Act, the refuge is part of the largest remaining swamp and forested wetland habitat in the midwest, and includes some of the oldest living trees east of the Mississippi River. Focused on protecting, restoring and managing 17,000 acres of wetlands and bottomland forests, the refuge footprint touches four counties between the Ohio and Mississippi rivers, and is rife with bald-cypress and water tupelo trees, ancient giants that have stood here for centuries. Story Tags Wildlife refuges Written By Justin Sexton Published Oct 28, 2024 Facilities Cypress Creek National Wildlife Refuge Latest Stories Endangered Species Act Columbian White-tailed Deer: A Conservation Comeback in the Pacific Northwest Sep 9, 2025 Saving the Louisiana Pinesnake Sep 9, 2025 Land Management Restoring tribal stewardship Sep 9, 2025 Pagination Previous page Current page 1 Page 2 Page 3 Page 4 Page 5 Page 6 Page 7 Page 8 Page 9 Next page Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.fws.gov/refuge/upper-mississippi-river/contact-us",
      "text": "Upper Mississippi River National Wildlife and Fish Refuge | Contact Us | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Upper Mississippi River National Wildlife and Fish Refuge Image Details Upper Mississippi River National Wildlife and Fish Refuge About Us What We Do Facility Services Law Enforcement Laws & Regulations Contact Us Visit Us Activities Locations Trails Rules & Policies Get Involved Events News Library Species Map https://www.facebook.com/UpperMissNWFR Refuge Contact Information Four District Offices work together to manage the refuge, coordinated by our Headquarters Office based in Winona, MN. If you have questions about a specific site on the refuge, please reach out to the District closest to where you'd like to visit. If you're not sure, please contact the La Crosse District Visitor Center where staff will help direct your call. The quickest way to reach us is by phone at (608) 779-2399 or email at uppermississippiriver@fws.gov . Office and Visitor Hours may vary so we recommend calling ahead to ensure they are open. You can also check out our Facebook Page . Headquarters Office 102 Walnut Street Suite 204 Winona, MN, 55987 Phone: 507-452-4232 Office hours: By appointment only Closed federal holidays Winona District Office 102 Walnut Street Suite 205 Winona, MN 55987 Phone: 507-452-4232 Office hours: By appointment only Closed federal holidays La Crosse District Office and Visitor Center N5727 County Road Z Onalaska, WI 54650 Phone: (608) 779-2399 Office hours: By appointment only Visitor Center Hours: November - April: Tuesday - Friday, 9:00am - 3:00pm May - October: Tuesday - Saturday, 9:00am - 3:00pm Closed federal holidays McGregor District Office 470 Cliff Haven Road Prairie du Chien, WI 53821 Phone: (608) 326-0515 Office hours: By appointment only Closed federal holidays Savanna District Office and Ingersoll Wetlands Learning Center 7071 Riverview Road Thomson, IL 61285 Phone: 815-273-2732 Office hours: By Appointment Only Ingersoll Wetlands Learning Center hours : Monday-Friday, 8am - 4pm, BUT hours may vary - please call ahead to confirm. Closed federal holidays Email Address uppermississippiriver@fws.gov Key Contacts Image Sabrina Chandler Refuge Manager Contact +1507-452-4232 Send a Message Winona, MN Image Hallie Schulz Visitor Services Manager Contact +16087792392 Send a Message Area WI Onalaska , WI Other General Contacts Wendy Woyczik Winona District Manager 507-452-4232 wendy_woyczik@fws.gov Timothy Miller La Crosse District Manager +1608-779-2385 tim_a_miller@fws.gov Kendra Pednault McGregor District Manager +1608-326-0515 ext112 kendra_pednault@fws.gov Ed Britton Savanna District Manager 815-541-4598 ed_britton@fws.gov Upper Mississippi River National Wildlife and Fish Refuge uppermississippiriver@fws.gov Location and Contact Information Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.fws.gov/refuge/wallkill-river/contact-us",
      "text": "Wallkill River National Wildlife Refuge | Contact Us | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Wallkill River National Wildlife Refuge Image Details Collaboration Takes Flight: Waterfowl Hunting Workshop at Wallkill NWR Image Details Image Details Image Details Wallkill River National Wildlife Refuge About Us What We Do Projects & Research Law Enforcement Laws & Regulations Contact Us Visit Us Activities Trails Rules & Policies Get Involved Events News Library Species Map https://www.facebook.com/WallkillRiverNWR Contact Us Mailing Address Lenape National Wildlife Refuge Complex 1547 Route 565 Sussex, New Jersey 07461 General e-mail inquiries may be directed to anna_bisson@fws.gov Location and Contact Information Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.fws.gov/refuge/sherburne/get-involved",
      "text": "Sherburne National Wildlife Refuge | Get Involved | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Sherburne National Wildlife Refuge Image Details Fall colors on the Prairie's Edge Wildlife Drive by Bruce Ellingson Image Details Trumpeter Swan by Jim Dostal Image Details Beaver by Mark Nicholson Image Details Hooded Merganser by Bruce Ellingson Sherburne National Wildlife Refuge About Us What We Do Facility Services Law Enforcement Laws & Regulations Contact Us Visit Us Activities Locations Trails Rules & Policies Get Involved Events News Species Map Ways to Get Involved Whether you want to further conservation, learn more about nature or share your love of the outdoors, you’ve come to the right place. National wildlife refuges provide many opportunities for you to help your community by doing what you love. National wildlife refuges partner with volunteers, youth groups, landowners and neighbors to make a lasting difference. Find out how you can help make American lands healthier and communities stronger while doing something personally satisfying. Volunteering Discover for yourself what tens of thousands of volunteers have learned: Volunteering for the U.S. Fish and Wildlife Service is fun and rewarding in many ways. Learn new skills, meet new friends and enjoy a sense of accomplishment from doing your part to further wildlife conservation for the pleasure of generations to follow. Volunteering at Sherburne Our team of volunteers are the life energy of the refuge and their dedication, time and effort has an incredible impact on not only the refuge, but the community overall. The refuge has a robust volunteer program that continues to expand. Around 350 volunteers make large contributions to the following programs and activities annually: nature education, interpretation, wildlife observation, wildlife photography, maintenance, biology, habitat restoration, administration and more. Apply Here! Volunteer Application Interested in becoming a volunteer? Fill out the volunteer application and the Volunteer Coordinator will reach out within two weeks to set up an interview and orientation. Paper forms are available upon request. For questions, contact Jade Paulsen , Volunteer Coordinator. Thank you for supporting your national wildlife refuge national wildlife refuge A national wildlife refuge is typically a contiguous area of land and water managed by the U.S. Fish and Wildlife Service  for the conservation and, where appropriate, restoration of fish, wildlife and plant resources and their habitats for the benefit of present and future generations of Americans. Learn more about national wildlife refuge ! Already a volunteer? Log-in to your Volgistics Profile Who can be a volunteer? YOU! Our volunteer team welcomes you to join us! The refuge has incorporated many volunteers through the national Retired Senior Volunteer Program locally based in Elk River, MN. Youth under 18 may volunteer for certain positions given signed permission by their parents or guardians on the Volunteer Services Agreement form. See below for more information on current volunteer roles. Maintenance Check hiking trails for litter, obstructions or repair. Clean up litter at kiosks, fishing areas, canoe access points and parking lots. Adopt a Refuge Road! Perform mowing, weed whipping and invasive species invasive species An invasive species is any plant or animal that has spread or been introduced into a new area where they are, or could, cause harm to the environment, economy, or human, animal, or plant health. Their unwelcome presence can destroy ecosystems and cost millions of dollars. Learn more about invasive species removal. Complete carpentry projects and repairs. Become certified on certain heavy equipment to assist with maintenance projects (must volunteer for at least one year before moving into this role). Interpretation, Events and Community Outreach Become a “Roving Wildlife Interpreter” and interact with visitors on the Prairie’s Edge Wildlife Drive. Represent the refuge at community events and festivals. Assist at annual refuge events, including Wildlife Festival! Lead guided tours and programs for the public on a range of topics. Donate your wildlife photography and videography skills. Nature Education Help with school programs at the refuge or at local schools. Work with students from neighboring communities. Assist or lead programs for visiting groups. Learn about the \"Compass to Nature.\" Engage your sense of wonder! Administration Greet and welcome visitors to the refuge. Research and compile information. Answer and direct phone calls. Biology Join our seed collector team and enhance your knowledge of native wildflowers. Help with habitat restoration projects. Early riser? Perform bird surveys with our biology staff. Monitor water quality of the St Francis River and wetlands throughout the refuge. Our Partners Nature does not recognize human-made boundaries. In order to conserve our natural and cultural resources effectively, we must work with others to bridge these boundaries. Partnerships foster creative solutions to challenging situations and often the results are greater than the sum of the parts. Learn more about our local partners. Friends of Sherburne National Wildlife Refuge The Friends of Sherburne National Wildlife Refuge is a grassroots nonprofit organization with a single purpose: to nurture an appreciation for, and the conservation of, Sherburne National Wildlife Refuge. They work toward an intergenerational community of active stewards who conserve, protect and support the unique natural resources at Sherburne National Wildlife Refuge and the National Wildlife Refuge System. The Friends organization exists to support events and interpretive and educational programs at the refuge. They are managed by a board of directors and guided by a set of strategic pillars: education, advocacy, volunteerism and sustainability. Friends of Sherburne National Wildlife Refuge Outreach Refuge volunteers and staff members may be available to come and speak to your group. Programs are available on a variety of topics concerning the refuge, careers, plants and animals living in the area, or other topics. Education Programs Open the door to a potentially life-changing experience. If you land a student internship, a fellowship or a volunteer opportunity at a national wildlife refuge national wildlife refuge A national wildlife refuge is typically a contiguous area of land and water managed by the U.S. Fish and Wildlife Service  for the conservation and, where appropriate, restoration of fish, wildlife and plant resources and their habitats for the benefit of present and future generations of Americans. Learn more about national wildlife refuge , fish hatchery or other U.S. Fish and Wildlife Service site, you’re bound to come away with new insights and excitement about conservation. Depending on the year, the refuge hosts one to three internships, spanning visitor services, biology and management. Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    },
    {
      "url": "https://www.fws.gov/refuge/crystal-river/get-involved",
      "text": "Crystal River National Wildlife Refuge | Get Involved | U.S. Fish & Wildlife Service Skip to main content U.S. Fish & Wildlife Service Toggle navigation Utility (Top) navigation About Us Forward Back About Us Mission & Vision Leadership Our Organization Our Facilities Regions Laws & Regulations Forward Back Laws & Regulations Laws, Agreements & Treaties Hunting Regulations FWS Federal Register Documents Library Forward Back Library Categories Collections Home Services Forward Back Services Duck Stamps Forward Back Duck Stamps Buy a Duck Stamp or E-Stamp Buy a Junior Duck Stamp Fish Stocking Importing & Exporting Consultation & Technical Assistance Forward Back Consultation & Technical Assistance ESA Section 7 Consultation Habitat Conservation Planning (HCPs) Candidate Conservation Agreements Conservation Banking Conservation Benefit Agreements Coastal Barrier Resources Act Project Consultation Coastal Barrier Resources System Property Documentation Financial Assistance Species Management Investigational New Animal Drugs (INADS) Permits Search All Services Duck Stamps One of the easiest ways that anyone can support bird habitat conservation is by buying duck stamps. Species Forward Back Species Explore Taxonomic Tree Find a Species Interest story Bats: “The Coolest Mammals on Earth” Visit Us Forward Back Visit Us Events National Fish Hatcheries National Wildlife Refuges Outdoor Recreation Recreation Passes Locations Scenic Drives Tour routes of great scenic drives on National Wildlife Refuges. Get Involved Forward Back Get Involved Careers and Internships Volunteering Friends Partnerships Learning Opportunities Education Programs Events Partnerships Forward Back Partnerships Partnership Categories Partner List Volunteer Search for volunteer opportunities around the country Newsroom Forward Back Newsroom Press Releases Congressional Testimony Media Contacts Wild Things News about wonderful wild things and places Initiatives Forward Back Initiatives Combating Wildlife Trafficking Director's Priorities Climate Change Fishing Invasive Species Pollinators Protecting Wildlife Protecting Wildlife Working with others to conserve, protect, and enhance fish, wildlife, plants, and their habitats. I want to Forward Back I Want To Report Wildlife Crime Do Business with FWS Volunteer Find a Job or Internship Visit a Refuge Buy a Duck Stamp Apply for a Permit Find Funding Find Training Wild work Search employment opportunities with USFWS Search Search Search Enter the terms you wish to search for. × Crystal River National Wildlife Refuge About Us What We Do Projects & Research Law Enforcement Contact Us Visit Us Activities Trails Rules & Policies Get Involved Events News Library Map https://www.facebook.com/CrystalRiverComplex Crystal River National Wildlife Refuge Ways to Get Involved Whether you want to further conservation, learn more about nature, or share your love of the outdoors, you’ve come to the right place. National wildlife refuges provide many opportunities for you to help your community and wildlife by doing what you love. National wildlife refuges partner with volunteers, youth groups, landowners, neighbors and residents of urban and coastal communities to make a lasting difference. Find out how you can help make American lands healthier and communities stronger while doing something personally satisfying. Volunteers : Gain new experiences and meet new people while helping to advance wildlife conservation. Friends : Join neighbors in helping refuges restore habitat and expand access to green space. Many choose to join our Friends Group which is dedicated to supporting the Refuges mission, promoting conservation ethics, education, and encouraging responsible utilization of the Refuge Complex. Landowners : Learn how you can partner with the Fish and Wildlife Service to voluntarily restore land. Local Groups: Find out how communities can work with refuges better for wildlife and people. Youth : Explore paid and unpaid opportunities to learn and develop leadership skills. Volunteering Discover for yourself what tens of thousands of volunteers have learned: Volunteering for the U.S. Fish and Wildlife Service is fun and rewarding in many ways. Master new skills. Meet new friends. Make a difference by doing your part to further wildlife conservation for generations to follow. The Crystal River National Wildlife Refuge offers four unique volunteer opportunities. Part-time volunteer positions and resident volunteer opportunities are available each year. Image Details Current Needs The refuge complex is looking for volunteers to assist in the winter season and year-round operations. The duties include, but are not limited to: Visitor Services Staffing refuge Visitor Center; assisting with clerical duties; serving as a roving interpreter on boardwalk and trails; participating in refuge Education and Outreach events; assisting staff with special events. Manatee Watch Monitoring manatee aggregation areas where human recreation occurs. Monitoring most manatee areas requires operating a non-motorized vessel (kayak, paddle-board, canoe) without direct staff supervision. Maintenance Maintaining refuge grounds and facilities (roads, trails, boardwalk, buildings); maintaining manatee sanctuary buoys; signage; special projects. What Training is Required? For most positions, volunteers need no special skills other than the ability to work by themselves, and with others, and enthusiasm for the refuge. Volunteers will be trained. Generally, training is scheduled throughout the year and presented by key staff and other professionals to enhance a volunteer’s knowledge and skills. What's my Commitment? Part-Time Volunteers: The amount of time that you wish to volunteer is up to you although we prefer you dedicate 4 hours per week as it is a commitment. Volunteers may work full-time, a few hours per week or month, or even during a particular season. Resident Volunteers (Workcampers): These positions are typically for winter (Oct 1st – March 31) resident couples living in an RV. Exceptions on the use of our bunkhouse, and single resident volunteers, are under the discretion of the refuge manager. This opportunity requires volunteers to perform multiple duties, but are not limited to the volunteer areas described above. Volunteers should plan to commit to a minimum of six months (October – March). Volunteers will work a schedule of three eight-hour days per person for a total of 24 hours per week (per person). Accommodations The refuge has twelve, full hook-up trailer pads, located off HWY 19 in Homosassa. Each site has water, electricity, (50 amp, 220v hook-up), sewer, a cement slab and picnic table. Laundry facilities and a large refrigerator are located in the fenced-in site as well. To Apply For more information about the Crystal River NWR Complex and its volunteer opportunities contact crystalriver@fws.gov or (352)563-2088. Our Partners Nature does not recognize human-made boundaries. In order to conserve our natural and cultural resources effectively, we must work with others to bridge these boundaries. Partnerships foster creative solutions to challenging situations and often the results are greater than the sum of the parts.  Learn more about our local partners. Friends of the Crystal River National Wildlife Refuge Complex Florida Fish and Wildlife Conservation Commission City of Crystal River Southwest Florida Water Management District University of Florida U.S. Geological Survey Education Programs Several environmental education programs are offered to schools and other education organizations on a limited basis. If you wish to coordinate an environmental education program with the refuge, please contact crystalriver@fws.gov or (352)563-2088 . Image Details Working with others to conserve, protect and enhance fish, wildlife, plants and their habitats for the continuing benefit of the American people. Footer Menu - Employment Careers & Internships Contracting Footer Menu - Site Links Leadership Frequently Asked Questions Contact FWS Footer Menu - Legal Accessibility Freedom of Information Act Notices Privacy Policy Disclaimers Information Quality Vulnerability Disclosure Policy Footer Menu - External Links DOI USA.GOV"
    }
  ]
}