{
  "fuentes": [
    {
      "url": "https://www.gametime.com/about-us/gametime",
      "email": "info@gametime.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.news-journalonline.com/story/business/briefs/2018/03/29/gametime-at-one-daytona-targets-early-summer-opening/12792426007/",
      "email": "clayton.park@news-jrnl.com"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "shaun.f@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "anna@rrmc-sandton.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "chyvan.m@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "grant.b@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "info@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "jason.d@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "jason@astonmartin.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "jody.h@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "john@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "jolene.vr@astonmartin.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "macha.m@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "manoj.m@daytona.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "mapule.k@rrmc-johannesburg.co.za"
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "email": "tiisetso.b@daytona.co.za"
    },
    {
      "url": "https://www.daytonanetworks.com/contact/",
      "email": "info@daytonanetworks.com"
    },
    {
      "url": "https://www.daytonabeach.com/listings/gametime/2001/",
      "email": "events.daytona@gametimeplayers.com"
    },
    {
      "url": "https://www.ticketor.com/gametime/contactus",
      "email": "gametime@ticketor.com"
    }
  ],
  "mails": [
    "anna@rrmc-sandton.co.za",
    "chyvan.m@daytona.co.za",
    "clayton.park@news-jrnl.com",
    "events.daytona@gametimeplayers.com",
    "gametime@ticketor.com",
    "grant.b@daytona.co.za",
    "info@daytona.co.za",
    "info@daytonanetworks.com",
    "info@gametime.com",
    "info@reception-plus.de",
    "jason.d@daytona.co.za",
    "jason@astonmartin.co.za",
    "jody.h@daytona.co.za",
    "john@daytona.co.za",
    "jolene.vr@astonmartin.co.za",
    "macha.m@daytona.co.za",
    "manoj.m@daytona.co.za",
    "mapule.k@rrmc-johannesburg.co.za",
    "shaun.f@daytona.co.za",
    "tiisetso.b@daytona.co.za"
  ],
  "nombre_sitio": "gametimeplayers.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.gametime.com/about-us/gametime",
      "text": "About Us - Our History and Heritage of Play Since 1929 The store will not work correctly when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. Skip to Content Sign In 800-235-2440 Find a Rep Get a Catalog About us Get a Quote Contact Us Toggle Nav Menu PRODUCTS PLAYGROUNDS SHOP Expression Swing SHOP GT Wave Product Lines ECHO Expression Swing ® Modern City ® PowerScape ® PrimeTime ® TotStuff ® VistaRope Xscape ® Play Systems All Play Systems Ages 0-2 (Toddler) Ages 2-5 (Little Kids) Ages 5-12 (Big Kids) Under $35,000 $35,000 - $75,000 Over $75,000 Systems on Sale System Components Access & Connectors Climbers Decks Entrys & Archways Integrated Shade Links Panels & Enclosures Roofs & Toppers Seating Slides Freestanding All Freestanding Climbers Inclusive Music Nature & Other Themes Preschool Ropes & Nets ShadowPlay ® Slides Spinning & Rocking Swings Zip Track & Zip Line Products All Play Products Ages 0-2 (Toddler) Ages 2-5 (Little Kids) Ages 5-12 (Big Kids) Inclusive New & Featured Price Sale Themes FITNESS SHOP Compact Fitness SHOP Obstacle Courses Product Lines Challenge Course GTfit ® KidCourse ® Stadium ® THRIVE ® THRIVE ® Studio Fitness Systems All Fitness Systems Compact Systems Integrated Shade Obstacle Courses Youth Fitness Activity Type All Fitness Components Aerobic Fitness Balance Core Strength Flexibility Muscle Strength Obstacles Therapeutic Products All Fitness Products Ages 5-12 (Big Kids) Ages 13+ (Teens-Adults) Inclusive New & Featured Price AMENITIES SHOP Playground Shade SHOP Park Furnishings Product Lines GTImpax ® Surfacing Salora Shelters Sunblox Shades StreetScapes ® Site Furnishings By Type All Amenities Benches Bike Racks Grills Litter Receptacles Picnic Tables Shade Structures Shelters Site Furnishings Sports Equipment Surfacing Filter Products All Amenities New & Featured Price Sale Themes SALE SHOP Quick Ship SHOP Outlet Store Explore Savings All Sale Items Outlet Store QuickShip Play Systems EXPLORE SOLUTIONS EXPLORE Inclusive Designs EXPLORE Park Playgrounds By Market Churches and Faith Centers Housing and HOA's Parks and Recreation Preschool and Daycare School Playgrounds By Category Affordable Playgrounds Custom Playgrounds Inclusive/Universal Design Landscape Architecture Outdoor Fitness Spaces MEDIA GALLERIES EXPLORE Environments EXPLORE Projects Photos by Market Day Care/Preschool Faith/Worship Center Housing Developments Landscape Architects Parks Schools Photos by Project Type Budget-Friendly Custom and Themed Inclusive Outdoor Fitness Playground Videos by Category Custom Designs Featured Products Inclusive Play Outdoor Fitness School Playgrounds RESOURCES DESIGN DOWNLOAD CAD Files EXPERIENCE Color Wizard Design Tools CAD Downloads Catalogs Colors and Palettes Color Wizard Construction Guide Landmark Design Playground Planning 101 Need more help? Call, text or email us directly.\r\n(800)-235-2440\r\ninfo@gametime@gmail.com Different by Design DirectBolt® Expression Swing® Outdoor Obstacle Courses Playground Towers Need more help? Call, text or email us directly.\r\n(800)-235-2440\r\ninfo@gametime@gmail.com Design Ideas Creating Intergenerational Spaces Designing Playgrounds on a Budget Planning an Outdoor Fitness Park Need more help? Call, text or email us directly.\r\n(800)-235-2440\r\ninfo@gametime@gmail.com RESEARCH DISCOVER Inclusive Design EXPLORE Playground Maintenance CORE About CORE National Demonstration Sites Professional Development Best Practice Design Inclusion Nature Play Outdoor Fitness Parks Playful Trails Youth Physical Activity Curriculum 2Play Together Natural Harmony Play On! Advocacy & Planning Intergenerational Play Playground Maintenance Playground Supervision Power of Urban Play Safety Surfacing Words on Play FUNDING FIND YOUR Funding IMPACT Parks Find the Funds You Need Budgeting for a Playground Impact Parks ® Playground Funding Guide PURCHASING SUBMIT Contracts BUY WITH Omnia Partners Purchasing Assistance Apply for Credit Contract Submission OMNIA Partners Account 800-235-2440 Find a Rep Get a Catalog About us Get a Quote Contact Us Request info 0 Search Search Search Submenu About GameTime Committed to building communities through play and recreation since 1929 We’re Play Innovators, Play Experts and Play Researchers. GameTime brings play and recreation to people of all ages and abilities. Our local, experienced, and trusted team deploys research-based programs and education to deliver the most tailored play and recreation environments in the world. Since 1929 Our History of Enriching Childhood Through Play From the beginning, GameTime has demonstrated our passion for play with fun and innovative products that bring people together around recreation. Check out some of the key moments in our history. 1929 - Founded in Litchfield, Michigan 1975 - Introduced the first line of custom playground equipment 1979 - Moved to Fort Payne, Alabama 1982 - Introduced Durascape, the first metal composite play systems 1993 - PowerScape play systems are introduced 2011 - Making trails more playful with PlayTrails 2014 - Expression Swing changes the way children and parents play 2015 - Expanding outdoor fitness to all generations with Challenge Course 2020 - GameTime's custom play division becomes Landmark Design 2022 - GameTime introduces the first inclusive playground net - GT Wave Local Play Experts GameTime representatives and certified installers live, work, and play in your neighborhood. We provide turnkey, personal service throughout all phases of your play and recreation projects to ensure your playground, fitness park, Challenge Course, or one-of-a-kind custom play space is a community centerpiece. FIND A LOCAL REP Play Researchers As a PlayCore company, GameTime leverages the deep knowlege of the PlayCore Research Institute. The Institute is comprised of leading experts, universities, and research centers who work with PlayCore to investigate, discover, and communicate information and outcomes in scholarly works and outreach workshops. This research drives our product development and playspace design. LEARN MORE Green by Design Responsible play environments begin with a commitment to our environment. Environmental sustainability is our commitment to the children, families, and communities we serve today– and to many generations to come. That’s why our approach to sustainability encompasses every aspect of our company– from the way we manufacture our products, to how we do business. LEARN MORE The Industry’s Best Warranty Our products are constructed of durable, recyclable materials that are designed to last decades, not years. Each play system, fitness product, and freestanding activity is backed one of the industry’s leading warranties, and we offer a high level of customer service long after the project is completed. Our guarantee to you goes beyond replacement hardware and touch-up paint- our guarantee is to be a trusted partner in outdoor play and recreation for years to come. LEARN MORE GameTime Certifications Industry standards set a minimum level that playground manufacturers must meet. We meet or exceed those standards, because we understand that the ultimate playground offers peace of mind as well as thrills. After all, we’re parents too. LEARN MORE News from GameTime Check out the latest news and information from our headquarters in Fort Payne, Alabama. Read All News June 19, 2025 GameTime Q1 Product Recap: Strides in Intergenerational Play The first few months of 2025 have been filled with bold and exciting new products! From towering rope climbers to playfully themed early childhood products, 2025 is shaping up to be a year filled with new ways to make every playground more memorable, inspiring, and fun for everyone. Let’s take a look at the new products people are excited about! Aventus Collection and Inclusive Play Following the success of the Aventus Tower, we introduced the expanded Aventus collection , offering a variety of climbers and entryway options to enhance your Aventus designs. One of the foundational principles of Aventus is to create “Adventure for all of us” and offer new ways to include everyone in the fun. Everybody Plays ® Slide and Go A great addition to Aventus play systems is the EveryBody Plays Slide and Go . When you add this innovative slide to your playground design, you create more accessible opportunities. This slide allows children using mobility devices to comfortably transfer from the Read Article April 10, 2025 New Shelter Options: Introducing Salora Shelters by GameTime At GameTime, we’re always finding new ways to bring communities together through thoughtfully designed outdoor spaces. That’s why we’re excited to introduce Salora park and playground shelters - a new line of recreational shelters that blend timeless design with modern performance. With Salora shelters, it’s easier than ever to create inviting, functional spaces where people can gather, connect, and enjoy the outdoors. Why Are Park and Playground Shelters Important? Park shelters enrich outdoor experiences by creating spaces where people can rest, reflect, and reconnect. Whether hosting large community events or celebrating a child’s birthday, shelters offer a welcoming gathering place for every occasion. They also provide protection from the elements, encouraging people to stay outside, explore, and enjoy nature even longer. What Are Salora Shelters? Salora shelters are designed to provide shade, comfort, and style to parks, playgrounds, and outdoor recreation spaces. These structures Read Article March 13, 2025 How to Design a School Playground This year, the American Academy of Pediatrics reaffirmed their position that recess is essential for childhood development. Along with the many physical benefits associated with recess, the school playground is where social skills are learned, executive function improves, and children develop a sense of self. That’s a lot of responsibility for a school playground! Designing a school playground requires thoughtful planning to create a space where children can play, learn, and grow. For many children, school playgrounds are their primary place for outdoor play, providing essential opportunities to stay active, socialize, and unwind after a long day in the classroom. Read on to learn some of the ways you can design a school playground to support childhood development, encourage healthy habits, and foster a sense of community and connection for all students. Encourage Physical Activity on the School Playground with Play On!® Play On! is a physical education program developed by our parent Read Article Get a Quote for Customer Name Customer Email Phone Number Comment Submit Color Wizard™ Wield your wand and explore your options with our Color Wizard™ TRY NOW! Subscribe Sign up to receive the latest news and special offers from GameTime. SUBSCRIBE Follow Look for us on social media for updates and inspiration. linkedin youtube facebook (800) 235-2440 EMAIL GAMETIME PROUD PARTNER OF COMMUNITY CHAMPIONS SINCE 1929. We partner with you to create fun, innovative, and active outdoor spaces for a happier today and a healthier tomorrow. 150 PlayCore Drive SE Fort Payne, Alabama 35967 About Us Accessibility Statement Certifications Find a Rep Green by Design Installer Network Our Story Partnerships Play Research Products Amenities Fitness Playgrounds New Sale Resources Blog Catalogs Contact Credit/Financing Customer Survey Funding Privacy Policy Warranties FIND MY REPRESENTATIVE With play experts in over 30 countries on six continents, we provide sales and service where you live, work, and play. Wherever you are, we’re local! FIND A REPRESENTATIVE REQUEST A CATALOG View our selection of playground equipment, outdoor fitness products, and custom play space catalogs, and request a copy today. REQUEST A CATALOG © 2025 GameTime, a PlayCore Company. All rights reserved."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Datenschutz Surname E-Mail First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.news-journalonline.com/story/business/briefs/2018/03/29/gametime-at-one-daytona-targets-early-summer-opening/12792426007/",
      "text": "GameTime at One Daytona targets early summer opening News Sports Entertainment Opinion Advertise Obituaries eNewspaper Legals BRIEFS GameTime at One Daytona targets early summer opening Interior buildout finally underway for family entertainment center across from Speedway Clayton Park clayton.park@news-jrnl.com DAYTONA BEACH — To casual observers, construction of the long-awaited GameTime family entertainment center at One Daytona appears to have stalled. While much of the building remains hidden from view behind a temporary construction barricade adorned with images of bowling, a video game arcade and restaurant/sports bar, glimpses of the interior reveal a still bare concrete floor and unfinished interior. The project still seems a long way from being game-time ready, even though it was announced in late 2016 and was originally supposed to have opened this past fall. Not so, according to GameTime CEO Michael Abecassis, who says the 35,000-square-foot center is on track to open in a few months. \"We expect to be open for summer as kids get out of school,\" Abecassis said in a phone interview on Thursday. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Abecassis said his company recently began interior buildout after One Daytona's developer, International Speedway Corp., completed construction of the 35,000-square-foot standalone building's exterior. He attributed the need to delay the opening to \"the process of going from raw dirt to a finished process, which is a large undertaking.\" \"We're already well underway on the interior,\" he added. The South Florida-based chain will soon have competition: a Dave & Buster's family entertainment center is set to open this fall just two miles away at Tomoka Town Center, across from Tanger Outlets. Jeff Preston, executive vice president of North American Development Group, which is developing a 450,000-square-foot \"power lifestyle\" retail complex at Tomoka Town Center did not know the date for when Dave & Buster's will open, but wrote in a text message that, \"We expect the vast majority of tenants to be open in the fall. All have different opening dates.\" A spokesperson for the Dallas, Texas-based Dave & Buster's Entertainment Inc. did not respond to a request for comment. The public company (NASDAQ: PLAY) in its most recent quarterly earnings report in December stated: \"In fiscal 2018, we plan to open a total of 14 to 15 new stores. ... These openings will skew toward the large store format and existing markets for our brand.\" The closest Dave & Buster's locations currently are in Orlando and Jacksonville. The chain describes itself as an operator of arcade/restaurants \"centered around playing games and watching live sports and other televised events.\" Some of its older locations also include bowling. GameTime is a South Florida-based chain whose headquarters is in Davie. It has locations in Fort Myers, Miami, Tampa, Panama City and Sebring and is set to open a location in Ocoee, possibly as soon as next week, Abecassis said. The Daytona Beach location will be next up and will include more than 60 flat-screen televisions, more than 100 new and retro classic arcade games, prize machines, mini bowling, 12 full lanes of bowling and other attractions, as well as a full liquor bar and full-service restaurant, according to GameTime's website. The company last month posted job openings online for a general manager, game floor operations manager, restaurant manager, bar manager and assistant kitchen manager. Abecassis said his company has already filled some management positions for the Daytona Beach location. He said the location is expected to employ 160-180 workers when it opens, adding that his company will likely hold a job fair this spring. He added that while Dave & Buster's is in \"a similar category,\" he said the competitor's decision to also open a location in Daytona Beach, is \"nothing that we're worried about.\" One Daytona is an entertainment/shopping/dining complex across the street from Daytona International Speedway whose other tenants include the 12-screen Cobb Daytona Luxury Theatres movie theater, Bass Pro Shops, several restaurants including P.F. Chang's, several retail stores including Guitar Center, as well as a 105-room Fairfield Inn & Suites by Marriott. More restaurants and shops are expected to open in the coming months, as well as a 145-room Marriott Autograph Collection hotel called The Daytona, that is going up at Victory Circle. Abecassis said he has been visiting One Daytona at least once every other week to check on the progress of construction for his store. \"I was there on Monday,\" he said, adding, \"the original plan (for One Daytona) in terms of the tenants that will be next to us and the layout is exactly what they (ISC) said it would be. We're going to be one of the three big attractions, between the movie theater, Bass Pro and us.\" Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-journalonline.com. All rights reserved."
    },
    {
      "url": "https://daytona.co.za/pages/team",
      "text": "Team\n\n– Daytona Skip to content Close menu Collections Aston Martin Daytona Direct Lotus McLaren Pagani Rolls-Royce Koenigsegg Company About Team Events News Merchandise Finance Contact Inventory Current Inventory Past Inventory Log in Facebook Instagram Tumblr LinkedIn Cart Translation missing: en.cart.general.close Collections Aston Martin Daytona Direct Lotus McLaren Pagani Rolls-Royce Koenigsegg Company About Team Events News Merchandise Finance Contact Inventory Current Inventory Past Inventory Site navigation Finance Get in Touch Daytona: 011 301 7000 McLaren Johannesburg: 011 301 700 Aston Martin Johannesburg: 011 301 7000 Aston Martin Cape Town: 021 425 2007 Rolls-Royce Johannesburg: 011 301 7000 Log in Search Cart Search \"Close (esc)\" Home / Team Team Our dedicated highly trained team are passionate about the high-end automotive industry and with an unrivaled level of training and expertise can vastly enhance the customer experience from discovery to after purchase. We are intricately involved in every aspect of our business and pride ourselves on employing the most highly trained, dedicated and professional people within the high-end automotive and retail industries. Our direct involvement in our business is the secret of our success. We attach huge value to each employee’s contribution to our overall vision and objectives. Beyond our proven track record, we take pride in our persevering character and endless drive to be the best-of-breed in every aspect of business and life. Our team philosophy is to grow our people and businesses through passion, trust and sound business principles. CEO Justin Divaris Justin is an acclaimed entrepreneur and CEO of a multitude of high-end luxury brand corporations. Accustomed to operating in this space, he is constantly looking for new opportunities to expand the offering to this market. Over the past 25 years Justin has built a solid reputation as a supercar authority and trusted brand custodian. A reputation well-deserved considering the array of dealerships and extensive experience under his belt. Director Jason Danker 011 301 7000 John Whittle Dealer Principal john@daytona.co.za Puleng Ratau Aston Martin Johannesburg CRM Jolene Van Ree Aston Martin Marketing jolene.vr@astonmartin.co.za Rens Rademeyer Aston Martin Sales Manager Justin Steenkamp Aston Martin Sales Specialist 021 425 2007 Andrew Meyer General Manager Cape Town Johannesburg 011 301 7000 Jason Danker Managing Director jason.d@daytona.co.za Tiisetso Baloyi McLaren Sales Executive tiisetso.b@daytona.co.za Shaun Fourie Brand Specialist Shaun.f@daytona.co.za Johannesburg 011 301 7000 Jason Danker Managing Director jason.d@daytona.co.za Anna Koury Rolls-Royce Brand Manager anna@rrmc-sandton.co.za Grant Baben Rolls-Royce Sales Executive grant.b@daytona.co.za Mapule Khumalo Rolls-Royce CRM mapule.k@rrmc-johannesburg.co.za 011 301 7000 Devin King Sales Manager CPT/JHB Sheldon King Sales Executive Ronan King Sales Executive 011 301 7000 Jason Longtoft Service Manager Cape Town jason@astonmartin.co.za Jody Hin Service Manager Johannesburg jody.h@daytona.co.za info@daytona.co.za Colleen Slyper F & I DAYTONA MARKETING chyvan.m@daytona.co.za Chyvan Mahabeer Marketing Manager chyvan.m@daytona.co.za Explore Explore All collections Contact Affinity Partners Terms of Service Refund Policy PAIA Policy Privacy Policy Collections Collections Aston Martin Lotus McLaren Pagani Rolls-Royce Daytona Direct Koenigsegg Find Us Find Us Daytona shop 1 & 2 One on Whiteley, Whiteley Rd, Melrose Arch, Johannesburg 2196. OPERATING TIMES Mon – Fri: 08h00 to 17h00 Sat & Public Holidays: 09h00 – 13h00 Sun: Closed Facebook Instagram Tumblr LinkedIn Facebook Instagram Tumblr LinkedIn © 2025 Daytona. Store by Content Merchants \"Close (esc)\" × SIGN UP AND SAVE Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe Intensity. Driven. Explore Be Brave Explore Inspiring Greatness Explore Inspired by beauty & Science Explore For The Drivers Explore"
    },
    {
      "url": "https://www.daytonanetworks.com/contact/",
      "text": "How to Reach Us: Phone, Email, Chat, In Person 386-248-0000 support@daytonanetworks.com Client Portal Menu Home About Us Our 25 Year History Our Team Carreers Review Us Services Business IT Helpdesk Managed IT Services Cloud Solutions Business Phone Systems Networking CyberSecurity Repair Center / Storefront AI Integration Residential Home Networking Repair Center / Storefront Contact Us GET SUPPORT Menu Home About Us Contact Us Services GET SUPPORT Contact Us . Phone, email, chat or in person, we are here to help. 386-248-0000 info@daytonanetworks.com 144 South Beach St Daytona Beach, FL 32114 Mon-Thu :  9:00am - 5:30pm Friday : 9:00am - 5:00pm Online Chat During Normal business hours, we have online chat available in the bottom right hand corner of the website.  Click there anytime to ask questions, get support, or just say hi! Social Media Facebook Linkedin Youtube Message Us Inquiry Department* Sales Tech Support Accounting Other 144 South Beach Street Daytona Beach, FL 32114 386-248-0000 support@daytonanetworks.com Facebook Youtube Linkedin © Copyright 2000-2025 Net Works, Inc. IT Services IT Helpdesk Managed IT Services Hosted Voice PBX Networking Cloud Solutions Repair Center / Storefront Industries Hospitality Healthcare Legal Accounting Automotive Non-Profit & Religious Organizations Company About Us Careers IT Blog Make a Payment Privacy Policy Terms of Service Refund Policy Support Support Portal Create A Ticket Remote Support Input your search keywords and press Enter."
    },
    {
      "url": "https://www.daytonabeach.com/listings/gametime/2001/",
      "text": "GameTime | Daytona Beach, FL 32114 Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Virtual Tour Meetings Travel Trade Request FIT Rates Meet the Team Itineraries Districts & Neighborhoods Getting Here Media Gallery Virtual Brochures Sports Submit RFP Meet the Team Convention Center Sports Facilities Specialized Services Getting Here Event Funding Virtual Brochure Media Releases Gallery Media Visits Media Coverage Speakers Bureau Blog Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us Events All Events Featured Events Arts & Culture Racing Motorcycle Rallies Festivals & Music Sports Events Submit An Event Places to Stay Hotels Hotel Deals Vacation Rentals Condo Rentals Campgrounds & RV Parks Motels Bed & Breakfasts Pet-Friendly All Properties Things To Do Top 10 Reasons to Visit Attractions Racing Trails With Kids Outdoors Golf Beaches Water Activities Fishing Arts & Culture Shopping Free Things to See and Do Food + Drink Waterfront Dining Outdoor Dining Seafood Fine Dining Ale Trail Nightlife Plan About the Area Web Cam Weather Accessibility Travel Resources Blog Deals and Giveaways Social Gatherings Sustainable Travel Contact Us SEARCH SEARCH About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources Back View More 1 / 1 Share GameTime Address: 250 Daytona Boulevard, @ ONE DAYTONA, Daytona Beach, FL 32114 Phone: (386) 944-5495 Visit Website Email Share About Game Time is the ultimate destination for family entertainment at ONE DAYTONA offering 12 lanes of bowling, over 100 interactive arcade games and a full-service dining experience complete with patio seating and fire-pits for that extra special ambiance. \r\nEnjoy a delicious brunch, lunch or dinner and watch any game on over 60 HDTV’s throughout the full liquor sports bar. \r\nLooking for an exciting venue to host your next event? Game Time offers full banquet services and the perfect place to entertain your guests. Contact an Event Coordinator today to learn more! Map Amenities Business Continuity General CDC Recommended Cleaning Procedures: Hand Wash/Sanitizer Stations: Social Distancing Guidelines Enforced: Dining Outdoor Dining: Personal Protection Masks Provided: Masks Required-Guest: Masks Required-Staff: Meeting Facilities Facility Info Meeting Rooms Description GameTime at One Daytona is located across from the Daytona International Speedway and offers an unbelievable array of over 100 interactive arcade games, prize machines, full lane bowling and full banquet services. We cater to individuals as well as large groups by offering full events services to suit your needs. Our 35,000 sqft facility can accommodate groups ranging in size from 10 – 1,200. If you’re looking for something extra special, consider booking our full facility as your private playground. GameTime is the perfect backdrop for any group function including Corporate Events with Team Building, celebrations of all kinds, holiday parties, graduation parties, networking events and so much more! Contact an Event Specialist today to learn more: events.daytona@gametimeplayers.com Total Sq. Ft. 35000 Reception Capacity 1200 Space Notes GameTime has 2 x Private Rooms that accommodate 12, 24 or 36 guests seated and one semi-private glass enclosure that seats 24. With the Party Rooms opened up we can combine seating in the Restaurant, Sports Bar & Outside Patio for 300+. Reception style this space can accommodate 600. Throughout the full venue including the game floor and bowling lanes, we can accommodate 1200. Contact an Event Specialist today to schedule a walkthorugh: events.daytona@gametimeplayers.com Banquet Capacity 600 Number of Rooms 2 Venue Buy Out Reception Capacity: 1200 Banquet Room Banquet Capacity: 40 Reception Capacity: 50 View Our Destination Guide SIGN UP FOR OUR eNewsletter About Our Organization Halifax Area Advertising Authority Committees Market and Investor Research Newsletters Tourism Partner Resources Tourism Events Funding Filming in Daytona Beach Contact Sitemap Privacy Policy Accessibility Things to Do Beach Accessibility Dining Entertainment Venues Transportation Services Statement of Accessibility ADA Accessibility Feedback Form Partner Gateway Partner Resources © 2025 Daytona Beach Area CVB © 2025 Daytona Beach Area CVB"
    },
    {
      "url": "https://www.ticketor.com/gametime/contactus",
      "text": "CONTACT US | gametime | gametime Skip to main content High Contrast Accessibility Feedback Menu Navigation Empty Sign In / Sign Up User Menu Cookie Manager Is it Secure? Tickets My Tickets Print e-Tickets Return Tickets Exchange Tickets My Gift Cards My Seasons Passes Orders Order History My Account Balance Help FAQ Buy A Ticket Receive A Ticket Join our Newsletter Returns Policy Privacy & Cookie Policy Term of Use Term of Purchase TICKETS CONTACT US REVIEWS DONATION STORE gametime TICKETS CONTACT US REVIEWS DONATION STORE CONTACT US CONTACT US Contact gametime: We really care about our customers and we will reply to every message ASAP. If you have any questions or concerns about buying tickets or your purchased tickets, please fill the form and click 'Send Email' to send us an email. Frequently Asked Questions Search: Search • How do I know if my order went through? After placing a successful order, you should receive a confirmation number and/or confirmation email. You can also log in to your account and check \"User Menu > Order > Order History\" . • How can I print my tickets? When you complete the purchase, assuming that you have selected e-tickets as delivery method : You'll see the tickets on the confirmation page and can print them right away In your confirmation email, there is a link to the \"Print Tickets\" You can log in to your account and print tickets from \"User Menu > Tickets > Print Tickets\" . • I checked out as a guest and didn't create an account. Can I still login to manage, print or refund my tickets? Yes, click on the sign in button, enter the email you used for the purchase and you can claim your account by confirming your email address. • My credit card show a charge but I never received my tickets? Credit card dashboards often show Authorizations as charges and that confuses buyers. Authorization is not a charge and will go away automatically in a few days. A failed authorization means that the transaction was failed for some reason.  If you tried purchasing, but never received a confirmation number or confirmation email but you see a charge, that is most likely a failed authorization and not a charge. Before trying to purchase again, check \"User menu > Tickets > My Tickets\" to make sure your purchase did not go through. If your order has not gone through, you should try purchasing again. Your purchase is only successful when you see the confirmation page. • Why does my credit card show more than one charge for a single purchase? Am I double-charged? 1- Check \"User menu > Tickets > My Tickets\" to make sure your purchase went through only once. If you've made more than one purchase, you may want to return the duplicates. 2- If you've submitted your transaction with a wrong billing address, the AVS (address verification system, used by credit card processors to prevent fraud) will reject your payment but put a temporary hold on the amount, also known as \"authorization\". The authorization is not a charge and will drop off your statement in a few days. Check your statement again in a few days to confirm that the amount is gone. • Do I need to print my e-tickets, or can I just show on my phone? Most events accept mobile tickets, but some don't. Unless clearly instructed otherwise in the event information or the delivery method choices, you should try to print your tickets. • Can I change my ticket delivery method? Contact us right away, and we may be able to change your delivery method. • Can I change my seat or performance if I got the wrong tickets? If the exchange policy of the event allows exchanges or upgrades, you can use \"User Menu > Tickets > Exchange Tickets\" to exchange, upgrade or change the date of your tickets. If the return policy of the event allows returns, you can use \"User Menu > Tickets > Return Tickets\" to return your tickets for store credit and purchase a new set of tickets. Your store credit will be applied on the checkout page.your purchase went through only once. If you've made more than one purchase, you may want to return the duplicates. Otherwise, you can contact us. We may be able to exchange the tickets for you. • What if I didn't receive a confirmation email or invoice? First, check your spam folder. If the email isn't there, you've probably entered an invalid email address or are using a system that blocks our emails. To view, print, or receive the confirmation and email as an invoice, use the \"User menu > Orders > Order History\" and click on the icon for the invoice. • How do I sign in if I forgot my password? If you've entered the correct email address, you can simply reset your password. Click on the Sign In button, click Forgot Password, and wait a few minutes. You'll receive the password recovery code in your email, and you can then change your password. • I cannot sign in and I haven't gotten any emails (welcome email, order confirmation, password recovery) from you. What should I do? You've probably signed up with a wrong email address or made a typo in your email address. Try to sign up again with the correct email address. • I purchased Refund Protection. How can I file a claim? Refund protection is offered through XCover, an independent, 3rd party company. All claims and refunds should be processed directly and solely through XCover. We are not in any way involved or responsible in the refund protection process. Should you need to file a claim, create an account on https://www.xcover.com/en/login with the same email address that you used to purchase the tickets and file your claim online. If you have any questions or concerns, contact XCover.com  directly as XCover, and not the website you purchased tickets from, is solely in charge of the claims and refund protection. All the information that you need to file a claim with XCover is included in your sales confirmation email and you can access them again from the 'Order History' menu. Contact: gametime Your Name: * Email Address: * Email address is not valid Phone Number: * Phone number is not valid. Subject: * Message: Send Email Ticketing and box-office solution powered by: Ticketor (Ticketor.com) Ticketor reviews and ratings powered by TrustedViews.org Powered by Ticket or Ticketing and box-office system by Ticketor Efficient Night Club & Bar Ticketing Software – Easy Setup Build your own online box-office. Sell tickets on your own website. © All Rights Reserved. 67.225.221.40 Terms of Use Your computer time or time zone is not set properly. Set the time before you can login! We just sent an email to: . Check your email and the spam folder to get the code we sent you, then enter it here and choose a new password. We just sent an email with the verification code to your email: . Check your email and the spam folder to get the code we sent you, then enter it here to confirm your login. We just sent an email with the verification code to the administrator(s) email. Please contact any of the site administrators for assistant with your login. Sign in or sign up, so you can manage and print your tickets at any time. Login with Google Signup with Google New user? Sign up Have an account? Sign in Email: Go You will receive order confirmation, order status, tickets & announcements at this email. Enter the code from your email: First Name: Last Name: Cell Phone: We may need to text or call you in regards to the event or your account. Newsletter Preference: Keep me updated about new events & promotions by email and text (Join mailing list) Keep me updated about new events & promotions by email (Join mailing list) I don't want to join the mailing list We never spam you and you can always unsubscribe easily by clicking on the link at the footer of any email. By choosing this option, you acknowledge and give your explicit consent to be contacted via SMS and receive emails for various purposes, which may include marketing and promotional content, and this agreement isn’t a condition of any purchase. Message and data rates may apply. Message frequency may vary. Reply STOP to opt out. Refer to our Privacy Policy for more information. I am over 18 years old and have read, fully understood and agreed to the terms of use and the privacy and cookie policy . Cookie Manager Enter password to log in or checkout as guest Choose a password or checkout as guest Password: Enter a new password: Minimum 5 characters. Choose a strong password to protect your account. Forgot password? Log In Agree & Continue Set a password so you can access the account. Set a Password OR No account needed. You can claim your account later by confirming your email. No login needed. You can checkout as a guest. Checkout as Guest Send the Email again Reset Password & Sign in Email the code again Log In Remember me on this computer This is a personal device. Don't challenge me on this device again."
    }
  ]
}