{
  "fuentes": [
    {
      "url": "https://artsgarage.org/get-in-touch/",
      "email": "info@artsgarage.org"
    },
    {
      "url": "https://artsgarage.org/get-in-touch/",
      "email": "mackay@newhavenfuneralsnq.com.au"
    },
    {
      "url": "https://downtowndelraybeach.com/artandjazz",
      "email": "dda@downtowndelraybeach.com"
    },
    {
      "url": "https://downtowndelraybeach.com/artandjazz",
      "email": "dmorien@downtowndelraybeach.com"
    },
    {
      "url": "https://garlicfestfl.com/contact/",
      "email": "bern@festivalmanagementgroup.com"
    },
    {
      "url": "https://artsgarage.org/board-of-directors/",
      "email": "info@artsgarage.org"
    },
    {
      "url": "https://artsgarage.org/board-of-directors/",
      "email": "mackay@newhavenfuneralsnq.com.au"
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "email": "cmaoffice@countrymanors.net"
    },
    {
      "url": "https://artsgarage.org/",
      "email": "info@artsgarage.org"
    },
    {
      "url": "https://artsgarage.org/",
      "email": "mackay@newhavenfuneralsnq.com.au"
    },
    {
      "url": "https://macfineart.com/areas-we-serve/fine-art-gallery-at-atlantic-avenue/",
      "email": "info@macfineart.com"
    },
    {
      "url": "https://www.delraylibrary.org/contact/",
      "email": "reference@delraylibrary.org"
    },
    {
      "url": "https://delrayarttrail.com/galleries-cultural-arts/",
      "email": "directormgatto@downtowndelraybeach.com"
    },
    {
      "url": "https://delrayarttrail.com/galleries-cultural-arts/",
      "email": "mgatto@downtowndelraybeach.com"
    }
  ],
  "mails": [
    "bern@festivalmanagementgroup.com",
    "cmaoffice@countrymanors.net",
    "dda@downtowndelraybeach.com",
    "directormgatto@downtowndelraybeach.com",
    "dmorien@downtowndelraybeach.com",
    "info@artsgarage.org",
    "info@macfineart.com",
    "mackay@newhavenfuneralsnq.com.au",
    "mgatto@downtowndelraybeach.com",
    "reference@delraylibrary.org"
  ],
  "nombre_sitio": "garlicfestfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://artsgarage.org/get-in-touch/",
      "text": "Get in touch - Arts Garage About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List 94 NE 2nd Ave Delray Beach, FL 33444 561-450-6357 info@artsgarage.org facebook twitter instagram youtube linkedin About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List Search Phone 561-450-6357 Menu Get in touch Home Get in touch Address 94 NE 2nd Ave. Delray Beach, FL 33444 Box Office Hours Tuesday – Saturday, 1pm – 5pm and during performance hours Box Office Phone 561-450-6357 Email Address info@artsgarage.org Contact Us Arts Garage is a 501(c)(3) non-profit organization Quick Links Home About Tickets Employment Classes Get in Touch Accessibility Hotels Media Advocacy Bar Menu Contact Us Location 94 NE 2nd Ave Delray Beach, FL 33444 Call box office 561-450-6357 Box office hours Tuesday – Saturday, 1pm – 5pm and during performance hours Let's Connect © 2025 Copyright Arts Garage error: Content is protected !! Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://downtowndelraybeach.com/artandjazz",
      "text": "CANCELLED: Art & Jazz on the Avenue | Downtown Delray Beach Skip to main content Join us on Business Login Find Your Fun Stay Things to Do Dine Shop Happy Hour Getting Around Events About Us Search a listing Categories Stay Arts & Culture -- Art Galleries, Studios & Antiques -- Museums & Nature Centers -- Theaters & Performing Arts Beauty and Wellness -- Beauty & Spa -- Fitness -- Health & Wellness ---- Chiropractors ---- Counseling ---- Cosmetic/plastic surgeons ---- Dentists ---- Medical massage therapy ---- Optometrists ---- Other therapies ---- Periodontist ---- Podiatrist Entertainment Things to Do Other Services -- Alterations & Cleaners -- Catering -- Education -- Banks -- Business/Marketing Consultants -- Developer -- Financial -- General Contractors -- Home Care -- Housing Authority -- Interior Design -- Legal -- Marketing Agencies -- Matting and Framing -- Pharmacy -- Photography -- Place to Live -- Postal Services -- Realtors -- Sports Agency -- Travel Agent Parks and Nature Dine -- Bars -- Candy, Bakery, Coffee, Ice Cream -- Juice Bars -- Restaurants SHOP -- Arts, Crafts & Framing -- Beauty & Wellness Products -- Books and Music -- Clothing & Accessories -- Consignment -- Convenience Store -- Florist -- Furniture, Home & Garden -- Jewelry -- Markets -- Office Supply & Greeting Cards -- Pets & Grooming -- Shoes -- Specialty -- Wine, Liquors & Cigars Weddings and Celebrations Parking Locations Beachside Pineapple Grove Arts District SOFA (South of Atlantic) The Ave The Set (West Atlantic) US1 Search CANCELLED: Art & Jazz on the Avenue East Atlantic Avenue: Swinton to NE 5th Avenue, Delray Beach, FL 33444 561-243-1077 Email Events Description (CANCELLED: TO BE RESCHEDULED) Art & Jazz on the Avenue is our signature outdoor street event in Downtown Delray with live music, live mural art, kids activities and dancing and dining in the street. Art & Jazz occurs several times throughout the year. It embodies the energy and vibe of our Village by the Sea! DATE: Wednesday, September 10, 2025 TO BE RESCHEDULED TIME: 6:00pm - 9:30pm WHERE: East Atlantic Avenue (From Swinton to NE 5th Avenue) Due to the severe weather this week and Wednesday's forecast, we’ve made the tough but right call to cancel Art & Jazz. Don’t worry...stay tuned, because we’ll be rescheduling the biggest Art & Jazz event of the year! Downtown Delray Beach’s East Atlantic Avenue , stretching from Swinton Avenue to NE 5th Avenue, is the heart of the city’s vibrant social and cultural scene. This lively corridor blends coastal charm with cosmopolitan energy, offering a walkable mix of local boutiques, stylish salons, lively restaurants, and buzzing cafés. Stroll beneath swaying palms and discover everything from artisan coffee shops and fashion-forward retailers to curated art galleries and wine bars. The area is home to beloved dining destinations like City Oyster , Rocco’s Tacos , The Office , Elisabetta’s , Caffe Luna Rosa , and Dada , known for its whimsical setting and creative menu. You’ll also find popular sweet spots like Gelato & Co. and Sloan’s Ice Cream . East Atlantic Avenue is also a hub for events and nightlife, with live music venues, cocktail lounges, and a festive atmosphere that carries from day to night. With proximity to the beach and the iconic Colony Hotel , Downtown Delray offers an ideal mix of relaxation, entertainment, and coastal flair—all in one walkable district. LIVE MUSIC, MURAL ARTISTS, SHOP AND EAT LOCAL WITH VENDORS: STAGE 1 - SE 2 nd Ave 5:30 – 7:00 – The Kittens (Jazz) 7:00 – 9:30 – Joe Freer Band (Jazz) STAGE 2 – SE 4 th Ave 5:30 – 7:00 – Signal Duo (Jazz) 7:00 – 9:30 – FM Band (Party Band) Other Live Performances taking place in Downtown: LOCATION 1 – Inside Tin Roof 7:00 – 9:30 – Krush Company (Motown/ Funk/ Top 40 Party Band) LOCATION 2 – NE 1 st Ave 5:30 – 7:00 – Delray Drum Circle LOCATION 3 – Inside Johnnie Browns 6:00 – 9:30 – The Flyers (Rock Band) MURAL ARTISTS - Golden 305 - IG: Golden305 Mars - IG: Sick_qirl The Delray Beach Downtown Development Authority created Art & Jazz on the Avenue in the 1990's to bring people to Downtown Delray and showcase our unique, local businesses. We produce Art & Jazz several times a year in four different Downtown Delray neighborhoods: Pineapple Grove, East Atlantic Avenue and Beachside. PARKING : www.downtowndelraybeach.com/parking WANT TO BE A VENDOR? SIGN UP HERE We are specifically looking for artists and crafters to be vendors! Do you create handcrafted or hand painted art or other items? Then we would love to have you as a vendor at Art & Jazz on the Avenue! Cost is $125 - included in that price is the vendor fee, one 10 x 10 tent, one table, two chairs and a light! Contact Danielle Morien at dmorien@downtowndelraybeach.com with any vendor questions. Thank you to our DDA Partners: Interested in becoming a sponsor?  Contact us, dda@downtowndelraybeach.com When Wednesday, September 10, 2025 6:00pm - 9:30pm Contact Info East Atlantic Avenue Swinton to NE 5th Avenue Delray Beach , FL 33444 dda@downtowndelraybeach.com 561-243-1077 Photos Sign Up for DDA Updates First Name Last Name Email* Please verify your request* Submit Media Video Gallery Careers About Us Our mission is to grow, strengthen, and enhance the economic vitality of Downtown Delray Beach. As an autonomous agency of the City, the Delray Beach DDA advocates, facilitates, plans, and executes business development, fosters business relations, helps with the planning of public and private projects, and markets the downtown district. Contact Information 350 SE 1st Street ∙ Delray Beach, FL 33483 (561) 243-1077 Copyright © 2025 Downtown Delray Beach. All rights reserved. Privacy Policy Business Login Powered by VUP Media"
    },
    {
      "url": "https://garlicfestfl.com/contact/",
      "text": "Contact Information - South Florida Garlic Fest Follow Follow  12100 Forest Hill Blvd. Wellington FL.  Feb. 2, 2025 @ 11 AM – 6 PM  Feb. 1, 2025  @ 11 AM – 9 PM  Feb. 1, 2025 @ 11 AM – 9 PM  Feb.2, 2025 @ 11 AM – 6 PM  Wellington Amphitheater, 12100 Forest Hill Blvd Home Lineup Gourmet Alley Sponsors 2025 Sponsors 2025 Sponsor Opportunities Info About us Days & Hours What’s Allowed Inside Location, Directions, Parking & Map Commemorative Posters Beneficiaries & Volunteers Travel & Accommodations Awards ADA Info Media Photo Gallery Audio/Video Contact Exhibitors Official Merchandise Cookbooks The Clove Buy Tickets Now! BUY TICKETS NOW! Contact us OUR TEAM Delray Beach Arts, Inc. 140 NE 1st Street Delray Beach, FL 33444 Direct Number: (561) 279-0907 Bern Ryan Chief Financial Officer Email Bern 561-409-5687 Areas of operation: Finances, operations, logistics, site plan creation & revisions, exhibitors, food & beverage manager Jennifer Costello Associate Director Email Jen 561-279-0907 Areas of operation: Event production, sponsor fulfillment, backstage management, volunteer management Maria “Conchy” Cordero EXECUTIVE ASSISTANT & EXHIBITOR MANAGER (Para asistencia en español) Email Maria 561-409-5966 Areas of operation: Exhibitor contracts and payments, exhibitor placement and logistics South Florida Garlic Fest has won INTERNATIONAL AWARDS see more of our stinkin’ awards Get our Stinkin’ updates! Please Note: No Pets • No Coolers • No Outside Food or Beverages • No Refunds • All Bags are Subject to Search • No Knives, Guns or Weapons All sales are final. No refunds will be issued. Event is rain or shine. All sales are final and are valid for day of selected purchase Additional Questions? Click here to contact us. All personal information collected by the South Florida Garlic Fest is being lawfully and properly collected, stored and used by Festival Management Group. It will not be shared with any 3rd party. Privacy Statement Terms & Conditions Follow Follow © 2025 South Florida Garlic Fest Produced by Delray Beach Arts, Inc & Festival Management Group. Powered by RealTime ."
    },
    {
      "url": "https://artsgarage.org/board-of-directors/",
      "text": "Board of Directors - Arts Garage About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List 94 NE 2nd Ave Delray Beach, FL 33444 561-450-6357 info@artsgarage.org facebook twitter instagram youtube linkedin About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List Search Phone 561-450-6357 Menu Board of Directors Home Board of Directors Richard Lowenthal, Chair Dick Lowenthal has been a Jazz Educator for over 50 years. He was Chair and founder of the prestigious Jazz Department at the Manhattan School of Music and developed the Jazz Department at New Jersey City University, where he is a Professor Emeritus. He received a Bachelor of Music from the The University of Michigan and a Masters in Trumpet from the Juilliard School of Music. He was Vice-President of the International Association of Jazz Educators and chair of the National Music Council. As a performer Dick has played with Clark Terry, Bill Watrous, Mel Torme, Tony Bennett, Nancy Wilson, and Cher. He has conducted the Special Unit of the Glenn Miller Orchestra on tours of Japan, Poland, cruise ships, Presidential functions and the Tony Awards. Dick started the very successful Adult Education Program at Arts Garage that is called Jazz and Java. He became Chair of Arts Garage in October of 2023. Steven G. Rappaport, Vice Chair Steven G. Rappaport is an Equity Partner in the Community Associations Practice Group at Sachs Sax Caplan Law Firm. With extensive experience spanning over two decades, Mr. Rappaport handles transactional matters for the firm’s community association clients, including drafting amendments to governing documents, attending Board meetings and elections, handling covenant enforcement disputes, and providing opinions on all aspects of association issues. Admitted to the Bar in Florida in 2003 and in the District of Columbia in 2001, Steven obtained his J.D. from Georgetown University Law Center, where he actively contributed to esteemed legal publications. He graduated magna cum laude with a B.A. in Political Science from the University of Florida in 1998. In addition to his legal practice, Steven has served as a Board Member and Committee Chair for several organizations including the Palm Beach County Fair Housing and Equal Employment Board, South Palm Beach County Bar Association, and Community Associations Institute (CAI) Florida Legislative Alliance. Mark Burns, Secretary Mark Burns is the Chief Operating Officer at BlueIvy Communications, a Delray Beach-based boutique communications and public relations agency with offices in West Palm Beach and Delray Beach. Originally from Baltimore, Maryland, Mark moved to Delray Beach in 2014 and was the owner-operator of an Orangetheory Fitness Studio before joining BlueIvy in 2016. Mark is a member of the Impact 100 Men of Palm Beach County and Former Chair and current Advisory Committee member of WiseTribe. Mark is a co-founder of Delray Beach-basedrunning group, Pineapple Run Crew, and in 2022 served as the Volunteer Team Manager at the World Maccabi Games in Israel. He is also a member of the Greater Delray Beach Chamber of Commerce and the Palm Beach Chamber of Commerce. Combining his love of live music and the arts with a passion for improving the local community, Mark became a board member of the Arts Garage in 2023. Jack Varsalona, Treasurer Jack recently retired as President of Wilmington University in Delaware. He holds a BA, MA and Ph.D. from the University of Delaware. From 1975-78, he was Principal of Ursuline Academy, a prominent Catholic school in Wilmington. He was then Director of Development at the University of Delaware from 1978-81 and served as an education aide in the cabinet of former Delaware governor, Pete DuPont. Before becoming 3rd president of then Wilmington College, Jack was a professor and then Executive Vice President for Academic and Student Affairs. He was quickly promoted to EVP and Provost and in 2005 was elected President by the Board of Trustees. During his tenure, Wilmington College became a University, enrollment doubled, three new campuses were opened, and partnerships with community colleges in NJ, MD and Delaware were developed to provide a “feeder” system. He has served on the boards of a variety of organizations and has won numerous awards for his community leadership. Chuck Halberg, Director Chuck Halberg began his career in construction in Michigan in 1975 and has been a resident of Florida since 1980 and a Florida Licensed General Contractor since 1986.  A South Florida Construction Management Executive, Chuck has worked for three different top 200 National Builders and has overseen the construction of over 2500 residential units, 3500 apartments, a ten-story high rise, 800,000 square feet of commercial space and a 220-bed nursing home.  Chuck has many personal strengths in business relations including product development, budget management, quality control, and customer satisfaction. Chuck has been active in the Delray Beach community since 1991, serving as a volunteer and supporting many Non-Profits including Delray Citizens for Delray Police, the Achievement Center for Children & Families, The Miracle League, The Spady Museum, The Delray Beach Chamber of Commerce and many others. In addition, he has been on various City of Delray Boards including the Affordable Housing Board and the Planning and Zoning Board among others. Susan Owens, Director Susan, a Delray Beach resident who maintains a home in her native state of New Jersey, is currently President and Managing Member of several real estate partnerships. Susan has had a passion for the Arts since early childhood. Her summers were spent in varying Arts programs from Interlochen, Michigan to The Aspen Music Festival in Colorado. She worked as a freelance musician in New York City after graduating with a Bachelor’s of Music degree from the University of Michigan in Ann Arbor. A firm believer in both the positive and powerful impact of the Arts on society, Susan feels very lucky to have been both an employee and supporter at City Center Theater in NYC. Following her passion for helping people raise awareness and civil rights, Susan has served as a National Board member of Lambda Legal, as well as Chaired numerous annual Fundraisers having helped raise hundreds of thousands of dollars. Robin Greene, Director Robin Greene has devoted her life to Special Education with children from 0 to 3 year old in classrooms and privately in New York and South Florida. Robin loves music and even includes music in many of her sessions with children.  She finds that music is one of the best ways to reach people of all ages and make them happy.  Children learn words through music and improve their social skills. Robin grew up in a musical  family – her mother was a singer and both her parents believed strongly in the arts and culture. Robin and her husband Stephen love giving back to their community.  Their family supports the Miracle League and other organizations including Arts Garage.  Robin loves what Arts Garage brings to others – smiling faces, dancing and the enjoyment the shows bring.  Robin is passionate about music and about Arts Garage. Elise Rubenstein, Director As a Board member of the Jewish Community Center in Baltimore for 15 years, I have planned events, been involved with fundraising, sat on Nominating Committees and other strategic planning for the Center. Presently, I am the Chair of Governance, with a committee of 12 people that work on issues around Board Engagement, Vision and Mission statements, Nominating and DEI. Our JCC has a 500-person performance theater, and I have been involved with decision making around programming, capital improvements and staffing. I have also been involved with the Walter’s Art Museum in Baltimore. I was a member of the Women’s Committee, which was responsible for creating and running fundraising event for the Museum. My husband and I are also supporters of the Freeman Stage, which is a 4,000-person venue near our home in Delaware. We love the arts and feel its important to support the venues where we live! So thrilled to be a part of the Arts Garage Family and support their amazing efforts to advance all the arts in Delray! John Engle, Director John embarked on a dynamic journey within IT and software development over 40 years ago. With a distinguished 24-year tenure at a single company, he joined a young startup of about 190 people and contributed to its growth into a global leader with over 13,000 employees after a major merger. Beginning in Quality Assurance, John honed his skills in product excellence and reliability, then advanced through roles as a product analyst, product manager, and people manager. His keen understanding of market needs, user experience, and unique “outside the box” approach drove successful product launches and enhancements that propelled the company’s growth. In addition to his corporate achievements, John has dedicated himself to community leadership. He served for three years as the President of the Cannery Row HOA board, fostering community engagement and effective governance. Now in a semi-retired capacity, John channels his passion for innovation into real estate investing and development, leveraging his extensive leadership experience to create and enhance communities beyond the digital realm. Patricia Glass Schuman, Director Patricia Glass Schuman, librarian, publisher, artist, and free speech activist, co-founded Neal-Schuman Publishers with John Vincent Neal. Pat is a graduate of the University of Cincinnati and Columbia University. She was the first woman elected Treasurer of the American Library Association and was later elected its President. A founder of ALA’s Advocacy Network and the Neal-Schuman Foundation, Pat also served as Chair of the New York Metropolitan Reference and Research Library Agency (METRO) and held board positions with Friends of Libraries U.S.A., the Trejo Foster Foundation, and the New York University Publishing Center. Her advocacy work has led to appearances on more than 70 radio and television programs, including a feature on Washington Week in Review. The author or editor of five books and over 100 journal articles, she has lectured nationally and internationally, testified before the U.S. Congress, and served as a visiting professor at numerous universities. Her many honors include the ALA Equality Award, the Joseph W. Lippincott Award, and Distinguished Alumni Awards from both the University of Cincinnati and Columbia University. She recently received the American Library Association’s highest honor, Honorary Membership. Pat was also recently featured as an emerging artist at Arts Garage. Paula Tishok, Director Paula Tishok brings a wealth of leadership and nonprofit governance experience across the arts, healthcare, and education sectors. With a professional background that spans Westin Hotels, Westinghouse Electric Corporation, and Tenet Healthcare, Tishok has consistently held senior roles in financial operations and strategic planning. A lifelong supporter of the arts and education, she has served on the boards of The Studios of Key West, Wilson College, and the Alumnae Association of Wilson College, among others. Since relocating to Delray Beach from Key West last year, she has quickly immersed herself in the city’s dynamic and flourishing arts landscape. David Plaza, Director David Plaza is a Managing Director and Wealth Management Advisor with Merrill Lynch Wealth Management. With nearly four decades of experience in the financial services industry, Plaza holds both the Certified Private Wealth Advisor® and CERTIFIED FINANCIAL PLANNER® designations. He has earned numerous accolades, including multiple placements on Forbes’ “Best-in-State Wealth Advisors” and Barron’s “Top 1,200 Financial Advisors” lists. Plaza is a passionate advocate for the arts, having served on the boards of numerous cultural and educational institutions. His civic contributions include leadership roles with the Philadelphia Film Society, the Delaware Symphony Orchestra, the Wilmington Music School, and the Art Consortium of Delaware. He has also supported education through his board work with Ursuline Academy and has been recognized with the Paul Harris Fellow Award for his service with the Wilmington Rotary. A seasoned community builder, Plaza was also the founder and former president of the Wilmington Business Group. Ronnie Dunayer, Ex-Officio Ronnie is a Professional Golf Instructor. Over the past 20 years, she has devoted herself to the sport of golf as an instructor, sports psychologist, and event planner, and she has taught in South Florida for nearly a decade. Her experience includes coordinating specialized programs for adults and junior golfers as well as for people with various disabilities. A graduate of Adelphi University, she earned a Master’s Degree in Psychology and specialized in working with athletes. The blending of technical and mechanical knowledge combined with an understanding of the mental components of the sport contributes to her success rate with varied students. Lynn Ferguson, Ex-Officio A Northwestern University graduate, Lynn received a master’s degree from the University of Detroit, After more than 30 years of teaching high school mathematics in Michigan, she retired and moved to Orlando Florida, where she finally had time to pursue her lifelong love of oil painting. There, she joined the Central Florida Women’s League in 2002 and served on the Service Committee, Scholarship Committee, Fundraising Committee, and Arts and Culture Committee, which she co-chaired, She also co-chaired the golf tournament fundraiser for two years and served as the league president in 2007; she was on the Foundation board for the next three years. In addition, Lynn co-founded and was president of the “Friends of Orlando Ballet.” There she grew the “Friends” to a membership of 150 and was responsible for raising approximately $60,000 a year. Lynn started the Arts Garage Guild in October 2011 and, as president, has built the membership to more than 230 members. She has also served on the Board of Directors of the Arts Garage since its inception in October 2011. Arts Garage is a 501(c)(3) non-profit organization Quick Links Home About Tickets Employment Classes Get in Touch Accessibility Hotels Media Advocacy Bar Menu Contact Us Location 94 NE 2nd Ave Delray Beach, FL 33444 Call box office 561-450-6357 Box office hours Tuesday – Saturday, 1pm – 5pm and during performance hours Let's Connect © 2025 Copyright Arts Garage error: Content is protected !! Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://countrymanors.net/contact-us/",
      "text": "Contact Details | Country Manors Association, Inc. Skip to content Country Manors Association, Inc. Home About Us Contact Us × Home About Us Contact Us Home About Us Contact Us × Home About Us Contact Us Contact Us Reach Out To Us Thanks for stopping by! Country Manors Association, Inc. is a condominium association with villas that carry all the necessary amenities. The condominium has eight sections, each with a heated pool and a carport for each villa. Enjoy the benefits by becoming a member. If you wish to become a member or need further information on our condominium, please do not hesitate to contact us. For any other questions or concerns, you may have, drop us a line! Contact Info Phone (561) 498-8300 Fax (561) 498-4099 4900 Country Manors Boulevard, Delray Beach, FL 33445 cmaoffice@countrymanors.net send us a message Name * * Phone * * Email * * Message Comments This field is for validation purposes and should be left unchanged. Country Manors Association, Inc. 4900 Country Manors Boulevard Delray Beach, FL 33445 cmaoffice@countrymanors.net Tuesday: 9:00 AM - 12:00 NOON Wednesday: 3:00 PM -6:00 PM Friday: 9:00 AM -12:00 NOON Home About Us Contact Us © 2025, Country Manors Association, Inc. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://artsgarage.org/",
      "text": "Home - Arts Garage About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List 94 NE 2nd Ave Delray Beach, FL 33444 561-450-6357 info@artsgarage.org facebook twitter instagram youtube linkedin About Us About Our Staff Board of Directors Media Press Photos News Blog Celebrating Legacy Book Celebrating Legacy Photos Annual Report Tickets Upcoming Events Seating Chart Group Rates Partner Program Gallery About Our Gallery Exhibits Call To Artists Classes Adult Classes Youth Classes AIR Series PLACES! Summer Camp Advocacy Defend The Arts Support Donate Current Donors Become An Annual Member Current Annual Members Sponsor an Event Current Sponsors Band of Angels Volunteer heARTfelt Submissions Performance Submissions Art Submissions Contact Get in touch Facility Rental Internship Program Directions FAQs Subscribe to Our Mailing List Search Phone 561-450-6357 Menu Buy Tickets Upcoming Events Sep 12, 2025 Kemuel Roig Sep 13, 2025 The Betty Fox Band Returns Sep 16, 2025 Spoken Word Open Mic: Poetry, Storytelling & Lyrics Sep 19, 2025 BARELY MANILOW: The #1 Longest Running Tribute to Barry Manilow Sep 20, 2025 BACHACO Sep 21, 2025 Sunflower Soul: A Celebration of Susan's Love for Music View More Upcoming Events The Marshall Family Foundation Gallery The Marshall Family Foundation Gallery at Arts Garage in Delray Beach, Florida is leading the way in cultivating emerging regional artists by offering them display space and promoting their artwork to the public and the art community. For emerging artists, gaining visibility is critical to their success and ability to support their artistry. Gaining recognition as a regional artist leads to sales, commissions and finding patrons and supporters to help launch their career to the next level. The Marshall Family Foundation Gallery is part of the Arts Garage Executive Director Marjorie Waldo‘s mission to expose the talents of regional artists to new audiences and promote Delray Beach’s reputation as an art destination for collectors and art lovers. The Gallery is FREE and open to the public. Learn More Current Exhibit Stay in the loop with our events . Subscribe to our newsletter Performance Submissions From Grammy Award-winning musicians to renowned regional talent, Arts Garage hosts performers on our main stage, the Stuart & Shelby Theatre, that represent a broad diversity of cultures. If you are interested in performing at Arts Garage we’d love to hear from you. Apply Art Submissions The Marshall Family Foundation Gallery at Arts Garage exhibits emerging visual artists from the Delray Beach area. All artists have a reception, aligned with Delray Beach’s monthly Art Walk, drawing people to their exhibit. Apply Connecting our Community to the World Through the Arts Our vision drives all of our decisions at Arts Garage. Our programs bring established global performers and regional, emerging artists into our South Florida multicultural community — students and adults, locals and tourists, people of all ages, income levels, and backgrounds – all who share a love of the arts. Community is a hallmark of our work at Arts Garage. We provide a wide variety of music genres and art disciplines to reach everyone in our community. #AccessForAll isn’t just our tagline: it is the cornerstone of our programs, outreach & community collaborations, staffing, and marketing Be a part of arts garage Volunteer Donate Take a Class 2 Read our Blog 8 Sep: Employee Spotlight – September 2 [...] My name is Izmira Santiago, I am the new Director of Development and Community Engagement at Arts Garage. I was […] Read More 8 Sep: Board Spotlight – Paula Tishok [...] Hello, I’m Paula Tishok, and I’m a new Board Member at Arts Garage and I look forward to working with […] Read More 8 Sep: Marjorie’s Minutes – Septe [...] Hi everybody, It’s Marjorie Waldo at Arts Garage with Marjorie’s Minutes for September. I can’t believe it’s September already, but […] Read More 19 Aug: World Photography Day [...] When was the last time you looked at a photo and felt something? Whether it’s joy, nostalgia, or empathy, photography […] Read More View all blogs Join Our Email List Email Address Subscribe! Arts Garage is a 501(c)(3) non-profit organization Quick Links Home About Tickets Employment Classes Get in Touch Accessibility Hotels Media Advocacy Bar Menu Contact Us Location 94 NE 2nd Ave Delray Beach, FL 33444 Call box office 561-450-6357 Box office hours Tuesday – Saturday, 1pm – 5pm and during performance hours Let's Connect © 2025 Copyright Arts Garage Close error: Content is protected !! Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://macfineart.com/areas-we-serve/fine-art-gallery-at-atlantic-avenue/",
      "text": "Fine Art Gallery In Delray Beach, FL | MAC Art Galleries Artists New Art Client Installations News & Events Locations & Contact Fort Lauderdale Jupiter Los Angeles Delray Beach Warehouse Location Delray Beach Atlantic Avenue Areas We Serve Contact Artist Submissions About Mary Ann Cohen Biography Testimonials Fine Art Gallery In Delray Beach, FL At Atlantic Ave At MAC Fine Art Gallery at Atlantic Avenue in Delray Beach FL, we work hard to provide some of the best in customer care for all of our clients in Florida and beyond. We are proud to offer a large collection of fine art in many formats, allowing our clients to choose the right piece whether they visit our shop online or come into our new location at Atlantic Avenue to see it in person. While many of our clients like to look at the available artwork online from the comfort of their own home, many have found that there is nothing better than coming to see the piece in-person as well. That is why we have expanded our Fine Art Galleries to have a second location in Delray Beach, FL. Come visit our fine art gallery at Atlantic Avenue and see which piece will be the next one in your art collection. Our fine art gallery at Atlantic Avenue is the perfect location for art lovers around the Florida area to fall in love and find the piece of art that speaks to them. We are happy to help our clients in the Delray Beach, FL area look at pieces of art in-person, unlike what they could do in many other parts of the world. We will work with you to explore different styles and artists, creating a collection you can be proud of. Read More Fine Art That is Curated with Care in Delray Beach, Florida Our clients come to us with varying knowledge bases about their favorite type of art and what stands out to them. And there are so many unique styles that an art collector can choose from. Whether you are looking for a piece that will sit in your office, become a focal piece in y our home, or to give as a gift, we can help you find the perfect one at our fine art gallery at Atlantic Avenue in Delray Beach, FL. Many of our clients come to us after falling in love with a piece online. With 12,000 square feet of warehouse storage in Ft. Lauderdale to expertise in helping you envision what art will work for your needs, our team at MAC Fine Art is here to help. Our goal is not to make a quick sale. When you visit our fine art gallery at Delray Beach, FL, you will have a chance to look at some of the best pieces of art possible. We take the time to get to know you and understand how you plan to use the piece, such as for building a collection or as an investment, what styles you enjoy, and more. Even if you see a piece of interest online and find it is not quite right in person, our team will walk you through many other priceless pieces of art until you find the right one. It is important to us that you are in love with a piece of art before you purchase and we will take all the necessary steps to make sure that happens. We can even bring the painting to your location to see how it will look, ensuring you get the right option each time. Trust our fine art gallery at Atlantic Avenue to provide you with the very best in fine art! Get Connected with the Fine Art Community in Delray Beach, FL When you visit our fine art gallery at Atlantic Avenue, you will have a chance to get connected with the vibrant and alive fine art community in Delray Beach, FL. Our clients will be able to see the fine art they love in person, watch artists speak about their art, and even see some new pieces being created in front of them. The beauty of our permanent studios is that we can bring in new art lover’s to the world of art and expose them to things other art studios just can’t. At our Atlantic Avenue fine art gallery, we believe that fine art is meant to be moving and personal. We love the spirit of the art community in Delray Beach and want to share it with art lover’s from around the area, both young and old. We know how important it is to store the right pieces to work on your collection, but even more important, we want to help you connect with the right experts in fine art to broaden your horizons and help you see art in new and exciting ways. All of that is possible at our Florida art gallery locations. Many of our clients appreciate the chance to come and see the art in person, talk to the artist, and connect with new art that they may have never considered before. In addition to meeting new artists and learning about their styles , we encourage visitors to walk around the gallery and look at the collections that are on display. We are constantly changing out the artwork that is displayed at our fine art gallery at Atlantic Avenue, so there is always something new and fresh to see when you come visit us in person. Other art galleries just post up some artwork and try to make a sale as quickly as possible. At MAC Fine Art Gallery at Atlantic Avenue in Delray Beach, FL, we want to help our clients connect to the art in a personal way. Our studios are always welcome to new clients to come and see the art in person, whether you have worked on your art collection for years or you are just dipping your toes in the waters. We love to bring the art to you and will ensure that you are exposed to a wide variety of styles, textures, and medias to help change your worldview on art. Don’t trust just anyone to take care of your art collection. Trust MAC Fine Art in Delray Beach, FL to help. Contact Us at MAC Fine Art In Delray Beach for Your Fine Art Needs We have opened a new location at our fine art gallery at Atlantic Avenue in Delray Beach Florida and we encourage you to come visit us at our grand opening! You can contact us via phone or shop some of our online collection to see some of the wonderful works of art that we have available. We want to make it easy to reach us through any option that you need to ensure your art buying experience is as amazing as possible. Never feel like you need to guess about the art you are buying or feel like you are stuck with a piece that won’t work in the spot where you need to place it. Come visit us at our new location where we can meet your needs better than ever before! MAC Delray Beach Art Gallery – Atlantic Avenue 518 E Atlantic Ave Delray Beach, FL 33483 561 774 2928 Facebook X Instagram Google VIEW THE ARTWORK Latest News News MAC Art Wins Best of Fort Lauderdale 2025 2 months ago News Kristin Herzog: An Artist At Play – by Naples Noteworthy 3 months ago News Best Galleries in 2025 – World Art Awards 5 months ago News Meet Mary Ann Cohen: Voyage MIA 1 year ago Facebook Twitter Pinterest CONTACT US Our Locations Fort Lauderdale 833 NE 4th Avenue Ft. Lauderdale, FL 33304 954 990 5420 Jupiter 4601 Military Trail #101 Jupiter, FL 33458 561 429 4829 DELRAY 390 Southeast 2nd Avenue Delray Beach, FL, 33483 561 332 3352 DELRAY – ATLANTIC AVENUE 518 E Atlantic Ave Delray Beach, FL 33483 561 774 2928 Areas We Serve Jupiter & Palm Beach Fort Lauderdale Delray Beach Boca Raton and More Facebook Instagram Copyright 2025 MAC Fine Art | Privacy Policy Menu"
    },
    {
      "url": "https://www.delraylibrary.org/contact/",
      "text": "Contact - Delray Beach Public Library Skip to content (561) 266-0194 100 W. Atlantic Ave. Delray Beach, FL 33444 View Our Hours Facebook X-twitter Instagram Linkedin Youtube Mdi-bookshelf Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies & Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Special Events Laugh with the Library The Very Berry Bake Off Do Good Delray 2025 Retail Therapy Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Something for Everyone Study Rooms Technology, Training & Innovation Lab 3D Printing Large Format Printing Recording Studio Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Library Giving Day Our History Past Newsletters Staff Directory Volunteer Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies & Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Special Events Laugh with the Library The Very Berry Bake Off Do Good Delray 2025 Retail Therapy Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Something for Everyone Study Rooms Technology, Training & Innovation Lab 3D Printing Large Format Printing Recording Studio Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Library Giving Day Our History Past Newsletters Staff Directory Volunteer My Account Get Your Card! Donate! Catalog Website Contact Us Connect with Your Library! Hello from the Delray Beach Public Library! Your feedback and inquiries are important to us. We strive to make our library a welcoming and resourceful place for everyone in the community. Here’s how you can get in touch: Hours Mon–Wed: 9AM - 8PM Thu–Sat: 9AM - 5PM Sun: 1PM - 5PM (Sep–May) Main Desk / Circulation Phone: (561) 266-0194 Fax: (561) 266-9757 Reference Phone: (561) 266-0196 Reference@DelrayLibrary.org Use the form below for a convenient way to reach us! Name Email Subject Message / Questions / Comments Send Holiday Schedule (Closings) January 1, 2025: New Year’s Day (Wednesday) January 20, 2025: Martin Luther King Jr. Day (Monday) February 17, 2025: Presidents’ Day (Monday) April 18, 2025: Good Friday/Passover (Friday) April 20, 2025: Easter (Sunday) May 26, 2025: Memorial Day (Monday) June 19, 2025: Juneteenth Day (Thursday) July 4, 2025: Independence Day (Friday) September 1, 2025: Labor Day (Monday) October 13, 2025: Indigenous People’s Day (Monday) November 11, 2025: Veterans Day (Tuesday) November 26, 2025: Day before Thanksgiving- close at 5:00 pm November 27, 2025: Thanksgiving (Thursday) November 28, 2025: Friday after Thanksgiving December 24, 2025: Christmas Eve – close at noon (Wednesday) December 25, 2025: Christmas (Thursday) December 31, 2025: New Year's Eve – close at noon (Wednesday) Would you like to support the amazing work your local nonprofit library is doing? Donations Welcome! Volunteer Today! Newsletter Sign-Up! Statistics The Delray Beach Public Library , one of only two nonprofit public libraries operating in the State of Florida, is dedicated to igniting curiosity, fueling discovery and encouraging creativity through access to trusted information, reliable resources and vital community connections. Welcome! (561) 266-0194 100 W. Atlantic Ave. Delray Beach, FL 33444 View Our Hours Follow Us! Facebook X-twitter Instagram Linkedin Youtube Mdi-bookshelf Borrow Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Borrowing Guidelines Download & Stream Find Your Next Read Get a Card Request a Title Search Help Take Home Activities Attend View All Classes & Programs Children’s Classes & Programs Babies/Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs View All Classes & Programs Children’s Classes & Programs Babies/Toddlers (0-2) Preschool (3-4) Elementary (5-9) Tween (10-12) Teen Classes & Programs Adult Classes & Programs Technology Classes & Programs Research Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Business Center Career Development & Job Assistance Digital Resources Featured Resources Find Help Homework Center Local Resources Explore Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Recording Studio Something for Everyone Study Rooms Technology, Training & Innovation Lab Art Gallery Book Donations & Sale Library FAQs Library on the Go Meeting Room Rentals Recording Studio Something for Everyone Study Rooms Technology, Training & Innovation Lab Connect About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Our History Past Newsletters Staff Directory Volunteer About Us Board of Directors CIPA Compliance Code of Conduct Contact Donate Give Back Our History Past Newsletters Staff Directory Volunteer Delray Beach Public Library 2024. All Rights Reserved. Legal Disclaimer Privacy Policy This library has been funded under the provisions of the State Aid to Libraries Grant program, which is administered by the Florida Department of State’s Division of Library and Information Services. Website Design By The Non-Profit Team & ABO Design Library Hours Mon–Wed: 9AM - 8PM Thu–Sat: 9AM - 5PM Sun: 1PM - 5PM (Sep–May) Seasonal Hours Winter Hours Sep–May Mon-Wed: 9am-8pm Thurs-Sat: 9am-5pm Sun: 1pm-5pm Summer Hours June–August Mon-Wed: 9am-8pm Thurs-Sat: 9am-5pm Stay Connected with the Delray Beach Public Library! Don’t miss out on the latest library events, programs, and resources. Sign up for our newsletter today and get updates delivered straight to your inbox! Join our community and stay informed – it’s free! First Name Last Name Email Send"
    },
    {
      "url": "https://delrayarttrail.com/galleries-cultural-arts/",
      "text": "Galleries & Cultural Arts – Delray Beach Art Trail Skip to content Home Art Installations Art Citywide Chair Project Art in the Alley Delray Beach Market Art Endurance Sculpture Gateway Art IPIC Installations Knowles Knots Sculpture LGBTQIA+ Pride Streetscape Art Installation Mosaic Ocean Life Fountain Pineapple Grove Sculptures “SEED” Sculpture South County Courthouse Worthing Park DeBilzan Sculptures Murals Galleries & Cultural Centers Holiday Light Trail Map First Friday Art Walk Murals Home Art Installations Art Citywide Chair Project Art in the Alley Delray Beach Market Art Endurance Sculpture Gateway Art IPIC Installations Knowles Knots Sculpture LGBTQIA+ Pride Streetscape Art Installation Mosaic Ocean Life Fountain Pineapple Grove Sculptures “SEED” Sculpture South County Courthouse Worthing Park DeBilzan Sculptures Murals Galleries & Cultural Centers Holiday Light Trail Map First Friday Art Walk Murals Menu Galleries & Studios Downtown Delray Beach is filled with dozens of galleries and studios, all adding a unique artistic appeal to our vibrant downtown. Take a moment to visit our Galleries & Studios page on the Downtown Development Authority website an plan to support our local artists. Find Galleries & Studios Cultural Arts Centers Downtown Delray Beach celebrates eight innovative, non-profit Cultural Arts Centers with a common mission: to bring unique art, cultural, historic and educational experiences to the whole community. Young and older visitors are invited to engage through art exhibitions, educational programs, historic preservation and exceptional live entertainment. Arts Garage 94 NE 2nd Ave Delray Beach, FL 33444 (561) 450-6357 Visit Website Map it Arts Warehouse 313 NE 3rd Street | Delray Beach, FL 33444 (561) 330-9614 Visit Website Map it Delray Beach Historical Society 3 NE 1st St, Delray Beach, FL 33444 (561) 274-9578 Visit Website Map it Delray Beach Children's Garden 137 SW 2nd Ave, Delray Beach, FL 33444 (561) 463-2528 Visit Website Map it Delray Beach Playhouse 950 NW 9th Stree, Delray Beach, FL 33444 (561) 272-1281 Visit Website Map it Delray Beach Public Library 100 W. Atlantic Avenue Delray Beach, FL 33444 (561) 266-0196 Visit Website Map it Morikami Museum and Japanese Gardens 4000 Morikami Park, Delray Beach FL 33446 (561) 495-0233​ Visit website Map it Old School Square 51 N. Swinton Avenue Delray Beach, FL 33444 For more information about events and rentals at Vintage Gym and Ampitheater, please contact the Downtown Development Authority at 561-243-1077 Map it Website Old School Square Amphitheatre 51 N. Swinton Avenue Delray Beach, FL 33444 The Amphitheatre is a cutting-edge outdoor performance facility that can host a variety of events on its spacious grounds.For more information about events and rentals at the Ampitheatre, please contact the Downtown Development Authority at (561) 243-1077) Map it Website Old School Square Cornell Art Museum 51 N. Swinton Avenue Delray Beach, FL 33444 Located in the 1913 Delray Elementary School building, the museum art exhibitions are captivating experiences that continually refresh and change, inviting visitors into a world of discovery, creativity and inspiration. The museum showcases original contemporary work by innovative artists throughout Florida. With rotating displays, artists have the opportunity to showcase their latest works, ensuring that every visit to the gallery is a unique encounter.                                                                                                  Contact:  Marusca Gatto, Cultural Arts Director (mgatto@downtowndelraybeach.com) (561) 654-2220) Map it Website Old School Square Creative Arts School 51 N. Swinton Avenue Delray Beach, FL 33444 Embark on the journey of exploring your creativity. Please join our community where creativity thrives and everyone is welcome. Our classes offer a unique opportunity to learn, grow, and express yourself through art. For more information please contact the city of Delray Beach at 561-243-7209. Map it Website Old School Square Vintage Gym 51 N. Swinton Avenue Delray Beach, FL 33444 Looking to add a touch of nostalgia and uniqueness to your personal event? The beauty, luxury and history of the Vintage Gym makes it the perfect venue for wedding receptions, private parties and corporate events. For more information about events and rentals at the Vintage Gym, please contact the Downtown Development Authority at 561-243-1077. Map it Website Old School Square 51 N. Swinton Avenue Delray Beach, FL 33444 For more information about events and rentals at Vintage Gym and Ampitheater, please contact the Downtown Development Authority at 561-243-1077 Map it Website Cornell Art Museum 51 N. Swinton Avenue Delray Beach, FL 33444 Contact:  Marusca Gatto, Cultural Arts Directormgatto@downtowndelraybeach.com ( mgatto@downtowndelraybeach.com )  (561) 654-2220) Map it Sandoway Discovery Center 142 S Ocean Blvd, Delray Beach, FL 33483 (561) 274-7263 Visit Website Map it Spady Cultural Heritage Museum 170 NW 5th Ave Delray Beach, FL 33444 (561) 279-8883​ Visit Website Map it The Delray Beach Downtown Development Authority has curated this list of public and private art installations throughout the downtown area to allow residents and visitors to explore our beautiful city and find the hidden gems that you may otherwise miss. While this website was set up as a tool to allow you to explore the art installations throughout our town, we also invite you to visit www.downtowndelraybeach.com and the Visitor Information Center at A1A and E. Atlantic Blvd. to learn more about the Downtown Delray Beach DDA, boutiques, restaurants, businesses, and events that are the fabric of our Village by the Sea. Copyright © 2024 Delray Beach Art Trail - Powered by RealTime . Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    }
  ]
}