{
  "fuentes": [
    {
      "url": "https://gasparsgrotto.com/employment/",
      "email": "adam@gasparsgrotto.com"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "facebook-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "facebook-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "instagram-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "instagram-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "pinterest-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "email": "pinterest-white@3x.png"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "contact@musicgrotto.com"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "jadlawan@musicgrotto.com"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "jana.exconde@musicgrotto.com"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "jenna.carson@musicgrotto.com"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "liam@musicgrotto.com"
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "email": "lieolaes@musicgrotto.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://gasparsgrotto.com/contact/",
      "email": "adam@gasparsgrotto.com"
    },
    {
      "url": "https://gasparsgrotto.com/contact/",
      "email": "andy@gasparsgrotto.com"
    }
  ],
  "mails": [
    "adam@gasparsgrotto.com",
    "andy@gasparsgrotto.com",
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "contact@musicgrotto.com",
    "facebook-white@2x.png",
    "facebook-white@3x.png",
    "info.nairobi@skanem.com",
    "instagram-white@2x.png",
    "instagram-white@3x.png",
    "jadlawan@musicgrotto.com",
    "jana.exconde@musicgrotto.com",
    "jane@skanem.ke",
    "jenna.carson@musicgrotto.com",
    "liam@musicgrotto.com",
    "lieolaes@musicgrotto.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "pinterest-white@2x.png",
    "pinterest-white@3x.png",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "gasparsgrotto.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://gasparsgrotto.com/employment/",
      "text": "Employment – Gaspar's Grotto Skip to main content facebook instagram Gift the Gaspar's Grotto Experience. Gaspar's Grotto Gift Cards Now Available! Hit enter to search or ESC to close Search Close Search 0 Menu Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Contact Employment Shop Ybor Gift Company 0 was successfully added to your cart. Work With Us At Gaspar’s Grotto, we practice diversity. Our bar staff, servers and kitchen crew are all over the map in that regard. However they all have one thing in common, they are friendly, service oriented individuals with winning personalities who care deeply about their guests and their own ability to provide world class service and provide a comfortable and memorable atmosphere for the guests. Entertainment Gaspar’s Grotto is always interested in employing new musical talent and eclectic entertainers. We are actively seeking to employ magicians, stilt walkers, contortionists, mimes, fire eaters, knife throwers, organ grinders, animal acts et al. If it’s not often seen, unusual, offbeat, strange or even bizarre, it’s a fit. Gaspar’s is a fun and safe place for these performers to practice their art. Send an email to adam@gasparsgrotto.com for more information about live entertainment bookings. Bar Staff & Servers Every bartender at Gaspar’s has over 150 drink recipes committed to memory. All are actively seeking to upgrade their knowledge. Many practice the art of flair and all use their creativity to dress like the pirates they are. These are conditions of employment at Gaspar’s Grotto. Please stop by and fill out an application in person for bar staff and serving positions. Kitchen Crew The kitchen at Gaspar’s Grotto is a tightly run ship under Executive Chef Itza Henderson. It is a fast-paced and high volume environment. If you apply, be prepared to work. Stop by and ask to speak to Cap’n Hook if you are interested in being a part of the kitchen crew! Running of the Ship There are several other employment opportunities at Gaspar’s Grotto including, cleaning, security, barback, and porter positions. Please stop by and fill out an application in person. GASPAR’S GROTTO 1805 E 7th Ave Tampa, FL 33605 (813) 248-5900 Click here to find out why we're among Tampa's top restaurants. HOURS Monday – Saturday: 7am – 2am Sunday: 11am – 2am Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Employment Contact Shop Ybor Gift Company GASPAR’S GROTTO GIFT CARDS Giving the gift of the Gaspar’s Grotto experience just got easier. Purchase an eGift Card here! Gift Cards © 2025 Gaspar's Grotto. facebook instagram Close Menu Gift the Gaspar's Grotto Experience. Gaspar's Grotto Gift Cards Now Available! Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Contact Employment Shop Ybor Gift Company facebook instagram"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/the-tampa-bay-area/things-to-do/nightlife/reviews/gaspars-grotto-580309",
      "text": "Gaspar's Grotto Review - The Tampa Bay Area Florida - Nightlife | Fodor’s Travel Go Destinations Hotels Travel News Cruises Forums Trip Ideas More Forums Trip Ideas Subscribe Login Subscribe Login USA Europe Africa & The Middle\n                        East Asia Australia & The\n                        Pacific Canada Caribbean Mexico &\n                        Central America South America Cruise Overview Cruise News Cruising 101 Line & Ship Directory Guidebooks Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums National Parks Best Road Trips in America Ultimate Guides for the ultimate trip Love to travel? Get FREE email communications from Fodor's Travel, covering must-see travel destinations, expert\n                        trip planning advice, and travel inspiration to fuel your passion. By signing up for the newsletter, I agree to the Privacy Policy. You must check the box to subscribe Home Destinations USA Europe Africa & The Middle East Asia Australia & The Pacific Canada Caribbean Mexico & Central America South America View All Destinations Hotels Travel News Cruises Cruise Overview Cruise News Cruising 101 Cruise Directory Forums Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums Trip Ideas National Parks Best Road Trips in America Ultimate Guides Login Subscribe The Tampa Bay Area Overview Hotels Restaurants Sights Top Places Shopping Nightlife Performing Arts Gallery More The Tampa Bay Area Things to Do The Tampa Bay Area Travel Guide Overview Hotels Restaurants See Top Places Shopping Nightlife Arts Gallery Sights Shopping Nightlife Performing Arts Fodor's Expert Review Gaspar's Grotto The Tampa Bay Area Bars Notorious Spanish pirate José Gaspar was known for swashbuckling up and down Florida's west coast in the late 18th and early 19th century. His legend has inspired a massive, raucous street festival each winter. This Ybor City drinkery has adopted his name, and rightly so. Decked out in tons of pirate memorabilia, it's the cornerstone to any night spent barhopping on the Ybor strip. The sangria is a good choice, but the aged rums might be even better. You'll also find a food menu that goes well beyond standard bar fare. Bars Quick Facts 1805 E. 7th Ave. Tampa, Florida 33605, USA 813-248–5900 gasparsgrotto.com What’s Nearby Related Forum Posts Moving to Florida from Oregon by bivette on\n                                    Oct 24, 2016 Amtrak to Underrated Tampa by Daniel_Williams on\n                                    Jan 02, 2019 Tampa Bay to key West flights by Joe18 on\n                                    Jan 08, 2019 Living in Tampa /West Palm by marissakayv on\n                                    May 23, 2017 VIEW ALL Related Forum Posts Moving to Florida from Oregon by bivette on\n                                    Oct 24, 2016 Amtrak to Underrated Tampa by Daniel_Williams on\n                                    Jan 02, 2019 Tampa Bay to key West flights by Joe18 on\n                                    Jan 08, 2019 Living in Tampa /West Palm by marissakayv on\n                                    May 23, 2017 VIEW ALL Destinations USA Florida The Tampa Bay Area Things to Do Nightlife Gaspar's Grotto About Us Contact Us Our Team Press Room FAQs Award Licensing Advertising Content Licensing Site Map About Us Contact Us Our Team Press Room FAQs Award Licensing Site Map Advertising Content Licensing Follow Us Fodor’s Travel Use of this site indicates your consent to the Terms of Use. Copyright © 2025 by MH\n                Sub I, LLC dba Internet Brands. Fodor’s is a registered trademark of MH Sub I, LLC dba Internet Brands. All rights reserved. Terms of Use | Privacy Policy | Cookie Policy | Manage Preferences | Your Privacy Choices Subscribe to Newsletter Sign up for Travel Tips & News Please Enter a Valid Email Address Subscribe I want emails from Fodor's Travel with travel information and promotions. I can unsubscribe\n            any time using the unsubscribe link at the end of all emails. Thank you for your interest! Look out for our newsletters with travel tips and special offers. Sign up for Travel Tips & News By signing up for the\n                newsletter, I agree to the Privacy Policy . You must check the box to subscribe Thank you for your interest! Look out for our newsletters with travel tips and special offers."
    },
    {
      "url": "https://www.musicgrotto.com/contact/",
      "text": "Contact - Music Grotto Skip to content Menu Entertainment Artist Facts & Features Song Meanings Technology Skills Singing Guitar Piano Miscellaneous About Contact Menu Entertainment Artist Facts & Features Song Meanings Technology Skills Singing Guitar Piano Miscellaneous About Contact Contact You can reach us directly by contacting the head editor via email, mail or by phone number: Music Grotto 4110 SE Hawthorne Blvd. #236 Portland, Oregon 97214-5246 USA Get Directions +1 (971) 240-7126 contact@musicgrotto.com To get in touch with someone else, please contact them via email: Content Team Head Editor – Liam Flynn – liam@musicgrotto.com – Learn more Editor – Jana Exconde – jana.exconde@musicgrotto.com Editor – Janiz Adlawan – jadlawan@musicgrotto.com Graphic Designer – Jenna Lee – lieolaes@musicgrotto.com Regular Contributing Writers: These writers are regular contributors: Barry Gray – Contact and learn more Dakotah Blanton – Contact and learn more Florence Howard – Contact and learn more Advertising & PR Contact Jenna Carson – jenna.carson@musicgrotto.com This is a professional review website. Any purchase that a visitor makes for a product mentioned or directed to by Music Grotto, may result in us receiving a commission. As an Amazon Associate we earn from qualifying purchases. Contact Information: 4110 SE Hawthorne Blvd. #236 Portland, Oregon 97214-5246 USA Phone: +1 (971) 240-7126 contact@musicgrotto.com © 2025 Music Grotto Terms Of Service Contact Privacy Policy Disclaimer Sitemap"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://gasparsgrotto.com/contact/",
      "text": "Contact – Gaspar's Grotto Skip to main content facebook instagram Gift the Gaspar's Grotto Experience. Gaspar's Grotto Gift Cards Now Available! Hit enter to search or ESC to close Search Close Search 0 Menu Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Contact Employment Shop Ybor Gift Company 0 was successfully added to your cart. Contact Gaspar's Grotto Location 1805 E 7th Ave Tampa, FL 33605 Phone (813) 248-5900 Email Management: andy@gasparsgrotto.com Private Event Bookings: andy@gasparsgrotto.com Entertainment Bookings: adam@gasparsgrotto.com GASPAR’S GROTTO 1805 E 7th Ave Tampa, FL 33605 (813) 248-5900 Click here to find out why we're among Tampa's top restaurants. HOURS Monday – Saturday: 7am – 2am Sunday: 11am – 2am Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Employment Contact Shop Ybor Gift Company GASPAR’S GROTTO GIFT CARDS Giving the gift of the Gaspar’s Grotto experience just got easier. Purchase an eGift Card here! Gift Cards © 2025 Gaspar's Grotto. facebook instagram Close Menu Gift the Gaspar's Grotto Experience. Gaspar's Grotto Gift Cards Now Available! Menu Catering VIP Bottle Lounge Pig Roast Events Get Married About Us Contact Employment Shop Ybor Gift Company facebook instagram"
    }
  ]
}