{
  "fuentes": [
    {
      "url": "https://www.1golf.eu/en/club/gator-trace-golf-country-club/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/gator-trace-golf-country-club/",
      "email": "info@gatortracecountryclub.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/gator-trace-golf-country-club/",
      "email": "travel@albrecht.de"
    }
  ],
  "mails": [
    "golf-club-detail@2x.png",
    "info@gatortracecountryclub.com",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "gatortracecountryclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.1golf.eu/en/club/gator-trace-golf-country-club/",
      "text": "Gator Trace Golf & Country Club, Fort Pierce, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Gator Trace Golf & Country Club 18 Hole Semi- Private Overview Course Visitors Prices Amenities Reviews No image available Gator Trace Golf & Country Club 4302 Gator Trace Dr, Fort Pierce, FL 34982, USA Phone: +1 772-464-0407 , Fax: +1 772-464-7999 info@gatortracecountryclub.com www.gatortracecountryclub.com Map Save Share The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $41 (35 €) / 18 Holes The Course 18-Hole Course Opened in 1983. Design: Arthur Hills . Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Blue (Men) 70 68.9 123 6092 yards White (Men) 70 66.9 116 5530 yards Red (Women) 70 67.1 122 4573 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Course Visitors are welcome every day. Advance booking is essential. Green Fees 18-Hole Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes $41 (35 €) $41 (35 €) Prices incl. cart! Amenities Club Amenities Clubhouse Outdoor pool Club accepts credit cards Pro Shop Restaurant Bar Snack Bar Beverage Cart Rentals Clubs for hire Electro-cart for hire Enlarge / get directions Nearby Courses Indian Hills Golf Course Fort Pierce (5.2 km) 18 Hole 42 € / 18 Holes St. James GC Port Saint Lucie (5.9 km) 18 Hole 45 € / 18 Holes Ocean Village Golf Course Fort Pierce (6.7 km) 9 Hole See all User Reviews There are no user reviews yet. Been to Gator Trace Golf & Country Club ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    }
  ]
}