{
  "fuentes": [
    {
      "url": "https://www.groupon.com/biz/north-fort-myers-fl/gator-mikes-family-fun-park",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://www.joonsquareusa.com/amusement-park/gator-mike-s-family-fun-park-lee-fl",
      "email": "info@gatormikes.com"
    },
    {
      "url": "https://www.news-press.com/story/news/local/2024/10/02/cape-coral-frightmare-on-78-canceled-gator-mikes-owner-says-haunted-hike-pine-island-road/75450585007/",
      "email": "crunnells@gannett.com"
    },
    {
      "url": "https://www.groupon.com/deals/gator-mike-s-family-fun-park-9",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://gatormikes.com/2024/04/24/discover-new-skills-and-thrills-at-gator-mikes-family-fun-park/",
      "email": "groupsales@gatormikes.com"
    },
    {
      "url": "https://gatormikes.com/2024/03/05/gator-mikes-paintball-arena-where-the-fun-never-stops/",
      "email": "groupsales@gatormikes.com"
    },
    {
      "url": "https://gatormikes.com/parties-events/group-outings/",
      "email": "groupsales@gatormikes.com"
    }
  ],
  "mails": [
    "crunnells@gannett.com",
    "groupsales@gatormikes.com",
    "info@gatormikes.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "gatormikes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.groupon.com/biz/north-fort-myers-fl/gator-mikes-family-fun-park",
      "text": "Gator Mike's Family Fun Park - From $43.20 - Cape Coral | Groupon The Great Savings Event. Use code: SAVENOW & save up to 75%. Shop Now! Download our app for exclusive deals Sell on Groupon English Select Location Sign In Beauty & Spas Beauty & Spas Things To Do Things To Do Auto & Home Auto & Home Food & Drink Food & Drink Gifts Gifts Local Local Travel Travel Goods Goods Coupons Coupons Local Things To Do Kids Activities Amusement Parks Family Fun: Mini Golf, Go-Karts, Bumper Boats, Arcade at Gator Mike's Family Fun Park with Up to 46% Off Gator Mike's Family Fun Park 35 Northeast Pine Island Road, Cape Coral 4.6 ( 1,247 reviews ) Best Rated 100+ Bought 50+ viewed today +6 images Sale ends in 05:42:50 Sign in and get Extra $4.32 off Promo ends Groupon reserves the right to end the promo at any time Select Option: Buy as a gift Select Option: Buy as a gift ONE Round of Mini Golf + Go-Kart Ride + Bumper Boat Ride + $25 Arcade Credit $ 62 $ 48 $ 43 . 20 -30% Extra $4.80 off, today only $ 38 . 88 Sign in to apply discount 290+ bought TWO Rounds of Mini Golf + Go-Kart Rides + Bumper Boat Rides + $50 Arcade Credit $ 124 $ 88 . 20 $ 79 . 38 -36% Extra $8.82 off, today only $ 71 . 44 Sign in to apply discount 100+ bought FOUR Rounds of Mini Golf + Go-Kart Rides + Bumper Boat Ride + $100 Arcade Credit $ 248 $ 150 $ 135 -46% Extra $15 off, today only $ 121 . 50 Sign in to apply discount 4 interest-free payments of $33.75 with Klarna Learn more 230+ bought Buy now Mary 3 days ago Lots of fun Show More Show all reviews Amenities Good for Groups Parking Good for Kids Cash Only Payment Takes Reservations Walk-ins Welcome About Need To Know Info Where To Redeem Reviews Gator Mike’s Family Fun Park: Classic Attractions, Big Fun From mini golf and go-karts to bumper boats & arcade games, Gator Mike’s Family Fun Park brings a full day of activity under one roof. Spread across several themed zones, the park offers a mix of family-friendly challenges and easygoing games, giving guests plenty of ways to stay active or just have some fun between rounds. To make planning even easier, Gator Mike’s features three package options combining mini golf, go-karts, bumper boats, and arcade . Each bundle is designed for solo visits, pairs, or full family groups, offering flexible ways to spend a day at the park without overthinking the details. Explore the Park Highlights Dino-Themed Mini Golf Fast-Paced Go-Karts Arcade Adventures Groupon Packages Available Package #1 – Fun for One: 1 Round of Mini Golf 1 Go-Kart Ride 1 Bumper Boat Ride $25 Arcade Credit $2 Card Fee Retail Price: $64 | Groupon Price: $48 (25% off) Package #2 – Fun for Two: 2 Rounds of Mini Golf 2 Go-Kart Rides 2 Bumper Boat Rides $50 Arcade Credit $2 Card Fee Retail Price: $126 | Groupon Price: $88.20 (30% off) Package #3 – Family Fun Pack: 4 Rounds of Mini Golf 4 Go-Kart Rides 4 Bumper Boat Rides $100 Arcade Credit $2 Card Fee Retail Price: $250 | Groupon Price: $150 (40% off) Each package pulls together the park’s most popular attractions, keeping the day organized and the pricing simple. Must be  58\" to drive Go Karts and 44\" to Drive Bumper boats. Check Out Other Gator Mike's Deals: Mini-Golf Mini-Golf + Drink + Pizza Gator Mike’s Family Fun Park: Classic Attractions, Big Fun From mini golf and go-karts to bumper boats & arcade games, Gator Mike’s Family Fun Park brings a full day of activity under one roof. Spread across several themed zones, the park offers a mix of family-friendly challenges and easygoing games, giving guests plenty of ways to stay active or just have some fun between rounds. To make planning even easier, Gator Mike’s features three package options combining mini golf, go-karts, bumper boats, and arcade . Each bundle is designed for solo visits, pairs, or full family groups, offering flexible ways to spend a day at the park without overthinking the details. Explore the Park Highlights Dino-Themed Mini Golf Fast-Paced Go-Karts Arcade Adventures Groupon Packages Available Package #1 – Fun for One: 1 Round of Mini Golf 1 Go-Kart Ride 1 Bumper Boat Ride $25 Arcade Credit $2 Card Fee Retail Price: $64 | Groupon Price: $48 (25% off) Package #2 – Fun for Two: 2 Rounds of Mini Golf 2 Go-Kart Rides 2 Bumper Boat Rides $50 Arcade Credit $2 Card Fee Retail Price: $126 | Groupon Price: $88.20 (30% off) Package #3 – Family Fun Pack: 4 Rounds of Mini Golf 4 Go-Kart Rides 4 Bumper Boat Rides $100 Arcade Credit $2 Card Fee Retail Price: $250 | Groupon Price: $150 (40% off) Each package pulls together the park’s most popular attractions, keeping the day organized and the pricing simple. Must be  58\" to drive Go Karts and 44\" to Drive Bumper boats. Check Out Other Gator Mike's Deals: Mini-Golf Mini-Golf + Drink + Pizza Need To Know Info Promotional value expires 120 days after purchase. Amount paid never expires.    \n    Promotional value expires 120 days after purchase. Amount paid never expires.\nMerchant is solely responsible to purchasers for the care and quality of the advertised goods and services. \n    Merchant is solely responsible to purchasers for the care and quality of the advertised goods and services.\n    Learn about Strike-Through Pricing and Savings About Gator Mike's Family Fun Park Company Website Explore more Nearby Things To Do Circus Kids Classes Aquarium Zoo Kids Camps Bowling Trampoline & Bounce Houses Mini Golf"
    },
    {
      "url": "https://www.joonsquareusa.com/amusement-park/gator-mike-s-family-fun-park-lee-fl",
      "text": "Gator Mike's Family Fun Park in Cape Coral, Lee -  Amusement Park | Joonsquare USA List Your Business Login Register Visit Explore Lee FL Supermarket Park Amusement Park Water Park Store Other Museums Store Theme Park Login Register Explore Lee FL Supermarket Park Amusement Park Water Park Store More Museums Store Theme Park List Your Business Social Links 0 0 Go Back Florida Lee Amusement Park Gator Mike's Family Fun Park Gator Mike's Family Fun Park Cape Coral, Lee Share × Gator Mike's Family Fun Park Share This Business Click Below to Share this Business with your Friends, Clients and other Contacts. Save × Please login to Save this business. Login Close × Please login to report this business. Login Close 11:00 AM - 08:00 PM Wednesday Send Enquiry Call Map Location Review 3+ 3+ Like 564 Views You can search for other Businesses Near  Cape Coral Water Park Amusement Park Theme Park Park Supermarket Reviews about the Gator Mike's Family Fun Park. Click To Review Upload Image Gator Mike's Family Fun Park Contact Details: Address : 35 NE Pine Island Rd, Cape Coral, Lee, Florida, USA, 33909 Phone No. : 2395744386 Email : info@gatormikes.com Official website : https://gatormikes.com/ Share this Business with others: Send Your Enquiry Get response from other Businesses Also. Feedback Send Enquiry Location Click Here to Search for more Amusement Park Near Cape Coral × Working Hours Monday 11:00 AM - 08:00 PM Open Tuesday 11:00 AM - 08:00 PM Open Wednesday 11:00 AM - 08:00 PM Open Thursday 11:00 AM - 08:00 PM Open Friday 11:00 AM - 10:00 PM Open Saturday 11:00 AM - 10:00 PM Open Sunday 11:00 AM - 08:00 PM Open Amusement Park Near Cape Coral Sun Splash Family Waterpark Water Park 0 528 Tropical Breeze Fun Park Theme Park 0 457 Happy's Family Fun Center Amusement Park 0 253 × Gator Mike's Family Fun Park Response Within 24 Hours. Get response from other Businesses Also × Gator Mike's Family Fun Park Book Appointment Online in Advance. Select Appointment Date Choose Time Slot Choose Time Morning Slot 10:15 AM 10:30 AM 10:45 AM 11:00 AM 11:15 AM 11:30 AM 11:45 AM Afternoon Slot 12:00 PM 12:15 PM 12:30 PM 12:45 PM 01:00 PM 01:15 PM 02:00 PM 02:15 PM 02:30 PM 02:45 PM 03:00 PM 03:15 PM 03:30 PM 03:45 PM Evening Slot 04:15 PM 04:30 PM 04:45 PM 05:00 PM 05:15 PM 05:30 PM 05:45 PM Get Confirmation from Business on Mobile No. × Gator Mike's Family Fun Park . Please Give Feedback. × Gator Mike's Family Fun Park . Response In Only 30 minutes. --Select --- Voilence Harassment Spam Copyrighted browse by state Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa kansas Kentucky Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Louisiana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Company About Joonsquare Jobs Blogs Press Promote Business Online Publish a Business Terms & Conditions Reviews Content Guidelines Advertise with Joonsquare More Customer Support Privacy Policy Terms of Services FAQ Follow Us Facebook Twitter Youtube Copyright 2024 © All rights reserved by Joonsquare USA"
    },
    {
      "url": "https://www.news-press.com/story/news/local/2024/10/02/cape-coral-frightmare-on-78-canceled-gator-mikes-owner-says-haunted-hike-pine-island-road/75450585007/",
      "text": "Cape Coral's Frightmare on 78 canceled, Gator Mike's owner says News Cape Coral Sports Opinion Restaurants Advertise Obituaries eNewspaper Legals LOCAL No Frightmare on 78 in Cape Coral this year, Gator Mike's owner confirms Charles Runnells Fort Myers News-Press A popular Halloween tradition won't be happening this year in Cape Coral. The annual Frightmare on 78 has been canceled at Gator Mike's Family Fun Park, owner Chris Scuderi said Monday. Frightmare on 78 — formerly known as the Haunted Hike — has taken place at the Pine Island Road fun park for more than three decades. But information about the 2024 event has been missing from the park's website or Facebook page . Scuderi confirmed Monday that there won't be a 2024 Frightmare this year, but he declined to say anything else, including why the event was canceled or whether this is a permanent change. \"I won’t be discussing it,\" he wrote via text. As the Haunted Hike, the annual event took place for 28 years at the former Greenwell’s Family Fun Park on Pine Island Road. It attracted about 10,000 to 12,000 every year and as many as 1,000 to 1,500 people every night during its month-long run, Scuderi said in 2019. Cape Coral's Haunted Hike becomes Frightmare on 78 After Scuderi bought the property in 2019 and changed its name to Gator Mike's, he brought back Haunted Hike as Frightmare on 78. Scuderi said he couldn't legally use the previous name. “We’re gonna spend a lot of time scaring the living daylights out of people,” he told The News-Press in 2019 . “It’s gonna be really cool!” The annual event featured aliens, killer clowns, chainsaw maniacs and more arranged in a maze of walls, fog machines, strobe lights and scary scenes. Last year, the event returned to the woods for the first time since changing its name. Gator Mike's inherited a lot of the old Haunted Hike props and costumes. Most of the same planners and performers were involved, too, at least in the beginning. Many Haunted Hike fans were worried the event was gone for good when Gator Mike's started advertising Frightmare on 78, Scuderi said in 2019. But he didn’t want the Halloween tradition to disappear just because the place had a new owner. “It’s been going for 28 years,” he said. “I didn’t want to let the community down. It’s something that’s been going on for so long.” — Charles Runnells is an arts and entertainment reporter for The News-Press and the Naples Daily News. To reach him, call 239-335-0368 (for tickets to shows, call the venue) or email him at crunnells@gannett.com . Follow or message him on social media: Facebook ( facebook.com/charles.runnells.7 ), X (formerly Twitter) ( @charlesrunnells ), Threads (@crunnells1) and Instagram ( @crunnells1 ). Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote Your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.news-press.com. All rights reserved."
    },
    {
      "url": "https://www.groupon.com/deals/gator-mike-s-family-fun-park-9",
      "text": "Gator Mike's Family Fun Park in Cape Coral | Groupon The Great Savings Event. Use code: SAVENOW & save up to 75%. Shop Now! Download our app for exclusive deals Sell on Groupon English Select Location Sign In Beauty & Spas Beauty & Spas Things To Do Things To Do Auto & Home Auto & Home Food & Drink Food & Drink Gifts Gifts Local Local Travel Travel Goods Goods Coupons Coupons Local Things To Do Sports & Outdoors Paintball This deal has expired. Experience thrilling paintball games at Gator Mike's Family Fun Park for up to 20 players with safety gear, up to 39% off Gator Mike's Family Fun Park 35 Northeast Pine Island Road, Cape Coral 4.6 ( 1,247 reviews ) Best Rated 100+ Bought +4 images Show all expired options Similar deals Mary 3 days ago Lots of fun Show More Show all reviews Amenities Good for Groups Parking Good for Kids Cash Only Payment Takes Reservations Walk-ins Welcome About Need To Know Info Where To Redeem Reviews Enjoy a paintball game with safety gear and 200 paintballs each, perfect for groups seeking fun and excitement outdoors Get ready for an action-packed day! The deal includes a paintball game for up to twenty players, complete with 200 paintballs each. Ever wondered what it’s like to strategize in an outdoor arena filled with structures and bunkers? Enjoy the thrill of different game modes like Elimination or Capture the Flag while equipped with all necessary gear: guns, masks, hoppers, air, and paintballs. Kids can also join in on the fun with specially designed low-impact games. What we offer The deal offers various options including packages suitable from solo players up to large groups of twenty. Each participant gets all necessary safety gear along with plenty of paintballs. Game modes like Elimination and Capture the Flag keep everyone engaged. 1 Player: 200 paintballs: Perfect for solo adventurers looking to join the fun 10 Players: 2,000 paintballs: Ideal for a small group outing full of excitement 2 Players: 400 paintballs: Great for pairs wanting some friendly competition 2 Players: 400 paintballs: Perfect choice for duo battles 20 Players: 4,000 paintballs: Excellent for large parties or team-building events 4 Players: 800 paintballs: Suited for double dates or family fun 6 Players: 1,000 paintballs: Awesome choice for medium-sized groups Why you should grab the offer This offer is perfect for anyone looking to enjoy an exhilarating day out filled with strategic gameplay and camaraderie. The unique setup at Gator Mike's Family Fun Park ensures safety while delivering maximum enjoyment. With options ranging from single-player packages to large group deals, there’s something here for everyone. The outdoor arena provides diverse challenges that cater to both beginners and seasoned players alike. Don’t miss out on this chance to create unforgettable memories with friends or family in an exciting setting. Enjoy a paintball game with safety gear and 200 paintballs each, perfect for groups seeking fun and excitement outdoors Get ready for an action-packed day! The deal includes a paintball game for up to twenty players, complete with 200 paintballs each. Ever wondered what it’s like to strategize in an outdoor arena filled with structures and bunkers? Enjoy the thrill of different game modes like Elimination or Capture the Flag while equipped with all necessary gear: guns, masks, hoppers, air, and paintballs. Kids can also join in on the fun with specially designed low-impact games. What we offer The deal offers various options including packages suitable from solo players up to large groups of twenty. Each participant gets all necessary safety gear along with plenty of paintballs. Game modes like Elimination and Capture the Flag keep everyone engaged. 1 Player: 200 paintballs: Perfect for solo adventurers looking to join the fun 10 Players: 2,000 paintballs: Ideal for a small group outing full of excitement 2 Players: 400 paintballs: Great for pairs wanting some friendly competition 2 Players: 400 paintballs: Perfect choice for duo battles 20 Players: 4,000 paintballs: Excellent for large parties or team-building events 4 Players: 800 paintballs: Suited for double dates or family fun 6 Players: 1,000 paintballs: Awesome choice for medium-sized groups Why you should grab the offer This offer is perfect for anyone looking to enjoy an exhilarating day out filled with strategic gameplay and camaraderie. The unique setup at Gator Mike's Family Fun Park ensures safety while delivering maximum enjoyment. With options ranging from single-player packages to large group deals, there’s something here for everyone. The outdoor arena provides diverse challenges that cater to both beginners and seasoned players alike. Don’t miss out on this chance to create unforgettable memories with friends or family in an exciting setting. Need To Know Info Promotional value expires 120 days after purchase. Amount paid never expires.    \n    Reservations required, contact by phone at (239) 574-4386. Must sign waiver. Valid only at Speedball Arena Limit 5 per person. \n    Merchant is solely responsible to purchasers for the care and quality of the advertised goods and services.\n    Learn about Strike-Through Pricing and Savings About Gator Mike's Family Fun Park Company Website Explore more Nearby Things To Do Sailing Bowling Golf Basketball Paintball Driving Ranges Racing Zipline"
    },
    {
      "url": "https://gatormikes.com/2024/04/24/discover-new-skills-and-thrills-at-gator-mikes-family-fun-park/",
      "text": "Discover New Skills and Thrills at Gator Mike’s Family Fun Park! - Gator Mike's Family Fun Park Skip to content CALL US DIRECTIONS CALL US DIRECTIONS BOOK ONLINE BUY ONLINE Home Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Paintball Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Food & Drinks Snack Bar Parties & Events Birthday Parties Group Outings Special Events Community Contact Us Fun Park Blog Donation Request Employment Policies Discover New Skills and Thrills at Gator Mike’s Family Fun Park! Hey Southwest Florida teachers and parents, are you looking to end the school year with a bang? Gator Mike’s Family Fun Park is the premier destination in Cape Coral! From heart-pounding adventures to educational mini-golf, we’ve got something for everyone. Read on to learn more about two of our most popular attractions. Test Your Limits With Aerial Adventures! Ready to challenge yourself? At Gator Mike’s, you can choose from two exhilarating ropes courses . The upper-level 14-element course is perfect for thrill-seekers, while the lower-level course offers a fun challenge for kids aged 5-11, parents, and those seeking a less intense adventure. Build confidence, explore your courage, and strengthen bonds as you navigate these exciting courses. Don’t forget to try our 36-foot climbing wall and 600-foot zip line for even more adrenaline-packed fun! Putt and Learn at Dinosaur Falls Mini Golf! Looking for a blend of fun and learning? Our Harris-designed Dinosaur Falls Mini Golf course is a putt-putt paradise that’s both engaging and educational. Since it boasts an ADA-compliant design, it’s open to everyone and offers a variety of obstacles and challenges to keep players of all ages entertained. As kids putt their way through, they’ll learn about sportsmanship, practice their math skills, improve hand-eye coordination, and sharpen problem-solving abilities. It’s mini golf with a dash of S.T.E.M. learning – but don’t tell them and spoil their fun! Why Choose Gator Mike’s for Your Field Trip? Gator Mike’s Family Fun Park is Southwest Florida’s premier destination for family fun and educational experiences. Our friendly staff ensures a safe and enjoyable visit for all, making us the perfect choice for your end-of-year school field trip. With a mix of thrilling adventures and educational activities, we guarantee a day filled with laughter, learning, and lasting memories. So, gather your students, pack your enthusiasm, and book your field trip at Gator Mike’s Family Fun Park today! It’s the perfect way to celebrate the end of the school year and create memories that will last a lifetime. We have education packages designed to meet any budget, so contact us at groupsales@gatormikes.com or call (239) 574-4386, option 1, to discuss your many options! See you soon at Gator Mike’s – where every day is an adventure! Gator Mike's 2024-04-24T17:00:50-04:00 Party With Us Facebook X WhatsApp Pinterest Email Search for: Recent Posts A Wild Ride at Gator Mike’s Bumper Boats Unforgettable Birthday Parties at Gator Mike’s Family Fun Park Discover New Skills and Thrills at Gator Mike’s Family Fun Park! Prehistoric Pizza Paradise: Mellow Mushroom & Gator Mike’s Join Forces! Have the Ultimate Kids’ Birthday Party at Gator Mike’s in Cape Coral! Archives May 2025 April 2025 April 2024 March 2024 December 2023 November 2023 October 2023 September 2023 March 2023 January 2023 December 2022 November 2022 September 2022 Categories Fun Park Blog Uncategorized Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Parties & Events Birthday Parties Group Outings Special Events Food & Drinks Snack Bar Contact Us Contact Form Donation Request Policies T: 239.574.4386 35 NE Pine Island Rd, Cape Coral, FL 33909 Hours Sunday - Thursday 11am - 9pm Friday - Saturday 11am - 10pm Aerial Ropes and Zipline Hours Saturday - Sunday ONLY 12pm -  6pm Page load link Sign Up for Deals & Coupons Name First Last Email * Δ X Go to Top"
    },
    {
      "url": "https://gatormikes.com/2024/03/05/gator-mikes-paintball-arena-where-the-fun-never-stops/",
      "text": "Gator Mike's Paintball Arena: Where the Fun Never Stops! - Gator Mike's Family Fun Park Skip to content CALL US DIRECTIONS CALL US DIRECTIONS BOOK ONLINE BUY ONLINE Home Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Paintball Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Food & Drinks Snack Bar Parties & Events Birthday Parties Group Outings Special Events Community Contact Us Fun Park Blog Donation Request Employment Policies Gator Mike’s Paintball Arena: Where the Fun Never Stops! Hey there, thrill-seekers! Ready to unleash your inner warrior and have a blast under the sun? Well, gear up because Gator Mike’s has the best paintball arena in Cape Coral, and it’s time for you to choose your adventure! Adventure Awaits: Traditional vs. Low Impact Paintball! Get ready for a paint-splattering showdown with our two action-packed options. In one corner, we’ve got the Traditional Paintball – 68 caliber paintballs for those who like the original action most. And in the other corner, we present the Low Impact paintball – 50 caliber paintballs that pack a punch without the sting. It’s the ultimate showdown of size versus speed! Bring your squad, your family, or even that one friend who thinks they’re a paintball pro. It’s time to strategize, plan your attack, and show off those paintball skills. And guess what? No need to drag your gear along; we’ve got everything covered – from guns to ammo and, of course, safety gear to keep the good times rolling. Play Until You Drop – Or Run Out of Ammo! The fun never stops at Gator Mike’s. Whether you’re a tactical genius or a paintball gunslinger, our Cape Coral paintball arena is the place to be. Play until you run out of ammo, but hey, if you’re not ready for the party to end, grab some more ammo and keep the paintball extravaganza alive! Target Practice and Tactical Mayhem! Feel like honing those sharpshooting skills? Head over to our target practice area and let loose. Or if you’re more of a team player, gather your friends and dive into some epic paintball battles. It’s all about making those unforgettable memories with your crew. Paintball for All Ages – And Safety First! Kids, teens, adults – everyone is invited! We recommend Low Impact (50 Caliber) for the younger bunch (5-13) and those who want the paintball experience with a little less “oomph.” Traditional (68 Caliber) is perfect for the older bunch (ages 14 and up) who are ready to dive into the full-throttle action. And remember, comfy clothes and closed-toe shoes are your paintball fashion must-haves! Safety is our priority, folks! Waivers are a must for everyone. Gator Mike’s is all about playing safe – we follow industry-standard safety guidelines to ensure you have the time of your life without any unexpected paintball tattoos. Thorough Safety Orientation – Because Safety Rocks! Before you embark on your paintball adventure, we’ve got a “Thorough Safety Orientation” waiting for you. Our paintball referee will cover all the do’s and don’ts, walk you through the safety features of the equipment, and make sure you’re prepped for a safe and enjoyable paintball experience. After all, a safe game is a fun game! Get in Touch – Let the Paintball Madness Begin! So, what are you waiting for? Call us at (239) 574-4386 (Option 1) or shoot us an email at groupsales@gatormikes.com to get all the deets. And hey, be sure to ask about our amazing discount offers – because who doesn’t love a good deal? Gather your crew, put on your game face, and let the paint-splattering madness begin at Gator Mike’s. It’s not just a game; it’s an adventure you’ll be talking about for ages! Gator Mike's 2024-03-05T17:13:55-05:00 Party With Us Facebook X WhatsApp Pinterest Email Search for: Recent Posts A Wild Ride at Gator Mike’s Bumper Boats Unforgettable Birthday Parties at Gator Mike’s Family Fun Park Discover New Skills and Thrills at Gator Mike’s Family Fun Park! Prehistoric Pizza Paradise: Mellow Mushroom & Gator Mike’s Join Forces! Have the Ultimate Kids’ Birthday Party at Gator Mike’s in Cape Coral! Archives May 2025 April 2025 April 2024 March 2024 December 2023 November 2023 October 2023 September 2023 March 2023 January 2023 December 2022 November 2022 September 2022 Categories Fun Park Blog Uncategorized Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Parties & Events Birthday Parties Group Outings Special Events Food & Drinks Snack Bar Contact Us Contact Form Donation Request Policies T: 239.574.4386 35 NE Pine Island Rd, Cape Coral, FL 33909 Hours Sunday - Thursday 11am - 9pm Friday - Saturday 11am - 10pm Aerial Ropes and Zipline Hours Saturday - Sunday ONLY 12pm -  6pm Page load link Sign Up for Deals & Coupons Name First Last Email * Δ X Go to Top"
    },
    {
      "url": "https://gatormikes.com/parties-events/group-outings/",
      "text": "Cape Coral Group Activities: Team Building, Group & Church Outings Skip to content CALL US DIRECTIONS CALL US DIRECTIONS BOOK ONLINE BUY ONLINE Home Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Paintball Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Food & Drinks Snack Bar Parties & Events Birthday Parties Group Outings Special Events Community Contact Us Fun Park Blog Donation Request Employment Policies Group Outings jalgu 2025-06-11T12:13:14-04:00 GROUP OUTINGS at Gator Mike’s Family Fun Park Have your next group event at Gator Mike’s Family Fun Park! If you are in Cape Coral, Fort Myers, Punta Gorda or other local areas, come over for fun and exciting events that motivate and connect your people. We offer endless avenues for events that improve the morale and build bonds – just what you need to create successful teams around your purpose. PHOTO GALLERY For inquiries, please call us at (239) 574-4386 (Option 1) or send an email to groupsales@gatormikes.com . BOOK NOW You can also select one of our Group Outing packages and book online: Silver (from $286.00) Gold (from $396.00) Platinum (from $495.00) Here are some of the events we can host for you Team Building Count on us to come up with team building events in Cape Coral. We can build a fruitful program that lasts anywhere from an hour and a half to an entire day. Client Appreciation Show a client your appreciation in the most enjoyable way! Your fun-loving clients will love our 19-hole ADA compliant mini golf course and our other amazing activities. Corporate Outing Who will emerge as a potential leader? Who is quite the daredevil? We’ll build for you a tailored program that will let you discover your team members’ unique personalities. Church Outing Gator Mike’s Family Fun Park in Cape Coral is great for church outings and is all about creating fun, wholesome experiences for all of our visitors! We offer games, rides, and food to liven up your church outing. Youth Group Activities Mix ministry with fun! Bring your youth group members to our park for a memorable youth group get-together. Come enjoy fun group activities in Cape Coral with your youth group today at Gator Mike’s! Community Church Fundraiser If you’re looking for new ways to raise funds for your community church, let us create a tailored fundraising event for your congregation! Spirit Days/Nights Bring your people to our park for your school’s or organization’s fundraiser and we will contribute a percentage of what you collect for your cause. Not only will you get to enjoy team bonding and group activities in Cape Coral at Gator Mike’s, but you can make a difference too! SIGN UP FOR DEALS & COUPONS Attractions Aerial Ropes / Ziplines / Climb Walls Go-Karts Bones & Bales Fall Festival Bumper Boats Mini Golf Arcade Spinzone Bumper Cars Plan Your Visit Prices & Specials Hours Location Park Rules Waiver of Claims Parties & Events Birthday Parties Group Outings Special Events Food & Drinks Snack Bar Contact Us Contact Form Donation Request Policies T: 239.574.4386 35 NE Pine Island Rd, Cape Coral, FL 33909 Hours Sunday - Thursday 11am - 9pm Friday - Saturday 11am - 10pm Aerial Ropes and Zipline Hours Saturday - Sunday ONLY 12pm -  6pm Page load link We’re Closed. X Sign Up for Deals & Coupons Name First Last Email * Δ X Go to Top"
    }
  ]
}