{
  "fuentes": [
    {
      "url": "https://www.midfloridanewspapers.com/authentic-irish-food-featured-at-gavaghans/article_a5a3cefa-df80-11ef-ad67-e3cf63293646.html",
      "email": "cindy.marshall@highlandsnewssun.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/authentic-irish-food-featured-at-gavaghans/article_a5a3cefa-df80-11ef-ad67-e3cf63293646.html",
      "email": "info@d-r.media"
    },
    {
      "url": "https://keagansvb.com/contact/",
      "email": "davidkelly@buzz-hospitality.com"
    },
    {
      "url": "https://keagansvb.com/contact/",
      "email": "keagansvb@keagansvb.com"
    },
    {
      "url": "https://business.sebring.org/directory/Details/gavaghan-s-irish-pub-3874864",
      "email": "ceo@sebring.org"
    },
    {
      "url": "https://www.gavskitchen.com/contact-us/",
      "email": "info@gavskitchen.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_sun/circle-park-improvements-just-about-right/article_35966ab4-1537-11ef-a7fe-5be6669e78b7.html",
      "email": "circulation@midfloridanewspapers.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_sun/circle-park-improvements-just-about-right/article_35966ab4-1537-11ef-a7fe-5be6669e78b7.html",
      "email": "john.guerra@highlandsnewssun.com"
    }
  ],
  "mails": [
    "ceo@sebring.org",
    "cindy.marshall@highlandsnewssun.com",
    "circulation@midfloridanewspapers.com",
    "davidkelly@buzz-hospitality.com",
    "info@d-r.media",
    "info@gavskitchen.com",
    "john.guerra@highlandsnewssun.com",
    "keagansvb@keagansvb.com"
  ],
  "nombre_sitio": "gavaghanspub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.midfloridanewspapers.com/authentic-irish-food-featured-at-gavaghans/article_a5a3cefa-df80-11ef-ad67-e3cf63293646.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://keagansvb.com/contact/",
      "text": "Contact • Keagans VB Skip to main content Home Icon Food & Drink Food Menus Drink Menus Whats On Parties About Keagan’s Gift Card Contact / Location Pub Talk For bookings call: 757 961 4432 Other Links Cookies Policy Privacy Statement Contact Bookings: 757 961 4432 Book a party Book a table Menu Contact Us Contact us using the form below or just drop in and chat to us in person. Penny for your thoughts Name * Email * Message * Contact details General enquiries Keagan's VB 244 Market Street Virginia Beach VA, 23462 Email keagansvb@keagansvb.com Tel: 757 961 4432 *** To contact our MD, David Kelly, email davidkelly@buzz-hospitality.com . Directions Get Google Maps directions straight to our door: Get directions Bookings For party bookings or any other booking inquiries: Booking inquiries Opening Hours Opening times may vary on National Holidays. Mon 11am - 2am Tue 11am - 2am Wed 11am - 2am Thu 11am - 2am Fri 11am - 2am Sat 12pm - 2am Sun 12pm - 2am Jobs at Keagan's If you’re interested in working in a fun and highly rewarding atmosphere, email inquiries or your resume to keagansvb@keagansvb.com Facebook Twitter Instagram Other Links Cookies Policy Privacy Statement Newsletter Sign up to our newsletter for all the latest news, events and deals at Keagan's. Email Address Sign Up Keagan's VB 244 Market Street Virginia Beach VA, \t\t\t\t\t\t\t\t23462 Contact: One of the Pub Team Phone: 757 961 4432 Email: keagansvb@keagansvb.com Owned & operated by: Keagan's Virginia Beach Copyright © 2025. All rights reserved Book a Party There are those special occasions in your life when a 6 pack and a couple of frozen pizzas just won’t cut it, so draft in the party professionals – the Irish. Name * Email * Phone * Date * MM slash DD slash YYYY Time * No. Guests Less than 10 Between 10 and 20 Between 20 and 30 Between 30 and 40 Between 40 and 50 Between 50 and 60 Between 60 and 70 Between 70 and 80 Between 80 and 90 Between 90 and 100 Over 100 people Party Type * Corporate Birthday Wedding Rehearsal Graduation Other Menu Type Plated Dinners Buffet Appetizer Special Dinners Cocktail Only Other Info"
    },
    {
      "url": "https://business.sebring.org/directory/Details/gavaghan-s-irish-pub-3874864",
      "text": "Gavaghan's Irish Pub Directory with Side Bar Ads - Sebring Chamber of Commerce Skip to content Menu Home Visitor Info Visitor’s Guide Things To Do Where To Stay 12 Hours of Sebring Visit Downtown Sebring Weather Chamber Meet the Board & Staff Become an Ambassador, Junior Ambassador, or Volunteer! Junior Ambassador Blog Join The Chamber Member Benefits Member Directory Chamber Events Circle Theatre Events Submit An Event Conference Room Facilities Scholarship Scheduling a Ribbon Cutting Our Community Community Events Community Profile History of Sebring Demographics Sebring News Job Postings Circle Theatre Events Business Info Start A Business Business Resources Member Directory Chamber Events External Links Contact Us Photo Library Menu Home Visitor Info Visitor’s Guide Things To Do Where To Stay 12 Hours of Sebring Visit Downtown Sebring Weather Chamber Meet the Board & Staff Become an Ambassador, Junior Ambassador, or Volunteer! Junior Ambassador Blog Join The Chamber Member Benefits Member Directory Chamber Events Circle Theatre Events Submit An Event Conference Room Facilities Scholarship Scheduling a Ribbon Cutting Our Community Community Events Community Profile History of Sebring Demographics Sebring News Job Postings Circle Theatre Events Business Info Start A Business Business Resources Member Directory Chamber Events External Links Contact Us Photo Library Gavaghan's Irish Pub Back to Search Gavaghan's Irish Pub Categories Restaurants, Food & Beverages 213 Circle Park Dr. , Sebring , FL , 33870 Send Email https://gavaghanspub.com/ Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Sebring Chamber of Commerce | Site by GrowthZone Get In Touch! (863) 385-8448 202 Circle Park Drive, Sebring, FL 33870 Monday thru Friday 8am to 4:30pm ceo@sebring.org Additional Resources Ar ea Guide Stay Connected! Facebook © 2025 Sebring Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.gavskitchen.com/contact-us/",
      "text": "Contact Us – Gav's Kitchen Skip to content Main Menu Home About Us Menu Contact Us Quotation Quotation Contact Us Are You Hungry? Book your next event with us! Gav's Kitchen Have Feedback? Contact Us We’d love to hear from you! Whether you have questions about our services, need a quote for your event, or just want to learn more about what we do, feel free to reach out. At Gav’s Kitchen, we’re here to bring exceptional catering to your production, no matter the scale or style. From films and TV dramas to commercials and music videos, our team specialises in delivering delicious meals that keep your cast and crew energised and focused. We pride ourselves on being highly adaptable to budgets while maintaining the quality and service you expect. Get in touch with us today to discuss your needs, and let us help make your production a success with catering tailored to your vision! Contact Information: Email: info@gavskitchen.com Phone: 074 1156 1386 Address: 18 Osram Road, East lane business park, HA9 7NG Stay Connected: Follow us on social media for the latest updates, promotions, and behind-the-scenes looks at our culinary creations. We look forward to making your next event deliciously memorable! Let's Eat. Taste the difference Contact us 18 Osram Road East Lane Business Park Wembley HA9 7NG info@gavskitchen.com Or Call Us : 074 1156 1386 Facebook-f Instagram Copyright © 2025 Gav's Kitchen Powered by Gav's Kitchen"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_sun/circle-park-improvements-just-about-right/article_35966ab4-1537-11ef-a7fe-5be6669e78b7.html",
      "text": "Please wait while we attempt to load the requested page"
    }
  ]
}