{
  "fuentes": [
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-about",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-drink-menu",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://genxtavern.com/",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-events",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-food-menu",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://genxtavern.com/-events",
      "email": "contactus@genxtavern.com"
    },
    {
      "url": "https://www.fox13news.com/good-day-tampa-bay/genx-tavern-a-new-tampa-eatery-will-fill-you-with-80s-and-90s-nostalgia",
      "email": "fox13tampanews@foxtv.com"
    },
    {
      "url": "https://genx-sheetal-regency-mathura.hotelsgds.com/contact-us/",
      "email": "genx-sheetal-regency-mathura-2@hotelsgds.com"
    },
    {
      "url": "https://genx-sheetal-regency-mathura.hotelsgds.com/contact-us/",
      "email": "info-2@hotelsgds.com"
    }
  ],
  "mails": [
    "contactus@genxtavern.com",
    "fox13tampanews@foxtv.com",
    "genx-sheetal-regency-mathura-2@hotelsgds.com",
    "info-2@hotelsgds.com"
  ],
  "nombre_sitio": "genxtavern.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-about",
      "text": "GenX Tavern - About Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery Gen X Tavern Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Gen X Tavern About us Located in Downtown Tampa, Gen X Tavern was created for people who take their food and drink seriously, but not themselves. Our restaurant bar is full of nostalgia that will remind you of some of the best times of your life, all while you enjoy some classic treats with a current influence. We have that Modern Fare with Retro Flair! Decked out in the fads of yesteryear with a contemporary twist, we pay homage to a period of time - that if you were there - was both awesome and a beautiful disaster. Hello, 80's and 90's. Our jeans may be a little tighter and dance moves funkier, but at the end of the day we've all got something in common. Let the good times roll. Gen X Tavern honors 80's and 90's style, swagger, and unflinching character. It almost feels like you've been here before, because you have... if not literally, certainly figuratively. Welcome to your new favorite restaurant and neighborhood bar! Located in Downtown Tampa, Florida, blocks from Curtis Hixon Park, Amalie Arena and The Tampa Riverwalk, our dining area is decked out with nostalgic decor while our food and drink menu is inspired by currently popular and timeless dishes. We have the Modern Fare with Retro Flair! Contact us: by phone (813)-694-7001, by email contactus@genxtavern.com Order Parties Catering Jobs"
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-drink-menu",
      "text": "GenX Tavern - Drink Menu Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery Our Drinks Beverages Wine Cocktails Beer Spirits Beverages Coke $2.69 Diet Coke $2.69 Sprite $2.69 Dr. Pepper $2.69 Coke Zero $2.69 Gold Peak Unsweet Tea $2.69 Minute Maid Lemonade $2.69 Cranberry Juice $2.69 OJ $2.69 Apple Juice $2.69 Stella Artois Liberte 0% $5.00 Red Bull Regular $4.00 Sugar Free $4.00 Watermelon $4.00 Blueberry $4.00 Bubbles Ruffino Prosecco $8.50/187 ml split Ruffino Rose $8.50/187 ml split Mary Lou Retton Bucket of Splits - 3 Perfect 10's $30.00 Served with carafe of orange juice, cranberry or Tang - 5 splits Gambino Brut $8.00/glass Medium dry sparkling wine Perrier-Jouet Champagne $69.00/bottle We fancy! White Chateau Ste . Michelle Riesling $8.00/glass Blended riesling gropes from vineyards throughout Washington's Columbia Valley make this a refreshing white wine with a crisp and fruity taste. Bright flavors of white peach, green apple. mango, and lemon-lime Jermann Pinot Grigio $9.00/glass Italian nd straw-yellow in colour, aroma is intense, full and fruity, with excellent persistence. taste is dry, velvety, fragrant and persistent Oyster Bay Sauvignon Blanc $9.50/glass Aromas of sliced lime, guava, star fruit, savory herbs and flowers. medium-bodied, fresh and crisp with a juicy, mouthwatering nature. flavorful and bright Rabble Rose $9.00/glass Bright aromas of strawberry, grapefruit and watermelon rind. punchy and crisp on the palate. refreshingly dry with mouthwatering acidity Simi Chardonnay $9.50/glass Russian River Valley wine with flavors of citrus, green apple and nectarine, followed by toasty oak and a fine minerality. clean delicate fruit balanced with acidity builds to a long, lingering finish Kiss Army Eva White $45.00/bottle You wanted the best, you got the best! Rock and roll all night with this 2017 Spanish wine. Proof Awards Double Gold & 99 Rated. take home the souvenir bottle! Red J Vineyards Pinot Noir $9.00/glass Smooth, balanced and approachable, J Multi-Appellation Pinot Noir offers polished, fruit-driven flavorful notes of dark plum, black cherry, boysenberry and baked strawberry are nicely layered on the plush palate with hints of cocoa dust, clove and toasted almond. Soft and approachable with generous fruit characteristics Hahn Founders Pinot Noir $9.00/glass Aromas of red and dark cherry, raspberry and strawberry joined by subtle touches ofvanilla and toasty oak. Palate ismedium-bodied with silky tannins, a softround mouthfeel Hahn Founders Cabernet Sauvignon $9.00/glass vibrant aromas of red and dark cherry, raspberry and plum, subtle touches of vanilla and toasted oak. silky tannins and excellent acid balance are joined by delicate flavors of red cherry and raspberry Cocktails I Smell Sex and Candy $12.00 Misguided spirits howe & hummels crooked vodka, St. Germaine elderflower liquor, lime juice, lemonade, sparkling rose, rock candy Give Me Those Pop Rockin' Beats $12.00 Ketel one vodka, midori melon liqueur, chambord raspberry liqueur, pineapple, watermelon pop rocks Princess Peach $12.00 Don julio blanco, peach schnapps, lime, dash grenadine Espresso Yourself Martini $12.00 House brewed nitrogen infused ketel one espresso, kahlua coffee liqueur, simple Strawberry Starburst $11.00 Smirnoff vanilla vodka, watermelon pucker, Hawaiian punch, half & half, sprite Cheech & Chong-A-'rita $13.00 Misguided spirits black dove’s sacred blanco heart tequila, KORE cbd oil, agave, lime, watermelon pucker, KORE cbd gummy garnish Purple Rain $12.00 Astral reposado tequila, cointreau orange liqueur, agave nectar, blueberry syrup, hibiscus Pretty in Pink $11.00 Smirnoff blueberry vodka, Gambino brut, lemon, simple syrup, cranberry Ye Olde Fashioned $13.00 New riff Kentucky straight bourbon whiskey (bottled in bond), angostura bitters, simple syrup, orange rind, cherry From Dusk 'Til Dawn $11.00 Misguided spirits black dove’s sacred heart reposado tequila, cointreau orange liqueur, fresh lime juice, agave nectar, spicy mango, fresh jalapeno Pump up The Jam $12.00 Bacardi rum, lemon, raspberry jam, raspberries, blueberries, topped with sprite Bangin' Tang-A-'Rita $11.00 Misguided spirits black dove’s sacred heart blanco tequila , agave, lime, tang, with a tang rim Loaded Sunny D $9.00 Margaritaville tequila, grenadine, sunny d. served in a classic sunny d bottle! Kiss from A Rose $12.00 Ketel one grapefruit rose, new amsterdam stratusphere gin, hibiscus, orgeat, lemon, grapefruit soda. Adult Capri Sun $9.50 made in house with Cruzan flavored rums Shots Blue Bolt Shot $7.00 New Amsterdam pink Whitney vodka, blue curacao, lemon juice. Buc'd Up Shot $7.00 Fireball cinnamon whiskey, goldschlager liqueur, grenadine, house sour, sugar rim. Top Gun Shot Flight: $20.00 Bottle to throttle...? not today, FAA! Kick the tires and light the fires! *Shots may be purchased separately for $8 each The Maverick Van Gogh double espresso vodka, Frangelico hazelnut liqueur, rumchata cream liqueur The Goose Disaronno italian liqueur, frangelico hazelnut liqueur, rumchata cream liqueur, walnut bitters The Iceman Rumple Minze peppermint liqueur, Frangelico hazelnut liqueur, rumchata cream liqueur Gusher $8.00 Just like at school lunch, but now you don’t have to share! New Amsterdam raspberry vodka, Midori Melon\nliqueur, pineapple juice Spicoli’s CBD $9.00 Catch a cool buzz with these tasty waves! new amsterdam berry vodka, peach schnapps, blue curacao, pineapple, KORE CBD oil, KORE CBD gummy garnish Creamsicle $8.00 Yabba-dabba- *copyright redacted* Sunshine punch orange creme, vodka, rum, creme liqueur Screaming O! $8.00 Do your best Meg Ryan impression and receive $2 off! “I’ll have what she’s having!” New Amsterdam orange vodka, sunshine punch orange creme, orange bitters, OJ Tang-A-Rang $9.00 Our take on a classic “bomb” style shooter New Amsterdam lemon vodka, spring 44 gin, house sour mix, glass of tang Florida Green Tea $8.00 Don’t act like you’ve never had one Jameson orange Irish whiskey, peach schnapps, sour Cocaine Bear $9.00 rrrrRRRRaaaaAAAAwwwwWWWWrrrrRRRR! Sub-Zero chilled rumple minze and house brewed nitrogen-infused Ketel One espresso White Mystery Airhead $8.00 Guess the flavor! or... just read below, new am red berry, watermelon, lemonade Jell-O Shots $2.00 Draft Mich Ultra Motorworks $6.00 Pulp Friction IPA Tbbc Reef $8.00 Donkey Apa Flave $8.00 Luminescence Hazy IPA Home $8.00 State Oh My Gatos! IPA Tank $8.00 Freedom Tower Amber $8.00 Barriehaus Tampa Export Lager $8.00 Kona Big Wave Golden Ale $8.00 Hidden Springs Orange Crush $8.00 Coppertail Unholy 12oz $9.00 Stella Artois $8.00 Stone Buenaveza Salt & Lime Lager $7.50 Cans/Bottles High Noon Flavors $7.50 pineapple, watermelon, peach Nutrl Flavors $7.50 orange, pineapple, watermelon Surfside Iced Tea & Vodka $7.00 Budweiser $6.00 Bud Light $6.00 Coors Light $6.00 Miller Lite $6.00 Corona $6.00 Yuengling $6.50 Jai Alai $7.00 Wicked Weed Burst Sour $7.00 3Daughters Raspberry Lemonade Hard Cider $7.00 Angry Orchard $6.00 Islamorada Citrus Ale $6.00 Guinness $7.00 Abita Strawberry Lager $6.00 Smirnoff Ice $5.00 Bourbon/ Whiskey Old Grand Dad (House) $7.00 American Honey $8.00 Angel's Envy $11.00 Basil Hayden $11.00 Crown Royal $9.00 Crown Apple $9.00 Crown Peach $9.00 Fireball $7.50 Four Roses Bourbon $11.00 High West Bourbon $9.00 High West Rye $9.00 Jack Daniels $8.00 Jameson $8.50 Jim Beam $8.00 Knob Creek Bourbon $9.00 Knob Creek Rye $9.00 Maker's Mark $11.00 Tullamore Dew $8.50 Uncle Nearest 1856 $13.00 Uncle Nearest 1884 $11.00 Skrewball $7.50 Woodford Reserve $12.00 Scotch The Balvenie 12 $13.00 The Balvenie 14 Caribbean Cask $20.00 Dewars $7.50 Glenfiddich 12 Yr $12.00 Glenfiddich 14 Yr $14.00 The Glenlivet 12 Yr $12.00 Johnny Walker Black $9.00 Johnny Walker Blue $22.00 Laphroaig 10 Yr $13.00 Macallan 12 Yr $13.00 Speyburn $9.00 Vodka Skyway Spirits Vodka (House) $7.00 Absolute $8.00 Firefly Sweet Tea $8.00 Grey Goose $10.00 Ketel $9.00 Ketel One Grapefruit Rose Botanical $9.00 New Amsterdam Lemon $7.00 New Amsterdam Raspberry $7.00 New Amsterdam Orange $7.00 New Amsterdam Berry $7.00 New Amsterdam Pink Whitney $7.00 Smirnoff Blueberry $7.00 Smirnoff Vanilla $7.00 Stolichnaya $8.00 Titos $8.00 Truly Mango $8.50 Van Gogh Double Espresso $9.00 Tequila Camarena (House) $7.00 1800 Cristalino $15.00 Avion 44 $23.00 Avion Cristalino $23.00 Altos $10.00 Don Julio Silver $9.00 Don Juilio 1942 $28.00 Camarena Reposado $9.50 Casa Noble Blanco $8.00 Casa Noble Repo $10.00 Casamigos Silver $9.00 Casamigos Repo $12.00 Casamigos Anejo $15.00 Cincoro Anejo $22.00 Clase Azul Blanco $20.00 Clase Azul Repo $25.00 Clase Azul Ultra $215.00 Don Fulano Reposado $15.00 Herradura $8.50 Herradura Reposado $10.50 Lobos Joven $13.00 Milagro $7.50 Milagro Reposado $9.00 Patron $9.00 Santo Blanco $9.00 Santo Repo $11.00 Teremana $9.00 Teremana Reposado $11.00 Union Mezcal $9.00 Rum Skyway Spirits Rum (House) $7.00 Bombarda Culverin Barbados 5 Yr $8.00 Bombarda Falconet Barbados 8 Yr $10.00 Bacardi $8.00 Bacardi Dragonberry $8.00 Bacardi Limon $8.00 Brugal 1888 $9.00 Captain Morgan $7.50 Cruzan Coconut $7.00 Meyer's $8.00 Papas Pilar Dark $9.00 Plantation 3 Stars $8.00 Ron Zacapa 23 $8.00 Gin Skyway Spirits (House) $7.00 Bombay Sapphire $9.00 Gray Whale $9.00 New Amsterdam Stratusphere $8.00 Tanqueray $8.00 Hendricks $11.00 Order Parties Catering Jobs"
    },
    {
      "url": "https://genxtavern.com/",
      "text": "GenX Tavern - Downtown, Tampa, FL × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We're hiring! Call, email or submit an inquiry today to learn more! Job Listings × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Order your favorite dishes in seconds! Order Online × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Call to Inquire Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery the video sound on or off map marker pin 103 East Jackson Street, Tampa, FL 33602 Private parties Book Your Next Party With Us! GenX Tavern would be honored to provide our services for your next event.  Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. Book a party Catering Let Us Cater Your Special Occasion! Good food is an essential part of any event - let us do the catering and make it one to remember. Inquire catering Order online Pick Up Your Favorite Food Don't feel like cooking today? We got you covered - order now! Order Proud To Be Authentic Our Menu We craft unique cocktails Drinks Your Private Party Spot Book a party Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing _ Modern Fare with Retro Flair Located in Downtown Tampa, Gen X Tavern was created for people who take their food and drink seriously, but not themselves. Read more about us Events Wednesday Night Karaoke! Wednesday September 10th Every Wednesday Get ready to sing your heart out at GenX Tavern’s Wednesday Night Karaoke with Events Done Right , kicking off tonight at 7:00 PM! Whether you’re a seasoned performer or just looking to have some fun, grab the mic and belt out your favorite hits—from 80s anthems and 90s throwbacks to today’s chart-toppers! All music genres welcome  Drink specials all night  Good vibes, great crowd, and non-stop entertainment GenX Tavern | 103 East Jackson Street, Downtown Tampa  No cover | All ages welcome GiRLs night OUT Thursday September 11th Every Thursday It’s GiRLs Night OUT at GenX Tavern! Grab your crew and head to Downtown Tampa every Thursday for the ultimate throwback party! We’re spinning the best pop hits from the 80s, 90s, 2000s, and today — everything from Britney to Beyoncé, Spice Girls to Sabrina.       *2-for-1 drinks for ladies from 8PM–10PM  *Pop anthems all night long     103 E Jackson St – right in the heart of downtown Let’s dance, sip, and sing like it’s girls night every night! Too Fresh Fridays Friday September 12th Every Friday Kick off the weekend with Too Fresh Fridays at GenX Tavern !   Join us in downtown Tampa for a night of old-school rap and classic party jamz, guaranteed to keep you moving from 8 PM to 1 AM.    Special guest DJs spin the hottest throwbacks and legendary beats that defined an era. Whether you’re vibing at the bar or hitting the dance floor, this is the spot to relive the days of the best of hip-hop and party anthems.    No cover – just good vibes, great drinks, and timeless music. Pull up, bring your crew, and get fresh! The Grind at GenX Tavern Saturday September 13th Every Saturday MTV's The Grind taught a generation how to dance and we're keeping your booty shaking and hands waving as we bring that energy to Downtown Tampa at GenX Tavern every Saturday Night! The Grind features some of Tampa's best DJ's like DJ Chris Craze, Matt The Bratt, DJ Matt Dodge and more spinning an uptempo party mix of classic 80s and 90s jams mashed up with some current pop hits. Monday Night Trivia Monday September 15th Every Monday Get your team together, head downtown and win some awesome prizes while enjoying great food and drinks every Monday for T rivia Night at GenX Tavern with Events Done Right ! Tampa's best Trivia Night kicks off at 7pm so bring your pop culture knowledge and compete for the trophy! Stop events carousel Play events carousel Reviews Review by - Google Ben B: Found another gem in Tampa! Decor is spot on. N64 with Mario Kart is always a plus. The manager turned the sound on to the NBA Finals for us. Fantastic experience. Review by - Google Kelly W: This was such a fun find! The atmosphere is top notch, loved looking at all of the awesome decor all over the bar. We had the Dunkaroos and it was a very large portion and a bit much. Review by - Google Antony F: Great themed pub. Food was good and the drinks where spectacular. If you're a Gen X'r you'll have great nostalgia, if not, you'll still like the food and drinks. Review by - Google Ryan B: Incredibly unique food and drink options combined with an amazing ambiance that's directly out of my days from middle school. It's incredibly nostalgic and I love it Review by - Google Gracie G: Went here for drinks with friends and the fried pickles were amazing! The DJ was playing great music and the atmosphere is fun and lively. The server was attentive and nice. Stop reviews carousel Play reviews carousel Newsletter Location 103 East Jackson Street Tampa, FL 33602 Hours Tue, Wed, Thur 11:00 AM - 12:00 AM Fri, Sat 11:00 AM - 1:00 AM Sun, Mon 11:00 AM - 10:00 PM Find us on... Twitter page Facebook page Instagram page Google page Contact us (813)-694-7001 contactus@genxtavern.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Order Parties Catering Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-events",
      "text": "GenX Tavern - Events Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery Events Wednesday Night Karaoke! Wednesday September 10th Every Wednesday Get ready to sing your heart out at GenX Tavern’s Wednesday Night Karaoke with Events Done Right , kicking off tonight at 7:00 PM! Whether you’re a seasoned performer or just looking to have some fun, grab the mic and belt out your favorite hits—from 80s anthems and 90s throwbacks to today’s chart-toppers! All music genres welcome  Drink specials all night  Good vibes, great crowd, and non-stop entertainment GenX Tavern | 103 East Jackson Street, Downtown Tampa  No cover | All ages welcome 07:00 PM - 11:00 PM 2025-09-10 19:00:00 2025-09-10 23:00:00 America/New_York Wednesday Night Karaoke! Get ready to sing your heart out at GenX Tavern’s Wednesday Night Karaoke with Events Done Right, kicking off tonight at 7:00 PM! Whether you’re a seasoned performer or just looking to have some fun, grab the mic and belt out your favorite hits—from 80s anthems and 90s throwbacks to today’s chart-toppers!  All music genres welcome  Drink specials all night  Good vibes, great crowd, and non-stop entertainment  GenX Tavern | 103 East Jackson Street, Downtown Tampa  No cover | All ages welcome GenX Tavern GenX Tavern contactus@genxtavern.com GiRLs night OUT Thursday September 11th Every Thursday It’s GiRLs Night OUT at GenX Tavern! Grab your crew and head to Downtown Tampa every Thursday for the ultimate throwback party! We’re spinning the best pop hits from the 80s, 90s, 2000s, and today — everything from Britney to Beyoncé, Spice Girls to Sabrina.       *2-for-1 drinks for ladies from 8PM–10PM  *Pop anthems all night long     103 E Jackson St – right in the heart of downtown Let’s dance, sip, and sing like it’s girls night every night! 08:00 PM - 12:00 AM 2025-09-11 20:00:00 2025-09-11 00:00:00 America/New_York GiRLs night OUT It’s GiRLs Night OUT at GenX Tavern!        Grab your crew and head to Downtown Tampa every Thursday for the ultimate throwback party! We’re spinning the best pop hits from the 80s, 90s, 2000s, and today — everything from Britney to Beyoncé, Spice Girls to Sabrina.       *2-for-1 drinks for ladies from 8PM–10PM  *Pop anthems all night long     103 E Jackson St – right in the heart of downtown    Let’s dance, sip, and sing like it’s girls night every night! GenX Tavern GenX Tavern contactus@genxtavern.com Too Fresh Fridays Friday September 12th Every Friday Kick off the weekend with Too Fresh Fridays at GenX Tavern !   Join us in downtown Tampa for a night of old-school rap and classic party jamz, guaranteed to keep you moving from 8 PM to 1 AM.    Special guest DJs spin the hottest throwbacks and legendary beats that defined an era. Whether you’re vibing at the bar or hitting the dance floor, this is the spot to relive the days of the best of hip-hop and party anthems.    No cover – just good vibes, great drinks, and timeless music. Pull up, bring your crew, and get fresh! 08:00 PM - 01:00 AM 2025-09-12 20:00:00 2025-09-12 01:00:00 America/New_York Too Fresh Fridays Kick off the weekend with Too Fresh Fridays at GenX Tavern!   Join us in downtown Tampa for a night of old-school rap and classic party jamz, guaranteed to keep you moving from 8 PM to 1 AM.    Special guest DJs spin the hottest throwbacks and legendary beats that defined an era. Whether you’re vibing at the bar or hitting the dance floor, this is the spot to relive the days of the best of hip-hop and party anthems.    No cover – just good vibes, great drinks, and timeless music. Pull up, bring your crew, and get fresh! GenX Tavern GenX Tavern contactus@genxtavern.com The Grind at GenX Tavern Saturday September 13th Every Saturday MTV's The Grind taught a generation how to dance and we're keeping your booty shaking and hands waving as we bring that energy to Downtown Tampa at GenX Tavern every Saturday Night! The Grind features some of Tampa's best DJ's like DJ Chris Craze, Matt The Bratt, DJ Matt Dodge and more spinning an uptempo party mix of classic 80s and 90s jams mashed up with some current pop hits. 08:00 PM - 01:00 AM 2025-09-13 20:00:00 2025-09-13 01:00:00 America/New_York The Grind at GenX Tavern MTV's The Grind taught a generation how to dance and we're keeping your booty shaking and hands waving as we bring that energy to Downtown Tampa at GenX Tavern every Saturday Night!  The Grind features some of Tampa's best DJ's like DJ Chris Craze, Matt The Bratt, DJ Matt Dodge and more spinning an uptempo party mix of classic 80s and 90s jams mashed up with some current pop hits. GenX Tavern GenX Tavern contactus@genxtavern.com Monday Night Trivia Monday September 15th Every Monday Get your team together, head downtown and win some awesome prizes while enjoying great food and drinks every Monday for T rivia Night at GenX Tavern with Events Done Right ! Tampa's best Trivia Night kicks off at 7pm so bring your pop culture knowledge and compete for the trophy! 07:00 PM - 10:00 PM 2025-09-15 19:00:00 2025-09-15 22:00:00 America/New_York Monday Night Trivia Get your team together, head downtown and win some awesome prizes while enjoying great food and drinks every Monday for Trivia Night at GenX Tavern with Events Done Right!  Tampa's best Trivia Night kicks off at 7pm so bring your pop culture knowledge and compete for the trophy! GenX Tavern GenX Tavern contactus@genxtavern.com Order Parties Catering Jobs"
    },
    {
      "url": "https://genxtavern.com/tampa-downtown-genx-tavern-food-menu",
      "text": "GenX Tavern - Food Menu Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery Our Menu *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Party Startes When I Dip, You Dip, We Dip! $10.50/+ Guac, pico • Pick one $10.5 | Pick two $12.5 Corn Dog Nuggets $10.50 Served with cracked peppercorn honey mustard. Cheese Curds $11.50 Served w/side of marinara. Jalapeno Poppers $14.50 Pulled pork, smoked gouda, cream cheese, halved jalapeno, wrapped in bacon, packed with smokey flavor! Buffalo Chicken Dip $13.50 Tender shredded chicken thigh, smoked bacon, house sauce and cheese blend, fresh chives, celery, carrots, housemade corn tortilla chips Fried Pickles $10.50 Chips, spears, or fries. Whatever we have in stock -served with side of ranch. Empa-de-Nadas $13.50 Warmly spiced and seasoned beef, Mexican cheese blend, tender and flaky crust (2 per order) Slider Trio $14.50 Choose: French Onion Burger, Nashville Chicken, or BBQ Pork n' Tanglers | Can't decide?? Sample one of each at no extra charge | *Served on an everything seed Hawaiian slider. Tot-Chos $13.50 Tater tot nachos with bacon, queso, jalapenos, chives, and sour cream. Add pork for only $3 Buffalo Wings $11.50/+ 6 for $11.5 | 12 for $19.90 | \"Cluck yeah!\" • Sauces:  Hot or Medium - BBQ - Lemon Pepper - Nashville Hot - General Tso - Mango Habanero - Garlic Herb Parmesan - Blackened Dry Herb Parmesan Chicken Tendies $13.50 Tender, breaded strips of all white meat chicken • Sauces: Hot or Medium - BBQ - Lemon Pepper - Nashville Hot - General Tso - Mango Habanero - Garlic Herb Parmesan - Blackened Dry Herb Parmesan \"Call Me\" Cauliflower $12.50 Battered and fried to perfection • Sauces: Hot or Medium - BBQ - Lemon Pepper - Nashville Hot - General Tso - Mango Habanero - Garlic Herb Parmesan - Blackened Dry Herb Parmesan B.Y.O. Pizza Every pizza is a personal pizza if you try hard and belive in yourself. B.Y.O. Pizza $13.50 Each topping just +$0.75 • Base -  12\" Hand-tossed style: Classic flour pizza dough | Tomato and basil pizza sauce | Mozzarella/provolone blend • Meats: Pepperoni | Italian sausage | Bacon • Veggie: Mushroom | Peppers | Red onion | Tomato | Jalapeno On the Side Side Caesar Salad $3.00 Side House Salad $3.00 Po-Ta-To Tots $4.00 Shoestring Fries $3.00 Onion Rings $4.00 Broccoli $4.00 Sugar, Mr. Poon? I'll have what she's having. Dunkaroos $10.50 Animal crackers, sweet confetti dip. Handhelds Good sandwiches get remembered. Great Sandwiches never die. The Hellraiser $15.50 Buffalo chicken (fried or grilled), Mt. St Helen's sauce, pickled jalapeno, cheese curd, ranch dressing. Buffalo Chicken Sandwich $14.50 Buffalo chicken (grilled or fried), lettuce, tomato, blue cheese crumbles, ranch dressing. Freebird $14.50 Fried chicken, Texas petal sauce, dill pickles (add cheese for +$1.00) | *Try it Nashville hot style!' Quesadillas $14.50/+ Steak ($15.50) - Shaved ribeye steak, cheddar, sauteed onions, mushrooms, housemade honey sauce • BBQ Chicken ($15) - Diced chicken breast sauteed onions, mushrooms, cheddar, BBQ sauce • Bacon Cheeseburger ($13.80) - 100% fresh beef, tomatoes, bacon, cheddar, sauteed onions, texas petal sauce The Tampa Club Wrap $14.50 Patuxent genoa salami, deli ham, sugar cured bacon, tomato, lettuce, cheddar, mayo, grilled flour tortilla. Philly Cheesesteak $15.50 Shaved ribeye steak, peppers, sauteed onions. Served with Melted cheddar or Whiz wit!\" Chicken Bacon Ranch Philly $15.50 Grilled chicken, bacon, lettuce, tomato, housemade ranch, cheddar. Richard Simmons Salads & Bowls *Make any salad a wrap at no extra charge • Proteins & add-ons: Grilled or Fried Chicken +$4.50 | Burger (Crumbled) +$3.50 | Beyond Burger (Crumbled) $4.50 | Bulgogi Steak Strips $5.50 | Seasoned Steak $5.50 • Dressings: Caesar | Ranch | Bleu Cheese | Peppercon Honey Mustard | White Balsamic Vinaigrette | Oil & Vin Chef Salad $14.50 Fresh spring mix, ham, potuxent genoa salami, swiss, hard boiled egg, croutons. General Tso's Bowl $15.50 Cauliflower, chicken (fried or grilled), or bulgogi steak (+3) tossed in general Tso’s sauce, rice, roasted broccoli, boiled onion, shaved carrot, chive, sesame seeds, crisp wonton strips, chopsticks Tombstone Bowl $13.50 Black beans, corn, bell peppers, sauteed onion, rice, shredded pepperjack, chipotle sauce Cobb Salad $15.00 Choice of dressing, romaine & arugula blend, hard boiled egg, guacamole, black bean, red onion, tomato, corn, house croutons, bleu cheese, bacon. Hail, Caesar Salad $13.50 Zesty caesar dressing, crisp romaine, parmesan, house croutons Mount Olypus $14.50 Crisp romaine and arugula blend, feta cheese, kalamata olives, red onion, banana peppers, cucumbers, sliced tomato, tzatziki, Greek dressing Choppa da Salad $15.00 Crisp romaine, salami, banana peppers, grape tomato, garbanzo beans, cucumber, red onion, shredded mozzarella, red wine vinaigrette Burgers Home of the most smashing burgers in Tampa Bay...yeah baby! The Peanut Butter Solution $16.50 *Featured in Tampa Magazine 2022 | Housemade bacon infused peanut butter, housemade roasted jalapeno raspberry jam, provolone, arugula. Truffle Shuffle $15.50 Sauteed mushrooms, truffle oil, sauteed onions, swiss, horseradish sauce, cheese curds. Hotel California $15.50 Bacon, housemade guacamole, pepper jack, arugula. \"Fire that Pigskin\" Burger $16.50 A West Canaan. TX favorite- 100% fresh griddle seared beef, slow smoked pulled pork, battered onion ring, cheddar, sweet & tangy BBQ French Onion Burger $16.50 Sweet onion bacon jam, sauteed onions, provolone cheese, arugula Always Bet on Black and Bleu $15.50 House blackened seasoning, bleu cheese crumbles, bleu cheese dressing, onion ring, arugula (add bacon $1) Smashmouth Cheesburger $13.50/+ Fresh 100% beef, tomato, onion, bib lettuce, cheddar, big mick sauce • Single $13.50 | Double $16.50 | Triple $19.50 Macgyver Burger $15.50 Tell him what you want and he will assemble it for you! • Spice up your life and sub: Chicken +$1.00 | Beyond +$4.00 • Pick a sauce, cheese and up to 3 veggies. (add extra veggie for $0.50) • Bread: Brioche | Texas toast • Sauce: Big Mick sauce | Marinara | BBQ | Texas Petal | Honey mustard | Mt. St. Helens | Buffalo | Horseradish • Cheese: Provolone | Cheddar | Bleu cheese | Pepper Jack | Cheese curds | Swiss • Veggie: Arugula | Tomato | Onion | Pickled jalapeno | Fresh Jalapeno | Mushroom | Guacamole | Pico | Sauteed onion | Sauteed peppers • Protein: Bacon +$1.00 | Extra patty +$4.00 | Egg +$1.00 | Grilled chicken +$1.00 | Fried chicken X Merch Koozies $5.00 Drawstring Backpack $10.00 Shot Glass $5.00 Reusable Cooler Bag $7.00 Genx Top Gun Shirt $25.00 Genx Disney Shirt $25.00 Genx Hard Rock Shirt $25.00 Genx Dri-Fit Shirt $20.00 (White, Pink, Or Black) Mens Genx Logo T-Shirt $20.00 Womens Genx Logo V Neck $20.00 Womens \"Take Me Home Tonight\" Tank $18.00 Spaceballs the Flamethrower 1.000.000 Spacebucks Order Parties Catering Jobs"
    },
    {
      "url": "https://genxtavern.com/-events",
      "text": "GenX Tavern - Events Skip to Main Content (813)-694-7001 contactus@genxtavern.com 103 East Jackson Street                                                          , Tampa Menu Order Online Parties Events Catering Jobs About Gallery Twitter page Facebook page Instagram page Google page Toggle navigation Twitter page Facebook page Instagram page Google page Menu Order Online Parties Events Catering Jobs About Gallery Events Wednesday Night Karaoke! Wednesday September 10th Every Wednesday Get ready to sing your heart out at GenX Tavern’s Wednesday Night Karaoke with Events Done Right , kicking off tonight at 7:00 PM! Whether you’re a seasoned performer or just looking to have some fun, grab the mic and belt out your favorite hits—from 80s anthems and 90s throwbacks to today’s chart-toppers! All music genres welcome  Drink specials all night  Good vibes, great crowd, and non-stop entertainment GenX Tavern | 103 East Jackson Street, Downtown Tampa  No cover | All ages welcome 07:00 PM - 11:00 PM 2025-09-10 19:00:00 2025-09-10 23:00:00 America/New_York Wednesday Night Karaoke! Get ready to sing your heart out at GenX Tavern’s Wednesday Night Karaoke with Events Done Right, kicking off tonight at 7:00 PM! Whether you’re a seasoned performer or just looking to have some fun, grab the mic and belt out your favorite hits—from 80s anthems and 90s throwbacks to today’s chart-toppers!  All music genres welcome  Drink specials all night  Good vibes, great crowd, and non-stop entertainment  GenX Tavern | 103 East Jackson Street, Downtown Tampa  No cover | All ages welcome GenX Tavern GenX Tavern contactus@genxtavern.com GiRLs night OUT Thursday September 11th Every Thursday It’s GiRLs Night OUT at GenX Tavern! Grab your crew and head to Downtown Tampa every Thursday for the ultimate throwback party! We’re spinning the best pop hits from the 80s, 90s, 2000s, and today — everything from Britney to Beyoncé, Spice Girls to Sabrina.       *2-for-1 drinks for ladies from 8PM–10PM  *Pop anthems all night long     103 E Jackson St – right in the heart of downtown Let’s dance, sip, and sing like it’s girls night every night! 08:00 PM - 12:00 AM 2025-09-11 20:00:00 2025-09-11 00:00:00 America/New_York GiRLs night OUT It’s GiRLs Night OUT at GenX Tavern!        Grab your crew and head to Downtown Tampa every Thursday for the ultimate throwback party! We’re spinning the best pop hits from the 80s, 90s, 2000s, and today — everything from Britney to Beyoncé, Spice Girls to Sabrina.       *2-for-1 drinks for ladies from 8PM–10PM  *Pop anthems all night long     103 E Jackson St – right in the heart of downtown    Let’s dance, sip, and sing like it’s girls night every night! GenX Tavern GenX Tavern contactus@genxtavern.com Too Fresh Fridays Friday September 12th Every Friday Kick off the weekend with Too Fresh Fridays at GenX Tavern !   Join us in downtown Tampa for a night of old-school rap and classic party jamz, guaranteed to keep you moving from 8 PM to 1 AM.    Special guest DJs spin the hottest throwbacks and legendary beats that defined an era. Whether you’re vibing at the bar or hitting the dance floor, this is the spot to relive the days of the best of hip-hop and party anthems.    No cover – just good vibes, great drinks, and timeless music. Pull up, bring your crew, and get fresh! 08:00 PM - 01:00 AM 2025-09-12 20:00:00 2025-09-12 01:00:00 America/New_York Too Fresh Fridays Kick off the weekend with Too Fresh Fridays at GenX Tavern!   Join us in downtown Tampa for a night of old-school rap and classic party jamz, guaranteed to keep you moving from 8 PM to 1 AM.    Special guest DJs spin the hottest throwbacks and legendary beats that defined an era. Whether you’re vibing at the bar or hitting the dance floor, this is the spot to relive the days of the best of hip-hop and party anthems.    No cover – just good vibes, great drinks, and timeless music. Pull up, bring your crew, and get fresh! GenX Tavern GenX Tavern contactus@genxtavern.com The Grind at GenX Tavern Saturday September 13th Every Saturday MTV's The Grind taught a generation how to dance and we're keeping your booty shaking and hands waving as we bring that energy to Downtown Tampa at GenX Tavern every Saturday Night! The Grind features some of Tampa's best DJ's like DJ Chris Craze, Matt The Bratt, DJ Matt Dodge and more spinning an uptempo party mix of classic 80s and 90s jams mashed up with some current pop hits. 08:00 PM - 01:00 AM 2025-09-13 20:00:00 2025-09-13 01:00:00 America/New_York The Grind at GenX Tavern MTV's The Grind taught a generation how to dance and we're keeping your booty shaking and hands waving as we bring that energy to Downtown Tampa at GenX Tavern every Saturday Night!  The Grind features some of Tampa's best DJ's like DJ Chris Craze, Matt The Bratt, DJ Matt Dodge and more spinning an uptempo party mix of classic 80s and 90s jams mashed up with some current pop hits. GenX Tavern GenX Tavern contactus@genxtavern.com Monday Night Trivia Monday September 15th Every Monday Get your team together, head downtown and win some awesome prizes while enjoying great food and drinks every Monday for T rivia Night at GenX Tavern with Events Done Right ! Tampa's best Trivia Night kicks off at 7pm so bring your pop culture knowledge and compete for the trophy! 07:00 PM - 10:00 PM 2025-09-15 19:00:00 2025-09-15 22:00:00 America/New_York Monday Night Trivia Get your team together, head downtown and win some awesome prizes while enjoying great food and drinks every Monday for Trivia Night at GenX Tavern with Events Done Right!  Tampa's best Trivia Night kicks off at 7pm so bring your pop culture knowledge and compete for the trophy! GenX Tavern GenX Tavern contactus@genxtavern.com Order Parties Catering Jobs"
    },
    {
      "url": "https://www.fox13news.com/good-day-tampa-bay/genx-tavern-a-new-tampa-eatery-will-fill-you-with-80s-and-90s-nostalgia",
      "text": "GenX Tavern, a new Tampa eatery, will fill you with '80s and '90s nostalgia | FOX 13 Tampa Bay News Weather Sports Good Day We Live Here Contests More Watch Live Expand / Collapse search ☰ Search site News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us GenX Tavern, a new Tampa eatery, will fill you with '80s and '90s nostalgia By FOX 13 News staff Published May 11, 2019 4:45pm EDT We Live Here FOX 13 News Share Copy Link Email Facebook Twitter LinkedIn Reddit TAMPA, Fla. - There’s a new eatery in downtown Tampa that promises to take you back in time. It’s called GenX Tavern, and this place pays tribute to everything from the 80s and 90s, the era in which Generation X grew up. If you're in your 30s and 40s, your nostalgia level will hit the roof inside this restaurant. From décor to the menu, there are reminders of yesteryear everywhere. There are references around every corner, including a chandelier made out of floppy discs and a Ferris Bueller painting. The menu is also a nod to the decades. There are Dunkaroos, Spaghetti-Os and a cocktail inspired by the kids drink “Tang.” The owner said the restaurant since its opening, even the millennials are enjoying the atmosphere. “I think everybody – no matter their generation – looks up on those two decades really favorably,” explained Dave Burton, the owner. “So I thought, ‘How fun would it be to dedicate a concept entirely to those two decades?” Image 1 of 10 ▼ LINK: For more information, head over to the Genx Tavern website . GenX Tavern 103 East Jackson Street Tampa, Florida 33602 813-694-7001 Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . Trending Several bystanders injured trying to save trapped pets inside burning Spring Hill home: HCFR Families of Florida's missing children gather to honor loved ones, continue search Dozens of Tampa homeowners say their roofs are defective, demand repair from builder Millions could lose SNAP benefits as stricter rules take effect Sarasota's 'Sash and Sill' owner arrested for third time on two additional larceny charges Latest headlines Woman charged in Polk County deputy's 2022 death stands trial ‘Operation Kings Fall’ yearlong investigation into drug trafficking, violence nets 22 arrests Red-light runner strikes Sarasota motorcycle deputy: SCSO Victim's girlfriend testifies at pre-trial hearing after deadly shooting inside Lutz home Tampa intersection improvements get $13M boost from Hillsborough County as pothole program hits 4 years News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 13 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://genx-sheetal-regency-mathura.hotelsgds.com/contact-us/",
      "text": "Reach Us at GenX Sheetal Regency Mathura India for Bookings Asia Hotels and Resorts Book Now GenX Sheetal Regency Toggle navigation Home About Hotel About Us Amenities Rooms Tariffs Packages Photos Contact Us Contacts Home Contacts Welcome to Asia Hotels and Resorts, India Hotel Name: GenX Sheetal Regency Address: Near Krishna Janambhoomi #4/349 Deeg Gate, Masani Road, Mathura - 281001 For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India info-2@hotelsgds.com Fill below form for Enquiry Check in Check out Name Email Mobile no. Adults 1 2 3 4 5 6 7 8 8+ Kids 0 1 2 3 4 4+ Requirement GenX Sheetal Regency Get in touch at Mathura, GenX Sheetal Regency, on the contact no. given at website. GenX Sheetal Regency provides online booking rooms from anywhere.  Mathura, GenX Sheetal Regency has round the clock active contact number. Location: Near Krishna Janambhoomi #4/349 Deeg Gate, Masani Road, Mathura - 281001 For Enquiry and Booking Contact Asia Hotels and Resorts 2nd Floor, Plot No 921, Gali No 1, Mahipalpur Bypass, Near Water Booster, Mahipalpur, New Delhi 110037,India Our Other Hotels Mastiff Select Bidar Bidar Hotel Mayura Bidar Hotel Shiva International Bidar Bidar Vikas Lodge Bidar Abhimaan Residency Gulbarga || GenX Sheetal Regency room booking | Hotel in Mathura Uttar Pradesh India | List Of Lodges in Mathura | Lodges in Mathura Uttar Pradesh || This website managed by Asia Hotels and Resorts not from GenX Sheetal Regency. Home About us Policies Terms and Conditions Sitemap Contact Us"
    }
  ]
}