{
  "fuentes": [
    {
      "url": "https://clearwater.odoo.com/contactus",
      "email": "sales@clearwatersystems.com"
    },
    {
      "url": "https://www.dimmittcadillac.com/contactus.aspx",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.clearwater.ca/en/our-story/our-team/",
      "email": "webinquries@clearwater.ca"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "contact@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "quote@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://www.gerstles.com/clearwater/",
      "email": "bookings@gerstles.com"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "36cc00ac-b16e-4ac7-bc07-c800b01278dd@2x.png"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "942d02c9-ec99-483b-b408-36b5154f1dc0@2x.png"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "b252adea-d784-4f39-a82b-21f1ce950382@2x.png"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "b3cdb12e-a290-4d8e-abbc-95df41336ddc@2x.jpg"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "c9963fa8-5fe2-4b87-bb73-abac7e22e421@2x.jpg"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "mobile_b3cdb12e-a290-4d8e-abbc-95df41336ddc@2x.jpg"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "email": "office@clearwatercollege.com"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "email": "info@theclearwaterfoundation.com"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "email": "partnerships@theclearwaterfoundation.com"
    },
    {
      "url": "https://clearwateradvisers.com/about-us/",
      "email": "enquiries@clearwateradvisers.com"
    },
    {
      "url": "https://clearwatersecurity.com/contact/",
      "email": "info@clearwatersecurity.com"
    },
    {
      "url": "https://www.gerstles.com/?page_id=5",
      "email": "wordpress@staging.gerstles.com"
    }
  ],
  "mails": [
    "36cc00ac-b16e-4ac7-bc07-c800b01278dd@2x.png",
    "942d02c9-ec99-483b-b408-36b5154f1dc0@2x.png",
    "b252adea-d784-4f39-a82b-21f1ce950382@2x.png",
    "b3cdb12e-a290-4d8e-abbc-95df41336ddc@2x.jpg",
    "bookings@gerstles.com",
    "c9963fa8-5fe2-4b87-bb73-abac7e22e421@2x.jpg",
    "contact@guttercleaningsouthlondon.co.uk",
    "enquiries@clearwateradvisers.com",
    "flags@2x.png",
    "info@clearwatersecurity.com",
    "info@theclearwaterfoundation.com",
    "mobile_b3cdb12e-a290-4d8e-abbc-95df41336ddc@2x.jpg",
    "office@clearwatercollege.com",
    "partnerships@theclearwaterfoundation.com",
    "quote@guttercleaningsouthlondon.co.uk",
    "sales@clearwatersystems.com",
    "sgoodwin@surgetechak.com",
    "webinquries@clearwater.ca",
    "wordpress@staging.gerstles.com"
  ],
  "nombre_sitio": "gerstles.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://clearwater.odoo.com/contactus",
      "text": "Contact Us | Clearwater Systems Home Shop Contact us Privacy Policy Water Test Quick Quote 0 Sign in Contact Us Contact us Contact us about anything related to our company or services. We'll do our best to get back to you as soon as possible. Your Name * Phone Number Your Email * Your Company Subject * Your Question * Email To Submit My Company 3575 Fake Buena Vista Avenue +1 555-555-5556 info@yourcompany.example.com Our Products & Services Home My Account Connect with us Contact us +1 888-928-3710 sales@clearwatersystems.com Share Clearwater Systems, Inc - About us Clearwater Systems is proud to be a company rooted in family. The founding family of Clearwater committed to serving the Northeast Ohio area over 75 years ago, and now our services extend to Arizona, Montana, Pennsylvania, Virginia and Washington as well. Our current Clearwater family serves with the same commitment to quality service. We believe our customers deserve the best service and the best products to get them the best water. As a business with a long history of helping customers get great water for their homes and businesses, we know and understand local water issues better than most.  Our experts can design the right system to treat the unique issues of ground and surface water. Get started with a FREE water analysis to determine the water issues that affect you most. Or, contact us with questions. Copyright © Company name Powered by - \n                    The #1 Open Source eCommerce"
    },
    {
      "url": "https://www.dimmittcadillac.com/contactus.aspx",
      "text": "Contact Dimmitt Cadillac Clearwater FL | Palm Harbor | Phone | Email Dimmitt Cadillac of Clearwater Dimmitt Cadillac of Clearwater Sales 888-563-2118 Service 800-543-8281 Parts 888-563-2118 25191 US Hwy 19N Clearwater, FL 33763 Service Map Contact Saved Saved Saved Dimmitt Cadillac of Clearwater Dimmitt Cadillac of Clearwater Call 888-563-2118 Directions EV TEST DRIVE New Search New Cadillac Inventory Courtesy Transportation Vehicles Shop Escalade IQ Shop Cadillac Escalade Shop Cadillac LYRIQ Shop Cadillac XT4 Shop Cadillac XT5 Shop Cadillac XT6 Shop Cadillac CT4 Shop Cadillac CT5 Shop Cadillac OPTIQ Shop Cadillac VISTIQ Model Research Research New Models EV TEST DRIVE GM Rewards Tax Interest Deduction Sell/Trade Your Car Pre-Owned Search Pre-Owned Inventory Certified Pre-Owned Inventory CarFax 1-Owner Inventory Vehicles Priced Under 30k Why Buy Cadillac Certified Value Your Trade Research Used Models Service & Parts Schedule Service Service Center Dimmitt Service & Parts Specials GM Service & Parts Specials Cadillac Premium Pick Up and Delivery Tire Finder Collision Center Certified Oil Change Service Certified Brake Service Certified Battery Service Order Cadillac Parts Order Cadillac Accessories Cadillac Certified Service Order Parts Online GM Accessories Collision & Body Shop Tire Finder Specials New Cadillac Specials Dimmitt Service & Parts Specials GM Military Rebate First Responders Program Trade Up Advantage Program Tax Interest Deduction Limited-Time Luxury Offers Courtesy Transportation Vehicles Finance Apply For Financing Finance Department Should I Lease Or Buy? Payment Calculator Dimmitt Direct Dimmitt Smart Choice Cadillac Protection What's My Car Worth? About Us Our History Hours & Directions Meet Our Staff Join Our Team Career Technicians Our Blog EV TEST DRIVE New Search New Cadillac Inventory Courtesy Transportation Vehicles Shop Escalade IQ Shop Cadillac Escalade Shop Cadillac LYRIQ Shop Cadillac XT4 Shop Cadillac XT5 Shop Cadillac XT6 Shop Cadillac CT4 Shop Cadillac CT5 Shop Cadillac OPTIQ Shop Cadillac VISTIQ Model Research Research New Models EV TEST DRIVE GM Rewards Tax Interest Deduction Sell/Trade Your Car Pre-Owned Search Pre-Owned Inventory Certified Pre-Owned Inventory CarFax 1-Owner Inventory Vehicles Priced Under 30k Why Buy Cadillac Certified Value Your Trade Research Used Models Service & Parts Schedule Service Service Center Dimmitt Service & Parts Specials GM Service & Parts Specials Cadillac Premium Pick Up and Delivery Tire Finder Collision Center Certified Oil Change Service Certified Brake Service Certified Battery Service Order Cadillac Parts Order Cadillac Accessories Cadillac Certified Service Order Parts Online GM Accessories Collision & Body Shop Tire Finder Specials New Cadillac Specials Dimmitt Service & Parts Specials GM Military Rebate First Responders Program Trade Up Advantage Program Tax Interest Deduction Limited-Time Luxury Offers Courtesy Transportation Vehicles Finance Apply For Financing Finance Department Should I Lease Or Buy? Payment Calculator Dimmitt Direct Dimmitt Smart Choice Cadillac Protection What's My Car Worth? About Us Our History Hours & Directions Meet Our Staff Join Our Team Career Technicians Our Blog The $7,500 EV Tax Credit ends September 30th. 0 Days 0 Hours 0 Minutes 0 Seconds Contact Dimmitt Cadillac Clearwater Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Comments: By clicking this box, I agree to receive in-person or automated telemarketing calls and texts from Dimmitt Cadillac of Clearwater at the number I entered. I understand that my consent is not required for purchase. Let's Talk By clicking \"Let's Talk\", you agree to Dimmitt Cadillac’s Terms of Use and Privacy Policy. You consent to receive phone calls and SMS messages from Dimmitt Cadillac to provide updates on your order and/or for marketing purposes. Message frequency depends on your activity. You may opt-out by texting \"STOP\". Message and data rates may apply. *Required Fields Phone Sales: 888-563-2118 Service: 800-543-8281 Parts: 888-563-2118 Address Dimmitt Cadillac of Clearwater 25191 US Hwy 19N Clearwater, FL 33763 Hours and Directions Inventory New Inventory Used Inventory Special Offers Schedule Test Drive Services Apply for Financing Extended Warranty Schedule Service Order Parts More Info Dealership Info Contact Us Meet Our Staff Careers Follow Us Copyright © 2025 by DealerOn | Sitemap | Privacy | Dimmitt Cadillac of Clearwater | 25191 US Hwy 19N, Clearwater, FL 33763 | Sales: 888-563-2118"
    },
    {
      "url": "https://www.clearwater.ca/en/our-story/our-team/",
      "text": "Leadership Team - Clearwater Menu Select: Foodservice Retail en fr 中文 Seafood Scallops Clams Shrimp Snow Crab Norway Lobster Rock Crab Whelk Turbot Recipes Seafood Scallops Lobster Clams Snow Crab Norway Lobster Rock Crab Recipes Our Story About Us Mission, Strategies & Values Proudly Indigenous Awards & Recognition Environmental Social Governance Leadership Team Corporate Videos Sustainability Healthy Oceans Responsible Fishing Best Practices Marine Stewardship Council Certification Sustainability Overview Ocean-to-Plate Harvesting Processing Facilities Food Safety and Traceability Logistics Careers Diversity and Inclusion Careers Set Sail Join the Clearwater Team Employee Testimonials Newsroom Buy Online Canada USA Our Story » Leadership Team Leadership Team Meet our Leadership Team — A seasoned team of management professionals leading Clearwater in its mission to build the world’s most extraordinary, wild seafood company dedicated to sustainable seafood excellence. Ian D. Smith | Chief Executive Officer Ian D. Smith is the Chief Executive Officer of Clearwater Seafoods. Ian joined Clearwater in May of 2010, with over 36 years of international experience in the food and consumer products industry. Prior to joining Clearwater, Ian held senior leadership positions at the Campbell Soup Company in Canada, the United States and China. Prior to his time at Campbell’s, Ian held various marketing, sales and international business development positions with Allergan, Colgate-Palmolive and the Gillette Company. Ian has held various director roles (both past and present) on a number of boards and advisory councils focused on international trade and public policy, including the Business Council of Canada, Asia Business Leaders Advisory Council of the Asia Pacific Foundation, and Rabobank’s North America Agribusiness Advisory Board. He is a graduate of McGill University, holding a Bachelor of Arts in Economics and Masters of Business Administration, in addition to being a former Captain in the Canadian Armed Forces Reserve. Ian currently serves in the Canadian Armed Forces Reserve as Honorary Colonel for 36 Combat Engineer Regiment in Nova Scotia. Christine A. Penney | Vice President, Sustainability and Public Affairs Christine Penney joined Clearwater Seafoods in 1995 and is the Vice President of Sustainability and Public Affairs. Christine oversees the company’s sustainability program, which includes fisheries research and management of core species, third-party certification programs and environmental, social and governance (ESG) commitments. Christine also oversees Clearwater’s corporate public affairs, communications, and Indigenous relations. Throughout her career, Christine has served extensively in the governance of industry and sustainability organizations.   She has served for many years on the Board of Trustees for the Marine Stewardship Council (MSC) while co-chairing the Stakeholder Advisory Committee.  She currently serves on the Board of Directors for several organizations, including the Fisheries Council of Canada, Seafood Producers of Nova Scotia, Association of Sustainable Fisheries, and the FISH Crew Standard. Christine is a graduate of Dalhousie University in Halifax, where she received a Bachelor of Science and a Masters of Marine Management. Dieter Gautschi | Vice President, Human Resources Dieter Gautschi is Vice President of Human Resources at Clearwater Seafoods and is responsible for driving organizational performance on a global scale, as well as the company’s capability and capacity. Dieter joined Clearwater in July of 2015, bringing over 15 years of global experience in senior human resource roles in the food and retail industry. Prior to Clearwater, Dieter was Vice President of Leadership Planning and National Director of Human Resources for Sobeys Inc., in addition to holding senior roles in human resources with Coca Cola in Europe. A Canadian citizen and native of Switzerland, Dieter holds a Masters of Science in Industrial and Organizational Psychology and a degree in Naval Architecture. Tony Jabbour | Senior Vice President, Global Supply Chain Tony Jabbour began his career with Clearwater Seafoods in 1993 after studying Business Administration at Saint Mary’s University in Halifax. He continued to expand his skills both academically and professionally through extensive training courses and hands-on global experience. Throughout his career at Clearwater, Tony has taken on various roles in the lobster business, the harvesting fleet, plant operations, and research and development. Today, as Senior Vice President of Global Supply Chain, Tony is responsible for Clearwater’s global harvesting and land-based operations, which include third-party co-packing as well as research and development activities. Telaina M. Kelly | Vice President, Legal & Corporate Secretary Telaina Kelly is Vice President, Legal and Corporate Secretary for Clearwater Seafoods, managing the company’s legal department and overseeing legal affairs globally. Telaina is also responsible for legal and corporate secretarial functions, including securities reporting, regulatory compliance, corporate governance, and enterprise risk management, in addition to supporting a wide range of commercial and operational matters. Telaina joined Clearwater in 2015, having held senior management roles in private sector and law firm environments. Telaina holds a Bachelor of Law degree from the University of Alberta and a Bachelor of Arts degree from the University of Calgary. She also holds a Certified In-House Council Canada (CIC.C) designation from the University of Toronto’s Rotman School of Business. Throughout the course of her career, Telaina has served in various volunteer and Board positions in the legal and business community, and is a volunteer lawyer with the Nova Scotia Barristers’ Society. Telaina is actively involved in the Women General Counsel Canada (WGCC) Atlantic Chapter. Shaun Mitchelitis | Group Vice President, Commercial & Value Added Shaun Mitchelitis joined Clearwater in 2008 and currently serves as the Group Vice President of Commercial & Value Added, where he is responsible for the strategic and commercial leadership for our portfolio of global businesses. Before his current role, Shaun held various senior commercial leadership positions at Clearwater, including General Manager of the Canadian & Argentine Scallop Divisions, and most recently, on assignment in the UK where he served in the hybrid position as Vice President of Sales EMEA and General Manager of Macduff Shellfish, Clearwater’s Scottish subsidiary. Shaun holds both a Bachelor of Commerce (2008) and an Executive Master of Business Administration (2018) from Saint Mary’s University in Halifax. Nicole Henneberry | Chief Financial Officer Nicole Henneberry is the Chief Financial Officer of Clearwater Seafoods. She joined Clearwater in August 2022 as Vice President Finance, Corporate Accounting & Reporting. As Chief Financial Officer, Nicole is responsible for financial and management reporting, treasury, taxation, stakeholder relations, and risk management. Prior to joining Clearwater, Nicole spent over 13 years with Nova Scotia Power, where she held various financial leadership roles. Nicole holds a Bachelor of Commerce Degree from Saint Mary’s University and is a Chartered Professional Accountant. Verify your product purchase Contact Us Shop Online Copyright © 2025 Sitemap Privacy Statement View the Clearwater website as Foodservice Retail Investor Why do we ask? × Your experience means everything To serve our customers better, our website content has been customized for different customer types based on their needs and interests. Have a suggestion on how we can serve you better, please let us know."
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "text": "Contact Skip to content Home Services About Blog Contact Get a Quote Get a Quote Main Menu Home Services About Blog Contact Get in touch Connect with Gutter Cleaners South London Contact Us Let’s Discuss Your Gutter Cleaning Needs Reach out to our team for professional gutter cleaning services. Phone 020 8150 7886 Email quote@guttercleaningsouthlondon.co.uk Address South London Follow Us Contact Form First Name Email Message Submit The form has been submitted successfully! There has been some error while submitting the form. Please verify all form fields again. Reliable Gutter Care Swift Solutions for Gutter Maintenance Choose us for quick, efficient gutter cleaning and maintenance services. 020 8150 7886 About Us Gutter Cleaners South London specialises in top-notch gutter cleaning services, preserving your property's integrity and appeal. Menu Home Services About Blog Contact Contact Info A: South London P: 020 8150 7886 E: contact@guttercleaningsouthlondon.co.uk Copyright © 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny Preferences Save preferences Preferences {title} {title} {title} Manage consent Scroll to Top"
    },
    {
      "url": "https://www.gerstles.com/clearwater/",
      "text": "Gerstles Clearwater – Gerstles Clearwater Home Who’s Playing? Food Menu Drink Menu Upcoming Events Get Here Visit Louisville Eat Up. Hang Out. Rock On. view upcoming bands Sip & Relax Clearwater, Florida View Our Drink Menu Bar food Done Right View Our Food Menu Gerstle's Clearwater - where the ever so loved Kentucky Charm meets the beautiful Florida palms. Come on in for the coldest beers, the best bourbon selection south of Kentucky, and incredible live music every night! As the legend was told... It has nothing to do with the derby or bluegrass or bourbon-making, but all those things run through its veins — it’s gerstle’s place, a neighborhood bar of indispensable variety. Explore The Talent Upcoming Bands 11 September 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 18 September 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 25 September 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 02 October 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 09 October 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 16 October 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 23 October 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 30 October 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 06 November 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 13 November 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 20 November 2025 Nightbreakers Duo 7:00 PM - 11:00 PM 27 November 2025 Nightbreakers Duo 7:00 PM - 11:00 PM view upcoming bands Explore The Menu Beer & Spirits Discover The Space Social Atmosphere Explore The Menu Bar Food Done Right Live From The Gram @gerstles_clearwater Monday - Friday 11AM - 3AM Saturday - Sunday 11AM - 3AM 752 S Gulfview Blvd Clearwater Beach, FL 33767 Contact Us Louisville 3801 Frankfort Ave, Louisville, KY 40207 Phone: 502-742-8616 Bookings/Events: bookings@gerstles.com Quick Links Homepage Drink Menu Food Menu Who’s Playing Upcoming Events clearwater 752 S Gulfview Blvd, Clearwater, FL 33767 Phone: 727-240-1179 Bookings/Events: bookings@gerstles.com Quick Links Homepage Drink Menu Food Menu Who’s Playing Upcoming Events © 2021 / Site Designed KGLR Privacy Preference Center Privacy Preferences"
    },
    {
      "url": "https://www.clearwatercollege.com/about-us",
      "text": "Clearwater College | About Us Skip to main content Menu Menu ADMISSIONS Events Donate Home About Us Our Faculty, Staff and Board Our Beliefs Our History ACADEMICS ADMISSIONS College Life Finances International Students Student Referral Discount Events Fall Clearwater Encounter Spring Clearwater Encounter FCA Family Camp Living Faith Family Camp Spiritual Emphasis Days FACILITY RENTAL Leadership Development Courses Resources NEWSLETTER Matching Campaign CONNECT ADMISSIONS Events Donate Our Faculty, Staff and Board Our Beliefs Our History A little about us... Clearwater College (formerly Living Faith Bible College) is a charismatic evangelical Christian Bible College, located in the foothills of the Rocky Mountains, near Caroline, Alberta. Our mandate is âEquipping for Life and Ministry.â We are a non-denominational college and therefore appeal to a wide spectrum of students from different denominations and backgrounds from around the world. Our goal is to impact both our local and global communities by changing hearts, teaching minds, and serving others. All of this occurs in an environment set apart from the hustle and bustle of the city, surrounded by wildlife, rivers, trees and mountains. Clearwater College was incorporated in Alberta by an Act of the Legislature and authorized by them to grant degrees in Bible and theology. Clearwater College is the Canadian training college of the Fellowship of Christian Assemblies, an affiliation of autonomous churches and ministries united in a common goal of making Christ and His Gospel known. Weâd love to meet you, so come on out and see what youâve been missing! Why Does Clearwater Exist? Itâs simple really: Our need for Jesus. The mandate he left for his followers was to make disciples of all nations (Matthew 28:18-20). Empowered by the Holy Spirit, that is what they did, and that is what we continue to do today by Equipping for Life and Ministry. - EQUIPPING FOR LIFE - In equipping students for life, we follow the Acts 2:42 model by seeking to devote ourselves to the apostlesâ teaching, fellowship, the breaking of bread, and prayer. Students may or may not be academically strong, but degrees and certificates only matter if students are effectively equipped for life by being empowered by the Spirit. - EQUIPPING FOR MINISTRY - In equipping for ministry, we focus on cultivating a lifestyle of worship to minister to the Lord, on an Ephesians 4 equipping model to minister to the Church, and on preparing labourers for the harvest to effectively minister to the world. Our history is highlighted by our focus on Christ and our close-knit community. Did we mention the beautiful creation we find ourselves in as we equip for life and ministry? Jesus told us to make disciples. Thatâs what we do. Thatâs why we exist. Box 100 Caroline, Alberta, Canada T0M 0M0 1- 800-838-2975 Office Hours: Weekdays 9:00 am to 5:00 pm MST Closed for lunch 12:30 pm to 1:30 pm office@clearwatercollege.com î§ facebook â â î instagram â â î circleyoutube â â â church websites by clover"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://theclearwaterfoundation.com/about-us/",
      "text": "About Us – The ClearWater Foundation Visit our websites: Future Chicken ClearWater Farm Our Work Global Impact Guiding Principles About Us Our History News Contact us Donate Donate ☰ Our History Starting our journey in 2006, the ClearWater Futures Foundation has weathered many changes and challenges. From tremendous highs to tumultuous lows, we’ve embraced every challenge and overcome every obstacle to become the thriving beacon of hope, purpose and community we are today. Discover our journey CFF Founder and Board Chair Annabel Slaight, C.M., O. Ont. Annabel holds the Order of Canada and the Order of Ontario for nurturing a passion for education through science and nature among generations of Canadian children.  She was honoured as a Fellow of the Royal Canadian Geographical Society and was a King Charles III Coronation Medal recipient in 2025.  She is a Canadian media pioneer who created magazines, books and TV for kids under the OWLkids banner, reaching over 60 million families. She is the founding editor for OWL magazine and creative behind Future Chicken.  Annabel co-founded Ladies of the Lake, and was an appointee to the formative Lake Simcoe Coordinating Committee. Our Board of Directors Tracy Smith Board Vice Chair and Chair of the Governance and Nominations Committee Tracy is a retired District Manager from the Ontario Ministry of Natural Resources, where he led environmental initiatives, including the development of the Lake Simcoe Protection Plan. With a career focused on sustainable resource management and environmental policy, he also served as Vice President and Trustee on the Board of Directors for Forests Canada, contributing to national forest conservation strategies and supporting efforts in biodiversity and climate resilience. Lynn Haight Board Treasurer and Chair of the Finance and Audit Committee Lynn has retired from a distinguished 30-year career in executive financial management, having held senior leadership roles in major international financial and insurance institutions headquartered in Canada. Her roles included Chief Financial Officer and Chief Operating Officer of Foresters Financial, Controller of Manulife Financial, and Vice President at Scotiabank. Alongside her corporate leadership, Lynn has been deeply engaged in global development through voluntary governance roles. She has chaired or served on the Boards of Directors for several international organizations, including the World Agroforestry Center, the Consortium of International Agricultural Research Centers, and the Standards Council of Canada. She has also contributed to the oversight of United Nations programs, serving on Management Oversight Committees for UNHCR and UNESCO. Lynn holds an MA from Oxford University, is a Fellow Chartered Accountant (FCA) in both Canada and the UK, a Fellow of the Canadian Association of Management Consultants, and a certified Canadian Director (ICD.D) Surbhi Jain Board Secretary Surbhi is a Senior Policy Advisor with the Ontario Ministry of the Environment, Conservation and Parks, based in Toronto, Canada. She plays a key role in shaping provincial climate change policy, focusing on the design and implementation of programs and strategies to reduce greenhouse gas emissions. Surbhi brings a diverse background in environmental and clean energy sectors, with prior experience at the Ontario Ministry of the Environment and Climate Change, Opus One Solutions, Heliolytics, and TREC Renewable Energy Co-operative. Her career has also included work in strategic communications, public relations, partnership development, marketing, and event management—complementing her policy expertise with a broad understanding of stakeholder engagement and outreach. She holds a Master’s degree in Environmental Science with a specialization in Natural Resources Management and Policy from the University of Toronto. Hon. Gloria T. Epstein QC Director The Honourable Gloria Epstein, K.C . brings over 45 years of experience in the Canadian legal system—as a lawyer, trial judge, appellate judge, and leader of complex government reviews. Her distinguished career has been marked by legal excellence, public service, and a deep commitment to social justice. Following her retirement from the bench, Justice Epstein earned her Mediator Accreditation from the London School of Mediation in 2021, a credential recognized by the Chartered Institute of Arbitrators. She is now a member of Arbitration Place, where she serves as both a mediator and arbitrator. Justice Epstein has made significant contributions beyond the courtroom. She founded the McMurtry Garden of Justice, serves as Co-Chair of the Ontario Justice Education Network, and sits on the Boards of Directors of the Canadian Women’s Foundation and the Sinai Health Foundation. She is also a member of the Smith School of Business Advisory Board and previously served on the national board of Pathways to Education. Her leadership and volunteerism have been widely recognized. She is a recipient of the University of Toronto Arbor Award and the YWCA Women of Distinction Award. In recognition of her contributions to law and society, she has been awarded three honorary Doctor of Laws degrees: from the Law Society of Ontario (2019), the University of Toronto (2022), and Queen’s University (2023). Damian Chen Director Damian is the Founder and CEO of ColorShadow Communications and GetDMS Inc. He is an accomplished tech entrepreneur with nearly three decades of industry experience. A leader in digital transformation and cloud-based solutions, Damian has guided the creation of over 100 world-class digital platforms, including several industry firsts in healthcare, transportation, and entertainment. His expertise spans strategy, business intelligence, and system architecture, driving innovation across a diverse range of clients—from multinational corporations and government agencies to not-for-profit organizations. Lisa M. Lyons Johnston Director Lisa is an accomplished senior executive with three decades of global experience in the creative industries, spanning traditional and digital media, music, publishing, and television content distribution. As President and Publisher of Kids Can Press for 15 years, Lisa guided the award-winning Canadian publisher into new markets and formats, including ebooks and audiobooks. Her digital media expertise includes launching Canada’s first kids’ video-on-demand subscription service, overseeing Max Trax Digital Music, and leading groundbreaking content initiatives across emerging platforms. Lisa is widely recognized for her leadership and industry contributions. She received the 2015 Leadership Award from Women in Communications and Technology and was named one of Canada’s Top 100 Most Powerful Women by the Women’s Executive Network in 2018. She has represented Canadian publishing on official cultural trade missions to China and Latin America and is a sought-after speaker at major international book fairs and media conferences. Lisa has served on the boards of the Ontario Science Centre and Ontario Creates and currently sits on the Emmy Noether Circle at the Perimeter Institute for Theoretical Physics. She is also a member of the International Women’s Forum, where she serves on the Executive Committee of the Canadian Forum Toronto Chapter as Chair of Programming. Our Advisory Board Elizabeth Dowdeswell OC OOnt. Honourary Chair of the Special Advisor Group Elizabeth previously served as the 29th Lieutenant Governor of Ontario and  as President and CEO of the Council of Canadian Academies. Her career spans provincial, federal, and international roles, with a focus on public engagement in policy, education, and communication. She was the founding CEO of Canada’s Nuclear Waste Management Organization and is an adjunct professor at the University of Toronto. From 1993 to 1998, she was Under-Secretary General of the UN and Executive Director of the UN Environment Program, where she modernized the agency and addressed global environmental challenges. Earlier, she was Assistant Deputy Minister at Environment Canada, overseeing national weather services.Ms. Dowdeswell sits on several boards and advisory panels, holds nine honorary degrees, and received the Memorial Gold Medal from Charles University in Prague. John Brace Former CFF Director, Special Advisor John is the Chair of Northland Power Inc., appointed to the role in December 2019 after serving as the company’s Chief Executive Officer from 2003 until his retirement in 2018. He joined Northland in 1988 and held a range of leadership roles across risk management, development, construction, and operations. As CEO, John successfully led the company through many of its key growth initiatives in clean and green energy development. With decades of experience in the energy sector, John has also served as Chair and President of the Association of Power Producers of Ontario and was a member of the Electricity Conservation and Supply Task Force. He holds a Bachelor of Science in Engineering Physics from Queen’s University and is a member of the Institute of Corporate Directors, holding the ICD.D designation. To get in touch with our Board of Directors, please email Tammy.Labombard@theclearwaterfoundation.com Our Chief Executive Officer – Ex-Officio Director Susan Doyle Chief Executive Officer, Board Ex-Officio LinkedIn Connect with me! Susan is the current CEO of the ClearWater Futures Foundation that holds a global mandate in ecological innovation, environmental leadership development, eco-educational research, nature-based learning and mental wellbeing. Her experience in trusted partnership development and community building has spanned appointments to various committees, boards and as an effective executive non-profit coach in Ontario. Before joining CFF, Susan led large, diverse, unionized, and multi-disciplinary teams in various healthcare sectors. Her experience includes complex and multifaceted capital projects and funding portfolios, regulatory compliance, effective financial and budget management, development of policies and procedures, large scale change projects, strategic and operational planning, government relations strategies and quality stakeholder engagement strategies. Susan has spoken internationally on topics of innovation, inclusion, and development. She has a Master’s degree in Social Work and extensive executive education including governance, and performance measurement from Harvard University (John F. Kennedy School of Government) in the United States and finance management from Rotman School of Management in Canada. Our Foundation Experts Susan Doyle Chief Executive Officer Connect with me! Jennifer Gidge Resource Development and Communications Connect with me! Suzanne Portsmith Business Manager Our ClearWater Farm Experts Sheri Bryant Education, Events & Outreach Programs Grace Harding Regenerative Farming Alex Smyth Sustainable Food Doug Rees Capital Development, Maintenance and Facilities Our Consultancy & Advisory Experts Mohith VJ Kumar Chief Partnership & Innovation Officer LinkedIn To get in touch with our team, please email info@theclearwaterfoundation.com Our Partners In Impact Developing impactful initiatives with partners is key to the ClearWater Futures Foundation’s mandate to “create ripples.” If you have an idea you would like to propose or see any initiative currently underway you would like to expand on please contact Partnerships . Purpose-Driven Funders Strategic Program Collaborators Our Government Partnerships Academic Affiliations International Community Champions Community and Grassroots Organizations Canadian Charitable Number: CRA #842146284RR00001 We acknowledge that ClearWater Farm stands on land with a rich history as a meeting\n place for Indigenous communities and early settlers, where knowledge, culture, and goods were exchanged\n under the shade of the over 200-year-old Trading Tree. The ClearWater Futures Foundation is committed to\n reconciliation by honoring this legacy, learning from Indigenous perspectives, and fostering meaningful\n relationships built on trust, respect, and collaboration. We strive to weave Indigenous knowledge and\n practices into our work, contributing to a shared future that reflects the principles of truth and\n reconciliation in Canada. © The ClearWater Futures Foundation, All Rights Reserved. Contact us Join our email community! Canadian Charitable Number: CRA #842146284RR00001 We acknowledge that ClearWater Farm stands on land with a rich history as a meeting\n place for Indigenous communities and early settlers, where knowledge, culture, and goods were exchanged\n under the shade of the over 200-year-old Trading Tree. The ClearWater Futures Foundation is committed to\n reconciliation by honoring this legacy, learning from Indigenous perspectives, and fostering meaningful\n relationships built on trust, respect, and collaboration. We strive to weave Indigenous knowledge and\n practices into our work, contributing to a shared future that reflects the principles of truth and\n reconciliation in Canada. © The ClearWater Futures Foundation, All Rights Reserved."
    },
    {
      "url": "https://clearwateradvisers.com/about-us/",
      "text": "ABOUT US - Clearwater Home About Us About Us Our Team What We Do For You Winning more often Negotiations Ipos & Trade Sales Analysing and Developing Leaders Mastering Virtual Presence Media handling Town Hall, Keynote & Pitch Preparation Strategic Communication Group Workshop Coaching Writing Better Team and Leadership Communication Video Communication and Production Testimonials Clients Client List Case Studies Blog Contact Us jumbotron-placeholder-3 Developing Natural Communicators Clearwater Advisers has been showing clients around the world how to stand out and win hearts and minds for over 10 years. Broadly speaking, we carry out work in three ways; One-to-one coaching with leaders Group workshops (2-6 people) Advisory support- preparing people for live events. More often than not, once we start working with a client, it becomes a combination of all three. Bespoke service All our work is bespoke and precisely tailored to meet your specific needs so we work with your material and are highly flexible Increase trust and buy-in As a firm of strategic communication advisors, we specialise in showing leaders and their teams how to increase trust and buy-in when they communicate. Develop winning presentations and live events We will work with you in an advisory capacity as you prepare for live events.  E.g. Roadshows, IPOs/Divestments, Investor presentations, Beauty Parades, conference speeches or product launches Our unique approach At Clearwater Advisers, we combine the science of the latest diagnostic communication analysis technology (Personal Presence Analysis®) with the art of projecting your natural personality. Our aim is simple To show you how to come across naturally in high pressure situations. Discover how we can help you and your team. Contact us: Tel: +44 020 7831 8700 Email: enquiries@clearwateradvisers.com FREE Communication Tips Working with Helping Talented People Become Great Communicators"
    },
    {
      "url": "https://clearwatersecurity.com/contact/",
      "text": "Contact Us | Clearwater Contact About Us Who We Serve Careers Cybersecurity & Risk Managed Service Programs ClearAdvantage Program Scale cybersecurity & compliance as a program that elevates trust with patients, partners, and vendors ClearConfidence Program Drive ongoing cyber risk identification and reduction through our tech-enabled solution Managed Security Services Detect and mitigate cyber threats before they become a crisis by leveraging the expertise of Healthcare’s MSSP Cybersecurity Assist Partner Program (CAPP) Risk Management Enterprise Cyber Risk Management OCR-Quality® Risk Analysis OCR-Quality® Risk Response 405(d) HICP Assessment Vendor Risk Management as a Service Security Consulting vCISO Incident Response NIST CSF Maturity Assessment Medical Device Security Resiliency Services Technical Security Testing Cloud Services Managed Cloud Services Accelerate and protect your healthcare business in the cloud with expert-led Azure and Microsoft 365 security, compliance, and operations management Hybrid Cloud Security & Assistance Leverage our healthcare cloud expertise for hybrid setups, migrations, and security assessments integrated with on-prem services Cloud Security Posture Management Continuous monitoring of cloud infrastructure for risks and misconfigurations, with expert-guided remediation support Privacy & Compliance Privacy Privacy Risk Assessment Patient Privacy Monitoring Services Privacy Program Development Privacy Staffing & Training Expert Witness Services Compliance Platform IRM|Pro® IRM|Analysis® IRM|Privacy® IRM|Security® IRM|Performance™ IRM|405(d) HICP™ Compliance Healthcare Compliance HIPAA Risk Analysis HIPAA Privacy & Breach Notification NIST-800-171 Assessment Compliance Program Effectiveness Compliance Program Development Compliance Staffing & Training Certification & Audit HITRUST PCI DSS SOC 2 CMMC EPCS Resources Blog Webinars & Events Case Studies eBooks Podcasts On-Demand Webinars White Papers Book: Enterprise Cyber Risk Management as a Value Creator Book: Stop the Cyber Bleeding About Us Who We Serve Contact Select Page Contact Us We want to hear from you! Please use this form to let us know a little more about you and your organization and how we can be helpful to you.  (800) 704-3394  Security Operations Center +1 855 588 0145  info@clearwatersecurity.com  Nashville, TN Connect With Us Connect With Us Terms of Use | Privacy Policy ©2025 Clearwater Security & Compliance LLC"
    },
    {
      "url": "https://www.gerstles.com/?page_id=5",
      "text": "Contact form 1 – Gerstles Main Visit Clearwater Contact form 1 Home Contact form 1 Contact form 1 Your name [text* your-name] Your email [email* your-email] Subject [text* your-subject] Your message (optional) [textarea your-message] [submit “Submit”] [_site_title] “[your-subject]” [_site_title] From: [your-name] <[your-email]> Subject: [your-subject] Message Body: [your-message] — This e-mail was sent from a contact form on [_site_title] ([_site_url]) [_site_admin_email] Reply-To: [your-email] 0 0 [_site_title] “[your-subject]” [_site_title] Message Body: [your-message] — This e-mail was sent from a contact form on [_site_title] ([_site_url]) [your-email] Reply-To: [_site_admin_email] 0 0 Thank you for your message. It has been sent. There was an error trying to send your message. Please try again later. One or more fields have an error. Please check and try again. There was an error trying to send your message. Please try again later. You must accept the terms and conditions before sending your message. The field is required. The field is too long. The field is too short. There was an unknown error uploading the file. You are not allowed to upload files of this type. The file is too big. There was an error uploading the file. © 2021 / Site Designed KGLR Privacy Preference Center Privacy Preferences"
    }
  ]
}