{
  "fuentes": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.porthudsonmarina.net/get-hooked-grill/",
      "email": "info@porthudsonmarina.net"
    },
    {
      "url": "https://www.eatonthehook.com/",
      "email": "contact@eatonthehook.com"
    },
    {
      "url": "https://hookedmarketandkitchen.com/",
      "email": "pfeiffkl@yahoo.com"
    },
    {
      "url": "https://www.pasconewsonline.com/news/pasco-county-get-hooked-grill-opens-new-port-richey-location/article_47b4d2f2-a949-11ef-98ea-07edd402e085.html",
      "email": "bfarrow@pasconewsonline.com"
    },
    {
      "url": "https://www.pasconewsonline.com/news/pasco-county-get-hooked-grill-opens-new-port-richey-location/article_47b4d2f2-a949-11ef-98ea-07edd402e085.html",
      "email": "bfarrow@pasconewsonline.com"
    },
    {
      "url": "https://gethookedcoffee.com/menu",
      "email": "info@ndiscovered.com"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    }
  ],
  "mails": [
    "bfarrow@pasconewsonline.com",
    "contact@eatonthehook.com",
    "hero-contact@2x.jpg",
    "info@ndiscovered.com",
    "info@porthudsonmarina.net",
    "info@reception-plus.de",
    "pfeiffkl@yahoo.com"
  ],
  "nombre_sitio": "gethookedgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Datenschutz Nachricht E-Mail Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.porthudsonmarina.net/get-hooked-grill/",
      "text": "Get Hooked Grill - Port Hudson Marina Skip to main content Facilities Services Boat Rentals Get Hooked Grill Contact Facilities Services Boat Rentals Get Hooked Grill Contact Conveniently located on the marina property Fresh Food & Good Fun! Get Hooked always has the freshest seafood from local fishermen as well as, pasta, steaks, and more. It’s all about Good Food and Good Fun. Come dock your boat and enjoy our new menu. Visit Website View Menu Address 14329 Crab Trap Ct. Hudson, FL 34667 Directions Social Contact Marina (727) 869-1840 Rentals (727) 869-1840 info@porthudsonmarina.net Copyright © 2025 Port Hudson Marina. All Rights Reserved."
    },
    {
      "url": "https://www.eatonthehook.com/",
      "text": "Get Hooked! VIEW MENU & ORDER NOW ORDER ONLINE Home Restaurant Menu Drinks Lunch Catering Menu Contact Web Accessibility Welcome Catering Get Hooked! ORDER ONLINE Home Restaurant Menu Drinks Lunch Catering Menu Contact Web Accessibility Welcome Catering Cajun Seafood, Grilled Plates, and Southern Food for the family ORDER ONLINE ABOUT US STARTED IN ORANGE COUNTY BY A TEAM OF SIBLINGS, ON THE HOOK IS A FAMILY THAT AIMS TO PROVIDE FOOD AND FUN FOR EVERYONE Welcome to On The Hook! Our family is big, loud, and opinionated, but one thing we agree on is that we love to eat. On The Hook Seafood & Grill is a family venture where we  bring our home cooking and secret recipes to your table.  We have seafood, spice, and steak grilled to perfection that will wet your palates and guarantee to make your mouth water for more.  There's something for everyone, so from our family to yours,  \"Come over!  It's time to eat!\" PHOTOS IN WEBSITE BY PETER TRAN & SHANE MORINES ADDRESS 2445 East Imperial Highway Brea, CA 92821 PHONE (714) 671-5886 Cajun Shrimp with Corn, Potatoes and Andouille Sausages Crawfish with Corn and Potatoes Garlic Cheese Bread with Marinara Dipping Sauce Garlic Noodles with Andouille Sausages and Clams Grilled Rib Eye Steak Cajun Fries Beignets with Powder Sugar and Ice Cream main Menu NIBBLERS $ 17.99 Shrimp Ceviche $ 17.99 $ 13.99 Fried Chicken Wings (6) Regular (Dry), Hooked, Cajun, Garlic Buffalo, Lemon Pepper, Mango Habanero, or Garlic Parmesan $ 13.99 $ 14.99 Fried Calamari $ 14.99 $ 12.99 Zucchini Fries $ 12.99 $ 7.99 Regular Fries $ 7.99 $ 8.99 Cajun Fries $ 8.99 $ 9.99 Garlic Parmesan Fries $ 9.99 $ 9.50 Cajun Garlic Parmesan Fries $ 9.50 $ 9.99 Sweet Potato Fries $ 9.99 $ 14.99 | $23.99 Live Oysters 6 pieces | 12 pieces $ 14.99 | $23.99 $ 17.99 | $25.99 Fried Oysters 6 pieces | 12 pieces $ 17.99 | $25.99 BREAD, SOUPS, & SALADS $ 7.99 Plain Flat Bread $ 7.99 $ 7.99 Garlic Flat Bread $ 7.99 $ 11.99 Garlic& Cheese Flat Bread $ 11.99 $ 17.99 Gumbo Soup with White Rice Upgrades -  Seafood +2.5 | Brown Rice +.50 $ 17.99 $ 15.99 All Hooked Up Chowder Mild, Medium, or Spicy I Add Fries +3 $ 15.99 $ 8.99 | $13.99 Clam Chowder Cup | Bowl $ 8.99 | $13.99 $ 13.99 Hook's Garden, Wedge, Or Caesar Salad Add Chicken +4, Shrimp +5, Salmon +6, or Mahi-Mahi +6 $ 13.99 $ 13.99 Brussel Caesar Salad Add Chicken +4, Shrimp +5, Salmon +6, or Mahi-Mahi +6 $ 13.99 HOOK'S FAVORITES PAN-TOSSED $ 19.99 Pastalaya Mild, Medium, or Spicy $ 19.99 $ 11.99 Garlic, Butter, or AHU Noodles Add: Vegetables +2, Chicken +3,  Andouille Sausages +4.5, Shrimp +4.5, Clams +4 $ 11.99 $ 14.99 Macaroni & Cheese Add: Jalapeños +1.5, Chicken +3, Andouille Sausages +4.5, Shrimp +4.5 $ 14.99 $ 19.99 Jambalaya Mild, Medium, or Spicy | Brown Rice +1 $ 19.99 $ 19.99 Shrimp & Grits With Andouille Sausage $ 19.99 FROM THE FRYER $ 16.99 Fried Plates White Fish, Shrimp +3, or Catfish +4 $ 16.99 $ 17.99 Beer-Battered Fish & Chips Made with Wild-Caught Cod $ 17.99 $ 15.99 Po'Boy with Fries White Fish, Chicken, Andouille Sausage, Shrimp + 2, Catfish +3, or Oyster +3 $ 15.99 $ 15.99 Fried Taco Plate Plate of Three, Fish or Chicken | Upgrade: +1 per Shrimp Taco $ 15.99 FROM THE GRILL $ 16.99 Grilled Plates White Fish, Chicken, Shrimp +3, Catfish +3, Salmon +5, Mahi-Mahi +6 $ 16.99 $ 29.99 Steak of the Day Cut of The Day $ 29.99 $ 15.99 Blackened Taco Plate Plate of Three, Fish or Chicken | Upgrade: +1 per Shrimp Taco $ 15.99 SIDES $ 4.00 White Rice $ 4.00 $ 4.00 Brown Rice $ 4.00 $ 5.50 Side Salad $ 5.50 $ 5.50 Vegetable Medley $ 5.50 $ 7.99 Regular Fries $ 7.99 $ 2.50 Coleslaw $ 2.50 $ 2.75 Corn on the Cob $ 2.75 UPGRADES $ 1.50 Add Avocado $ 1.50 Regular to Cajun Fries +1, to Garlic Parmesan Fries +2, to Cajun Garlic Fries +2.51 or  Sweet Potato Fries +2 THE MAIN EVENT STEP 1: MAIN CARGO Market Price Whole Dungeness Crab (Seasonal) Market Price Market Price King Crab Legs Market Price Market Price Snow Crab Legs Market Price Market Price Lobster Tail Market Price Market Price Crawfish (Seasonal) Market Price Market Price Shrimp Market Price Market Price Peeled Shrimp Market Price Market Price Clams Market Price Market Price Mussels Market Price STEP 2: FLAVOR OF THE DAY Cajun Garlic Butter Lemon Pepper All Hooked Up (All 3 Sauces Combined) STEP 3: WALK THE PLANK Mild Medium Spicy Extra Spicy STEP 4: TRINKETS $ 2.75 Corn on the Cob $ 2.75 $ 3.50 Red Potatoes (3) $ 3.50 $ 5.00 Andouille Sausages (6) $ 5.00 $ 3.50 Eggs (2) $ 3.50 $ 4.00 White Rice $ 4.00 $ 4.00 Brown Rice $ 4.00 $ 5.50 Dine-In Extra Sauce $ 5.50 $ 8.50 To-Go Extra Sauce $ 8.50 KID'S CORNER Includes Milk, Apple Juice, or Fountain Drink $ 7.99 | $9.99 Chicken Tenders Served with French Fries, 2pcs | 3pcs $ 7.99 | $9.99 $ 9.99 Popcorn Shrimp With French Fries $ 9.99 $ 8.99 Corn Dog With French Fries $ 8.99 $ 8.99 Cheese Pizza Add Pepperoni +1.00 $ 8.99 $ 8.99 Mac & Cheese With Fruit $ 8.99 $ 4.50 Seasonal Fruit $ 4.50 $ 2.50 Milk $ 2.50 $ 2.50 Apple Juice $ 2.50 DESSERTS $ 9.99 Beignets Classic or AHU $ 9.99 $ 8.99 Fried Banana With Condensed Milk Drizzle $ 8.99 $ 3.00 Ice Cream Single Scoop French Vanilla $ 3.00 $ 1 Add Nutella $ 1 $ 2 Add Strawberries $ 2 $ 1 Add Condensed Milk $ 1 Bottled Beers Mojitos Margaritas Bottled Beers Draft and Craft Beers on Tap drink menu DRINKS ________ $ 4.75 Fountain Drinks (Bottomless) Coke, Coke Zero, Sprite, Orange Fanta, Hi-C, Dr. Pepper, Regular Lemonade $ 4.75 $ 4.75 Iced Tea (Bottomless) Unsweetened, Sweet, Raspberry $ 4.75 $ 5.25 Arnold Palmer (Bottomless) Half Iced-Tea, Half Lemonade $ 5.25 $ 5.75 Peach Palmer (Bottomless) Peach Flavor, Half Iced-Tea, Half Lemonade $ 5.75 $ 3 Hot Tea Green Caffeinated Tea $ 3 SPECIALTY DRINKS ____________________ $ 7.50 Blueberry Lemonade $ 7.50 $ 7.50 Strawberry Lemonade $ 7.50 $ 7.50 Mint Lemonade $ 7.50 $ 10.99 AHU Lemonade $ 10.99 $ 7.50 Lychee Lemonade $ 7.50 $ 6.99 Cucumber Limeade $ 6.99 $ 6.99 Watermelon Spritzer $ 6.99 $ 16.99 Cajun Piña Colada $ 16.99 $ 6.99 Virgin Mojitos Blueberry, Mint, Orange, Raspberry, Watermelon, Cucumber, Lychee, Mango or Strawberry $ 6.99 $ 7.50 Thai Iced Tea Whipped Cream $ 7.50 $ 6.50 Chicory Coffee Hot or Vietnamese-Style Iced $ 6.50 BEER & WINE ______________ Draft Beer 16oz Glass, Prices Vary Bottled Beer Corona | Dos Equis | Modelo | Michelob $ 11 | $30 House Red Wine Glass | Bottle $ 11 | $30 $ 11 | $30 House White Wine Glass | Bottle $ 11 | $30 $ 13 | $35 Premium White Wine Glass | Bottle $ 13 | $35 HANDCRAFTED COCKTAILS $ 12.99 Angry Michelada Choose Your Bottled Beer | Upgrade to Draft +2 $ 12.99 $ 12.99 Mojitos Blueberry, Mint, Orange, Raspberry, Watermelon, Cucumber, Lychee, Mango or Strawberry $ 12.99 $ 12.99 Margaritas Cucumber, Mango, Original, Strawberry, or Watermelon | Upgrade to Spicy +1 $ 12.99 Lunch Specials Available Monday and Wednesday-Friday from 11:30am-2:00pm $ 12.99 Cajun Taco Plate- Pick 3 Tacos Blackened Chicken,  Fried/Blackened White Fish, Fried/Blackened Shrimp +1, Upgrade to Lettuce Wrap +1.50 $ 12.99 $ 13.99 Soup & Salad Combo Gumbo (Seafood +2), Clam Chowder, or AHU Chowder +1 with Side Salad $ 13.99 $ 12.99 Brussel Caesar Salad Add Chicken +4, Shrimp +5, Salmon +6, Mahi-Mahi +6 $ 12.99 $ 11.99 Macaroni & Cheese Add Chicken +3, Jalapenos +1.5, Shrimp +4.50, Andouillie Sausage +4.50 $ 11.99 $ 14.99 | $16.99 Fish & Chips Wild-Caught Cod 2pcs | 3pcs $ 14.99 | $16.99 $ 16.99 Shrimp & Grits With Andouille Sausage $ 16.99 $ 10.99 Garlic, Butter, or AHU Noodles Add Veggies +2, Chicken +3, Shrimp +4.50, Clams +4, Andouille Sausage +4.50 $ 10.99 $ 15.99 Grilled Shrimp Plate With Veggies or Rice & One Side $ 15.99 $ 14.99 Grilled Shrimp Salad Wedge, Caesar, or Hook's Garden Salad $ 14.99 $ 12.99 Po'Boy with Regular Fries White Fish, Chicken, Andouille Sausage, Shrimp +2, Catfish +3, or Oyster +3 $ 12.99 DRINKS $ 6 Blueberry Lemonade $ 6 $ 6 Strawberry Lemonade $ 6 $ 6 Lychee Lemonade $ 6 $ 6 Thai Iced Tea $ 6 CATERING MENU Starter Trays Feeds 6-8 People $ 35 GARLIC & CHEESE BREAD Served with Marinara Sauce $ 35 $ 35 CALAMARI Served with Cocktail Sauce $ 35 $ 30 HOOK'S GARDEN SALAD Add Chicken +15 $ 30 $ 30 WEDGE SALAD Add Chicken +15 $ 30 $ 30 CAESAR SALAD Add Chicken +15 $ 30 $ 30 BRUSSEL CAESAR SALAD Add Chicken +15 $ 30 PARTY FAVORITES FRIED CHICKEN WINGS $ 35 20 Pieces, +1.75 Per Extra Piece 2 flavors only (half & half) $ 35 Regular, Cajun, Hooked, Garlic Buffalo, or Lemon Pepper Fish & Chicken $33, Shrimp $48 CAJUN TACOS 12 Servings Minimum (1 protein per order) Fish & Chicken $33, Shrimp $48 Extra Chicken Taco +$2.75 Extra Fish Taco +$2.75 Extra Shrimp Taco +$4 ENTRÉE Trays Feeds are 6-8 People $ 55 JAMBALAYA Chicken, Shrimp, & Andouille Sausage $ 55 Mild, Medium, or Spicy $ 38 NOODLES Garlic, Butter, or AHU $ 38 Add Veggies +$6 Add Chicken +$7 Add Shrimp +$10 Add Sausages +$8 Add Clams +$9 $ 45 MAC 'N CHEEESE With Herbs & Breadcrumb Topping $ 45 Add Veggies +$6 Add Chicken +$7 Add Shrimp +$10 Add Sausages +$8 Add Clams +$9 $ 30 CHICKEN VEGGIE SKEWERS 10 Pieces | +3 Per Per Extra Piece $ 30 $ 40 SHRIMP VEGGIE SKEWERS 10 Pieces | +4 Per Per Extra Piece $ 40 Cajun Boil MarketPrice SHRIMP Every 3 lbs., Get 1 lb. Free MarketPrice MarketPrice PEELED SHRIMP Every 3 lbs., Get 1 lb. Free MarketPrice MarketPrice CLAMS Every 3 lbs., Get 1 lb. Free MarketPrice MarketPrice MUSSELS Every 3 lbs., Get 1 lb. Free MarketPrice MarketPrice CRAWFISH (Seasonal) Live, Never Frozen MarketPrice MarketPrice KING CRAB LEGS Wild-Caught from Alaska MarketPrice MarketPrice SNOW CRAB LEGS Wild-Caught from Canada MarketPrice MarketPrice LOBSTER TAIL Wild-Caught from Maine MarketPrice MarketPrice DUNGENESS CRAB (Whole & Seasonal) Wild-Caught from Canada MarketPrice SIDES $ 22 WHITE RICE (Half Tray) $ 22 $ 22 BROWN RICE (Half Tray) $ 22 $ 20 COLESLAW (Half Tray) $ 20 $ 20 CORN ON THE COB (15 Pieces) $ 20 DESSERT $ 20 BEIGNETS 10 Full-Sized Pieces--Add Nutella +5 $ 20 CUSTOMIZE YOUR CATERING ORDER Want something on our menu that you don't see here? Call or contact ahead of time, and we'll do our best to help feed your family! Contact Us! Reach out to us if you have questions, comments, or concerns about our business, for information on joining our team, and order inquiries. We’d love to hear from you! Name * First Name Last Name Email Address * Subject * Message * Thank you! ADDRESS 2445 East Imperial Highway #M Brea, California 92821 PHONE 714-671-5886 HOURS Monday: 11:30am-2:00pm | 4:30pm-8:00pm Tuesday: 4:30pm-8:00pm Wednesday: 11:30am-2:00pm | 4:30pm-8:00pm Thursday: 11:30am-2:00pm | 4:30pm-8:00pm Friday: 11:30am-2:00pm | 4:30pm-9:00pm Saturday: 11:30am-9:00pm Sunday: 11:00am-8:00pm LAST CALL IS 30 MINUTES PRIOR TO CLOSING Hours Subject To Change At Managers Discretion Website Accessibility On The Hook is committed to making the information on its website accessible to all, including individuals with disabilities, and to ensuring its website complies with Title III of the Americans with Disabilities Act by using World Wide Web Consortium's (W3C) Web Content Accessibility Guidelines (WCAG) 2.0 Level A Success Criteria. Please keep in mind that our efforts are ongoing, therefore, there may be certain areas of our website that achieve increased accessibility at a rate different than others during a given period of time. If you would like to report any concern or difficulty accessing information on our website, or request access to content that is currently unavailable to you, please contact us at contact@eatonthehook.com or 714-671-5886. Back To Top Powered by Squarespace"
    },
    {
      "url": "https://hookedmarketandkitchen.com/",
      "text": "Local Restaurant In Latham NY | Hooked Market & Kitchen × Hooked Holiday Menu Order Form See Holiday Menu Below is a selection of platters, prepared foods, fresh fish, seafood and more to help you celebrate this holiday season. All orders must be placed with 48 hours notice. Once your order is received, a confirmation email will be sent. If you do not receive the confirmation, check your spam folders or give us a call to ensure we have your order. Please note: pricing for fresh fish and seafood is an estimate based on market prices. Final totals will be confirmed at pickup. If you need to make a change to your order, give us a call at 518-389-6217. Hours : 12/21 11am - 8pm 12/22 Closed 12/23 11am - 6pm 12/24 9am - 3pm Contact Information Name* Phone* Email* Pick-up Date* Pick-up Time* Next Hooked Holiday Menu Order Form Feast of the Seven Fishes  $175 (feeds four) Cannot be made in smaller quantities. Please advise if there is a gluten or dairy allergy. Don't forget to add any salads, sides or desserts you may need!! Choose five appetizers: Mini Crab Cakes Stuffed Shrimp Escargot Cocktail Shrimp (GF & DF) Calamari Salad (GF & DF) Bacon Wrapped Scallops (GF & DF) Crab Stuffed Mushrooms (can be GF & DF) Stuffed Clams (can be GF & DF) Choose two entrees: King Crab Stuffed Sole with beurre blanc Cod Picatta Salmon Florentine Grilled Swordfish with eggplant caponata (GF & DF) Seafood Platters & Bulk Small Colossal Shrimp Platters (feeds 8-12 people) $115.00 Quantity: Large Colossal Shrimp Platters (feeds 25-30 people) $220.00 Quantity: Lobster & Shrimp Cocktail Platters (feeds 10-15 people) $135.00 Quantity: Bulk Colossal Shrimp (by the pound) $32.00/LB Quantity: Appetizers Crab Stuffed Cremini Mushrooms $5.00/ea. Quantity: Stuffed Clams (by the dozen) $30.00/LB Quantity: Stuffed Shrimp - Raw (six per order) $28.00 Quantity: Regular-sized Crab Cakes (by the half dozen) $55.00 Quantity: Mini crab cakes (by the dozen) $45.00 Quantity: Mini Crab Cake Platter with Remoulade (30 pieces) $130.00 Quantity: Bacon-wrapped Scallops (6 pieces per order) $48.00 Quantity: Salt Cod Fritters (6 pieces per order) $20.00 Quantity: Smoked Salmon Egg Rolls (6 pieces per order) 40.00 Quantity: Calamari Salad (by the pound) $16.00/LB Quantity: House-smoked Salmon (by the pound) $26.00/LB Quantity: Lobster Salad (by the pound) $72.00/LB Quantity: Smoked Whitefish Spread (by the pound) $16.00/LB Quantity: Marinated Octopus $48.00/LB Quantity: Smoke Show (smoked bbq rubbed cream cheese, bacon jam & chili fig jam, served with tortilla chips) Feeds 10-12 $65.00 Quantity: Pickled Herring in Wine Sauce (by the pound) $8.00/LB Quantity: Side Dishes Homemade Potato Gratin (half tray) $48.00/half tray Quantity: Homemade Sweet Potato Gratin (half tray) $48.00/half tray Quantity: Garlic Mashed Potatoes (half tray) $40.00/half tray Quantity: Roasted Root Vegetables (half tray) $45.00/half tray Quantity: Roasted Garlic Brown Butter Sweet Potatoes (half tray) $45.00/half tray Quantity: Paella Rice (half tray) $40.00/half tray Quantity: Roasted Brussels & Broccoli with Cranberry Agrodolce (half tray) $45.00/half tray Quantity: Candied Carrots (half tray) $45.00/half tray Quantity: Baked Mac & Cheese (half tray) $45.00/half tray Quantity: Green Bean Almondine (half tray) $45.00/half tray Quantity: Gorgonzola Polenta (half tray) $45.00/half tray Quantity: Creamed Spinach (half tray) $50.00/half tray Quantity: Pumpkin Bisque (by the quart) $13.00/QT Quantity: New England Clam Chowder (by the quart) $14.00/QT Quantity: Harvest Salad (half tray) - mixed greens, roasted delicata squash, fresh pears, shredded brussels sprouts, toasted pecans, dried cranberries, gorgonzola, fig balsamic vinaigrette $30.00/half tray Quantity: Harvest Salad (full tray) - mixed greens, roasted delicata squash, fresh pears, shredded brussels sprouts, toasted pecans, dried cranberries, gorgonzola, fig balsamic vinaigrette $50.00/full tray Quantity: Salad Nicoise (half tray) - mixed greens, heirloom cherry tomatoes, cucumber, green beans, broccolini, fingerling potatoes, olives, hard boiled egg, dijon vinaigrette $30.00/half tray Quantity: Salad Nicoise (full tray) -mixed greens, heirloom cherry tomatoes, cucumber, green beans, broccolini, fingerling potatoes, olives, hard boiled egg, dijon vinaigrette $50.00/full tray Quantity: Caesar Salad (half tray) - romaine & radicchio, grana padano, chipotle spiced pine nuts, parmesan croutons, chipotle caesar $30.00/half tray Quantity: Caesar Salad (half tray) - romaine & radicchio, grana padano, chipotle spiced pine nuts, parmesan croutons, chipotle caesar $50.00/full tray Quantity: Demi Baguette $3.00/ea. Quantity: Desserts 6 Assorted Cookies Box $10.50 Quantity: 12 Assorted Cookies Box $21.00 Quantity: Chocolate Cloud Cake (GF & DF) (feeds 8) $84.00 Quantity: Retail Goods (Prices are estimates) If you would like your fish cooked please use the special request box at the bottom of the page to let us know if you would like it grilled or fried Salmon (by the pound) $21.50/LB Quantity: Ahi Tuna (by the pound) $31.50/LB Quantity: Barramundi (by the pound) $21.00/LB Quantity: Halibut (by the pound) $30.75/LB Quantity: Swordfish (by the pound) $22.75/LB Quantity: Icelandic Cod (by the pound) $19.75/LB Quantity: Icelandic Haddock (by the pound) $19.75/LB Quantity: Arctic Char (by the pound) $19.75/LB Quantity: Monkfish (by the pound) $14.50/LB Quantity: Bronzini (whole) $14.50/LB Quantity: Squid (mixed tubes and tentacles, by the pound) $16.75/LB Quantity: Squid (just tubes, by the pound) $16.75/LB Quantity: Squid (just tentacles, by the pound) $16.75/LB Quantity: Scallop U15 (average 10 per pound) $35.00/LB Quantity: Smelt (by the pound) **if available** $7.00/LB Quantity: Homemade Hot Italian Chicken Sausage $9.99/LB Quantity: Homemade Sweet Italian Chicken Sausage $9.99/LB Quantity: Retail Shellfish (Prices are estimates) Littleneck Clams (by the dozen, in shell only, no shucked clams) $10.00 Quantity: Cherrystone Clams (by the dozen) $9.00 Quantity: Mussels (by the pound, about 25 each) $5.00 Quantity: Oysters (unshucked, in shell) $2.50 Quantity: Claw Crab Meat (by the pound, in one pound cans) $18.00/LB Quantity: Lump Crab Meat (by the pound, in one pound cans) $40.00/LB Quantity: Jumbo Lump Crab Meat (by the pound, in one pound cans) $65.00/LB Quantity: Live lobster (approximately 1.5-1.75lbs each) can be steamed for $3 each upon request $20.50/LB Quantity: Shucked Oysters NOTE TIME FOR PICK UP, MUST BE EATEN WITHIN FOUR HOURS Oysters East Coast $2.75 Quantity: Retail Frozen Items (Prices are estimates) 2LB bag of Peeled & Deveined Shrimp U16/20 (average 16-20 shrimp per pound) WHOLE BAG $25.00 Quantity: 2LB bag of Peeled & Deveined Shrimp U8/12 (average 8-12 shrimp per pound) WHOLE BAG $42.00 Quantity: 2LB bag of Shell on Domestic Chem Free Wild Shrimp U15 (average 15 shrimp per pound) WHOLE BAG $42.00 Quantity: King Crab Legs (average .75lb per leg) $80.00 Quantity: Chilean Seabass (8 ounce portions) $38.00 Quantity: Cold Water Lobster Tails (7-8 ounces each) $56.00 Quantity: Octopus (whole, 4-6 pound average) notify us if you would like us to start the thawing process $13.50/LB Quantity: Sablefish (Black cod) $18.95/LB Quantity: Prepared Frozen Items Escargot (one dozen per tray) $14.00 Quantity: Fish Stock (by the quart) $6.00/QT Quantity: Chicken Stock (by the quart) $8.00/QT Quantity: Vegetable Stock (by the quart) $7.00/QT Quantity: Special requests/modifications: Back Submit × Hooked Online Order Form See Options ***Please note that deliveries are NOT for hot food or menu items. This service is for retail only. Delivery days are Tuesday & Wednesday for the time being. An additional day may be added once there is more volume. You will receive a confirmation email within 24 hours to confirm receipt of your order. An additional email will be sent to confirm the specifics of your order and what day it will be delivered. We would like orders to be as close to $100 as possible, if they fall below $75 we may add a $10 charge. Contact Information Name* Phone* Email* Street Address* Apt. City* State* Zip* Drop off Instructions I will accept delivery in person I will leave a cooler for drop off Next Hooked Online Order Form Retail Fish/Shell Fish (Prices are estimates) Deli/Grab & Go Frozen Salads Main Menu Specials Family Style Raw Bar Soups Desserts Sides Catering Special requests/modifications: Back Submit 1177 Troy Schenectady Rd • Latham • NY 12210 (518) 389-6217 Tuesday - Saturday 11AM - 8PM Connect With Us: Menu Market About Us Hours & Locations Purchase Gift Cards Menu Market About Us Hours & Location Gift Cards What can we help you find today? I’m looking for your latest menu and specials... Take Me To The Food! I want to see what’s fresh in the market... Show Me The Goods! I’m looking for catering & platter options... You Got It! Privacy Policy Privacy Policy Last Updated: 8/31/2021 Thank you for visiting our Hooked Market & Kitchen’s website. Hooked Market & Kitchen and our affiliates (together, \"Hooked Market & Kitchen\" or \"we\") strive to make our website a useful tool and a rewarding experience for our customers by tailoring the content to your personal needs and interests. To accomplish this, we responsibly collect and utilize personally identifiable information. We respect your privacy, and this Privacy Policy documents our commitment to safeguard and treat your privacy and the personal information that we collect online with reasonable care and in strict compliance with applicable law for the protection of personally identifiable information. This policy was implemented as of August 31st, 2021 and applies to information collected on this website and those of our affiliates (together, \"our website\" or \"the website\") and covers the following areas: What personally identifiable information is collected by Hooked Market & Kitchen or by any third party through our website; How Hooked Market & Kitchen uses this information; With whom Hooked Market & Kitchen may share this information; What choices are available to you as a user of our website with respect to collection, use and distribution of the information; and What types of security procedures are in place to protect the loss, misuse or alteration of information under our control. This Privacy Policy applies only to our website and information collected for us or by us through our website and through various features and online offerings on our website. It does not apply to any third party site or service linked to our website or recommended or referred by our website or by our staff. Further, it does not apply to any other type of online site or online service operated by Hooked Market & Kitchen or its affiliates, or to any of our offline activities. 1. Information Collection and Use Hooked Market & Kitchen collects two different types of information through our website: anonymous information and personally identifiable information. Anonymous Information. First, we collect and store anonymous, aggregate information (such as internet protocol (IP) addresses, browser types, search engines, internet service provider (ISP), referring/exit pages, platform type, date/time stamp, and number of clicks) from all visitors to our website. The anonymous information that we do collect from your visit is never linked to any of your personally identifiable information until you voluntarily submit that personal information, in which case some otherwise anonymous information may be connected to your website activity and personal account. Otherwise, the anonymous information is only used in the aggregate to analyze trends, administer the website, diagnose any problems, track a visitor's movement in the aggregate, and gather broad demographic information for aggregate use. We may provide this anonymous information in aggregate form to other parties or use it for our own insight or marketing purposes. Our ability to use this information is not restricted in any way. We also use \"cookies\" and \"image tags\" to collect certain usage information from all customers and visitors to our website. A \"cookie\" is a small text file that a website can place on your computer’s hard drive or on your mobile device’s memory in order to collect information about your activities on our website. An \"image tag,\" also known as a clear GIF or web beacon, works together with cookies and is a small image file that may be located in various areas of our website. Most browsers automatically accept cookies, but you have the option to change your browser setting to decline them. Accepting cookies in no way gives us access to your computer or any personal information about you, since cookies are not used to identify anonymous website visitors. Our cookies enable you to proceed smoothly through our website and know whether you’ve used it before, so as to eliminate some steps that apply to new visitors. Cookies also give us usage data like how often you visit, where you go on our website, and what you do while here. Similarly, a cookie may be placed by our third-party advertising companies. These companies may use aggregated statistics about your use of our website and third party media in order to provide you with advertisements about goods and services that you may be interested in. The information they collect does not include your personal information. The third-party advertising companies may also employ technology that is used to measure the effectiveness of ads. Any such information is anonymous. They may use this anonymous information about your visits to this and other sites in order to provide advertisements about goods and services of potential interest to you. No personal information about you is collected during this process. The information is anonymous and does not link online actions to an identifiable person. Hooked Market & Kitchen may partner with third-party advertising company Google to collect information about how users navigate our website and we use many or all of their products to enhance our website experience. Like Hooked Market & Kitchen, Google is very much committed to consumer protection, to maintaining the privacy of your personal information and to making ads safe, unobtrusive and relevant for you. Google uses this information only to generate anonymous visitor profiles, which do not contain personally identifiable information. These anonymous profiles are used to provide you content specifically tailored to you. To learn more about how Google collects and manages information, or to opt out of Google’s collection of information about how you navigate our website, please go to https://www.google.com/policies/privacy/. Google’s technologies and products, including AdSense, Google Ads, Google Analytics, and a range of DoubleClick-branded services, also use cookies. When you visit a page that uses one of these products, various cookies may be sent to your browser. Among the Google products we use is Google Analytics, a web analytics service provided by Google. Information generated by cookies about your use of our website (including your shortened IP address) is transmitted to a Google server in the U.S. and stored there. Google uses this information to evaluate your use of our website, compile reports on website activity for our website operators and to provide other services related with the website and internet use. Google may also transfer this information to third parties if required by law, or where third parties process these data on behalf of Google. For more information about Google Analytics and how it collects and processes data, please go to \"How Google uses data when you use our partners' sites or apps\", located at http://www.google.com/policies/privacy/partners/. To opt out of Google Analytics, please go to https://tools.google.com/dlpage/gaoptout. To help us manage our advertising and website, Google offers many products in addition to Google Analytics, including Google’s Analytics for Display Advertisers, AdSense, Google Ads, and a range of DoubleClick-branded services. Hooked Market & Kitchen participates in an integrated version of Google Analytics and DoubleClick products or services and/or other Google display ad products or services, known as Google Analytics for Display Advertisers. As with Google Analytics, you can learn more about Google Analytics for Display Advertisers, or you can opt out, by going to https://tools.google.com/dlpage/gaoptout. We have or may enable interest-based advertising features, including remarketing, with Google Analytics in connection with other Google services. This kind of advertising based on consumer interests and your precise geographic location may, in addition to remarketing, include Google’s Adword product features known as: interest categories, similar audiences, other types of interest-based advertising and demographic and location targeting. \"Remarketing\" is simply a feature of interest-based advertising that lets us reach people who have previously visited our website. Remarketing helps us match interested people, like you, with a relevant message on our website or even when you search on Google using our keywords, use Google products like Gmail, or visit other websites. We gather information through cookies for remarketing, and similar audiences feature in Google Ads, simply to make your visits relevant and allow us both to pick up where we left off on your last visit. Our partners, including Google, use cookies to serve ads based on your past visits to our website and to show our ads on sites across the Internet. You can opt out of Google's use of cookies by visiting Google's Ads Settings. Alternatively, we may use Google DoubleClick's remarketing pixels to participate in remarketing and create a remarketing list of potential customers (this involves adding a remarketing tag, a small snippet of code that we get from Google’s Ad Exchange, across all our website pages). In such case, instead of the previous link, you can opt out of DoubleClick's use of cookies by visiting the DoubleClick opt-out page or the Network Advertising Initiative opt-out page. Finally, you can opt out of any other third-party advertising partner's use of cookies by visiting the Network Advertising Initiative opt-out page. With respect to unrelated, third party web sites, such as third party online retailers, advertisers, or unrelated sites that we may happen to link to, or web sites that link to our website, those third parties may collect personal information directly from you. The information policies and practices of these unrelated parties are not covered by this privacy policy. We do not control the privacy policies of third parties even if we may provide hyperlinks or other access to their web sites. We are not responsible or liable for their independent policies and practices. Please review their privacy policies and practices. It is your responsibility to review them and decide if you are satisfied with their protections. Some browsers have a \"do not track\" feature that lets you tell websites that you do not want to have your online activities tracked. These features are not yet uniform, so we are not currently set up to respond to those signals. Personally Identifiable Information. Second, we require the submission of certain personally identifiable information when you use some services available on our website. Our website may use a variety of contact forms and tracking phone numbers for visitors to request information, products, and services. We collect a visitor's contact information (like his or her email address or phone number) and in some cases, demographic information (like his or her zip code). We use this information to get in touch with our prospective customers about their requests, and to send them additional information about our products and services. 2. Our Use Restrictions on Your Personally Identifiable Information Hooked Market & Kitchen does not sell, rent, or share personally identifiable information to or with any third party not affiliated with or owned by Hooked Market & Kitchen, except service providers who may assist us in such areas as our promotions, data storage and order processing (See Agents and Vendors below). Hooked Market & Kitchen will never give or sell your personally identifiable information to unaffiliated third parties to be used for the purposes of sending you unsolicited commercial offers, such as spam. We may, however, use your personal information to send you information in e-mails from Hooked Market & Kitchen or its affiliated companies, which do not relate to the information  or services you have ordered. You may altogether avoid or opt out of these marketing campaigns (see \"Opting Out\" below). We may also need to contact you for purposes other than marketing, for example to provide notice about the status of our website or the specific services you have requested. We also use this information to the extent necessary to enforce our website terms of service and to prevent imminent harm to persons or property. You may not opt-out of these kinds of communications. Consistent with our change policy (see \"Your Consent and Notification of Changes\" below), we will post any updates or notices about material changes in our policies on collection and use of your personally identifiable information to this Privacy Policy page. 3. Third Party Information About You Our website supplements the information that you provide with information that we obtain about you from third parties. To the best of our knowledge, we only deal with reputable providers who gather and maintain information in accordance with all applicable state and federal laws. Any such information will be maintained by us in accordance with the standards set forth in this Privacy Policy along with other personal information you've provided. 4. Our Agents and Vendors Hooked Market & Kitchen may use other companies and/or individuals to perform any functions described in this Privacy Policy, on our behalf. Examples include marketing, data and network hosting, service reminders, verification of sales, order processing and fulfillment, administering contact information and e-mail services and running special promotions. Such parties only have access to the personal information needed to perform these functions and may not use or store the information for any other purpose. We obtain commitments from these agents and vendors working on our behalf to refrain from using any information provided by Hooked Market & Kitchen to send you unsolicited e-mail messages from third parties or similar communications and from sharing your information with unrelated parties. 5. Disclosure of Personal Information As Required By Law or Otherwise We will disclose personal information when required by law, or if we have a good-faith belief that such action is necessary to (a) comply with a current judicial proceeding, a court order or legal process served on us or to comply with the request of a law enforcement agency, (b) protect and defend our rights, or (c) protect the rights, property, and other interests of our users or others. 6. Links Our website contains links to other sites. Hooked Market & Kitchen is not responsible for the privacy practices or content of these other sites. We encourage you to be aware when you leave our website and to read the privacy statements of each and every site that collects personally identifiable information from you. Our Privacy Policy applies solely to information collected by our website. 7. Security Hooked Market & Kitchen takes commercially reasonable precautions to protect your personally identifiable information. For example, we encrypt communications through our website with commercial strength encryption generally used by our industry. However, given the nature of the Internet and the fact that network security measures are not perfect, we cannot guarantee the absolute security of your information. If we are required to provide notice to you of a data security breach, the notice will be provided in electronic form. 8. Your Consent and Notification of Changes By using any of our website or submitting information to us online, you agree that we may collect and use this information as stated in this Privacy Policy at the time we collect the information. If we decide to change our Privacy Policy in any material way, for a reasonable time we will post a concurrent notice to this Privacy Policy page on our website to alert you about the change in our privacy and information collection practices. In addition, if we make any material changes in our privacy practices that affect your personally identifiable information already stored in our database, we apply those changes to the personally identifiable information in our possession only as permitted by applicable law. 9. Opting Out Visitors and customers have the opportunity to opt-out of receiving specific types of communications from us and our partners, such as e-mail, by not providing personally identifiable information at the point where our website requests such information about you. In addition, you may unsubscribe or opt out of all future e-mails from us, that do not relate to the products and services you have ordered, by clicking the unsubscribe link on any email marketing communication you receive. 10. Further Information about Our Privacy Policy and Practices This Privacy Policy applies to all visitors and customers of our website. We may delete any or all of your information at any time without notice to you for any reason or no reason unless otherwise required by law to retain it. You may have other privacy protections under state laws and we will comply with any applicable state laws when we disclose information about you. This Privacy Policy replaces any previous policy on this topic and any statements or disclosures to you about our information practices. SMS Text Message Offer Terms & Conditions / Privacy Policy USER OPT-IN: Hooked Market & Kitchen SMS coupon redemption is a standard rated one-off query service focused on providing consumers the ability to redeem offers via automated SMS text message based on a specific local tracking number. This number is not a short code. End users will opt-in by completing a web form that requires the users First Name, Last Name and Mobile Phone Number. No future communication will be sent via SMS text message, as this technology is a Query/Response program. USER PRIVACY: We will not share or use your mobile number for any other purpose. Hooked Market & Kitchen has the right to contact customers who successfully redeemed a mobile coupon/offer by calling the phone number used to redeem the offer(s). Hooked Market & Kitchen will comply with Federal Laws and Regulations relative to DNC Policy. USER FEES: We do not charge users fees for this service. Message and data rates may apply. CARRIERS SUPPORTED: Alltel, AT&T, Sprint, T-Mobile, Verizon Wireless, Nextel, Virgin Mobile USA, U.S. Cellular, Metro PCS, ACS Wireless, All West Wireless, Bluegrass, Boost USA, Cambridge Telecom, Cellcom, Cellular South, Centennial, Cincinnati Bell, Cricket Communications, Dobson, Cellular One of East Central Illinois, Appalachian Wireless, Farmer's Mutual Telephone Company, General Communications, Golden State Cellular, PC Management, Inland Cellular, Illinois Valley Cellular, Nex-Tech Wireless, Nucla-Naturita, nTelos, Revol, Silver Star PCS (Gold Star), Snake River PCS, South Central, Syringa, Thumb Cellular, UBET Wireless, Unicel, United Wireless, and West Central Wireless. Other new carriers will be included, regardless of being added to this list. WARRANTY: Hooked Market & Kitchen will not be liable for any delays in the receipt of any SMS text messages connected with this program. Delivery of SMS text messages are subject to effective transmission from your wireless service provider/network operator. PRIVACY POLICY: Hooked Market & Kitchen respects your privacy. We will only use information you provide to transmit your text message, and attempt to communicate via phone calls. WE DO NOT SELL, RENT, LOAN, TRADE, LEASE OR OTHERWISE TRANSFER ANY PHONE NUMBERS OR CUSTOMER INFORMATION COLLECTED THROUGH OUR SERVICE TO ANY THIRD PARTY. Nonetheless, we reserve the right at all times to disclose any information as necessary to satisfy any law, regulation or governmental request, to avoid liability, or to protect our rights or property. When you complete forms online or otherwise provide us information in connection with the Service, you agree to provide accurate, complete, and true information. You agree not to use a false or misleading name or a name that you are not authorized to use. If we, in our sole discretion, believe that any such information is untrue, inaccurate, or incomplete, we may refuse you access to the Service and pursue any appropriate legal remedies Get Hooked On Us Join our mailing list today and be the first to see news, specials, and more. Don’t worry, the email comes from us, and we don’t sell your information! Submit Hooked Market & Kitchen Menu Items & Market Offerings Your beloved “fish-slingers” are slingin’ more than just fish these days! Don’t worry, Hooked is still the seafood-centric spot you know and love, but now we have a whole lot more in store. Grab a seat for lunch or dinner, shuck an oyster at the bar, stop in for the latest market creations and get ready to dive into the new Hooked Market & Kitchen experience. Our menus and market offerings update seasonally so check the boards below for current selections and specials. Weekly Specials Fresh Local Ingredients Paired With Cocktails & Wine From Our Oyster Bar Lunch Menu See The Dinner Menu See The Raw Bar See The Booze Soups Salads & Bowls Kitchen Po-Boys Tacos Sides Desserts Dinner Menu See The Lunch Menu See The Raw Bar See The Booze Soups Salads & Bowls Kitchen Po-Boys Tacos Sides Desserts Raw Bar See The Lunch Menu See The Dinner Menu See The Booze Booze Menu See The Lunch Menu See The Dinner Menu See The Raw Bar Beer Wine Spirits See The Lunch Menu See The Dinner Menu See The Raw Bar See The Booze Hooked Catering Seasonal Appetizers & Meals Catering From Hooked Market & Kitchen Our catering platter options offer a range of seasonal appetizers and meals carefully crafted to make any family gathering, office lunch or special event instantly delicious. Want More Catering Info? Just give us some info and we’ll get back to you! Submit Fresh Seafood & Standout Local Meats From Hooked Market & Kitchen Hooked Market proudly serves some of the Capital Region’s best seasonal, scratch made goods. Our deli case is filled with a rotating selection of the freshest seafood, standout local meats and an array of tasty prepared foods . Stock up to make weekly meals easy as 1,2,3. Don’t forget to check out our freezers with an endless array of stocks, soups and the newest favorites — house-made pizzas, empanadas, crab cakes and more! The Market Fresh Prepared Frozen Retail The Market Fresh Prepared Frozen Retail Deli Family Style The Market Fresh Prepared Frozen Retail Wine Spirits The Market Fresh Prepared Frozen Retail See The Fresh Market See The Prepared Market See The Frozen Market See The Retail Market Photo Reel (Get It?) Our COVID Protocol Our #1 priority is keeping our customers and staff healthy. We are following CDC COVID guidelines and will continue to update our protocols, as necessary. Curbside pickup is always an option. Give us a call and we’ll bring it out to you for a contactless experience. COVID Our COVID Protocol Our #1 priority is keeping our customers and staff healthy. We are following CDC COVID guidelines and will continue to update our protocols, as necessary. Curbside pickup is always an option. Give us a call and we’ll bring it out to you for a contactless experience. Visit Hooked Tuesday - Saturday 11AM - 8PM 1177 Troy Schenectady Rd • Latham • NY 12210 (518) 389-6217 Connect With Hooked Navigate Hooked Menu Catering Market About Us Hours & Location Privacy Policy Get Hooked © Hooked Market & Kitchen • All rights reserved • Website powered by OOMDO"
    },
    {
      "url": "https://www.pasconewsonline.com/news/pasco-county-get-hooked-grill-opens-new-port-richey-location/article_47b4d2f2-a949-11ef-98ea-07edd402e085.html",
      "text": "PASCO COUNTY: Get Hooked Grill Opens New Port Richey Location | News | pasconewsonline.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Facebook Twitter YouTube Instagram Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home About Us Contact Us Advertise Terms of Use Privacy Policy News Pasco News Hernando/Citrus News Tampa Bay Area News Florida News Weather Hurricane A&E Calendar Travel Business Stock Market Multimedia Photo Galleries Videos Health Sports Online Features Menu 81° Mostly Cloudy Site search Search Open user controls Log In Using Your Account Log In Don't have an account? Sign Up Today My Account Dashboard Profile Saved items Logout 81° Home About Us Contact Us Advertise Terms of Use Privacy Policy News Pasco News Hernando/Citrus News Tampa Bay Area News Florida News Weather A&E Calendar Travel Business Stock Market Health Sports Multimedia Photo Galleries Videos Share This Facebook Twitter WhatsApp SMS Email Close Featured PASCO COUNTY: Get Hooked Grill Opens New Port Richey Location Managing Editor - Pasco News Online News Editor Managing editor Author facebook Author email Nov 22, 2024 Nov 22, 2024 Updated Nov 22, 2024 1 min to read Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save NEW PORT RICHEY, FLa.- Get Hooked Grill is excited to announce the grand opening of its newest location, Get Hooked Riverside, on Monday, November 25th. The new restaurant, located at 5546 Main Street in New Port Richey, will offer the same delicious seafood and waterfront dining experience that customers have come to love. The opening of the new location comes as the Hudson location continues its rebuilding process after sustaining significant damage from recent hurricanes. While the Hudson location is expected to reopen by late February, the team at Get Hooked Grill is committed to providing exceptional service and fresh seafood to the community during this time. \"We want to thank our loyal customers for their patience and understanding as we work to rebuild our Hudson location,\" said owner John Hill. \"We're excited to welcome everyone to our new Riverside location and look forward to serving the New Port Richey community.\" Facebook Twitter WhatsApp SMS Email Print Copy article link Save Tags New Port Richey, Florida Pasco County, Florida Restaurants News Top Story News Editor Managing editor Author facebook Author email Follow News Editor Sections News Arts & Entertainment Business Health Sports Multimedia Online Features Services Calendar Search Weather Contact Pasconewsonline.com PO Box 5906 Hudson, FL 34667 Phone: 727-351-0007 Email: Bfarrow@Pasconewsonline.com Facebook Twitter YouTube Instagram × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Pasco News Media Group LLC PO Box 5906, Hudson, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics Breaking News Subscribe"
    },
    {
      "url": "https://gethookedcoffee.com/menu",
      "text": "Get Hooked Home Online Ordering Menu Contact Us NOW HIRING Home Online Ordering Menu Contact Us NOW HIRING Menu Specialty Coffee Start your day with a Get Hooked specialty coffee Kappa 6.50/6.90/7.60 espresso, milk, coconut & macadamia  nut syrup and vanilla powder when blended (hot, iced, blended) Caramelito 6.50/6.90/7.60 espresso, milk, caramel & vanilla syrup, vanilla powder if blended (hot, iced, blended) Honey Freeze 6.50/6.90/7.60 espresso , milk honey syrup, vanilla powder (hot, iced, blended) Hazelnut Mocha 6.50/6.90/7.60 espresso, milk, hazelnut syrup, chocolate sauce, chocolate powder if blended (hot, iced, blended) Vanilla & Bean Whip 7.00/7.50/8.00 milk, vanilla syrup & powder, blended then swirled and topped with whipped coffee (blended) Get Hooked Cold Brew 6.50/6.90/7.60 Our house coffee cold brewed for 48 hours Coffee ~ brewed Signature Brewed Coffee 4.40/5.20/6.00 Medium Roast, Decaf Hazelnut brew 4.40/5.20/6.00 brewed hazelnut coffee (hot, iced) Mocha roast 5.40/5.90/6.40 Medium roast with added cream or milk swirled with chocolate sauce (hot) roast & Foam 5.00/5.50/6.20 choice of brewed coffee, milk, & foam (hot) Espresso ~ Drinks Latte 6.50/6.90/7.60 espresso, milk, foam (hot, iced) Americano 6.50/6.90/7.60 espresso, water  (hot, iced) Cappuccino 6.50/6.90/7.60 equal parts espresso, milk, foam  (hot, iced) Flat White 6.50/6.90/7.60 espresso, milk  (hot, iced) Mocha 6.50/6.90/7.60 espresso, milk, chocolate sauce  (hot, iced, blended) Macchiato 6.50/6.90/7.60 milk, espresso, foam if hot  (hot, iced) Espresso Shots 3.00/4.00/5.00 double, triple, quad  (hot, iced) Specialty Tea loose leaf tea steeped 3-5 minutes Seattle Fog 6.50/6.90/7.60 earl grey tea, milk, honey & lavender syrup  (hot, iced) malibu Fog 6.50/6.90/7.60 english breakfast tea, milk, coconut & vanilla syrup  (hot, iced) Breakfast Tea Latte 6.50/6.90/7.60 english breakfast tea, milk, vanilla syrup  (hot, iced) Chai Tea Latte 6.50/6.90/7.60 chai powder, milk, topped with cinnamon  (hot, iced, blended) Pomegranate Green Tea Lemonade 5.50/6.10/6.70 green tea, lemonade, pomegranate syrup  (iced) Honey green Tea Lemonade 5.50/6.10/6.70 Green tea, lemonade, honey (iced) Passion Tea Lemonade 5.50/6.10/6.70 passion fruit tea, lemonade (iced) Matcha Latte 6.90/7.70/8.50 unsweetened matcha powder, milk, optional sweetener (hot, iced) matcha Vanilla Bean Freeze 6.90/7.50/8.00 matcha powder, milk, vanilla syrup & powder blended Teas 5.20/5.70/6.20 caffeinated: earl grey • english breakfast • green tea • jasmine green tea • matcha (hot, iced) herbal: passion • lavender • chamomile (hot, iced) Enjoy our coffee and bagels? Visit us on Instagram & Facebook @gethookedcoffee Menu / Price List Other Specialty Drinks ChocoChip Freeze 6.50/6.90/7.60 milk, chocolate powder, chocolate chips blended, chocolate drizzled cup Samoa Freeze 6.70/7.10/7.80 milk, caramel & coconut syrup, chocolate powder, biscotti blended, chocolate caramel drizzled cup Vanilla Cream Freeze 6.50/6.90/7.60 milk, vanilla syrup & powder blended Hot Chocolate 6.00/6.60/7.10 milk, chocolate powder (hot) Get hooked on us! Menu / Price List Smoothies 20 oz. (8.80) Flavors strawberry, mango or pineapple Additions extra fruit                   (+3.00) banana                        (+3.00) Get hooked on us! Menu / Price List Get hooked burritos & wraps on your choice of tortilla (flour white tortilla or spinach tortilla) Hooked burrito 12.60 sausage or bacon, egg, cheddar, tots, chunky salsa Mulholland 15.90 sausage & bacon, egg, cheddar, tots, chunky salsa, avocado, sour cream Shredded Beef Burrito 16.00 tri-tip, cheddar cheese, salsa, onions, cilantro Shredded Chicken Burrito 15.00 chicken, cheddar cheese, salsa, onions, cilantro Santa Maria Wrap 16.00 BBG chicken, bacon, cheddar cheese, arugula, tomato, ranch Ventura Wrap 15.00 buffalo chicken, pepper jack cheese, avocado, sprouts, ranch Cali Wrap 15.00 turkey, bacon, pepper jack cheese, avocado, tomato, onion, spinach, honey mustard, hot honey Bagel Sandwiches Build your own or choose one of our signature sandwiches on your choice of bagel Get Hooked bagel sandwiches~ On your choice of bagel Hooke Bagel 12.60 sausage or bacon, fried egg, cheddar cheese Malibu 12.60 hot turkey, melted swiss, sprouts, avocado, cream cheese berkley 12.60 Fried egg, spinach, arugula, peppered tomato & cream cheese Calabasas 15.90 fried egg, avocado, thin layer of cream cheese, red pepper flakes, celery salt served on an open face bagel The valley 12.60 hot ham, fried egg, melted swiss cheese, tomato, mayo Breakfast b.l.t 12.60 bacon, fried egg, arugula, tomato, mayo, cream cheese Big Sur 15.90 hot ham, hot turkey, bacon, melted swiss cheese, tomato, arugula, avocado, mayo hidden hills (lox) 15.90 lox, capers, red onion, & cream cheese (served open face) San Diego 16.00 chicken breast, swiss cheese, avocado, arugula, tomato, siracha ranch Toppings~ MEAT- 5.50 fried egg bacon sausage ham turkey lox PRODUCE- 1.50-2.80 Tomato avocado arugula sprouts red onion spinach pickles lemon jalapeno CHEESE- 1.80 swiss cheddar SPREADS-.75-2.50 cream cheese strawberry cream cheese unicorn cream cheese chive and onion cream cheese jalapeno cream cheese garlic cream cheese hazelnut chocolate spread fig jam cinnamon & sugar butter peanut butter honey mayo chipotle mayo butter berry jam dijon mustard Bagels($2.80) plain sesame everything onion garlic cinnamon & raisin salt poppy seed egg blueberry chocolate chip jalapeno rye super cinnamon PREMIUM BAGELS $3.50 pizza cheese cheesy jalapeno cheesy onion gluten free (not celiac safe) Get hooked on us! Menu / Price List Get Hooked Grill hot from the grill Sliders 2 for 7.50 sausage, bacon, or ham, egg, cheddar, on slider rolls Fried Egg Sandwich 10.50 fried egg, bacon, avocado, mayo, on toasted white bread Moorpark Sandwich 15.00 chicken breast, swiss cheese, onion, tomato, arugula, mustard, siracha ranch, on a wheat bun Scramble 12.50 3 eggs, 1 meat or avocado, and 2 additional ingredients (cheese, produce) side of tots 5.00 Copyright © 2023 Get Hooked - All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    }
  ]
}