{
  "fuentes": [
    {
      "url": "https://www.glenlake.org/staff",
      "email": "amanda@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "betsy@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "cassidy@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "daran@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "intern@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "rodney@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "susan@glenlake.org"
    },
    {
      "url": "https://www.glenlake.org/staff",
      "email": "wendy@glenlake.org"
    },
    {
      "url": "https://www.glenoakscountryclub.com/about-us/",
      "email": "dwilhem@glenoakscountryclub.com"
    },
    {
      "url": "https://www.theglenclub.com/contact/",
      "email": "golf@course.noexist"
    },
    {
      "url": "https://www.theglenclub.com/contact/",
      "email": "info@theglenclub.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "anthony.schiro@glenoak.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "erik.sienkiewicz@glenoak.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "info@glenoak.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "matt.bush@glenoak.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "rob.krajewski@glenoak.com"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "email": "tim.fries@glenoak.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "acullinan@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "awiles@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "cdew@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "cfranzen@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "chusted@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "dheilmann@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "dkreft@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "eroush@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "golf@course.noexist"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "gott@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "info@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jezzi@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jtitus@kempersports.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "jtitus@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "kvivacue@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "lhenzlik@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "mmcdermed@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "rfischer@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "sgustafson@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "tgcap@kempersports.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "tgomez@theglenclub.com"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "email": "vpikovskiy@theglenclub.com"
    },
    {
      "url": "https://www.glenlakesgolf.com/contactus/",
      "email": "musialgolf@yahoo.com"
    },
    {
      "url": "https://southernfairwaysgolf.com/glenlakes-golf-club/",
      "email": "musialgolf@yahoo.com"
    },
    {
      "url": "https://business.hernandochamber.com/list/member/glen-lakes-golf-country-club-933",
      "email": "info@hernandochamber.com"
    }
  ],
  "mails": [
    "acullinan@theglenclub.com",
    "amanda@glenlake.org",
    "anthony.schiro@glenoak.com",
    "awiles@theglenclub.com",
    "betsy@glenlake.org",
    "cassidy@glenlake.org",
    "cdew@theglenclub.com",
    "cfranzen@theglenclub.com",
    "chusted@theglenclub.com",
    "daran@glenlake.org",
    "dheilmann@theglenclub.com",
    "dkreft@theglenclub.com",
    "dwilhem@glenoakscountryclub.com",
    "erik.sienkiewicz@glenoak.com",
    "eroush@theglenclub.com",
    "golf@course.noexist",
    "gott@theglenclub.com",
    "info@glenoak.com",
    "info@hernandochamber.com",
    "info@theglenclub.com",
    "intern@glenlake.org",
    "jezzi@theglenclub.com",
    "jtitus@kempersports.com",
    "jtitus@theglenclub.com",
    "kvivacue@theglenclub.com",
    "lhenzlik@theglenclub.com",
    "matt.bush@glenoak.com",
    "mmcdermed@theglenclub.com",
    "musialgolf@yahoo.com",
    "rfischer@theglenclub.com",
    "rob.krajewski@glenoak.com",
    "rodney@glenlake.org",
    "sgustafson@theglenclub.com",
    "susan@glenlake.org",
    "tgcap@kempersports.com",
    "tgomez@theglenclub.com",
    "tim.fries@glenoak.com",
    "vpikovskiy@theglenclub.com",
    "wendy@glenlake.org"
  ],
  "nombre_sitio": "glenlakes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.glenlake.org/staff",
      "text": "cid50780*image001.png@01D7E84D.AA35FE30 STAFF | Central Texas | Glen Lake Camp and Retreat Center top of page HOME OUR CAMPS SUMMER CAMP TREK (Grades 1-4) ELEMENTARY (Grades 3-6) JUNIOR HIGH (Grades 6-8) HIGH SCHOOL (Grades 9-13) SUMMER STAFF ELI PROGRAM VOLUNTEER CAMPER MAIL PARENT LOGIN WINTER CAMP BIBLE CAMP YOUR RETREAT RATES RESERVATIONS GET A QUOTE LODGING MEETING SPACES MEALS RECREATION ABOUT STAFF VOLUNTEER EMPLOYMENT EVENT GALLERY CONTACT CAPITAL CAMPAIGN DONATE SUMMER CAMPS EXPLORE OUR GUEST RETREATS GETAWAY HERE CORE VALUES:  LOVE DEEPLY  |  HOST GRACIOUSLY  |  SERVE INTENTIONALLY The Glen Lake Staff seeks to lead and serve as a faithful part of God's work in and through the ministry of Glen Lake. Each staff member is serving on a ministry team dedicated and committed to a team approach to the ministry entrusted to us. Daran Miller Executive Director daran@glenlake.org Amanda Garza Guest Services Director amanda@glenlake.org Rodney Garrard Facilities Director rodney@glenlake.org Susan Sledge Retreat Coordinator susan@glenlake.org Wendy Owens Program Director wendy@glenlake.org Cassidy Barrett Assistant Program Director and Retreat Host cassidy@glenlake.org Betsy Spencer Curriculum Specialist betsy@glenlake.org Leila Prichard Intern intern@glenlake.org Charlie Scheck Facilities Assistant Sunshine Rushing Facilities Assistant Leonarda Luviano Housekeeping Siliva Lopez Housekeeping Angelica Robles Kitchen Manager Glen Camp Cat CONNECT WITH US MAILING ADDRESS 1102 NE Barnard St. Glen Rose, Texas 76043 GIVE US A CALL P. 254-897-2247 SCHEDULE A TOUR info @glenlake.org CONTACT US SOCIAL bottom of page"
    },
    {
      "url": "https://www.glenoakscountryclub.com/about-us/",
      "text": "About Us - GlenOaks Country Club Member Login Member Login Email Us 502-339-0215 Home Golf Rates Membership Golf Scorecard Course Photos Tournaments Practice Facility Golf Lessons Member Leagues Grille & Pub Swimming Contact ABOUT US GlenOaks represents a unique alternative for clubs in this region. A friendly and attentive professional staff, first class amenities, and camaraderie you won't find anywhere else. Here at GlenOaks we work very hard to maintain a friendly, family oriented, relaxed atmosphere at all times. You will certainly get the white glove treatment when appropriate, but we take pride in not taking ourselves too seriously. First and foremost we want GlenOaks to be fun for the entire family! A simple philosophy that we know you will come to appreciate. GlenOaks Country Club features an 18-hole Championship golf course that is quite challenging, yet fun for golfers of all skill levels. Bermuda grass fairways and true Bent grass tees and greens provide outstanding playing surfaces placed on gentle rolling terrain not common in the Louisville area. The Bunkers were fully renovated in 2016 and 2017 and improvements are always ongoing including Tee Grounds, Practice Facility and Cart Paths. GlenOaks is committed to providing our Membership with a constant improvement to the golf course and golf course conditions. The Club isn’t all about golf, however. We also offer a junior Olympic sized swimming pool and a separate wading pool for the youngest of youngsters. Our swim facility includes everything you need to make your hot, summer day a fun, refreshing and relaxing one - a diving board, expansive deck area, cabanas, restrooms, shower facilities and delicious treats from our pool-side food service. The Clubhouse at GlenOaks has a choice of venues for your dining enjoyment and entertainment including the renovated family friendly Grille and our cozy Pub featuring local Craft Beers and beautiful views. We also have beautiful Event Space and Meeting Rooms to accommodate your social events or business get-together's. Our menus are changed quarterly and feature House Made items throughout. A fully-stocked Golf Shop provides all you need to support your golfing habit. Newly renovated Men's and Ladies locker rooms are available for your convenience. GlenOaks invites you to experience firsthand Louisville’s most improved family-oriented country club.  Please accept this invitation to come and learn about the club for yourself. We offer the most variety and most affordable memberships of any Club in the area and we are sure we can find one that will fit your lifestyle. If you have any questions or would like to arrange a tour of the Club, please call Daniel Wilhem at 502.339.0215 ext. 107. Contact Us Join us in the clubhouse seven days a week. 10601 Worthington Lane Prospect, KY 40059 502.339.0215 © 2025 All Rights Reserved. GlenOaks Country Club. Home About Us Membership Golf Scorecard Course Photos Tournaments Practice Facility Golf Lessons Member Leagues Grille & Pub Swimming Banquets & Weddings Contact Shop Member Login"
    },
    {
      "url": "https://www.theglenclub.com/contact/",
      "text": "CONTACT - The Glen Club Skip to primary navigation Skip to main content Facebook Instagram Twitter YouTube MEMBERS ONLY NON-MEMBER TEE TIMES GIFT CARDS The Glen Club Home ABOUT ABOUT ACCOLADES PHOTO GALLERY Purchase Gift Cards CONTACT E-CLUB MEET THE MANAGEMENT TEAM DIRECTIONS Illinois Golf Hall of Fame WGA – Evans Scholars Foundation Tours NV5 Invitational presented by Old National Bank Golf Daily Fee Tee Time Booking GOLF COURSE INFORMATION HOLE-BY-HOLE 2025 GOLF RATES DRIVING RANGE RATES & INFORMATION THE GOLF SHOP GOLF LESSONS GOLF OUTINGS FREQUENT FAIRWAYS CHICAGOLAND HOLE IN ONE PROMOTION MEMBERSHIP EVENTS SPECIAL EVENTS WEDDINGS WEDDING SHOWERS BABY SHOWERS BAR/BAT MITZVAHS MEMORIAL LUNCHEONS MEETINGS Venue Video Tour EVENT SPACE SPECIFICATIONS HOTEL HOTEL Book Now View, Change Or Cancel Your Reservation Dining GRILL GRILL GRILL MENU Book Your Grill Reservation Upcoming Events JOIN OUR DINER’S CLUB Join Team CURRENT OPENINGS Employment Application – English Employment Application – Spanish CONTACT Contact Us Please use the form below to contact us. We will get back to you as soon as we can! Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Contact Info Address : 2901 West Lake Ave, Glenview, IL 60026 Email : info@theglenclub.com Phone : (847) 724-7272 (Front Desk/Room Reservations) (847) 832-6450 (Tee Time Reservations) (847) 832-6403 (The Grill) Get Social Facebook Twitter Instagram YouTube Page Footer Contact Us Address : 2901 West Lake Ave Glenview, IL 60026 Phone : (847) 724-7272 Email : info@theglenclub.com Copyright © 2025 The Glen Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.glenoak.com/contact-us/",
      "text": "Contact Us - Glen Oak Golf Course Skip to main content Skip to footer Glen Oak Golf Course Home Tee Times Golf Rates Golf Course Course Tour Hole-in-One Roster Donation Request Instruction/Fittings PGA Instruction Adult Clinics Youth Golf Titleist Fittings L.A.B Putter Fittings Education Series Events Events Gallery Weddings & Banquets Sample Packages Mahaney’s Pub Gift Cards/Passes Contact Us E-Club Employment homepage Slider Use left/right arrows to navigate slides Contact Us Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Comment * Submit Contact Us Glen Oak Golf Club 711 Smith Road East Amherst , NY 14051 (716) 688-5454 General Staff Tim Fries , PGA Certified Owner/Operator/GM tim.fries@glenoak.com Matt Bush, Golf Course Superintendent matt.bush@glenoak.com Anthony Schiro , PGA Associate, Assistant GM / Director of Golf Operations / Head Golf Professional anthony.schiro@glenoak.com Rob Krajewski , PGA Certified Director of Player Development rob.krajewski@glenoak.com Clubhouse Banquets/Golf Outings/Event Food & Beverage Erik Sienkiewicz Events & Clubhouse Operations Manager erik.sienkiewicz@glenoak.com / 716-574-4416 Footer Visit Us 711 Smith Road East Amherst, NY 14051 Call Us Phone: (716) 688-5454 Email Us Email: info@glenoak.com Follow Us Find Us Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Glen Oak Golf Course | 711 Smith Road East Amherst, NY 14051 | (716) 688-5454 Copyright © 2025 Glen Oak Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.theglenclub.com/meet-the-management-team/",
      "text": "MEET THE MANAGEMENT TEAM - The Glen Club Skip to primary navigation Skip to main content Facebook Instagram Twitter YouTube MEMBERS ONLY NON-MEMBER TEE TIMES GIFT CARDS The Glen Club Home ABOUT ABOUT ACCOLADES PHOTO GALLERY Purchase Gift Cards CONTACT E-CLUB MEET THE MANAGEMENT TEAM DIRECTIONS Illinois Golf Hall of Fame WGA – Evans Scholars Foundation Tours NV5 Invitational presented by Old National Bank Golf Daily Fee Tee Time Booking GOLF COURSE INFORMATION HOLE-BY-HOLE 2025 GOLF RATES DRIVING RANGE RATES & INFORMATION THE GOLF SHOP GOLF LESSONS GOLF OUTINGS FREQUENT FAIRWAYS CHICAGOLAND HOLE IN ONE PROMOTION MEMBERSHIP EVENTS SPECIAL EVENTS WEDDINGS WEDDING SHOWERS BABY SHOWERS BAR/BAT MITZVAHS MEMORIAL LUNCHEONS MEETINGS Venue Video Tour EVENT SPACE SPECIFICATIONS HOTEL HOTEL Book Now View, Change Or Cancel Your Reservation Dining GRILL GRILL GRILL MENU Book Your Grill Reservation Upcoming Events JOIN OUR DINER’S CLUB Join Team CURRENT OPENINGS Employment Application – English Employment Application – Spanish MEET THE MANAGEMENT TEAM At The Glen Club, our dedicated management team is the heart of our exceptional guest experience. With years of industry expertise, hospitality leadership, and a passion for excellence, our team works behind the scenes—and on the front lines—to ensure every event, round of golf, and visit exceeds expectations. Get to know the people who make The Glen Club one of the premier destinations for golf, weddings, dining, and events in the North Shore. Click below to learn more about each member of our leadership team, their roles, and what drives their commitment to The Glen Club experience. General Manager Joe Titus · General Manager Joe joined The Glen Club team in January, 2025. Joe has been a valued senior leader with KemperSports for over 19 years, previously serving as the General Manager at Hawthorn Woods Country Club and currently as a regional manager. He was elected to PGA Membership in 2005 and had brief stints on the east coast and at White Deer Run Golf Club in Vernon Hills. His passion for golf led him to a spot on the Arizona State Golf Team and he completed his degree in Marketing after transferring to Illinois State University. Joe continues to up the standard in the club industry and brings an unfound passion for the Members. Contact Phone: 847-832-6415 Email: jtitus@theglenclub.com Dustin Heilmann · Assistant General Manager For Dustin Heilmann, the most important tool in hospitality is a sincere smile. the foundation of great hospitality starts with a strong team and positive energy, a philosophy Heilmann plans to execute throughout his role at The Glen Club. Heilmann has exercised his inherent talent for guest service at several Chicago hotspots including Carmine’s and Nico Osteria, one of the most highly anticipated openings of 2013 in the culinary world. Working closely with notable industry leaders Chef Paul Kahan and Donnie Madia, Nico Osteria was named one of America’s 25 Best Restaurants by GQ and one of the best new restaurants by Esquire in 2014. Outside of his role as Food and Beverage Director, Heilmann enjoys reading about history and spending time outdoors – especially golfing, running and skiing. Heilmann is an avid music fan, and his diverse tastes includes Prince, Willie Nelson, Michael Jackson and his absolute favorite The Grateful Dead. If Heilmann could invite four guests to dinner, he’d dine with his father, Winston Churchill, Abraham Lincoln and Bob Dylan. Heilmann and his wife Lexington and daughter Freddie live in the Edgewater Beach neighborhood in Chicago. Contact Phone: 847-832-6402 Email: dheilmann@theglenclub.com Sales · Membership · Marketing Kate Vivacue · Director of Sales Kate joined The Glen Club in July 2021, bringing a wealth of experience and a passion for event coordination. A 2019 graduate of the University of Dayton, Kate launched her career as a catering project manager with SBR Events Group, where she excelled in managing and executing a variety of events. While at Dayton, she served as president of the campus activities board, organizing numerous events for her peers on and off campus, which helped her develop strong leadership and planning skills. Her enthusiasm for creating unforgettable experiences has quickly made her an integral part of The Glen Club’s event team. When not collaborating with clients to plan their dream events, Kate enjoys spending time with her husband, Matt, playing games, solving puzzles, and playing volleyball. She also loves catching up on The Office with Matt, as well as spending quality time with family and friends. After tying the knot at The Glen Club in November 2023, the venue holds a special place in Kate’s heart, adding even more meaning to her work. Whether she’s planning events or making memories with loved ones, Kate brings joy and energy to everything she does. Contact Phone: 847-832-6434 Email: kvivacue@theglenclub.com Lauren Henzlik · Event Sales Coordinator After establishing herself in a thriving career in dental assisting, Lauren decided to follow her heart into event coordinating at The Glen Club. Armed with a rich combination of customer-centric abilities, meticulous attention to detail, and an unwavering commitment to crafting unforgettable experiences, she steps into her new role with fervor. Lauren’s track record speaks volumes, showcasing her adeptness in nurturing client relationships and her drive to surpass expectations, all in the service of elevating The Glen Club’s events program. Outside of work, Lauren cherishes moments with loved ones, cheers for the Chicago Bears alongside her boyfriend despite her allegiance to the Minnesota Vikings, and finds solace in revisiting episodes of Friends or The Office. Contact Phone: 847-832-6431 Email: lhenzlik@theglenclub.com Mia McDermed · Marketing and Communications Coordinator and Admin After earning her BBA in Marketing from Loyola University Chicago, Mia joined The Glen Club as the Marketing and Communication Coordinator. She brings a creative, detail-oriented mindset shaped by experience in brand strategy, digital marketing, and event promotion. From developing marketing plans for national brands to supporting a nonprofit’s mission by leading events and growing digital presence in Rome, her work reflects a strong work ethic, a passion for storytelling, and a talent for connecting with people. She’s excited to bring her creativity and communication skills to elevate The Glen Club’s brand and guest experience. Outside of work, she enjoys decorating cakes, going to concerts, and rewatching her favorite TV shows. Contact Phone: 847-832-6420 Email: mmcdermed@theglenclub.com Golf Operations Ethan Roush · Head Golf Professional, PGA Ethan came to The Glen Club in 2013 and was promoted from assistant golf professional to his current role of head golf professional in 2016. He’s responsible for overseeing all areas of the golf operations, including daily operations, member events, private golf tournaments, merchandising and staffing while also delivering premier instruction to both members and non-members. Ethan came to The Glen Club from Bolingbrook Golf Club where he spent three years as an assistant golf professional. Prior to entering the golf business, he competed for prize money as a playing professional on Texas’ Tight Lies Tour. Ethan and his wife are parents to two daughters. Contact Phone: 847-832-6451 Email: eroush@theglenclub.com Anna Cullinan · First Assistant Golf Professional Anna joined The Glen Club in February 2020 after spending six seasons at Iowa’s Davenport Country Club (DCC), the last two of which were spent serving as the club’s assistant golf professional. She brings extensive experience serving private club members as well as organizing leagues, clinics and member games. Prior to working at DCC, Anna was a four-year starter on Western Illinois University women’s golf team. She’s currently enrolled in the PGM Associate Program and is working towards becoming a full member of the Professional Golfers’ Association of America. Contact Phone: 847-832-6452 Email: acullinan@theglenclub.com Adam Wiles · Superintendent Adam took over as superintendent of The Glen Club in 2020 after serving four years as the assistant superintendent at Royal Melbourne Country Club in Long Grove, Ill. A graduate of Michigan State University with a degree in Turf Science, Adam got his start in Chicago golf working at Conway Farms Golf Club. An avid golfer who enjoys lacing up his hockey skates in the winter, Adam also enjoys kayaking and playing tennis. Contact Phone: 847-724-5716 Email: awiles@theglenclub.com Florencio Montelongo · Assistant Golf Course Superintendent One of the club’s longest tenured staffers, Florencio’s career at The Glen Club began in 2000 when they were still growing in the golf course. He brings a lot of experience because of his wealth of knowledge regarding the property. Florencio can be seen on the golf course most days supporting his favorite sports team: the Chicago Cubs. Contact Phone: 847-724-5716 Dustin Kreft · Outside Services Manager Dustin has been a part of The Glen Club team since opening day in 2001. A native of Glenview, he started out as a caddie/cart attendant and has since worked his way up to his current role of outside services manager. His responsibilities include the day-to-day function of the outside services and caddie program in addition to working with the Western Golf Association’s Evans Scholars Program , the nation’s largest scholarship program for caddies. Dustin even met his wife at The Glen Club while he was caddying and she was driving the beverage cart. Contact Phone: 847-832-6410 Email: dkreft@theglenclub.com Food and Beverage Clinton Dew · Executive Chef Chef Clinton Dew began his culinary journey at Big Jones, one of Chicago’s most esteemed restaurants located in Andersonville. As a line cook, he honed his craft under the mentorship of three-time James Beard Award nominee, Chef Paul Fehribach. This invaluable experience with Chicago’s iconic Southern cuisine resonated with Dew’s roots in Tennessee, near Johnson City. Following this, Chef Dew advanced to the role of Sous Chef at White Oak Tavern and Inn in Chicago, where his dedication and culinary talent quickly earned him a promotion to Executive Chef. During his time there, he also gained significant experience in Front of House operations, further expanding his expertise. In the winter of 2017, Chef Dew answered the call of the South. With another harsh Chicago winter approaching, he seized the opportunity to enter the club world as the Executive Banquet Chef at The Olde Farm in Bristol, VA. There, he successfully managed events for up to 4,000 guests, including high-profile clients such as Jack Nicklaus, Lee Trevino, and Peyton Manning. After three years in the South, Chef Dew returned to the Midwest to start a family, finding it the ideal place to settle. As the Executive Sous Chef at Indian Hill Club in Winnetka, Chef Dew played a pivotal role in overseeing all aspects of the food and beverage operations. Chef Dew now resides in Rogers Park with his wife, Janet, and their daughter, Winter Rose. Contact Phone: 47-832-6437 Email: cdew@theglenclub.com Ron Fischer · Executive Sous Chef Chef Ron has been at The Glen Club since 2007. Previously, he served as the executive chef at both Oak Park and Ruth Lake Country Clubs, executive sous chef at the East Bank Club and helped open Hotel Nikko Chicago. In addition, he’s worked at and consulted with various Chicagoland restaurants to create menus and kitchen layouts. The youngest graduate of the French culinary school, Dumas Pierre, which used to be in Glenview, Chef Ron received his associate degree from the Culinary School of Kendall College while also serving as a teacher’s assistant during its opening. During school, he entered and won a medal in a cooking competition at the annual Chicago Food & Restaurant show. Contact Phone: 847-724-7272 Email: rfischer@theglenclub.com Stephen Gustafson · Sous Chef Growing up in Niles, Illinois, Stephen’s love for cooking was born at a young age from helping his mother. After attending Kendall College in Chicago, Stephen started his culinary career at Café Touché, where he worked his way up from intern to executive chef by 2018. From there, he served on the management team as executive sous chef for the opening of Zia’s Social in Norwood Park. Outside of work, Stephen enjoys long drives in his S2000 and hanging out with his dog, Clutch. Contact Phone: 847-724-7272 Email: sgustafson@theglenclub.com George Ott · Assistant Director Of Food and Beverage George inherited his passion for the hospitality industry from his father, who spent 30 years as a Golf Course Superintendent. Inspired by his father’s dedication, George became an Evan Scholar while working at Hillcrest Country Club during high school. He then embarked on an 8-year journey with Levy Restaurants, gaining valuable experience at venues like Arling Racetrack and the United Center. Eager to expand his knowledge, George joined Marriott Hotels for 6 years, taking on various management roles. His next challenge was as the Food and Beverage Manager at Twin Orchard Country Club, where he delved into the intricacies of club management. This experience paved the way for George to become the Assistant Director of Food and Beverage at Evanston Golf Club, where he honed his skills in overseeing larger operations. At Evanston Golf Club, George excelled in creating memorable experiences for members and guests alike, fostering strong team collaboration and member engagement. Now, armed with a wealth of expertise, George is ready to bring his passion and dedication to The Glen Club, where he aims to deliver exceptional service to all. Contact Phone: 847-724-7272 Email: gott@theglenclub.com Vlad Pikovskiy · Restaurant Manager Vladimir started his profession in Vernon Hills as a server who found his passion in the culinary world through his family’s love for cooking and restaurants. After finishing his degree in writing, he didn’t hesitate to help his cousin open the Intercontinental Hotel in Downtown Los Angeles. This led to his expansion of experience which included being a lead server at the Michelin star restaurant Jua, in the Flatiron District of New York City, task force as the assistant general manager at the Rockin’ Pig in Eureka Springs Arkansas, and managing the famous Carousel Bar at the Hotel Moneteleone in the French Quarter of New Orleans. Vladimir’s comes from a Ukrainian background with family that have been in the restaurant industry most of their lives. He enjoys traveling and dining in upscale restaurants and hotels and finds most of his comfort at home with his friends and family. In his spare time you can find him playing drums, rewatching classic blockbuster films, or trying out the new local ramen spot. Contact Phone: 847-724-7272 Email: vpikovskiy@theglenclub.com Telma Gomez · Halfway House/Beverage Cart Supervisor Telma began her career in food and beverage at Highland Park Country Club in 2001 and worked there until 2017 before joining The Glen Club. During her time here, she’s served as a banquets supervisor and captain, and now oversees the halfway house and beverage cart operations. In her free time, Telma enjoys baking cookies and playing and walking her three dogs, Tommy, Lucky and Merlin. Contact Phone: 847-724-7272 Email: tgomez@theglenclub.com Hotel · Clubhouse Colleen Husted · Clubhouse and Hotel Manager Colleen joined The Glen Club in July 2021, bringing with her over a decade of diverse experience in the hospitality industry. Her background spans several areas, including lodging, food and beverage, and golf management. Colleen’s extensive expertise and passion for the industry have made her a valuable addition to the team at The Glen Club, where she continues to contribute her skills and knowledge. Outside of work, Colleen cherishes spending quality time with her husband and son. Her love for exploration and adventure has led her to visit over 30 U.S. states and more than 10 countries. Whether she’s traveling or enjoying time with her family, Colleen finds joy in discovering new places and experiences. Contact Phone: 847-832-6613 Email: chusted@theglenclub.com Carl Franzen · Maintenance Manager Carl brings a wealth of experience to The Glen Club, with over 35 years in automotive and industrial maintenance. As a Ford Master Technician, Carl has a knack for fixing just about anything, always leading with compassion and expertise. He also spent six years as Maintenance Manager at an aerospace production company, further honing his skills. In his free time, Carl manages a private collection of 54 classic cars, a passion he’s pursued for the past 11 years. His hobbies include woodworking in his Mundelein basement, motorcycling with his wife of over 45 years, and spending quality time with his two grandsons. Carl is also dedicated to volunteer work, having rescued more than 15 dogs through the Illinois St. Bernard Rescue over the years. Contact Phone: 847-724-7272 Email: cfranzen @theglenclub.com Accounting Jonathan Ezzi · Club Controller Jonathan joined The Glen Club in February 2021. He has a widespread background in food and beverage management along with finance and accounting experience, most recently working for Aramark as the unit controller at Soldier Field. Prior to that, he worked for Levy Restaurants in their PGA division as a finance manager. An avid golfer who also plays ice hockey, Jonathan enjoys going to White Sox and Blackhawks games with his wife when away from The Glen Club. Contact Phone: 847-832-6405 Email: jezzi@theglenclub.com Sharon Radojevich · Accounting Assistant In 2022, Sharon became a member of the Glen Club. Her extensive accounting career spanned 40 years, during which she served as Controller for a Housing, Registration, and Event Company, and for the last 15 years, she held the position of Controller at a Food Distribution Company. Upon the sale of the company, Sharon chose to retire. However, after 7 months of retirement, she came across an advertisement for a part-time accounting assistant position at the Glen Club. Since then, she has been relishing her semi-retirement while working alongside her colleagues and club members. Outside of work, Sharon cherishes moments spent with her four grandchildren, indulges in gardening, and explores new destinations with her husband. Contact Phone: 847-832-6436 Email: tgcap@kempersports.com Page Footer Contact Us Address : 2901 West Lake Ave Glenview, IL 60026 Phone : (847) 724-7272 Email : info@theglenclub.com Copyright © 2025 The Glen Club All Rights Reserved. Powered by Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.glenlakesgolf.com/contactus/",
      "text": "Contact Us - Glenlakes Golf Club Skip to main content Skip to footer Glenlakes Golf Club Foley, AL Tee Times Courses About Our Courses Rates Scorecard Course Gallery FootGolf Instruction Membership Membership Information Pool Membership Snowbird Memberships Members Rules & Regulations Events GlenLakes Annual Scholarship Golf Classic Pub at GlenLakes Nearby The Park at OWA Nearby Hotels Contact Contact Us Contact Us Contact us for Membership and Lesson information: Email Musialgolf@yahoo.com or call 251-955-1220 9530 Clubhouse Dr, Foley, AL 36535-9326 Phone: (251) 955-1220 View Larger Map Footer Glenlakes Golf Club | 9530 Clubhouse Dr, Foley, AL 36535-9326 | (251) 955-1220 Copyright © 2025 Glenlakes Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://southernfairwaysgolf.com/glenlakes-golf-club/",
      "text": "GlenLakes Golf Club | Southern Fairways Radio Show Magazine Featured Courses Tour Tour Home SFGT at Rock Creek SFGT Cup Standings Rules Sheet About Tour Manual Deals News & Features Real Estate Contact Us Select Page GlenLakes Golf Club GlenLakes Golf Club 9530 Clubhouse Dr. Foley, AL 36535 Get Directions (251) 955-1220 glenlakesgolf.com Number of Holes: 27 Year Built: 1984 Architect: Bruce Devlin / Robert Von Hagge Type: Semi-Private Director of Golf: David Musial, PGA Description GlenLakes Golf Club is one of the most enjoyable courses to play on the Alabama Gulf Coast. The 18-hole “links style” Vista-Dunes layout is championship quality and hosted both the National Division II Junior College Championship and the Alabama Boys Junior Championship in 2018. The 9-hole resort style Lakes Course is fun for all skill levels and is a great walking nine. Foot Golf is also offered on the Lakes Course. David Musial, PGA GM/Director of Golf offers lessons to players of all ages and handicaps.  David can be contacted at musialgolf@yahoo.com . GlenLakes Golf Club is located on County Road 20 just one mile from the OWA Amusement Park and the Foley Beach Express. The sandy white beaches of Gulf Shores and Orange Beach are just minutes away. Glenlake Golf Club offers one of the very best golf values on the Alabama Gulf Coast. Make your tee time today! Radio Show Magazine Featured Courses Tour Deals News & Features Real Estate Contact Us Facebook X Copyright Southern Fairways | Designed by CoastPro Marketing 8id 8id 8id 8id slot 777 mahjong slot pusat4d rajarogel omutogel mpo08 betogel linetogel lunatogel hometogel dolantogel idrok okjkt id789 jktjkt webtalque polonezkoy ukkm nmfdegree aaghs haruka bbgovtgirl netrokonagghs matuailadar phiju pnsedu plantbasedandveganism zhezu gtarcc realtaxusa laguaparts otecedugh setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk setiarisk carsucre annuitymutualfunds bootdiabetics bootdiabetics derekgoneke investology101 moneyloanz econodish digitalhone cozystylehive chikvi chiczyo detectivesnewrecord validate webronhost phantafriends gdeventas armory limayrac golimayrac Share This facebook.com/soufairwaysgolf Twitter.com/southernfairwasygolf LinkedIn"
    },
    {
      "url": "https://business.hernandochamber.com/list/member/glen-lakes-golf-country-club-933",
      "text": "Business Directory Search Skip to content Menu NEWS & EVENTS Chamber Calendar Printable Calendar Monthly Monthly Membership Meeting- January 2025 Monthly Membership Meeting- February 2025 Monthly Membership Meeting- March 2025 Monthly Membership Meeting- April 2025 Keys to Success 2025 Keys to Success 2025 Bowling For Business July 2025 Chamber Golf Classic – December 2025 Community Events Calendar News Releases Video Blog Sync Calendar MEMBERSHIP Join Now Membership Investments Membership Benefits HERNANDO COUNTY LIVING Lodging Shopping Dining Real Estate Entertainment MAP Weather COMMUNITY RESOURCES Business Resources Small Business Resources Florida Small Business Parks & Recreation Government Contacts Hernando Magazine Deals and Jobs Visit Hernando Demographics Health Care County Resources Transportation Request Information ABOUT THE CHAMBER A Message from the CEO Meet the Chamber Team Executive Board Board of Directors CETA About CETA EXECUTIVE BOARD Board of Directors Ambassadors Involvement Information Request Volunteer Leadership Hernando CHAMBER PILLARS Advocacy Pillar Marketing Pillar Networking Pillar Training Pillar Business Directory Search All Categories... Accountants/CPA's/Bookkeeping Advertising & Media Advertising Agencies Advertising-Direct Mail Advertising-Novelty & Specialty Advertising-Periodical Agriculture Air Condition/Heating Contractors Airport FBO Aluminum Contractors Ambulance Service Animal Shelter/Rescue Apartment Rentals Appliance Sales-Repair & Service Assisted Living Facilities Attorneys - Estate/Disability Attorneys - General Automotive - Dealers Automotive - Repair/Collision Automotive - Transmissions Background Screening Services Banks Banquet Facilities Beauty Salon & Barber Shops Blood Bank Branding Brewery Business Brokers Business Consulting/Coaching Business Organization Cable Manufacturers Carpet/Upholstery Cleaners Catering Service Cellular Phones Cemeteries Chambers Of Commerce Charitable Organizations/Social Services Chiropractors Churches/Synagogues Civic Organization Cleaning Services Clubs/Organizations Colleges/Universities Community Organization Companion Care for Seniors Computer & Network Consultant Computer Sales & Service Concrete Contractors Consultants Contractors - Commercial/Industrial Contractors - General Copier & Fax Sales - Service & Supplies Counseling Centers Credit Unions Crematories Crushed Stone Cyber Security Decorating and Event Planning Dentists - General Dentists - Prosthodontics Diagnostic Imaging Dry Cleaners Dumpster Rental Electric Service & Supply Electrical Contractor Embroidery/Screen Printing Employment Agencies Engineers/Consultants Entertainment Environmental & Ecological Services Fencing Financial Advisor/Consultant Financial Services Fingerprinting Fitness Center Floor Coverings Food Concessions/Truck Food Pantry Food Wholesale Manufacturer Funeral Services/Cremation Services Garage Door Sales/Service Gift Shops/Collectibles Glass/Window Tinting Golf Communities & Country Clubs Gov - State of Florida Gov-City Of Brooksville Gov-Hernando Co. School District Gov-Hernando County Graphic Arts/Design Grocery Stores Health Care - Services & Supplies Hearing Aids & Assistive Devices Holistic Practitioners Home Builders Home Health Services Home Inspection Service Hospitals Hotels/Motels Ice Cream & Frozen Desserts Independent Living Facility Insurance - General Insurance-Health Insurance-Life Interior Landscaping / Plantscaping Investments/Financial Planning Janitorial Services/Supplies Laboratories- Medical Landscape - Stone/Rock & Pavers Landscaping - General Laundromats Lawn Maintenance - General Legal Services Locksmiths Manufacturers - Medical, Promotional, & Identification Products Manufacturers - Signs and Indentification Products Marinas - Storage/Services Marketing Programs Massage Therapy Mattress Store Medical Clinics Medical Spa Merchant Services Mobile Home Parks Mortgage Loan Companies Newspapers Nurseries - Plants/Trees/Etc. Office Cleaning Service Optometrists Painting Contractors Payroll Personal Trainer Pest Control Pet Grooming Pet Stores/Supplies Pharmacy Photography Physical Therapy Physicians - Family Practice Physicians - Gynecology & Obstetrics Physicians - Ophthalmology Physicians - Orthopedics Physicians - Pediatrics Physicians - Surgeons Plumbing - General Plumbing Contractors Portable Toilets Print Shop Publishers Radio Stations Real Estate - Appraisal Services Real Estate - Property Management Real Estate Development Real Estate Investments Real Estate Rentals Real Estate Sales - General Recreation Facilities Rehabilitation Hospitals Rehabilitation Services Restaurants Restaurants & Lounges Restoration Retail Sales Retirement Centers Roofing Contractors RV Resort Salon/Spa Schools - Private/Parochial Schools, Public School-Vocational Security Systems Shipping Service Shopping Centers Signs - Full Service Sinkhole/Foundation Repair Skin Care Specialist Sod & Sodding Services Software Development-Custom Special Events Storage Substance Abuse Treatment Program Surgery Center Surveyors, Land Tattoo Parlor Tax Preparation Telecommunications/Telephone Equip.Sales&Service Thrift Stores Tile & Grout Cleaning Tile Distributors/Contractors Title Companies Tourism Development Trade Associations Travel Agency Tree Farm Tree Service Utility, Natural Gas Veterinary Clinics Wealth Management Website Design Weight Management Wireless Communications & Sales Youth Organizations & Centers go 0-9 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Advertising & Media Signs - Full Service, Advertising & Media, Graphic Arts/Design, Print Shop, More... Agriculture, Fishing & Forestry Fencing, Agriculture, Crushed Stone Arts, Culture & Entertainment Entertainment, Photography Automotive & Marine Automotive - Dealers , Automotive - Repair/Collision, Automotive - Transmissions, Marinas - Storage/Services Business & Professional Services Business Consulting/Coaching, Chambers Of Commerce, Consultants, Business Brokers, More... Computers & Telecommunications Telecommunications/Telephone Equip.Sales&Service, Computer & Network Consultant, Cyber Security, Cellular Phones, More... Construction Equipment & Contractors Home Builders, Contractors - General, Roofing Contractors, Plumbing Contractors, More... Family, Community & Civic Organizations Community Organization, Civic Organization, Charitable Organizations/Social Services, Business Organization, More... Finance & Insurance Insurance - General, Banks, Accountants/CPA's/Bookkeeping, Insurance-Health, More... Government, Education & Individuals Gov-Hernando County, Colleges/Universities, Schools, Public, School-Vocational, More... Health Care Home Health Services, Dentists - General, Health Care - Services & Supplies, Hospitals, More... Home & Garden Tree Service, Pest Control, Sinkhole/Foundation Repair, Plumbing - General, More... Legal Attorneys - General, Legal Services, Attorneys - Estate/Disability Lodging & Travel Hotels/Motels, Tourism Development, Travel Agency Manufacturing, Production & Wholesale Manufacturers - Signs and Indentification Products, Food Wholesale Manufacturer, Manufacturers - Medical, Promotional, & Identification Products Personal Services & Care Funeral Services/Cremation Services, Assisted Living Facilities, Crematories, Beauty Salon & Barber Shops, More... Pets & Veterinary Veterinary Clinics, Pet Stores/Supplies, Pet Grooming, Animal Shelter/Rescue Public Utilities & Environment Air Condition/Heating Contractors, Electrical Contractor, Electric Service & Supply, Surveyors, Land, More... Real Estate, Moving & Storage Real Estate Sales - General, Apartment Rentals, Real Estate Development, Storage, More... Religious Organizations Churches/Synagogues Restaurants, Food & Beverages Restaurants, Restaurants & Lounges, Catering Service, Banquet Facilities, More... Shopping & Specialty Retail Retail Sales, Thrift Stores, Appliance Sales-Repair & Service, Wireless Communications & Sales, More... Sports & Recreation Golf Communities & Country Clubs, Fitness Center, Recreation Facilities, Personal Trainer, More... Transportation Airport FBO Business Directory Events Calendar Hot Deals Member To Member Deals Job Postings Contact Us © 2025 Greater Hernando County Chamber of Commerce | Site by GrowthZone Get In Touch! 352-796-0697 15588 Aviation Loop Dr., Brooksville, FL 34604 info@hernandochamber.com Additional Resources Advocacy Pillar Networking Pillar Marketing Pillar Training Pillar Membership Code of Conduct Chamber Brand Usage Guidelines for Members Stay Connected! © Greater Hernando County Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    }
  ]
}