{
  "fuentes": [
    {
      "url": "https://www.pnj.com/story/news/2016/04/24/uwf-students-brew-up-tasty-craft-beers/83399388/",
      "email": "tstmyer@pnj.com"
    },
    {
      "url": "https://www.perfectgame.org/Tournaments/",
      "email": "pgcrosschecker@perfectgame.org"
    },
    {
      "url": "https://www.perfectgame.org/Tournaments/",
      "email": "jamidon@perfectgame.org"
    },
    {
      "url": "https://www.perfectgame.org/Tournaments/",
      "email": "kevin@perfectgame.org"
    },
    {
      "url": "https://goatagency.com/contact-us/",
      "email": "careers@goatagency.com"
    },
    {
      "url": "https://goatagency.com/contact-us/",
      "email": "joanna.hughston@goatagency.com"
    },
    {
      "url": "https://goatagency.com/contact-us/",
      "email": "jointheherd@goatagency.com"
    },
    {
      "url": "https://teamboard.cloud/",
      "email": "atlassian@devsamurai.com"
    },
    {
      "url": "https://research.contrary.com/company/goat",
      "email": "research@contrary.com"
    }
  ],
  "mails": [
    "atlassian@devsamurai.com",
    "careers@goatagency.com",
    "jamidon@perfectgame.org",
    "joanna.hughston@goatagency.com",
    "jointheherd@goatagency.com",
    "kevin@perfectgame.org",
    "pgcrosschecker@perfectgame.org",
    "research@contrary.com",
    "tstmyer@pnj.com"
  ],
  "nombre_sitio": "goatlips.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pnj.com/story/news/2016/04/24/uwf-students-brew-up-tasty-craft-beers/83399388/",
      "text": "UWF students brew up tasty craft beers News Sports Play Opinion Advertise Obituaries eNewspaper Legals NEWS UWF students brew up tasty craft beers Thomas St. Myer tstmyer@pnj.com Brewing beer never really appealed to Allison Lehr before, but when the University of West Florida Kugelman Honors Program offered the Art and Science of Brewing as a general elective for the spring semester, she decided to enroll in the class. Turns out, Lehr is a natural at brewing tasty craft beer. The Art and Science of Brewing class hosted a taste-testing event Wednesday at Alumni Relations Building 12 in which a few faculty and alumni judged the beers brewed by eight bright-minded students. Lehr impressed the judges with what she described in her presentation as a Belgian Dubbel brewed with butterscotch and a touch of magic. Her “I can’t believe it’s not butterbeer” won the competition and secured a future spot on the Goat Lips Chew and Brewhouse menu. Moon: Upset about new $20? Send them my way Redneck Riviera Brewing operates out of Goat Lips, and co-founder Tim Roberts and his brother, Rob Roberts, agreed to let the winner of the competition brew her concoction at the brewhouse. Tim Roberts said, “I can’t believe it’s not butterbeer” will probably be on the Goat Lips menu by late summer, early fall. An overseas trip last summer in which Lehr toured Belgian breweries and an obsession with Harry Potter inspired her to create her winning craft beer. The UWF junior described the butterbeer drink sold in the Harry Potter section at Universal Studios as too sweet for her taste buds. Lehr used caramelized sugar along with Belgian malt, Munich steeping grains, English type malts and high gravity Belgian yeast strains for a medium bitterness. A hint of chocolate, caramel and nut flavors resonate in a beer with 6 to 7.6 percent alcohol by volume. “It’s a lot more involved than you would normally think,” said Lehr, who swims on the UWF team. “It’s hard to imagine all that goes into making a bottle of beer.” Professor Joe Moss incorporated elements of biology, chemistry, history and business into the once-a-week-course. UWF offered the honors course once previously in the spring of 2014. Dr. Gregory Lanier, director of Kugelman Honors Program, said he considers the Art and Science of Brewing to be one of their best honors general electives, citing how students apply what they learn and market their product. The honors program rotates its general electives, and Lanier said the course will probably return in the spring of 2018. The only requirement is the honors students be 21 years old to take the class. Celebrating change spurred by sit-in, 55 years later Senior Lauren Cabrera described the course as challenging and time-consuming, but one of their favorites, too. Moss said the students fill the room with a contagious energy each Wednesday. “It’s awesome,” he said. “They’re always on time and with a smile on their face.” The eight students, and the judges for that matter, smiled throughout the taste-testing event Wednesday as they tried a variety of beers and ate snacks such as pretzels and popcorn. The academic component of the class shown through in PowerPoint presentations. Each of the students explained the historical significance in the name and label design they selected for their product and shared what ingredients they used and measurable figures, such as alcohol content level, in their beers. Senior Meagan Adams named her oatmeal stout beer King’s Breakfast and put a picture of King George III on the label. Adams lived in England for four years when the Air Force stationed her mother at Royal Air Force Mildenhall in Suffolk, and she shared her British expertise with a playful story on why oatmeal stout dates back to the Revolutionary War. Adams said the English ate porridge for its health benefits, and a stressed-out but health conscious King George III drank oatmeal stout in the morning to relieve the stress he felt from losing the war and being the father of 15 children. “I don’t know if King George III drank beer, but I know I would if I had 15 kids,” a smiling Adams said after her presentation. Adams said she and one of her classmates discussed the possibility of home brewing beers this summer. Lehr will spend her summer brewing “I can’t believe it’s not butterbeer” at Goat Lips. She brewed 42 bottles for the class, but she said only one remained after the Wednesday taste-test event. Lehr held off on saying she found her calling in the brewing industry, but home brewing in the future interests her, too. “I’m trying to convince my dad it would be a good family activity,” she said. “I think he could be convinced.\" About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://www.perfectgame.org/Tournaments/",
      "text": "Baseball Tournaments | Perfect Game USA SPEND MORE. SAVE MORE. $25 off each tournament between 3-4 registrations $50 off each tournament 5 or more *Cart and Event pages disclose if tournament is valid. Offer ends Feb. 1st. Find your tournaments and save now! THE WORLD'S LARGEST AND MOST COMPREHENSIVE SCOUTING ORGANIZATION | 2,370 MLB PLAYERS | 15,787 MLB DRAFT SELECTIONS 2,370 MLB PLAYERS | 15,787 MLB DRAFT SELECTIONS Sign in Create Account Sign in User Email Valid email format only Password Forgot password? Not a member yet? Create Account Players Teams Events Sign in Create Account EVENTS Event Types PG Schedule Showcases (HS) Prospect Gateway (13/14U) Tournaments PG Series Girls' Softball Leagues Youth Tournaments International Select Fest ID Camps Special Events PG All-American Classic 14U | 13U | 12U | 11U Showcases (HS) Are you looking to get noticed by college coaches? Then you need to attend a Perfect Game Showcase! PG Showcases garner national exposure, social media visibility, and the opportunity to improve your player rankings. Learn More Prospect Gateway (13/14U) The Perfect Game Prospect Gateway focuses on providing world class exposure for young prospects while adding new developmental tips that will help each player improve their skill set now and in the future. Not only will players receive an evaluation from PG Scouts that include metrics, grades, rankings and more, but young prospects will now have the opportunity to receive a detailed report for areas of improvement from a dedicated PG Advisor. Learn More Featured 2025 PG Events by Region 2025 WWBA World Championship 2025 PG Fall World Series 2025 Fall National Championship Protected by G-Form 2025 PG Champions Cup 2025 WWBA Jupiter Qualifiers 2025 PG/Dynamic College Series 2026 PG Best of the Best Invitational 2026 PG National World Series 2026 PG Gulf Coast World Series 2026 PG Super Regional NIT 2025 All-State Games 2025 National All-State Select Championships 2025 PG x MVP International Events SHOWCASES Baseball Showcases Showcases (HS) Prospect Gateway (13/14U) PG by State SOFTBALL RANKINGS Player Rankings HS Class of 2026 HS Class of 2027 HS Class of 2028 HS Class of 2029 HS Class of 2030 HS State Rankings Rankings Portal DRAFT BOARD Final 2025 MLB Draft Board: Top 500 7/9/2025 2025 MLB Draft Board: Top 500 5/28/2025 2026 MLB Draft: College Top 150 4/24/2025 MLB Draft Board Update: Top 400 3/21/2025 Top 100 Collegiate Juniors 1/10/2025 Team Rankings High School Top 50 Travel Team Rankings 18U National | Regional 17U National | Regional 16U National | Regional 15U National | Regional 14U National | Regional 13U National | Regional 12U National | Regional 11U National | Regional 10U National | Regional 9U National | Regional College Rankings 2024 Preview Index Division I Top 25 Division II Top 25 Division III Top 25 NAIA Top 25 JUCO Top 25 Recruiting Class Rankings Softball Player Rankings Player Rankings Top Ranked Players 2026 - Grady Emerson 2027 - Chase Fuller 2028 - Dexter McCleon Jr 2029 - Tre' Lawrence PG Rawlings Preseason All American Preseason All American Preseason Underclass All American Top Ranked Teams Division I - Tennessee HS - Corona HS (CA) 17U - East Cobb Astros 17U 16U - Canes National 16U STATS RECRUITING Recruiting Menu Advanced Search College Commitments College Interests College Portal College Recruiting Help Uncommitted Prospects Recruiting Class Rankings Recommend a Prospect Event Results Showcase Results Tournament Results Top Event Performers All-Time Event Records CONTENT PG EVENT CONTENT Showcase Articles Tournament Articles PG Player Features All Articles HIGH SCHOOL CONTENT High School Portal Top 50 HS Teams 2023 Preview Content Scout Blogs Preseason All-Americans Preseason Underclass All-Americans All HS Content MLB DRAFT CONTENT Draft Portal PG Draft Pick Database All Draft Content COLLEGE CONTENT College Portal 2025 Preview Content College Top 25 College Player Reports College Recruiting Help All College Content RECENT ARTICLES View Recent ALUMNI PG Alumni MLB Players Drafted Players College Commitments PG by State MLB Player of the Day Sep 08, 25 Garrett Crochet Red Sox 7 IP, 3 H, 0 ER, 10 K NOTABLE MLB PLAYERS Bryce Harper Christian Yelich Javier Baez Gerrit Cole Manny Machado Carlos Correa Mike Trout Nolan Arenado Cody Bellinger Francisco Lindor Alex Bregman Freddie Freeman PG.TV ARM CARE ABOUT About Perfect Game About PG Testimonials Job Opportunities Contacts FAQ Background Check Policy PG SHOP PG SHOP PG TEAM SALES PG TEAM SALES Loading... TOURNAMENTS TOURNAMENT SCHEDULE TOURNAMENT RESULTS Player Age Calculator TRAVEL TEAM RANKINGS Team Registration CREATE PLAYER PROFILE Perfect Game Tournaments provide the ultimate experience for travel ball teams around the nation. From top facilities, live play-by-play for each games, and the highest level of competition, PG strives to deliver as much value as possible for teams of all skill levels and age divisions. Team Search DIAMONDKAST - FOLLOW THE ACTION LIVE STATS AND PLAY BY PLAY DiamondKast is the official scoring app of Perfect Game and used for all PGBA Red and White events. Subscribers can follow every game of the tournament with live pitch-by-pitch updates, statistics, and box scores. SUBSCRIPTION OPTIONS DIAMONDKAST EVENTS TOURNAMENTS 17u Tourney All-American Team Midwest Labor Day Scout Notes Area Codes Recap East Labor Day Classic Scout Notes PG Midwest Labor Day Scout Notes UC Area Codes Highlights: Part 4 UC Area Codes Highlights: Part 3 UC Area Codes Highlights: Part 2 UC Areas Code Highlights: Part 1 South World Series Notes: Days 3-5 Battle for the Midwest Notes: Part 2 Puerto Rico Scout Team Takes 17u BCS UBC Midwest X Atlantic Scout Notes BEAST 2027 Win 16u Dynamic College Series PG West World Series Notes: Days 3-5 Battle of the Midwest Scout Notes TOURNAMENT ARTICLES ALL ARTICLES PERFECT GAME BASEBALL ASSOCIATION GET MORE OUT OF YOUR SUMMER BASEBALL SEASON The Perfect Game Baseball Association is dedicated to promoting and protecting the game of baseball at all age levels. This is accomplished by enforcing higher standards on tournament directors, identifying the best tournaments worthy of affiliation, and providing a quality experience to all players, coaches, and parents. ORG/TEAM SEARCH TRAVEL TEAM RANKINGS TOP RANKED TEAM IN EACH AGE DIVISION 18U USA Prime Scout Team DG29 Baseball Academy 9u Black 17U CBA Victus 16U USA Prime 16U National 15U USA Prime 15U National 14U ZT National Prospects 14u 13U ZT National Prospects 12U SBA Los Rayos 12u 11U MVP HUSTLE CASILLAS 10U MVP/Hustle-Casillas TOURNAMENTS FAQ What is difference between WWBA and BCS? The WWBA is PG’s wood bat division. The BCS is PG’s metal bat division. Is there a coaches check-in/meeting prior to tournament? No, PG does not have coaches check-in/meeting prior to tournament. They will receive their coaches packet at their first game. Is there a player check-in prior to the tournament? PG does not have any player check-in for tournaments. Is there a player check-in prior to the tournament? PG does not have any player check-in for tournaments. Are teams required to have birth certificates for each player? PG doesn’t require any proof of age unless a team protests a game due to an illegal player. When will games start? Games of all tournaments will begin with 9AM games on the first date listed on a tournament unless otherwise noted. How do I get my roster listed online? The team contact will receive an emailed link to click on to update the roster online. What is the tournament format? Each tournament will have a different format, depending on how many teams and how many games will be played. It will be noted on the specific tournament page prior to the event. How do I get into the WWBA World Championship in Jupiter? The WWBA World Championship, which is held annually in Jupiter, FL in late October is a strict invite-only event. It is our oldest and most prestigious event we run. It is limited to 85 teams, with well over 200 wanting in. There are 7 spots for Qualifier winners. The only way to get a new team into this event that doesn’t win a Qualifier is if a team drops out, which doesn’t happen very often. How are invitations processed for the 16u and 17u WWBA Championships? For the 16u & 17u WWBA, the orders of invitations go as follows: 1. Teams that want to return to the 17u WWBA that participated in the event last year. 2. Teams that finished well in last year's 16u WWBA. 3. New teams that have requested invitations online. My player information for a tournament is not correct, how do I fix it? Perfect Game does not enter this data, please see your coach first to correct it. If that does not work, send an email including your player name, graduation year, city, state, player ID, the email you use to login, and corrections needed to one of the Tournament Management Assistants listed on the contact page. I am having trouble signing the Participant and Media Releases. How do I do this? 1. Sign into your account on www.perfectgame.org . If you do not have an account, please create one by clicking \"Create Account\" in the upper right corner. 2. Click My Account. On the \"My Account\" page, click the red Associate Player to your account button, or click here. Fill out the form. 3. Once the association request is approved, you will receive an email notifying you that it has been approved. Sign into your account on the Perfect Game website and there will be a red notification box with two links to sign the releases. If your player does not appear in a search, it is because your player has not yet attended a Perfect Game event, their coach has not rostered them for an event, or they have not been approved on a roster yet. If you have questions related to signing the Participant & Media releases, please contact PGCrossChecker@perfectgame.org. Who to contact if you need further help with tournaments? For questions related to tournaments, please email kevin@perfectgame.org or jamidon@perfectgame.org. What age division is my player eligible for? Find Player's Season age Player DOB Month January February March April May June July August September October November December Day 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Year 2026 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010 2009 2008 2007 2006 2005 2004 2003 Event Season Year e.g. 2026 season = events between 8/15/2025 and 8/14/2026 Season Year 2026 2027 Sport Type Baseball Softball Please select a birth month Please select a birth day Please select a birth month Please select a season year Please select a player's grade Please select a sport type PG Special Events Perfect Game All-American Classic 11u-14u PG Select Baseball Festivals Perfect Game Collegiate Baseball League Travel, Lodging, Entertainment EventConnect Gulf Shores/Orange Beach Car Rental for PG Events PG Partners UmpNation SkillShow Online Video DiamondKast Florida Sports Foundation Recommended PG Pro Shop High School Baseball Web DiamondKast Preseason All-Americans Preseason Underclass All Americans Minor League Baseball MLB Pitch, Hit & Run Cedar Rapids Kernels About Perfect Game :: Contact us :: Terms of Use :: Privacy Policy :: Testimonials :: Job Opportunities Privacy Manager Copyright 1994- 2025 by Perfect Game. All rights reserved. No portion of this information may be reprinted or reproduced without the written consent of Perfect Game."
    },
    {
      "url": "https://goatagency.com/contact-us/",
      "text": "Chat with Goat: Grow with Social-First Influencer Marketing Close It looks like you're using an outdated browser. Please upgrade your browser for\n    the best experience. Skip to content Menu About Services Work Data Insights People Contact Close About Services Work Data Insights People Contact Sign up to our newsletter -> LET'S GET GOING. You know there's no one greater... Work with us Careers at Goat [email protected] Journalist Enquiries [email protected] Visit us Our Head Quarters North America The Goat Agency 3 World Trade Center 175 Greenwich Street New York, NY 10007 Europe The Goat Agency Rose Court 2 Southwark Bridge Road London, SE1 9HS Let’s work together Follow us Instagram LinkedIn Substack TikTok YouTube About Services Work Data Insights People FAQ Privacy Policy Contact Subscribe to our weekly newsletter -> USA 3 World Trade Center, 175 Greenwich Street New York, NY 10007 UK Rose Court 2 Southwark Bridge Road London SE1 9HS Legals Site by\n            KOTA Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://teamboard.cloud/",
      "text": "Project Management, Resouce Planning and Gantt Chart for Jira Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now Manage Work, Resources, and Time for Every Team in Jira Your One-Stop Solution for Project Management, Resource Planning, WBS Gantt Charts, Time Tracking, and Timesheets Our Solutions Book a Demo Trusted by Teams from TeamBoard ProScheduler for Jira Project Management, Resource Planning, Gantt Chart for Jira Top-rated capacity planning solution for projects, programs, and portfolios. Project management, tempo, structure timeline, WBS Gantt chart & risk management for Jira. Resource Planning WBS Gantt Chart & Timeline Time Tracking & Workload Report & Dashboard Project Risk Management Unlock Project Efficiency → TeamBoard TimePlanner for Jira Resource Capacity, Time Tracking & Timesheets for Jira Resource Management, Team Management , Time Tracking, Timesheets, and Cost Tracking for Jira Profile Management Task Planning Team Collaboration Timelog, Timesheets Leave, Event Planning Invoicing, and Billable Hours Tracking Client Management Optimize Your Workflow → TeamBoard for monday.com Resource Planning and Time Tracking for monday.com Resource management, capacity planning, and reports for teams to visualize projects and time management. Resource Planning with ease Workload Distribution Time Tracking & Timesheets Get Started with Resource Planning → TeamBoard for Salesforce Project and Resource Management for Salesforce Manage work and Plan resources seamlessly, Track and Report for Salesforce Work Management Resource Planning Track & Report Manage Your Resources → TeamBoard Features Project management The project management feature helps managers in overseeing their projects effectively. Learn more → Resource Planning Resource Planning feature help managers in optimizing their workforce and asset allocation. Learn more → WBS Gantt Chart WBS Gantt Chart facilitating project visualization and timeline tracking for managers. Learn more → Time Tracking, TimeSheets Time Tracking, TimeSheets allow managers to monitor hours spent on tasks accurately. Learn more → Cost Management Cost Management enables managers to oversee and control project budgets efficiently. Learn more → Others Additional features such as leave and vacation management, risk management, detailed issue tables, workload distribution, comprehensive reporting, teamboard, scheduling,… Let Our Customers Speak for Us! TimePlanner manages the application costs and consumption of materials within the project Claudio Pirtraroia on Atlassian Marketplace After a long search, found a right one shop tool that gives me insights on Workload, What is being allocated and time spent. Jacob Rajesh on Atlassian Marketplace Lovely app and great customer service. This app is very useful for us to plan resource and tasks for projects and portfolios. Look forward to the completed Gantt features and project budget management as you guys promised. Highly recommend. Hakan Eriksson on Atlassian Marketplace Beautiful app! fancy scheduler and modern UIUX, I strongly recommend this over other expensive legacy timesheets apps. Brian Ng on Atlassian Marketplace The app looks promising I have just installed it today and starting to discover it’s features. One thing I couldn’t find a way around is cancelling an Approved Vacation or changing it’s period range, it will be awesome if such option is available. Badry Hassan on Atlassian Marketplace I am using this app daily to manage my team and very satisfied with its capabilities. Support guys are very nice and normally response instantly. Keep up a good work the Samurais! Nathan Carter on Atlassian Marketplace Integrates with Multiple Platforms Integrates seamlessly with Atlassian , monday.com , and Salesforce environments and offers a centralized platform for managing tasks, projects, and resources effectively. Explore all TeamBoard Solutions Blog Posts All , Project Management 29 Aug at 6:41 am AML Case Management Tool for Your Project Management Needs All , Project Management 28 Aug at 12:03 am 7 Task Project Management Warning Signs To Watch For Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    },
    {
      "url": "https://research.contrary.com/company/goat",
      "text": "Report: GOAT Business Breakdown & Founding Story | Contrary Research Companies Deep Dives Foundations & Frontiers Tech Trends Report Conversations About Overview Memo Authors 1 Resources 6 Similar Companies 7 Share GOAT Ecommerce Marketplaces Digital marketplaces are reshaping retail by pushing the luxury fashion industry into online sales. This is a trend that only grew during the COVID-19 pandemic. Related to this, streetwear is increasingly becoming a big part of mainstream fashion, merging high-end labels with youth culture. GOAT Group is a holding company that house 4 luxury fashion platforms — GOAT, alias, Flight Club, and Grailed — for primary and secondary sales of sneakers, streetwear, apparel, and accessories online and offline through peer-to-peer and consignment-based marketplaces. Tags Ecommerce Marketplaces Founding Date Aug 1, 2010 Headquarters Los Angeles, California Total Funding $493M Status Private Stage Series F Employees 1015 Careers at GOAT Updated May 25, 2023 Reading Time 16 min Memo Thesis Founding Story Product Market Competition Business Model Traction Valuation Key Opportunities Key Risks Summary Authors Authors Tomas Gesino Fellow See articles Memo Updated May 25, 2023 Reading Time 16 min Thesis Digital marketplaces are reshaping retail by pushing the luxury fashion industry into online sales. This is a trend that only grew during the COVID-19 pandemic. Online sales of luxury goods, such as apparel, footwear, accessories, jewelry, watches, leather goods, beauty products, and perfumes have increased 5x since 2009 to account for 8% of the global luxury market by 2018. At the same time, younger consumers are increasing their fashion expenditure and investing in distinctive, high-end streetwear . Additionally, sustainability is becoming an increasingly common consumer preference with the expanding movement toward a circular economy . A 2023 survey found 42% of consumers think secondhand shopping has become more accessible. 30% of Gen Z would choose secondhand to afford higher-end brands. Related to this, streetwear is increasingly becoming a big part of mainstream fashion, merging high-end labels with youth culture. Celebrity influence, social media, and a desire for exclusivity and authenticity are contributing factors to its growth. By 2030, the resale market for authenticated sneakers and streetwear is expected to reach $30 billion . However, the sector's growth introduces a significant issue: counterfeits, posing a substantial challenge for consumers and brands. The growth in counterfeit has led to suits from luxury brands such as Louis Vuitton and Nike to reselling platforms such as eBay and StockX. GOAT Group is a holding company that houses 4 luxury fashion platforms — GOAT, alias, Flight Club, and Grailed — for primary and secondary sales of sneakers, streetwear, apparel, and accessories online and offline through peer-to-peer and consignment-based marketplaces. Weekly Newsletter Subscribe to the Research Rundown Founding Story GOAT was founded in Los Angeles, California, by Eddy Lu (co-founder and CEO) and Daishin Sugano (co-founder and Chief Brand Officer) in 2015 . Lu, a computer science graduate from the University of California Berkeley, started his career at Deloitte as a consultant and later joined Lehman Brothers and worked in equity research. Sugano, who completed his master's and bachelor's degrees at the University of Southern California, embarked on his entrepreneurial journey alongside Lu during their college years. Both grew up in LA and launched several ventures before GOAT, including an import/export business , a golf apparel company , an online tea business , and multiple mobile apps. In 2008 , amidst a financial crisis, the two entrepreneurs visited a Beard Papa's restaurant in Los Angeles and liked the cream puffs they purchased there. Seeking \"passive income\", they decided to franchise the Japanese chain. Unfortunately, due to the economic downturn, they could not hire managers. In 2010 , Lu and Sugano moved to Chicago to expand upon Beard Papa's presence. Meeting new people in this new city proved challenging, which led the duo to create GrubWithUs, an app that facilitated socializing by enabling users to arrange meals with strangers. GrubWithUs was accepted into Y Combinator's 2011 batch and raised a $5 million round in 2012 . However, GrubWithUs failed to gain much traction. Sugano has been a passionate sneaker and basketball fan since the age of 10 when his dad gifted him a pair of Air Jordan 5 Grapes. This iconic shoe was re-released in 2013 — 23 years after its debut — honoring Michael Jordan's jersey number. When Sugano told Lu he was displeased with the lack of authentication in the online sneaker market for purchasing such shoes, Lu was struck by the potential for a brand that would combat fraud between vendors and customers. Sugano stated that: “I did my due diligence and came up with nobody. From that point on, we decided that this is something we could solve”. In July 2015 , GOAT was launched. In November 2015, after four months in operation, the company offered a Black Friday discount on the most popular products of the year, selling them at retail prices. Over 100K users installed the app to take advantage of the sale, resulting in repeated crashes and representing an inflection point in the company’s growth. Product GOAT Group operates four distinct products, including GOAT, its original consignment-based resale platform. Users submit their items to GOAT for authentication, and once approved and sold, GOAT sends the item to the buyer. The company also owns Grailed, a peer-to-peer resale marketplace for streetwear and luxury wear. With this marketplace, GOAT's team digitally authenticates the listed items. In addition, GOAT Group merged with Flight Club in February 2018 . Their fourth offering, alias , is a unified platform for selling products like sneakers, apparel, and accessories, providing sellers with insight into pricing and other key metrics. GOAT GOAT, launched in 2015 , facilitates the trading of authentic new and used sneakers, luxury apparel, and accessories. The platform has a collection of over 320K items as of May 2023; GOAT’s marketplace features multiple popular brands like Air Jordan, Supreme, Gucci, and Saint Laurent. GOAT is built around a consignment model, where sellers ship their items to the nearest GOAT fulfillment center for authentication and sale. GOAT's authentication procedure is a two-step screening process, initially using machine learning for digital authentication, followed by a physical inspection at their fulfillment centers. GOAT collaborates with more than 350 high-fashion brands, including Gucci , Balenciaga , and Alexander McQueen , offering their products directly on the platform. GOAT has created a new editorial publication called Greatest to emphasize its commitment to community building. The magazine is a 150+ page publication on the stories of the creatives wearing the clothes, or as Sen Sugano, VP of Marketing at GOAT Group, says : “With Greatest, we wanted to capture the industry's sense of community, while bringing together the spectrum of people who are inspired by sneakers” Source: GOAT Grailed Grailed, founded in 2013 and later acquired by GOAT Group in October 2022 , operates as a peer-to-peer marketplace for both menswear and womenswear. The platform, available on desktop and mobile, allows the easy direct sale of new and used clothing among users, backed by digital moderators, to ensure the authenticity of each listed item. It has smart pricing, allowing sellers to set a price reduction schedule that automatically lowers the price by 10% weekly until it reaches a predetermined floor price. With Grailed, users can follow their favorite brands, designers, and sellers. Aside from the regular categories such as brands, menswear, womenswear, sneakers, or collection, Grailed’s team curates their favorite listings. GOAT's and Grailed’s business models are different. GOAT is a consignment reseller: sellers send products to GOAT, which authenticates them and sends them to buyers. Grailed, on the other hand, is a peer-to-peer marketplace. Customers buy and sell their products directly to and from each other. Source: Grailed Flight Club Flight Club, founded in 2005 and later merged with GOAT in February 2018 , serves as GOAT's physical retail business unit. Specializing exclusively in sneakers, Flight Club allows app users to physically interact with items before purchasing them and sells its items through its website. Flight Club operates three stores in Miami , New York , and Los Angeles . Flight Club offers a broad range of sneakers from iconic brands such as Air Jordan , Nike , New Balance , and Yeezy alongside its line of branded apparel. Sellers can send in an online form to submit their sneakers for sale, after which they can be dropped off or shipped to a store. Once an item is sold, sellers can request payment through GOAT or Flight Club, providing flexibility and convenience. Source: GOAT Group alias \"alias\" is a mobile-only application tailored specifically for global resellers. It was conceived to give them access to critical data, drive informed decision-making, and expand their reach to over 30 million buyers in 170 countries on both GOAT and Flight Club. Sellers can create a new account specifically for use on alias, or link to their GOAT profile. Sellers undergo an approval process before they are permitted to list their items on alias. The app provides sellers with real-time data on the resale market not available on GOAT. This data is designed to help sellers optimize their earnings through strategic, data-driven decisions. One of the key data points provided by alias is its high demand indicator. This is a predictive pricing tool that leverages machine learning to anticipate an item's price based on market data, global demand, and buyer location. The “global indicator” feature shows the current lowest price of an item globally. The “lowest price” feature on alias allows sellers to view the current lowest price of a ship-to-verify item. Lastly, the “lowest consigned” tool shows the lowest price for consigned items, providing sellers with important pricing context for consigned goods. The data-driven tools provided by alias aims to position sellers to maximize their profits and succeed in the global resale market. Source: alias Market Customer GOAT Group caters to a global customer base comprising fashion-conscious consumers with a predilection for streetwear and sneakers. These consumers, primarily Millennials and Gen Z, prioritize sustainability and value access to luxury and exclusive items. With the advent of the fashion resale market, these items are no longer out of reach for many consumers who would otherwise be unable to access them. Before GOAT, sneakerheads would typically have to go to physical stores or risk getting scammed online by purchasing items on horizontal marketplaces like eBay. By offering authenticated, pre-owned luxury goods, GOAT has allowed customers to shop from anywhere globally, replacing the need to navigate physical consignment stores or unauthenticated online listings. Market Size The growing acceptance and demand for pre-owned luxury goods, led by younger generations, is disrupting traditional retail models and creating new opportunities for businesses in the digital space. The online shopper count is expected to surpass 2.6 billion people in 2023. In 2023, the sneaker resale market in North America alone stands at $2 billion and is expected to reach $30 billion by 2030, showcasing the growing demand for premium, pre-owned sneakers. The global luxury resale market in 2021 was valued at $32.6 billion and is expected to reach $51.8 billion by 2026. Competition The RealReal: The RealReal, founded in San Francisco in 2011 , is an online and physical retail marketplace specializing in authenticated, consigned luxury goods. The company focuses on fashion, fine jewelry, watches, home decor, and children’s clothing. In 2019 it became the first resale startup to go public on NASDAQ under the ticker $REAL. Although The RealReal and GOAT Group both concentrate on authenticating all items sold on their platforms, The RealReal's product range is broader, extending beyond sneakers and streetwear. As of May 2023, The RealReal is valued at $113 million , coming down from an all-time high of $2.5 billion in 2021. Stadium Goods: Stadium Goods, founded in 2015 , operates a marketplace for new and used sneakers and streetwear online and in its New York City store. Farfetch acquired it for $250 million in 2018. While it competes directly with Flight Club, its pricing model sets it apart from GOAT Group's platforms. Stadium Goods charges a flat fee of $2 per month per item listed, deducting this cost from the sale. eBay: eBay, founded in 1995 originally as a bidding site, is one of the longest-running online marketplaces, enabling consumer-to-consumer (C2C) and business-to-consumer (B2C) sales globally. While it operates in a wide array of categories beyond fashion unlike GOAT Group, it does retain a significant presence in the resale of sneakers and streetwear. In 2019, it sold 6 million sneakers and offered authentication for watches sold on the platform that exceeded $2K in value. In 2020 , it sought to bolster its position in the market by partnering with Sneaker Con as a third-party authenticator for shoes listed above $100. StockX: StockX, founded in 2015 , is a primarily sneaker-focused online marketplace and clothing reseller. Since its inception, it has raised $690 million in funding. By 2020, the company was generating $400 million in revenue. It raised $255 million in its Series E in 2021, led by Tiger Global, bringing its valuation to $3.8 billion . Like GOAT Group, StockX authenticates all items sold on its platform but utilizes a bid/ask marketplace model, contrasting with GOAT’s fee-price model. StockX also imposes higher selling fees, ranging from 10% to 8% , depending on the seller's sales volume. SoleSavy: SoleSavy, founded in 2018 , is a community designed to assist buyers in purchasing sneakers directly upon release, circumventing the higher prices of resale platforms. The challenge of buying at release is competition from bots and resellers, a problem that SoleSavy seeks to solve. Initially created as a Slack community for sneaker enthusiasts to strategize for new drops, by 2021, it had over 4K members in the US and Canada and was generating $1.5 million in annual recurring revenue. It has raised $14.5 million in funding. It operates as a membership-based community, offering a free tier with access to a marketplace that charges the lowest commissions ( 3% or $8 for trades). Its advanced tiers range from $11.99 to $33 per month. Business Model GOAT Group uses a percentage fee scheme across all its products. Both GOAT and alias have a commission fee that begins at 9.5% for new sellers and can increase to 25% , depending on their rating. Additionally, these platforms charge a fixed seller fee based on the user's location. Grailed charges a 9% fee on the listing when the item is sold. Flight Club also charges a 9.5% fee, but it imposes a flat $5 fee instead of a location-based seller fee. All GOAT Group entities benefit from their marketplace model, having no upfront stock costs. GOAT Group incurs maintenance costs from GOAT’s fulfillment centers for authenticity checks and real estate costs from Flight Club's retail locations. Traction As of May 2023, GOAT Group has a global community exceeding 50 million members across 170 countries. In 2021, GOAT Group disclosed its metrics, revealing over 700K sellers and over $2 billion in gross merchandise volume. GOAT lists over 320K items on its platform and has partnered with prestigious luxury brands such as Gucci , Balenciaga , and Alexander McQueen . In April 2022 , GOAT Group signed a $55 million deal to sponsor the French soccer team, Paris Saint-Germain, for their 2022/23 campaign; it has also partnered up to create an exclusive collection . In 2021, the company said it had over 13 fulfillment centers worldwide but would expand to four more by the end of that same year, betting on the European and Asian markets as it looks to expand operations. In 2021, StockX had $400 million in revenue and was valued at $3.8 billion (9.5x revenue) At the time, StockX was also generating $1.8 billion of gross merchandise value (GMV), which would represent a blended take rate of ~22% of StockX’s sales that turn into revenue. As a public company, The RealReal is trading at a $113 million market cap as of May 2023 (0.8x LTM revenue). GOAT had $2 billion of GMV in 2021. If we apply a similar take rate of 22%, we can assume the company had ~$396 million in revenue. At a $3.7 billion valuation, that would represent a similar 9.3x revenue multiple. There are at least two likely drivers in the disparity between the valuations of companies like StockX or GOAT, and that of The RealReal. First, 2021 valuations have been massively corrected (for example, Etsy, eBay, and Shopify saw their revenue multiples drop from 20-40x LTM revenue to 2-12x). Source: Koyfin Second, The RealReal’s revenue growth has dropped from 55% YoY in 2021 when the company was also trading at 8x revenue, to 16% LTM revenue growth as of May 2023. In a highly competitive market for high-priced commodities, such as these companies compete in, a precipitous decline in revenue growth can also drive a significant decline in valuation. Weekly Newsletter Subscribe to the Research Rundown Valuation The GOAT Group has raised around $500 million in funding. This total includes its Series F round of $195 million , disclosed in June 2021 , which led the company's valuation to go from $1.8 billion to $3.7 billion . Some of its investors include Y Combinator, Foot Locker (a traditional sportswear and footwear retailer), Accel, and Index Ventures. In comparison, as of May 2023, StockX has raised $690 million and was last valued at $3.8 billion in 2021. The RealReal, meanwhile, as of May 2023, trades on NASDAQ with a market cap of $113 million . Key Opportunities Authentication Innovation GOAT Group could explore innovative authentication methods, such as lidar scanning for phones equipped with the feature or blockchain technology for transparent traceability of an item's authenticity. While the company already employs AI to detect counterfeit shoes, further investments in AI tool development could enhance the detection of fraudulent activity on its various platforms. Expanding Beyond Luxury thredUP, a used clothing marketplace, forecasts that the secondhand clothing market will grow to $351 billion by 2027 . GOAT Group might consider expanding into a new platform for reselling regular, non-luxury items to diversify its product lineup and reach a broader online shopper demographic. Maintaining the high quality associated with its existing platform, GOAT Group could leverage its current fulfillment centers for quality control rather than authenticity. Global Expansion Another important opportunity for GOAT Group lies in expanding its presence internationally, for example in the European Union and especially in China. In 2019 China's athletic footwear market was valued at $9.5 billion. The rising wealth of China is driving luxury purchases, with projections indicating that China will account for 44% of the global luxury goods market by 2025 . Key Risks Luxury Goods Market GOAT Group operates within the luxury goods market, making it vulnerable to economic fluctuations. Luxury goods sales are acutely responsive to economic conditions, often contracting during financial downturns or periods of economic uncertainty. For instance, during the 2008 financial crisis, the luxury goods market lost 9% of its value. This contraction was mainly due to consumers' shift towards more conscious spending in response to wage stagnation and inflation. Counterfeit Threats Despite GOAT Group's investment in filtering out fake products from its platforms, the risk of knock-off items slipping through the cracks persists. This issue could make the company lose its reputation and customer trust, harming the brand. In a worst-case scenario, this could result in lawsuits from original manufacturers for selling counterfeit goods, further damaging the company's standing and leading to financial losses. Summary With its four significant entities — GOAT, alias, Flight Club, and Grailed — GOAT Group has carved out a prominent place in the luxury clothing market. These platforms aim to provide customers with high-quality and authenticated streetwear and sneakers. Growth in demand for such products during and subsequent to the COVID-19 pandemic has enabled GOAT Group to expand into new markets and products. However, as market valuations adjust and consumers potentially tighten their spending, GOAT Group will likely face challenges. The founding team has experienced navigating economic downturns, which may prove useful in navigating these challenges. Important Disclosures This material has been distributed solely for informational and educational purposes only and is not a solicitation or an offer to buy any security or to participate in any trading strategy. All material presented is compiled from sources believed to be reliable, but accuracy, adequacy, or completeness cannot be guaranteed, and Contrary LLC (Contrary LLC, together with its affiliates, “Contrary”) makes no representation as to its accuracy, adequacy, or completeness. The information herein is based on Contrary beliefs, as well as certain assumptions regarding future events based on information available to Contrary on a formal and informal basis as of the date of this publication. The material may include projections or other forward-looking statements regarding future events, targets or expectations. Past performance of a company is no guarantee of future results. There is no guarantee that any opinions, forecasts, projections, risk assumptions, or commentary discussed herein will be realized. Actual experience may not reflect all of these opinions, forecasts, projections, risk assumptions, or commentary. Contrary shall have no responsibility for: (i) determining that any opinions, forecasts, projections, risk assumptions, or commentary discussed herein is suitable for any particular reader; (ii) monitoring whether any opinions, forecasts, projections, risk assumptions, or commentary discussed herein continues to be suitable for any reader; or (iii) tailoring any opinions, forecasts, projections, risk assumptions, or commentary discussed herein to any particular reader’s objectives, guidelines, or restrictions. Receipt of this material does not, by itself, imply that Contrary has an advisory agreement, oral or otherwise, with any reader. Contrary is registered with the Securities and Exchange Commission as an investment adviser under the Investment Advisers Act of 1940. The registration of Contrary in no way implies a certain level of skill or expertise or that the SEC has endorsed Contrary. Investment decisions for Contrary clients are made by Contrary. Please note that, although Contrary manages assets on behalf of Contrary clients, Contrary clients may take any position (whether positive or negative) with respect to the company described in this material. The information provided in this material does not represent any investment strategy that Contrary manages on behalf of, or recommends to, its clients. Different types of investments involve varying degrees of risk, and there can be no assurance that the future performance of any specific investment, investment strategy, company or product made reference to directly or indirectly in this material, will be profitable, equal any corresponding indicated performance level(s), or be suitable for your portfolio. Due to rapidly changing market conditions and the complexity of investment decisions, supplemental information and other sources may be required to make informed investment decisions based on your individual investment objectives and suitability specifications. All expressions of opinions are subject to change without notice. Investors should seek financial advice regarding the appropriateness of investing in any security of the company discussed in this presentation. Please see www.contrary.com/legal for additional important information. Authors Authors Tomas Gesino Fellow See articles Have a question? Have a different take on our research? Want to contribute to this piece? Send our research team a note. Resources Title GOAT – The “Greatest of All Time” Marketplace for Sneakerheads How fake Air Jordans turned these L.A. pals’ sneakerhead dream into a powerhouse platform Goat CEO: Company has seen growth during the pandemic, Jordan sneakers among most popular These two college buddies quit their jobs on the same day, and eleven years later they’ve raised $100 million to rule the ‘sneakerhead’ market How Does GOAT Make Money? Business Model Of GOAT GOAT: The Journey of a Sneaker-head Similar Companies Faire Ecommerce Marketplaces Glossier Ecommerce Whatnot Consumer Social Ecommerce Klarna Ecommerce Fintech StockX Ecommerce Marketplaces SHEIN Ecommerce SeatGeek Marketplaces Powered by Discover Companies Deep Dives Foundations & Frontiers Tech Trends Report Conversations Fellowship About Connect Email LinkedIn Twitter Subscribe Powered by © 2025 Contrary Research · All rights reserved Privacy Policy By navigating this website you agree to our privacy policy . Deny Accept"
    }
  ]
}