{
  "fuentes": [
    {
      "url": "https://www.gobrightline.com/offers/large-groups",
      "email": "rbustamante@mears.com"
    },
    {
      "url": "https://www.gobrightline.com/offers/large-groups",
      "email": "u003erbustamante@mears.com"
    },
    {
      "url": "https://www.budget.com/en/locations/us/fl/boca-raton/brbct",
      "email": "budget-coupon_icon-white@2x.png"
    },
    {
      "url": "https://www.budget.com/en/locations/us/fl/boca-raton/brbct",
      "email": "featuredimage@2x.png"
    },
    {
      "url": "https://www.budget.com/en/locations/us/fl/boca-raton/brbct",
      "email": "profile@2x.png"
    },
    {
      "url": "https://www.budget.com/en/locations/us/fl/boca-raton/brbct",
      "email": "custserv@budget.com"
    },
    {
      "url": "https://www.brightlinewest.com/about-us/executive-team",
      "email": "outreach@brightlinewest.com"
    },
    {
      "url": "https://www.brightlinewest.com/about-us/executive-team",
      "email": "press@brightlinewest.com"
    },
    {
      "url": "https://www.brightlinewest.com/about-us/executive-team",
      "email": "outreach@brightlinewest.com"
    },
    {
      "url": "https://www.brightlinewest.com/about-us/executive-team",
      "email": "press@brightlinewest.com"
    },
    {
      "url": "https://www.pearlantonacci.com/blog/boca-raton-brightline-station-explore-the-vibrant-and-high-speed-future/",
      "email": "marker--hover--listing-stack@2x.png"
    },
    {
      "url": "https://www.pearlantonacci.com/blog/boca-raton-brightline-station-explore-the-vibrant-and-high-speed-future/",
      "email": "marker--listing-stack@2x.png"
    },
    {
      "url": "https://www.gobrightline.com/press-room/2024/brightline-announces-station-expansion-for-downtown-stuart-and-martin-county",
      "email": "katie.mitzner@gobrightline.com"
    },
    {
      "url": "https://www.gobrightline.com/press-room/2024/brightline-announces-station-expansion-for-downtown-stuart-and-martin-county",
      "email": "vanessa.alfonso@gobrightline.com"
    },
    {
      "url": "https://www.gobrightline.com/offers/industrious",
      "email": "brightlingmeetings@industriousoffice.com"
    },
    {
      "url": "https://www.gobrightline.com/press-room/2024/brightline-welcomes-tri-rail-to-miamicentral",
      "email": "miamicentral@comrascompany.com"
    },
    {
      "url": "https://www.gobrightline.com/terms-of-service",
      "email": "mcparking@universal.com"
    },
    {
      "url": "https://www.yahoo.com/news/boca-raton-picks-developer-reshape-211700424.html",
      "email": "app-store-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/boca-raton-picks-developer-reshape-211700424.html",
      "email": "google-play-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/boca-raton-picks-developer-reshape-211700424.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/boca/2021/07/29/a-gamechanger-for-boca-raton-brightline-station-expected-to-be-completed-next-summer/5405642001/",
      "email": "vvillanueva@pbpost.com"
    }
  ],
  "mails": [
    "app-store-icon@3x.png",
    "brightlingmeetings@industriousoffice.com",
    "budget-coupon_icon-white@2x.png",
    "custserv@budget.com",
    "featuredimage@2x.png",
    "google-play-icon@3x.png",
    "katie.mitzner@gobrightline.com",
    "marker--hover--listing-stack@2x.png",
    "marker--listing-stack@2x.png",
    "mcparking@universal.com",
    "miamicentral@comrascompany.com",
    "outreach@brightlinewest.com",
    "press@brightlinewest.com",
    "profile@2x.png",
    "rbustamante@mears.com",
    "u003ebillhimself@yahoo.com",
    "u003erbustamante@mears.com",
    "vanessa.alfonso@gobrightline.com",
    "vvillanueva@pbpost.com"
  ],
  "nombre_sitio": "gobrightline.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.gobrightline.com/offers/large-groups",
      "text": "Group Travel | Brightline Skip to Content Skip to Cookie Banner My Trips Login English Help Center TICKETS & TRAVEL Train Tickets Arrivals Status Departures Status Train Passes Parking Passes Travel Advisors Partnerships Manage Trips Brightline App EXPERIENCE Traveling With Us Baggage Policy Station Experience Onboard Experience Family Travel Accessible Travel Get To/From Station Parking Food & Drink DESTINATIONS City Guide Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Brightline West OFFERS GIFT CARDS REWARDS>> Buy Tickets Menu Offers Large Groups Offers Groups save up to 50%. Offers Large Groups It Pays to Travel Together. Group travel is easy and enjoyable with Brightline. For a limited time you and your entire crew can automatically save up to 50% on Adult SMART and SMART Saver fares—now through September 30 to any destination on select trains. When searching for fares online, your discount is automatically applied when you add the number of Guests in your group. Learn more about your group savings below. Pricing and discounts by group size. Number of Guests Service Route Offer 1-2 Both SMART & PREMIUM All Check out our offers page and sign up for our email list to stay up-to-date with the latest deals. 3+ SMART All Automatically save up to 50% on SMART Saver and SMART fares. Book and ride within 60 days of purchase. What to know before you book. Get the best deals. Check out our offers page before you book for the latest deals and sign up for exclusive discounts. Make booking a breeze. Have the name and birthday for each Guest in your group handy. Bookings must be completed within 30 minutes to avoid timeout. Bring your tickets. Guests are encouraged to print their tickets ahead of time or have their boarding pass handy on their phone as tickets cannot be printed at the kiosks in the station. Seating. Guests will be automatically assigned seats for their trip. Groups are sat together, pending availability. Payment info. Each transaction must be completed using one payment method. Pack smarter. Each Guest may bring one carry-on and one personal item onboard. Please refer to our baggage policy for more details. Limited capacity may apply for checked bags. Respect the journey. Please refrain from bringing a large quantity of food and drinks that would be disruptive to other Guests such as cakes, party foods, and cases of soft drinks or alcohol. Speakers and loud electronic devices will also be required to stay powered off or muted. Meeting your group. Our airy and clean lobbies are the best place to meet with your party before boarding. Transportation in Orlando. We offer convenient transportation options for your group including Mears Shuttles & Private Rides . If your group needs their own vehicle, please reach out to Rachel A. Bustamante, rbustamante@mears.com | (407) 254-0461 For groups of 50+ Guests. If you’re traveling with a group of 50 or more, we have options for you too. For Guests who’d like to pay for a private coach and private train experience, please submit requests here . Someone from our team will reach out shortly. If you’d like to book your 50+ Guests yourself, you can make multiple reservations here . Stay in the loop. Create a Brightline account to access exclusive benefits and secure the latest offers — so you never miss out on our best deals. SIGN UP Terms & Conditions: For travel by September 30 2025. Must include at least three one-way tickets in one transaction. Only available on select trains. Lowest SMART Saver fare $39 and SMART fare $59 for rides arriving and departing from Orlando. Lowest $15 SMART fare for rides within South Florida. Subject to availability. Non-transferable. Not valid in conjunction with any other offer. Subject to change or cancelation. Management reserves all rights. Additional information can be found in our Terms of Service. Miami Aventura Fort Lauderdale Boca Raton West Palm Beach Orlando Location and Details MiamiCentral Station Address 600 NW 1st Avenue, Miami, FL 33136 Station Hours of Operation Mon - Fri: 6:00 AM - 11:00 PM Sat - Sun: 5:00 AM - 12:40 AM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Location and Details Aventura Station Address 19796 West Dixie Highway, Miami, FL 33180 Station Hours of Operation Mon - Thu: 6:00 AM - 11:10 PM Fri: 6:00 AM - 12:45 AM Sat - Sun: 5:00 AM - 12:45 AM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Location and Details Fort Lauderdale Station Address 101 NW 2nd Avenue, Fort Lauderdale, FL 33311 Station Hours of Operation Mon - Fri: 5:15 AM - 12:00 AM Sat - Sun: 6:00 AM - 1:30 AM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Location and Details Boca Raton Station Address 101 NW 4th St, Boca Raton, FL 33432 Station Hours of Operation Mon - Thu: 5:00 AM - 12:45 AM Fri - Sat: 5:00 AM - 1:45 AM Sun: 6:00 AM - 11:45 PM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Location and Details West Palm Beach Station Address 260 Quadrille Plaza Drive, West Palm Beach FL 33401 Station Hours of Operation Mon - Fri: 4:30 AM - 12:30 AM Sat - Sun: 5:30 AM - 2:30 AM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Location and Details Brightline Orlando Station Address 10705 Jeff Fuqua Blvd Orlando, FL 32827 Station Hours of Operation Mon - Sun: 4:00 AM - 1:15 AM Parking Hours of Operation Daily: Open 24 hrs. Phone Number 831-539-2901 Contact Help Center Advertise With Us Press Room Speaker Request Travel Advisors Our Company About Us Careers Investor Relations Our Impact Railroad Rail Safety Policies Accessibility Privacy Policy Terms of Service Wi-Fi & Terms & Conditions/FAQs Gift Cards GO SMARTER Download the Brightline app today. © Brightline 2025. All Rights Reserved"
    },
    {
      "url": "https://www.budget.com/en/locations/us/fl/boca-raton/brbct",
      "text": "Save on Car Rentals at Boca Raton Brightline Shuttle, Boca Raton, FL | Budget Car Rental Sign into your Budget Account Sign into your Budget Account Sign into your Budget Account Sign into your Budget Account We are unable to process your request at this time. Please return to the Homepage and start your process again or use the Worldwide Phone Number List to find your Budget Customer Service telephone number. You've reached the maximum amount of code sends. Please try again later or contact customer service. Your session has expired and logged out of profile. Please login and start your search again. Please enter your Budget password to login Get our best rates when you sign In. Terms Apply For full Budget and Amazon benefits, after logging in with Amazon you'll need to log in to Budget and link your accounts. Login is not required to complete your reservation Remember Me YES NO This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Sign In Log In Forgot username? Forgot Customer ID? Forgot password? Not You? Need an account? Create an Account Create an Account Not a Member? Join Now It’s easy and only takes a minute More Sign In Option More Log In Options If you already have a 6 digit Wizard number, Go Here! This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Cancel continue without passcode Not a Member? Join Now It's easy and only takes a minute. Best Rate Guaranteed Bonus Rental Day Free Upgrade (When Available) JOIN NOW Member Benefits Terms Best Rate Guarantee Create or log in to your Budget.com account to get the best rate. Exceptions: Car Rental rates from other car rental companies (including but not limited to Avis, National Enterprise, Alamo, Sixt, Dollar, Payless, etc) do not qualify. Rates obtained through the use of discounts, coupons, upgrade offers, pre-negotiated (e.g.. group, government, corporate, tour, insurance replacement rentals) or similar rates do not qualify. Car rental included as a part of a package rate (e.g. airfare + hotel + car rental, hotel + car rental, airfare + car rental) does not qualify. Car rental rates found on an auction or wholesale websites which do not display the name of the car rental company until after purchase, do not qualify. Car rental rates obtained from a website that requires a member login order to obtain the rate do not qualify Free Day earned on 3rd day Minimum Offer of one day free of the daily time and mileage charges on an intermediate (group C) through a full-size four-door (group E) car. Taxes, concession recovery fee, customer facility charges ($10/contract in CA) and fuel charges are extra. Optional items such as LDW and other surcharges may apply and are extra. Offer valid on minimum three-day rental. The renter is responsible for any additional time and mileage charges over one day. Coupon cannot be used for one-way rentals. One coupon per rental. Offer may not be used in conjunction with any other coupon, promotion or offer. Coupon valid at Budget locations in contiguous U.S. (excluding the New York Metro area). Holiday and other blackout periods may apply. If a rental begins during a blackout period, the whole rental is blacked out and doesn't qualify for use of coupon. An advance reservation is required. Customer must provide profile number associated with the coupon. Reservation must be cancelled by rental date, or coupon will be used. Offer subject to vehicle availability at time of reservation and may not be availabe on some rates at some times. For reservations made on Budget.com, free day will be applied at the time of rental. Budget reserves the right to alter the terms and conditions and use of coupons. Budget reserves the right to refuse or expire coupons at any time without prior notification. Coupons cannot be applied to completed rentals. Renter must meet Budget age, driver and credit requirements. Minimum age may vary by location. An additional daily surcharge may apply for renters under 25 years old. Rental must begin on or before 12/31/23. FREE UPGRADE One car class upgrade subject to availability on compact through full-size four-door car booking. VERIFICATION CODE OPTION VERIFICATION CODE VIA SMS VERIFICATION CODE VIA EMAIL You've reached the maximum amount of code sends. Please try again later or contact customer service. For added security, we will send you a verification code to verify your identity. Please choose a way to receive your verification code. Receive by Text: {{vm.securityAssessmentSummary.otpTokenverifiers.phoneNumber.value}} TEXT ME Receive by Email: {{vm.securityAssessmentSummary.otpTokenverifiers.emailAddress.value}} EMAIL ME VERIFICATION CODE For added security, please enter the verification code that has been sent to your mobile number beginning with {{vm.securityAssessmentSummary.otpTokenverifiers.phoneNumber.value}} For added security, please enter the verification code that has been sent to your email address beginning with {{vm.securityAssessmentSummary.otpTokenverifiers.emailAddress.value}} Security Passcode Submit Choose Verification Method ACCOUNT LOCKED Sorry, the maximum number of attempts has been reached. For your security your account has been locked. To activate your account, click on the link we sent to your email at {{vm.securityAssessmentSummary.otpTokenverifiers.emailAddress.value}} RESEND EMAIL EMAIL SENT Email to reactivate your account sent. Please check your email at {{vm.securityAssessmentSummary.otpTokenverifiers.emailAddress.value}} and click on the link we sent to unlock your account. RESEND EMAIL PASSWORD EXPIRED RESET PASSWORD {{vm.passwordResetMsg}} Please check your Junk E-mail folder just in case the email was delivered there instead of your inbox. For further queries use the Worldwide Phone Number List to find your Budget Customer Service telephone number. Close RESET PASSWORD Your password has expired. Please contact our customer service center for any details. Close {{vm.customer.firstName | uppercase}} {{vm.customer.membershipStatus}} {{vm.customer.membershipStatus}} As a FastBreak member,enjoy the ease of One Click Reservations Reserve Your Car in Seconds > Your Rental is Ready! {{rentalHistory.pickLoc.name+',\r\n\t\t\t\t\t\t\t\t\t'+rentalHistory.pickLoc.locationCode}} Enhance My Rental {{rentalHistory.vehicle.makeModel}} Mileage {{features.value}} Your rental ends today Your rental ends in {{rentalHistory.rentalEndsIn}} Days Your rental has ended Your rental ends in {{rentalHistory.hoursInRental}} hour hours Starting Fuel {{features.value}} Gal {{features.value}} litres Current Fuel {{features.value}} Gal {{features.value}} litres Enhance My Rental {{rentalHistory.vehicle.makeModel}} Your rental ends today Your rental ends in {{rentalHistory.rentalEndsIn}} Days Your rental has ended Your rental ends in {{rentalHistory.hoursInRental}} hour hours Enhance My Rental Confirmation:\r\n\t\t\t\t\t\t\t\t{{rentalHistory.confirmationNumber}} {{rentalHistory.pickLoc.name+',\r\n\t\t\t\t\t\t\t\t'+rentalHistory.pickLoc.locationCode}} View Details You do not have any upcoming reservations Please activate your profile to view upcoming reservations. We are sorry, we are unable to retrieve your Upcoming Reservations currently. Please try again later or contact Customer Care for further assistance. Upcoming Concur Trips Click to add a car to your Trip. {{trips.fromCode}} - {{trips.toCode}} err.res.bookingType.required,budget lbl.res.bookingFor,budget Business Leisure My Rentals My Profile Enjoy more benefits with Fastbreak Account Create My Profile Activate My Profile Link My Amazon and Budget accounts Connect My Existing Budget Account Log Out of Amazon Register for a Budget Account Log Out Not You 5-Star Safety The National Highway Transportation Safety Administration from time to time rates vehicles for safety standards.&nbsp; Based on our last review, this vehicle was rated as a 5-star vehicle.&nbsp; Please note these ratings are subject to change and reflect our last review. Maintenance updates are in progress. Reservations are not affected, however, some functionality may not be available during this time. Maintenance updates are in progress. Reservations are not affected, however, some functionality may not be available during this time. Toggle navigation Menu Sign In Update-close Please update your credit card information. Update Update-close Hi, {{vm.customer.firstName | uppercase}} Hi {{vm.customer.firstName | titleCase}} Hi, {{vm.customer.wizardNumberMasked}} Hi, {{vm.customer.firstName | uppercase}} Hi {{vm.customer.firstName | titleCase}} Hi, {{vm.customer.wizardNumberMasked}} Reservations Make a Reservation View / Modify / Cancel Budget Truck Get e-Receipt Budget PreCheck Deals US Deals International Deals Partner Deals Cars & Services Car Guides Popular Rental Cars Electric Car Rental Products & Services Programs Protections & Coverages Budget by the Month - Long Term Car Rental Meetings & Groups Car Rentals Budget App Fastbreak Fastbreak Program Sign Up for Fastbreak Locations Find a Location Top Airport Locations All US Locations All Global Locations Trip Ideas Chicago Las Vegas Los Angeles Car Sales Avis Car Sales RubyCar More View Receipt Sign In Sign In Register Hi, {{vm.customer.firstName | uppercase}} Hi {{vm.customer.firstName | titleCase}} Hi, {{vm.customer.firstName | uppercase}} Hi {{vm.customer.firstName | titleCase}} Please update your credit card information. Update Hi, {{vm.customer.firstName | uppercase}} Hi {{vm.customer.firstName | titleCase}} Log Out Not You Business Rentals Customer Care Feedback STAY IN COMPLIANCE WITH YOUR COMPANY POLICY Thank You Great. Thanks for letting us know Are you still working for or associated with\n {{vm.cbpCustomer.accountName}} ? YES I AM NO I'M NOT You may be subject to further employment verification at time of rental. You can always add a new discount code if you have one. {{vm.footerMessage}} Continue Continue Member Benefits Terms Best Rate Guarantee Create or log in to your Budget.com account to get the best rate. Exceptions: Car Rental rates from other car rental companies (including but not limited to Avis, National Enterprise, Alamo, Sixt, Dollar, Payless, etc) do not qualify. Rates obtained through the use of discounts, coupons, upgrade offers, pre-negotiated (e.g.. group, government, corporate, tour, insurance replacement rentals) or similar rates do not qualify. Car rental included as a part of a package rate (e.g. airfare + hotel + car rental, hotel + car rental, airfare + car rental) does not qualify. Car rental rates found on an auction or wholesale websites which do not display the name of the car rental company until after purchase, do not qualify. Car rental rates obtained from a website that requires a member login order to obtain the rate do not qualify FREE UPGRADE One car class upgrade subject to availability on compact through full-size four-door car booking. Rent a Car Rent a Car at Boca Raton Brightline Shuttle Rent a car at at Boca Raton Brightline Shuttle Your session has expired. Please enter your details and search again. errors.invalid_concur_awd,budget We are sorry, the site has not properly responded to your request. Please try again. If the problem persists, please Contact Us .<{{vm.code}}> Reference Number <{{vm.referenceNumber}}> You are successfully logged in. We have re-started your reservation to ensure your profile preferences are included. {{vm.errMsgPast}} Your Member Benefits Have Been Applied! | Start Your Reservation Below. Terms Apply lbl.res.selectOne,budget lbl.res.bookingFor,budget Business Leisure Age: I live in: Add Customer ID * {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}} {{vm.customer.firstName}} {{vm.customer.lastName}} {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}} {{vm.customer.wizardNumberMasked}} Benefits Applied {{couponCount}} Offer Codes {{couponCount}} * Select Vehicle Type * Enter your Fastbreak, rapidRez or online ID You are logged in as {{vm.customer.firstName}} {{vm.customer.lastName}}. You are logged in to your Amazon account as {{vm.customer.firstName}} {{vm.customer.lastName}}. You are logged in as {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}}. You are logged in as {{vm.customer.wizardNumberMasked}}. Log Out? Not You? Enter an Offer Code Your offer code is invalid. Learn Why? {{option.nickName}}- {{option.discountNumber}} (Primary) Your Coupon can't be used for this reservation. Learn Why? Quantity {{vm.reservationModel.coupon.purposeOfTravel || \"Purpose of Travel\"}} Business Leisure Both Purpose of Travel is a required field. Member Number Please enter valid membership number. Please provide a valid membership ID, or click the link indicating you do not have your membership ID, and provide your full name and address. I don't have my AARP member # {{vm.partnerLabel}} {{vm.partnerDiscountMessage}} Your corporate email address is required for this offer code. Please enter a valid corporate email address. Request aborted as otp limit exhausted. We are unable to process your request at this time. We are unable to process your request at this time. Please return to the Homepage and start your process again or use the Worldwide Phone Number List to find your Budget Customer Service telephone number. * Optional Note: Rates are calculated based on details you provide. Modifications may change your rate, and if so, the Car Selection page will redisplay. Update SELECT A CAR Update SELECT A CAR Select My Car Continue to Confirmation Continue Our Best Deals At Boca Raton Brightline Shuttle Save up to 10% On a 5+ day rental Tap to Apply Offer Applied! Details Free Upgrade Get a free upgrade on select vehicles Tap to Apply Offer Applied! Details Save up to 10% At neighborhood locations Tap to Apply Offer Applied! Details Member Benefits Terms Best Rate Guarantee Create or log in to your Budget.com account to get the best rate. Exceptions: Car Rental rates from other car rental companies (including but not limited to Avis, National Enterprise, Alamo, Sixt, Dollar, Payless, etc) do not qualify. Rates obtained through the use of discounts, coupons, upgrade offers, pre-negotiated (e.g.. group, government, corporate, tour, insurance replacement rentals) or similar rates do not qualify. Car rental included as a part of a package rate (e.g. airfare + hotel + car rental, hotel + car rental, airfare + car rental) does not qualify. Car rental rates found on an auction or wholesale websites which do not display the name of the car rental company until after purchase, do not qualify. Car rental rates obtained from a website that requires a member login order to obtain the rate do not qualify Free Day earned on 3rd day Minimum Offer of one day free of the daily time and mileage charges on an intermediate (group C) through a full-size four-door (group E) car. Taxes, concession recovery fee, customer facility charges ($10/contract in CA) and fuel charges are extra. Optional items such as LDW and other surcharges may apply and are extra. Offer valid on minimum three-day rental. The renter is responsible for any additional time and mileage charges over one day. Coupon cannot be used for one-way rentals. One coupon per rental. Offer may not be used in conjunction with any other coupon, promotion or offer. Coupon valid at Budget locations in contiguous U.S. (excluding the New York Metro area). Holiday and other blackout periods may apply. If a rental begins during a blackout period, the whole rental is blacked out and doesn't qualify for use of coupon. An advance reservation is required. Customer must provide profile number associated with the coupon. Reservation must be cancelled by rental date, or coupon will be used. Offer subject to vehicle availability at time of reservation and may not be availabe on some rates at some times. For reservations made on Budget.com, free day will be applied at the time of rental. Budget reserves the right to alter the terms and conditions and use of coupons. Budget reserves the right to refuse or expire coupons at any time without prior notification. Coupons cannot be applied to completed rentals. Renter must meet Budget age, driver and credit requirements. Minimum age may vary by location. An additional daily surcharge may apply for renters under 25 years old. Rental must begin on or before 12/31/23. FREE UPGRADE One car class upgrade subject to availability on compact through full-size four-door car booking. Sign In To Get Our Best Rates Terms Apply Sign In Don't have an account? It's easy and only takes a minute Create an Account Your Member Benefits Have Been Applied! Start Your Reservation Below. Terms Apply Rent a Car Rent a Car {{at}} Rent a car Boca Raton Brightline Shuttle (BRBCT) lbl.res.selectOne,budget lbl.res.bookingFor,budget Business Leisure Select My Car Continue Close Make a Reservation Cancel Modify Rental Details Your session has expired. Please enter your details and search again. You are successfully logged in. We have re-started your reservation to ensure your profile preferences are included. errors.invalid_concur_awd,budget lbl.res.selectOne,budget lbl.res.bookingFor,budget Business Leisure Pick-up and Return to same location Pick-up Date Pick-up Time Return Date Return Time Renter's age is 25 or over Age I live in I have a Customer ID I have a discount code Customer ID # {{vm.customer.firstName}} {{vm.customer.lastName}} {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}} {{vm.customer.wizardNumberMasked}} {{vm.customer.firstName}} {{vm.customer.lastName}} {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}} Last Name You are logged in as {{vm.customer.firstName}} {{customer.lastName}}. Not {{vm.customer.firstName}}? Log Out? Not You? You are logged in to your Amazon account as {{vm.customer.firstName}} {{customer.lastName}}. Log Out? You are logged in as {{vm.reservationModel.personalInfoRQ.firstName}} {{vm.reservationModel.personalInfoRQ.lastName}}. Log Out? Not You? You are logged in as {{vm.customer.wizardNumberMasked}}. Log Out? Not You? Offer Codes {{option.nickName}} - {{option.discountNumber}} (Primary) {{option.nickName}} - {{option.discountNumber}} (Primary) Quantity {{vm.reservationModel.coupon.purposeOfTravel || \"Purpose of Travel\"}} Business Leisure Both Purpose of Travel is a required field. Member Number I don't have my AARP member # {{vm.partnerLabel}} {{vm.partnerDiscountMessage}} Your corporate email address is required for this offer code. Please enter a valid corporate email address. Request aborted as otp limit exhausted. We are unable to process your request at this time. We are unable to process your request at this time. Please return to the Homepage and start your process again or use the Worldwide Phone Number List to find your Budget Customer Service telephone number. Your discount code is invalid, Learn Why? Your discount code is invalid, Learn Why? Rate Code invalid Learn Why? Quantity Select My Car Continue to Confirmation Note: Rates are calculated based on details you provide. Modifications may change your rate, and if so, the Car Selection page will redisplay. Update SELECT A CAR Update SELECT A CAR Close Select Vehicle Type {{item.description}} Verify Your AARP Status Please enter the name and address linked to your AARP account. First Name Last Name Address City Zip/Postal Code Verify your Account {{vm.title}} {{vm.reason}} {{vm.errorMsg}} Close msg.res.rateinfo Your Rate Code cannot be used for this reservation due to following reason(s): Rate Code requires minimum length of 5 days Close Age Providing your age allows us to give you a more accurate rental estimates. Restrictions and additional surcharges may apply for underage driver's. Please review rental terms and conditions or call us at 800-472-3325 for details. Note: When using your Customer ID this information may not be changed. If required, please call at 800-314-3932. Close I Live In Required to present credentials to confirm your country of residence when picking rental. If the credentials are of a different country, the reservation will still be honored but the confirmed rate may change. To modify, please cancel and create a new reservation. Note: When using your Customer ID this information may not be changed. If required, please call at 800-314-3932. Close Do you have a Customer ID? Select to provide Customer ID (called as RapidRez with Fastbreak Service number, Basic RapidRez number or an Online ID ). Providing it will apply non-secure customer account preferences (like car preference etc.). Note: Some of profile information may not be changed. If required, please call at 800-314-3932. Close Offer code (BCD or Coupon code) Select to add a BCD (a 7-character code with one letter followed by six numbers) or Coupon code (a 7-character code with four letters followed by three numbers) to the reservation. We are sorry, Avis Preferred Points cannot be combined with additional offers and discounts. Only one offer can be applied per reservation. If you wish to use your Preferred Points for this reservation, please remove coupon code. Close Coupon Count These are the available options that may be redeemed. Close Reserve Reserve your bookings in One click. COUPON INFO Your coupon number cannot be used for this reservation due to following reason(s): The coupon code entered is not valid. Coupon codes are seven characters, four letters followed by three numbers. BCD INFO Your BCD cannot be used for this reservation due to the following reason(s): err.bcd.bcdFormat VERIFICATION CODE For added security, please enter the verification code that has been sent to your email address beginning with {{vm.awdSecurityAssessmentSummary.otpTokenverifiers.emailAddress.value}} Your One Time Password has been resend successfully. Security Passcode Submit Resend OTP {{vm.heading}} {{vm.description}} {{vm.button1}} {{vm.button2}} Locations Canada & USA United States Florida Boca Raton Boca Raton Brightline Shuttle View Map Close Map Boca Raton Brightline Shuttle (BRBCT) Address: 101 NW Fourth St, (Srvcs Train Passengers Only), Boca Raton, FL, Florida, 33432, United States Phone: (1) 561-750-7433 Location Type: Corporate Hours of Operation: Sun 9:00 AM - 1:00 PM; Mon - Fri 8:00 AM - 6:00 PM; Sat 8:00 AM - 4:00 PM Holiday Hours: 2025 THANKSGIVING November\r\n\t                     \r\n\t                      27\r\n\t                     \r\n\t                      closed CHRISTMAS December\r\n\t                     \r\n\t                      25\r\n\t                     \r\n\t                      closed CHRISTMAS EVE December\r\n\t                     \r\n\t                      24\r\n\t                     \r\n\t                      08:00AM - 04:00PM NEW YEARS EVE December\r\n\t                     \r\n\t                      31\r\n\t                     \r\n\t                      08:00AM - 04:00PM 2026 NEW YEARS DAY January\r\n\t                     \r\n\t                      1\r\n\t                     \r\n\t                      08:00AM - 02:00PM Keydrop Location Get Directions Get Directions Cancel Pick-up Service Available To use our free pick-up service, call your Budget rental location directly at the location phone number listed on your reservation confirmation. Pick-up service policies (hours of availability, allowable pick-up distance, etc.) vary by location so it's important that you call the location and make arrangements for pick-up at least 24 hours before your desired rental time. When you call the location, be ready to provide all applicable information including precise address, exact time of pick up, and a phone number where you can be reached at that time. Please note that an off-airport Budget location cannot pick you up at an airport that has a Budget location. In this case, either you must rent your car at the airport location, or provide your own transportation to the off-airport location where you prefer to rent Location Information Fastbreak Service Proceed to Budget rental counter. Show your drivers license and identify yourself as a Fastbreak member. The Budget rental agent will provide you with your preprinted contract and keys. General Directions COUNTER:  Customers arriving on the Brightline train wanting to rent a vehicle will be provided shuttle to the Budget location \"BC1\" at 251 SW First Ave.  The office is less than 1 mile away from the train station which is about a 5-minute ride. CARS:  On-site. RETURNS:  Return vehicles to \"BC1\" at 251 SW First Ave. From I-95, exit on Palmetto Park Rd & turn east.  Turn right onto SW 1st Ave & follow for 3 blocks.  Budget is on the right. After-hours Returns Rental vehicle must be returned during office hours. There is a $250.00 drop fee for vehicles dropped after hours. NOTE: Some locations may have a key drop available: Drop Box Available: If the customer chooses to leave the vehicle, the customer is responsible for the vehicle & all charges (including any damages or theft of the vehicle may have incurred during after hours) until the contract can be closed on the following business day. Drop Box NOT Available: If the location does not have a key drop box, the location does not permit vehicles to be left after closing hours. The customer should never lock or leave the keys inside the car. The customer is responsible for the vehicle & all charges (including any damages to or theft of the vehicle and locksmith fees if they choose to lock the keys in the car). The customer can either choose to return the car the next day the location is open OR change the Drop Off Location to the nearest Regional Airport. Customer is responsible for all charges related to the drop-off modification. Cancel Pick-up Service Available To use our free pick-up service, call your Budget rental location directly at the location phone number listed on your reservation confirmation. Pick-up service policies (hours of availability, allowable pick-up distance, etc.) vary by location so it's important that you call the location and make arrangements for pick-up at least 24 hours before your desired rental time. When you call the location, be ready to provide all applicable information including precise address, exact time of pick up, and a phone number where you can be reached at that time. Please note that an off-airport Budget location cannot pick you up at an airport that has a Budget location. In this case, either you must rent your car at the airport location, or provide your own transportation to the off-airport location where you prefer to rent Terms and Conditions Terms & Conditions Popular Searches Long-Term Car Rental One-Way Car Rental Free Upgrade Deal Rental Car FAQ Budget App Popular Rental Cars Luxury Car Rental Electric Car Rental All Car/Sedan Sizes Pickup Truck Rental SUV Rental Van Rental Popular US Destinations Trip Ideas Car Rental Las Vegas Car Rental NYC Car Rental Chicago Car Rental Orlando Car Rental Los Angeles Budget Partners Affiliates Travel Agents AARP Members Miles & Points Programs Military & Veterans Budget Support Contact Us Best Rate Guarantee Roadside Assistance Rental Car Fuel Plans Site Map Fraud & Scams Accessibility Company Info About Budget Careers Copyright Notices Terms of Use Privacy Notice Your Privacy Choices Cookie Settings Lost & Found {{lang.language}} © 2025 Budget Rent A Car System, Inc. Connection Failed or Some Error occurred. OK Build # : Revision # : Build Date :"
    },
    {
      "url": "https://www.brightlinewest.com/about-us/executive-team",
      "text": "Our Executive Team | Brightline West Skip to Content Skip to Banner About Us Safety Leadership Jobs Connectivity Overview Project Experience Construction Construction Plan Construction Advisories Trains FAQ Contact Us Media Press Releases Media Kit Menu About Us Executive Team Leadership Our leadership team has a proven track record for high-speed rail implementation and is supported by a highly experienced team of professionals consisting of veterans from our Brightline Florida system, international high-speed rail experts, and other seasoned transportation design and construction professionals. P. Mike Reininger, Brightline Holdings, Chief Executive Officer Mike is responsible for overseeing all aspects of Brightline Holdings rail projects, including Brightline West’s (BLW) development, design, and financing. From 2012 to 2018, he served as Brightline Holdings' president, leading all efforts to launch its Phase I system from Miami to West Palm Beach. Under his leadership, Brightline modernized an existing rail corridor, built five new stations, and introduced a fleet of first-of-their-kind trainsets. Mike rejoined Brightline Holdings as CEO in 2021 to oversee the company's next phase of growth. Mike has more than three decades of experience in developing major projects and the start-up of unique companies. He was also the Managing Director of the Union Station Neighborhood Company, where he led the effort to transform Denver's Union Station and its downtown railyard into a modern multimodal transportation hub. He has also served as Executive Vice President and Chief Development Officer for AECOM. Mike holds a Bachelor of Architecture, Design Specialization from Texas Tech University and executive certifications in resort and hotel master planning, financial engineering and business management from Harvard University School of Design, Harvard Business School, and Wharton School of the University of Pennsylvania. Sarah Watterson, Brightline West, President Sarah is responsible for overseeing all aspects of the BLW high-speed rail project including development, design, and financing. Prior to her BLW role, Sarah was the Head of Development for Brightline Florida's parent company, Florida East Coast Industries (FECI), where she oversaw the development and asset management for over 10 million square feet of transit oriented and industrial development. Prior to that role, Sarah was the CEO of a publicly traded golf and entertainment company, Drive Shack, which owned and/or operated more than 75 golf courses, including many Los Angeles County and City of Long Beach public golf courses. Prior to serving in this position, Sarah helped lead the acquisition, ownership syndication and restructuring of the National Basketball Association’s Milwaukee Bucks for Fortress Investment Group owner Wes Edens. In this role, Sarah worked on the development of a $550 million arena complex completed through a private-public partnership. Prior to her time in Milwaukee, she was on the Private Equity team at Fortress Investment Group. Sarah began her career at Goldman Sachs in the Sales & Trading Division. Sarah graduated summa cum laude from Cornell University with a Bachelor of Science degree in Applied Economics and Management. Jeff Swiatek, Chief Financial Officer Jeff has served as Chief Financial Officer since June 2018. He oversees the financial aspects of the development and operations of the Company. Prior to joining the Company, Jeff served in various senior roles at American International Group, Inc. (‘‘AIG’’), a multinational finance and insurance corporation, from 2002 to 2018. Prior to AIG, he worked in the investment banking department of Goldman Sachs Group, Inc., a multinational investment bank and financial services company, from 1998 to 2001. Mr. Swiatek has more than 25 years of experience in international corporate finance and strategy. He holds a Bachelor of Arts in Economics and Asian Studies from Dartmouth College and also holds a Master of Business Administration degree from the University of Chicago Booth School of Business. Kolleen Cobb, General Council Kolleen is responsible for all legal affairs of Brightline West. Ms. Cobb focuses on corporate governance, development projects, land and asset sales and acquisitions, financing, commercial leases, and joint venture transactions and the preparation of service agreements for the development, management and brokerage divisions. Prior to joining Florida East Coast Industries in 2000, Kolleen was with Hughes Hubbard & Reed LLP, a New York-based law firm, where she provided legal advice relating to the acquisition, disposition, leasing, and financing of commercial real property and joint venture transactions, including public/private transactions. Kolleen earned her Bachelor of Science in Accounting, Masters of Accounting, and Juris Doctor from the University of Florida. Adrian Share, PE, Executive Vice President, Engineering and Planning Adrian is a 32-year leading rail transportation industry veteran and a 8+ year veteran at Brightline, where he oversaw the engineering, construction management, and final delivery of Brightline Florida Phase I, and the engineering and environmental work of Phase 2 for rail infrastructure for the Miami to Orlando project. At BLW, Adrian leads the planning and engineering of the rail infrastructure, facilities, and systems, and oversees the implementation and regulatory approval of the rolling stock. He previously served as Florida District Leader and Program Manager at HNTB Corporation, an architecture, civil engineering consulting and construction management firm, from 2010 to 2015. Adrian also served as the Florida High-Speed Rail Project Manager from 2008 to 2011. Mr. Share holds a Bachelor of Science in Civil Engineering from Tulane University and a Master of Business Administration from Northeastern University. He is a Professional Engineer in Florida and previously served as the Chair of the Transportation Committee of the Florida Institute of Consulting Engineers. Joe Dooley, Executive Vice President, Infrastructure Construction Joe is responsible for the development and infrastructure construction initiatives for the Brightline West team. As an accomplished construction executive with over two decades of experience in the transportation and infrastructure sectors, he brings a wealth of knowledge to his role. Previously, Joe was a Senior Vice President – Regional Manager at Sundt Construction, where he was responsible for Transportation/Infrastructure operations across Texas and the Southeast. He directly oversaw 125 employees and more than 350 personnel, leading the organization to experience consistent revenue growth and year-over-year success. Prior to Sundt, Joe served as the Vice President – Southeast Regional Manager at Granite Construction Company. In this role, he oversaw project execution, business development, personnel development, and financial responsibility. His extensive project experience at Granite includes serving as Project Executive for the 35E Managed Lane Project and contributing to the DART Cotton Belt commuter rail project. Joe earned his Bachelor of Science in Construction Management from the University of Cincinnati. Tom Rutkowski, Chief Mechanical Officer Tom has served as Chief Mechanical Officer since November 2014. He was responsible for the design and delivery of our rolling stock fleet for the Florida passenger rail system, as well as the design and delivery of the West Palm Beach and Orlando vehicle maintenance facilities. Prior to joining the Company, Tom served for 17 years at the New Jersey Transit Corporation (NJ Transit), the state-owned public transportation system that serves New Jersey along with portions of New York and Pennsylvania, most recently in the position of General Superintendent – Equipment from August 2007 to November 2014. Tom has extensive experience in train maintenance and design as well as facility operations and design. About Brightline West Careers People and Culture FAQ Media Press Releases Construction Advisories Media Kit Contact Us Press@brightlinewest.com Outreach@brightlinewest.com © Brightline West 2025. All Rights Reserved Terms of Use Privacy Policy Accessibility"
    },
    {
      "url": "https://www.pearlantonacci.com/blog/boca-raton-brightline-station-explore-the-vibrant-and-high-speed-future/",
      "text": "Boca Raton Brightline Station - Explore the Vibrant and High-Speed Future: Skip to main content Search Dropdown arrow Search by\r\n                    Lifestyle New Listings Coming Soon Featured Listings Waterfront\r\n                    Property Luxury Homes Golf & Country\r\n                    Clubs Active Adult/55+ New/Pre-Construction Condos/Townhomes Rental Homes Open\r\n                    Houses Search All Listings About Dropdown arrow Meet The Team Compass Real\r\n                    Estate Awards and Press Testimonials Social Media Recent Sales Our Blog Communities Dropdown arrow All\r\n                    Communities Boca Raton Delray Beach Highland Beach Boynton Beach Gulf Stream Manalapan Ocean Ridge Lake Worth Palm Beach West Palm Beach Lighthouse Point Fort Lauderdale Hillsboro Beach Parkland Buy Dropdown arrow Home Buying\r\n                    Process Local Guides Relocating Compass Bridge Loans Our Guarantee Mortgage & Financing Sell Dropdown arrow Selling Your Home Find Your\r\n                    Home's Value Recent Sales Marketing\r\n                    Platform Compass\r\n                    Concierge Private\r\n                    Exclusives Relocating Blog Contact My Dashboard My Dashboard Favorites Saved Searches Messages Preferences Sign Out Sign In 561.245.1541 Menu Close Boca Raton Brightline Station - Explore the Vibrant and High-Speed Future: The new Boca Raton Brightline Station is officially up and running, and now local residents are wondering what it means for them. While regular commuters may be focused on the convenience of traveling to West Palm Beach and Miami, homeowners and potential buyers are looking further afield, considering what this new transport link means for Downtown Boca Raton development and property values. Changes to Boca Raton Transportation One of the biggest benefits for our local community is the improved transport options Brightline provides. Previously, residents would have to rely on cars or the limited Palm Tran bus services. Now, not only can they easily travel to larger cities in South Florida, but they will also benefit from improved transport links across the region. Regular commuters are already noticing the positive impact. According to data from Brightline, the 60-minute train ride from Boca Raton to Miami is 24% faster than the average car commute. And traffic congestion during peak hours is expected to decrease by 15%, as more people take advantage of this convenient transport option. Impact on Boca Raton Real Estate and Property Values With the addition of the Brightline Station, there has been a notable increase in demand for properties near the station, especially those within the highly sought-after Downtown Boca Raton area. Real estate agents are already reporting an uptick in interest from homebuyers looking for properties that offer easy access to this new transportation hub. According to recent statistics, homes within a half-mile radius of train stations typically see a 15% increase in value within two years of the station's opening. Homeowners who purchased their properties before the announcement of the Brightline Station can expect returns of up to 25% over the next five years. Future Development Prospects The arrival of the Brightline Station is not just a catalyst for immediate improvement in property values; it also sets the stage for significant future developments in Downtown Boca Raton . Investors and developers are recognizing the potential of this area, which is likely to attract mixed-use developments, boutique hotels, and upscale retail spaces. The connectivity provided by the Brightline service can transform Downtown Boca Raton into a vibrant hub, drawing in both residents and tourists alike. As a result, the demand for high-quality commercial and residential properties will only continue to rise, bolstering further investment and growth in the region. Moreover, the synergy between improved transportation options and urban development strategies will foster a community that prioritizes walkability, sustainability, and accessibility. This holistic approach to growth will not only enhance property values but also elevate the overall quality of life for Boca Raton residents. The future looks bright as we leverage these developments to create an appealing urban environment that caters to a diverse population. Job Opportunities and Economic Development In addition to improving transport options and increasing property values, the Boca Raton Brightline Station is also expected to bring with it a range of new job opportunities. Already, businesses are flocking to the area around the station in anticipation of increased foot traffic and commuter visits. According to a recent Brightline report, the station could create up to 1,500 new jobs in the area over the next two years, with more expected as the demand for nearby services continues to grow. Local real estate agent Laura Cohen has described the station as \"a game changer for Boca Raton's economy,\" and we can't wait to see how it contributes to the local job market. Enhancing Lifestyle Options for Residents Beyond just economic and property benefits, the new Brightline Station also has a lot to offer Boca Raton residents in terms of social and recreational options. With the ability to reach areas like downtown Miami in just an hour (without the hassle of parking), and downtown West Palm Beach , residents will find themselves with a wealth of new dining, shopping, and entertainment options at their fingertips. In fact, local visitor numbers are predicted to increase by 20% within six months of the station's opening. And with increased foot traffic around the station, we expect more local businesses to open up, providing even more lifestyle options for residents in the coming years. Conclusion The new Boca Raton Brightline Station offers a wealth of benefits for local residents, from improved transport options to increased property values and enhanced social opportunities. If you want to learn more about how these changes will specifically impact you, get in touch with the best Boca Raton real estate experts from The Pearl Antonacci Group who can provide tailored insights and advice. Posted by Brian Pearl on July 28th, 2024 Related Links Learn More about Downtown Boca Raton Search MLS Explore Communities Tags boca raton (36) boca raton real estate (23) downtown boca raton (15) downtown boca (7) mizner park (5) brightline station (1) brightline (1) transportation (1) Facebook Share this post on Facebook Twitter Tweet this post on Twitter Email Send a link to post via Email Leave A Comment Leave text box empty Full Name - required Email Address - required Website Link e.g. yourwebsitename.com Comment - required Submit Comment Please note that your email address is kept private upon posting. Blog Navigation Arrow right All Categories Arrow right Activities & Things To Do Arrow right Awards and Recognition Arrow right South Florida Cities Arrow right Boca Raton Arrow right Boynton Beach Arrow right Delray Beach Arrow right Fort Lauderdale Arrow right Highland Beach Arrow right West Palm Beach Arrow right The Pearl Antonacci Group and Compass Arrow right Charity Arrow right Home Values Arrow right Downtown Real Estate Arrow right Home Buyer Information Arrow right First-Time Homebuyers Arrow right Best Buys - Deals & Steals Arrow right Home Seller Information Arrow right For Sale By Owner Arrow right Local Real Estate News Arrow right Luxury Real Estate Arrow right Mortgage & Financing Arrow right National Real Estate Market Arrow right New Construction Developments Arrow right New Listings & Hot Deals Arrow right Real Estate Market Updates Arrow right Recent & Notable Sales Arrow right Short Sales in Florida Arrow right South Florida Rental Market Blogroll Arrow right Boca Raton Real Estate Arrow right Compass Real Estate Arrow right Delray Beach Real Estate Arrow right Highland Beach Real Estate Arrow right Boynton Beach Real Estate Arrow right Luxury Real Estate Arrow right New Construction Arrow right Meet Our Team Arrow right Contact Us Arrow right Follow Us on Facebook Arrow right Follow Us on Instagram Archives Arrow right Arrow right July 2025 Arrow right June 2025 Arrow right February 2025 Arrow right January 2025 Arrow right November 2024 Arrow right September 2024 Arrow right August 2024 Arrow right July 2024 Arrow right June 2024 Arrow right April 2024 Arrow right March 2024 Arrow right November 2023 Arrow right June 2023 Arrow right May 2023 Arrow right April 2023 Arrow right November 2022 Arrow right August 2022 Arrow right June 2022 Arrow right April 2022 Arrow right December 2021 Arrow right November 2021 Arrow right October 2021 Arrow right September 2021 Arrow right August 2021 Arrow right July 2021 Arrow right June 2021 Arrow right May 2021 Arrow right February 2021 Arrow right January 2021 Arrow right November 2020 Arrow right October 2020 Arrow right September 2020 Arrow right June 2020 Arrow right May 2020 Arrow right April 2020 Arrow right March 2020 Arrow right February 2020 Arrow right August 2019 Arrow right June 2019 Arrow right April 2019 Arrow right March 2019 Arrow right February 2019 Arrow right October 2018 Arrow right August 2018 Arrow right June 2018 Arrow right May 2018 Arrow right December 2017 Arrow right November 2017 Arrow right August 2017 Arrow right May 2017 Arrow right March 2017 Arrow right February 2017 Arrow right December 2016 Arrow right November 2016 Arrow right October 2016 Arrow right June 2016 Arrow right April 2016 Arrow right January 2016 Arrow right November 2015 Arrow right October 2015 Arrow right September 2015 Arrow right May 2015 Arrow right February 2015 Arrow right January 2015 Arrow right December 2014 Arrow right November 2014 Arrow right October 2014 Arrow right September 2014 Arrow right July 2014 Arrow right June 2014 Arrow right May 2014 Arrow right April 2014 Arrow right March 2014 Arrow right February 2014 Rss Feed FEATURED COMMUNITIES Boca Raton Real Estate Highland Beach Real Estate West Palm Beach Real Estate Delray Beach Real Estate Boynton Beach Real Estate Fort Lauderdale Real Estate All Communities RESOURCES Search MLS Home Buyer Services Home Seller Services Real Estate Marketing Home Valuation Mortgage Calculator Relocation Guide OUR TEAM About Us Recent Sales Private Exclusives Our Blog Communities Contact Us Facebook LinkedIn Icon Youtube Pinterest icon © 2025 Real Estate Webmasters All Rights Reserved. Agent Login Sitemap Privacy Policy Terms and Conditions Accessibility DMCA Notice Real Estate Webmasters will open a new window All listings featuring the BMLS logo are provided by BeachesMLS, Inc.This information is not verified for authenticity or accuracy and is not guaranteed.Copyright © 2025 BeachesMLS, Inc. Listing information last updated on September 11th, 2025 at 6:30am EDT."
    },
    {
      "url": "https://www.gobrightline.com/press-room/2024/brightline-announces-station-expansion-for-downtown-stuart-and-martin-county",
      "text": "Brightline announces station expansion for Stuart & Martin. Skip to Content Skip to Cookie Banner My Trips Login English Help Center TICKETS & TRAVEL Train Tickets Arrivals Status Departures Status Train Passes Parking Passes Travel Advisors Partnerships Manage Trips Brightline App EXPERIENCE Traveling With Us Baggage Policy Station Experience Onboard Experience Family Travel Accessible Travel Get To/From Station Parking Food & Drink DESTINATIONS City Guide Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Brightline West OFFERS GIFT CARDS REWARDS>> Buy Tickets Menu Press Room 2024 BRIGHTLINE ANNOUNCES STATION EXPANSION FOR DOWNTOWN STUART & MARTIN COUNTY (photo credit: Roaming Railfan) March 4, 2024 BRIGHTLINE ANNOUNCES STATION EXPANSION FOR DOWNTOWN STUART & MARTIN COUNTY Station expected to open in the second half of 2026 Stuart, Fla. (March 4, 2024) – Brightline , seamlessly connecting travelers between Central and South Florida, formally announced today that it has selected Martin County and the City of Stuart as the site for its next intercity passenger rail station. The location was chosen after a review of five proposals from private and public land owners along the Brightline/Florida East Coast Railway corridor in Martin and St. Lucie counties. Brightline was joined at today’s announcement by Rep. Brian Mast (FL-21) and elected officials from the County and City. Expanding into the Treasure Coast will make Brightline one of the most accessible forms of transportation in Florida, giving access to nearly half of the state’s residents and millions of visitors. The decision to select Stuart was driven by a number of key factors, including the location and physical characteristics of the site and the ease with which the site will integrate into Brightline’s existing rail infrastructure network. Brightline also highlighted various dynamics of the local market and the site’s accessibility to key local attractions. “I congratulate the City of Stuart and Martin County on its successful bid to secure the new Brightline station and parking structure. This is proof that our community can work together and come to a solution if we use common sense. I look forward to the economic development the Treasure Coast stop will bring to our local businesses and the opportunities it will provide to the surrounding cities and the region,” said Congressman Brian Mast, FL District 21. “We’ve seen significant demand and support for a Brightline Station in the Treasure Coast which was evident during this process. It was a difficult decision and we’re grateful for everyone’s support and efforts to make this happen,” said Brian Kronberg, Brightline’s Senior Vice President of Development and Construction. “We couldn’t be more excited to make the City of Stuart our hub for Brightline along Florida’s Treasure Coast.” The announcement of the station site kicks off the process of memorializing a deal structure with Martin County and the City of Stuart. Following City and County approvals, Brightline and its partners will start the design and engineering of the station, parking structure and necessary rail infrastructure. The proposed Brightline Stuart station is located on 2.35 acres in the heart of historic downtown Stuart in Martin County. The station is conveniently located between the Miami and Orlando stations. Its location is approximately 40 miles north of Brightline West Palm Beach, just 40 minutes by train, and the station is easily accessible from I-95, Florida’s Turnpike and the local roadway network. Brightline Stuart guests will be within walking distance of the award-winning downtown and minutes from Stuart’s pristine beaches, oceanfront resorts, and internationally acclaimed “Treasure Coast” lifestyle. “Brightline believes in ‘Connecting People for Good’ and I think that’s a great thing to believe in,” said Martin County Chairman Harold Jenkins, District 3. “A Brightline station in Martin County will make it easier for folks to discover what makes our community unique. And, with a blend of cultures and backgrounds, this location has the potential to attract a good number of passengers. Together with Brightline, we look forward to connecting Martin County with other parts of this great state.” \"The City of Stuart is thrilled to announce that Brightline has chosen Stuart for the next station in Florida's expanding passenger rail network,” said City of Stuart Mayor Becky Brunner. “This marks a historic return to our roots and fulfills a vision held by Stuart for over 30 years, offering residents and visitors alike a first-class journey to Stuart, away from the congestion of highways. Stuart welcomes Brightline to our seaside town and looks forward to developing a partnership that defines the future of travel and transportation in Florida.” “The addition of a Brightline station will transform Stuart into a hub of modern transportation, fostering connectivity, and economic prosperity,” said Chair Troy McDonald, Martin Metropolitan Planning Organization, and City of Stuart Commissioner. Brightline recently surpassed 5 million rides after first launching operations in South Florida in 2018 connecting Miami, Fort Lauderdale and West Palm Beach. In 2022, Brightline opened stations in Boca Raton and Aventura. In September 2023, Brightline rolled out the yellow carpet to welcome long-haul travelers between South Florida and Orlando, celebrating true intercity rail. As the first guests entered its station in Orlando, Brightline put an exclamation point on the boldest private infrastructure project in the nation and the biggest development in American train travel in over 100 years. Today Brightline covers 235 miles between Miami and Orlando in under 3.5 hours. ABOUT BRIGHTLINE Brightline seamlessly connects travelers to top major events and destinations between Central and South Florida. The company currently serves Miami, Aventura, Fort Lauderdale, Boca Raton, West Palm Beach, and Orlando. Brightline is recognized by Inc. 5000 Regionals as one of the fastest-growing private companies in the Southeast for 2023 and is noted as one of the Most Innovative Companies in travel by Fast Company. Brightline offers a guest-first experience designed to reinvent train travel and take cars off the road. The company plans to bring its award-winning service to additional city pairs and congested corridors across the country that are too close to fly and too long to drive, with immediate plans to connect Las Vegas to Southern California. For more information, visit www.gobrightline.com and follow us on Facebook , Instagram , and X . – GOBRIGHTLINE – Media Contacts: Katie Mitzner, Director of Public Affairs katie.mitzner@gobrightline.com Vanessa Alfonso, Director of Media Relations vanessa.alfonso@gobrightline.com WHAT THEY ARE SAYING ELECTED OFFICIALS “Congratulations to the City of Stuart and the entire Treasure Coast on having a Brightline Station in our area. Although it will be several years until it is a reality, I look forward to being able to go to Orlando, especially the airport, and Miami on the train.” – Senator Gayle Harrell, Florida District 31 “Congratulations to the City of Stuart. The new Brightline Station will bring connectivity to the Treasure Coast and a great opportunity for our residents.” – Representative Toby Overdorf, Florida District 85 \"Martin County believes in the importance of supporting and investing in transportation projects that are good for our residents, good for local businesses, and ultimately, good for our state.\" – Martin County Vice Chair Stacey Hetherington, District 2 “As the only stop on the Treasure Coast, a Brightline station in Martin County will bring people together to explore our community, making it easier for Floridians to connect and discover what makes Florida unique. From the culturally rich southern tip of Florida and fun-filled adventures in the Palm Beaches to the naturally quaint Treasure Coast and the legendary offerings of Orlando and Central Florida, we are proud Brightline has selected Martin County as the home of their next station.” - Martin County Commissioner Doug Smith, District 1 “As a former small business owner, I think having a Brightline station in our area will provide a tremendous boost for local businesses within walking distance from the station and beyond. I’m excited for the opportunities this will provide.” - Martin County Commissioner Edward V. Ciampi, District 5 “The presence of the Brightline station in downtown Stuart will undoubtedly benefit local businesses and create new job opportunities as people can now easily travel from Miami, Ft. Lauderdale, West Palm Beach, and Orlando to visit our city. In addition, by creating access to this new, regional rail network, the station will help us reduce our over-reliance on cars and help lessen traffic congestion as we all begin to enjoy the availability of a modern and reliable public transportation system.” - Vice Mayor Campbell Rich, City of Stuart “The City of Stuart very much appreciates Brightline’s selection of Stuart as its future Treasure Coast station. This unique and transformative opportunity will offer benefits to our local businesses and bring new employment opportunities to the area. We look forward to a successful partnership and a bright future for both the City of Stuart and Brightline.” - Commissioner Eula Clark, City of Stuart BUSINESS/COMMUNITY LEADERS \"We couldn't be more excited to welcome Brightline to Martin County. Brightline will bolster our local economy, support our local businesses, and create new connectivity and opportunities for our community. Brightline is at the forefront of elevated travel, while Stuart is consistently recognized as one of the best small towns in Florida and listed among the most beautiful places in the state. Having a Brightline station will allow us to showcase what makes our area so unique and offer visitors a new innovative, sustainable travel option.” - Nerissa Okiye, Tourism Director, Martin County Office of Tourism & Marketing “A Brightline Station in Stuart will add additional vitality to our vibrant downtown, adding tourists & residents daily. It will also provide an option for the tens of thousands of our workforce commuting north & south daily.” - Joseph A. Catrambone, President/CEO, Stuart/Martin Chamber of Commerce “The Palm City Chamber of Commerce is excited for the positive opportunities our new Brightline station will bring to the residents and visitors of our wonderful community.” – Missi Campbell, Executive Director, Palm City Chamber of Commerce \"Stuart has been planning for this event for literally decades. It is so exciting to see it finally come to fruition. This will be a tremendous boost to our local economy.\" – Dan Hudson, Interim Executive Director, Business Development Board of Martin County, Inc. “Stuart Main Street is very excited to welcome Brightline to our beloved historic waterfront Downtown. We look forward to meeting new visitors and appreciate the additional prosperity it will bring to our small locally owned businesses.” - Candace Callahan, Executive Director, Stuart Main Street ### Contact Help Center Advertise With Us Press Room Speaker Request Travel Advisors Our Company About Us Careers Investor Relations Our Impact Railroad Rail Safety Policies Accessibility Privacy Policy Terms of Service Wi-Fi & Terms & Conditions/FAQs Gift Cards GO SMARTER Download the Brightline app today. © Brightline 2025. All Rights Reserved"
    },
    {
      "url": "https://www.gobrightline.com/offers/industrious",
      "text": "Industrious | Brightline Skip to Content Skip to Cookie Banner My Trips Login English Help Center TICKETS & TRAVEL Train Tickets Arrivals Status Departures Status Train Passes Parking Passes Travel Advisors Partnerships Manage Trips Brightline App EXPERIENCE Traveling With Us Baggage Policy Station Experience Onboard Experience Family Travel Accessible Travel Get To/From Station Parking Food & Drink DESTINATIONS City Guide Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Brightline West OFFERS GIFT CARDS REWARDS>> Buy Tickets Menu Offers Industrious Offers Industrious Offers Industrious Meet Industrious: the best coworking destination is now on-the-go. Enjoy 50% off your first meeting room with code: ONTHEGO Industrious meets workers like you wherever you are in your professional journey. And Brightline gets you there fast. Now at select Brightline stations, we’re offering private, comfy, bookable meeting rooms on-the-go. From Miami to Orlando, our special edition Industrious spaces are the flexible solution for your work travel, commute, or OOO needs so you can continue feeling like a boss. Let’s thrive, and get there on time. Save on your first meeting room booking. Enjoy 50% off when you reserve an in-station meeting room. Just use promo code ONTHEGO when booking. Available in-station meeting rooms: Brightline MiamiCentral Station Brightline Fort Lauderdale Station Brightline West Palm Beach Station Brightline Orlando Station in partnership with Orlando Health Upgrade your gathering. Ride PREMIUM and enjoy perks like complimentary food and drinks, exclusive access to the PREMIUM Lounge, and more for a first-class experience Food and drink. Keep everyone fed and satisfied with bites and drinks from Mary Mary Bar, or cater your meeting or event with signature options at select Brightline stations. It's the perfect way to celebrate a successful deal or fuel up before the big expo. Reserve now: Orlando MiamiCentral Fort Lauderdale West Palm Beach Meet Industrious: the best coworking destination is now on-the-go. Enjoy 50% off your first meeting room with code: ONTHEGO Industrious meets workers like you wherever you are in your professional journey. And Brightline gets you there fast. Now at select Brightline stations, we’re offering private, comfy, bookable meeting rooms on-the-go. From Miami to Orlando, our special edition Industrious spaces are the flexible solution for your work travel, commute, or OOO needs so you can continue feeling like a boss. Let’s thrive, and get there on time. Available in-station meeting rooms: Brightline MiamiCentral Station Brightline Fort Lauderdale Station Brightline West Palm Beach Station Brightline Orlando Station in partnership with Orlando Health Upgrade your gathering. Ride PREMIUM and enjoy perks like complimentary food and drinks, exclusive access to the PREMIUM Lounge, and more for a first-class experience Food and drink. Keep everyone fed and satisfied with bites and drinks from Mary Mary Bar, or cater your meeting or event with signature options at select Brightline stations. It's the perfect way to celebrate a successful deal or fuel up before the big expo. Reserve now: Orlando MiamiCentral Fort Lauderdale West Palm Beach Frequently Asked Questions Expand All What is Industrious? Industrious is the leading workplace provider for companies of all sizes and stages. With a national network spanning 50-plus cities and the highest member satisfaction score in the industry, Industrious is uniquely suited to support your business’s needs today, tomorrow, and in the years to come. Where are Industrious meeting rooms located throughout Brightline? Industrious meeting rooms are located in our MiamiCentral, Fort Lauderdale, West Palm Beach, and Orlando stations. How can I save 50% off my first meeting room? Enjoy 50% off when you reserve an in-station meeting room. Just use promo code ONTHEGO when booking. How do I book an Industrious meeting room at a Brightline station? To book a meeting room at one of our Brightline stations go to Industriousoffice.com/meeting-rooms and search for “Brightline”. You can filter by date and time as well as specify which station you want to book and when you find a time that works, you can book and pay directly on the website. Do I need to be an Industrious member to book a meeting room at a Brightline station? No, Guests can reserve their co-working or meeting space at a Brightline station without being an Industrious member. What are the amenities included when reserving an Industrious meeting room at a Brightline station? Industrious brings its thoughtfully designed, flexible workspaces to Brightline stations. Guests can expect private, quiet meeting rooms with comfortable furniture and other amenities. What if I cancel my reservation? You can cancel your reservation up until 48 hours prior to your meeting via the on-demand portal at industriousoffice.com. You can also find a link to your reservation in your confirmation email. When you cancel you will receive a full refund within 4 - 5 business days If you need to cancel closer than 48 hours in advance, please email brightlingmeetings@industriousoffice.com and our team will manually cancel and refund your reservation. Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Orlando Station in Partnership with Orlando Health Station Details ADDRESS 10705 Jeff Fuqua Blvd, Orlando, FL 32827 STATION HOURS OF OPERATION Mon - Sun: 4:00 AM - 12:15 AM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center West Palm Beach Station Station Details ADDRESS 260 Quadrille Plaza Drive, West Palm Beach, FL 33401 STATION HOURS OF OPERATION Mon - Fri: 4:30 AM - 12:30 AM Sat - Sun: 5:30 AM - 2:30 AM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center Boca Raton Station Station Details ADDRESS 101 NW 4th St., Boca Raton, FL 33432 STATION HOURS OF OPERATION Mon - Thu: 5:00 AM - 12:45 AM Fri - Sat: 5:00 AM - 1:45 AM Sun: 6:00 AM - 11:45 PM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center Fort Lauderdale Station Station Details ADDRESS 101 NW 2nd Avenue, Fort Lauderdale, FL 33311 STATION HOURS OF OPERATION Mon - Fri: 5:45 AM - 12:00 AM Sat - Sun: 6:00 AM - 1:30 AM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center Aventura Station Station Details ADDRESS 19796 West Dixie Highway, Miami, FL 33180 STATION HOURS OF OPERATION Mon - Thu: 6:00 AM - 11:10 PM Fri: 6:00 AM - 12:45 AM Sat - Sun: 5:00 AM - 12:45 AM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center MiamiCentral Station Station Details ADDRESS 600 NW 1st Avenue Miami, FL 33136 STATION HOURS OF OPERATION Mon - Fri: 6:00 AM - 11:00 PM Sat - Sun: 5:00 AM - 12:40 AM Parking Details PARKING HOURS OF OPERATION Daily: Open 24 hrs. CONTACT US Brightline Help Center Offers Contact Help Center Advertise With Us Press Room Speaker Request Travel Advisors Our Company About Us Careers Investor Relations Our Impact Railroad Rail Safety Policies Accessibility Privacy Policy Terms of Service Wi-Fi & Terms & Conditions/FAQs Gift Cards GO SMARTER Download the Brightline app today. © Brightline 2025. All Rights Reserved"
    },
    {
      "url": "https://www.gobrightline.com/press-room/2024/brightline-welcomes-tri-rail-to-miamicentral",
      "text": "Brightline welcomes tri-rail to MiamiCentral Station. Skip to Content Skip to Cookie Banner My Trips Login English Help Center TICKETS & TRAVEL Train Tickets Arrivals Status Departures Status Train Passes Parking Passes Travel Advisors Partnerships Manage Trips Brightline App EXPERIENCE Traveling With Us Baggage Policy Station Experience Onboard Experience Family Travel Accessible Travel Get To/From Station Parking Food & Drink DESTINATIONS City Guide Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Brightline West OFFERS GIFT CARDS REWARDS>> Buy Tickets Menu Press Room 2024 BRIGHTLINE WELCOMES TRI-RAIL TO MIAMICENTRAL January 13, 2024 BRIGHTLINE WELCOMES TRI-RAIL TO MIAMICENTRAL MIAMI (January 13, 2024) – Today, the South Florida Regional Transportation Authority (SFRTA) Tri-Rail began service into downtown Miami at MiamiCentral. For more information on service visit www.tri-rail.com . “We are delighted to welcome Tri-Rail to MiamiCentral, which will provide increased connectivity for our region,” said Patrick Goddard, president of Brightline. “It is exciting witnessing firsthand how the South Florida region is embracing rail travel and taking cars off the road.” MiamiCentral is a unique destination with  transportation options for connecting residents, employees, visitors, and the local community through easily accessible major roadways and rapid  transit options including Metrorail, Metromover, Tri-Rail and Brightline connecting Miami, Aventura, Fort Lauderdale, Boca Raton, West Palm Beach and now Orlando. With millions of guests projected to ride the rails each year, MiamiCentral is transforming South Florida’s urban landscape. Located at Northwest 1st Ave., between Northwest 3rd St. and 7th St. MiamiCentral is the premier business, leisure, dining, and transportation hub with tenants including Joe and the Juice, Chick-Fil-A, Starbucks, Powerhouse Gym, class-A office space and Brooklyn Dumpling Company (summer 2024). The destination creates a focal point among Miami Worldcenter’s 2,000+ residential units and 250,000 square feet of retail, Miami Government Center, Bayfront Park, Mana Common, the Flagler District and Block 55. MiamiCentral is also home to ParkLine Miami and its 816 fully occupied luxury rental residences situated atop the Brightline station and retail space. Office tenants within the encompassing 2MiamiCentral and 3MiamiCentral include Blackstone, Ernst & Young, Uber, Carlton Fields and Viacom. Brightline launched operations in South Florida in 2018, connecting Miami, Fort Lauderdale, and West Palm Beach, with stations in Boca Raton and Aventura opening last year. Construction on the 170-mile extension from West Palm Beach to Orlando began in 2019 and opened for service on September 22, 2023, making it the first intercity passenger rail in the U.S. to open in over a century. # # # ABOUT MIAMICENTRAL MiamiCentral is a 6-block transit-oriented development (TOD) in the heart of Downtown Miami. This transformational project is anchored by Brightline’s Miami Train Station, features 816 luxury residences, 130,000 sf of retail, class-A office space, and unprecedented connectivity to Metromover, Metrorail, and Tri-Rail. With Brightline service to Orlando, MiamiCentral is the first-of-its-kind lifestyle destination for transit, dining, entertainment, living and business. For MiamiCentral leasing information, visit MiamiCentral.com , call 305.532.0433 or contact miamicentral@comrascompany.com . ABOUT BRIGHTLINE Brightline is the only provider of modern, eco-friendly, intercity rail in America. The company currently serves Miami, Aventura, Fort Lauderdale, Boca Raton West Palm Beach and Orlando. Brightline was recognized by Fast Company as one of the Most Innovative Companies in travel, offering a guest-first experience designed to reinvent train travel and take cars off the road. Brightline plans to bring its award-winning service to additional city pairs and congested corridors across the country that are too close to fly and too long to drive, with immediate plans to connect Las Vegas to Southern California. For more information, visit www.gobrightline.com and follow us on Facebook , Instagram , and X . Contact Help Center Advertise With Us Press Room Speaker Request Travel Advisors Our Company About Us Careers Investor Relations Our Impact Railroad Rail Safety Policies Accessibility Privacy Policy Terms of Service Wi-Fi & Terms & Conditions/FAQs Gift Cards GO SMARTER Download the Brightline app today. © Brightline 2025. All Rights Reserved"
    },
    {
      "url": "https://www.gobrightline.com/terms-of-service",
      "text": "Terms of Service | Brightline Skip to Content Skip to Cookie Banner My Trips Login English Help Center TICKETS & TRAVEL Train Tickets Arrivals Status Departures Status Train Passes Parking Passes Travel Advisors Partnerships Manage Trips Brightline App EXPERIENCE Traveling With Us Baggage Policy Station Experience Onboard Experience Family Travel Accessible Travel Get To/From Station Parking Food & Drink DESTINATIONS City Guide Orlando West Palm Beach Boca Raton Fort Lauderdale Aventura Miami Brightline West OFFERS GIFT CARDS REWARDS>> Buy Tickets Menu Terms of Service Terms of Service Safety is our top priority, and we’re also committed to getting everyone to their final destination in a bright state of mind. Please review our terms of service below, which outline our current policies to ensure everyone’s safety and a smooth, safe, bright ride for all. Carriage of passengers Updated September 4, 2025 All travel on, and transactions with Brightline Trains Florida LLC (\"Brightline\" or \"we\" or \"us\" or “our”) are governed by the laws of the State of Florida, without regard to its principles of conﬂicts of law. Passengers and guests agree to submit to the exclusive jurisdiction of any Federal District Court located in the Southern District of Florida, Miami, Florida, and waive jurisdictional, venue or inconvenient forum objections to such courts. Each party waives all rights to trial by jury regarding any dispute that results in litigation and agrees to the terms of the Arbitration Agreement outlined below. We reserve the right to update or revise this agreement at any time without prior notice, and you agree that we may do so. Your purchase of a Brightline ticket and/or continued use of this service following an update to this agreement signiﬁes your acceptance of its revised terms. Tickets & reservations To purchase Brightline tickets, you must be at least 13 years old. A ticket is only valid for carriage, also known as transport, for the ticketed reservation date(s) and time(s). If a passenger does not board the train, the passenger forfeits the train reservation. Boarding begins at approx. 10 minutes prior to the train’s departure time. Boarding closes at our turnstiles five (5) minutes prior to departure. PREMIUM passengers may access the PREMIUM lounge only within 2 hours of their departure(s). PREMIUM lounge access is not permitted upon arrival(s). The PREMIUM lounge provides a complimentary experience while in the lounge. Guests should not remove large quantities of food or beverages from the lounge. Excessive consumption of alcohol and/or excessive removal of food and/or beverages from the PREMIUM lounge may result in fines and/or being denied transport. Only passengers at least 21 years of age, can consume and purchase alcohol. PREMIUM passengers, like all passengers and guests entering and/or residing on our property, agree to, and are required to, abide by Brightline’s Code of Conduct . Access to a station conference room is on a first come, first serve basis for PREMIUM ticket holders and is subject to availability. See our station personnel if interested in booking the room. Reservations are required to travel on our trains. Reservations can be made online at GoBrightline.com, via the Brightline App, or in-station kiosks. Resale and/or transfer of a Brightline ticket is prohibited, and any such resale and/or transfer is void. Any such unauthorized resale and/or transfer will result in cancelation of the ticket and/or refusal of entry to the holder hereof without refund. Tickets are issued for each reservation and are necessary to pass through in-station turnstiles to board the train. Multiple reservations are welcome. If you have an existing reservation, additional reservations for the same day or from the same departure city are limited to every two (2) hours. For tickets purchased and/or issued through third parties, refer to the applicable third-party seller’s terms and conditions. For tickets purchased and/or issued through third parties, refer to the applicable third-party seller’s terms and conditions. Upgrades Upgrades from Smart to Premium can be made up to 5 mins prior to departure by modifying your reservation and selecting the same train departure. Fare difference balance will be due. Upgrades can be made via the website, app or kiosk and are subject to availability. Code of conduct Every guest entering our property is required to abide by our Code of Conduct, agrees to: Standing at least two (2) feet from the edge of the train platform; Not sitting on the train platform; Not walking on or jumping down onto train tracks, including when there is no train in sight; Not forcing train doors open; Allowing passengers to exit the train before boarding; Reporting any unattended packages to a Brightline security officer, or to station or train personnel; Not soliciting—soliciting of any kind is strictly prohibited on our property; Not engaging in disruptive, disturbing behavior, including having loud conversations, using profane language or operating an electric device without the use of headphones; Not obstructing, hindering or interfering with the train crew or any of our personnel in the performance of their duties. Not smoking (including vaping or using e-cigarettes) on any Brightline property including but not limited to parking garages, stations (including outside) and on the trains. In addition to our Code of Conduct, in order to ensure the quality of travel and the safety and security of its passengers, we may refuse to carry passengers, including but not limited to, those: Who have not paid the applicable fare and/or fees; Who presents a Brightline ticket purchased from an unauthorized third party. Any ticket purchased from an unauthorized third party is void. The ticket holder will not be eligible for travel aboard our trains or for a refund; Whose conduct is objectionable (such as, but not limited to, being under the influence of alcohol or narcotics); Who consume alcohol that is not sold and/or distributed by us; Who consume or attempt to consume alcohol under the age of 21 Who have illegal narcotics in their possession; Whose personal hygiene makes them offensive; Who refuses to comply with our dress code. We enforce a dress code to ensure a safe, comfortable space for everyone. Appropriate attire is required; bathing suits are not permitted. Shirtless, bottomless and/or barefoot guests will not be permitted access to our facilities; Who smoke (including but not limited to cigars, cigarettes, and e-cigarettes) in-station or on board. No smoking of any kind is allowed on our property—including stations, trains, parking and other facilities; Who pose a health, safety or security hazard to other passengers, guests or our personnel; Who refuses to comply with our Code of Conduct, safety or security rules or with the instruction of our personnel; Who refuse to comply with federal, state or local laws, regulations or executive orders and/or Brightline policies; Who cannot travel independently, without assistance and would require our personnel to provide personal care services. Who refuse to consent to our security inspections of persons and/or baggage on board our trains and/or designated areas, such as, but not limited to, train platforms; Who write, mark, scribble, deface or vandalize our property in any manner; Who tamper with emergency windows or tools/equipment (unless there is an emergency) or enter, or attempt to enter, any area not open to the public, including but not limited to: locomotive and locomotive cabs; closed-off areas; mechanical or equipment rooms; concession stands or kiosks; storage areas; interior rooms; emergency stairways (except in cases of an emergency); tracks; train yards; depots; or any area marked with a sign restricting access or indicating a dangerous environment. Our personnel or other authorized representatives may remove such a passenger from our property as necessary under the circumstances, for any of the above reasons. Passengers and guests who violate the Code of Conduct or any provision of this section are subject to penalties, including fines and criminal penalties, and may be denied transport and/or access to our facilities. Brightline has partnered with several mobility service providers to provide ﬁrst/last mile transportation solutions for our guests. Guests can book these services directly through our trusted partners. . These services are not provided by Brightline but rather provided by independent contractors, including but not limited to Uber. All of our current offers can be found on our mobility page. As such: Brightline+ ﬁrst/last mile service is subject to our partners’ availability. Not all services may be available at all times and/or locations. Brightline is not responsible for the service provided, including timeliness of the service and cleanliness of the vehicle. Concerns about your experience with these services should be communicated directly to the independent contractor providing the service. Claims related to any of these mobility services should be directed to the independent contractor providing such services. Brightline accepts no liability for the mobility services provided by independent contractors. Should you have a concern about your experience with Brightline trains or booking your ride through the Brightline app or website, please contact Brightline Customer Service at gobrightline.com/help-center . For guests claiming the $10 Uber voucher offer in Premium Brightline provides a $10 Uber voucher per one-way Premium reservation valid for any ride to or from one of our stations from 4 hours before your scheduled train departure to 4 hours after your scheduled train arrival. Rides must be booked directly in guests’ Uber app. Brightline may share information you provide to us with Uber for purposes of facilitating your first/last mile transportation through Uber and in accordance with Brightline’s Privacy Policy which can be found at https://www.gobrightline.com/privacy-policy . By booking your ﬁrst/last mile transportation through on the Uber app, you are agreeing to Uber’s U.S. Terms of Service which can be found at https://www.uber.com/legal/en/document/?name=general-terms-of-use&country=united-states&lang=en . Brightline+ FAQs Expand All What are the benefits of partnering with Uber? A partnership with Uber will expand Brightline+’s fleet and offer access to unlimited vehicles at an affordable rate. How does the service work? Brightline+ has expanded its fleet by providing private rides powered by Uber. After selecting your train and seat, you will be prompted to add an Uber ride to your trip as an extra. Follow the prompts to book your ride to or from our stations, anywhere Uber operates. For Premium guests, UberX ride is complimentary within a 5 mile radius of our stations. Are the Brightline+ branded Teslas going away? Yes. Brightline+ private in-app booking was launched last year to provide guests with a first and last mile option. The success of this service has allowed us to partner with Uber in order to continue meeting demand and expanding our service radius to reach more destinations. What happens to my Uber ride if my train is delayed? If your train is delayed and you miss your Uber ride, please see a Guest Service Agent at our station. Where will my Uber pick me up and drop me off? Ubers will pick up and drop off at the designated Brightline+ areas of each station. These will be identified with Brightline+ wayfinding. Is there a service fee associated with using the Uber service? Brightline does not charge guests a service fee. Guests pay the rate established by Uber for their ride. What are the benefits of booking Uber through Brightline? Brightline+ private rides are powered by Uber. This allows Brightline to facilitate Uber rides on behalf of our guests on the Brightline platform. Your Uber ride is automatically coordinated with train departure and arrival times, will pick you up in time to make your departing train and be waiting for you when you disembark your arriving train. Are the Brightline+ branded Teslas being replaced? Yes. Partnering with Uber expands our fleet of Brightline+ vehicles to best meet rider demand, minimizing wait times, and expanding our service radius to reach more destinations. Can I book Uber pickup from any Brightline station? Yes, Brightline+’s Uber rides are available to be booked to and from all Brightline stations including the new stations in Boca Raton and Aventura from any pick up or drop off location. Will Brightline be partnering with any other entities like Uber? We are excited to be the first intercity, higher-speed rail line in the country to partner with Uber on first and last mile transportation to our stations. As Brightline expands, we will continue to provide first and last mile options tailored to each station. How will I be charged for the service? Rides will be charged as an extra at the time of booking your train ticket. For PREMIUM guests, the fee will be reduced to $0 at the end of the purchasing flow for rides within a 5 mile radius. I am a Premium Brightline guest, how will this affect my free Tesla rides? Premium guests will receive complimentary Uber rides within a 5 mile radius of our stations. If I’m a PREMIUM rider and need to get further than 5 mile radius of our station, what are the options? Premium guests will receive complimentary Uber rides within a 5 mile radius of our stations. Outside of the 5 mile radius, guests will pay the market rate. Why does the website keep saying there are no bookable rides available? Our Brightline+ booking engine is undergoing maintenance to bring you a better way to book and track your rides. Will my Uber be complimentary with my premium pass? Premium guests will receive complimentary Uber rides within a 5mi radius of our stations. Do I have to add a new payment method to use Uber on the Brightline app? Since the guest’s payment information is already saved in the Brightline app, they do not need to link to a separate payment method. Do I have to download Uber to use it with the Brightline app? Brightline customers do not need to have the Uber app on their devices to book an Uber ride. An Uber can be pre-booked directly through the Brightline app during the ticket purchasing process. The option to book an Uber will appear in the “add extras” section. Do you offer transportation to the airport? Yes, guests can now book private Uber rides directly to all airports and ports. In addition, in FLL and MIA, we offer walk up fixed route shuttles to the airport, available on a first come first serve basis, no reservation required. Airport pickups are coming soon! Do you offer transportation to the Port of Miami? Yes, to provide more reliable service at Port Miami and Port Everglades, guests can now book private Uber rides directly to all ports. How will the $15 credit work? Is it per person? For one-way tickets or roundtrip? There is no $15 credit. Premium guests will receive complimentary Uber rides within a 5 mile radius of our stations. The entire cost of the ride will be covered at check out. Will I be able to track and chat with my driver like on the Uber app? Yes. Guests will receive a series of text messages with information about their ride including driver contact information, vehicle information, and a link to track their ride. For guests with the Uber app downloaded on their phones, the tracking link will open in the Uber app. For guests without the app, the tracking link will open in their browser window. For more information, please see our Terms of Service. How close to the time required can I request a ride? Guests may edit their trip to add a ride up until the time they scan their boarding pass at the turnstile, or the time boarding closes, whichever comes first. We recommend scheduling your ride at least 1 hour before you need to be picked up in order to ensure on time arrival. Uber Specific Questions Expand All Will Uber pricing fluctuate for scheduled rides from the price presented in the Brightline app? Pre-booked Uber rides scheduled through the Brightline app or website will honor upfront pricing. What are my options if I reserve a trip for 6 people and cannot fit in an UberX? For up to 6 guests, choose UberXL. For parties of more than 6, please book on separate reservations to ride in multiple cars. Covid-19 travel As of April 19, 2022, Brightline teammates and guests are no longer required to wear masks while onboard or in our stations. The Centers for Disease Control (CDC) continues to encourage those considered high-risk (unvaccinated, medical issues, etc.) to wear masks and the latest CDC guidance can be found here: https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html Since inception, our number one priority has always been the safety of our guests and teammates– a core value we keep top of mind as standards and practices evolve. We remain committed to leading the industry in guest experience and the standard of cleanliness in our stations and trains. We’ve focused on making the experience touch free, cashless and contactless when boarding by scanning the Brightline app for entry. Firearms policy Firearms, ammunition and/or weapons are not permitted on our property to include stations, facilities, garages and trains. Only exceptions to the rule are sworn law enforcement officers. Currently we allow sworn law enforcement officers to carry their firearms on our system. Prior approval is needed in order to do so through the Chief Safety and Security Officer or his/her designee.  A department ID is required for those seeking to carry and will be verified by the Security team at your boarding location. The destination station will be advised that they are on our system to include the specific train, and seat number. We reserve the right to deny this privilege based upon operational needs or increased security protocols on any given day. This policy only applies to South Florida locations (Fort Lauderdale, Miami, West Palm Beach) Since inception, our number one priority has always been the safety of our guests and teammates– a core value we keep top of mind as standards and practices evolve. We remain committed to leading the industry in guest experience and the standard of cleanliness in our stations and trains. We’ve focused on making the experience touch free, cashless and contactless when boarding by scanning the Brightline app for entry. Precaution for those with allergies We are unable to guarantee a peanut-free or allergen-free environment. Guests and passengers with allergies must be able to take all necessary medical precautions including, but not limited to, carrying epinephrine auto-injectors at all times and being knowledgeable on how to self-administer. Prohibited items Weapons of any type (including but not limited to those listed below) are not permitted on our property, including in any station, or on board the train, in either carry-on or checked baggage. Examples of Prohibited Items Firearms to include but not limited to handgun, shotgun, rifle, BB gun and starter pistols. Incendiary devices, including but not limited to: flammable gases; liquids; fuels; fireworks; gunpowder or other explosive devices Canisters, tanks or other devices containing propellants Oxygen equipment for medical reasons is allowed on board (please see safety and security personnel for assistance) Gasoline-powered hand tools Flares or flare guns Batteries with acid that can spill or leak. Such batteries that would power mobility assistance vehicles are allowed. Corrosive or dangerous chemicals or materials, including but not limited to: liquid bleach; tear gas; electronic control devices (stun guns and Taser guns); radioactive or harmful biological material. Mace or Pepper Sprays Sharp objects, including but not limited to: scissors; knives; straight razors; ice picks; axes; and swords. Bow, crossbow and/or arrows Martial-arts and self-defense items, including but not limited to batons, billy clubs, nightsticks, and nunchuks Passengers failing to meet the above-mentioned requirements will be denied transportation. Fares & fees We offer a variety of train fares. Fares vary based on demand, travel class, date, time, fare and other travel preferences. The advertised fare is the lowest available fare at that time. Unless otherwise advertised, tickets are non-refundable for travel in Smart and Premium unless canceled. Smart Saver tickets are non-refundable and eligible for cancelation with a fee. Refunds are provided in the form of a credit. Commitment products such as Monthly Pass or Travel Pack Smart or Premium are non-refundable after the 1st use. New reservations, reservation changes and cancelations handled through the Guest Connections Team may incur a Convenience Fee based on the nature of the new booking, modification or cancelation. Convenience Fee for Ticket Bookings, Modifications, Cancelations SERVICE SMART SAVER SMART PREMIUM New Reservation $25 $25 $25 Ticket Modification N/A $25 $25 Ticket Cancelation $25 $25 $25 Changes to your reservation may affect the fare and fees may apply when tickets are reissued. Smart Saver fares are not eligible for modification. In the event that an erroneous fare is inadvertently published for sale and a ticket is issued at the erroneous fare, we reserve the right to cancel the ticket for a full refund, or upon request, reissue the ticket for the correct fare. Some fares may be discounted with promotional codes or passenger discounts. Promotional and passenger-related discounts cannot be combined. Limit one (1) passenger-related discount per passenger, if and as applicable. Train passes These terms and conditions apply to the purchase and use of 10-Ride Passes: MIA<>WPB/BOC 10-Ride Pass: After purchasing the MIA<>WPB/BOC Pass, ten (10) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, Fort Lauderdale, Boca Raton, and West Palm Beach. Packs expire after ten (10) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. MIA<>FLL 10-Ride Pass: After purchasing the MIA<>FLL Pass, ten (10) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, and Fort Lauderdale. Packs expire after ten (10) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. MIA<>ORL 10-Ride Pass: After purchasing the MIA<>ORL Pass, ten (10) rides will be automatically added to your Brightline account which are valid for sixty (60) calendar days for rides between MiamiCentral, Aventura, Fort Lauderdale, Boca Raton, West Palm Beach, and Orlando. Packs expire after ten (10) rides are used or upon expiration of sixty (60) days after the date of purchase, whichever comes first. For all Brightline Passes, you can save an additional 5% per month when you select auto-renewal when you purchase the Pass. The South Florida Passes (MIA<>WPB/BOC, MIA<>FTL) will auto-renew thirty (30) days after purchase or once all rides are booked. The Orlando Pass will auto-renew sixty (60) days after purchase or once all rides are booked. Passes are subject to availability, are not transferable, and the amount paid for the original Pass may not be redeemed for cash. Passes will only be associated with the Brightline account holder and associated email address it was purchased by. Pass is non-refundable after the ﬁrst use. To purchase a Pass, simply book a trip while logged in to your account and your Pass will be applied at checkout. Passes are not valid for private, premium, travel agents, corporate discounts, or special events; activities that are separately priced; events that require separate admission or are not open to the general public. Rules, Terms of Service, terms and conditions, or beneﬁts or pricing applicable to Passes may be modiﬁed at any time by Brightline, with or without notice. These terms and conditions apply to the purchase and use of 20-Ride Passes: MIA<>WPB/BOC 20-Ride Pass: After purchasing the MIA<>WPB/BOC Pass, twenty (20) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, Fort Lauderdale, Boca Raton, and West Palm Beach. Packs expire after twenty (20) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. MIA<>FLL 20-Ride Pass: After purchasing the MIA<>FLL Pack, twenty (20) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, and Fort Lauderdale. Packs expire after twenty (20) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. For all Brightline Passes, you can save an additional 5% per month when you select auto-renewal when you purchase the Pass. The South Florida Passes (MIA<>WPB/BOC, MIA<>FTL) will auto-renew thirty (30) days after purchase or once all rides are booked. Passes are subject to availability, are not transferable, and the amount paid for the original Pass may not be redeemed for cash. Passes will only be associated with the Brightline account holder and associated email address it was purchased by. Pass is non-refundable after the ﬁrst use.  To purchase a Pass, simply book a trip while logged in to your account and your Pass will be applied at checkout. Passes are not valid for private, premium, travel agents, corporate discounts, or special events; activities that are separately priced; events that require separate admission; or are not open to the general public. Rules, Terms of Service, terms and conditions, or beneﬁts or pricing applicable to Passes may be modiﬁed at any time by Brightline, with or without notice. These terms and conditions apply to the purchase and use of 40-Ride Passes: MIA<>WPB/BOC 40-Ride Pass: After purchasing the MIA<>WPB/BOC Pass, forty (40) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, Fort Lauderdale, Boca Raton, and West Palm Beach. Packs expire after forty (40) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. MIA<>FLL 40-Ride Pass: After purchasing the MIA<>FLL Pack, forty (40) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral, Aventura, and Fort Lauderdale. Packs expire after forty (40) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. Pass rides may be booked by the Brightline account holder who purchased the Train Pass and may be utilized only by the Brightline account holder. All Passes are valid seven days a week. For all Brightline Passes, you can save an additional 5% per month when you select auto-renewal when you purchase the Pass. The South Florida Passes (MIA<>WPB/BOC, MIA<>FTL) will auto-renew thirty (30) days after purchase or once all rides are booked. Passes are subject to availability, are not transferable, and the amount paid for the original Pass may not be redeemed for cash. Passes will only be associated with the Brightline account holder and associated email address it was purchased by. Pass is non-refundable after the ﬁrst use. To purchase a Pass, simply book a trip while logged in to your account and your Pass will be applied at checkout. Passes are not valid for private, premium, travel agents, corporate discounts, or special events;  events that require separate admission; or are not open to the general public. Rules, Terms of Service, terms and conditions, or beneﬁts or pricing applicable to Passes may be modiﬁed at any time by Brightline, with or without notice. These terms and conditions apply to the purchase and use of Miami<>Aventura Commuter Pass “Pass\": Miami<>Aventura Commuter Pass: After purchasing the Pass, forty (40) rides will be automatically added to your Brightline account which are valid for thirty (30) calendar days for rides between MiamiCentral and Aventura.  Pass expires after forty (40) rides are used or upon expiration of thirty (30) days after the date of purchase, whichever comes first. You can save an additional 5% per month when you select auto-renewal when you purchase the Pass. The Pass will auto-renew thirty (30) days after purchase or once all rides are booked. Passes are subject to availability, are not transferable, and the amount paid for the original Pass may not be redeemed for cash. Passes will only be associated with the Brightline account holder and associated email address it was purchased by. Pass is non-refundable after the ﬁrst use; general refund terms apply. To purchase a Pass, simply book a trip while logged in to your account and your Pass will be applied at checkout. Passes are not valid for private, premium, travel agents, corporate discounts, or special events;; events that require separate admission; or are not open to the general public. Rules, Terms of Service, terms and conditions, or beneﬁts or pricing applicable to Passes may be modiﬁed at any time by Brightline, with or without notice. Forms of payment We do not accept cash in-station or on board. We do not accept PIN-based debit cards. For the convenience of our passengers, we accept Brightline credits as well as credit cards from the following merchants: Visa, Mastercard, and American Express. All charges are in U.S. dollars. Brightline credits issued or received for use of our service bear no cash value and are non - transferable. Brightline credits are an accepted form of payment for Brightline reservations, and upgrades. When signed in during booking, Brightline Account Holders can apply available credits and one-way rides to pay for applicable train reservations. We automatically apply active train passes to pay for applicable train reservations for signed in Account Holders. Changes to your reservation may affect the fare and fees may apply when tickets are reissued. In the event that an erroneous fare is inadvertently published for sale and a ticket is issued at the erroneous fare, we reserve the right to cancel the ticket for a full refund, or upon request, reissue the ticket for the correct fare. Some fares may be discounted with promotional codes or passenger discounts. Promotional and passenger-related discounts cannot be combined. Limit one (1) passenger-related discount per passenger, if and as applicable. Fee schedule The following baggage fees will be charged at reservation checkout or at the in-station Guest Services counter upon check in, as applicable. Fees are subject to change without notice and may be waived during limited introductory or promotional periods. Restrictions apply. See policies for details regarding allowances, dimensions, weight and more. General Baggage Fees First Carry-On Bag Dimensions and Weight Limits Smart Saver/Smart Premium Notes Standard size may not exceed 24” x 16” x 10” or 50 linear inches. Standard weight, may not exceed 50 lbs. (22 kg) $0 $0 Please see carry-on baggage policies* Large size, over 50 linear inches in exterior dimensions, but not to exceed 70 linear inches. Or overweight, 51 lbs. to 70 lbs. (23 kg. to 32 kg) $20 $0 Large carry-on bags are only available for travel to and from Boca Raton and Aventura.  Guest must be able to safely transport bags onto train. Allow a minimum of 20 minutes prior to departure for proper screening. Baggage racks are only to be used for large carry-on baggage. Please see carry-on baggage policies* Second Carry-On Bag Limit two (2) carry-on bags per guest Dimensions and Weight Limits Smart Saver/Smart Premium Notes Standard size may not exceed 24” x 16” x 10” or 50 linear inches. Standard weight, up to 50 lbs. (22 kg) $0 $0 Please see carry-on baggage policies* Large size, over 50 linear inches in exterior dimensions, but not to exceed 70 linear inches. Or overweight, 51 lbs. to 70 lbs. (23 kg. to 32 kg) $20 $20 Large carry-on bags are only available for travel to and from Boca Raton and Aventura. Guest must be able to safely transport bags onto train. Allow a minimum of  20 minutes prior to departure for proper screening. Baggage racks are only to be used for large carry-on baggage. Please see carry-on baggage policies* First Checked Bag Advanced Purchase Advanced Purchase Day of Travel Pricing Day of Travel Pricing Stations/Bag Dimensions Smart Saver/Smart Premium Smart Saver/Smart Premium Notes To or from Orlando, West Palm Beach, Fort Lauderdale, Miami Stations. Standard Bags up to 24\" x 16\" x 10\" or up to 50 lbs. $20* $0 $30 $0 *Advanced Purchase price applies to all until 6/15/2025 To or from Aventura station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Boca Raton station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Orlando, West Palm beach, Fort Lauderdale, Miami stations. Large bags, over 24” x 16” x 10” or 50 linear inches in exterior dimensions but not to exceed 33” x 22” x 15” or 70 linear inches. Or overweight, 51 lbs. to 70 lbs. (23 kg. to 32 kg) $40* $40 $50 $50 *Advanced Purchase price applies to all until 6/15/2025 * Aventura and Boca Raton Stations cannot accommodate check baggage . In Aventura and Boca Raton Stations  must use carry-ons for standard, large, or overweight bags. Please ask for assistance once on the train for stowing safely, if needed. * Advanced Purchase Pricing applies to both Premium and Smart and must be booked the prior calendar day (Bookings up to and any time prior to 11:59 pm on the day prior to departure) * Day of Travel Pricing applies to both Premium and Smart and applies to both in station and online purchase the same calendar day as travel (Bookings made at 12:00am or later the same day of departure ) Second Checked Bag Advanced Purchase Advanced Purchase Day of Travel Pricing Day of Travel Pricing Stations/Bag Dimensions Smart Saver/Smart Premium Smart Saver/Smart Premium Notes To or from Orlando, West Palm Beach, Fort Lauderdale, Miami stations. Standard bags up to 24\" x 16\" x 10\" or 50 lbs. $30* $30* $50 $50 *Advanced Purchase price applies to all until 6/15/2025 To or from Aventura station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Boca Raton station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Orlando, West Palm Beach, Fort Lauderdale, Miami stations. Large bags, over 24” x 16” x 10” or 50 linear inches in exterior dimensions but not to exceed 33” x 22” x 15” or 70 linear inches. Or overweight, 51 lbs. to 70 lbs. (23 kg. to 32 kg) $50* $50* $70 $70 *Advanced Purchase price applies to all until 6/15/2025 * Aventura and Boca Raton Stations cannot accommodate check baggage . In Aventura and Boca Raton Stations  must use carry-ons for standard, large, or overweight bags. Please ask for assistance once on the train for stowing safely, if needed. * Advanced Purchase Pricing applies to both Premium and Smart and must be booked the prior calendar day (Bookings up to and any time prior to 11:59 pm on the day prior to departure) * Day of Travel Pricing applies to both Premium and Smart and applies to both in station and online purchase the same calendar day as travel (Bookings made at 12:00am or later the same day of departure ) Third Checked Bag * Advanced Purchase Advanced Purchase Day of Travel Pricing Day of Travel Pricing Stations/Bag Dimensions Smart Saver/Smart Premium Smart Saver/Smart Premium Notes To or from Orlando, West Palm Beach, Fort Lauderdale, Miami stations. Standard bags up to 24\" x 16\" x 10\" or 50 lbs. $60* $60* $80 $80 *Advanced Purchase price applies to all until 6/15/2025 To or from Aventura station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Boca Raton station Not Available Not Available Not Available Not Available Please see carry-on baggage policies.* To or from Orlando, West Palm Beach, Fort Lauderdale, Miami stations. Large bags, over 24” x 16” x 10” or 50 linear inches in exterior dimensions but not to exceed 33” x 22” x 15” or 70 linear inches. Or overweight, 51 lbs. to 70 lbs. (23 kg. to 32 kg) $90* $90* $120 $120 *Advanced Purchase price applies to all until 6/15/2025 * Aventura and Boca Raton Stations cannot accommodate checked baggage please use carry-on for standard, large, or overweight bags. Please ask for assistance once on the train for stowing safely, if needed. * Advanced Purchase Pricing applies to both Premium and Smart and must be booked the prior calendar day (Bookings up to and any time prior to 11:59 pm on the day prior to departure) * Day of Travel Pricing applies to both Premium and Smart and applies to both in station and online purchase the same calendar day as travel (Bookings made at 12:00am or later the same day of departure) Pet Fees Regions Smart Saver/Smart Premium Within and between Miami, Aventura, Fort Lauderdale, Boca Raton, and West Palm Beach $10 $10 Between Orlando and all other destinations $45 $45 View the Pet Policy for terms and conditions . Passenger discounts Our reservations may be discounted with promotional codes or passenger discounts such as customer/corporate programs, pass products, age and/or affiliation, etc. Promotional codes and passenger-related discounts cannot be combined. Limit one (1) passenger-related discount per passenger, if and as applicable. Discounts may vary based on eligibility, travel, fare, route and time of purchase. Additional restrictions may apply. Our passenger discounts may be further discounted based on limited-time promotional periods. Children (3-12) – Ride for 25% Off KIDS RIDE FOR 25% Off (“Kids Offer”) one-way (1) fare per child ages 3-12 year at 25% the prevailing rate for adult tickets, with (1) one qualifying adult priced ticket. Offer applies to one-way SMART class fare rides booked on or after January 1, 2025, through December 31, 2025 (“Offer Period”). All other charges, including, but not limited to, taxes and fees are additional and apply to all guests. Promotion is only applicable for a party of two (2) or more with a maximum of sixteen (16) passengers (adult and kids combined) per reservation. Prices and offers are subject to availability and change without notice and may be withdrawn at any time; group travel restrictions, unaccompanied minors, and other travel restrictions apply. Offer is not combinable with any other offer or promotion, has no cash value, is not redeemable for cash, is not transferable, subject to availability, change without notice and may be withdrawn at any time. Infants (Under 2) – Ride free Infants (age 2 and under) traveling in the lap of an adult (age 13+) passenger ride free. An infant traveling free may occupy a vacant adjacent seat only if the seat is not needed for a fare-paying passenger. Advance notice required. Be sure to add infants to your reservation passenger details. Additional infants under the age of 3 accompanied by an adult traveler require a seat. Changes, cancelations & refunds We will notify the user who made the reservation of any delay or cancelation affecting their reservation. Failure to provide an accurate email address and mobile phone number when making train reservations will result in our inability to communicate directly with users regarding delays, cancelations or other schedule changes. We bear no responsibility to notify users who do not provide an accurate email address. Changes Fees Smart Saver fares are not able to be changed. There are no change fees for Smart or Premium fares. Cancelation policy SMART SAVER tickets canceled at any point up to 30 minutes prior to their scheduled train departure are charged a 90% cancelation fee and 10% of the original value of the ticket will be returned in the form of a credit. SMART tickets canceled more than 48 hours prior to their scheduled train departure are not subject to a cancelation fee and 100% of the original value of the ticket will be returned in the from of a credit. SMART tickets canceled less than 48 hours prior to their scheduled train departure are charged a 50% cancelation fee and 50% of the original value of the ticket will be returned in the form of a credit. PREMIUM tickets canceled more than 48 hours prior to their scheduled train departure are not subject to a cancelation fee and 100% of the original value of the ticket will be returned in the form of a credit, however a credit will not be issued if the ticket was used to enter the PREMIUM lounge at any time. PREMIUM tickets canceled less than 48 hours prior to their scheduled train departure are charged a 50% cancelation fee and 50% of the original value of the ticket will be returned in the form of a credit. Additional refund fees may apply if stated at time of purchase. Cancelations made within 30 minutes of scheduled departure will cancel the entire reservation and are subject to a cancelation fee of 100% of the original value of the ticket.  Non-refundable. In this instance, the passenger will not receive a credit of any amount and will forfeit the value of the ticket. Reservations canceled by Brightline will be automatically rebooked on the next available train(s), when available, at no charge and Brightline credits will be issued to the ticket holder for future use. If the ticket was purchased while signed into a Brightline Account, credits will automatically appear within the account within one (1) business day. If the ticket was purchased while the user was not signed into a Brightline Account, we’ll send an email to the address provided during booking with a link to access your credit upon creating an account. The email will come from Hello@GoBrightline.com —please check your junk mail. If you believe you’re eligible for credits not received, please contact us at Hello@GoBrightline.com with the following information to request a credit: Name(s) on ticket(s), date of reservation and ticket #. Credits issued vary based on the severity of the delay due to cancelation and expire within 90 days of issuance. Upgrade fees are non-refundable. Baggage policy Carry-on Items Up to two (2) carry-on items per passenger are allowed on board our trains, subject to space availability. Each standard size carry-on item must not exceed 50 lbs. (22 kg) in weight and 24” x 16” x 10” (61 x 41 x 25 cm)  or 50 linear inches (127 linear cm) in exterior dimensions. Items must ﬁt comfortably within the overhead luggage area, or under the seat. Tagged large carry-on baggage is to be placed in the baggage tower available in each train coach. (Subject to space availability) Items may not be stored in empty seats, aisles, vestibules or other areas where they present a safety hazard or cause annoyance to other passengers. We will determine in our sole discretion which items may impact the safety, well-being or comfort of other passengers and reserves the right to move or deny the storage of any item. Examples of these items may include garbage bags, cardboard boxes, laundry bags and plastic tubs. Large or overweight carry-on items are accepted for an additional fee - see fee schedule. Large or overweight carry-on items must be checked at the in-station Guest Services counter and tagged 20 minutes prior to the passenger’s train departure time. Large or overweight carry-on items are allowed up to 33\" x 22\" x 15\" (84 x 56 x 38 cm) in exterior dimensions and up to 70 lbs. (32 kg) in weight. You must be physically capable of stowing your item safely in the baggage tower and it must not block aisles, or doors, occupy patron seating or interfere with other patrons or otherwise cause a tripping hazard. Large or overweight carry-on baggage is subject to space availability. Additional small personal items needed for the duration of the trip may be carried on the train and will not count toward the carry-on allowance. Such items include but are not limited to: Required medical devices and containers Pillows, blankets and outer garments Small briefcases and purses Umbrellas (10-15 inches -25-38 cm in length) Non-alcoholic liquids and food The following items are also not counted against the per-passenger limit: Strollers, car seats, booster seats and/or carriers for infants or toddlers. These items must be stowed safely in the luggage baggage tower. Assistive/mobility devices for individuals with a disability. If riding in your wheelchair, be sure to add this to your passenger details when booking rides. Wheelchairs can also be checked at Guest Services with no charge. Excess baggage or baggage exceeding the weight and dimension limits will be handled as checked items and may will be subject to a fee. Please refer to the fee schedule . Musical Instruments Musical instruments may be carried on board as part of a passenger’s carry-on allowance and may not exceed 64\" in height. We disclaim liability for instruments traveling as checked items. Medical Devices Required medical devices may accompany a passenger without fee and will not count toward the passenger’s carry-on allowance. Specifically, oxygen equipment transport is only permitted for passengers with a medical necessity and under the following conditions: The equipment is able to operate a minimum of two (2) hours without electrical power (in the event of a power disruption); Equipment is listed as Underwriter’s Laboratory (UL) or Factory Mutual (FM); The total weight of all tanks needed does not exceed 100 lbs. (45 kg). Checked items At most of our stations, bags can be checked to your destination. Fees may apply for additional checked items—see fee schedule . Checked baggage is subject to space availability. Items may not exceed 70 lbs. (32 kg.) and 33\" x 22\" x 15\" (84 x 56 x 38 cm) or 70 linear inches (178 linear cm) in exterior dimensions. Overweight baggage is defined as baggage between 51–70 lbs. No baggage in excess of 70 lbs. (32 kg) will be accepted. View fee schedule for overweight fees. One (1) wheelchair per ticketed passenger can be checked at Guest Services at no charge. Advance notice required; be sure to add to your reservation passenger details. Passengers may also choose to ride in their wheelchair. Baggage must be checked at the in-station Guest Services counter no less than 30 minutes prior to the passenger’st rain departure time. No baggage will be accepted any earlier than four (4) hours prior to departure. Baggage cut-off times are implemented to ensure baggage arrives on time to its destination. Passengers must present their items to our Guest Services team for check-in no later than the stated cut-off times. Passengers with checked items will be issued a baggage claim ticket. Baggage will be tagged with the corresponding passenger information and destination for easy retrieval at your arrival station. Be sure to personally carry-on any important documentation (passports, Visas, I.D.), valuables, medications and items which require special handling. We reserve the right to refuse items whose size, weight or character makes it unsuitable for transportation on the train. Checked baggage will be accepted for transportation only on trains in which a passenger is traveling. All baggage (checked and carried-on) is subject to inspection by our qualified security officers. Effective 4/13/2024, for guests utilizing the Princess Cruises \"Rail to Sail\" Baggage Direct service for checked baggage, the following terms and conditions apply: Currently “Rail to Sail” Baggage Direct service is only available to Princess Cruise guests traveling between leaving from the Orlando or West Palm Beach train stations and traveling to the Fort Lauderdale train station.   Guests utilizing the “Rail to Sail” Baggage Direct service must book a Brightline train ticket that will ensure arrival to the Brightline Fort Lauderdale station no later than 2 p.m. Guests traveling from the Orlando train station must drop off their baggage at the Guest Services Desk prior to 9:30am.  Baggage that is dropped off after this time will not be eligible for “Rail to Sail” Baggage Direct service and will have to be carried on to the train by the guest.  Guests must attach their Princess Cruises baggage tag to each piece of luggage prior to arrival at the Orlando or West Palm Beach Brightline stations for proper identification of baggage for delivery to stateroom. Guests without a Princess Cruises baggage tag must request one from the Guest Services desk at the Orlando or West Palm Beach stations.  On arrival back to Port Everglades, guests must reclaim their baggage and clear US Customs and then are required to drop off their baggage to the Princess Cruises representative at Port Everglades prior to boarding transportation back to the Fort Lauderdale train station. Guests must book a Brightline train ticket that departs the Fort Lauderdale station after 12 p.m. on debarkation day. Transportation between the Brightline Fort Lauderdale station and Port Everglades will be provided by Princess Cruises.  Guests must present their cruise documents to the Princess representative at the time of boarding transportation for verification. In addition to Brightline’s Terms of Service, guests utilizing the “Rail to Sail” Baggage Direct service acknowledge and are subject to Princess Cruises’ terms and conditions which can be found at: https://www.princess.com/en-us/legal/passage-contract/plc Baggage liability We disclaim any liability for damaged baggage or other items traveling on board our trains even if our personnel have assisted in the loading or unloading of such items/baggage. We are not responsible for checked baggage containing electronics, music instruments, cash, cash equivalents, jewelry or prescription medicine. We do not assume liability for the following items on board the train whether they are being transported as checked or carry-on items, and regardless of whether we were informed or should have known of the presence of such items. If any such items are lost, damaged or delayed, passengers will not be entitled to any reimbursement under our standard luggage liability, or under any declared excess valuation. Items include, but are not limited to: Antiques; artifacts; artwork; books and documents; china; computers and other electronic equipment; computer software; musical instruments; fragile items (including child/infant restraint devices such as strollers and car seats); eyeglasses; prescription sunglasses; non-prescription sunglasses and all other eyewear and eye/vision devices whether lenses are glass, plastic, or some other material; furs; heirlooms; keys; liquids; medicines; money; orthotics; surgical support devices; perishable items; photographic, video and optical equipment; precious metals, stones or jewelry; securities and negotiable papers; silverware; samples; unique or irreplaceable items or any other similar valuable items. Passengers with disabilities traveling with wheelchairs or other mobility devices are exempt from liability restrictions for loss or damage to these items. If damage is caused by us, such items shall be repaired or replaced, up to the actual replacement cost for the item. We assume no liability for minor damage to checked baggage such as scratches, scuffs, stains, dents, cuts and dirt resulting from normal wear and tear. We assume no responsibility for damage to or loss of protruding baggage parts such as wheels, straps, pockets, pull handles, hanger hooks or other items attached to the baggage. We assume no liability for any indirect, consequential, incidental, punitive or special damages resulting from loss, damage or delayed delivery of checked or transferred baggage, including, without limitation, damages for lost revenue or profits, loss of use or business interruption. We may disallow any claim for loss or damage which contains misrepresentations, including false statements concerning whether the passenger or guest has made previous claims with us. We may also disallow claims when the passenger or guest fails to provide proof of loss in the form of receipts of purchase or comparable evidence of loss. Legal action premised on or related to damage, delay or loss must be commenced within 30 days of the date of the incident. Missing, lost or delayed items Non-perishable items lost in stations or onboard must be reported to us within 24 hours. Perishable items found onboard or in stations will be discarded immediately. Lost and Found items will be retained for a period of 90 days. Items missing from checked baggage must be reported to us within 24 hours of the receipt of the bag. Please visit Ileftmystuff.com to report an item lost on board or in one of our stations within 24 hours, although we recommend that all passengers endeavor to report the lost/delayed bag or item within one (1) hour of the passenger’s arrival at their destination. Enter the Brightline client identification number, 12342 and complete the form to file your report. If your item is found, you will receive an email with details on how to retrieve your item. Reports are kept on file for 90 days. Our liability for loss of checked baggage or lost items within the checked baggage is limited to the actual value of the item or $500, whichever is less. Passengers experiencing a delay of checked baggage longer than eight (8) hours may be reimbursed for immediate necessity items such as clothing, toiletries and medicine, in an amount up to $100 per day for a maximum of five (5) days. Failure to report delayed or damaged baggage or missing contents within the prescribed time limit of 24 hours releases us from liability. All baggage and lost and found items not retrieved by passengers will be disposed of in accordance with Florida state law. Sports equipment Each passenger is limited to one (1) of each type of sports equipment, regardless of choice in stowage (carry-on or checked). Availability is based on a first-come, first-serve basis. Please check at the guest relations desk to confirm. Some equipment items can only be checked. Subject to availability. To bring sports equipment, be sure to add the appropriate item to your reservation details and choose whether you’ll carry-on or check the item. Carry-on items are to be stowed in the coach baggage tower. Fees may apply—see fee schedule . Large bicycles and e-Bikes are not permitted. This includes fully assembled bikes and e-bikes.  Our trains are not equipped to carry fully assembled bicycles safely – not even as a checked item. Surfboards, skis and water skis are not permitted (carry-on or checked) as they generally exceed our 70 linear inch policy Scooters and folding bikes under 48” in length and 30” in height are allowed and must be stowed in the baggage tower as one of your carry-on items. Folding bikes and scooters must be folded if designed to do so, and safely stowed while on the train and must not block aisles, or doors, occupy patron seating or interfere with other patrons or otherwise cause a tripping hazard.  Additional fees may apply for large or overweight equipment. Additional fees may apply as a checked item. Motorcycles and motor scooters are not accepted for transport. Carry-On Restrictions: The size of general sports equipment traveling as a carry-on may not exceed 70 linear inches (178 linear cm) or weigh more than 50 lbs. (22 kg). Checked Restrictions: The size of general sports equipment traveling checked may not exceed 70 linear inches (178 linear cm.) or weigh more than 50 lbs. (22 kg). Fees may apply—see fee schedule . Folding bicycles may be transported as checked baggage. The bike must be presented for transport in a bicycle container otherwise we assume no liability and may not exceed 70 linear inches (178 linear cm). Golf equipment may be transported as a large carry-on (subject to space availability) or  checked baggage. It must be presented for transport in a full-length protective case or cover.bag that includes a cover to prevent golf clubs from falling out  and may not exceed 70 linear inches (178 linear cm). Empty scuba gear may be transported as checked baggage. Passengers traveling with a regulator valve must ensure that it is completely disconnected from the cylinder and the cylinder must have an opening to allow visual inspection. The maximum size cannot exceed 70 linear inches (178 linear cm) or weigh more than 50 lbs. (22 kg). Animals in station & on board Pet Policy Dogs and cats are welcome and must be leashed at all times when in the lobby or around the exterior of our stations—a pet relief area is available outside our West Palm Beach and Fort Lauderdale stations. Pets must stay securely inside a carrier or crate in all areas past security, including all lounge areas and onboard the train. Dogs and cats are the only pets that are permitted to travel on our trains. Passengers must provide advance notice that they will be traveling with a dog or cat. Be sure to add the appropriate animal to your reservation passenger details. Failure to add your dog and cat to your reservation at least 10 minutes prior to departure may result in refusal to allow your pet on the train. Fees may apply—see fee schedule . Our personnel may inquire as to whether the pet has been added to the reservation passenger details. Carry-on restrictions Adults (13+) may bring one (1) pet per passenger. Carry-on pets may only travel inside a closed, approved hard or soft sided, leak proof pet carrier as follows: If the pet is traveling in an approved pet carrier under your seat (or on your lap), the size of the carrier may not exceed 17\" x 10\" x 10\". You can travel with your pet carrier/kennel and 1 personal item, but you will not be permitted to bring a carry-on bag in addition to a pet carrier and a personal item. Carry-on pets must be at least eight weeks old and be odorless, harmless, not disruptive and require no attention during travel. Brightline does not allow pets to travel as checked baggage; pets must travel with a guest. Each passenger is responsible for the care and supervision of the pet they are traveling with. Pets must stay securely inside a carrier or crate in all areas past security, including all lounge areas and onboard the train. Brightline maintains the right to refuse acceptance and may remove any disruptive or aggressive pet from stations or trains. Please know that we do not have carry-on pet carriers available for rent. A limited quantity may be available for purchase. Additional fees apply. Service animals We accept service animals accompanying persons with disabilities at no charge. We require advanced notice if you will be traveling with a service animal. Passengers traveling with service animals are required to add the service animal to their reservation passenger details. A service animal must sit under the passenger’s seat, at his or her feet, or on the passenger’s lap. For safety reasons, service animals are not permitted to sit in the aisle or in an empty seat. The service animal may not obstruct an aisle or other area used for emergency evacuations and should comfortably be able to sit under the seat, at the passenger's feet or on the passenger’s lap. Should the presence of the service animal be required by a passenger for the equal use and enjoyment of any of our facilities, accommodations will be made for the service animal to remain by its owner. Our personnel may inquire as to whether the service animal has been added to the reservation. If the service animal is disruptive or uncontrollable, we may require the passenger to remove the animal from the train or property. The passenger must keep his or her service animal leashed, harnessed or tethered while on the train or on our property, unless these devices interfere with the service animal’s work or the person’s disability prevents use of these devices. In that case, the person must use voice, signal or other effective means to maintain control of the service animal. Pets and Animals Not Considered Service Animals The following types of animals are considered pets (not service animals) and are welcome on Brightline if they fit into our carry-on pet guidelines as outlined above: Comfort Animals: Animals not trained to perform a specific task, but which are said to provide emotional support or to relieve anxiety simply by their presence (for example, by the passenger holding or stroking the animal). Search and Rescue Dogs: Animals that are trained generally, but not to assist a particular passenger. Unaccompanied minors Minors under 13 years old may not travel unaccompanied. They must travel with another passenger who is at least 18 years old.  Children ages 13 and above may ride alone, but we strongly suggest that they carry identification showing their name, address, home phone number and the name and phone number of the person who will be meeting them. Brightline takes no responsibility for assuring that unaccompanied minors board the train or detrain at their destination. Only children 12 and under are eligible to receive a Children's fare discount. Parking Addresses Miami Station Owner: 3MC Parking LLC Parking Operator: Universal Parking Address: 161 NW 6th Street, Miami, Florida 33136 Aventura Station Owner: Brightline Trains Florida Parking Operator: SP+ Corporation Address: 19796 W Dixie Hwy Street, Miami, FL 33180 Fort Lauderdale Station Owner: DTS FLL Parking LLC Parking Operator: SP+ Corporation Address: 101 NW 2nd Ave, Fort Lauderdale, FL 33311 Boca Raton Station Owner: Brightline Trains Florida Parking Operator: SP+ Corporation Address: 350 NW 4th Street, Boca Raton, FL 33432 West Palm Beach Station Owner: WPB Rosemary LLC Parking Operator: SP+ Corporation Address: 511 Evernia Street, West Palm Beach, FL 33401 Orlando Station Owner: Greater Orlando Aviation Authority Parking Operator: Greater Orlando Aviation Authority Address: 10705 Jeff Fuqua Blvd, Suite 3546, Orlando, FL 32827 Parking validation Vehicles used by our employees, vendors and visitors and others who park at non-metered locations must be registered with us prior to entering the Garage and using our marked parking spaces. Registration can be completed through our HR department or through designated administrative staff charged with registering visitor and vendor vehicles for individual departments. Registration of vehicles, assigned parking or reserved parking Registration of the vehicle’s license plate information is required for any vehicle parked in the Garage. Owner reserves the right to issue and require each vehicle operator to display a Parking Hang Tag (“PHT”) and/or a parking decal (“Decal”) on the applicable vehicle in addition to collecting license plate and/or other vehicle information. The registration of the vehicle’s license plate information and/or the display of an issued PHT and/or Decal, as required by Owner, grants the vehicle’s operator a license to park in the Garage, conditioned on the timely payment of parking fees and any additional charges that may be due, and compliance with these Rules and Regulations and the rules and regulations promulgated by Parking Operator, as amended from time to time. Owner reserves the right to cancel parking privileges at any time, due to the vehicle operator’s failure to abide by these Rules and Regulations and/or the rules and regulations promulgated by Parking Operator, as amended from time to time, and/or other related violations. The registration of the vehicle’s license plate information and/or the display of an issued PHT and/or Decal, as required by Owner, will allow a vehicle’s operator access to and from the Garage. In the event that a PHT is issued, a vehicle’s operator will be solely responsible for the cost to replace any lost, stolen or damaged PHT. The vehicle’s operator must contact Parking Operator to purchase a replacement PHT. In no event will Owner or Parking Operator be responsible for value, loss or costs incurred, or for the inability of a vehicle’s operator to use the Garage, due to lost, stolen, damaged, or defective PHT, nor shall parking fees be prorated, refunded, or otherwise reduced by reason thereof. In the event that a Decal is issued, the Decal must be applied to the rear window or rear bumper of the vehicle operator’s vehicle. The vehicle operator will be solely responsible for the cost of replacement Decals. The vehicle operator must contact the Parking Operator to purchase replacement Decals. In no event will Owner or Parking Operator be responsible for value, loss or costs incurred, or for the inability of a vehicle’s operator to use the Garage, due to lost, stolen, damaged, or defective Decal, nor shall parking fees be prorated, refunded, or otherwise reduced by reason thereof. Parking privileges may not be transferred, assigned, or resold. Parking is available throughout the Garage on multiple floors. Oversized vehicles with Disabled Parking Permits have access to four spaces on the first floor, on a first come, first served basis. Owner and Parking Operator shall attempt to accommodate the needs of vehicle operators with vehicles requiring electric charging but make no commitment and/or guarantee that electric power for charging is available. Unauthorized use of electrical outlets anywhere in the Garage will result in the loss of parking privileges. Parking enforcement Failure to abide by any of the provisions of these Parking Garage Rules and Regulations shall be considered a parking infraction. The Parking Operator or Parking Owner may penalize such parking infractions through use of warnings, citations and fines, vehicle immobilization (Booting), towing and any other means authorized by applicable law. 1. Vehicles are subject to towing or to immobilization at vehicle owner’s expense for the following violations: Unauthorized use of parking credentials Parking or access to deck by fraud Blocking traffic, crosswalks, sidewalks, or disabled ramps Unauthorized parking in a reserved space 2. Towing or Booting fees vary according to regulations, type of vehicle, location and company. If a third-party towing or booting company is used, the charge will be contingent upon the company's fees. Vehicle owners will be charged a fee for release from immobilization. Immobilized vehicles may be towed if no arrangements have been made for their release within 24 hours following immobilization. Vehicle owner shall be solely responsible for all associated expenses. 3. A vehicle will be considered abandoned if it has been in the same place for longer than seven (7) days. If traveling for business, please notify the Parking Operator in advance by emailing mcparking@universal.com. 4. Enforcement hours: Metered and assigned parking is enforced 24 hours a day, seven (7) days a week, 365 days a year, including weekends and holidays unless otherwise indicated by signage. Parking - prepay When making a Brightline reservation, user has the option to pre-pay for parking by choosing a flat daily parking rate or a Monthly Parking Pass . Purchase of a monthly parking pass through us is limited to Brightline Account Holders. Users must be signed into their account to purchase a monthly parking pass. Vehicle license plate information is required at time of purchase.  Daily parking purchased with a Brightline train reservation is subject to our cancelation policy . Vehicle license plate information is required at time of purchase. Daily parking purchased through Parking Operator is subject to Parking Operator's cancelation policy . 3 Miami Central Garage Parking in this facility gives you the license to park one vehicle in a designated area at your sole risk and at posted rates. Any car parked at this facility is parked at the car owner's sole risk. Operator and Property Owner do not guard or assume care, custody, or control of your vehicle or its contents and are not responsible for fire, theft, damage or loss of any kind. The car owner or operator alone is responsible for parking, locking and otherwise securing the car. Only a license to park is granted hereby and no bailment is created. No employee of the Operator or the Property Owner may modify or waive any of the terms set forth above. Parking of the car by the owner or operator evidences their acceptance of all the foregoing terms of parking in this facility. The parking or entry of bicycles, scooters and motorcycles is prohibited. This is a non-smoking facility. Smoking within the confines of this garage is not permitted. Unauthorized parking in a reserved space or a space designated for disabled persons is prohibited without an appropriate permit, placard, or license plate. The posted speed limit in all areas of the garage is a maximum 5 MPH. Parking outside the marked lines of a single space or in a manner that obstructs the drive aisles, or any area not designated as parking is prohibited. Parking in areas closed by the use of traffic corners or other traffic control devices is prohibited. The washing, servicing, maintaining, or repairing of any motor vehicles inside the garage, except for emergency repairs and for service approved by the garage manager is prohibited. The soliciting of customers or distribution of posters, handbills, or flyers inside the garage is prohibited. Payment must be made immediately upon entry to this facility. Electrical vehicle charging stations are available on the 3rd floor on a first come, first served basis. Unauthorized use of electrical outlets anywhere in the garage could result in fines and/or towing. Storing vehicles in this garage is strictly prohibited. Vehicles with dust, no plates, or stored for over (7) days in the same parking spot, are considered abandoned and WILL BE TOWED regardless of monthly parking pass status. This garage is not a storage facility. The Garage Manager shall have no obligation to issue warning citations for most minor or first-time infractions. If Garage Manager elects to issue warning citations for a particular infraction, Garage Manager shall not be required to issue a warning citation for subsequent infraction(s) prior to taking enforcement action. Vehicles are subject to towing and vehicle immobilization at the customer's own expense for nonpayment of parking fee or any of the infractions above. A fee will be assessed to the customer for vehicle immobilization release. Rules & Regulations Garage hours shall be as posted in the Garage. Owner shall have the right to change hours of operation of the Garage from time to time. Parking spaces may be used only for parking automobiles. No parking of scooters or motorcycles is permitted. All directional signs, arrows and lane markings must be strictly observed. The speed limit shall be 5 miles per hour (mph) or as otherwise posted. Any malicious use or use of parking privileges to grant access to any unauthorized users of the Garage shall result in immediate loss of parking privileges with no credit or refund. All vehicles parked in the Garage must be in working, “road-worthy” condition and properly registered and insured in accordance with all applicable laws. All vehicle operators are required to comply with applicable law in the use of the Garage. Parking is permitted only in spaces that are NOT designated as “Office Parking Only”, in accordance with the posted signs. The absence of a “No Parking” sign does not mean parking is permissible in any other area. Parking privileges may be canceled, in Owner’s sole and absolute discretion, in the event that any vehicle is brought into the Garage by any parker that is damaged and has the potential to damage other vehicles located in the Garage. The following practices are prohibited and may result in the loss of parking privileges: (a) Parking in areas designated as “Office Parking Only” or “Residential Parking Only.” (b) Parking a vehicle in the Garage without a valid permit (c) Unauthorized use of an electrical outlet anywhere in the Garage (d) Double-parking (e) Parking beyond the painted lines of a single space (f) Unauthorized parking in a reserved space or a space designated for disabled persons (g) Parking on sidewalks, curbs, crosswalks, or in driveways, roadways, or other areas that are not designated for parking (h) Obstructing drive lanes or spaces (i) Parking in driveways, roadways, ramps, cross-hatched areas, areas not striped for parking, aisles, areas where “no parking” signs are posted, loading zones, or such other areas as may be designated by Owner or Parking Operator (j) Parking in a manner or a place that obstructs traffic or blocks parked vehicles (k) Parking in areas or spaces closed by use of traffic cones or other traffic control devices (l) Washing, servicing, maintaining or repairing of any in motor vehicles inside the Garage, except for emergency repairs and for service approved by Owner or Parking Operator (m) Soliciting or distributing posters, flyers, or handbills (n) Scooter and motorcycle parking Neither Owner nor Parking Operator shall have any obligation to issue warning citations for any infraction of these Rules or Regulations. If Owner or Parking Operator elects to issue a warning citation for a particular infraction, neither shall be required to issue a warning citation for any subsequent infraction prior to taking enforcement action. Continued infractions may result in the loss of parking privileges. At all times, use of Garage is at a vehicle operator’s own risk and responsibility. Vehicle operators must assure that unattended vehicles are locked at all times and are urged to keep valuables out of sight. Neither Owner nor Parking Operator is responsible for damages or losses. Operating a business including but not limited to car washes, car rentals, car share, and other vehicle hosting operations are strictly prohibited and will result n immediate towing at the owner's expense. Seating Seating is assigned on all of our trains. Passengers traveling to or from Orlando on SMART tickets or any city pair on PREMIUM tickets may change their seat assignments without charge. Passengers traveling to or from Orlando in SMART Saver may not change their seat assignments and will be automatically assigned seats. Passengers traveling within South Florida in SMART will be automatically assigned seats. The automatic assignment of seats is made without regard to race, color, gender, creed or national origin. If you want to edit your seat, passengers traveling to or from Orlando on SMART fares or on PREMIUM fares are welcome to do so during the booking process and after tickets have been issued. Editing seating is no longer available after the passenger scans through the turnstiles. Editing seats for Orlando on SMART fares and PREMIUM travel is subject to availability and free of charge. We offer large, hand-stitched leather seats that recline for your comfort alongside full windows on our trains. Passengers have the option of sitting two (2) together or four (4) together at a table in SMART. PREMIUM also offers the option of sitting two (2) together or in individual seats. Passengers can ride forward facing or backward facing. Passengers also have the choice of riding in their wheelchair—advance notice required; be sure to add to your reservation details. We will monitor seating of passengers to ensure compliance with the following policies: Each fare-paying passenger has an assigned reserved seat and is required to sit in that seat; Passengers are not permitted to occupy any additional seats other than number of seats on their reservation. Failure to comply may result in the passenger being denied transport. We reserve the right, whenever operational conditions require, to transfer passengers from one coach or train to another prior to departure and en route. Force majeure event We may, in the event of a force majeure event, without notice, cancel, terminate, divert, postpone, delay any train or the right of carriage without liability. Without prejudice to any of our rights, we reserve the right, in the case of a force majeure event, at our sole discretion and without the legal obligation, to issue a refund or a credit for future travel to a ticketed passenger. The refund will be made to the original form(s) of payment in accordance with refund rules for any unused portion of the ticket. Force Majeure Event means: Any condition beyond our control including, but without limitation: meteorological conditions; acts of nature; rail accidents; riots; civil commotion; embargoes; wars; hostilities; or disturbances—actual, threatened or reported. Also, because of any delay, demand, circumstances or requirement due, directly or indirectly to such conditions, or Any strike, work stoppage, slowdown, lockout or any other labor-related dispute involving or affecting our services, or Any government regulation, demand or requirement, or Any shortage of labor, fuel or facilities of ours or others, or Any fact not reasonably foreseen, anticipated or predicted by us Disclaimer of liability Our fares, train schedules, equipment, routing, services and information (hereinafter “our services”) are not guaranteed and are provided “as is” without any warranties of any kind, either express or implied, and we disclaim all warranties, express or implied. We further specifically disclaim liability for any inconvenience, expense, or damages, incidental, canceled or punitive, lost profits, loss business or otherwise, resulting from errors in its timetable, shortages of equipment, or due to canceled or delayed trains. We also disclaim any liability for the products and/or services of our advertisers, business partners, independent contractors, sponsors, suppliers, licensors, vendors, agents or other third-party information posted on our website and via other forms of communication to the extent permissible under the law. We shall only be responsible for the rail transportation services, and products and services that it directly provides. We make no representations that any third-party information is without errors or omissions and encourages users to contact third-party providers for up-to-date information. Google Play and the Google Play logo are trademarks of Google LLC. Apple and the Apple logo are trademarks of Apple Inc. registered in the U.S. and other countries and regions. App Store is a service mark of Apple Inc. Arbitration Agreement PLEASE READ THIS SECTION CAREFULLY – IT MAY SIGNIFICANTLY AFFECT YOUR LEGAL RIGHTS. YOU AND BRIGHTLINE AGREE TO GIVE UP ANY RIGHTS TO LITIGATE CLAIMS IN A COURT OR BEFORE A JURY OR TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE ACTION WITH RESPECT TO A CLAIM. OTHER RIGHTS THAT YOU WOULD HAVE IF YOU WENT TO COURT, SUCH AS ACCESS TO DISCOVERY, ALSO MAY BE UNAVAILABLE OR LIMITED IN ARBITRATION. WE BOTH AGREE TO ARBITRATE You hereby agree that any dispute between you and Brightline and its agents, employees, ofﬁcers, directors, principals, successors, assigns, parents, subsidiaries or afﬁliates (collectively for purposes of this section, “Brightline”) arising from or relating to any aspect of the relationship between you and Brightline (collectively, \"Covered Disputes\") will be resolved by binding arbitration or in small claims court. You and Brightline each also agrees that the Agreement and the enforceability of this dispute resolution provision is governed by the laws of the State of Florida. WHAT IS ARBITRATION: Arbitration is more informal than a lawsuit in court and seeks to resolve disputes more quickly. Instead of a judge or a jury, the case will be decided by a neutral arbitrator who has the power to grant whatever relief would be available in court under law or in equity, but court review of an arbitration award is limited. PRE-ARBITRATION PROCEDURES. Prior to initiating any arbitration, you must ﬁrst give us an opportunity to resolve your claim by sending an individual written description that describes in detail the individual damages that you claim to have suffered by e-mail to hello@gobrightline.com with “Legal Dispute” appearing in the subject line. We agree to endeavor to settle amicably by mutual, good faith discussions any Covered Disputes. If we are unable to resolve your claim within 60 days despite those mutual discussions, then either you or we may start arbitration or small claims court proceedings. A court, not an arbitrator, will decide whether this condition precedent has been satisﬁed. ARBITRATION PROCEDURES. To begin arbitration, you must send a letter requesting arbitration and describing your claim to hello@gobrightline.com with “Legal Dispute” appearing in the subject line and to the American Arbitration Association (“AAA”). The arbitration of all disputes will be administered by the AAA under its Consumer Arbitration Rules in effect at the time the arbitration is commenced, except to the extent any of those rules conﬂicts with our agreement in these Terms, in which case these Terms will govern. The AAA rules are available at www.adr.org. If the claims asserted in any request or demand for arbitration could have been brought in small claims court, then either you or Brightline may elect to have the claims heard in small claims court, rather than in arbitration, at any time before the arbitrator is appointed, by notifying the other party of that election in writing. Upon ﬁling of the arbitration demand, Brightline will pay or reimburse all ﬁling, administration, and arbitrator fees. Notwithstanding the foregoing, if any claim asserted in an arbitration demand is deemed to be frivolous, the defending party shall be entitled to recover its attorneys’ fees and any ﬁling, administration, and arbitrator fees incurred. NO CLASS ACTIONS. Brightline and you agree that any Covered Dispute will be submitted to arbitration on an individual basis only. Neither Brightline nor you are entitled to arbitrate any Covered Dispute as a class, representative or private attorney action and the arbitrator(s) will have no authority to proceed on a class, representative or private attorney general basis. If a court or arbitrator determines in an action between you and us that any part of this class action waiver is unenforceable with respect to any claim, the arbitration agreement and class action waiver will not apply to that claim, but they will still apply to any and all other claims that you or we may assert in that or any other action. WAIVER OF JURY TRIAL. If a claim proceeds in court rather than through arbitration, YOU AND Brightline EACH WAIVE ANY RIGHT TO A JURY TRIAL. In any circumstances where the Agreement to Arbitrate Disputes permits the parties to litigate in court, then such dispute between us arising under the Terms or your misuse of the Brightline Online Services will be subject to the jurisdiction and venue of the state and federal courts located in Miami, FL. In-station purchases Brightline’s in-station MARKTs offer checkout-free shopping, powered by Zippin.  Upon entering the MARKT, you must tap a valid credit card for use in paying for purchases. Our technology determines the items you take, and you agree to be charged for each item taken.   Receipts are available upon request, and refunds will be issued for items which are spoiled or items for which you were charged but did not take.  To request a receipt or a refund, please visit www.gobrightline.com/help-center . Disputes concerning purchases will be handled by Brightline, as opposed to Zippin. Gift Cards Terms and Conditions for the Gift Cards The terms and conditions below govern the issuance and use of the Brightline Gift Cards (“Card” or “Cards”).  By accepting and using the Card, you agree to be bound by the terms and conditions outlined below and contained in Brightline’s Terms of Service. Card Redemption. Cards are redeemable only for purchases of transportation products and services offered by Brightline Trains Florida, LLC on gobrightline.com or within the Brightline Trains iOS and Android apps, excluding food and beverages and other on-board and in- station purchases. Cards are also not redeemable to purchase another Card. Cards have no cash value and may not be redeemed for cash (except as required by law). Cards have no value until activated. Cancelations of transportation products purchased with a Card are governed by the terms contained above in the Cancelation Policy Section of these Terms of Services.  Brightline Trains Florida, LLC reserves the right to refuse to honor, or to suspend or deactivate a Card (a) in the event of a disputed credit card charge, bounced check or other failure of consideration or (b) where Brightline suspects that the Card was obtained fraudulently, in violation of this Agreement or in violation of applicable laws or other applicable terms and conditions. Card Purchase. Cards can be purchased online at gobrightline.com or through select third-party retailers. Purchasers must be at least 18 years old. Online Sales. You may purchase electronic Cards online via the following website: https://gobrightline.cashstar.com/store . You acknowledge and understand that Cards purchased on the Website are sold by CASHSTAR, which is not affiliated with Brightline. Any dispute related to an online purchase of a Card sold by CASHSTAR should be directed to CASHSTAR by navigating to https://gobrightline.cashstar.com/self_service 24 hours a day, emailing gobrightlinesupport@cashstar.com or calling (844) 213-6477 8:00am to 9:00pm ET, 7 days per week. Balance Inquiry. For balance inquiry, visit www.gobrightline.com . The balance you receive when inquiring is an estimate only. In most cases, the balance is adjusted immediately when you make a purchase, but there may be occasions when the balance adjustment is delayed. No Expiration; No Fees. Cards do not expire. No fees for inactivity or service fees apply. Not Reloadable. Cards may not be reloaded with additional value. No Refunds. No refunds are permitted with respect to Cards. All sales of Cards are final. Lost, Damaged Or Stolen Card. Brightline is not responsible for replacing lost, damaged or stolen Cards and is not responsible for unauthorized Card use. Resale Prohibited. You may not sell a Card or otherwise barter for its exchange. However, you may transfer a Card to another person who is at least age 13 years old for no monetary consideration (e.g., as a gift). Maximum Value. You may not purchase or obtain more than $10,000 in Card value in any one day regardless of location, whether on a single Card or multiple Cards. Moreover, you may not purchase a single card with a value greater than $500. About Your Card. Cards are not debit or credit cards. Brightline is responsible for the operation and maintenance of the Card program. Brightline Trains Florida LLC is the sole legal obligor to the Cardholder. Brightline Rewards Brightline Rewards is our loyalty program, allowing eligible users to earn and redeem points on qualifying purchases. Participation is subject to the program's Terms and Conditions, which can be found here . Contact Help Center Advertise With Us Press Room Speaker Request Travel Advisors Our Company About Us Careers Investor Relations Our Impact Railroad Rail Safety Policies Accessibility Privacy Policy Terms of Service Wi-Fi & Terms & Conditions/FAQs Gift Cards GO SMARTER Download the Brightline app today. © Brightline 2025. All Rights Reserved"
    },
    {
      "url": "https://www.yahoo.com/news/boca-raton-picks-developer-reshape-211700424.html",
      "text": "Boca Raton picks developer to reshape area near Brightline station. What to expect. Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Top Stories: Charlie Kirk fatally shot Who was Charlie Kirk? Ellison surpasses Musk Pandemic pups Trump on N.C. train stabbing Harris on Biden's decision to run Trump barred from firing Lisa Cook Trump: Epstein note a 'dead issue' 2 Americans fly to Tunisia by mistake 'Phillies Karen' viral drama Boca Raton picks developer to reshape area near Brightline station. What to expect. Abigail Hasebroock, South Florida Sun-Sentinel Wed, February 12, 2025 at 9:17 PM UTC 4 min read A developer has been selected to reimagine a currently aging part of Boca Raton near its Brightline station to become a mixed-use hub with residences, shops, restaurants, new government facilities, pedestrian experiences and more. A proposal created by the real estate firms Terra and Frisbie was chosen as the winner among four other developers — the Terra and Frisbie project even edged out a proposal by Related Ross, a subset of the global Related Companies founded by billionaire tycoon and Miami Dolphins owner Stephen Ross. “We’re honored to have won the trust of the residents and of the administration and obviously all the elected officials in Boca Raton,” Terra CEO David Martin said. “(We’re) excited about the next steps and continuing the community engagement and working through all the details of the development and putting together a timeline and working with the city to finalize the transaction.” Advertisement Advertisement Advertisement Advertisement City officials will spend the next several weeks working out the details of an agreement with Terra and Frisbie, which is expected to be finalized in March. If, for some reason, an agreement couldn’t be made, city officials might consider negotiating an agreement with Related Ross, their second choice. The other two groups — Namdar Group and RocaPoint Partners — were tied for third during a public city meeting on Tuesday evening. Martin is confident an agreement will be made with the city to bring the project to the government campus. “We’ve worked on a lot of public-private partnerships and procurements,” he said. “In our 25-year history, those agreements, we move forward on 100% of the time.” Terra & Frisbie’s plan Though it could change as it progresses with the city, the Terra-Frisbie group project could bring, as currently proposed, according to city documents: Advertisement Advertisement Advertisement Advertisement — More than 1,100 garden and mid-rise apartments. — 250,000 square feet of office space. — A hotel. — A new city hall. — Nearly 85,000 square feet of retail. — A new community center with “youth sports and enrichment,” after-school camps, an indoor basketball court and an adult program. — Pedestrian experiences, including a banyan tree oasis, a dog park, a retail promenade, garden pavilions and cafe areas. The existing skate park, softball field and tennis courts will be relocated, City Manager George Brown said during Tuesday’s meeting. City officials are working with the Greater Boca Raton Beach and Parks District to identify sites for a new skate park and softball field, such as Sugar Sand Park. The decision process During Tuesday’s meeting, several residents voiced apprehension about the impending change to the government campus, from worsened traffic on Palmetto Park Road to encroaching on the neighboring suburbs. Advertisement Advertisement Advertisement Advertisement But these concerns may have been part of why city officials ultimately chose the Terra and Frisbie project — it’s less intense than what the other projects were proposing, Martin said. City Council member Marc Wigder said during the meeting, “The sustainability-related considerations of the Terra proposal are excellent in terms of pedestrian and bike activation and connectivity, heat control, water retention, carbon footprint and analysis where you could see planning was created around these concepts, which I think will be critical to its success.” “This proposal is the best one to lead this orchestra and to consider first on this project. It most meets with the fabric of our city and neighborhood, represents responsible and meaningful growth, and will create a fantastic special place.” Deputy Mayor Yvette Drucker agreed that the Terra-Frisbie project is the best choice for Boca Raton, saying she believes it will “create jobs in its own organic way.” Advertisement Advertisement Advertisement Advertisement “I’ve had conversations with a lot of the different entities, and no one is not going to work here because we didn’t pick the Related and we picked something else to rank first,” she said. Terra also is working to bring life to the nearby Boca Raton Innovation Campus , which is slowly but surely making progress of its own. “We’ve been good stewards with all our projects, and so there was a trust factor,” Martin said. “That ability to engage with the community and listen and find a balance of what the future Boca can be but at the same time conserving the principles and values that went on, I think that sensibility was seen through our community engagement as well as our planning and proposal that we provided.” Advertisement About Our Ads Solve the daily Crossword 22,504 people played the daily Crossword recently. Can you solve it faster than others? 22,504 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! US Politics 2024 Election World Health Science The 360 Contact Us Originals Help Share Your Feedback About Us About Our Ads Site Map Follow us on Download our app © 2025 Yahoo. All rights reserved."
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/boca/2021/07/29/a-gamechanger-for-boca-raton-brightline-station-expected-to-be-completed-next-summer/5405642001/",
      "text": "Brightline station in Boca Raton on track for summer 2022 opening News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals BOCA RATON Boca Raton Brightline station: Construction on track for summer 2022 opening Victoria Villanueva-Marquez Palm Beach Post BOCA RATON — The timeline for downtown Boca Raton's high-speed express train stop is right on schedule, city officials said at a council meeting Tuesday night. The long-planned Brightline station and parking garage for Boca Raton is expected to be completed in the summer of 2022. The council also approved a $1.5 million grant from the Florida Department of Transportation that reduces the city's cost of the roughly $10 million parking garage to $8 million. Before construction begins on the train station and parking garage, a temporary parking lot will be completed in August. Ground was also broken on a new community garden at Meadows Park, which should be finished in time for the fall planting season. More: Brightline aims to build railroad station in Boca Raton More: Brightline asks Boca for $12.1 million for parking garage The council will review and approve the site plans for the train station and garage on Aug. 24. This month, the project received a favorable recommendation from the planning and zoning board. The site plans are for the most part consistent with the ones put forth in 2019, with the exception of some minor cosmetic changes. \"This remains a game changer for Boca Raton,\" Mayor Scott Singer told The Post. \"It will add a lot of vibrancy to the immediate area and downtown. It will also add a whole range of options for residents and businesses.\" The idea for a stop in Boca Raton came about because the train service wasn't readily accessible to residents of southern Palm Beach County and northern Broward County, who were forced to drive 20 miles north or south to board the train. Boca Raton, however, is an important business and shopping hub and home to Florida Atlantic University. Singer contacted Brightline and pitched his downtown area as a stop because Boca residents expressed an interest in riding the train if it were more conveniently located. Brightline ceased operations last year because of the pandemic, but plans are still in place to have stations in Boca Raton, Aventura and PortMiami. In Aventura, Brightline broke ground in September for a station next to the Aventura Mall. That project is scheduled to include a pedestrian bridge that would provide access to the mall. The station and adjacent parking garage will be built on the east side of the city's downtown library. Brightline's work on the Orlando leg from West Palm Beach continues and is more than 50 percent complete, officials said. Construction in the northern part of the county will affect Jupiter-area boaters in early August as the Loxahatchee River bridge will remain in the \"down\" position from 7 a.m. to 7 p.m. on Aug. 4 and Aug. 9. Boaters will be able to pass underneath it to Alternate State Road A1A, the U.S. 1 bridge and to the inlet. That $34 million project will add a second train track to the 95-year-old bridge in preparation for Brightline's extension to Orlando. With an average speed of 79-125 mph, it takes about 60 minutes to get from Miami to West Palm Beach. vvillanueva@pbpost.com Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    }
  ]
}