{
  "fuentes": [
    {
      "url": "https://www.goldeneaglecamp.org/staff/",
      "email": "carly@goldeneaglecamp.org"
    },
    {
      "url": "https://thegoldeaglemethod.com/contact-us/",
      "email": "dgutierr@goldeagle.com"
    },
    {
      "url": "https://www.goldeneagleluxurytrains.com/contact/",
      "email": "laura.bennett@getrains.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.goldeneaglehoa.org/",
      "email": "manager@goldeneaglehoa.org"
    },
    {
      "url": "https://www.goldeneaglecc.org/corp_events/",
      "email": "donna@gecc-inc.com"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "berna.marketing@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "daisy.raquel@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "golf@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "info@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "mohammad.rashed@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "raymond.sandoval@acci.com.ph"
    },
    {
      "url": "https://www.goldeneaglehoa.org/blank-12",
      "email": "manager@goldeneaglehoa.org"
    },
    {
      "url": "http://www.goldeneaglecc.org/members_login/",
      "email": "accounting@gecc-inc.com"
    },
    {
      "url": "http://www.goldeneaglecc.org/members_login/",
      "email": "donna@gecc-inc.com"
    },
    {
      "url": "http://www.goldeneaglecc.org/members_login/",
      "email": "jwatford@gecc-inc.com"
    },
    {
      "url": "http://www.goldeneaglecc.org/members_login/",
      "email": "pespitia@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "golf850.668.1071jwatford@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "jwatford@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "manager850.893.7700bsellers@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "marketing850.893.7700donna@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "bsellers@gecc-inc.com"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "email": "donna@gecc-inc.com"
    },
    {
      "url": "https://www.eaglevale.com/",
      "email": "info@eaglevale.com"
    },
    {
      "url": "https://eagleglengc.com/",
      "email": "01d@2x.png"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "jamie.baxter@aquilini.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "nancy.gill@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "robert.dew@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "carson.spooner@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "glen.hartley@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "info@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "lamica.martin@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "mike.ryan@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "email": "robert.dew@goldeneaglegolfclub.com"
    },
    {
      "url": "https://www.ttugoldeneaglegolfclub.com/contact-us/",
      "email": "golfpro@golfcookeville.com"
    },
    {
      "url": "https://www.ttugoldeneaglegolfclub.com/contact-us/",
      "email": "jdewey@tntech.edu"
    },
    {
      "url": "https://www.ttugoldeneaglegolfclub.com/contact-us/",
      "email": "mjmanzaro@tntech.edu"
    },
    {
      "url": "https://www.ttugoldeneaglegolfclub.com/contact-us/",
      "email": "proshop@golfcookeville.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "email": "david.benson@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "email": "patrick.ellis@invitedclubs.com"
    },
    {
      "url": "https://www.golfgoldeneagle.com/contact",
      "email": "aaron.johnson@svn.com"
    }
  ],
  "mails": [
    "01d@2x.png",
    "aaron.johnson@svn.com",
    "accounting@gecc-inc.com",
    "berna.marketing@acci.com.ph",
    "bsellers@gecc-inc.com",
    "carly@goldeneaglecamp.org",
    "carson.spooner@goldeneaglegolfclub.com",
    "daisy.raquel@acci.com.ph",
    "david.benson@invitedclubs.com",
    "dgutierr@goldeagle.com",
    "donna@gecc-inc.com",
    "gabe@journeysherwood.org",
    "glen.hartley@goldeneaglegolfclub.com",
    "golf850.668.1071jwatford@gecc-inc.com",
    "golf@acci.com.ph",
    "golfpro@golfcookeville.com",
    "info@acci.com.ph",
    "info@eaglevale.com",
    "info@goldeneaglegolfclub.com",
    "info@journeysherwood.org",
    "jamie.baxter@aquilini.com",
    "jdewey@tntech.edu",
    "jwatford@gecc-inc.com",
    "lamica.martin@goldeneaglegolfclub.com",
    "laura.bennett@getrains.com",
    "leadershipboard@journeysherwood.org",
    "manager850.893.7700bsellers@gecc-inc.com",
    "manager@goldeneaglehoa.org",
    "marketing850.893.7700donna@gecc-inc.com",
    "mike.ryan@goldeneaglegolfclub.com",
    "mjmanzaro@tntech.edu",
    "mohammad.rashed@acci.com.ph",
    "nancy.gill@goldeneaglegolfclub.com",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "patrick.ellis@invitedclubs.com",
    "pespitia@gecc-inc.com",
    "proshop@golfcookeville.com",
    "raymond.sandoval@acci.com.ph",
    "robert.dew@goldeneaglegolfclub.com",
    "scott@journeysherwood.org"
  ],
  "nombre_sitio": "goldeneaglecc.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.goldeneaglecamp.org/staff/",
      "text": "Staff - Golden Eagle Summer Sports Camp Email us: carly@goldeneaglecamp.org Call us: 415-519-6292 Visit us on social networks Home Our Program Our Program Schedule & Locations Staff FAQ Employment Opportunities Community Support Sign Up Parent Login Home Staff Our staff consists of highly qualified instructors and counselors with extensive background in their activities. MORE ABOUT US FAMILY OWNED AND OPERATED Golden Eagle Summer Sports Camp has been owned and operated by the Lodge Family since its founding in the summer of 1984. We are proud to serve our local community as one of the longest running family camps in the area. Together with Garrett and Kim Middleton, directors of our Homestead site, we have continued to grow in popularity each year. Our staff consists of hard working local high school and college students, dedicated to providing individualized attention to all campers to ensure they have the best summer ever. Most of our staff attended Golden Eagle as campers themselves and strive to provide campers the same joyful, fun filled summer camp experience they had. We hope you too will join the Golden Eagle family! OWNER & LOS ALTOS DIRECTOR STEFAAN LODGE Stefaan Lodge has been co-owner of Golden Eagle Summer Sports Camp and Director since 2002. He began attending the camp as a kindergartener in 1984 when it was started by his parents, Nelson and Monica Lodge. Through the years he attended camp as a camper and worked as a junior and senior counselor before taking over as owner and director. Stefaan was a three-sport varsity high school athlete and currently teaches at Los Altos High School. He has three young children, Carter (11), Kennedy (9), and Madison (7). He finds great joy in watching them spend their summers at Golden Eagle building the same lasting memories that he has carried with him over the past 4 decades. OPERATIONS CARLY LODGE Carly joined the Golden Eagle family when she and Stefaan met and began dating in 2008. To this day she claims she knew Stefaan was “the one“ when she visited camp, having only dated for a few months, and saw Stefaan’s amazing presence with the campers. Sure enough they were married in 2013 and together have 3 beautiful children. Carly manages the camp operations throughout the year and is responsible for the website and marketing efforts as well as handling all registrations, payments, community outreach and charitable contributions. HOMESTEAD DIRECTORS KIM & GARRETT MIDDLETION Garrett & Kim Middleton have been working with Golden Eagle Sports Camp for over two decades. Together they bring a wealth of knowledge about both athletics and childhood development and have watched their two boys, Drew and Griffin, thrive at the camp since they were young children, and are now helping to run the Homestead camp. Garrett has 2 decades of experience as a teacher, coach (basketball, softball, track & field, etc), and athletic director. Kim earned her Bachelor’s degree in Child Development and Liberal Studies. After she graduated, she worked as the Assistant Director at the Children’s Center of the Stanford Community for nine years and then went on to join the staff at Edgewood House School in Palo Alto for the next five years. During those years she was involved with Golden Eagle Sports Camp and now she enjoys being at the camp full time and working with all the campers to ensure they have an awesome camp experience. ALL THE NITTY GRITTY Our Program Staff FAQ Medical Permission Form Community Support Employment Opportunities Scholarship Application PARENT LOGIN Access family profile, tax receipts, pay your bill and more! PARENT LOGIN Copyright Golden Eagle Camp, LLC. 2018. All rights reserved."
    },
    {
      "url": "https://thegoldeaglemethod.com/contact-us/",
      "text": "Contact Us - The Gold Eagle Method Skip to content Main Menu Home All Products Menu Toggle 303® Products Clindo® Products TriNova® Products Private Label Products How old is my bottle? Contact Us Please fill out the form or use the contact information found below to get in touch with Gold Eagle Company for inquiries regarding our product disclosures. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Comment or Message * Website Submit Responsible Individual David Gutierrez Research and Development Lab Manager dgutierr@goldeagle.com 4400 S. Kildare Chicago, IL 60632 800-367-3245 Gold Eagle Company 800-367-3245 Copyright © 2025 State of California's SB-258 Cleaning Product Right to Know Act of 2017 State of New York’s Household Cleansing Product Information Disclosure Program Privacy Policy"
    },
    {
      "url": "https://www.goldeneagleluxurytrains.com/contact/",
      "text": "Contact - Golden Eagle Luxury Trains Skip to main content Hit enter to search or ESC to close Close Search Menu Home Journeys Timetable 2025 Timetable 2026 Timetable New Tours Register Your Interest Coming Soon Trains Golden Eagle Danube Express Golden Eagle Deccan Odyssey Golden Eagle Silk Road Express Vietnam Express Brochures Why Golden Eagle Five-Star Service Gastronomy Immersive Experiences All-Inclusive Luxury Testimonials Video Gallery Blog About News About Us FAQ Contact Get in Touch You can get in touch with us over the phone, sending an email or by filling in the form below. Please note our office hours are 9:00AM to 5:30PM GMT. Head Office Golden Eagle Luxury Trains Limited Denzell House, Denzell Gardens, Dunham Road, Altrincham, Cheshire, United Kingdom, WA14 4QF Contact Details +44 (0)161 928 9410 General Enquiries mail@getrains.com Marketing & PR laura.bennett@getrains.com Social Media Facebook Pinterest Instagram YouTube LinkedIn Fill in your name and contact e-mail - detailing in the message which rail journey you are most interested in - and we shall reply as soon as possible. SUBSCRIBE TO OUR NEWSLETTER FOR THE LATEST UPDATES AND EXCLUSIVE OFFERS First Name Last Name Email address: Are you a Travel Professional? Please Select Yes No Are you a solo traveller? Please Select Yes No I am currently booked to travel with Golden Eagle Please Select Yes No Which Regions Are You Interested In? Europe Central Asia India Africa Leave this field empty if you're human: Come Visit Golden Eagle Luxury Trains Limited, Denzell House, Denzell Gardens, Dunham Road, Altrincham, Cheshire, United Kingdom, WA14 4QF Telephone: +44 (0)161 928 9410 Email: mail@getrains.com UK Office Opening Hours Monday – Friday 8.30am – 5.00pm Useful Links FAQ Brochure Library Booking Conditions Our Sustainability Promise Privacy Policy Cookie Policy PR & Media Agent Hub In Memoriam - Marina Linke Social Media Facebook Pinterest Instagram YouTube LinkedIn © 2025 Golden Eagle Luxury Trains. Web Design Manchester by Designers Up North Close Menu Home Journeys Timetable 2025 Timetable 2026 Timetable New Tours Register Your Interest Coming Soon Trains Golden Eagle Danube Express Golden Eagle Deccan Odyssey Golden Eagle Silk Road Express Vietnam Express Brochures Why Golden Eagle Five-Star Service Gastronomy Immersive Experiences All-Inclusive Luxury Testimonials Video Gallery Blog About News About Us FAQ Contact"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.goldeneaglehoa.org/",
      "text": "Home | Golden Eagle HOA top of page Welcome to Golden Eagle Homeowners Owner Portal New Resident Form Subscribe Clubs and Group Meetings Committees Security ACC Communications Roads & Drainage Events Beautification Resources Golden Eagle Country Club Schools & Daycares Contact 2024 Board Homeowners Owner Portal New Resident Form Subscribe Clubs and Group Meetings Committees Security ACC Communications Roads & Drainage Events Beautification Resources Golden Eagle Country Club Schools & Daycares Contact 2024 Board Request a Document Owner Portal Contact HOA Owner Portal GE Foodtruck Vendor Signup RSVP for an Event Upcoming Events: Board Meeting: July 15, 2025 NEXT GE FOODTRUCK THURSDAYS: July 10, 2025 Maad Goat Pizza and Comeback Tacos July 24, 2025 ZapZap and Wok N Roll manager@goldeneaglehoa.org 850-668-6578 Hours: M-F 9am-3pm Contact Us Menu Owner Portal 2025 Board Contact Subscribe © 2024 by Cloudmarketed Homeowners Owner Portal New Resident Form Subscribe Clubs and Group Meetings Committees Security ACC Communications Roads & Drainage Events Beautification Resources Golden Eagle Country Club Schools & Daycares Contact 2024 Board bottom of page"
    },
    {
      "url": "https://www.goldeneaglecc.org/corp_events/",
      "text": "Weddings & Banquets - Golden Eagle Golf & Country Club Skip to primary navigation Skip to main content Skip to footer Golden Eagle Golf & Country Club HOME The Club The Club at Golden Eagle Photo Gallery Golf Tennis Membership Weddings & Banquets Contact Us Contact Us Directions & Address Weddings & Banquets WEDDINGS & BANQUETS Member Log in After over 30 years of exceptional food presentation and service, planning your event at Golden Eagle is simple, stress free and more affordable than you think! As a full service venue for your Tallahassee Wedding, why worry about all of the details when we have everything you need right here and at no extra cost! Items Such As: Indoor Tables & Chairs China Silverware Table Linens and Linen Napkins Cocktail Napkins Glassware Cake Cutter and Server Champagne Glasses Full Service Kitchen and Staff Room Set up Room Clean up Cake Cutting Changing Rooms Up to 150 White Padded Wedding Ceremony Chairs Free of Charge to use for your outdoor Wedding Ceremony! 150 Champagne Chiavari Chairs Free of Charge to use inside for your Reception! See the pictures below of our Pergola also Free of Charge to use for your outdoor Wedding Ceremony! Also: No extra security staff needed No event insurance needed No charge for Wedding Ceremony Rehearsal the day prior From menu selection to room design, our friendly and professional staff is sure to make your wedding experience one to remember. Call us today for a free estimate and see for yourself how affordable your wedding and reception can be! Let us do the work so you don’t have to! We have recently renovated our ceremony site! Our new walkway provides a jaw dropping entrance as you walk towards your forever person. If you would like a tour before booking, please call or email Donna Biggins at 850-893-7700 or donna@gecc-inc.com . Facility Charge: Wedding Reception $2,500 ​Wedding Ceremony & Reception $2,750 Golden Eagle Country Club is also the perfect location for your Tallahassee Bar or Bat Mitzvah, Quinceanera, Retirement Party or Fundraiser! Club membership is not required to hold an event at Golden Eagle Country Club! Golden Eagle Country Club is a Full Service Venue! We must provide all food & beverages! Brides must provide all Wedding & Groom’s Cakes! Holiday Parties Golden Eagle Country Club is the perfect setting for your Holiday Party!  The Club is beautifully decorated for the Holidays, so you won’t need to lift a finger! Banquet Menus Wedding Information Dinner Buffet Hors D’oeuvres Wedding Beverages Plated Meal Comments & Reviews We love all of our wonderful Brides and Clients! Click on the link below to read what some of them had to say about their event. Read Comments & Reviews Submit Comments & Reviews Request More Information Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Event Date Group Size Comment Submit Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy ABOUT US Here at Golden Eagle Country Club we pride ourselves on the high quality of magnificent golf, superb amenities and outstanding service that we offer our valued customers. We have worked for over thirty years to become a staple of the community, and in the process we have earned recognition as one of the region’s premier golf experiences. WEATHER TALLAHASSEE WEATHER CONTACT INFO Address: 3700 Golden Eagle Dr E Tallahassee, FL 32312 Phone: (850) 893-7700 Employee’s Only Login Twitter Facebook Copyright © 2025 Golden Eagle Golf & Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "text": "Contact Us - Alabang Country Club, Inc. Skip to content Menu Facebook-f Instagram Search Contact Us Home Contact Us GET IN TOUCH For inquiries, please feel free to send us a message or reach us on the contact details provided below. clubhouse OPERATIONS Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph GOLF OPERATIONS Felicita V. Mallari 0998 587 9420 8842-3530 loc 157 golf@acci.com.ph corporate services Daisy C. Raquel 0998 587 9422 8842-3530 loc 176 daisy.raquel@acci.com.ph member relations Berna D. Malolos 0917 568 5764 8842-3530 loc 152 berna.marketing@acci.com.ph DINING & BANQUETS Mohammad Rashed Jr. 0918 239 4898 8842-3530 loc 226 mohammad.rashed@acci.com.ph data privacy officer Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph Contact Form \" * \" indicates required fields Full Name * Email * Contact Number * Subject * Subject * Membership Golf Operations Dining & Banquets Events Message Name This field is for validation purposes and should be left unchanged. ACCI started its operation in 1981 with a Member-base of 1,646. Our primary objective is to provide Members excellent leisure facilities designed for the whole family. Quick Links About Facilities Events Membership Careers Contact Us Contact Us 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines Follow Us Facebook-f Instagram © Copyright 2025 Alabang Country Club. All Rights Reserved. © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines Privacy Policy Facebook-f Instagram Home About Us History of the Club Mission & Vision Board of Directors The Committees Club Management Events Social Activities Monthly Newsletter Golf Course Tour Golf Tournaments Facilities Member Services Sports and Recreation Dining and Banquets Members Corner Contact Us Career"
    },
    {
      "url": "https://www.goldeneaglehoa.org/blank-12",
      "text": "Golden Eagle Country Club | Golden Eagle HOA top of page Welcome to Golden Eagle Homeowners Owner Portal New Resident Form Subscribe Clubs and Group Meetings Committees Security ACC Communications Roads & Drainage Events Beautification Resources Golden Eagle Country Club Schools & Daycares Contact 2024 Board Golden Eagle Country Club Located at 3700 Golden Eagle Drive East, Tallahassee, FL 32312 Memberships manager@goldeneaglehoa.org 850-668-6578 Hours: M-F 9am-3pm Contact Us Menu Owner Portal 2025 Board Contact Subscribe © 2024 by Cloudmarketed Homeowners Owner Portal New Resident Form Subscribe Clubs and Group Meetings Committees Security ACC Communications Roads & Drainage Events Beautification Resources Golden Eagle Country Club Schools & Daycares Contact 2024 Board bottom of page"
    },
    {
      "url": "http://www.goldeneaglecc.org/members_login/",
      "text": "MEMBERS ONLY - Golden Eagle Golf & Country Club Skip to primary navigation Skip to main content Skip to footer Golden Eagle Golf & Country Club HOME The Club The Club at Golden Eagle Photo Gallery Golf Tennis Membership Weddings & Banquets Contact Us Contact Us Directions & Address MEMBERS ONLY Calen dar Welcome to our Members Only section. If you became a member prior to August 2019, please use your username and password for entry. If you became a member after August 2019, please login with your email and password. If you are not identified as a member in our database, you will not be permitted access. Please contact us at (850) 893-7700 or donna@gecc-inc.com so we can properly identify you as a member in our database. Username or Email Address Password Remember Me Calendar Talon Newsletter Par Tee Ladies Golf Pro Shop News Pro Shop Information Pro Shop 1 Ladies Club Mixed Grille Golden Eagle Togo Menus Rules and Regulations Upcoming Tournaments Pool and Landing Log in Welcome Golden Eagle Members! This Member’s Only portal serves as an information resource for you regarding Club News, Golf News, and the Mixed Grille. We are so happy to have you be a part of our club and want to make sure all your questions and needs are met. To do so, we have created a small directory to help you get to the right place! Donna Biggins, Director of Sales and Marketing Responsible for any membership questions/changes/concerns as well as event, banquet, meeting, and Wedding planning. 850-893-7700 donna@gecc-inc.com Patrick Espitia, Director of Food & Beverage Responsible for the Mixed Grille, Waitstaff, and event set-up. 850-893-7700 pespitia@gecc-inc.com Tracy Bauldree, Accounting Responsible for Auto Billing, Credit/Debit card charges, Change of Debit/Credit Cards, Receipts, etc. 850-893-7700 accounting@gecc-inc.com Joe Watford, Director of Golf Responsible for Golf Tee Times, Golf Purchases, Questions 850-668-1071 jwatford@gecc-inc.com Allen Long, Director of Racquet Sports Responsible for Tennis Lessons, Reservations, Tournaments, Clinics, etc. 850-508-7487 To reserve Tennis Courts, please text Allen with your Name, Member Number, and time to 850-508-7487 Food and Beverage Minimum Quarters If you would like to know your current balance, please call or email Donna. A-G 1st Quarter – January to March 2nd Quarter – April to June 3rd Quarter – July to September 4th Quarter – October to December H-O 1st Quarter – February to April 2nd Quarter – May to July 3rd Quarter – August to October 4th Quarter – November to January P-Z 1st Quarter – March to May 2nd Quarter – June to August 3rd Quarter – September to November 4th Quarter – December to February Calendar Talon Newsletter Par Tee Ladies Golf Pro Shop News Pro Shop Information Pro Shop 1 Ladies Club Mixed Grille Golden Eagle Togo Menus Rules and Regulations Upcoming Tournaments Pool and Landing Welcome Golden Eagle Members! This Member’s Only portal serves as an information resource for you regarding Club News, Golf News, and the Mixed Grille. We are so happy to have you be a part of our club and want to make sure all your questions and needs are met. To do so, we have created a small directory to help you get to the right place! Donna Biggins, Director of Sales and Marketing Responsible for any membership questions/changes/concerns as well as event, banquet, meeting, and Wedding planning. 850-893-7700 donna@gecc-inc.com Patrick Espitia, Director of Food & Beverage Responsible for the Mixed Grille, Waitstaff, and event set-up. 850-893-7700 pespitia@gecc-inc.com Tracy Bauldree, Accounting Responsible for Auto Billing, Credit/Debit card charges, Change of Debit/Credit Cards, Receipts, etc. 850-893-7700 accounting@gecc-inc.com Joe Watford, Director of Golf Responsible for Golf Tee Times, Golf Purchases, Questions 850-668-1071 jwatford@gecc-inc.com Allen Long, Director of Racquet Sports Responsible for Tennis Lessons, Reservations, Tournaments, Clinics, etc. 850-508-7487 To reserve Tennis Courts, please text Allen with your Name, Member Number, and time to 850-508-7487 Food and Beverage Minimum Quarters If you would like to know your current balance, please call or email Donna. A-G 1st Quarter – January to March 2nd Quarter – April to June 3rd Quarter – July to September 4th Quarter – October to December H-O 1st Quarter – February to April 2nd Quarter – May to July 3rd Quarter – August to October 4th Quarter – November to January P-Z 1st Quarter – March to May 2nd Quarter – June to August 3rd Quarter – September to November 4th Quarter – December to February Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy ABOUT US Here at Golden Eagle Country Club we pride ourselves on the high quality of magnificent golf, superb amenities and outstanding service that we offer our valued customers. We have worked for over thirty years to become a staple of the community, and in the process we have earned recognition as one of the region’s premier golf experiences. WEATHER TALLAHASSEE WEATHER CONTACT INFO Address: 3700 Golden Eagle Dr E Tallahassee, FL 32312 Phone: (850) 893-7700 Employee’s Only Login Twitter Facebook Copyright © 2025 Golden Eagle Golf & Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.goldeneaglecc.org/contact/",
      "text": "CONTACT US - Golden Eagle Golf & Country Club Skip to primary navigation Skip to main content Skip to footer Golden Eagle Golf & Country Club HOME The Club The Club at Golden Eagle Photo Gallery Golf Tennis Membership Weddings & Banquets Contact Us Contact Us Directions & Address CONTACT US Member Log in Club Phone Numbers Clubhouse: 850.893.7700 Golf Pro Shop: 850.668.1071 Tennis Pro Shop: 850.893.1285 Club Contacts Bruce Sellers General Manager 850.893.7700 bsellers@gecc-inc.com Donna Biggins Director of Sales & Marketing 850.893.7700 donna@gecc-inc.com Joseph Watford Director of Golf 850.668.1071 Jwatford@gecc-inc.com Allen Long Head Tennis Professional 850.893.1285 Mixed Grille Hours Tuesday – Friday | 10:00 AM to 8:30 PM Saturday & Sunday | 7:30 AM to 8:30 PM Tuesday – Friday: Complimentary coffee is available daily in the Pro Shop. Leave a Message We want to hear from you! Here at Golden Eagle Country Club it is always our objective to meet and exceed the expectations of our members and banquet clients. We encourage you to leave a review and let us know about your experience. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Contact Us Golden Eagle Country Club 3700 Golden Eagle Dr. E Tallahassee, FL 32312 (850) 893-7700 donna@gecc-inc.com Social Media Facebook Twitter Footer Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy ABOUT US Here at Golden Eagle Country Club we pride ourselves on the high quality of magnificent golf, superb amenities and outstanding service that we offer our valued customers. We have worked for over thirty years to become a staple of the community, and in the process we have earned recognition as one of the region’s premier golf experiences. WEATHER TALLAHASSEE WEATHER CONTACT INFO Address: 3700 Golden Eagle Dr E Tallahassee, FL 32312 Phone: (850) 893-7700 Employee’s Only Login Twitter Facebook Copyright © 2025 Golden Eagle Golf & Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.eaglevale.com/",
      "text": "Golf Country Club in Rochester, NY Skip to main content Skip to footer Eagle Vale Golf Club Fairport, NY Call us: (585) 377-5200 Home Golf Tee Times Rates Memberships Indoor Simulators Pro Shop Specials! Driving Range Penfield NY 2025 Driving Range Membership 2025 Saturday Couples League Course Information Scorecard Front 9 Flyover Back 9 Flyover GOLF INSTRUCTION Virtual Tour Tournaments Tournaments 2026 Tournament Pricing Information Request Events Calendar Tee Times Argyle Grill Banquet Facility Banquet Facility Special Occasions Corporate Events Golf Tournaments Information Request Testimonials Weddings Eagle Vale News Newsletter Join Our Email List! Helpful Links Contact Us Argyle Grill Golf Country Club in Rochester, NY Eagle Vale Golf Club! Book A Tee Time Now Memberships Golf Clinics, Camps and Instruction Indoor Simulators 2025 SATURDAY COUPLES LEAGUE Weddings Banquets UPCOMING EVENTS & BAND SCHEDULES Welcome to Click Here for Menu & Info Course News Our Two Foresight Indoor Golf Simulators are now open for play!! We are open 7 days a week from 10 am to 9 pm Please call 377-5200 ext 1 to Book your tee time now! Eagle Vale Golf Club MEMBERSHIP special for the 2025 … Visit our Membership page for details BOOK YOUR 2025 GOLF TOURNAMENTS’ TODAY! We have prime 2025 tournament dates available, but they’re going fast! Call us soon before it’s too late! LIVE MUSIC ON FRIDAY AND SATURDAY EVENINGS FROM 7-10PM, EVERY WEEK! The “9 & Dine” at Eagle Vale Golf Club will be back by popular demand in 2025! (Available Friday & Sundays after 3pm, starting the weekend of Friday, May 2rd, 2025) Experience Eagle Vale Golf Club Eagle Vale is a premier public golf course with a country club setting and\r\nconditions. Our scenic championship course is always in immaculate\r\ncondition and is designed for all levels of play. Conveniently located only\r\nminutes from downtown Rochester, Eagle Vale provides visitors with a golf,\r\ndining and entertainment experience unlike any other in the area. Eagle Vale meticulously maintains its course to the highest standards and\r\nfeatures a computerized irrigation system, well maintained sand bunkers,\r\ndriving range, short game practice areas, and golf carts with canopies,\r\nwindshields, and golf bag protectors. Eagle Vale is a Certified Audubon Sanctuary Encompassed within the golf course are natural wetlands that provide nesting\r\nareas for a variety of wildlife. There is an abundance of plant life and\r\nflower gardens that enhance the natural beauty of the terrain. Eagle Vale\r\nis proud to be the only golf course in western New York to have achieved the\r\nprestigious distinction of being named a Certified Audubon Sanctuary by\r\nAudubon International. Welcome to Eagle Vale Banquets & Events Rochester Rehab Book Tee Times Learn More Argyle Grill Learn More Banquets & Events Learn More Learn More Weddings at Eagle Vale Come Celebrate Your Special Day with Us! Learn More Plan Your Event Contact Us! News, Specials, & Eagle Events Contact Us! Footer Sign-Up for Email Offers Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Website Submit Local Weather Sorry - your browser does not support iframes. meteoblue Find Us Address: 4344 Nine Mile Point Road Fairport, NY 14450 Phone: (585) 377-5200 Email: info@eaglevale.com Follow Us Copyright © 2025 Eagle Vale Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://eagleglengc.com/",
      "text": "Eagle Glen Golf Club: Where Weddings, Golf, and Dining Unite Skip to content PickleBall Grand Opening Tournament September 26-28 click here for details. PickleBall Grand Opening Tournament September 26-28 click here for details. Reservation Desk (951) 272-4653 BOOK A TEE TIME Golf Shop Facebook-f Instagram Linkedin-in Tiktok Twitter Youtube Home Weddings & Events Weddings Events Quinceañera Golf & Tournaments Golf Course Golf Lessons Golf Tournaments Pro Shop Book a Tee Time Pickleball Pickleball Courts Pickleball Lessons Tournament – Eagle Glen Grand Opening Tournament 9/26-9/28 Pickleball Spectators Waiver And Release Of Liability Waiver And Release Of Liability For Minors The Grille Sim Lounge Contact Us Home Weddings & Events Weddings Events Quinceañera Golf & Tournaments Golf Course Golf Lessons Golf Tournaments Pro Shop Book a Tee Time Pickleball Pickleball Courts Pickleball Lessons Tournament – Eagle Glen Grand Opening Tournament 9/26-9/28 Pickleball Spectators Waiver And Release Of Liability Waiver And Release Of Liability For Minors The Grille Sim Lounge Contact Us | Enjoy the ultimate golf club experience Eagle Glen - Where Moments Become Memories At Eagle Glen, every visit is an opportunity to create lasting memories. Weddings & Events Eagle Glen Bar & Grille Pickleball Book a Tee Time Book Sim Lounge Weddings & Events Pickleball Book a Tee Time Book Sim Lounge Eagle Glen Bar & Grille Eagle Glen Golf Club is home to many charities and corporate events year after year. Our exceptional golf course, committed team, and top-tier Food & Beverage services collaborate flawlessly to deliver a premium golfing experience for you and your party. From initial arrangements to the last stroke on the 18th hole, every element of your visit is managed with precision and thoughtfulness. We’re also excited to welcome you to Eagle Glen’s Players Club, where members gain access to exclusive monthly tournaments, unique events, and reduced rates that enhance every game. Whether your goal is to refine your abilities, connect with other golf enthusiasts, or simply enjoy the course, our Players Club blends fellowship and spirited competition in a way that’s hard to match. Join the Eagle Glen family today and discover golfing at its very best! Contact Us Enjoy the golf experience Spectacular championship golf course with superb amenities and a stunning natural setting. One of the finest daily fee golf courses in Southern CA. Eagle Glen provides an extraordinary golf experience among golf courses Open to the public, the course was designed to naturally integrate the ancient oaks, majestic sycamores, towering eucalyptus trees Read More Premier Pickleball Facility in Corona Pickleball at Eagle Glen! A premier pickleball facility is set to open in our community, promising an exceptional experience for players of all levels. Designed and constructed by professional pickleball players, the facility will adhere to the highest standards of the sport, featuring tournament-grade courts that meet stringent regulations. Beyond the courts, the venue will offer a comprehensive range of amenities. Read More A Superb Corona Bar & Grille The Grille At Eagle Glen Eagle Glen’s Grille is a top-notch spot for a meal with friends or family, a cold drink in hand, or catching the big game in a place that feels polished yet easygoing—perfect for all ages. Inside, you’ve got this sharp Californian look that’s stylish but not over-the-top, a solid bar with all the options, and five TVs, including a big 55-inch one, set up so everyone gets a good view. Read More Celebrate Weddings Book Your Event, Weddings & Parties Eagle Glen Golf Clubhouse, overlooking emerald fairways and clear blue skies, is Corona premier upscale venue for most any type of event. BOOK YOUR EVENT BOOK YOUR TEE TIME Experience our 18-holes of great golf plus pay the best rate available when you book directly through our website. BOOK A TEE TIME Sim Lounge Corona's \nPremier Golf Simulator Experience cutting-edge technology with Eagle Glen’s immersive golf simulator. Play renowned courses, sharpen your skills, or compete with friends, all in a realistic, climate-controlled setting in Corona. Perfect for golfers of all levels, our simulator offers year-round enjoyment and a premier golfing experience. Book Sim Lounge See what Our Customers are Saying We have achieved the honor of being the highest-rated pool company on Yelp, with a remarkable 100 five-star reviews. Zemn A. 23/04/2025 I never imagined that I would have my “dream” wedding come to life in such a short amount of time. It went beyond my dreams. The location itself is absolutely mesmerizing. The hall is gorgeous and there is so much you can do! Raul and Madison are amazing! Anna C. 23/04/2025 Our Daughter and Son in law had their Wedding here 3 weeks ago. It was BEAUTIFUL to say the least, We had ZERO complaints. From the beginning, rehearsal dinner and Wedding Day, the whole Eagle Glen Team was Fabulous. Raul, Anissa, Paulie, Gina and can’t forget our Bartender Hugo. Jazzlyn 23/04/2025 Both were very helpful throughout our entire time preparing for the wedding. From the time we booked with Eagle Glen to the day of our wedding. Anissa was our coordinator andade sure that everything went according to plan and Kevin answered all questions and helped us with the sales and even assisted with our photographer and videographer. Cindy Rose Local Guide 23/04/2025 The facility was very clean. The staff was very helpful. Prices for the snacks and drinks are decent. The restrooms were clean. B. Smith 23/04/2025 This very scenic course was not too busy and in great condition recently, with flawless greens, sandy bunkers, and close-cut hybrid bermuda in the fairways. Bolide Corona, CA 23/04/2025 I highly recommend lessons with Mark Moore. Fantastic coach. He is easy-going, encouraging, personable and a straight shooter. He fixed my broken swing and reassured my faith in myself, the skills I already had and my game. Contact Us For Private Event & Wedding inquiries please fill the contact form below. First Name: Last Name: Phone No: Email: Select  Event from List Wedding Birthday Party Concert Golf Tournament Golf Inquiry Pickleball Date: Message: Send Message Facebook-f Instagram Linkedin-in Tiktok X-twitter Youtube Helpful Links Home Wedding & Events Eagle Glen Grille Golf & Tournaments Pickleball Sim Lounge Gallery Employment FAQs Blog Contact Privacy Policy Contact Us Eagle Glen Golf Club 1800 Eagle Glen Parkway Corona, CA 92883 Reservation Desk (951) 272-4653 Golf Shop (951) 278-2842 Events Office (951) 278-2540 Hours of Operation: Monday: Sunrise – Sunset Tuesday: Sunrise – Sunset Wednesday: Sunrise – Sunset Thursday: Sunrise – Sunset Friday: Sunrise – Sunset Saturday: Sunrise – Sunset Sunday: Sunrise – Sunset Copyright © 2025 Eagle Glen | All Rights Reserved Scroll to Top Click here"
    },
    {
      "url": "https://www.goldeneaglegolfclub.com/contact-us",
      "text": "Pitt Meadows | Contact Us| Golden Eagle Golf Club top of page Home Golf Tournaments Online Booking Membership North Course South Course Gallery Weddings & Banquets Enquiries Form Weddings Banquets Testimonials Gallery Patio 37 Events Calendar Contact Us info@goldeneaglegolfclub.com 604-460-1111 Book Tee Time Contact Us To learn more about our services and facilities, contact us today! Photo Credit: Dragonflight Photography Contact Golden Eagle Golf Club If you have any questions about our facilities or services offered, simply contact the Golden Eagle Golf Club team using the eform below. We will get back to you as soon as possible to address your inquiry. Since we receive numerous emails, kindly allow 48 hours for us to reply to your message. 21770 Ladner Road Pitt Meadows, BC V3Y 1Z1 Phone: 604-460-1111 Email: info@goldeneaglegolfclub.com Contact Our Team General Inquires - info@goldeneaglegolfclub.com Jamie Baxter - Jamie.baxter@aquilini.com General Manager (Ext 310) Lamica Martin - lamica.martin@goldeneaglegolfclub.com Sales & Events Manager (Ext 303) Glen Hartley - glen.hartley@goldeneaglegolfclub.com Director of Operations (Ext 304) Carson Spooner - Manager of Golf Events & Operations (Ext 304) carson.spooner@goldeneaglegolfclub.com Robert Dew - Robert.dew@goldeneaglegolfclub.com Executive Chef Nancy Gill - Nancy.gill@goldeneaglegolfclub.com Senior Account (Ext 306) Patio 37 (Ext 307) Mike Ryan - mike.ryan@goldeneaglegolfclub.com Superintendent (Ext 309) Join Our Team Line Cooks/Kiosk Cook & Attendent Sous Chef Concierge & Reception Desk Server, Kiosk, Beverage Cart Attendents Seasonal Maintenance Contact Us Name Phone Number Email Message submit Thanks for submitting! Are You Ready To Hit The Green? Schedule online and get ready for the perfect day of golf. Book Your Tee Time Contact Us Golden Eagle Golf Club 21770 Ladner Road Pitt Meadows, BC V3Y 1Z1 Phone: 604-460-1111 Email: info@goldeneaglegolfclub.com Hours Golf Course Open Dawn to dusk, 7 days a week ​ Club House Phone 7:00am to 6:00pm ​ Patio 37 ​Hours: 10:00am - 7:00pm weather dependent Social Copyright Notice This website and its contents are the property of Aquilini Investment Group (and its subsidiary companies) – ©Aquilini Investment Group (and its subsidiary companies) 2019. All rights reserved. Any distribution, redistribution, or reproduction of any part of the contents of this website in any form is prohibited, except with the express prior written consent of Aquilini Investment Group. Copyright Golden Eagle Golf Club - Privacy Policy Created by bottom of page"
    },
    {
      "url": "https://www.ttugoldeneaglegolfclub.com/contact-us/",
      "text": "Contact Us - Golden Eagle Golf Club Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Golden Eagle Golf Club Tennessee Tech Golden Eagle Golf Club Cookeville, TN Book Tee Times Call Us Home Tee Times Email Club Course Course Rates by Round Photo Gallery Scorecard Membership Event Booking Events Gift Certificates Special Events Most Popular Golf Shop Snack Bar Discount Tee Times Memberships Equipment Accessories Apparel Tournaments Tools Contact Us Directions Contact Us Contact Us Golden Eagle Contact Information Golden Eagle Golf Club 1500 Country Club Road Cookeville, Tennessee 38501 (931) 372-GOLF(4653) Email contacts mjmanzaro@tntech.edu jdewey@tntech.edu Primary Sidebar Contact Us Directions Footer Home Tee Times Email Club Course Events Pro Shop Contact Us Copyright © 2025 Golden Eagle Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/eagles-nest-country-club/who-we-are",
      "text": "Who We Are | Eagle's Nest Country Club | Phoenix, MD | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Eagle's Nest Country Club Main Site Navigation Who We Are Golf Amenities Membership Host An Event Join Now Host Event Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Golf Leagues Coaching & Club Fitting Game On Golf Lessons Crush It! Youth Golf Lessons Golf Course Amenities Racquet Sports Swimming Dining Membership Host An Event Weddings Events Meetings & Corporate Tournaments & Outings Event Rooms Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Who We Are Skip Image Carousel Our Team Calendar Directions & Hours A Treasure Built Over Time Founded in 1969 in the idyllic community of Phoenix, Eagle’s Nest is a private club with an inviting approach to the good life. From virtually every vantage point, sweeping views of Loch Raven Reservoir, towering trees and verdant golfing greens lend an air of majesty to the moment. And with each new experience, it becomes ever clearer that this is where you belong. Schedule A Tour Dawn Redwoods A Tale of Rare Beauty Our Club is home to about 75 dawn redwoods — one of the largest collections outside of China. Once prevalent throughout the Northern Hemisphere, these trees were thought to have become extinct until 1941, when a Chinese forester in the Sichuan province discovered more than 1,000 trees that had somehow survived. The trees at Eagle’s Nest are likely very close descendants of those discovered in China. How did so many of these magnificent trees find their way to Eagle’s Nest? According to Jimmy Watson, our first club president, his brother Bobby is to thank. “A nursery in York, PA, wanted to clear an area,” Jimmy explained. “So they said to Bobby, ‘Take ’em all … $1 apiece.’ They were the size of a broom handle. My brother and Roy Albin planted all the trees after work.” With that small investment roughly a half-century ago, another priceless attribute of Eagle’s Nest was born. \"Glad I chose the Club for this event...Management and Chef's execution exceeded my expectations. Bar service excellent and the wait and service staff were also wonderful. As it should have been...it was a fun and comfortable night for me, my family and our guests\" Patrick Ellis Regional General Manager Contact Me Contact Me + Close Patrick Ellis information modal Patrick Ellis Regional General Manager Serving since 2025 Patrick.Ellis Patrick.Ellis Contact Me Contact Me David Benson Membership Director Contact Me 410-469-8123 Contact Me About David + Close David Benson information modal David Benson Membership Director Serving since 2023 410-469-8123 David.Benson 410-469-8123 David.Benson Contact Me About David David Benson brings many years of Hospitality and Club experience. Most recently, David comes from Arcis Golf, where he served as Sales Director responsible for membership, private events, and tournament sales. His goal as Membership Director here at Eagle’s Nest is to “continue the growth of Membership by building relationships with new guests and most importantly our current Members.” David is thrilled to join the team and help contribute to the outstanding Member experience Eagle’s Nest has to offer Contact Me Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Golf Amenities Membership Host an Event Contact Us Eagle's Nest Country Club Opens in new window 12801 Stone Hill Rd Phoenix, MD \r\n                                21131 1 410-252-8484 ClubCorp on facebook ClubCorp on twitter ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    },
    {
      "url": "https://www.golfgoldeneagle.com/contact",
      "text": "Contact — Golden Eagle GC GOLF Course Info Rates Memberships Scorecard Proshop Aerial Flyover Photo Gallery Golf Simulator Donation Request e-Club Outings & Events Lodging News Golden Deals Contact Book a Tee Time GOLF Course Info Rates Memberships Scorecard Proshop Aerial Flyover Photo Gallery Golf Simulator Donation Request e-Club Outings & Events Lodging News Golden Deals Contact Book a Tee Time Contact contact us Golden Eagle Golf Club P O BOX 279 16146 West Eagle Lake Road Fifty Lakes, MN 56448 We look forward to hearing from you! Complete the below form to contact Golden Eagle Golf Club,  call us at 218-763-GOLF (4653) or toll free at 866-316-4653 You may also email any questions to: aaron.johnson@svn.com Name * First Name Last Name Email Address * How May We Help You? * Phone * (###) ### #### Thank you! receive updates all season long Subscribe Connect with Us: Facebook | Twitter | News | Instagram Back to Top Privacy Policy 16146 West Eagle Lake Road, Fifty Lakes, MN, 56448, United States | Golden Eagle Golf Club | P.O. Box 279 16146 W Eagle Lake Rd Fifty Lakes, MN 56448 218-763-4653 Managed by SVN | Northco Website & Online Marketing Powered by TwinCitiesGolf.com"
    }
  ]
}